{"aggregateRating": {"reviewCount": 44, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-18", "description": "Out of all the eateries, this place looked good and different. We had the beef jianbing. It was extremely dry. You need a cup of water next to you when eating this or you'll chokeee haha. They need to add a sauce on the side or something. Beef was bland and the crepe itself was no where near moist. Skip this place.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "Totally delicious, but suuuuuuuuper slow. Delicious, crispy, savory awesomeness. Every bite had something spicy, something crunchy, something delicate, something meaty.  Loved the snack, but why oh why do they only have 2 people preparing these? It took 15 minutes after ordering to actually get the food, and we ordered before the lunch crush even began. I can't imagine how bad it got later. \n\nPut up a board to say where you are in line, get the market to fix the Wifi and text folks when their food is ready, get the buzzing hand held notification system or get more people cooking! These are delicious and I'd be happy to come again, but not if the wait is as eternal and mysterious as it was on our first visit.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-07", "description": "a little expensive honestly even though it was pretty good the price is a little hard to justify so I could only budget this place for special occasions even though I wish I could go more often", "author": "Serena W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-06", "description": "The two people who currently work here are incredibly rude. With no one else's ahead of me in line I waited 10 minutes to get someone's attention--- and the guy turned around and started talking to his friend when I was obviously waiting to order. I just decided to leave after 15 minutes of no service. Not to mention they blast the same song over and over.", "author": "Madi G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-13", "description": "For the price, and the fact that there are a multitude of other great options in DeKalb Hall, I would steer people away from Jianbing. \n\nI got the crepe with tofu (the #1)- interesting flavor profile, but with an overabundance of scallions and not much else. The tofu was supposed to be ginger glazed and I hardly tasted that. I also thought that the crepe needed more things on it- it felt bare for a $14 total price tag. I didn't hate the food, but I definitely will not be going back for seconds. And I am still astonished at the audacity of charging $14 and putting a C+ effort into presentation and delivery.\n\nTry something else.", "author": "Aly S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-22", "description": "Food was good, but the girl helping me order was standing next to me eating chicken wings. Before she typed the order on the screen for me she licked her fingers, then went behind the counter and made my food with gloves, but without washing her hands.", "author": "Talia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-22", "description": "I do not recommend ordering delivery from Jianbing (or even visiting it while at Dekalb Market given that there are many superior options). Ordered delivery on seamless about 90 minutes prior to the restaurant closing with a delivery time estimate of 30-40 minutes - seemed reasonable to me. After waiting the full 40 minutes and receiving a notification that my order is on the way, I get a call from seamless that the restaurant canceled my order because they were closing. Why wait the full time if they were going to cancel the whole time? Let me know if you find out.", "author": "Aamir R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-04", "description": "Giving two stars to give benefit of the doubt...\n\nThis was borderline inedible... I'm the type of person who wants to eat the leftover food from other people's tables, and I could not manage to finish this. I ordered the beef jian bing and about 50% of the meat was pure fat. The beef was incredibly salty, greasy (literally leaking out through the container), and otherwise, not very flavorful. This was made worse by the overwhelming amount of sauce smothered inside - I recommend others to ask for only a little of it.\n\nOne jian bing + a water bottle came to over $16... Completely not worth it.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "I just had my first visit here to try the classic Jianbing with 13 spice pork. It was a very light yet crunchy wrap with quite a bit of flavor. Definitely would recommend for those who are curious. The service was also quite quick and the staff are friendly.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-11", "description": "Flavor wise, pork and beef are very similar, both pretty good, chicken is a meh. Portion wise is very inconsistent, I've had it at least five times, sometimes the filling fill up the entire \"jidang bing\" while sometimes it's only half. I do not understand why the difference is that big. I'm not the only one who notice this, several friends of mine also had the same experience. Sometimes, there's sauce on the bing while sometimes sauce is on the side. Most of the time, the bing has really good texture, however, the one I had today was extra chewy, the dough was not \"relax\" enough I'll say. Overall, the quality is not very consistent. It's like buying lottery, I'm not sure if I'll get the good one today. So, good luck people!", "author": "Caitlin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Came here after class. Ordered the Jian bing with pork and mild heat level. First time ever trying it and I loved it. I've had a scallion pancake but not with the extras. Definitely loved the additives. The food was well seasoned and flavorful. If this is inspired by Shanghai street food... I need to make a trip to Shanghai and get the authentic version. Very filling and I'm excited to try other options.", "author": "Erika M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-25", "description": "I really loved the workers here but the food is just not my jam. I decided to trot down to the DeKalb Market Hall a couple weeks after it opened. It's a really rad venue and I've since heard a lot of my friends rave about JianBing, but what I ordered just didn't do it for me. I got the JianBing with beef. The good: The crepe is thin and crispy, the scallions are fresh and nice. The really neutral: Where is the deep flavor? There was a little bit of spicy sauce which is mainly spice with little flavor. I hardly remember the beef; it was just something I had to get through to finish the meal. Will I be back? Maybe. I'll definitely order something different next time, but I wasn't too satisfied by the combination I got the first time around.", "author": "Clarissa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "I see a lot of negative comments about the history of Jianbing and how it is not authentic. I just wanna say it is just a variety of Jian Bing 煎饼 (whether it's shanghai style or Beijing style or even wuhan style)，if u want your authentic then please go Shan Dong，China 山东 (the origin). If you have that hater energy why don't you post yelp all over America about orange chicken, general tso chicken? If u think it doesn't match your authentic taste, then don't you open one? \n无论是上海style还是北京style都不是authentic啊 山东才算啊 所以我觉得没必要这么较真 你口味高你开一家吧 喜欢就支持一下 不喜欢旁边转角有拉面", "author": "Max J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "Relatively uncommon street food for NYC that tastes good and authentic: thumbs up. Exactly 6 pieces of eggplant in my $4 side order: thumbs down.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "Love this authentic Shanghainese location at the Dekalb Market Hall. For full disclosure, I've never been to Shanghai specifically, but the ingredients and whole set up was worth the hype. Staff was friendly and meal was tasty.", "author": "Carlo K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-31", "description": "Not authentic at all and super overpriced. If you're like me you shelled out the money in the hopes that it would channel that amazing Beijing street jianbing flavor of your memory... NOPE. Not even close! Plus it's $14.50 after tax?! Well put those two together and this is the least Chinese establishment I've been to.", "author": "Caylee G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-12", "description": "GOOD BUT NOT WORTH THE PRICE\n\nAfter going to Dekalb Market Hall several times, my wife and I decided to finally try Jianbing.  We each had a Jianbing, mine with pork and my wife's with tofu.  We also ordered a side order of the vegetable of the day - stringbeans.  Both Jianbings were good. They were tasty but there wasn't much filling.  There wasn't enough of anything for the price.  There was only a couple of tablespoons of pork or tofu, not much scallion or cilantro.  The side order of string beans was also very skimpy.  \n\nSo while the food tasted good it was hardly worth the $32 that it cost. It would seem as though the cost of the ingredients is very small and that Jianbing could easily double the amount of filling or vegetables for pennies but instead chose to save those pennies.", "author": "Clifford F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-23", "description": "Got the scallion pancake with tofu \"medium\" spicy and it was truly almost inedible. The amount of spice was ludicrous. Their version of medium is definitely not \"medium.\" For an $18 meal, I was disappointed.", "author": "Karen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "One of my favorites at the new City Point food court. Jianbings are the bomb! I always get the classic, crepe-style with an egg. Medium spicy. It's a great filling meal with a truly unique flavor and taste. I brought a friend here once and we shared one (chicken + egg) -- it wasn't enough and she went back and got her own. I'd say that's a positive review!", "author": "Katie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "I feel bad for this rating but in all honesty, this place is painfully bad.  Specifically because I think it loses credibility but real jian bing. First of all, jian bing is not from Shanghai, it's from northern China, originally Shandong, but northern at the very least.  It's one of my favorite street food/breakfasts.  What I had was super bland, dry, flavorless - I rarely deem something not worth finishing, this was one of them.", "author": "Fran W."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Jianbing Company", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/BEBStMZIwNjZPq6M4rpp6A/ls.jpg", "@type": "Restaurant", "telephone": "+19293682763"}