{"aggregateRating": {"reviewCount": 44, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Absolutely declicious - savory, crunchy, and sweet at once. If you want to try something new for a change, skip the mini burgers and tacos and go for one of these jianbings. \n\nThis would be perfect for lunch or when on the go - alas, if only I worked closer to the market. I had the lemongrass chicken and thought it was a nice touch. It's not like the jianbing was ready instantaneously after we ordered, but that's just the price you pay for watching them make it fresh, right in front of you.\n\nIn other news, Dekalb Market needs to improve their cell service, fast!", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-22", "description": "Note to self: this is not jianbing as you remembered it in beijing. Don't get it next time you're here. You got the scallion one with the fives spice pork. Too much raw onion on top. The sauce was too salty- and there must have been a lot of MSG in it because you downed a whole liter of water after you got home from the movie.", "author": "Justin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Very tasty and unique. I ordered the jidan bing, which is a sort of taco made from scallion pancake filled with your choice of meat and assorted vegetables. I ordered pork medium spicy and was pleasantly surprised by both the quantity and quality. The meat was juicy and full of flavor while the scallion pancake was fresh and crispy. Definitely stopping by here again on a future trip to Dekalb Market!", "author": "Dariusz L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "This is one of my go-to spots in the new market. I've been here six times so far and have always been pretty happy. I'm not qualified to speak on its authenticity, but my native-Chinese friend I was with liked this place a lot.", "author": "R C."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Jianbing Company", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/BEBStMZIwNjZPq6M4rpp6A/ls.jpg", "@type": "Restaurant", "telephone": "+19293682763"}