{"aggregateRating": {"reviewCount": 44, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "I'm grateful for colleagues that force me out of my comfort zone, for I would've never discovered this gem!  I came to Dekalb Market for lunch with a co-worker \u0026 he challenged me to try something new. I tried the chicken rice bowl. Comes with purple rice, scallions, pickled onions and your choice of protein, vegetable and spice. I always get the string beans, but the Woman that was there the last time I went wanted me to try something different. She gave me some bok choy on the side and now I get bok choy and string beans. Lol. \n\nWhile I've never had authentic Shanghai Street Food, if it's better than this, I can't wait to try it!", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-18", "description": "Wednesday 4/17/19 6:00pm\n\nBrought my mom to Dekalb Market and we both decided on ordering at Jianbing. There was no line, but the cashier NEVER looked up from his phone as he was taking our order. Scrolling with one hand and typing in our order with the other. Afterwards he mumbled '5 minutes', when I repeated it back to him to clarify he responded with '5 minutes!' In an annoyed manner, while still never looking up from his phone.\n\nLook, I'm not looking for top quality service from a vendor, and as I work in the service industry myself, it takes a lot to irk me. But next time, take a second away from Instagram to look your customers in the eye. \n\nThe girl cooking our food was great. She's really shouldering the workload at this stand", "author": "James M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-06-01", "description": "Honestly I would change this into a four star review if they got better service. It's a hit or miss depending on who makes your food. It's also a hit or miss as to who takes your order. Some employees are really rude. Others are rather kind \u0026 attentive. The number of times I've gotten burnt or undercooked crepes is too many to count. I tell them not to put pickled mustard root and sometimes I get it anyways. But I keep going back cuz when they get it right, it's delicious.", "author": "Tanya T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-11", "description": "Really hit-or-miss depending on who makes your food. I've had some that were mouth-watering and spicy and left me wanting more and I've had others that were dry like cardboard. Pork is the protein to go with, otherwise find somewhere else to eat.\nThe price point is where it really hurts. Everything in DeKalb market is pricey but $15 for a 'bing when they're less than $2 all over Shanghai just leaves a sting in the wallet. That being said, I don't know of a place where you can find one for less, so I do hope they stay around.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-03", "description": "I've never been to Shanghai, so I can't speak to the authenticity of this street-food stand.*\n\nBut I can tell you that I don't really care about its authenticity, because if you get the hoisin-lime beef (or the 13-spice pork**) wrapped in a scallion pancake, that thing will taste damn good. The crispy wonton cracker sheets crumbled in provide some much needed texture, and the overall effect is excellent.\n\nPersonally, I prefer the scallion pancake to the original jianbing crepe...in part because it's a more substantial meal for the price (I imagine that people aren't paying $14-$15 for one portion in Shanghai). Also, it's been a bit more consistent than the occasionally soggy crepe. That said, the crepe is a lot more fun to watch being made (if there's a few people in front of you, know that it's gonna be a wait, as they can only make one at a time). \n\nIf you find yourself in Dekalb Market Hall (or a Smorgasburg somewhere), give it a shot. Beats having tacos for the 38th time. \n_____________\n\n*I'm not sure what it says that my mom conversed with the dude at the fried pizza stand in Mandarin, and I talked to the (very friendly) guy here in English. \n**The lemon-garlic chicken is solid but not my favorite, and let's not even discuss the tofu.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "There are so many places to choose from at Dekalb Market Hall that it may spin your head. I wanted something \"different\" and the Shanghai street food offering here sounded interesting, so I went for it. My order consisted of the Jidan Bing (Scallion pancake, egg, romaine, scallion, cilantro, house hoisin sauce, chili sauce, and choice of protein - I opted for chicken) with hot sauce. I also got the combo meal and got the Stir-Fried Green Beans and a bottle of tea.\n\nThe Jidan Bing was good but I have to say that the hot sauce was about twice as hot as I was expecting (yeah, I should have maybe asked before opting for that) and it really stung my tongue, so I don't think I fully appreciated the flavors that I otherwise may have. It still hit the spot and I liked the different textures and temperatures of the various ingredients. The beans were good and, thankfully, not the typical side item you would usually get with combos. Pricing wasn't cheap (esp when you think \"street food\") but it's not a huge surprise when you dine at a shopping center.", "author": "Godley V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "Not a bad place to try out if you have the time to wait around. I waited about 10 minutes to place my order as there was only two people working making the food which is clearly not enough people to be operating the stand. After I placed my food in, the wait was another 20-30 minutes because about 5 other orders were placed ahead of me.\n\nIt takes this long because everything is essentially made from scratch. I ordered the first option which was called Jian Bing with spicy pork and spicy sauce as a meal which came with a drink and one of the three listed sides (I choose the green beans). You can watch them make the crepe from scratch, then add all of the other toppings. The green beans are made on the spot when someone orders it. You can see them take out the green beans and stick it in the fryer, then sautéed on the grill. The food, side, and drink all came out to about 20$ which is pretty much standard price at the Dekalb Market and everything here is expensive.\n\nOverall, it's pretty good food. I just don't have time to wait around all day for them to make the food.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-06", "description": "Not authentic at all. I mean I guess I should've guessed? No one working there was even asian to begin with. Technically this is a 1.5 star review because the staff member came off really rude when I was asking questions before ordering - I was also the only customer because it was still early. \n\nI got the jidan bing with beef, after tax it was practically $15. I got this one because I really wanted the scallion pancake shell. Typically at Shanghai restaurants, the scallion pancake with beef inside is delicious and mouthwatering. This was the opposite, the scallion pancake had ZERO taste - it's a sad and unfortunate to the Shanghai culture. At least the beef was well cooked and somewhat tasteful (I got medium spicy so it masked a lot of the taste). The sauce the beef was in was somewhat vinegary, might be due to the onions on top and they also give a side of hoisin sauce on the side. \n\nI would not be coming back for overpriced, tasteless Shanghai food. The portion wasn't too big or too small.", "author": "Leona L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-13", "description": "I walked through DeKalb Market Hall \u0026 was thrilled by all the ethnic choices.  I came upon Jianbing \u0026 decided I'd give this a try for lunch.  I got the #2 with lime hoisin beef \u0026 a side of fried eggplant.  The lime hoisin beef was good, but probably not worth the $13 price.  The side of fried eggplant however is a different story.  The eggplant was incredibly excellent!  The worker pulled out a fresh, small Japanese eggplant \u0026 sliced it up.  He then fried it for a short period of time, then threw it on a grill \u0026 stir fried it with a bunch of tasty sauces \u0026 seasonings.  This side dish was better than the entree, lol.  Next time I'm at the hall I'll likely try an entree from a different vendor, but I'll for sure be back for a side of eggplant.", "author": "Alan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-23", "description": "I passed by Jianbing Company at one of their food stands in Smorgasburg. I was attracted to it by the aroma emitting from their stove tops. I am glad that I stopped by and ordered one of the beef jianbings. It had quite the kick and the really flavourful. The crepe did get a bit soggy from the oils from the chilli sauce and beef, so I had to eat it rapidly. Definitely eat it fresh off the crepe stove top!", "author": "Jem S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "This is definitely the first Shanghai street food establishment I've been to in New York, so that's cool that DeKalb Market Hall is bringing new cuisines to Brooklyn.\n\nThe way it works is you choose a base, a meat, and then a spice level. They offer three options - jianbing (crepe), jidan bing (scallion pancake), or a rice bowl. In terms of protein, they have lemon-garlic chicken, hoisin-lime beef, 13-spice pork, smoked bacon, and honey-ginger tofu.\n\nWent with the jidan bing with pork. They warned me that hot was extremely hot, so I went with medium, which was the right choice.\n\nThe scallion pancake was thick and folded over, so it was more ike a taco. Two pretty big portions. All told, it was $14.15 which is a little pricey, but enough for two people to share. Definitely worth trying out if you want to try something new.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "I came here the other day during my bimonthly trip to dekalb market hall for groceries (there's a TJs inside!). I had been eyeing the place for quite some time and I decided now was the time to give it a try. And boy am i glad I did! It immediately catches the eye as you watch them prepare the jianbing (shanghai savory-filled crepes) on the circular flat top and sprinkle in fillings as it cooks.\n\nI got the chicken-filled jianbing and paid an extra $2 to get an extra egg in the crepe and some shanghai pickled vegetable. Overall it came to $15 which is a little pricey, but it was certainly a lot of food and they give you a free jianbing after you purchase 10. They layer the crepes with tons of cilantro and you get to watch them prepare it before your eyes which makes for great instagrams and Snapchats for all you social media moguls. The crepe exterior is crunchy and the filling is tender and expertly seasoned with a sweet and salty sauce that brings it all together.\n\nOverall, a great place for lunch or dinner and I will absolutely be coming back soon! If you're heading to Dekalb market hall you don't want to miss this food stand.", "author": "Sam E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-08", "description": "***2.5 stars***\n\nI had the Jidan Bing (scallion pancake sandwich) with beef and a side of green beans.  Overall, it was just ok.  I ordered it \"hot\" since I like things spicy; however, there was so much chili pepper that it masked the flavor of everything else.  The green beans were also not quite what I expected.  The meal wasn't bad, but, given the other options surrounding it, I'll likely give someone else a shot next time.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "I thought I was going to order the crepe style, but the scallion pancakes sounded so good. \n\nI got the scallion pancake base with beef, which I thought was a much better deal. (I also got Mild sauce which still has a spicy kick to it but definitely manageable.) \n\nI loved the scallion pancakes because of their texture and crunch. (The crepe would have been thinner and lighter.) The beef and toppings were so flavorful, and the egg was a great addition. \n\nThe staff was also very friendly and accommodating even though it was during rush weekend work hours. The wait is not that bad so don't be overwhelmed. I maybe waited for 7 min max.", "author": "Mai P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-07", "description": "HINT: It really depends on who makes it for you.\n\nI've had the Jianbing at this location countless times. In all honesty, I've got to say that it's nothing like the Jianbing I had in Shanghai. However, if you need to get the craving satisfied, it's worth a shot. Delicious Jianbing consists of a crispy outer wrap, lots of sauce and a generous portion of crispy fried wonton sheets. The flavor here is on point. However, they lack generosity in sauce as well as wonton sheets. I felt almost cheated when I saw how the size of my Jianbing was half the size of the ones I had in Shanghai. Also, the texture of the outer wrap is very inconsistent depending on who makes it. Of the times that I've been here, the guys have made crispier wraps. The ladies however, make the messiest wraps that end up falling apart. \n\nMy go-to Jianbing here is definitely the 13 spice pork!\n\nTip for the staff: Leave the batter on the crepe maker longer! Otherwise, we end up with soggy Jianbings... a big nono!", "author": "Qi G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-07", "description": "I frequent Dekalb Market Hall often, as I live a block away. I've tried roughly half of the food stalls here and wanted to try Jianbing for the first time today, but couldn't. \n\nWhy you ask?\n\nBecause they don't accept cash. \n\nPolicies like these are discriminatory.\n\nSo, I went to Han Dynasty instead and had a great dinner for about the same price.\n\nAfter reading the reviews of Jianbing, maybe I dodged a bullet. Everyone says it's not close to authentic and dry AF. \n\nDefinitely never trying this place and never would encourage anyone else to swipe a credit card here.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "Cool place at the food court in DeKalb market. I got the Jian Bing crepe, spicy with chicken and extra egg. Its a good snack but not too filling for a full meal.", "author": "Vishal P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "You get drawn in by the artistic flare with which they prepare the Jianbing (four grain crepe, organic egg, too much scallion, way too much cilantro, 13 sauce, chili sauce, and cracker) and the pleasant staff. You add a protein to the mix - I opted for the 13-spice pork - and they're off preparing the appropriately thin crepe.\n\nThe process takes some time, but it is pleasant to watch if you can spare the five minutes.\n\nAll in all, the Jianbing is decent. Worth a try, but I won't be doing it again. It just wasn't that exciting of a flavor combo in the end.  Too much of the cilantro flavor, not enough of the protein flavor (though the pork was juicy).", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "I was born and raised in Shanghai and Jianbing used to be my favorite childhood breakfast. Crispy wonton sheets with the sweet chili sauce would make me voluntarily jump off my bed. This place, as a lot of the reviewers mentioned, serves non traditional Jianbing, in the sense that it allows you to add protein other than just regular eggs(explaining the higher than Chinatown special price tag of course). It's an excellent twist and you can tell that they care about the stuffing they pre made. The beef and chicken are my go to with the right amount of seasoning and juice. One suggestion though, more crispy wonton sheets would make the Jianbing taste even better!", "author": "Yunyue W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-13", "description": "I have to say I was disappointed. \n\nI didn't expect this to be authentic by any means - as real Chinese Jianbing is not a Shanghainese street food to begin with (again I can confirm this because I am Shanghainese); it was originated from and is most popular in northeast China. But I was curious to see if they can make a tasty adaptation/fusion food at least. However, again, I was disappointed. \n\nI ordered the Pork Jianbing, which costs 13 dollars, which is kind of absurd, especially if you market yourself as street food. I think this is the common problem for the entire Dekalb Market. \n\nThe front desk cashier looked like she clearly did not want to be there, and the food took a while  - only one person was making the Jianbing. As for the Jianbing itself, the flavor is not there at all. Sauce is very weak and they didn't put enough. I didn't taste any sauce or flavor for at least 75% of my Jianbing - took one bite, tasted nothing, took another bite, still nothing. Pork was flavorless, literally there is no taste besides the porky taste. I really don't know how they can call the pork 13 spice pork. \n\nI totally support doing a \"hipster\" version westernized food to raise awareness of delicious Asian food. But please make it tasty please, like Panda Express ;)", "author": "Shirley Z."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Jianbing Company", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/BEBStMZIwNjZPq6M4rpp6A/ls.jpg", "@type": "Restaurant", "telephone": "+19293682763"}