{"aggregateRating": {"reviewCount": 146, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "Tiny, corner restaurant in out of the way location but worth it if you wander in. Open kitchen with brick oven so you can see your food being prepared. Clean! Pizzas are pricey but so yummy with fresh ingredients. Cozy, unpretentious atmosphere. Super accommodating and friendly staff. Kid friendly :) One star less due to cash only policy.", "author": "Shoot From The Hi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "As of this writing the place is new. They are still waiting fora liquor license to serve beer/ wine. The pizza is delicious, the staff friendly, and the place is clean. I'd recommend this to someone coming to visit NY Bethel or just in the neighborhood and wanting a good bite to eat. It will be better when a person can get a beer with their pizza.", "author": "Adam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "wonderful. next to bridge. Brussel sprout and mix green salad was amazing. service great. family atmosphere. awesome.", "author": "Tony D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "Yesterday, for a company whose ages ranged from 79 to 4, we ordered 5 different pizzas - one gluten-free for a seriously celiac teenager -  from Love \u0026 Dough, which is only blocks away. They were all just great. In less than a week, L\u0026D definitely has its act together. Not that I'm surprised, as its sister restaurant, Archway Cafe, is a fine eating place (best chicken Caesar in the city).", "author": "Michael M T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Love \u0026 Dough", "address": {"addressLocality": "DUMBO", "addressRegion": "NY", "streetAddress": "57 Pearl St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/y_KOhgKsZxhY2G38MzXRig/ls.jpg", "@type": "Restaurant", "telephone": "+13479873404"}