{"aggregateRating": {"reviewCount": 146, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "The name is alluring enough to warrant a visit to this brand new Neapolitan haven in DUMBO, and we found that both love and dough fly out of the kitchen in massive and gratifying portions.  The staff have a knack for hospitality and warmth, and they wrapped us in their well-tuned version of a great big hug from the very beginning.  Granted, a restaurant just starting out has extra reason to roll out the red carpet, but here it felt just as authentic as the award-winning pies.\n\nThe decor blends DUMBO-appropriate industrial aesthetics with the homeyness of an Italian living room, and here the kitchen is wide open and dominated by a gorgeous real-deal pizza oven.  It was especially pleasant to have most of the place to ourselves, although once the word gets out there will be throngs.\n\nThe menu is split between red and white pizzas and a handful of calzones, along with an impressive selection of salads, cheeses, small plates, and charcuterie.  We settled on a salad and a calzone, one of our favorite permutations of pizza dough that is also distressingly difficult to find.  \n\nThe salad had a potpourri of fresh and flavorful ingredients that mixed and matched well - spinach, farro, goat cheese, raisins, and pistachios.  The portion was generous and it was light enough to set the table for but not overwhelm the forthcoming calzone.  Our calzone was both delicious and a work of art, as the dough was folded and rolled over and around its contents (sausage, spinach, and ricotta) without being fully enclosed.  It also managed to be amazingly dense and substantive without being heavy or oily.\n\nWe were full enough to forego dessert, but alas (happily) dessert did not forgo us.  With the owners compliments, the kitchen produced perfectly light and creamy vanilla panna cotta with a citrus caramel drizzle, a very nice way to end.\n\nLove and Dough is a delightful neighborhood spot that will only get more enjoyable at the owners add new menu items (as they have said they will) and as the alcohol license takes effect next month.  Buon Appetito.", "author": "Derek W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Great customer services! Yummy food!! Fresh taste no grease!! Love the ambiance. Will come back again.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Walked around and finally came across this awesome little pizza spot right next to the bridge. I started with the Brussel Sprout salad it was yummy and perfect. It included spinach, pine nuts, and a balsamic dressing. It wasn't too heavy. \n\nOrdered the Gluten Free Suppresetta(hope I spelt it right) and it was the perfect balance of spicy and sweet.\n\nHighly recommend.", "author": "Brittany D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-14", "description": "Owner (Arthur) was rude to both customers and staff. Uncomfortable environment seeing employees being treated that way.\n\nCash only (seriously, it's 2016...)", "author": "Edwin J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "What a great little spot in the Dumbo section of Brooklyn.  Service was terrific, the pizza that we ordered was cooked perfectly, tasty sauce, great cheese.  One of us had the meatballs and they were spot on.  Would have been 5 stars but one big problem is that the place is cash-only, and there is no sign on the door or anywhere else saying that.  And we made sure to double-check after we were told.  Need to make that clear on the front door.  Other than that one oversight, terrific place.", "author": "Lou C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-25", "description": "They don't have water just sparkling us they won't allow you to use their restrooms unless you purchase something", "author": "Jackie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-20", "description": "Great location, with below average service! We didn't get what we ordered and food was average at best. Don't forget this is a cash only place, not listed anywhere on the door, small print on the menu that can easily be overlooked!", "author": "Joe L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-28", "description": "They got our orders all mixed up and there is not one word about it being CASH ONLY until you get the check.  Nothing at the door, nothing on any sign, nothing on the menu, but when you are presented with your check you are told you can only pay in cash.  If you order beer or wine they bring it to you in a paper cup from next door because they don't have a license???  Some of our pizza was so undercooked and soggy that you couldn't even pick it up folded.  Some of our pizza was so burned you couldn't fold it.  Will not be back.", "author": "Andrea S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-09", "description": "Pizza is good. But felt the pie size is small for the price they charge.  Salads around 12..Big negative, they only take cash but it is not obvious via any notices in the shop..I was lucky to have some cash and save me some embarrassment. Also they charge 20% tip included in the bill so be aware..I was going to leave tip money before I realized.", "author": "Jai B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-07", "description": "Poor service, pizza overcooked, no sign \"Only cash\" that's suspicious... evading taxes..  and plus if I ask for wine or beer they bring in plastic cup???  Bad points, evading taxes and selling liquor without licence...", "author": "Alexxx H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-30", "description": "I ordered delivery from Love and Dough.  I ordered a pizza with sausage and mushrooms and an order of lasagna.  The lasagna was 3\" x 3\" square and very flat.  The lasagna cost $14.  Outrageous price for such a small taste.  It wasn't even too good.  It was your basic lasagna with not much in it.  Then the pizza; it had 6 slices in it.  Pizza was like a personal pan pizza.  It was again basic and unmemorable.  It cost $16.  Those prices for such extremely mediocre and small portions will make me look elsewhere the next time I am in the mood for pizza.", "author": "Wilson L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-26", "description": "Summertime and it's impossible to get into Juliana's, so looking for new place in Brooklyn Heights/Dumbo. Love \u0026 Dough was not too busy on a Sunday afternoon. I had the Margherita pizza and a couple of Brooklyn Lagers. Pizza was okay. Sauce was a bit salty, but not deal breaker. Cheese was the usual pizza-parlor mozzarella that you get in the $1 a slice places. Crust was excellent, so that saved it. Odd place in some ways. Server had to step outside to get my beer -- which was poured into a paper cup. I had no idea where she went to get the beer and yes, they serve beer in paper cups. Quest for Juliana sub continues, I wish Sociale on Henry Street would make pizza.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "Update the menu prices and waitress needs to be a little more courteous..pizza is amazing though ,3 stars is all for pizza ,actually it's 5 star pizza but service is taking it down", "author": "Tooba M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-02", "description": "I cannot explain how degrading and horrific my experience was and how badly I was treated by the OWNER of this business. I almost never write reviews, but I have never left a restaurant in such energetic disarray. I was confused at first at where his rudeness was coming from, or why was it directed at me, but then reassured that this owner is just in the wrong, period. Pizza was nice, the staff was friendly and kind, he on the other hand was disrespectful, rude, condescending and above all not compassionate. I will not support any restaurant this man owns, first as a woman but then as a human. I cannot believe people like this are in the service industry. You cannot treat customers like this and expect to be successful in the long term. May you learn that in life, you should treat people the way you would want them to treat you.", "author": "Voyager Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-08", "description": "Other low-star reviewers are right: don't go here if you want quick, affordable and/or attentive service. I attempted to order a pizza to go, because I'd seen other people leaving with boxes and they seem to encourage it with a counter, cash register and stack of menus. \n\nPaid $17 cash (they only take cash) for what would be a small pizza at a typical place. Anywhere I tried to wait, they seemed to think was in the way, even though the restaurant was just half full. Finally I sat down at an empty table, waited 30 minutes, watched them serve people who came in after me. I only got my order when a manager noticed me waiting and asked the server who had originally taken it about me - at which point they fished out a boxed pizza from behind the counter, where it had been sitting for who knows how long. It was lukewarm when I ate it. It was fine but by no means $17-for-a-smallish-pizza good. And a pretty disappointing first (and last) experience.", "author": "Bryan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-06", "description": "The place was charming and the guy who runs the place seems to be a nice dude. But the portions were strictly awful. I got the lasagna and it was $15 and was tiny. The pizzas were equally tiny. Food was solid but overall very little bang for your buck. And the guy gave me attitude when I asked for a simple request.", "author": "Jon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "One of the first pizza places I've went too in Williamsburg. The pizza is good, but small however. I'll remember this place in case I don't feel like waiting at Grimaldi's! Must try the chocolate pizza!", "author": "Arthur D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-13", "description": "Great food and drinks, however the service was awful; the staff is extremely pushy, rude and rarely checked in. Having gone between busy times (there were only 3 other tables and 3 waiters) I expected much better service. Oh it's cash only, but they won't tell you that until you get the check.", "author": "Dmytri J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "Good food, fresh ingredients and nice presentation. Kind of annoying that it is cash only when there is little (I.e. No)  signage or reminders by staff when you sit down. Otherwise a decent alternative to the craziness of the other popular spots in the area.", "author": "Jeremy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "We got take out (Seamless!) here and absolutely loved it! We opted for the lasagna and margherita pizza and both were huge hits. Clearly very fresh, high quality ingredients but prepared in a very quick fashion. I have not visited the physical location but hope we can do that sometime soon! Great choice for pizzas and lasagna and hopefully next time, we will save room for the Nutella calzone!", "author": "Amanda B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Love \u0026 Dough", "address": {"addressLocality": "DUMBO", "addressRegion": "NY", "streetAddress": "57 Pearl St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/y_KOhgKsZxhY2G38MzXRig/ls.jpg", "@type": "Restaurant", "telephone": "+13479873404"}