{"aggregateRating": {"reviewCount": 146, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-04", "description": "We called and made reservations for a party of 16 at 5:30p.m. on Sunday March 4th to celebrate my granddaughter's birthday.  After arriving and being seated, we were informed that for a party of our size we would  be required to spend a minimum of 35$ per person, which we agreed upon. Then the manager called back the person who made the reservations  on the phone, who was in the restaurant, to inform us that he could not serve us because we were taking up half of the restaurant. What was puzzling is that the restaurant did not have ANYONE else in there and it didn't become an issue until we were seated. My granddaughter was very disappointed. We will never visit this place ever again and do not advise anyone else to either !!!", "author": "Edina L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-05", "description": "Avoid this place the pizza was cold and tasted heated and not fresh and the service was horrendous. It's small and it was practically empty and after tasting the pizza we understood why. Avoid your better if getting a frozen pizza and heating it at home.", "author": "Monique D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-24", "description": "The pizza satisfied the craving, and the salad that came with the lunch special kept me from feeling too guilty. I have a feeling the larger pizzas are better since the sauce kind of weighed down the mini pizza/made it soggy.\n\nGreat service, and they were patient with my having to step out to an ATM (cash only, ugh) and making suggestions based on my tastes. \n\nSemi-touristy crowd.", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "Great new place in DUMBO! If you don't feel like waiting in line with a bunch of tourists for Grimaldi's or Juliana's, pop over to Love \u0026 Dough. The restaurant is inviting and it's great for lunch or a casual dinner. Their kale salad is delicious! That may sound oxymoronic but it's tossed in a light cesaer dressing with parmesan so it's quite tasty.  I usually get their margarita pizza or if I am feeling naughty, their margarita with soppresata on top. Their soppresata gives the pie a little kick and definitely is more filling. The dough is divine. Slightly crispy on bottom, but the fluffy and almost doughy crust, is such a satisfying bite.\n\n** THEY DELIVER IN DUMBO! ***\nSorry for the excitement, but us Dumbo-ans struggle to find delivery that doesn't take forever.", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-29", "description": "CASH ONLY.\n\nUpon finding out Grimaldi's and Jul's pizza was over an hour wait. We decided to go for a 5 min walk to this location.\n\nTaste was there. \n\nHowever, everything seemed very unsanitary. \nThe guy making and baking the pizza would non-stop touch the dough and toppings after it was finished to re-arrange and make it look pretty \u0026 move to a serving plate.\n\nAfterwards the cashier (whom handles cash)\nwould then go over and put the prosciutto ham onto my pizza with his hands and almost smudge it into place. \n\nI was very disappointed with the serving size and price that they offered. \nI'm not sure if this area/location is a tourist trap price based pizza joint, but I'd never come back again. \n\nLove \u0026 Dough (~$20)\n\n\nBasically broken door making it already a hassle to enter and leave...", "author": "Isaiah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-24", "description": "We stumbled on this little neighborhood restaurant after walking over the Brooklyn Bridge. Small, warm \u0026 friendly with excellent small plates (beet salad and burrata w/ eggplant, both were delicious!)and thin individual pizza was very good too. Limited wines but reasonably priced- only criticism is it's cash only and no sign posted.", "author": "Patricia F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "No love here, they only want your dough.\n\nAlthough the pizzas really are great, I am giving this neighborhood restaurant 2 stars. They are expensive, cash-only - which they don't mention anywhere -  and have no reasonable alternatives for kids - not neighborhood friendly. I am a working professional and a mom and I decided to give this place a go for lunch on a Thursday with my 3-year old. I asked for a small portion of pasta with butter for the kid, but they explained that I would have to take a full-sized pasta dish from the menu at full prize - $16. Ok. So I picked one and asked for the sauce on the side so I could bring it home. He made a face at that. I shrugged it off.\n\nThe pasta came out, a dish with butter and parmigiano. Delicious, and the kid was happy. I looked in the take-out box to check the sauce. It was supposed to be a 'wild mushroom sugo with rosemary'. There were three tablespoons of red tomato sauce in the box. I asked the waiter about it. They said they had given me that instead - and here it comes - since I had asked for BUTTER on the pasta. I asked if this was still $16? And it was...\n\nSo although I love most of the pizzas, I will not eat out there again, but enjoy the food in the comfort of my home. A pity since DUMBO really need more neighborhood friendly casual places to go - for families too. Because we work AND live here.", "author": "Susanne C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "I actually really loved this place. It was small and quaint and the food was fresh, light and tasty. We got the INVOLTINO SWEET \u0026 SOUR sausage, pepper, onion, apple, hot honey Calzone to share. It was huge. It was the perfect balance. Not too salty, and not more cheese than crust or meat, or apples and honey. Sweet and savory, and crisp.\n\nThere isn't any chicken on the menu... odd.\n\nAlso, Our waiter was a little snotty. Nothing to be desired- although he gave us good enough service, We'd have liked to feel a little more welcome. It's something that can be learned right?\n\nI would have sat for some wine. Otherwise it was a cute place. We'd visit again. \n\nWalking distance from Dumbo and the Brooklyn Bridge hot spots.", "author": "Rosalin F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-06", "description": "The most disgusting service of my life. They spoilt my birthday dinner did not apologize and did not care. Refused to serve us food. We made reservations for a large party and when we reached they forced us to do a pre fix without informing us before and denied to serve us. The manager being even more rude. I don't think this place will survive for long. Please do not eat here and spoil your evening.", "author": "Sneha K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-27", "description": "I've eaten here 3 or 4 times. Overpriced, okay pizza. The service is lack luster. They try and scam you by being cash only, forcing you to use their ATM next door.", "author": "Banana B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-22", "description": "The food maybe good but unless you enjoy being treated like you shouldn't be someplace it's not the place to walk into.", "author": "Dennis D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-12", "description": "A small, quaint pizza shop in Dumbo that's got an identity crisis. \nUpscale prices for slightly above average pizza in a very casual restaurant. Cash only but they give you the bill in a credit card slot check holder. Relatively quiet but their takeout/delivery is slow for their own neighbors. \n\nOn average, personal sized pies go for ~$14 - splitting one between two people isn't enough. Salads are great and fresh but also cost as much as the pizza. The lasagna was okay - cheesy, fresh but overall unmemorable. \n\nKnow it's tempting to find a backup option for pizza when you're in the neighborhood but wait in line at Julianas or Grimaldis and you'll get a brick oven pizza worthy of your time and your money - and it'll probably cost less than eating here.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-13", "description": "Vegetarian pizza promising but arrived burnt\nSusspressa pizza sucks big time\nThis place is not worth the money and my time\nWill not come back here again\nNo wonder every place in dumbo has no seating or 2-3 hour wait and this place we walked right in and got a table immediately...big red flag\n3 pizzas and 1 calzone $80. And tap water to boot\nDid I mention it's overpriced\nOh well ... charge to experience\nAVOID !", "author": "Rod G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "The pizza here is inventive and delicious. Try the Sopressata!! which comes with red sauce, ricotta, cherries, and mint. It sounded a bit weird at first, but actually the salty sweetness really worked well together.\n\nAlso really enjoyed their signature pizza - Truffle Cream with Mushrooms on a white pizza. Very savory and smelled amazing!\n\nI'd highly recommend coming here for lunch. It's a bright, open, and inviting space with equally courteous waitstaff.\n\nPizzas are neapolitan and personal sized, although I think you'd have to have a really big appetite to finish a whole one on your own. Best to share so that you can also get a side of their delicious meatballs.", "author": "Vicky L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Love \u0026 Dough, why are you cash only? Honestly. And did we really need yet another pizza joint in the area? \n\nThe service was excellent, the love and dough pizza was INCREDIBLE. I accidentally put way too much hot oil on my slice and had quite the coughing fit, but oh, it was so so so so good. The kale salad had a ton of dressing, so I'd recommend skipping that particular salad.\n\nThe hot oil and love \u0026 dough pizza sold me. I've even ordered delivery since I live in the nabe.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "This place is shady.  We made a reservation days in advance for a party of 10.  3 hours before the reservation they called and said that for parties of 8 or more they require that you pay $35 per person for a fixed menu.  Ridiculous and you lost our business forever!", "author": "Brett B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "I love this place!  I live up the block and order from there all the time. Both the pizza and the calzone's are as good as I have ever had.   I have eaten at the restaurant a number of times as well and I find the service to be great as well.   I highly recommend the Rustic Pizza, the new pizza with eggplant, the \"surrpressata\", \"the naughty\" pizza, and the gnocchi.\n\nLet me end by saying that we had some people visiting us from out of town and they wanted to go to Grimaldi's because of what they heard.  Let me say that this place blows that away by far!!\n\nThey must pay some visitors guide because to wait in line for a place that serves you on a paper dish and has no booze is a joke!!", "author": "Jacob J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "My sister and I came here to have dinner on our holiday in NYC. The staff were so rude! The waiter didn't even look at us, mumbled \"take a seat\" and chucked the menus at us. We felt as though it was a huge inconvenience for us to dine here. We then noticed at the bottom of the menu that they don't accept credit cards. We asked the waiter and again he mumbled grumpily that there was an atm nearby. After feeling as though we were unwelcome we decided to leave because why would we pay someone to make us feel terrible and uncomfortable. Thankfully we came across the Atrium and had lovely service. I don't know about their food at Love \u0026 Dough because we didn't even get that far.", "author": "Lisa K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-10", "description": "Pizza was solid. Orders arrived fast. \n\nGreat ingredients. CASH ONLY is major bullish!t though. It's 2017 let's go. I'd happily pay the transaction fee.", "author": "Everett B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "Came to dumbo on a Sunday starving and this place hit the spot. \n\nHypes:\n- Small quaint little pizza spot in the heart of dumbo that has yet to blow up with long lines and waits.\n- Pizza comes out timely and superfresh, with fresh toppings, not soggy on the bottom, and was devoured in minutes\n- We ordered the Soppressetta!!! (which also comes in a gluten free option). Topped with hot soppressata, cherries, ricotta and mint. The sweetness of the cherries and the spiciness of the meat very well together in this unexpected combination...the cherries for myself personally were a little too sweet.\n- super friendly staff\n- kid friendly (has to be in this area!)\n\nGripes:\n- Cash only!", "author": "Shaila S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Love \u0026 Dough", "address": {"addressLocality": "DUMBO", "addressRegion": "NY", "streetAddress": "57 Pearl St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/y_KOhgKsZxhY2G38MzXRig/ls.jpg", "@type": "Restaurant", "telephone": "+13479873404"}