{"aggregateRating": {"reviewCount": 146, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-07", "description": "Went to an outside animation show being projected onto Manhattan bridge and spotted this place. The one waiter was nice another seemed to rush me and asked if I wanted take out when I was interested in sitting down. I ended up ordering the sausage and apple calzone for take out. The dough was very soft...a bit salty in some areas but it was rather light and fluffy. The calzone was more than a foot long and was filled with onions and sweet peppers, slices of green apple and sausage. A very nice experiment although after a while the sweet peppers got to me. It has a spicy kick to it, and I'd prefer to share this with someone as it is rather huge. I'd come back to try the pizzas.", "author": "Hit U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "One of the best low key pizza restaurants I've been to. The salads and appetizers are delicious and great for sharing. I strongly recommend anything with burrata and any pizzas (although I haven't tried the dessert). The pizza dough is exactly how I like it: not exactly thin crust but on the thinner side, soft but not chewy and with a crunch but not burnt. \nGreat location right next to the Manhattan Bridge.", "author": "Brio N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-08", "description": "Empty at 5:45 with good reason. Good service earned this a third star. They only have 10\" pizza, and they only take cash, so don't go in hungry. Serious prices for a pizza that left us wanting more  \u0026 better pizza. They could tell we were dissatisfied and redeemed themselves with a free desert, but still.", "author": "Landon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "So happy to have a new place in dumbo. From the same hospitable team of archway. Cute spot with tasty wood fired pizzas. Reasonably priced for the hood as well. Definitely get the dumbo recommendation.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "I'm Italian and I know how a good pizza tastes. This is a great pizza place! And the staff is great too, super nice and friendly!", "author": "Samuele M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Better than robertas. The most delicious lovely pizza. We had the truffle cream mushroom persutto pizza. It was incredible. Lovely service. Everything was great. Highly recommended.", "author": "Stephen D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-30", "description": "It was good. Not bad. Not memorable either. Marketed as Neapolitan pizza but the crust wasn't  really crisp. No liquor license but not a BYOB either. Service was fine. No complaints.", "author": "Paul D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "This pizza is great. The hot soppresata has so much flavor. If you order delivery, it comes in less than 20 minutes.", "author": "Nathan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "I've only had take out from Love \u0026 Dough which I highly recommend! It's tough to find a good gluten free pizza and this place has lots of options!! It isn't cheap but it's worth it!", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-28", "description": "Terrible customer focus - I ordered a pizza and received a soggy mess - I called the restaurant to give feedback and I got this guy who instead of offering some sort of apology, chose to argue and finally say \"I'm not a pizza guy\"....\"Not a pizza guy\" and I work at a pizza joint in NY??? Give me a break; Dumbo suffers from lack of competition - Crap customer service and mediocre food is not a recipe for survival in the real world", "author": "Doc J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "I love Love \u0026 Dough! The interior is clean and nicely decorated and service was phenomenal! The Surrpressata was out of this world. I am honestly surprised by how unique the taste was. The heat of the soppressata with the sour/sweet of the cherries was very nicely complemented by the ricotta and fresh mint. Hell yeah. This little place in Dumbo  was absolutely the best place we ate at during our trip to New York.", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-01", "description": "The worst customer service...the worst rude...arrogant store owner...", "author": "Christian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "I stumbled upon this place cause I was early to a play and needed something to eat. The restaurant has such a great atmosphere and the staff very welcoming. I ordered the Boscaiola pizza which was delicious. I cannot find anything negative to say besides that I only found out as I was about to pay the bill that they only took cash. Luckily I had some emergency cash.  I hope to come back here soon. Lovely location too!", "author": "Rudo C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-24", "description": "CASH ONLY - THEY DON'T TAKE CREDIT CARDS. That's my only complaint, but it's a big complaint. The service was otherwise great and the food was otherwise delicious. Unusual pizzas with good ingredients. I work around the corner, and I can't wait to go back...But not until they take credit cards. Come on guys!", "author": "Andrew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Go here now before lines start forming!\n\nThe service is tops, the place is warm and welcoming and our meal was first-class -- we started with a goat cheese, beet \u0026 apple salad (tasty \u0026 generously sized) and then greatly enjoyed the pizza with mushrooms \u0026 sausage.\n\nThank you for bringing L \u0026 D to DUMBO. Although there are other pizza choices in the area, this is a standout.", "author": "Franny S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-29", "description": "Horrible customer service, and the food is mediocre. I ordered for delivery once and it was blah... I wanted to give it another chance so I decided to go for a quick lunch with my baby... To my surprise they don't accommodate strollers. I mean, they don't even WANT to give it a try. For a restaurant that is not even busy, they didn't even give it a second thought that perhaps they could rearrange a few tables to accommodate me and my baby.  Obviously a place like this won't survive in a neighborhood that is full of families. They need to go!  If you have kids/babies you are NOT WELCOME HERE!!", "author": "Andres R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-21", "description": "New restaurant Love \u0026 Dough just told me NO STROLLERS, even if they are folded. Plus the manager was rude about it. Guess they aren't interested in DUMBO's significant family business.", "author": "Nicole D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-12", "description": "I was excited to try Love \u0026 Dough tonight for the first time but I never got my food so this review is 100% on the terrible customer service. One hour after my Seamless order was placed (and 20 minutes after the food should have arrived)  I called to check in. First I was told (multiple times) there was no order under my name. Then I was told that the order was never processed. The repeated reason.... \"We are just really busy.\"  There was never an apology and the person who answered the phone was both dismissive and disengaged. The total interaction was so off-putting that I cancelled the order and will never give this business my money.", "author": "Pamela H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "We ordered a margherita pizza and the cavoletti salad. The food was tasty, service was quick and pleasant. In fact, I'd say the pizza was above average by most woodfire standards. We were the only diners, which didn't bother us at all. The only bummer came at the end when we realized it was cash only.", "author": "Mara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "We ordered 2 pizzas for pick up and they were amazing! Ready in less than 10 minutes, the people working at the restaurant were super friendly and the pizza was great. THe margarita had a delicious crust (crispy and chewy) and the sauce was fresh.", "author": "Caitlin R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Love \u0026 Dough", "address": {"addressLocality": "DUMBO", "addressRegion": "NY", "streetAddress": "57 Pearl St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/y_KOhgKsZxhY2G38MzXRig/ls.jpg", "@type": "Restaurant", "telephone": "+13479873404"}