{"aggregateRating": {"reviewCount": 146, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-26", "description": "Solid lunch spot in Dumbo! There's plenty of seating and they're super fast for takeout. \n\nLoved the Neapolitan style and good flavors for the pizza and solid texture for the dough. We ordered the Margherita to-go and it was ready in 5 min. \n\nPrices for single pizzas are a bit steep but if you're down to split it with someone it's really not that bad. Also love that they have spicy oil", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "We had a hugeee group here the other night and I had to apologize to the waiters at the end of the night in case we were being too loud/rowdy. But not only did they say there was nothing to worry about, they did it with a smile on their face. It was a very joyous occasion that night and I couldn't ask for more from a restaurant. The staff was accommodating in moving tables around for us and also in helping us take some photos. The drinks and food came out very quick despite it being fresh pizza from the oven.\n\nMost importantly - the food was great. This was my second time here and the food once again did not disappoint. The prices are not the cheapest, but they're also not exorbitant. The prices are stomach-able when you see them and then forgotten once you try the food. I personally tried the Boscaiola pizza and the Gnocchi. Both were excellent. \n\nIt's not a huge restaurant but the lighting is great. Not too dark and not too bright. The only little issue as others have mentioned is that this place is cash only. Not a huge issue, but it'd be great if we could use cards. Regardless, I'll be back.", "author": "Ivan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-10", "description": "Not sure why this place got 3 stars, pizza and salad were very good. Would come back. Service is attentive. Decent prices.\n\nThe only issue / inconvenience - CASH ONLY !!!", "author": "Guzal R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-19", "description": "We ordered from this restaurant from seamless and could not believe the food that we received for the price. Not only was the food cold but literally looked and tasted like airport pizza. \nThe manager was awful and completely unhelpful and did not care at all that the food was cold and inedible. Don't waste your time or money.", "author": "Patricia R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-20", "description": "Came here for lunch and we were seated right away. However, our food took forever! We realized other people were getting their food before us so we asked about our order.  One waitor went to check on our food and didn't follow up with us. Another waitress who took our orders came by and checked what was going on in the kitchen this time she said the pizza is in the oven but there are so many pizzas ordered that it is taking a while. This place is conveniently located near the popular Brooklyn flea market area but apparently there is not enough capacity to manage their orders. The waitress was polite but I was disappointed in how little they seemed to do anything about it.\n\nI'm glad the pizza tasted decent. The roasted peppers had amazing aroma and the spicy pepperonis added a nice kick.\n\nThe interior is nicely decorated with pictures and plants. Their big front glass windows are letting a lot of sun in. There was a flea market right in front of it so it is nice to see the area while you're comfortable inside the restaurant. There is one small bathroom in the back.\n\nAlthough the menu seemed interesting, because of the service, I would not visit here again. I recommend searching for other places in the area first.", "author": "Sakiko E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "Great place great atmosphere priced reasonably beautiful views\nDelicious food coming out of the wood-burning pizza oven  luscious pastas\nGreat staff very happy with this place", "author": "Arthur H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-28", "description": "Ordered the tirolese twice. My wife loved it the first time, second time was a little disappointed in inconsistency. The flavor of the toppings are awesome with the rosemary, marscapone, speck. Dough was good but a little chewy. Overall a pretty solid pizza. Will order again.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "The best pizza I've ever tried in my life! Try \"Love\u0026Dough\" and die! Great crust and variety of ingredients. Come prepared, because they don't accept credit cards.", "author": "Maryna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "Love and Dough\nNY BK DUMBO \n7pm Wednesday 31st January 2018\nFour Stars\n\nAs we walked, you can smell the delicious mix of dough, garlic, and herbs. We drank Peroni's and we each ate our own individual 12\" pies. I had the Rustic: tomato, mozzarella, spicy soppressata, roasted peppers. This Neapolitan pizza was thin-crust with a slightly blackened underside.  The center had that nice soggy feel where you grab a slice it droops down.  The sauce was fresh and simple. The peppers had a nice bite. The Soppressata had a deep pepper flavor.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-06", "description": "Stopped in based on lunch special board while at the Dumbo Flea. \n\nWe checked out the menu posted outside and decided to give it a shot.\n\nWe then checked the menu inside and found it to be cash only. We had already ordered drinks, so we decided to finish them and grab the check. We had cash but didn't want to cut it close or not be able to tip. The server asked multiple times about food after we told him we just wanted the drinks. Seemed pretty pushy as others have mentioned.\n\nThe pizza did look really good but, I cannot speak to the flavor only the atmosphere.\n\nOverall it was cozy and looked good, covering up that its cash only sucks and the server seemed pushy.\n\nOn the way out I looked at the menu again and found that they covered up the cash only part on the outside menu, not into deception.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "My office is very close to this cute place and sometime we stop by for lunch, I have never tried their pizza tho.\n\nI had different salads instead, and they were all delicious, especially the one with brussel sprouts!! Last time I had some gnocchi and they were good, but nothing special. The tomato sauce was ok, but the gnocchi should have been softer for me and with some extra cheese maybe.", "author": "Carola B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-21", "description": "So disappointed in the management here. We were the first ones in the restaurant - it was completely empty - the management demands that we stick our umbrella stroller outside the restaurant. In an area loaded with families.... We left and found a wonderful little pizza truck in the flea market.", "author": "Sabrina W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-29", "description": "Terrible service, the food was never delivered, I called the manager, he refused to send a delivery guy ( he said he was already there) or  refund my money. People like him shouldn't work in hospitality.", "author": "Tatiana C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-08", "description": "The food is great, and the atmosphere is super cute!  Service was friendly and helpful BUT something very sneaky happened which is why I can't give 4 stars.  Upon sitting down the server asked us if we wanted \"sparkling water or still\"?  Still, we said, thinking it would be New York's famously excellent tap.   No!  Before we knew it, he was pouring from an Italian bottle of still water, inflating the check by $7.  I was too embarrassed to say anything and risk spoiling lunch for us and our guests.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-28", "description": "The gluten free pizza was amazing! Best I've ever had  staff were super friendly and service was quick! Would definitely recommend!", "author": "Karli S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-03", "description": "Nice cozy place, prices aren't too bad, tasty brick oven pizza. \nMy biggest complaint is they do not accept credit or debit cards. CASH ONLY. I would have liked to order another item, maybe had another glass of wine, but when you feel that you may not have enough cash it stifles your dining experience. C'mon you're a restaurant in a tourist area and you don't accept credit cards.", "author": "Evan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Comfortable place) with a good location. We ordered Margherita .. It was thin and crusty, the way I love it!! Servers were super nice. If you guys want to try the real Neapolitan pizza you should visit this place. \n\n\nThe only failure is disability to pay with card, cash payment only.", "author": "Mar I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "One of my favorite lunch spots. Food is good. Prices are reasonable for the quality you get with one exception: the expresso costs $4.5 and it's disgusting. Also it's cash only which it's a pain particularly when you organize a work lunch. Take credit cards!", "author": "Cosimo M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-16", "description": "This place is overpriced. Around $15 for each item is pretty expensive. Waiters were okay. I enjoyed the pizza. It tasted really good. But I didn't like the pasta. It didn't taste like pasta. It was like potatoes. And $14 for that small bowl doesn't make sense", "author": "Rebecca C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-09", "description": "We had a few Love \u0026 Dough pies at work for a meeting, so I got to try a few of the pies.\n\nThey're extremely thin-crust, so it gets nice and crispy. The margherita and surrpressata were both good.\n\nOf course, if you're in DUMBO, there are some damn fine pizza options, but Love \u0026 Dough is nice as a backup.", "author": "Kenny C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Love \u0026 Dough", "address": {"addressLocality": "DUMBO", "addressRegion": "NY", "streetAddress": "57 Pearl St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/y_KOhgKsZxhY2G38MzXRig/ls.jpg", "@type": "Restaurant", "telephone": "+13479873404"}