{"aggregateRating": {"reviewCount": 146, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "I hadn't been to Love and Dough in a while and forgot how fresh and tasty the food is.  Tonight, we  had the fennel salad and the margarita pizza which were both great. What I love is that the music is at just the right background level and not too loud. You can actually have a conversation.", "author": "Vicki S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "Really delicious, but very light, which my husband and I actually really enjoyed! A great spot off the beaten path of tourists around town. Real fruit smoothies and you can tell the pizza is hand made. Our waiter was new but incredibly kind and attentive! I would give this spot a try. Super cute decor was a plus too! Only thing: they ONLY take cash, so make sure you have it!!", "author": "Viva V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-05", "description": "Despite making reservations for our party ahead of time, Love and Dough's manager denied us service for no apparent reason. He quoted policies that were never mentioned previously, and ultimately decided that we should \"just pay or leave.\" The inexcusable and inappropriate treatment that our party received was neither justified nor warranted. This business does not deserve our patronage anymore than it does the one star that I'm at very least required to rate it. As far as I'm concerned, Love and Dough is cancelled.", "author": "Sarah J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-15", "description": "This place seems a bit on the cramp side. I like the lighting and vibe. The waiter had a difficult time writing down my order. It was a tad bit frustrating having to recapitulate what I wanted. The food was alright, but the marinara sauce was insipid.", "author": "Gizelle M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Awful service and rude staff. If I could give 0 I would do it. Food is mediocre and they impose 20% tips!", "author": "Sophia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-31", "description": "This place is a complete scam. Save your time and money (you'll spend a lot of it here) and go to literally any other place in DUMBO. No wonder this place is always completely empty. \n\nI have been to this restaurant twice. The first time, we were the only ones in the restaurant for the entirety of our meal, which I thought was strange for such a busy neighborhood but the food was okay enough so I wrote it off. \n\nThe second time we came in, it was also nearly empty. They post no signs anywhere stating they are cash only, so when the bill comes a lot of customers get annoyed that they have to leave to get cash. This place is not cheap and they're in a tourist area... the fact that they don't take cards is pretty ridiculous. What is MORE ridiculous is the fact that the ATM in the wine bar next-door (which are the same owners) doesn't work. A joke. You'll finish the transaction and it will not give you cash, nor will it print a receipt. I was unsure if it had even charged me. I tried a total of 4 times and got nothing. The owner I spoke to about their machine could not care less about it and walked away from me to do something else. She and the waiter seemed annoyed that I was even bringing this issue up to them, despite the fact I was trying to get money out to pay THEM.\n\nThe owner kept walking around ignoring me, so I had to ask the bartender. He didn't know why it wasn't working (obviously) and told me that I should go find somewhere else to get cash. Luckily, I have Chase and there happened to be one down the block, otherwise I guess I would've just been SOL. I wouldn't be surprised if multiple people walk out on their bill at this place. Seems shady that the only way to pay here is use their own ATM which charges insane fees doesn't freaking work. Stay away from this place. Food is nowhere NEAR good enough to make it worth the headache.", "author": "Lin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-03", "description": "WARNING: CASH ONLY.\n\nThere is no sign indicating this policy only on the bill after your meal\n\n\nI had high hopes for this place and stumbled upon it just Meandering through the neighborhood.\n\nMediocre soggy pizza and cash only. Waste of time and money\n\nSo many  better choices in the neighborhood", "author": "Yitz K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Despite the reviews I thought the pizza was excellent. We had the marguerite, and a calzone. The calzone was stuffed with lots of sausage and peppers. Take out only took like 10 minutes. It was pricier than I thought and cash only otherwise I thought it was excellent. The service was fine.", "author": "Joy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Really surprised at the very critical reviews. The Sicilia Pizza was terrific. One of the best neapolitan pizzas I've had in the city. The service was a bit heavy handed but who cares.", "author": "Eric G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-05", "description": "Food is horrible! Long wait for food to be made and was totally unsatisfied. Person I was with later got food poisoning. Owner/waiter extremely rude as well .  Million other pizza places so much better we could have gone to unfortunately stumbled into this one.  Place was empty as well which was a telling tale considering it was Saturday afternoon.  Pizza we got as appetizer was horrible.  Don't waste your $ on rude service and disgusting food", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Visiting from Ca and took a ferry tour. Hopped off in Brooklyn and happened upon this and love it!! Very cute feel extremely nice staff and the Pizza was super flavorful!!\nThe are just open for for two weeks so they will have beer and wine in a month and take credit cards soon!! Very happy with our meal!!", "author": "Sophia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-06", "description": "Went here today out of the blue because we were hanging out in dumbo and hungry. I got the mushroom truffle pizza and my wife got the calzone. Calzone was very good but the truffle pizza had a weird taste to it. It wasn't terrible, but much better options in the area. It's expensive but your paying for the location and convenience. Julianna's (best pizza in NYC imo) and other places are in the area have a much longer wait. The main reason I'm giving this place 2 stars is that it is CASH ONLY. There is no reason for a place to be cash only nowadays, especially in Dumbo. If you are cash only you need to post it on your door so I know not to eat there. I didn't know until the check came. So I had to walk to this ghetto bong store to use their ATM to pay my bill. Terrible. Totally not worth it for sub par overpriced pizza.", "author": "Charles A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-13", "description": "This is the worst pizza spot of all NYC. The service is utterly terrible, from the server all the way to the manager. The food is not good at all. When you get cold pizza delivered and the wrong food, they do not want to refund! The manager is the worst of all, terrible attitude towards customers and very unwelcoming. DO NOT GO HERE!", "author": "Emanuel S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-04", "description": "Burnt pizza, juicy lasagna mod service good location, cash only crappy pizza shop. Not recommend at all", "author": "Ali A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Best Gluten free pizza i've ever had. The staff is excellent, service prompt. Cash only but they have an atm two doors down.", "author": "Wilmiriam C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-23", "description": "Excellent food, but the owner is very rude. We were sitting down having our pizza and some friends came over to say hi. The owner came by and told them that they were blocking the waiters and had to leave, no \"please\" or \"do you mind\". When my friends did not leave immediately he walked behind a friend and elbowed her. My friends left in a hurry...never to come back.\n\nThe waiters are nice, but the owner is very rude and impolite. I think he just can't help it, regardless of the reviews. It's actually sad because the offering of restaurants in the neighborhood is not great.", "author": "Eusebio P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-22", "description": "I don't even begin to understand why everybody is so excited about this place. Pizzas are burnt, flavors are too pretentious and everything else not pizza is so bad.\n\nMy coworkers and i went today at lunch time and I didn't find any pizza recipe that sounded tasty (maybe just my personal taste profile) so when I saw a $14 lasagna I got excited and I ordered it.\n\nBeing a lasagna fan added to all the raging, throbbing awesome reviews I got really excited. Especially since a $14 price tag made me expect a good amount of deliciousness.\n\nWell. Here's my advice. Stick to pizza. My friends were moderately happy. But lasagna sucks. Sucks big time. It was the smallest, flavorless serving of lasagna I've ever had. It didn't even pass as a side. Literally like 2oz serving. Wow, $7/oz? Who do you think you are?. You guys suck. Even the waitress knew it.\n\nPlus bad salads and bad service? Never again.\n\nWhy does everybody believes that if it sounds fancy and is expensive it's better? Bleh...\n\nIf you're in dumbo and want pizza, stick to front Street pizza. Honest, cheap, tasty pizza.", "author": "Oscar F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "Terrible place. \n\nIt is horribly, horribly inconvenient that they are cash only. Can't they take a hint from their bad reviews? \n\nOn top of that annoying fact, they charged us $20 for bringing in cupcakes for our friend with a birthday. When I made the initial reservation, I asked if I could bring outside food; they told me I could, but failed to tell me about the $20 fee at that point. \n\nThe service was bad. The food was overpriced. Beer selection was poor. And they have only bottled beer. Avoid.", "author": "J M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "There is not many customer during lunch time but pizza is good.\nNot a big fan of home made pasta", "author": "Aki K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Nice place to grab authentic Italian lunch.  Atmosphere is relaxed and the service is with a smile.  We found it by simple serendipity, hopefully you will think he same.", "author": "Carlos J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Love \u0026 Dough", "address": {"addressLocality": "DUMBO", "addressRegion": "NY", "streetAddress": "57 Pearl St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/y_KOhgKsZxhY2G38MzXRig/ls.jpg", "@type": "Restaurant", "telephone": "+13479873404"}