{"aggregateRating": {"reviewCount": 146, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-22", "description": "They did not tell us this was cash only.  Three of us had to go  to the bank where we were charged for cash withdrawal. They also  mischarged us. No signage about cash only. Written in small at bottom of menu. Will not return. They were very unapologetic.", "author": "Angelie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "I went there with my friends for a b.day party. Food was nice (even though the pizza was born...and being Italian I know about good pizza!) and service good. Then big problem I have with this place is that we asked before getting in if we could bring few cupcakes as a birthday cake and they said there was no problem. When the bill arrives it showed they were charging us 20$ for bringing OUR cupcakes that we purchased somewhere else and for which they gave us a plate to serve them as sort of b.day cake. That was unacceptable and we complained to the man in charge but nevertheless we had to pay the 20$. This is not how a restaurant should deal with costumers and I will never go back there.", "author": "Nicole P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-11", "description": "We did not need the Open Table reservation for a Tuesday night because Love \u0026 Dough was completely empty. Why? Maybe everyone else needed a glass of wine, too. Be warned that there's no alcohol yet and no BYOB policy in place (our server apologetically told us because the license is pending, they can't allow people to bring in their own wine). It was also cash only the night we went, but I'm not sure if that's permanent either.\n\nThe burrata appetizer was underwhelming (portion-wise, way skimpier than Roberta's) with unseasoned roasted tomatoes on toast accompanying the dish. But the salad and pizzas were really delicious. They say individual pizza servings, but you could easily share a few apps and one pizza between two. Really nice waitstaff.\n\nNot a 5 star experience for some underwhelming dishes and also a surprisingly run down bathroom for a brand new place (the lock on the door didn't really work).", "author": "Jesse F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "I am annoyed it took us this long to come! We ordered the \"Love \u0026 Dough\", truffle cream, mushroom and prosciutto pizza ($17) and the Pistachio Panna Cotta ($7) - and both were fantastic. Truffle was not overpowering and the crust was chewy with charred bits. Yummmmmm. We highly recommend the Pistachio Panna Cotta for dessert, one the best i have ever had.", "author": "Zarbrook S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Food was delicious including the gluten free crust. Kids loved the pizzas too. Fennel salad was a hit as were the smoothies. It takes a bit of time and remember it's cash only. There is an ATM in the basement of the restaurant next door. Great spot near the bridge.", "author": "Allison S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "I went here this past weekend with my boyfriend for dinner. We were slightly surprised it was cash only because it didn't say it anywhere but note to self! We ordered the beet and goat cheese salad which was amazing and we each ordered a pizza to try. The rustic pizza was amazing. Wish I ordered that myself. I got the something green pizza and it really had no flavor at all which was surprising. We finished the meal trying the Nutella calzone and it was worth every penny. I honestly could have just ate that for dinner. I would go back for that alone. I couldn't give this place a 5 because I was disappointed in my pizza but the overall experience was good.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "I was at a friends house babysitting and they bought this sausage and apple calzone.  Now it looked just like an artisan calzone should look, very easy on the yes.  But i was hesitant of the taste.  Just a believer that \"everything\" does not need to be artisan:)  With that being said this calzone was heaven wrapped in delicious doughy goodness!!!  I didn't get the itis immediately afterwards which is a very good sign.  I do not live in the Dumbo area but if I am there or close I will stop by to try the rest of the menu.  Very very pleased with the flavors and the dough!!!!", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "Nice place to stop in for lunch if you live or work in the area. We got a pizza and the salmon, and both were delicious. The waiter was friendly and attentive. They only take cash though. It's not listed on the door and you have to walk 3 blocks to go to an ATM.", "author": "Bianca M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "This place is lovely, amazing ambiance, good music and the pizza is terrific! They don't serve alcohol at this time because they are a relatively new restaurant and they don't have a liquor license yet. The only thing that threw me off was the\"cash only\" thing. It isn't advertised anywhere in the restaurant that its cash only establishment and no one told us until we got our bill. Otherwise the place is fantastic!", "author": "Taillur M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "The decor and typography alone made me excited about this new spot in Dumbo! The pizzas are a bit of a funny size, too small to split unless you share an appetizer, but pretty big for one serving. Just arrive hungry and you will be so happy! The staff is super friendly and the crust was especially delicious, wood-fired perfection. Overall a bit pricey, but great for a special night out!", "author": "Shadi G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-23", "description": "Extremely rude staff.  Kept saying \"5 minutes\", \"5 minutes\" but my wife and I ended up being served almost an hour apart!  What a joke.  They kept saying they were \"busy\", but they weren't sorry about the situation at all.  Ok, well we have options -- if you had just told us that you weren't capable of fulfilling the order we would have taken our business elsewhere.  Instead it turned what could have been a nice evening into constantly trying to figure out what was going on.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Best gluten free crust I've ever had \u0026 I've tried a few. Got the Love \u0026 dough pizza \u0026 was not disappointed. I would def come back again. I wanna try more of their pizzas.", "author": "Amber P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-24", "description": "Loved this! Beautiful place to eat. We got a meat and cheese plate that prompted audible noises of delight at the table. Fun night out for friends, and a wonderful atmosphere.", "author": "Cayce U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "So happy to have them in the neighborhood!\n\nOrdered delivery on Valentine's Day. Here's a quick summary:\n\nOrdered Naked Tomato pie without ham and the Brussels sprouts salad. \n\nPizza: delicious! Big chunks of artichoke and olives. Great crust, slightly chewy and lightly crispy. \n\nSalad:great flavors and savory dressing. \n\nWe'll definitely order from ten again real soon. It's a nice alternative to Julianas and grimaldis since those two don't deliver.", "author": "Dennis C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-02", "description": "The food was good enough, but the owner was very rude to me and my daughter. I won't be back. Oh yeah, cash only.", "author": "Julie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "This restaurant opened two weeks ago and they have all the details dialed: interior, service but most of all the food.\n\nWe had a calzone and a white pizza. Clean plates were sent back to the kitchen as a sign of appreciation.", "author": "Ard K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Came here for the fist time and tried out the Margarita pizza it was so delicious that I wanted to get another one, but I was full already, I would def recommend this place. Thanks to all the staff at Love and dough.", "author": "Jose H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Amazing gluten free pizza, best I've ever had! Great fennel and range salad. Super sweet staff. Will be back in a heartbeat!!", "author": "sarah g."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "This restaurant is adorable inside with a trendy ambiance and cozy feeling. The food was great and so was the wine, but the service wasn't the best. Had to ask a couple times for water, didn't get silverware and it's cash only! Not a problem though, there's an ATM up the road. Would probably go back but only if it was to order take out.", "author": "Katy K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-10", "description": "The food is okay, I've had better, but I could live with that. The service was HORRIBLE! I stopped by during the essence street festival with two kids. We seated ourselves, it took our waiter forever to get our order. We ordered the goat cheese salad with drinks, then a four kings pizza. We didn't get our drinks until we finished our pizza and I asked three times. The kids wanted dessert but after trying to get the waiters attention I just took the check and left.", "author": "Jody-Ann C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Love \u0026 Dough", "address": {"addressLocality": "DUMBO", "addressRegion": "NY", "streetAddress": "57 Pearl St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/y_KOhgKsZxhY2G38MzXRig/ls.jpg", "@type": "Restaurant", "telephone": "+13479873404"}