{"aggregateRating": {"reviewCount": 146, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-05", "description": "I'm appalled that establishments like this still exist in 2018. We made a reservation for my 12 year old niece's birthday. The reservation was for 16 people. Once we arrived to the restaurant, we were told that each person MUST spend at least $35 each (never mentioned upon making reservation). Let's keep in mind, the restaurant was literally empty. Eventually we were told by the manager, Mike, \"pay the price or leave\".  I'm truly disgusted that they would operate with such a lack of professionalism and care for their potential customers. The way we were pushed out really made me feel like there were underlying reasons as to why they refused to accommodate our party. Please, do no support this establishment.", "author": "Matthew J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-21", "description": "Solid pizza option with friendly service.  As far as pizza in this area goes though, there are lots of better choices.  Cash only.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-06", "description": "Celiac's rejoice! The gluten free crust is yummy and soft - unlike most gf pizza dough. I'll be back next time I'm in Dumbo. THANK YOU Love \u0026 Dough.", "author": "B-Mama D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "My boyfriend and I were looking for a simple place to eat after walking around Dumbo. We didn't want to go anywhere to fancy and a lot of places had long lines. This spot is on a little street, very cozy and very good selection on the menu of Italian food. We ordered the Busciaoli pizza with sausage and mushrooms and basil and it was very tasty, although it was only small enough for two people to share,we had three slices each. The pizza could be a little bit larger for the price which was $16. At the end of our waiter saw earth pay the bill brought back or change and then proceeded to tell us the tip was not included in the check... it kind of bothers me when the waiter is overly attentive to the tip we are leaving....1 star off for the ending \u0026 the size of pizza.\n\nUpdate: After writing this review the server from the restaurant messaged me asking me to mention how we did not tip him. As I stated above we did not appreiciate the remark he made to us at the end of the meal. I tip very well actually when the service is pleasant, unfortunately that was not the case. Do not eat here, servers will continue to be rude even after leaving! I was a server myself and would never do that!", "author": "Jaz M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-30", "description": "Don't bother with this place.\n\nOrdered pizza for delivery, showed up cold two hours later. Guy on phone promised a new pizza that never came. Also asked for the old one to be returned. Hmm.\n\nWent in a couple of weeks later to talk to them about it. They deserved the benefit of the doubt, we thought. Maybe they lost our details.\n\nShouldn't have bothered. Paraphrasing for brevity:\n\"We probably thought you were lying to get a free pizza.\"\n\"Nine minutes is too far away to expect anything other than cold pizza.\"\n\nThere's much better pizza around, without the crap attitude.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "Today my dad and I dined here for the first and last time. We stopped in because several other restaurants/cafes in the area were either closed or had a long wait time and we were too hungry to wait. Worst decision ever. I'd rather starve on line for a table elsewhere than eat here again. Let me break it down: \n\n1) They had a sidewalk sign outside advertising their lunch special (pasta/pizza, salad/appetizer for $13). No mention of a \"weekday only\" disclaimer. Was informed by the waiter when we tried ordering that the special was for weekdays only. It's Sunday. Was the sign out to trick people into coming in? \n\n2) CASH ONLY. But you'll only find out when you sit down and look at the very bottom of the menu. \n\n3) PRICEY. I ordered a margherita pizza ($14 so it wasn't too bad for the size), but my dad ordered the rigatoni and it came in a small bowl and cost $15. You can see these prices reflected in other yelp users' photos too. But when the check came, his pasta was $16. The one dollar isn't a life-changing thing, but it's just annoying. AND when my dad asked how many meatballs their meatball order came with, they said 3. Three for $15????? And he asked how much it would be to add 1 meatball to his order. $5. Five bucks for a single meatball. \n\nThe waiter was also really pushy about drinks. We were starving and only wanted some water and our food. But he asked 3 times if we wanted beer or soda even after we said that just water was fine. Then he tried to push sparkling water on us twice even though we said regular tap was fine. I promise this isn't about the money. I love a glass (or 4) of white wine. I love sprite. I hate sparkling water. We're not cheap. We just weren't craving more than some food and regular water today. \n\n4) THEY AUTO-ADD TIPS TO YOUR CHECK. It isn't a \"recommended\" amount. They literally tack it onto your order and tell you the total amount \"owed\" with the tip included. I get it. It's a touristy area and they're looking out for their waitstaff. What I DON'T get is why they tacked on 20%??? To my understanding, a tip is optional and the amount is based on quality of service. 20% is for excellent service. My family and I are always generous tippers. We literally wouldn't sleep well at night if we know that we left a restaurant without leaving at least 15%, even if the service was trash. We've tipped 30% because we literally loved the server so much. My dad and I were totally set on leaving 15% at this restaurant even though the service was mediocre and the food didn't justify the price. But when we saw the 20% already added, we were pissed. 20% for what?? The people weren't even friendly! All they did was hound us to order more food and drinks than we wanted or needed, bring the plates to the table, and never showed up again until we asked for the check. That's worth 20%? But we didn't say a thing about it to them, said thank you, and left politely when we were done. It wouldn't have felt right to throw a fit. \n\nDefinitely would not recommend this restaurant. Only giving it 1 star for 2 reasons. One is that I need a star there to post this review. The other is that the pizza was decent. BUT there are plenty of other places in DUMBO. Front Street Pizza has way better pizza and definitely better prices. Love \u0026 Dough's tables were tiny and crowded together anyway. Not like you're getting much more for the price.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "Came here with a group yesterday because Juliana's doesn't have gluten-free crusts.\n\nThe pizza is tasty, but too salty. We had the Margherita, Surrpressata!!, and signature white pizza (truffle cream, mushrooms, and prosciutto). The Margherita was just okay; the other two were much better. The cherries on the Surrpressata!! added an interesting and surprisingly complementary dimension of flavor.\n\nThe staff kept taking away our napkins before we were done eating, which we found strange. I had to fish out two napkins from my purse. The ambiance was cute and pleasant, though.", "author": "Rebecca W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-19", "description": "This is the worst pizza and should be called Dough and Dough- super Doughy and horrible service. Establishment is not clean  and staff unfriendly. Watch out especially for Hadar the manager - who wants to charge $35 a head if you try to book in advance. Overpriced and overdoughy. Definitely pass on this pizza not worth a dime let alone $35.", "author": "Suri C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-28", "description": "I won't pile on too much-- similar experience as other poor reviews.  Food was okay but by the end of my meal, I felt like I was tricked and lied to by the servers. Feels like this business relies on trickery and lack of transparency on not just the meal specials but also the cash only policy. Walked out upset and definitely not coming back again.\n\nI saw a mom with two kids walk in, exchange words, got agitated, and walked out. Not sure what that was about but it definitely wasn't just me!", "author": "JJ R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-18", "description": "If I could award half-stars I would give this joint 3.5 stars. \n\nThis is a casual restaurant in Dumbo and we decided to stop by because of the convenient location. This place is away from the main Dumbo tourist drag so it's quite a bit quieter and there were no lines when we arrived. \n\nI had the rustic pizza - tomato, mozz, soppressata, roasted pepper. I quite liked the thin crust and toppings. The mozz was a bit chunky which isn't my preference, but I got through it. The throw on a bunch of roasted pepper which is great. It's officially a personal-sized pizza but it's pretty big and I needed help to finish it. Overall this is a standard pizza and the total came out to be $20 including tax/tip. It's a bit pricey in my opinion for the atmosphere and quality.\n\nThis place won't take away the hoopla from Juliana's or Grimaldi's but it's a nice plan B option.", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "Pretty, pretty, pretty good pizza. \n\nI tried the Surpressatta!!! ($15) which had spicy soppressata, ricotta, stewed cherries and (a negligible amount of) mint. It sounds strange but I loved it as an enthusiast of the sweet 'n salty/spicy combo. I also tried the Love \u0026 Dough ($17) which had truffle cream, mushrooms and prosciutto. This was undoubtedly tasty (how could it not be) but too rich for me. It also made everything in my fridge smell like truffle the next day...I'm not sure if eating a truffle scented apple was actually a good thing or not. \n\nI was not disappointed by the crust, which was pillowy and chewy and charred and most importantly not too wet like many Neopolitan pizzas can be. The pistachio panna cotta was divine as well. \n\nPies are on the small side (maybe 12\" in diameter) but intensely flavorful so a little goes a long way. Bring cash cause they roll with that. \n\nIf the sight of the lines at Juliana's/Grimaldi's give you panic attacks, this is a nice getaway oasis to have your pizza at.", "author": "Kelly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Love \u0026 Dough was a really good pizza place in DUMBO, but I don't think I would go there again. It was really loud and pretty warm, but the pizza was good and the salads were very refreshing. The service was amazing as well.", "author": "Ashlyn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "What a lucky find! Just around the corner from brick oven pizzerias in Dumbo that had huge lines and it was probably better than the really crowded ones. We had a wonderful wild boar Ragu, a scrumptious Kale salad, and spicy rustic pizza. The best Neapolitan restaurant we've been to. The three of us shared and there was plenty of everything - even with a teen boy. Attentive but not annoying service. Average prices I think.", "author": "Paula B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-10", "description": "Warning - stay away from Love \u0026 Dough!! Our office is located a couple blocks from the restaurant and it safe to say we will never be returning. We made a large group reservation (16 people) for a weekday company lunch over the phone. The owner/manager did not inform us that there was a $35 per person charge for large groups. Not only were we surprised to see the total at the end of the meal, but they charged us for someone that didn't show up, $35 for one person that joined for a bite of dessert at the end of the meal and automatically added 20% gratuity onto the bill. When I emailed the restaurant to try to dispute the charges, the owner was incredibly rude in his response. This trickery and lack of transparency is simply unacceptable.", "author": "Adair N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "There are now 3 excellent places to get pizza in Dumbo. Unlike Juliana's and Grimaldi's though, this is Neapolitan style and there is no long line to get in (at least so far).\n\nThere are some starters, including a solid Lasagna ($14), but it's obviously all about the pizza here. They have sections for red and white pies, so we went with one of each. The Surrpressata!!! ($15) sounds strange, topped with tomatoes, hot soppressata, ricotta, cherries and mint. The sweetness of the cherries and the spiciness went very well together. For the white, we went with the namesake pie, the Love \u0026 Dough, which is topped with truffle cream, portobello mushrooms, mozzarella and prosciutto ($17), which was amazing. The truffle was strong and was a delicious combo with the salty strips of prosciutto and plentiful portobellos. Both were excellent, though not quite as good as some of the best Neapolitan pies in NYC.\n\nAlso, do not skip the excellent Nutella Pizza ($9). Not actually served as a pie, but rather cut up strips of the amazing pizza dough, and filled with tons of gooey Nutella. It's pretty rich and overwhelming, but well worth it even just for a few bites.\n\nThe space is nice, with high ceilings and the big pizza oven in the back out in the open. Service was great, with very helpful and friendly staff. I'd definitely come here over waiting with tourists at Grimaldi's (Juliana's is a tough decision though).", "author": "Mike C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-06", "description": "We made a reservation at Love and Dough like 2 weeks in advance through open table. The restaurant never called us for any specifics and we reached the restaurant on time with a group of 12 only to realize they would not serve us untill we agreed to a fixed menu. They would not even give us water!!!! We tried to tell them we havie dietary restriction and that we would be willing to hit a minimum spend but they would not budge. They said you have to fix up to a fixed menu. They were rude, horribly unprofessional and like many other restaurants if they had just told us a day before or so we would have made other arrangements but the restaurant was completely empty and yet they were uncompromising, which I did not understand why. Seemed they were discriminating against us. It was the worst experience in my life in front of all of my guests. We walked out and had to finally find another place. We went to Grimaldi's and they were awesome, accommodated us and we're 1000 times better. \n\nLove and Dough said it is open tables problem which I did not understand why. I have made numerous reservations through open table and love it. I think we should not have this restaurant being featured on the open table Network so in future they would never do this to anyone else. Additionally, the guy in the restaurant named George is telling me why didn't u call before hand after making the reservation? I mean there was no note of any kind left to me or addressed in the open table app which many restaurants do have. I politely told him its the restaurants responsibilities if they have some pre-requisite and not for customers to find out. Also to, make matters worse the manager was not it and would not come on the phone and was out right rude and horrible. He was accusing me that they tried to call me before and when I asked them why didnt you leave a voicemail or email me through open table as they had my email...but he had no answer. I had caught his lie. I believe the restaurant was out right discriminatory secondly, if they could have proved they tried to contact me I would have recokned it was my mistake but nothing whatsoever. It was my wife's bday and we told them we will make it work and give us a minimum spend but nothing to avail. They were horrible!!!!\n\nThis place should be called Hate \u0026 Dough. This left such a distasteful taste in experience that we would never go again in our lives, And would tell as many people as possible about this to avoid them the same experience. Not a friendly establishment. Outright rude, horrible experience, horrible service. Don't know what customer experience or satisfaction means .", "author": "Vinay B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-13", "description": "Extremely rude! The host was disgusting. We got to the door that he would not let us walk through and asked \"what can I do for you?\"  Not hello or welcome. There was no space in the restaurant for us according to him but we could wait 45 mins to go to the other restaurant. Neither restaurant looked full. We asked his name and he lied and said \"Mike\"! We informed him that he was very rude and needed to adjust his attitude if he is working with the public. He responded \"whatever bye\". Needless to say we did not spend a dime in this establishment. I spoke to the manager who\n was very apologetic. Will never visit this restaurant or recommend them to anyone. You", "author": "Colleen L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-03", "description": "No love here, the feeling is mutual.\nOverpriced for no good reason. Pizza is just not good. Sad because I live close by and would love to add pizza to my limited dining options in dumbo.", "author": "Li Lyn Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "Added 20% gratuity for only 2 pizzas. Not clear it was cash only and nothing special about this pizza!", "author": "Maria A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-09", "description": "The wait staff is lovely. The manager and owner are not. After we ordered pizza, food and drinks for 15 people, they told us they had to charge $5 plating fee so that I could use the cupcakes I brought for my son-- it was his 9th birthday. I didn't want to make a scene so I said it was fine. But once I got the bill-- they charged me more than twice that amount for 6 kids! I told them I only agreed to $5 per person and that is what would pay. They had to call the manager, the manager had to call the owner, etc. It was ridiculous that the manager couldn't make the decision on his own. AND it was ridiculous to charge such a high plating fee-- and then to double it and just put it on the bill. They also automatically add 20% service fee. Overall, the food was decent but the owner's mishandling the event left a terrible feeling with all of us. We will never go here again.", "author": "Stephanie M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Love \u0026 Dough", "address": {"addressLocality": "DUMBO", "addressRegion": "NY", "streetAddress": "57 Pearl St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/y_KOhgKsZxhY2G38MzXRig/ls.jpg", "@type": "Restaurant", "telephone": "+13479873404"}