{"aggregateRating": {"reviewCount": 173, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-08", "description": "This pizza was subpar. We ordered two pizzas for delivery. The pies lacked flavor to be honest, which is difficult to say about pizza, but truly they were bland. In addition, the bottom of one of the pies was too burnt to eat so we had to eat only the scraped off toppings. Maybe the pizza is better when dining in but I certainly wouldn't order delivery again.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-07", "description": "Layla Jones offers tasty Italian comfort food. Nothing fancy here, but quite the bang for your buck. I've ordered delivery here and the portions were very generous. Prices here are lower than most places, large pasta dishes around $11-$12 while many places charge $15-$20. If you're looking for comfort Italian food and want a good value, this place is the way to go.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Always great tasting food and punctual delivery service from Layla Jones.", "author": "Taryn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "Great place with an amazing lunch special, such a great deal! Love eating outside in the garden or\nPicking up a slice to go. The sauce is sweet and the cheese is of great quality. Not too greasy either! Favorite pizza in Brooklyn  thanks Layla Jones!", "author": "Rose M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "I ordered delivery from this place - wow the pizza is really excellent. It was a square type pizza with perfect Brooklyn-style crust, good ingredients, not greasy and tasted amazing. I had the \"Sweet Jane\" pizza with pesto added.", "author": "Lucien D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-09", "description": "Ordered delivery. They came with only half the order. Left to pick up and had delivered the wrong pizza. Starved, I ate it anyway. Good pizza. Not great, of course not what I ordered. Came back with missing ingredients. Didn't get to try. They didn't sent any utensils and I was in a hotel without. So, hard to really review what I ordered.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "This place is pretty not bad. I'm super close, like, shouldn't-be-ordering-from-them-and-I-can-see-them-from-my-window-close.  But the pizza is just different enough to be a good offbeat slice.  And I hate my stairs.  The actual sandwiches are very reliable as well.\n\nBut we've had our ups and downs.  Over the many orders I've had a mistaken for bacon slice and a couple MIA root beers (I almost cried of thirst).  But out of probably thirty plus go rounds I can't hate to hard on it. \n\nIf there was any question of three or four stars for this local pizza joint just image saying \"layla\" instead of mr. in \"mr. jones and me\".  Tell me that isn't a fairy tale you can get behind.  I mean come on.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Amazing food \nI use seamless to order and its comes so fast and always so yummy\nPizza,pasta,salad everything on the menu", "author": "Marie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "You cannot go wrong with Layla Jones - such a staple neighborhood spot and it never ever disappoints. The delivery guy is one of the fastest around so you're not waiting for a cold pizza. Order a plain Jane and add toppings, the chopped salad with the balsamic is perfect meal under $35.", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "One of my favorite restaurants around the area. I actually never ate in the front half of the restaurant/pizzeria area. Always head to the back half, garden area. Choose a nice spring day, and relax in comfortable seats (choose the non-picnic table seating) and enjoy the fresh air with great food\n\nAll the food served here is very solid and fairly priced paired with nice friendly service. \n\nFavorites here include the sweet sausage hero and the olive pizza. The sausage is well grilled, not overly salty, so can still taste the onions and peppers it's paired with. A bit greasy, to be expected with a sausage hero though. Counter that by eating it quickly so bread doesn't sog up. When looking for a calmer eating pace, order the various pizzas on offer. All the pizzas aren't salty or anything, can probably just assume all the sauces and cheeses universal to all the pizzas are well made with carefully selected ingredients. Usually opt for the olive pizza which also has arugula. Well baked, no topping are burnt, cheese with a good melt and crust has  a nice char to it. Another recommendation would be the sweet jane, based solely on the strength of the pesto sauce. They should really sell it on the side. \n\nHave also tried the pastas and paninis. Prefer the paninis over the pasta (sort of average, nothing stood out). The paninis are well pressed according to normal customer standards (I personally prefer it a bit burnt, so ask if you do too) and served with a side of salad. Tastes like the same mozzarella used on the pizzas, not a bad thing at all. Really delicious.", "author": "Leo C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "This is pretty average pizza. My friends and I ordered a plane jane and a greek salad. The greek salad was great. Like actually really good. The pizza is very average. It's not the worst pizza I have ever had but it's not that great. It sort of reminded me of a step up from chucky cheese pizza. Highly recommend skipping this place and going to Lucali instead. Seriously.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-04", "description": "Horrible.  Literally the worst pizza I've ever had.  This pizza would be a disgrace for a roadside shop, let alone a pizza shop in Brooklyn.  The pizza was as doughy, flaccid and gross as an 80-year old man and smelled about the same.  Two or three bites and we threw out the entire pizza.  Never again.", "author": "brendan w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "You wouldn't expect a pizza place with a name like Layla Jones to serve a great pizza,but they certainly do.Great crust,perfect sauce to cheese ratio and perfect flavor.Not to mention,the price is more than fair.", "author": "Joseph M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "I can't write too much about a pizza place I've been to a handful of times despite living in the neighborhood. I can't decide if it's self service or waiter service b/c it seems to display both. On all occasions, I ordered my pizza at the small counter in the back that showcased different styles of pizza. But  once seated, a super friendly worker will serve your order.\nIt's small with a few tables and they might have patio seating but I'm not sure.\nI've eaten the mushroom, the cheese,  and veggie slice on different visits. The crust is airy,  tasty and thin enough. If I didn't forget about it at times while on Court Street, I'd visit more often because I must say, I like it and it's worth a try.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "Layla's my girl.*\n\nIt started out with a little bit of flirting. You know how it goes in the beginning...I'd give her $8, and she'd give me a sizable, delicious meatball parm hero for lunch. That's how they all start. Sometimes I'd go for the grilled chicken and goat cheese panini when I was feeling wild, and she'd throw in a drink too, because I'm a good listener.\n\nAfter the first couple trysts, we decided to go all the way. Pizza. She's into role playing (honeymoon phase, amirite guys?!)...sometimes she's Plain Jane (just sauce and cheese), and sometimes she spices it up as Sweet Jane (add a bit of pesto and romano). \n\nI'm not usually into dudes (not that there's anything wrong with that), but I gotta say...I like the meat. When Layla dresses up as Fast Eddie (pepperoni, meatballs and sausage) it's almost too much meat for me, but Sweet Lou and his lasagna combo (ricotta, meat sauce) is just right. This one time I got drunk and me, Eddie and Lou all got down together. I liked it...that stays between you and me though.\n\nTo be up front though, Layla's not the best I've had in the city. Hell, she's not even the best in the 'hood (we live in a great area for slutty, delicious thin crust pies). But she's got that sauce and cheese and shapely crust (always a good combo). And she's always quick to come over when I call, and it's actually better that way. It's not that I'm embarrassed to be seen with her in public, it's just that her thicker, doughier crust doesn't lose as much (as a brick oven pie) in the box on the way over.\n\nIf that sounds good to you, give Layla a call. Don't worry, I'm not the jealous type. \n______________\n\n*Please don't tell my actual girl, she'd probably shank Layla without a second thought.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "I am a total foodie and love pizza. I swear this is probably top five pizzas in all of Brooklyn and I can only think of one or two in the city that might be similar. It really is one of my favorite places, it's family-owned by a lovely family from the neighborhood the people they have working for them are really sweet and great service. They deliver and the prices are great. It's not a huge space and it's definitely an informal but high-quality food that you will love", "author": "Sari M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "Whoa! \nWhat amazing pizza! We got two regular slices (the lunch special) a fajita personal sized and and side order of meatballs! How they made a thin crust square slice chewy amazes me!!! Fresh dough, amazing sauce and cheese with the right amount of basil!!! Wow! The fajita pie was awesome, chicken and zucchini with spinach was ridiculous and the meatball side dish of two giant meatballs with enough sauce to dip the crusts of our pizza into! Great little spot! Beyond our expectations!!!", "author": "Tricia J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "Layla Jones, you're pretty cool. And I'm sorry I hadn't checked you out you sooner. \n\nFound myself here on a spontaneous and raging midday pizza craving and man, did those square slices do the trick.\n\nThey may look unassuming, but they're big on flavor and cheesy goodness. It's not the best pizza you've ever had (God bless New York) but it's a delicious neighborhood option!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-17", "description": "They apparently don't put sauce on their pizza, even though that's not noted in the description. If you want a subpar flatbread, then order the grilled pizza. The other pizzas described as thin and crispy  crust actually have a crust that's thick and chewy, close to a deep dish. Their caljones and spaghetti and meatballs are pretty good, but overall of our three orders from here it feels like a weird middle ground between cheap Italian and high-end Italian, with prices closed to the high-end end but quality closer to the low end.", "author": "s v."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "I've never actually eaten inside the restaurant... we always just order from Seamless and it's always been great. Our go-to order is either:\n\nOption 1:\n- spaghetti and meatballs with side salad (also comes with garlicky bread)\n- spaghettini with chicken/artichoke/sundried tomato with side salad\n\nOption 2:\n- sweet jane pie with added sausage\n\nNote that the pizza is a definite gut-bomb! You don't feel great afterwards but I don't know many pizzas that provide a spa-like effect anyway.\n\nHad a hero too before but they don't travel well and the bread gets soggy.", "author": "Michelle Y."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Layla Jones", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ioXzmylicLmgyEgrvQd0dg/ls.jpg", "@type": "Restaurant", "telephone": "+17186242361"}