{"aggregateRating": {"reviewCount": 173, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "I tried this place a couple years ago and I thought that the pizza was forgettable.  Not bad, but I would rather go to Sam's or My Little Pizzeria.  Looking for something a bit different I tried them again a few weeks ago, and wow was I impressed with the pizza.  I'm not sure if I caught them on a bad day last time, but I really loved the pizza.  We got the pepperoni, also know as the best pizza topping ever, and I the pepperoni were nicely cooked, the dough firm without being hard, and giving without falling apart, and the sauce had a nice sweetness to it that was balanced by the savory.  The pizza is square and a little different than your neighborhood round pie.  I'm not sure how to articulate it, but it's just different.  Try it.  I've since gotten the pizza two additional times so I know it wasn't a fluke.\n\nI also came in for a meatball press, and it was very good.  It's not a fancy space to dine in and pretty small, but welcoming nevertheless.  They also have pasta on the menu which looked very good when I saw it being plated up for a to go order.", "author": "Russ K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "There are some days in which I can't get enough complex carbohydrates and fatty proteins, that's when I turn to Layla. Despite her Midwestern name, Layla serves up tasty doughy pizza with perfectly stretchy mozzarella. There is also a healthy portabella and artichoke salad option. Giant garlic knots. Delivery is quick and spot on.", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "Nothing feels better than supporting local business, and Layla Jones matches the feel-good with delicious salads, pizza and awesome meatballs! Staff is friendly, there's a great yard for outside dining and this place is PERFECT for kids.  \nThe Easy Special is a large pizza with your choice of mixed green or Ceasar salad and two cans of bubbling drink.", "author": "Kiki V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-26", "description": "This review is only for the pizza...I haven't tried anything else, but their sandwiches do look promising. \n\nUnfortunately this will always be speculation and I'll never know for sure because I won't be back. I ordered pizza from them once based on their pretty solid review, and I have no bones to pick with the place other than the fact that their pizza isn't any good. It didn't take too long, the people were friendly, the price was good- great even, it was clean...everything was fine except for the food (for lack of a better word) they handed me.\n\nI brought it home and opened the box and had flashbacks to college in a really bad way. The crust was thick, soft, very pale, and tasted sweet, like there was butter and sugar in it or something. There might not be, but it tasted like it. The whole thing was pretty undercooked, so when I picked up one of the square slices everything fell off and I was barely successful at separating it from the rest and picking it up because it was so sloppy. I had to fold it in half so I could hold it with my other hand to keep the bottom from dropping off, and right when I bit into it, it started hemorrhaging orange liquid everywhere. \n\nI hear they have a garden so I'm throwing in an extra star. Plus the people were nice and, in their defense, I did only try one thing...coulda been an off night. \n\nThat was my experience though, had to put it out there.", "author": "Caroline K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "We popped in here for a late lunch. We had a very fresh chopped salad with a very nice dressing.  Then we were served a calzone (huge portion) with amazing beef meatballs and fresh mozzarella cheese. I had the pressed meatball sandwich that had beautiful roasted tomatoes and fresh mozzarella and the bread was spot on! We will be back when in the neighborhood. Service was nice and friendly. Worth it!", "author": "Lola S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Get a corner piece of the fresh mozzarella pizza and your taste buds will dance the happy dance.  Not greasy, not thin, rather chewy-- usually something I avoid-- but Layla Jones does a very nice job, using fresh cheese that is not soggy, topping the whole thing off with fresh basil.  I had mine unheated and walked down the street in the sun, in heaven.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-12", "description": "It's pretty tasty.  We thought it just fine.  \n\nNone of your NYC pizza matches Chicago deep dish, though.  I eat two pieces of yours for a fucking snack.", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-09", "description": "Know what \"a'ight\" means? Pizza here is just \"a'ight\". \n\nWe got delivery tonight- the Fast Eddie pizza (meatballs, pepperoni \u0026 sweet sausage) and a Caesar salad.\n\n8 slices of rectangle 'za with a thin and kinda bland crust. The orange grease factor was high. This is not a brick oven joint.\n\n$28 total for delivery and I'm holding on to the menu, because there ain't no bad pizza, and I don't live near Carmine's.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-21", "description": "Kids love their pizza, it's a fail-safe place family joint.\n\nThe service is warm and their delivery is fast.\n\nAnd this is not disgusting pizza either, it has a good balance of cheese to sauce and in their \"easy order\" they include salad and a drink.", "author": "Lisa Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "I went here the other night with a big group of people (15), and let me just say that it was a great experience. They were very accommodating and attentive to our group despite our large size, and the staff was extremely friendly.\n\nThe ambience was great, very casual but still intimate with low lighting and candles. It wouldn't feel weird to bring kids here either.\n\nThe pizza was great -- not a typical NY slice but the dough was nice and the toppings (I had the Fancy Fajita) were great. My friend had a personal pie from the \"Grilled Pizza\" section and hers looked amazing!\n\nI would definitely recommend this place to my friends if they're looking to wind down together - plus it's BYOB :)", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "Comfort. Basic. Cheap. Friendly.\n\nWe were looking for a quick bite on a Sunday, and every cafe and brunch kinda place was packed as always, so we fell into this place.  This spot was perfect for a quite bite to start the day.  With great combos, you can't beat the price.\n\n- Mushroom Pizza \u0026 Cheese Pizza:  These squares of pizza have a fluffy crust, so it's not the super thin new yorker kinda pizza.  It was tasty and good.\n- House Salad:  Salad was fresh and a ton of it. It seemed like it was not from a bag, and overall, a nice looking basic salad\n- Rigatoni: The rigatoni was cooked well and had a good marinara sauce\n- Panini with Prosciutto: A big ole panini that was served up well and just a good comfort panini.\n\nThe food isn't like crazy impressive, but its above average.  For a quick bite with a staff that is nice and attentive, I would definitely make this a rotation of regular spots to visit.", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-30", "description": "There pizza was good and I was happy with their salad. But my favorite experience is eating outside in their \"garden.\" The lights hanging outside make the dinner even nicer when the sun is setting. Popular place for families and kids.", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-30", "description": "It's a pretty laid back little pizza joint serving up slices, salads, sandwiches and other stuff.  The pizza on display was in square, cookie-thick pans with various veggie offerings, simple cheese \u0026 tomato, or pepperoni (though you could request other meats).  \n\nThe vibe/décor has a bit more character than many bare bones joints... more like someone's home kitchen, with magazines to read and the radio playing sing along rock.  \n\nIs it journey-worthy, pizza mecca type place?  Are they experimenting with radical new flavor combinations?  Not really.  But that's fine.   Sometimes you're simply hungry and want a decent bite.   I'd be happy to have it around the corner as an option.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "ok. for the people who are looking fore \"decent pizza''..........just shut up. Layla Jones is not your ordinary pizza spot so dont compare it to others. \n\nThis place is trendy, with down to earth workers.\n\npizza is actually really good. obviously not the best. But really Reaally good. like u can bite it, and be like mmmmmmmmmmmm. u just know its different. price isnt expensive at all.", "author": "Ali F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "Such a great (and surprising!)  pizza experience.  Try the Sweet Jane, it's a square-style pizza with homemade red sauce, whole-molk mozzarella,  fresh pesto, and imported romano cheese.  Fantastic,  I can't wait to try them all.", "author": "Molly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Best sandwich I've had in awhile. I had the grilled chicken with goat cheese press. It arrived promptly, was still fairly warm, flavorful and very fresh! Will definitely be ordering again.", "author": "Shanell R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-23", "description": "My sister and I had been wandering around, looking for a reasonable priced dinner spot when we came upon Layla Jones. The menu looked appetizing and the prices were right up our alley. As soon as I walked in I was hit with the most incredible smells of garlic, yeasty dough and simmering sauce. Although the inside may be small, the garden area is perfect for a summer- fall inner city escape date night or relaxed night out.  My sister and I love to order two items and split which is what we did with the meatball parm calzone and chicken press sandwich. The meatball parm calzone was on pesto focaccia bread which was fluffy yet crispy and stuffed with delicious meatballs, slightly crisped cheese and sauce. It was all you could ever want. The panini had a great bite from the peppery arugula as well as the sharp goat cheese which was the perfect contrast to the calzone. I will be back again and I can't wait to try the pizza! The pepperoni pizza going by looked and smelt amazing.", "author": "Fiona C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "awesome!!! quick delivery, wonderful pizza and calzone. for me, just one pizza or calzone is enough for 2 (not to eat too much). very good :)", "author": "Ana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "I am obsessed with this place!! They have got to have the best paninis ever! They're sauce is so fresh and good. My favorite is the meatball panini. Staff is always really sweet, even if not always the most attentive or fast. I've never had a bad meal here.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-18", "description": "My new go-to neighborhood quick pizza place. I don't know why it took so long for me to stop in. Fresh pizzas, pastas, pressed panini and salads. Great daily $8 dollar combos with either 2 slices, pasta or sandwich with a salad and drink. The staff is ultra friendly and unlike most pizza joints, the seating area is clean.", "author": "Christine G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Layla Jones", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ioXzmylicLmgyEgrvQd0dg/ls.jpg", "@type": "Restaurant", "telephone": "+17186242361"}