{"aggregateRating": {"reviewCount": 173, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "Food was super fresh and delicious.  Cute seating area out back.  Service was very friendly and nice.", "author": "Jay B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-16", "description": "The first time I ordered Layla Jones, I had the plain jane combo... which was very \"plain\" to say the least. \n\nThe second time, the delivery guy had brought the pizza all broken and mangled up, it was still pretty good, but we called none the less and they gave us a free order the next day (they were very nice and attentive about it).\n\nOn the third day, we got the Prosciutto Pizza (w/ roasted peppers and mozzarella)... and OMG! This is one of my favorite pizzas!! They're so good!! It's the best pizza delivery place by far in my neighborhood. You have to try it, if not for anything else but the prosciutto pizza. Yum!\n(TIP: Add just a little olive oil on top).", "author": "Lia P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-09", "description": "This pizza is okay. But ... $27.75 for a large pizza (sausage, black olives and onions) and one can of diet coke? That's literally insane.", "author": "Molly P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-05", "description": "This is probably one of my favorite pizza places in Brooklyn.  I'm a big fan of old fashion rectangular pizzas and I'd rank this higher than Harry's or Adrienne's.  The garden is awesome for parties and the staff is awesome.  The sandwiches/panini's are great too.", "author": "S. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-29", "description": "Great value in the neighborhood.  Good service from friendly people.  Very kid friendly.  A family favorite.", "author": "Jose D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-23", "description": "I LOVED this little place in Brooklyn.  After dining out all weekend long in Manhattan, I was more impressed by Layla Jones than any other restaurant (some even 5 times expensive).  AND, they got my order wrong!  \n\nI ordered a Meatball Press for lunch.  It comes with a salad.  A HUGE portion of food for only $8!  AWESOME.  I got the Mozzarella and Tomato press, to which they quickly brought a meatball and sauce to my table and profusely apologized.  No big deal.  The meatball and sauce were awesome.  Adorable patio for outside dining.  \n\nI highly recommend this place for lunch on a Sunday.  Not too crowded.  The owner is there, on site, making sure his customers are happy.  He's a nice guy who knows good food.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-16", "description": "I know layla jones is competing with some heavy hitters in the area as far as pizza is concerned, but I really love their Plain Jane pizza. Sweet tomato sauce and whole milk mozzarella deliciousness. Plus this eight slice gem is only $14 (tax included).  BUT...avoid the margherita pizza, it's disappointing.", "author": "Joanna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-17", "description": "My husband, my 11 year old daughter and I LOOOOOOOVE this place!!!  We have been regulars for years!   This isn't just an ordinary pizza joint!    Yes, the pizza is perfectly thin crusted with the freshest of fresh ingredients but the rest of the food rocks too!  There's something for everyone here - whole wheat penne cooked al dente with fresh mozzerella and juicy meatballs for my carnivore husband, a \"Plain Jane\" pizza for my daughter and for me, their roasted veggie pizza  -  thin crusted  with goat cheese and thickly cut portobella mushrooms, zucchini and roasted onions ...YUM!   There's salads and salad dressings are yummy and fresh also.\n\nThe atmosphere is casual and great for families with young kids.  It's never loud and routy though, just relaxed. We LOVE the outdoor space on warm days!!!  The owners and wait staff are friendly and helpful.  \n\nDefinitely check this place out, especially when the warm weather arrives!", "author": "Amy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-15", "description": "Never a bad slice here! Paninis good too. The special that comes with salad and soda is unbeatable. Fantastic hidden garden, perfect for hanging out in on a lovely spring night with friends w/kids. T", "author": "S. M. S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-08", "description": "I am a regular at Layla Jones. I love listening to the satellite radio they have playing while I eat (usually on an 80's station). I often hear a throwback song that makes me want to bop my head and dance. Aside from the music, I love the wild mushroom grilled pizza and rigatoni with sausage. I never order anything else because I like the combination of those two items so much. You can also get a slightly smaller (but filling) portion of the pasta with a mixed green salad for an extra dollar. Great neighborhood joint.", "author": "M. P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-19", "description": "I took two bites and threw the rest out. Absolutely skip this one.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "Solid lunch place for when you're strolling down Court Street.  I'm not the biggest fan of re-heated slices, which they usually have.  Instead, come here with someone else and order a fresh pie.  The sicilian squares are pretty good.  When I come here, I usually just get a meatball hero, which to me, is one of the best in the area.  And for the warmer months, you have the cute little patio.  Service has always been good here and the guys that work here are friendly.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-15", "description": "This pizzeria is great. They have very good fresh out-of-the-oven pizza. Their tomato sauce is to die for, as well as the cheese. This is true New York-style  pizza, with a crispy thin crust. They have nice outdoor seating, as well as a few tables inside. Great place to go for a quick dinner. They have great salad, too!", "author": "Johnnie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "Great little lunch spot.  Service was spot-on - quick and friendly.  I can't rate their pizza, but the pasta and press sandwiches are delish.  Aside from the food itself and the friendly service, I must admit the price is another big plus!  Layla Jones makes really good food accessible to us struggling students on a tight budget!  What's more is the place just felt really comfortable - small and cozy and they didn't rush anyone through their meal.", "author": "Vicky L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-24", "description": "This teeters for us between 2 and 3 stars. The presses make for a lovely lunch and are reasonably priced with salad and drink. But the pizza misses the mark: perfect cheese, great pepperoni, but dry (no sauce), dreadful crust, and a few suspect toppings better nixed (pickled sweet onion). I think we only bother because Sam's, just down the block, doesn't deliver. Because he doesn't have to, as this lesson tells me.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-10", "description": "It's interesting what happens when people review pizza places in this town.\nI was just checking out the reviews of Pinos in Park Slope, and was pretty surprised to see how well received this fairly pedestrian pizza is.  Don't get me wrong, I like Pinos, but this is not a review of Pinos.\nOne afternoon, as I was returning from a client visit to my design studio, I found myself standing in front of this recently renovated space, figuring it was simply another pizza place in a borough overrun with okay pizza.\nI saw the selection, and was a bit more impressed; it seemed instead (especially the name) that maybe I was in a Two Boots knockoff.  I think Two Boots pizza is better than average, but I'm not always in the mood for that hard crust.\nOkay, the point is...the crust at Layla Jones is fantastic.  Really great.  Pizza is a form of bread, and the experience of the crust is, i think, critical to the enjoyment of the slice.\nThese guys get that, and I think it's really great. \nNext time I go, I will probably opt for coming at dinner, having a more leasurely meal at one of the nice tables they've got set up...", "author": "Alexis K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-01", "description": "This neighborhood pizza joint is a perfect example of why I love brownstone brooklyn.  A small joint with tasty pizza and salads, great prices, super friendly owner and waiters, and a wonderful backyard for the summertime.  Very family friendly and fast delivery.  A great cobble hill mainstain!", "author": "derek v."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "Very fresh ingredients and the people are very nice. It is great to finally have a pizza place near my house that isn't greasy. Try the personal pies!", "author": "Jon C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-02", "description": "I swear they used the parmesan from the green can.  Undercooked and bland.  Woeful.", "author": "Benjamin H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-09", "description": "It is worse than your average street corner pizza slice, but will cost you the same or more. Sorry won't be back.", "author": "constance k."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Layla Jones", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ioXzmylicLmgyEgrvQd0dg/ls.jpg", "@type": "Restaurant", "telephone": "+17186242361"}