{"aggregateRating": {"reviewCount": 173, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-29", "description": "Nom,nom!!.... never expected this pizza to be so delish! It's the crust, so lite,almost pastry-like. I had a slice of  Mozzarella and Basil  and a pepperoni slice. ....omg...:D", "author": "vanessa s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-25", "description": "I finally tried this place after years of walking by it.  I know a couple friends like it a lot and order regularly.  I ordered a pizza with prosciutto and caramelized onions - attempting to replicate my favorite crispy flat bread frozen pizza from Trader Joes.  You have to really bring it if you claim to have great pizza in New York, and particularly in this neighborhood with it's solid Italian roots.  The pizza is okay but nothing special.  It is definitely NOT crispy thin crust pizza as advertised - the crust is as thick as a 1/2 inch in some places, and has the puffy airy quality of a yeasty pizza dough.  It is also curiously sweet.  The sauce is also very sweet and tastes like it is probably out of a can. The flavors are generally not bad, and the toppings were generous and the service was fast...it is just not stellar, gotta' have it pizza by a long shot.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "Pizza is my thing, and Layla Jones definitely does it well. I have not actually eaten at this place, but have ordered delivery a number of times. The price is right, and I have never been disappointed. \n\nI highly recommend their kalamata olive personal pizza, their big grande pizza, and their grilled portobello salad.", "author": "Marianne S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-12", "description": "I think there is better pizza to be had in Brooklyn and Manhattan - pizza with crispier and chewier crusts and fresher mozarella. However, Layla Jones didn't have a long wait and had a very tempting meatball pizza staring at me from their display window. It hit the spot but for 16 bucks a pie, \n\nOn the plus (or minus) side, venturing into Cobble Hill makes me want to have a baby and buy a Maclaren stroller.", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "Yummy pressed sandwiches on homemade bread and really tasty slices that are cheap and ready fast.  They also deliver slices (albeit with an $8 minimum) so that's pretty awesome.  The prosciutto pressed sandwich is amazing, as is the margherita pizza.\n\nNot sure why they have such a low rating, since Layla Jones is a neighborhood staple for lots and lots of people.  This is good food at slightly inflated but still very fair prices.  Great for kids, too.", "author": "Abigail S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-11", "description": "I have ordered delivery from here several times. I always get these personal sized grilled pizzas. So far I have had: sausage, ricotta, peppers;  grilled veg. w/ goat cheese; and finally the mushrooms and spinach.\n\nThe Sausage pizza did not travel well at all. The peppers made the whole crust super soggy. I put the pizza back in the oven at 250 for awhile tho, and it helped to crisp it back up (not totally). Some slices were totally soaked thru and others were fine.   I really liked the idea of this pizza, so the next time, I asked for it without the peppers. I loooooveed it ! I loved the creaminess of the ricotta, saltiness of the sausage, and sweetness of the caramelized onions. I could eat this everyday. My only complaint was that without the peppers it felt slightly (sliiiiightly) dry. I tried to order this again, but was told that they cooked the onions, peppers, and sausage all together and could not eliminate the peppers. ::sigh:: That is the end of that pizza for me.\n\nThe next one i tried was the mushroom/spinach . It was good, not great. felt dry. plus the crust (on all) are a little cardboardy.. I needed something to really make this pop for me. \n\nIf you like goat cheese, you'll like the grilled vegetable pizza. They put squash, egpplant, mushrooms, and other veggies. Yumm...feels healthy with all those veggies. My only complaint would be the goat cheese distribution varies, so sometimes it feels like more is needed. \n\nI doubt this needs to be said, but the pizza is light years ahead of the regular chain joints that somehow on. I still like My Little for the Supreme Pie. but for something different and a more gourmet type feel I'd go here. (yet to try Franny's). Update: The regular plain pizza is totally boring and mediocre.", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-02", "description": "good pizza - -especially the individual grilled pizza.  but i'm really a sucker for the salad -- great for a pizza place. nice vinaigrette and good quality ingredients. nice neighborhood delivery place.  great for kids -- the nutella pizza is a big hit!", "author": "Liz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "Love this place. The food ROCKS. Staff is friendly and there isn't too long of a wait. Lots of children during the day but the food is so yummy that it is worth going.", "author": "Abby D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-04", "description": "The overpriced pizza can be described in a word - bad!  Haven't tried anything else nor will I.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-08", "description": "Layla Jones is one of our go-to restaurants in the neighborhood. The staff is always very friendly and treat my child like a queen. The garden is fun and a great spot to enjoy the nice weather.\n\nI love the pressed sandwich/salad combo and my daughter is a big fan of their pasta, which they will make in a kid's size.\n\nIt's hard to beat for good, consistent food and unfailingly friendly service.", "author": "Martha L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-26", "description": "Unlikely to go back here. For $3.75, I got a tiny piece of pepperoni pizza (about 5 inches square) that was extremely greasy and just not good.", "author": "Kait K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-13", "description": "Wow!!!!!\nFresh mushrooms and freshly sauteed spinach.\nUnexpectedly delicious.\nAlways thought the name was stupid, but the pizza is FANTASTIC.", "author": "cynthia V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "BYOB, mushroom pizza, meatballs.  Perfect for a pre-movie destination.  Very friendly staff also!", "author": "Tim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-01", "description": "My family loves Layla Jones. We like that the pizza is a step up from a regular pizza joint and we are comfortable bringing our two toddlers here for a night out. The chicken and goat cheese press sandwich with a salad is my usual go to and its really tasty - also the chopped salad is filling and fresh - makes me feel like i'm not veering off my diet.  The girls love the pizza and meatballs. The staff is friendly and they deliver to us!! we live a half block beyond their zone and we are so grateful", "author": "Amy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-16", "description": "A square pizza with a thin crust is very refreshing her in NYC. I really enjoyed the change. Great crust, good sauce and it is close to the theater", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-17", "description": "We just ate dinner in the garden last night--we got one of the meal specials, with salad, pasta, pizza and jello and I really have no complaints, sort of. The atmosphere in the garden is very relaxed. It's totally fine to take two small children on a Saturday after 8 PM without feeling like you're stepping on anyone's toes or invading adult space.\n\nI'm really waffling on this review though because Layla Jones has quickly become a neighborhood institution, and the owners have sold their personalities and community rootedness as much as their food. And I like the owners. And I like the garden. And we've been to three or four birthday parties there in the last couple of years. And we've ordered take-out, too, on occasion. On the one hand, I would give the owners a 5 for being awesome. \n\nBut this is the hard part. Most of the time, the pizza is reliably fine. Especially if it's ordered for delivery. Perhaps because it has time to cool a bit in transit so the toppings adhere to the crust.  But last night, the pizza crust was soggy, there was too much sauce under the cheese and the cheese slid off the crust so my two year old was covered in tomato and grease. The pasta was perfectly cooked, but the sauce was very, very sweet. The salad was mostly mixed greens, and my brother who's visiting from Memphis remarked that we were paying a lot to eat something we had in our fridge - bare mixed greens with a tablespoon of chopped tomatoes and light dressing.\n\nWe had a long day yesterday and came home late with no enthusiasm for making dinner. This is when living in Brooklyn is great. We can walk four blocks and find 25 different restaurants where they don't mind feeding children a little later than dinner time. We could have stayed home and made spaghetti and salad in the same amount of time it took to walk to Layla Jones and order and wait for our dinner to be served, but then we'd have to clean up afterward, and it's nice to get out when the days are long. Anyway. I am rambling. I wish the salad was a little more...more. That is all. I hate to pay extra to not have to clean up afterward and then feel like I could have done better at home.", "author": "Ariane B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "I really like the square slices here. Not too greasy, with yummy toppings.  I also like the lunch special here...options for pressed sandwIches, pasta, salads, with a side salad and a soda for 8.50.  \n\nThe staff here is really pleasant and friendly, which gets a place major points in my book.", "author": "Alice S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-16", "description": "Ate here recently and had really good spaghetti and meatballs. Waitress was really good as my friend had a wild child with her. Also have had the pizza which is square and different than your standard slice shop. Really crispy and delicious.", "author": "Zach K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-07", "description": "If you are looking for traditional NY style pizza, this is not it. Go to Sam's down the street for that. Layla Jones is a good lunch time pizza. It's decent.  It's cheap. The sauce has good flavor.  Cute and laid back atmosphere. The service is good, and the wait for pizza is short. We've been here twice for lunch, and will go again. It seems to be the place to go for moms with young children. We did order it delivered one night (because Sam's was closed) and it did not make the transition from restaurant to apartment well... it was cold and soggy.", "author": "Abbey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-14", "description": "Layla Jones, I love you. It is my go-to delivery place when I'm starving or can't decide what I want. The prosciutto-mozzarella pressed sandwich is always perfect. And delivery comes in less than 20 minutes. You guys are great!", "author": "A S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Layla Jones", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ioXzmylicLmgyEgrvQd0dg/ls.jpg", "@type": "Restaurant", "telephone": "+17186242361"}