{"aggregateRating": {"reviewCount": 173, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "I only tried their plain pizza but it is amazing. Great lunch specials and nice exposed brick walls. Clean.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "The pizza is good for the price, and the BYOB factor plus the back patio make Layla Jones a great place to gather some friends and chow down. \n\nThe service is also great, they make you feel like family.\n\nCheese pizza with tomatos was delish as was the meatball sandwich.", "author": "Grazina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-28", "description": "Ordered pizza off seamless. The sweet jane pie we got was super tasty! Decided to add sausage to the pesto garlicy goodness. Man, such a great idea. A pie is big enough to feed 2 stoners for lunch and dinner.", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "Okay, my Layla Jones take out experience this evening was so transformative, that I felt compelled, NAY - PROPELLED, to immediately and swiftly write this review. When it comes to pizza, for us there really is nothing better in the Heights. Don't even bother telling me about Grimaldi's... I don't even care. I am so in love with the mushroom pizza from Layla Jones that it's truly my go-to pizza joint. The sauce is mad fresh, the mushrooms are perfectly cooked, and the crust is so magically crunchy/chewy that it's just really the perfect pizza, in my book. \n\nENTER THIS GAME-CHANGING EVENING... Already content with LJ's pizza-tastic offerings, we decided to try their pasta. I am not kidding when I tell you that I am still thrashing around in ecstasy, drooling and gently moaning about the Sweet Sausage and Penne pasta dish that I only finished savoring moments ago... From the moment that the take out bag arrived on my kitchen counter, I could smell the majesty and regal splendor that was waiting inside. I dove right in and let me just say that every ingredient that these people use is top notch, first rate, world class deliciousness, and when combined, it just feels like you took bath salts, but without the cocaine psychosis that comes afterwards. I've just never in my life had anything so delicious. We've always loved their sauce, but eating it on pasta was like getting a back massage and a hundred thousand dollar raise at the same time. It was unbelievable. \n\nYou know how some low quality sausage has little bits of gristle and nasty $h!t in it that is the direct result of not thoroughly mixing the ingredients?? Not LJ's sausage! You know how some crappy places WAAAY overcook their pasta, resulting in saggy, depressing noodles that make you feel angry/sad when you put them in your mouth?? Not LJ's pasta! You know some tomato sauces taste like they came out of can... all metallic and over processed and they leave a gross aftertaste in your chew-chomper? Not LJ's sauce!\n\nI mean I could really evangelize for these people all night, but I want to go smell my leftovers and then get in bed so I can spend the rest of my night dreaming sweetly about my next encounter with LJ's sweet sausage penne.", "author": "Elle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-12", "description": "Came here with my family, had the grilled chicken \u0026 goat cheese pressed sandwich -- it was delicious. Absolutely everything on the lunch special menu looked amazing, but I can rarely resist goat cheese. I will definitely be back often to work my way through the menu.", "author": "Cesca B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-31", "description": "My husband and I love Layla Jones. Everything we've eaten there is delicious. The service is friendly and quick. The pizza is wonderful - we order the \"plain jane.\" It's a rectangular \"pie\" with a fantastic sauce. The crust is perfectly crunchy and chewy at the same time. On occasion, I order a panini. They are great. Also, the spaghetti and meatballs are wonderful. One of my favorite parts of my meals at Layla Jones is the mixed green salad that comes with many things. Their house dressing is perfection. We enjoy sitting in the lovely garden in the back. Our only complaint at Layla Jones is that people let their children run wild. But I think we tend to be super judgmental of parents - so that might just be our problem.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "Laaaaaaaaaay-La - The salad and pasta The Princess Bride and I had at this quaint BoCoCa eatery were really tasty. The backyard patio was comfy and cozy. What really struck us, however, was when the owner Lourdes, who was very pleasant, served us, and told us the etymology of the name of the restaurant. Layla is for her daughter (her hubby and business partner loved Clapton's song (Clapton actually wrote the song about his wife who used to be George Harrison's spouse)) and Jones is their son. How sweet and cool is that? Full on family biz built on all around familial love, a tribute to their kids, and a rock and roll classic. To paraphrase Slow Hand: What will you do when you get lonely/hungry? Go to Layla Jones!", "author": "josh j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-06", "description": "Would we have ever set foot in Layla Jones if there hadn't been a 20-minute wait at Sam's one night? Probably not.  I don't know what the actual Layla Jones looks like, but the name does not conjure a pizza maker to me. Still, it was pizza and movie night, dammit, so we were getting a pizza one way or another, and if we didn't have time to wait for Sam, we'd settle for Layla. \n\nAnd I'm so very glad we did.  In some ways, I actually like the pizza here better. Their well-crafted square pies hold up under a big pile of top-notch extras without being tough. (My favorite so far is the \"big grande,\" which is red peppers, meatball, red onion, and sausage. I know that translates to \"big big\" and I don't care.) If what you want is traditional, round, greasy New York pizza, you might be disappointed, but if you look at it objectively as food, it will make your belly happy.  I think there's a place for both traditional pizza and trendy, toppinged pizza in the world. On our last trip we tried the pasta bowls and sandwiches, and they're even better than the pizza, if that's even possible. \n\nThis is absolutely five-star food, no question. I've only got three problems with the place. First of all, they don't have a curtain up at the front door, so if you're eating there in the wintertime, be prepared to be blasted with cold air every time someone enters or leaves. Secondly, the wooden benches on the left-hand side are not very comfortable and make the table level a little lower than is comfortable. And finally, the kids. Good lord, I thought Dizzy's had the market cornered on squalling and strollers, but I was wrong. Layla Jones is a kiddie wonderland. I've got no problem with 95% of toddlers, but god, that other five percent.  The food here is very kid-friendly, so expect to see them around, and expect the odd ill-behaved child to disturb, if not outright ruin, a meal every fourth or fifth time you visit.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-23", "description": "An average Italian joint with the typical choices, what makes this place a return spot is the cleanliness and low key atmosphere with a very friendly and welcoming staff.\n\nThe Rigatoni, mozzarella and basil lunch special with a salad was the perfect size to fill one up comfortably.", "author": "Jeanine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "I don't like pies cut in squares. Can't fold like I like. I was hesitant but we tried this place on seamless. So good. Shocked how much I liked it. Different from any of the other local places but I liked it. We went with the Big Grande. Sweeter sauce and more of a buttery crust, but oh sweet baby Jesus was it good. So full and content as my buttery fingers tap away.", "author": "Tony H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-20", "description": "I love Layla Jones, it has good pizza and great paninis. I have also ordered their pasta and their pasta sauce is amazing. The service is nice and quick. The outdoor seating in the back is spacious and nice to see in Brooklyn.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-17", "description": "It is hard these days to make Sicilian pizza now that Artichoke is in town.  But we live in Carroll Gardens and can't always be running to alphabet city.  \n\nEnter Layla Jones.  No, the pizza is nothing like Artichoke except for the shape, but that is okay because the ingredients are fresh (go for the caramelized onions), the prices are reasonable and they deliver to my door.\n\nI don't usually have more than one slice but I will (with head bowed) admit I had three slices of the Layla pie.  Mmm mmm good.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "I stopped in yesterday for an early dinner with my boyfriend on Memorial Day. We decided to sit in the outdoor garden which was definitely a great choice. It was spacious and had wooden tables that gave it a backyard feel. \n\nThe food was FRESH, fast, and delicious. Another plus, the staff was very friendly and welcoming. \n\nWe will definitely be coming back to this restaurant and can safely add it to neighborhood favorites!", "author": "Amy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-19", "description": "Good god in heaven, this is some kinda pizza!\n\nThe sauce is fantastic- and the lasagna pizza is literally one of the best things I've ever eaten- and a total deal for $18! The ricotta and mozzarella cheeses were clearly very fresh and the crust is crispy and delicious, and doesn't take up too much space on the pie.\n\nLunch specials here are awesome, too- $5 for two (large!) regular slices and a soda. The delivery took a while, but this place is definitely a go-to in the 'hood.", "author": "Amber S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Good pizza for a hot Cuban girl, ...named the place after her kids....this is what im talking about, no need to ever wait in line for good pizza. Don't believe the hype...this is good pizza", "author": "bill l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-20", "description": "Lived in the neighborhood for years and always wonder why this place is still open.  I give it a try every few years just to see if I've missed a major change, but it always proves to be mediocre. The menu looks great, but the food is bland and utterly forgettable.   With other great options in the neighborhood, don't waste your time (or taste buds) on this place.", "author": "Jess E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-01", "description": "I had a party there for my wife 2yrs ago, poeple are still talking about the food and the backyard.\n\nMan the food was good and the staff perfect....\nI hope to have another party there this year..", "author": "Eddie F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-10", "description": "I got the whole wheat  Wild Mushroom Pizza, the pizza was flavorless. This was the first time I ordered from here and was not impressed at all. It will probably be the last time I order from here. The delivery was 20 minutes late and the pizza was cold.", "author": "Constantantine M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-06", "description": "I can see women appreciating the red lipstick accents, the standard clean food, the familiarity of it all in a Felicity sort of way. The square pies aren't heavy at all and theres not much grease on there. And while I am sure the regular clientèle are familiar with blotting, I would be surprised to see anyone soaking up the grease with their napkins before eating.\n\nI can see men appreciating the way it makes their woman feel.\n\nI do feel kind of bad giving it 3 stars - the ladies in there are so nice! But comparing it with other of my 4 star pizza joints, it just wouldn't be right to put in the same ballpark. To me, the tightness of it all makes it feel manufactured. It doesn't seem to me to be homemade ingredients, possibly because of the uniformity of it all. The toppings are all precisely diced, taking away each one's individuality. I appreciate a topping's desire to say \"Look at me!\" I say let it live!\n\nI wouldn't hesitate to come back at all. I pretty much know what I am getting here, and it's fine by me. The staff seems to love what they are making, and that is the most important thing. For times when I don't feel the need to have a meals that makes you pause to think what's good about life, Layla Jones will do.", "author": "Jeff O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-01", "description": "I admit, was heading to Sam's but the were closed for vacation.  Found Layla Jones (it is easy to miss) and had a nice Plain Jane pizza.  Crust was thin and tasty and not at all greasy.   They are BYOB but happily pointed me out to a bodega next to Sam's where I was able to buy a cold beverage to bring back.\n\nI would go back, or better yet, is a good delivery spot.", "author": "Richard S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Layla Jones", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ioXzmylicLmgyEgrvQd0dg/ls.jpg", "@type": "Restaurant", "telephone": "+17186242361"}