{"aggregateRating": {"reviewCount": 173, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Just stopped by for a quick lunch. I had a slice of pepperoni while waiting for my grilled chicken panini. It was outstanding and the panini, accompanied with a salad, was just as good. The prices are very reasonable and the food seems very fresh and was delicious. Also, the service was very quick and courteous. I'm very happy that I found a great new lunch spot.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-15", "description": "Stumbled into this place last night (10/14) post-Elvis Costello Night at BookCourt up the street, needed a good and fast dinner solution before getting back on the bloody road, this seemed to be inviting enough and not some pretentious steakhouse or whatever.  I dunno about the pizza, didn't try any, it sure smelled good, the warmth coming off those ovens was insane, but in any case, I ordered a basic chicken parm. hero and it was fine, the portion wasn't over the top but it was tasty enough and it was hot and not over or undercooked, nor burnt, so that was fine by me. \n\nIf I'd known they offered a Sweet Jane pizza I might've turned smart aleck and got one, then asked for the follow-up, the \"Sister Ray\" pizza, or the \"Caroline Says\" hero. I\"m sure LJ is glad I didn't! Comes with amphetamines and extra cheese. But as usual, I digress. The service was fast, the food solid, staff were nice to me, so I'd recommend this place if you're seeking a fast slice or pie or heros and press sandwiches, they do offer limited seating in front, as well. I liked the place, it was dark and cozy, warm, and the food seemed decent and reasonable price-wise, to me, especially for this upscale area.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Great lunch spot. Fast, reasonably priced and delicious. My son loves the pizza here - all square pieces made with fresh ingredients. They offer some great lunch specials as well. The service is always very friendly and it's a family owned placed which is becoming harder and harder to find in this neighborhood. Great for kids too.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "Still friggin' amazing. I love this place so much.  Pepperoni pizza is my fave.", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "love this pizzeria and they're not so traditional square slices are my favorite they're not cheap on the sauce or basil and cheese three of the most important things in a pizza a little off topic but I actually like the packaging", "author": "Allen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Amazing pizza and caljones!!!! The delivery is really quick and the food is always on point.", "author": "Ria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "Hand down the best pizza ever in a quaint, cozy, candle lit diner. my hubby, Chuck and I frequent this place for date night. The pizza is to die for. thin crust that taste like freshly baked bread. great stretchy cheese awesome marinara sauce and delightful toppings. \nIf you are in CobbleHill you must check out Layla Jones.", "author": "Tsahai H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Fantastic staff who made me feel at home when I got stranded in the neighborhood for a few hours with luggage.  Grilled mushroom pizza is fab!", "author": "La B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "OMG ..... their Grilled Chkn Caljones was so awesome... cant finish it cause im stuffed but i wish i could.. and the deliver, im never leaving my office for lunch again. Cant wait to try the rest of the menu", "author": "Sapphire B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "This is FOR THEIR SERVICE and the awful response from management. If they cared for their Customers they would offer a better explanation as of why their third party system for ordering delivery does not work and places the order for the next morning if you order after certain time. You suck.", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-17", "description": "Soggy crust - even though we dined in. Swimming in oil on top. Fresh ingredients; poorly executed product. Kids loved it; grownups not so much.", "author": "Lisa R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-13", "description": "I've ordered from here once before for delivery and liked it enough to order again. But this will be my last time. I called in the order - using the menu ON THEIR WEBSITE - which apparently doesn't have their current prices. The price difference wouldn't have been a big deal to me had they at least been apologetic. The woman on the phone just said (first, scoffing), \"yeah- that thing's been wrong for a long time.\" Great. Was I supposed to just sense that the website menu isn't up to date? Pizza joints are ubiquitous in brooklyn - their attitude left a seriously bad taste in my mouth.\n\nOh, and the pizza was soggy and lukewarm which I would've forgiven because of the arctic cold weather but that, coupled with their disregard for direct and honest pricing means I'll never order again.", "author": "Minh-Ha P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-31", "description": "I have ordered takeout from Layla Jones many, many times without an issue, including a small catering order. \n\nHowever, tonight we placed an order around 6pm on Seamless (45-60min wait), and when I called 10 minutes past the 60 minute window I was placed on hold and told it would be another 25 minutes. My order was clearly never started so I asked for a discount or some freebie and was denied. When I asked to cancel the order, the woman I spoke to said the pie \"was already in the oven.\" \n\nNot a great way to handle a regular customer. As much as I love the pizza, I'll be going going elsewhere.", "author": "Alyssa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "This is our go-to pizza and pasta place. Great chicken parm pasta and hero. Also, the pizza is a little different - it's shaped in a square, thin crust, but it is excellent. Highly recommend it - also very reasonably priced and delivery is always quick.", "author": "Rosie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-03", "description": "1.5 stars...\n\nThe Sweet Jane pizza at Layla Jones has the unique distinction of being the worst pizza I've ever had. Their margherita pizza also has the title of one of the worst of that variety I've ever had as well. \n\nTheir pizza's are square with 8 slices. The sweet jane ($17) is described has having  homemade sauce, whole milk mozzarella, fresh pesto and imported romano. Loving margherita pizza I thought this seemed like an interesting twist with basil pesto instead of whole basil leaves. What I got was droopy soggy slices of pizza with an insane amount of garlic. I couldn't even get a hint of what any part of the pizza tasted like because of the amount of garlic on it.\n\nGiving them the benefit of the doubt I went back a couple days later and got a slice of their margherita pizza ($3.25). Sad that a slice without basil is $2.50. It's 75 cents for a topping whether that topping is sausage or some chopped up basil leaves. To their defense, and the only reason I rounded up to 2 stars, is that the basil is fresh and they give you a lot of it (too much actually). The slice was reheated in the oven so this time I actually got a slightly crispy crust. There was too much mozzarella and the little amount of tomato sauce wasn't that good. \n\nSeeing how this place has a good rating and none of the posted photos (as of this writing) are of pizza I have to assume their pasta and sandwiches are better. \n\nIt's also worth mentioning that they have a really nice back patio.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "I had my order delivered. If it was a little hotter when delivered I would have given 5.", "author": "Sean W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-06", "description": "ordered the pizza with meat sauce\nbread was soggy\n\"meat sauce\" is tomato sauce with chunks of meat added on top (plain meat with no sauce on it)\ndisappointing \ncheese was the best thing about this pizza", "author": "Sid P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "One of the tastiest slices in the neighborhood.  Light, airy and crispy crust with a perfectly seasoned sauce and the right amount of cheese.  If you're not in the mood for a slice, try their sandwiches. My go-to is the small meatball sandwich, served on a large garlic knot.  It's less than $5.  Great staff and super family friendly. \n\nThe only negative comment I have is that sometimes they serve pizza that is not particularly warm and as a result is cold and greasy. This is easily solved by having the staff properly reheat slices.", "author": "Hey A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "This place is fantastic! We have only had delivery from here, but we can't believe how good it is.  We have ordered the plain Jane pizza with meatballs and onions. The meatballs are fantastic- just the right amount of seasoning and moisture. The Caesar salad dressing is homemade and perfectly seasoned. I have to order it every time! We also have had the meatball parm calzones- very well seasoned- the pesto bread mixed with the soft meatballs and fresh mozzarella is the perfect match! The grilled pizza is the perfect size and very thin. Very impressed all around!", "author": "Mimi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "Just ordered and ate a chicken and spinach calzone for the first time from Layla Jones.\nThe verdict - YES!", "author": "Gabor C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Layla Jones", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ioXzmylicLmgyEgrvQd0dg/ls.jpg", "@type": "Restaurant", "telephone": "+17186242361"}