{"aggregateRating": {"reviewCount": 173, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-17", "description": "This was not one of those \"artisan\" pizzas everyone has been raving about.  It will probably not make too many \"best of\" lists.  But my friend and I got a regular pie and ate the whole thing because it was so delicious.  Killer cheese and sauce, with just enough crust.  The outdoor backyard area is so cute, I'd definitely come sit out there again.", "author": "Karol S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "This crust pizza with good sauce and cheese that tastes like cheese and not plastic.  I like it.  I have to try the meatball dishes and let you guys know. Good Lunch special for 8.50.  Comes with  a good crispy green salad and a drink. I like it.", "author": "fayza a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-15", "description": "Cheap, quick and tasty-always a dependable meal here for me.  The chopped salad is a fave, and you can't beat a place that hires such a pleasant staff.  Not sure if they are still BYOB but if so, this is an amazing cheap date in summertime- they have a cozy little back garden that's lovely to sit in to linger over their pressed sandwiches \u0026 slices.  I also love their pasta- great portions for two to share along with a salad.  And they have a lunch deal-think it's $8?- that gets you a main meal, a side salad and a soda- ask about it.   I give them extra love for being neighborhood residents who started a business to keep the area local-centric and family-friendly.  For those of us with friends that have little ones, this is a great place to meet up without staff attitude- kids are encouraged!", "author": "Queequeg S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-24", "description": "So my kid loves pizza. And so do I but my expanding waistline does not. Layla Jones is the perfect solution. Great pizza and awesome salads and sandwiches.  The owner works the tables and clearly cares about the customer experience. The backyard is perfect. I love it.", "author": "Peter L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-25", "description": "We stopped by for a couple of slices on a Sunday afternoon.  Ther margherite (tomato, basil, fresh mozzarella) was standout -- crispy and flavorful.  The pepperoni slice was a little greasy and less crispy, but full of sausage and still godd.  The plain slice was the least interesting of the three.  Service was good, place had a good vibe, I'll be back when in the neighborhood, but don't see it as a destination pizzeria like Patsy Grimaldi's where I'll take the train to go there.", "author": "Evan B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-12", "description": "Not very good pizza.  The crust was soggy, the sauce was too sweet, and the toppings were soggy too.  Would have been fine if it was cheaper.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-15", "description": "I LOVE their pizza.  It isn't the typical NY pizza but the square shape, the sauce, and the doughiness of the crust make it PERFECT! The spaghetti and meatballs are delicious as well. I've never actually stepped foot in the place, only delivery, but it's always prompt and hot.", "author": "Jenny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "I wouldn't go to Layla Jones for the pizza (My Little Pizzeria up Court St. has them beat there), but oddly enough they have some delicious pressed sandwiches, pasta dishes, and salads. Anything with their meatballs is a good choice, and the sausage and peppers as well. Veggie options with goat cheese or fresh mozzarella work too.", "author": "Jeffrey P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-10", "description": "pretty decent pizza. really thin. tried probably 4 or 5 different kinds. i think the sausage/meatball/onion/pepper may have been my favorite along with some type of white pizza. all in all i guess it was a bit bland but it did the job.", "author": "J A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-18", "description": "Some of the best rated Brooklyn pizza places are right in the area but most nights ill stick with Layla's.  This is good pizza!  Something about it brings me back to my childhood.  The sauce is a treat with its touch of saltiness, not too chunky, not too smooth consistency and it is not sweet which I find to be a problem with some pizza places.  The pizza is cut into squares and is on a thinner curst which is nice and makes for easy eating. Slices are not too heavy but after a couple you are comfortable and grease here is minimal.  I usually grab a slice on my way home from work. Favorites include caramelized onions, chicken breast and plum tomatoes or the simple, fresh mozz topped off with some fresh basil and delicious sauce. Perfect ratios of ingredients!   If there are a few slices of cheese left and they are pulling out a new pie when you walk in they'll give you a slice from the fresh pie.  A pie fresh from their ovens here boarders on perfect.  The atmosphere is unpretentious and cute. It's a small place and its red color scheme makes it warm and cozy.  The staff here is some of the nicest you will find.  \n\nOther noteworthy dishes include: \n-Any of the grilled pizzas. (These are awesome and could easily be a meal themselves.)\n-Rigatoni with sweet sausage, onions peppers basil.", "author": "Ray S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-24", "description": "really great, cheap, fast pizza.  the staff are all cool.  the pressed meatball sandwich is also a winner.", "author": "matt r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-31", "description": "I've been skeptical of this place for no good reason. Ok, I was skeptical cause it's a pizza/everything fast food italian kinda joint named Layla Jones. And it's on the corner of my street so I've had plenty of opportunity to try it. Well,  I got my chance last week and was actually kind of BLOWN AWAY. I was rushing to meet friends from out-of-town at a bar and then going to see the excellent Neurosis and Mastodon show in Ft Greene. I needed something fast, and hopefully delicious, cause the G Train let's you out below Moe's. I quickly ordered two pepperoni slices and started walking to Smith street when I realized how awesome this crust was. Not only was it light (and filling) it had this slight buttery taste that was so tasty with the pepperoni. I immediately felt ashamed I hadn't even bothered to try this place. I'm currently giving it 4 stars because I haven't eaten anything else but it's edging past that. definitely check it. It looks like they do mostly Sicilian but not the high doughy kind. Almost like Frankie's 457 but with some more density. Check it!", "author": "carl g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-03", "description": "Very tasty square shaped pizza!!!  If you're are 'crust' fan...you've very much enjoy their buttery, light, and crispy dough.  And if you're a tomato fan..the sauce is fantastic!  I'll have to branch out on the menu next time.  Cozy place with friendly staff!", "author": "Giuliana E."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Layla Jones", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ioXzmylicLmgyEgrvQd0dg/ls.jpg", "@type": "Restaurant", "telephone": "+17186242361"}