{"aggregateRating": {"reviewCount": 173, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "I love this place, pizza is amazing here, highly recommended for pizza lovers.\nI would like to recommend their pasta, it's really wawww.", "author": "Marwa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "What a beautiful place to have lunch. It's a small place with a cozy old school vibe. You can't ask for better customer service. They are so nice and helpful. I ordered the spaghetti and meatball lunch special with a side of salad. It was absolutely delicious. The sauce was flavorful. The meatball was fluffy and well seasoned. I definitely enjoyed every bite. I will return...Soon! :)", "author": "Coco B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "I love this place - I get delivery all the time, and their pizzas are so good. Really, everything is really good! I've had pastas, calzones, pressed sandwiches, salads, and pizzas and I've never been disappointed in the food. Delivery is fast and the delivery guys are always friendly and nice. I highly recommend!!", "author": "Allegra L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-14", "description": "Excellent square pizzas in a small cozy space with super cute outdoor patio.  TRY THE CHOPPED SALAD!  Staff is wonderful.  Great space for kids and a quick dine and bounce.", "author": "Dimo J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-24", "description": "Average. Burnt pizza and I'm shocked it got such good reviews. My BF and I went there on a Friday night and it was EMPTY...no\nwonder.", "author": "Ava B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-07", "description": "Am I missing something? After reading tons of great reviews we decided to order a large margherita pizza. The sauce was fantastic (a very saturated tomato taste) and it came covered in basil (which I can't get enough of on a marg pizza) but the crust kind of tasted like a frozen pizza crust. Very cracker like in taste and consistency. We were very disappointed after reading so many positive reviews. I guess our hunt for the perfect pizza in the hood is still on....", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-28", "description": "Margherita pizza arrived stone cold and very less of Margherita sauce.. will never order again.. soggy soggy crust :(", "author": "Niranjan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Meatball sandwish are amazing, the bread they used is pizza dough and not your typical italian hero. Fast delivery.", "author": "Jason P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "Excellent pizza and a neighborhood favorite for on-the-go, as well as for families.  The dough is light, airy and crunchy and the sauce is bright and fresh, without being too sweet or sour.  They use high-quality ingredients in all of their dishes and have a friendly, hard working staff.   Indeed, most of their staff have worked there for over five years, which speaks volumes about how they treat their employees and customers.", "author": "Hey A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-23", "description": "Nice lunch option in the work neighborhood! The lunch special is under 10 bucks and comes with your choice of salad, sandwich or pasta and a soda. My friend and I shared the rigatoni with sausage and the meatball/mozzarella/tomato/basil sandwich both with caesar salads. \n\nThe salads were a bit overdressed, but I quite enjoyed it. Out of our two entrees, the rigatoni was the more flavorful one surprisingly, but the sandwich was quite good as well. It came on a pizza crust kind of bread and that was actually my favorite part. \n\nService is friendly and pretty quick. I would definitely recommend if you are in the mood for a hearty Italian lunch!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "This is our cliche don't-wanna-think-about-dinner-let's-get-pizza spot. The Easy Special is the perfect dinner for two and a little lettuce makes you feel like you're not completely forgoing nutrition :) The cheese on the Plain Jane gets this perfectly toasted cheesiness that I haven't experienced anywhere else. Reliable, yummy pizza.", "author": "Danielle E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-03", "description": "I don't get it. The reviews were all great so I ordered a plain jane and a side caesar. I found the crust oddly greasy and with a slightly buttery taste, almost more like a pastry than a pizza crust. The sauce was fine but the pie lacked flavor overall. I would rate this a decent pizza elsewhere but not in Brooklyn where there is such amazing pizza to be had. The caesar dressing was mildly sweet which was off-putting. In addition, they did not send any cutlery (which I asked for) or the red pepper flakes I requested.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "One of my favorite places for lunch. I always order the same dish at least once a week. Great meatballs and very pleasant people that work there.", "author": "Anthony F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-18", "description": "Pizza smelt amazing, but was extremely  soggy and greasy. We ate it because we were so hungry and got a stomachache. Definitely not ordering the pesto pie again. \n\nDelivery was very fast otherwise.", "author": "Luis G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-27", "description": "It's no Lucali, but still extremely delicious BYOB pizza place in Brooklyn. We split 3 pies between 6 people which was plenty. Had a lasagna, artichoke, and a margarita. All were great with the lasagna being especially awesome.\n\nOur waitress also had us sample a new chocolate pizza they were making which had nutella. Interesting and pretty good, but the three we had were better.\n\nOverall, I'd give this place a 4.5, but I'm nice and I round up. Definitely can't go wrong here.", "author": "Dave N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Great pizza place!!\nI literally go there every day get my favorite meatball n mozzarella sandwich!! Only cost 4$ !!\nPlus 2 slices of pizza and a soda is 5$ only too!!\nMy favorite lunch place on my workdays!!", "author": "Ronnie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Being from CA we were on a mission to search Brooklyn for some great Italian food...Layla Jones had an incredible Caesar salad, mouth watering spaghetti with literally the biggest meatballs, and the most delicious lasagna pizza... omg we loved it!\n\nAnd what made Layla Jones even better is their prices are very reasonable and best of all they have a wonderful outside patio! Great ambiance ... Just perfect!", "author": "Jason T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "Went here after finding an article of top 10 places in Brooklyn. This place deserves to be on there. Pizza was delish!", "author": "Brittany S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "I've lived around the corner for way to long to just have realized this place has great delivery/ pickup!!", "author": "Quirkish Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "Can one have an orgasm from eating a slice of pizza?\n\nOkay, that might be a tad bit melodramatic, but it certainly was a damn fine pizza. We ordered the Plain Jane (thin crust, square with just the right amount of sauce to cheese ratio) with mushrooms and kalamata olives and it was delicious. The sauce was what made it for me made with sweet, bursting-with-flavor San Marzano tomatoes. Also had a side salad with radicchio and greens which was the perfect accompaniment and prevented me from consuming more than two slices of pizza. Oh yea, I'll be ordering from them again.\n\nOink.", "author": "Lisa A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Layla Jones", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ioXzmylicLmgyEgrvQd0dg/ls.jpg", "@type": "Restaurant", "telephone": "+17186242361"}