{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "In the middle of a semi-starvation diet...i was friggin starving!...was in the area shopping at an incredibly clean and nicely staffed target.  Faced with the dilemma of too many fast food choices my fiancee and i choose Applebee's for which i was very reluctant after my very first Applebee's experiance exactly a year ago (  a horrid dinner only to be almost forgotten by the amount of booze rendered in my drinks).\n\nFaced with a huge overpriced menu of chooices that looks like in consist of precooked frozen calory laden food...we choose the burgers...don't bother which they all taste to a degree the same...our polite server asked how we want the burgers prepared and we answered med rare for each of use.  after a pretty long wait we got our grub...i was super famished and put on the feed bag...could not believe how tasty the fries were and how tasty the burgers were if they did arrive a lot more cooked then what we ordered( thats why ketchup was invented to give moisture back to dry food).  Overall a great experiance when faced with bad fast food choices.  will be visiting again .", "author": "Edward M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-17", "description": "Barely edible food with really, really bad service makes this my first bad review on Yelp.  My son's hotdog was cold and my daughter's chicken grillers was just a previously frozen, dried out chicken breast that they didn't even bother to fully cut into strips. That being said, we knew better than to come for the food and we'll give them a credit for attempting to have healthy options. \n\nThe real problem is the service at this location.  It took a really long time for the waiter to come around the first time. I'm just not sure if it's poor management or something else. We had asked the waiter to rush our kids food, which arrived quickly but before any drinks or even napkins/silverware. When I asked, the waiter didn't apologize, just said that I asked for the rush, implying it was my fault.  Not ok.\nThat being said, I'm sure he's a nice guy and it was busy on a Sunday afternoon, so maybe he just had too many tables and was frustrated???\n\nHalf star for being kid friendly and half star for keeping consistent with expectations.", "author": "Ali G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-11", "description": "This was the worse Applebees I've ever been to! You know it's bad when I'm still sitting in the restaurant yelping. Today is Veterans Day and I am a vet and I came here with my family and my sister who is also a vet. I am also in the food industry and server as well. We ordered drinks and waited fifteen minutes for them to come I asked for oranges for mine and it didn't come until I asked three different people for it and my food was in front of me. I ordered a soup and that also took forever. Finally when it was brought to me i realized my spoon was dirty. It took at least ten minutes for someone to acknowledge me to even get the soup out of my face. When my server came to me I told her what happened. She then came out to tell me there wasn't anymore. I was livid, not because of the soup but because of the matter of fact way that she said it. That's when I decided it was time to see a manager. When I tracked a manager down having to get out of my seat I tried to explain to her that I was a server and I understand busy but she kind of cut me off. I told her my needs as far as the soup and what happened said she could make it happen, but if there wasn't any soup in the building there was nothing she could do. Well there was soup and it came after my food was out. So as I sit here yelping no one has came to ask us if we were okay or acknowledged us. This is ridiculous and I can't wait to leave this place...I'm seriously just in disbelief if how bad this service is..WELL THANK YOU ALEX FOR SAVING THE DAY AND UNDERSTANDING THAT IT WAS THE PRINCIPLE. You were cool!!!", "author": "Chasity C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-23", "description": "Every time I've been to an Applebee's, it has basically sucked. I wish I could have better things to say about this place, but the service is kinda of slow, and the waiters don't seem to really give a crap about you. When I ordered a drink with my food, it came after my food did--really?", "author": "Michele L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-29", "description": "I gave this only two stars not because the service was bad the service was sweet and welcoming i gave it 2 stars because of the wait from the kitchen and I had the Bourbon chicken and well....the chicken was dry and under seasoned as well as the shrimp they smeared this raw garlic substance on my protein and the potatoes were also under seasoned also some were under cooked thank you it was my daughters birthday dinner, she however enjoyed her meal of the nine ounce steak, cooked to a lovely medium rare garlic mashed,which was to die for, and crisp lightly salted broccoli so on that note I changed my mind and added one star thank you again", "author": "Jay N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-23", "description": "Service is absolutely terrible, I practically have to track down a waiter for EVERYTHING! But the food is good and the bahama mamas are a must.", "author": "Define_Me N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-23", "description": "An employee who work here came st8 from the street and went right behind the bar and made her friends top notch drinks and food. Our food was cold and dry. I order a strawberry limeande and it had strawberries at the bottom. Why? I had this drink several time and they made it wrong.... They were closing early bc of maintenance thats not my problem.", "author": "Maylin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-26", "description": "I've gone to this one far more than the one in my area and this one has A LOT of hustle and bustle. It's some characters in here too. The drinks are stupid strong but if that's your type of thing... I also spotted a guy that played in The Wire stopping through here over the summer. It's close to everything so I like it.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "I really like this place. My boyfriend and I randomly entered this place to get a bite to eat around 10pm. \n\nWe got the 2 for $25 deal. The food was okay, nothing to boast about. It wasn't the BEST food I ever had, but it was good enough for a chain restaurant. \n\nWe ordered a margarita and long island iced tea. They were great! \n\nI love the atmosphere. The wall art is really cool and the seating areas are very intimate. I dislike very bright eating areas and this place is nice and dark, just how I like it. I love the lamps, too. Our waiter was really funny and pleasant. He took care of us and we took care of him. \n\nIt is not loud. There are people sitting around the bar and either watching television or talking to each other. I see a lot of couples and friends having a nice time together. It's like another world in there. \n\nI am actually going back tonight because it is tequila day and I want that amazing margarita. I got the large one, which is the size of my head. It was made VERY well. \n\nI am not a super picky person, but my boyfriend is. The fact that he wants to go back there tell you enough. \n\nThere are people that are TOO sensitive when it comes to service. This is not a four star restaurant and no one is there to wipe your backside, with all due respect. \n\nI would definitely check this place out if you're in the neighborhood.", "author": "Irina C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-10", "description": "If you're a vegetarian, there are just some places you shouldn't go to.  Sausage factory.  Pig roast.  Republican National Convention.  And Applebee's.\n\nI've been in Applebeeses before, but they at least tried to have something vaguely edible on the menu, this one had the craziest foods: Caribbean pasta, Thai noodles, WHAT?  I ordered a soup and salad and then had to send it back because the salad had BACON on it.  IS NOTHING SACRED?  It wasn't even a *hint* of bacon, the bacon had solidly proliferated the salad.  \n\nUnless you're going for cocktails and appetizers, don't try to actually eat anything at this Applebee's.  Try Chuck E. Cheese upstairs.  They may have a cheese pizza option for vegetarians.  They just might.", "author": "Meghan Sara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-24", "description": "The clientele who frequent this restaurant are drunks, loud, needy and treat the servers poorly (including the tip,) which may influence the attitude of some of the servers there.  Also, there tends to be a high turnover in the restaurant which also doesn't help.\n\nIf you're looking for a fine dining experience, Applebee's isn't for you, and you shouldn't expect it to be.  But, if you are looking for an affordable meal with a variety of choices, then I recommend Applebee's.  Dishes vary from pastas, steaks, salads, burgers, sandwiches and southwest dishes and there is surely something to please even the pickiest eaters.\n\nThe restaurant has tried to alleviate some problems, including removing the jukebox from the bar which was blasting loud profane music.  \n\nThe servers are for the most part, nice, but can also very easily be flustered due to the high volume of clients.  If you need something, be polite and it will help you get things quicker.\n\nThose looking to get drunk, I don't recommend dining here.  The drinks are made well, but are not strong and will only leave you with a slight buzz when you leave.  One of the unique things about this location, however, are the \"tooters\" or little test tube shots you can order in addition to your drink for $2.", "author": "Justin W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-13", "description": "Captain's Log - Star Date 12192007\n\nI came here to wait for S for dinner (not here). \n\nI encountered Brooklynites. Many of them were ugly. Many of them were loud. No, commanding officer does not classify them as Brooklynites. They are a different species. They were ghetto. \n\nI requested a black and tan. The server agreed. Five minutes later, she realized none of the Bass or Guinness taps were operational. So I settled for a Sam Adams Winterfest. What f--king morons. They must be Ferengi.\n\nThe saving grace was that I enjoyed watching Detroit defeat Boston, 87-85.\n\nCaptain's Log - Star Date 01312008\n\nI came here to wait for S for dinner (not here). \n\nI sit down at the bar. The crowd is just as appealing as the first time around. There are three females behind the bar. Ten minutes go by and one decided to ask me for my order. This time the taps are working. I order a Blue Moon. I chugged it, paid and left.\n\nLIU students and faculty get a discount. Sorry it's not good enough for me to ever want to return. I may eat those words within the Next Generation or Deep Space Nine.\n\nI leave you with a moment of Zen:\n\n    ___________________               _-_                          \n    \\ ==============_=_ /   ____.---'---`---.____                  \n                                      \\_ \\       \\----._________.----/                  \n                                         \\   \\    /   /        `-_-'                          \n                                 __,-- ` . `-' .. ' -_       \\ \\                          \n                                /____               ||         \\ \\                       \n                                        `--.____,-'            \\ \\\n                                                                       \\ \\\n Nooooo! I was going to                              \\ \\\n hook up with someone                                 *\n in there! And she didn't\n     speak Klingon!\n         /                                                              *************\n      O /`                                                            [ applebees ]\n     / |                                                                |        __         |\n      / \\                                                               |       |    |         |\n-----------------------------------------------------------------------\nIFHTP 3+", "author": "Peter K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-20", "description": "One must lower their expectations exponentially when entering an Applebee's. I don't know what neighborhood they are referring to in their line, \"eating good in the neighborhood,\" but they must have low expectations in that hood.\n\nIf I was going to start a restaurant and wanted my employees to see firsthand all the ways a restaurant could go wrong, I would bring them here on a field trip.\n\nRude service (if you can even call that service), inedible food, awful atmosphere.", "author": "Molly M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-12", "description": "If there was an option for no rating this place would deserve it. Food is tremendously nasty. Everytime i've ate from this apple bees i ended up with a stomach virus. And ive been here only twice. I wish i could get my money back. Because this place is the worst applebees in new york. Food is horrible never going here again. Needs new management!!!!!", "author": "Rabia J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-27", "description": "This is a really nice place to eat a sit down meal within this area. Especially with my university being across the street. There's always tables available and the waitresses and staff are generally attentive to your needs. Their food comes out a greasy, that's my only complaint. Their portion size are huge for what you pay for, at least I think so. There's nothing generally wrong about this place. It's just your generic Applebee's.", "author": "Andy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-05", "description": "Horrendous service with an Attitude.\n\nI went to the Applebees in Atlantic Terminal today to grab a bite to eat while shopping.  I rarely go to these chain type restaurants and prefer the cafes available in Clinton Hill however I was starving and needed something fast.  I also had heard about their \"Skinny\" drinks and Weight Watchers meals so I figured, why not?  Big mistake..  \n\nWell this review is on the service.  I sat at the bar and it was HORRENDOUS.  The young lady behind the bar had an attitude the moment I walked in.  Several other of the wait staff were standing around doing nothing but gossiping.  It took her 10 mins to notice me, another 10 mins to get my order all the time rolling her eyes in their sockets.\n\nThe little shrimp dish I ordered took 40 minutes to come out.  By this time I was asking for the manager.  When he came over he refused to look me in my eye, I literally had to wave my hand in his face.   I told him about the delay in my order, the stank attitude and mediacore service.  He did nothing but mumble then tried to tell me how the dish was made.  He did not charge me for the meal however and for that I am grateful but it in no way made up for that place ruining my pleasant Saturday afternoon.\n\nFirst time there, last time there.", "author": "Yolande B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-09", "description": "I took my family to have dinner at the applebees in Atlantic terminal located on 139 Flatbush Ave on Thursday 12/05/2013 at around 830pm.\n \nI had a complain about a grease burn my son received while some food was passing along side of our table.\n\nWe were seated at a booth in the back of the restaurant near the kitchen. My 3 year old son was sitting near the isle. The waitress was bringing a sizzling platter to the table next to us. Some of that grease splatter landed on my sons upper lip area as she walked by our table with the tray held above her shoulder and possibly to close to our table. Which was returned to the Kitchen after the customers disapproval of it. \nI didn't realize the severity of the burn until the next morning,\nwhen my son was still complaining about it.  \n\nI feel the proper precaution wasn't taken into consideration to protect your customers as well as your employee", "author": "Maria J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-13", "description": "Worst service around I'm not sure if they are always under staffed of the wait staff is just terrible. We had to wait 20 minutes for milk for our toddler. We ordered it straight away because its lunch time yet every order took about 15 min average to be fulfill. It took 15 min to place napkins on the table too. We watched another family simply leave because they hadnt been served at all sikce they arrived 20 min prior. This place needs to get it together.", "author": "Mickey M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-02", "description": "The one thing I hate is a bartender that doesn't understand simple bartending terms. I asked for a margarita and told the bartender to make it a \"double\" and she told me that she couldn't do that. Then I had to explain to her that it just means an extra shot of the liquor and that she would have to charge me double. When I get my receipt I realize that I was charged for three drinks because she put 2 shots on top of the one shot that already comes in the drink. Either way I got drunk so whatever. The food was average and the serving sizes were decent for the price. Service was cordial and frequent. I would come back but never during happy hour because its packed like a can of sardines up in there!", "author": "Carlesha O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "I find this place to be an excellent place for breakfast, lunch or dinner. I always go with my sister and we always have a good time. The food is great and the staff is friendly and speedy. Great overall customer service. Never had any issues what-so-ever with the staff  there. Plus, the location is extremely convenient, right in front of the R train stop on Dekalb ave.", "author": "Jatnna T."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}