{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-16", "description": "Never been to an Applebee's before - this was my very first time. I wanted something healthy for dinner. Unfortunately, in this particular area of Brooklyn, there are no businesses that offer healthy food options. I decided to go to this Applebee's to get a salad to go. I ordered the salmon. It was $17 and change for one piece of grilled salmon over romaine lettuce. Waited 25 minutes for it. The staff is helpful, but the bathrooms are dirty, and the to-go waiting area was very dingy - stuff all over the tables. I will not be going again to this location, or any other Applebee's.", "author": "Count C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-30", "description": "Seated very quickly. Not sure why I was seated at such a large table being alone. Ordered food, came at a reasonable time. Triple burger was very tasty but not alot of bacon. The fries portion was quite small. A bit overpriced for a small meal. Also not sure while in mid bite of my burger my waitress asked me if I was ready to pay my check. The place was not crowded. Not so bad.", "author": "PapaLou T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-08", "description": "The hostess station for 10 minutes while they pretended to help another guest tho conversation was awfully personal then 32 minutes and 2 requests to be waited on....FUN (insert sarcasm here). I sure hope the hostess with the bun has something to fall back on. Eventually her looks will fade and if she has to rely on that nasty attitude she won't last long. Food is already ehhhh. The least they could provide is good customer service. Our server was sweet but overworked. I hope they don't pool and split tips.Thank goodness for the bartender who made our drinks.", "author": "Brielle W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-30", "description": "Don't want to waste my time writing a review on such a crappy place, the service is horrible and slow they really took over 20 mins to take my order and another 20 mins to get me a cup of water not to mention been here for over a hour and my food hasn't come out", "author": "J.C H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "Only my second time eating at an Applebee's restaurant, and it was solid, though not as good as my first. We had their 3 for $20 menu with steak and baked potato, chicken fingers with fries, and spinach dip, salsa with nachos (all pictured). Everything was great and cooked well, our server lady was happy and cheerful if a bit slow, and it was a perfectly good meal.", "author": "Hwal L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-18", "description": "I ordered a regular cheese burger ( with no cheese, no onions, and no pickles) and got a super dry burger with onions and pickles -_- It literally hurt my jaw to chew on it. It came with no mayo, one soggy piece of lettuce and one tomato slice. My friend ordered a chicken tenders basket and it came in a plate (Not a basket) with 4 chicken tenders (not 5 as displayed on website menu) and a handful of fries. It looked like a children's plater and he's a grown ass man.  After getting our other friends order wrong about 3 times she spoke to a manger and didn't have to pay for her meal, which she didn't want anyway. Don't waste your time or money, if you want a cheese burger go to Wendy's and get that 4 dollar combo.", "author": "Erika S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-10", "description": "I wish there was an option for no stars.\n\nManagement of this place should be ashamed of themselves for what a disaster of an establishment this place is. They've got brain-dead employees so tired they act like they're ready to go home before you've even placed your order and they take SO much time not only taking your order, but actually serving your food. You're better off going to a REAL restaurant with actual class, not this wanna-be fast food restaurant with dirty floors that takes advantage of their customers due to being in a good location. They're not staying in business based on skills. They're simply lucky to be in a busy location where people eventually get hungry and will eat anything, including glue.\n\nThe reality of Applebee's is gross looking, sloppy food, really small portions, offensive prices akin to highway robbery, bland, unsatisfying flavors, overly chewy consistencies, al dente pasta, and absolutely unappetizing presentations all around. I thought a dog threw up in my food, but apparently that's what they serve you on a regular basis. There are very few foods on the menu that are actually portioned large enough to call a \"meal.\" The photographs on the menu make everything look much larger, but what you get is half the size. They didn't give me enough food to feed a cat, let alone feed me enough for the horrendous prices. Their overly seasoned, high sodium food will give you a heart attack or stroke before you make it to the age of 35, yet the flavors are undetectable and drowned out in the slop of sauces they mix together. This place is not worth the arm and a leg which they charge you, nor your first of kin unless you actually believe this place is a charity center for the blatantly rude, inconsiderate, and pathetic imbeciles that they are.\n\nI ended up with diarrhea the night I went here and then hemorrhoids later on for sitting on the toilet for so many hours. Shouldn't I send them my doctor's bill?!! Eating at places like this is how people in NYC become homeless. I can't afford these dramatic bills.\n\nHonestly, I'd rather just order in from my nearest Chinese food restaurant any day than do any favors for these rude pricks! I don't need to lose money on a landfill of a place like this ever again nor did I need the low-class rudeness I endured from the bitch waitress who flirted with my boyfriend but who gave me the snob treatment upon ordering. Staff like yours makes people anti-social when social skills are completely essential for survival in NYC. Get some manners, Applebee's! You just lost me FOREVER!", "author": "Leslie R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "The other reviews pretty much says it . There was no one to greet us at door. You would think since its located near a train station it would be packed ,but it's not. The staff is young and vibrant though.", "author": "R P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-21", "description": "Its Applebees.. same as every Applebees... just that its Ghetto.. lol... just ghetto. . The staff is poorly managed.. The mostly female serving staff  socialize with 'regulars' like they are back in high School. These regulars are gawking men who are only there to drool over the women, and be loud. ITs unprofessional because the bartenders, and servers entertain it.. Instead of waiting on the rest of their waiting customers.. rediculous but true..", "author": "Lorenzo J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "I went here a few weeks ago on a Saturday afternoon. \n\n1) The AC was OFF on a hot day outside. I dont even know why we stayed but I figured I'll drink some water and be fine. \n2)The waitress was VERY hood. Cursing and the whole bit.....but she was helpful nonetheless.\n3) They tried to charge us for something we didn't even order (the manager had to take it off when the waitress clearly knew we didnt have that smh)\n4) We were ignored for a whole 10 minutes before someone even came to us and it took way too long for our food to come.\n5) The drinks were beyond watered down.\n\nI have come to the conclusion that I will never eat at Applebee's again.  I tried to give a few locations a chance and its always an issue. I'm done!", "author": "Elaine B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-23", "description": "Poor. I'll say it again. POOR. Sat at the bar the read the menu. Was not busy with one person serving. I was patient and waited for the bar tender to take my order. Finally she arrived and I didn't even get the hello out when the server was distracted with a dish to give to another person waiting for their food. Still sitting there patient and waiting. After the server came to my end of the bar four times and walked away I decided to go to juniors. I won't be ignored there. That's for sure! So I do not tco end anyone to got to Applebee's period. Wasted my 30 minute lunch break for that.", "author": "Benito P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-15", "description": "CRAPPLEBEES!!!!!\n\nIf there was half-a-star option, that's what I would truly give this place. Poorly run, took forever for the food and place wasn't crowded at all. Went for half off apps with friend. Waiter brought out the wrong order, apologetic, he returned with my correct order soon after. Cold mozz. sticks. Ew. When we received the check, I was CHARGED for the wrong order brought out. I immediately  told the waiter about the error, it was fixed. \n\nFriend wanted to leave before we got our food. I insisted we stayed and give them benefit of the doubt.....Should have left while we could!!! Never left a place without giving a tip. Surprised how it's still up and running...", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-19", "description": "Food was rather disgusting. My two buds each got the riblet basket. Were both fairly hungry and didn't finish it mostly due to the unpleasant feeling of consuming said riblets. I myself got the fried shrimp and it was rather disagreeable and my other friend got the blackened tilapia and it was pretty disappointing \n\nThe brownie bite however made my review go up a star because it was pretty freaking good.\n\nStaff was also not attentive at all.  Aldrea a server was the saving grace of said staff as she came and checked up on us after some people brought in a 7 year old?? Who would not like he really would not just shut the fuck up like did his parents beat him on the way to Applebee's or something? \n\nWould not return to restaurant. But hey don't let me stop you from displacing your stomach and getting pissed off.", "author": "Albert A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-14", "description": "My friend and I sat there for 15 minutes and the whole time workers kept looking at us (and not just glances but making eye contact) but we never got any service.\n\nWe ended up walking out when the main worker who kept making eye contact decided to lean on a counter filled with dirty glasses instead of working.\n\nI know its an applebees and one shouldn't expect any kind of service but I have the feeling you have to get loud and ignorant in someones face before you are even acknowledged.", "author": "Stella E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-27", "description": "This place acts like it's the customers fault  they are busy!!! So your food will be nasty and LATE! The servers act like they take sips from your drinks and probably do shit to your food if you complain they huff and puff. I f**** hate this place. Can't wait til Outback comes *wishful thinking* bottom line one   the reasons why I opt not to dine in my hometown Applebee's!!", "author": "Abdul Naim R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-14", "description": "*UNPROFESSIONAL GHETTO STAFF, LONG WAIT, NASTY FOOD*\nIf I could give this spot no star I would.  I'm in shock of the people even giving it three stars...this place is GHETTO TRASH!  My friends and I came here after shopping and waited an abnormally long time for our food. All we can hear is laughter from the kitchen, a bunch of dishes \u0026 whatever else dropping and staff screaming ayyyyeee ayyye!! wth? Were they dancing in the kitchen? I never heard such mess in my life going to any restaurant!  When the food finally does come it is nasty...I only liked the salad and shrimp skewer , the raspberry tea was pure sugar and mind you I love sweet tea and my boneless chicken was so hard it felt like my teeth were breaking (I barely touched it).  My friends fries were hard as rocks.  I made the complaint to the waitress and the manager took a thousand years to come only thing I can say she was polite..and she took the \"rock boneless chicken\" off the bill. The childish staff however got real sarcastic and start playing with the knobs to the music and start blasting it real loud...one of my friends said it was too loud (nobody could hear themselves talk) they did that so it can blear out their ghetto behavior in the kitchen.  He lowered it, then I saw the waitress that waited on us whisper to another female co worker about us, the female responded oh well who cares about the music being loud, they complain about us too! All I can think is wow how in the world these people get jobs with such childish behavior.  The only one that seem half decent beside the manager gave us an inside scoop that one of the staff was in a physical altercation with a customer hours before we arrived there.. with that behavior I can see why a customer would jump at them...me I don't have the time so instead of whipping anybody's behind in that beyond hood applebee's I just didn't tip them and would never go there again. I rather starve!", "author": "Shaunte C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-07", "description": "Not my favorite Applebee's location due to it's service.\nI always have a hard time getting the waiter for my table attention.\nIt is like I am going on a search-party to find someone to assist me. \nThey occasionally mess up with my orders to, like the time I went with my boyfriend for his birthday- they forgot his side of grilled shrimp. \nBut I do like their house sirloin.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "Came here Tues 8/9 to watch Game 3, set at a the bar and had a great time... The two bartenders tall black girl and one shorter Asian girl were very attentive. Drinks were really good , my fries were cold but I didn't complain... I met some real cool guys at the bar, a lot of friendly shit talking. I set next to the only one white guy in the area, from Australia I think. We had a great time, suppose to meet back up today for game for...\n\nOnly complaint , there was no sound for the game they have little sound boxes but only one was working... Besides that good experience, way better than the one at Atlantic terminal they have the worst service in the world..", "author": "Paul H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-08", "description": "AVOID AT ALL COST! \nMy friends and I came here because buffalo wild wings next door was packed, worst decision ever. You might as well wait the 20 minute at BWW then to have no wait and horrible food and horrible service. The food was atrocious, I ordered the 2 for 26 platters with my sister- I got the shrimp and my sister got a chicken dish. The chicken was dried. It basically tasted (and looked) like they microwaved cheese on top. Nothing special. The shrimp and fries I got were supposed to be fried shrimp, I got small burnt pieces that tasted bitter. I couldn't even eat more than 3 pieces. The service was horrible as well. Do not come here!!", "author": "Amey C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-29", "description": "The most horrifying experience of my life. I usually love Applebees but this place had the slowest and most inconsiderate service ever. I arrived at 5:30pm and left at 7:15pm and we didn't even have dessert. We barely made Monday Night Raw at the Barclay's Center. You couldn't be more careless than our server who's name was (Blondie) She said at one point your food will be out in 5 min, it literally took a half hour more! No apologize or anything, we were just sitting there miserable. This place needs a totally new staff. Just Horrendous!", "author": "Rich C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}