{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-27", "description": "Bartender Britanny has the worse attitude possible she should be fired she talk behind costumers in front of others costumer \" she said people are crazy and keep walking\" she need another job really unprofessional", "author": "William R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-29", "description": "Worst service ever. Waited 30 minutes to be serviced and the workers show no initiative to help those who've been waiting. Would love it if they really took pride in their work.", "author": "Shomari J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-27", "description": "I'm a graduate student from the University across the street; because of it's close proximity, I have given this place multiple chances. Students are not welcomed here, nor does this restaurant provide a neighborhood friendly environment. It takes about 30 min from the time you are seated to get an order in, whether you are at the bar or at a table. The servers fail to check-up on their clients, so if you accidentally spill or need extra napkins... good luck! Also, good luck getting the check back promptly if you are in a hurry to leave, because it takes an additional 30 min to get it back. I am taking my business elsewhere the food and the drinks are totally not worth it. Hop over to dekalb market to grab a cold brew instead!", "author": "Lety M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-18", "description": "One word to describe this Applebee's is \"chilling\". Nobody works. Waiters just talks to each other. Waited 45 min to get a waiter to take order ...hence his defined as a waiter .and then 45 min for appetizers. And then 30 min more for them to get me my wrong order. I'd recommend this place to someone who all ready ate somewhere else ....or order it to go", "author": "Razni A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-03", "description": "Great servers...wasted money! My boyfriend and I just happened to have the same time open in our schedules and he wanted to meet for dinner yesterday. He'd been wanting to go to Applebee's from the night before after seeing the commercial. We arrived and were promptly seated by the hostess. Our server, Keisha, was in training and for some reason I can't recall the trainer's name. In any event, once they came over and introduced themselves, we placed our orders. We got a Jack Daniel's neat (prob not even a full shot), the white peach sangria (tasted like juice and no alcohol), the classic combo (spinach/artichoke dip bowl wasn't filled \u0026 the chips appeared to be rationed...mostly broken), shrimp skewers and grilled chicken wonton tacos. The tacos were missing a certain familiar flavor (ginger) and the chicken actually tasted powdery. The shrimp was okay but nothing to write home about. Everything else was minimal at best. I did order a 2nd bowl of the spinach dip, but that wasn't much better than the first. \n\nBy the end of the meal, we had a bill for $70. We were quite shocked at the end result because we couldn't figure out why that was such a high amount given the disappointing meal we had just consumed. For sure, we won't be returning any time soon. We can definitely find more fine dining experiences around NYC for such an astronomical fee!", "author": "Tris T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-10", "description": "This Applebee's is the worst!!!!!!! Don't go here they need a better operational system!", "author": "Oscar A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-10", "description": "They don't deserve even one star. TERRIBLE SERVICE!!! Waited with my group of friends for nearly 3 HOURS. Mind you the security guard was pretending to be the manager. There were so many empty tables they could of sat us to wait and have water but no. When we decided to leave that's when the employee decided to tell us that the kitchen was backed up. DO NOT go to this location.", "author": "Andreina A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-27", "description": "Wednesday night is ladies night starting at 6:00pm\nBar seating is the only place where you will get the discounted prices 4.00 dollar glass of wines 5 dollars for sangria and 8 dollars for a pitcher of sangria. \n\nI try not to purchase bar food but my friend bought boneless wings and it was fairly decent. Bar seating gets filled up pretty quickly. Apparently this is a popular hang out spot for students in my grad program. \n\nI personally like the bar for its prices on Wednesdays.", "author": "Emily S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-12", "description": "Theres a lot of comments saying long wait times and slow service, but I went during lunch time and I was seated immediately. It really depends on the time you go. Go during lunch because dinner gets really busy and wait times are ridiculous. I found everything to just be okay. My boyfriend got the riblets and its was so small, heavily sauced with bbq, and the texture just wasn't right. And don't get me started on the buffalo wings for our appetizer. The server asked us what flavor buffalo wings we wanted and I said spicy buffalo (i'm guessing it's the sauce on the wings) with blue cheese sauce dip on the side and it came like that in the picture below. Looks good right? False alarm cus it was so fucking sour, like they drenched it in lemon. I was so confused because i asked for spicy buffalo sauce buffalo wings and there was no buffalo flavor, JUST SO SOUR, I COULDNT EVEN EAT IT ANYMORE. That was such a huge disappointment, but the reason for the 3 stars is because my entree (spinach chicken penne) was pretty good. Everything there has super high calories so I won't be coming often.", "author": "Ada C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-29", "description": "Horrible place to eat. The bathroom was so nasty you may throw up. A lot of employees standing around doing nothing. No one cares. Slow service too.", "author": "Linda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "Firstly must commend the waiter on his great service to please us.\nMargarita wasn't good. Had it exchanged for a blended one and was terribly sweet.\nBoneless chicken wings were AMAZING!\nWe had ordered the Bacon Cheese Burger which came with fries. Sadly the cheeseburger was not nice at all. Lacked seasoning. Chips were also a little over done.\nAll in all wasn't a bad meal for the price.", "author": "Danny J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-19", "description": "Sorry to say I'm ashamed of Flatbush junction food became Unsatisfying and riblets were very dry And I had a desert cookie and ice cream with whipped cream and I was poor execution of the desert so that's why I gave them a one star but if look for cool atmosphere for sport and drinks that would be the place", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-01", "description": "Service was so bad. We had a waitress named jah-mya and she was absolutely horrible. So not tentative.\nThis place is absolutely horrible. Save your money totally not worth it! \nFood was cold \nWaitress took 40minutes to bring a beer that was sitting there the whole time \nChefs suck! They need a whole new system i am in the industry of food and service and i have never seen anything like it", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-01", "description": "No hostess  to seat us for like 15 minutes. Service was terrible. Food even worse. I can say I will never visit them again. They can be giving free food \u0026 drinks out.... I will kindly say a big NO THANK YOU.", "author": "Mary M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-30", "description": "There's not much needed to say about this place, all the other reviews says it pretty well. The people who work here all look like they don't want to work here and are all very tired or something. I've been here before and I really didn't want to come back but my mom wanted to. They now have electronic tablet like things on each table and it seems like it's for customers to order food on it. It also has games but you need to pay for it (guessed it before even trying). You would think the time they make you wait for the food (a long time), they should probably let you play on those for free, but nope, you gotta pay! \n\nMy mom and I ordered the boneless wings for appetizer (10 pieces of chicken and 3 old celery sticks). I got the honey bbq sauce because my mom doesn't eat spicy but the sauce tasted sour like a lot of lemon juice kind of sour. I don't think honey bbq should taste like that. We got the oriental chicken salad and the 6oz sirloin. For the sirloin dish, in the picture on their menu shows two sides, broccoli and three cheese macaroni. So when we ordered that, she asked if we wanted those two sides or if we wanted we can pick other sides, so I changed the broccoli to garlic mashed potato and kept the macaroni. She said that was okay but then she comes back saying that will be $2.00 extra for the macaroni, so I was forced to switch to fries. Deceiving photos and waitress who doesn't know her stuff. The chicken salad and the sirloin were ok, but at that point we were very hungry (waited a long time) so anything would've tasted good. And all that for only $20.00 which my mom claims to be a good deal. If it doesn't taste good, I don't care how cheap it is, it doesn't make up for it. \n\nI will not come back to this place, at least not this location. I've tried other ones before, some are just as bad and some slightly better.", "author": "Tom L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "Come here if you want dirty wine glasses and to be forgotten before placing an actual entree order.", "author": "Shari J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-20", "description": "This is probably the worst Applebees I have ever experienced. Starting with the ditsy hostess, who attempted to sit us at a dirty table with the prior customers drinks left. When asked if she was going to clean the table she took a soaking wet rag ran it across the table, and placed the menu on top. Smart...so now we have wet menus.\n\nAside from the shenanigans that carried out from the nights events, patrons being placed at others table, and a drunken guy passed out w/ EMT arrival the grand finale was seeing a mouse run from an unknown location to the waitress area. Bravo!! You will greatly never get $1 from me.", "author": "C R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "Not your traditional Applebees\n\nService is slow and And waiters look confused almost as if it's their first day on the job. Dirty bar counter and tables. Waiters look overworked as if they are understaffed.\n\nAvoid this place and save your money unless you are into the dive bar scene this is a bit similar. They are more places to eat and drink in the neighborhood. This Applebees needs a complete overhaul.", "author": "Brock S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-02", "description": "The place is dirty,  it looks like it hasn't been vacuumed in days, the windows are disgusting,  the bathrooms are dirty too,  the service is very slow and unfriendly.  I do not recommend this place to anyone.", "author": "Lucia Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-31", "description": "This is the second time I have been to this restaurant.   The first time was when it first opened .  The food was bad then and it still has not improved.  There is not enough staff versus patrons. The spinach artichoke was cold,  the tortillas was stale  , and the burger was raw.  We received a different order than what was requested.  overall there is no such thing as a negative star so I really cannot rate this establishment.", "author": "Judy G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}