{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "We've never eaten in the restaurant, we have done carry out many, many times. Food is always ready when they say it will be and it's always been fresh and our custom orders have never been wrong. As for carry-out, this is a great location!", "author": "Tiphanii M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-30", "description": "We were the only ones in there and it took a half hour for our food to come. Can't blame the waitress for that, she was friendly but never came by once asking if we needed anything. She took our orders, brought our drinks then brought our food and never saw her again. We paid at the table. Our drinks took forever as well.... the bartender seriously couldn't be bothered. I got my drink the ice cubes were melting already, it was sitting on the counter forever  because she took her time in between making the drinks and pouring beers. She seriously hates her job. We will never return. It shouldn't take an hour and 15 mins to order and eat a sandwich and one drink.... especially when you are the only ones in there", "author": "Chris R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-26", "description": "Inexplicably long wait time for a table, even though the restaurant was nearly empty. Extremely slow service. Wildly overpriced food. Save yourself! Don't go!", "author": "Charlie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-29", "description": "I tried to go for breakfast today on Friday. I was there at 9:15am as the picture shows the hours open is from 9am and online as well, says 9am. The doors were still locked, I seen workers inside so I knocked on the door. One female black worker saw me standing there, ignored me and turned around while an older white lady looked at me and served herself food to eat and walked to the back. I stood there for a while to see if they would open, I knocked on the window and the female black lady then told me they are not opening until 10:30 am. How inconvenient and very rude! Will never go back again, they are showing hours of operation to the public but are making up their own hours apparently. Do not go to this establishment in the morning because they do not follow the hours of operation for the public.", "author": "Amanda A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-08", "description": "Tired the chicken \u0026 waffles ! I. Asked for no salt due to my blood pressure.  Well it was loaded in salt \u0026 so salty it made my eyes squint. The waffles were not so good . But food was hot \u0026 came out pretty quick. The waitress wasn't the greatest by I've had worse.  Over all I wont attend this particular applebees anymore.", "author": "Tasha W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-02", "description": "The most ghetto applebees!!!\nI use to eat here yrs ago and the service was great, but now the service is bad, the waiters are so damn ghetto smh.", "author": "Emily O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-05", "description": "Do not eat at this establishment. The service is god-awful! You're better off going to McDonalds. The server, Gabrielle M,has no business working with the public. Her project-animal mentality does not work well in a public establishment. She has no business interacting with the public. I truly hope and pray Applebees gets rid of her!", "author": "Mark J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-02", "description": "Car broke down right in front of this restaurant happened to forget my cell phone manager would NOT let me use the phone to call a tow truck. \nSeriously?????\nNo customer service No service from me I'll go anywhere else. \nSad Sad Sad people skills.", "author": "Ron K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-29", "description": "Attempted to come for breakfast. The sign said Applebees opens at 9am, I Was there around 9:30am, the people were disrespectful. The workers saw me and turned away while they are eating their breakfast. Why have hours of operation if you don't follow it. For a well known chain restaurant like Applebees they should follow their postings/rules better. One worker turned away which was very rude and ignored me. Another worker made herself a plate of food and ignored me as well, while I was trying to get the attention through the window! I will let others know how unorganized and rude the staff is at Applebee's.", "author": "Not H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-23", "description": "It's just ruin the brand of AppleBee, not as like as the AppleBee I ate in other area. I rarely give one star but this place deserve it.\n\n   Waited about 20 mins to order, half hour to get the food. And the food was too much sauces, taste so sour. Me and my friends taste only couple bites and felt disgusting. I believe this is the most awful food I ever had right now.", "author": "Jiayi R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-01", "description": "I can't begin to describe how bad the service is here. Waited forever to be seated. Ordered two appetizers and drinks then maybe 15 minutes later ordered our meals. About 40 minutes went by without so much as a refill or a nod, our meals come out- still no apps. We ask the waiter, who never brought us forks by the way, where our apps were and he had forgotten to place the order. \nNo refills. No forks. No napkins. No appetizer plates. Appetizers came out when we got our check. Two hours wasted in the restaurant. (Ate burgers, so we just ate without utensils)", "author": "Nicole R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-14", "description": "Went there to celebrate Halloween (Boo!). I was dressed as Paul Revere, and my woman as a colonial lady in period-appropriate attire. The food and service at this establishment were quite good. I recommend the fish tacos and the one-dollar margaritas. However, the real story of my visit here concerns the patrons adjacent to my table. Or, rather, concerns me. About them. \nThroughout the entire visit, the middle-aged couple conspicuously stole glances at my woman and I, with expressions suspiciously reminiscent of hunger. Though they made no explicit attempts to contact us, we both sensed their intent. Seeing through their ruse, I made sure to loudly request for slices of raw garlic to be added to my tacos. Imagine my amazement when the two agents of darkness soon anxiously requested their bill and scrambled out of the restaurant. Indeed, I was now without question: we had just narrowly avoided an attack from interdimensional vampires. My companion and I furtively finished our meal and departed, acutely aware that these vipers might lurk behind any corner, ready to waylay us. In a stroke of great fortune, we arrived back at our dominion unscathed, and not missing a single drop of blood. While I pray these ancient beasts have retreated to another dimension or time (recent research has show that they tend to be quite fond of 1400s Romania), I am ever alert of them after that fateful day. Stay aware, they're out and they're hungry. Godspeed.", "author": "Randy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-18", "description": "Almost a full hour of waiting on food and ain't had a taste yet. Thought this would be a quick place to grab some food and a drink but this was a poor choice.", "author": "Kikee Auviance T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "Food is disgusting . Found hair on plate and the food. Service was below a rating. Would never recommend anyone here", "author": "Asha R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-28", "description": "Thee worst customer service I've ever had. The host was a dingbat with long fake eyelashes on. The manager was just as incompetent and useless as the host. Had to walk out because if just waiting for seating was this painful I could imagine the rest of the service. DO NOT waste your money or time. Place was empty yet a large crowd of ppl waiting to be seated. \nAbsolute disgrace!!!", "author": "Jaime M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-28", "description": "I was in the neighborhood and starving, so I thought I'd grab dinner before hopping on the train back home. My phone was dead so I didn't get a chance to look up reviews of this place before I went here - huge mistake. Don't be like me. \n\nWalked in, there was no one at the front to seat me. Waited around a few minutes, and a waitress finally asked me, \"would you like to make an order?\" I said \"yes, can I take a seat somewhere?\" She said, \"Oh.... you want table service?\" as if I had asked the dumbest question in the world. She told me to wait while she informed the host because apparently she could not seat me herself at any of the 40 empty tables (the restaurant was 15-20% full, max). \n\nOnce I finally sat down with the menu, I waited at least 15 minutes for anyone to even acknowledge me. My waitress finally came and apologized for the wait and took my order. I ordered a quesadilla burger with a black bean burger substitute since it's clearly written on the menu that black bean burgers are available. The waitress wasn't understanding me - I had to say it at least 4 times while underlining \"black bean burger\" on the menu for her. Then she asked, \"how do you want your burger done?\" and after I asked for clarification she said \"rare, medium, or well done?\" It was clear she had absolutely no idea what a black bean burger was, but I just said medium so she would get on with it. I also ordered a tomato basil soup since I was starving.\n\n15 minutes later, no water, nothing, and I overhear a conversation between my waitress and another waitress in front of me near the cashier, discussing how \"do we even have a black bean burger? What's that? Why would he ask for that?\" laughing to themselves, apparently oblivious that I could overhear them. They finally looked up and asked me awkwardly, \"do you mean a veggie burger?\" I told them that if they couldn't get a black bean burger, a veggie burger would be fine. So it was clear that my waitress hadn't even put in my order 15 minutes after she had taken it - and there was hardly anyone in the restaurant! \n\nAt least 20 more minutes go by and I get a house salad that comes with the burger, some substandard iceberg lettuce with cheese on top, but I wasn't expecting much. The quesadilla burger was the saddest $15.70 \"burger\" I have ever ordered in my life - literally a heated up black bean burger with melted cheese on an overly toasted tortilla, with half a teaspoon of pico de gallo. I wish my phone were alive so I could post a picture of the tragedy. I asked my waitress if my soup was coming, and if it hadn't been made yet that she could cancel it, but she retorted \"oh no, it's coming\" - as if it were silly for me to believe that it was not on its way. \n\nI ended up paying $27 for maybe the worst food I've ever had in New York and certainly the most inefficient and incompetent service I've had in a long time. I haven't written a Yelp review in over a year. I've worked service jobs and I'm always forgiving if my server gets my order wrong or is slow to get to me, but this experience stands out as one of the worst time and money sinks I've ever had. Please spend your money at more respectful establishments.", "author": "Paul P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-13", "description": "I used to come to this location frequently up until five or six years ago. I remembered the restaurant, staff, and food being good. So when I happened to be nearby this weekend, I decided to drop by for a quick lunch. I won't be coming back.\n\nPros:\n-We were seated quickly.\n-Our waitress took our orders quickly.\n-We recevied our food quickly.\n\nCons:\n-The restaurant smelled a little musty.\n-Out appetizers were kind of hard and didn't seem very fresh.\n-I ordered a chicken dish that I had in another Applebees location. The chicken was undercooked and the sides were just bad tasting.\n-The cups were sticky. I later wondered what the insides of the cups must have been like if the outside was dirty.\n-It kind of annoyed my that another cusotmer lost their belongings in the restaurant and the employees didn't really bother to help. If it were my items, I would be upset.\n\nI suggest walking or taking the train to the Atlantic Terminal Applebees.", "author": "Emily V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-19", "description": "Yesterday 12/18/18 was the WORST SERVICE I have Ever Received!!! I went to the bar and sat for awhile waiting for a menu. The person next to be had to get the Bartender's attention to give me a menu ( no acknowledgement Ever). Then, as time passed, I had to ASK her \"may, I give you my order??\" She took the order but then Continue to view one of the \"regular guest's\" phone before entering my order. As I continued to wait, I was NEVER offered anything to drink (she never addressed me at any point or time). So after waiting 23mins for food, i just left!\n\nI have never experienced such unprofessionalism ever! Sitting there over 40mins without any drink. I understand that this is a chain restaurant and people do not have much expectation of professionalism but this act is blatantly despicable!", "author": "Sade M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-17", "description": "The absolute worst customer experience on phone order in my life. Waited for 10 minutes, then got nothing but horrible attitude from the diva on the other end of the phone. We love Applebee's, but never, ever step foot in this one....", "author": "Anders C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-29", "description": "Worst service food was cold other items came that wasn't ordered when I was told I would get my food delivered they can which is highly ridiculous WORST SERVICE DONT WASTE YOUR MONEY OR TIME", "author": "Ashley D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}