{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-21", "description": "Simply terrible.\n\nFood is mediocre at best.  At least it is cheap.  Service is always super slow.  Sometimes you get a really nice server but really it's still very slow.\n\nThe first time I went there, I swore never again.  Then I gave them a second chance a few months later.  Then they opened for breakfast and I swore never again.  Then I tried it again a few months later.  Just stay away.", "author": "Brad K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-03", "description": "I was really surprised with the cowboy burger! It superseded my expectations. I walked into applebees looking for a quick lunch and fell in love with the cowboy burger. It was well seasoned, cooked and tasty. The only thing that I can find wrong with this burger is that it was small. Everyone looking for a good burger experience should try out the cowboy burger from applebees....", "author": "SpanishBOB N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-24", "description": "We stopped in this place to eat because we were in the mall and it was right there. This had got be the worst food I've ever had. When our food came it was cold and taste funny. It was so bad we ate very little of it. When our waiter asked if there was something wrong and why we didn't eat,  we didn't even bother telling him and even when he asked if we wanted it to go we said no just the check. We paid left and went somewhere else to eat. Not sure I would recommend this place to anyone.", "author": "Emaa T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-27", "description": "A decent choice when out shopping at Atlantic mall. Bourbon chicken with shrimp was very good. Will be back when in the mall again and hungry", "author": "Yan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-07", "description": "One word: AWFUL! Went here last night, waited 20 minutes for a table (when they had tables open and when I approached the hostess to ask why we weren't being seated she said because if she sat us there we would be waiting a long time.  Yeah didn't matter where she sat us because when we did get seated it took the server 20 minutes to come over just for our drink order!!!! UNBELIEVABLE!  However, I have to give her credit she handled it well having lack of management who was standing in the front on his cell phone doing ABSOLUTELY NOTHING!  These girls/guys were running around trying to please every guest when their manager wasn't assisting he may have ran one or two plates to a table but that is all.  He never once came over to apologize for the hour wait of a hamburger!!! What the hell is the kitchen staff doing in the back???  After the food finally came out I said to the server (which I don't quite remember her name but she was really sweet) \"I have to ask you something, what is up with the service in this place? And the kitchen?\"  She proceeded to tell me that they were understaffed and without her even saying that I had a feeling that was going to be her response.  There were a lot of employees around but I don't know what their job tasks were.  Anyway, I have to say something about the music, talk about loud!!!!  My 7 year old god daughter who was with us even said the music is so loud I can't even hear myself talk!  It gave me a pounding headache which didn't help with my hunger.  Anyway - I DO NOT RECOMMEND THIS APPLEBEE'S AT ALL!!  GO SOMEWHERE ELSE IN THE NEIGHBORHOOD IF YOU ARE HUNGRY - THIS PLACE SUCKS! MANAGEMENT IS AWFUL, HOSTESS IS AWFUL - only nice person was the server and if I had her name, I would of posted it.  You definitely saw the frustration in her face but she held it together the best she could.", "author": "Samantha H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-10", "description": "It was ok. It is in the mall...very crowded. Manager was very attentive. Food was pretty good but they were small portions. Great selection of choices but i don't think i would be in a rush to go back directly because of that. Money has to be well spent these days and other spots offer bigger portions.", "author": "Carl L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "Only two good bartenders.\nJoanna and \"Don\"\nSeriously...check them out. \n\nI don't sit anywhere else other than the bar. Trust me; do the same.", "author": "Cherron B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-21", "description": "I love going here for a quick lunch. The white peach sangria is delicious but today the service has been poor. They brought my drink, entree and appetizer out at the same time and there was a long wait. I have also been waiting forever to give someone my payment back. The food was good, decent", "author": "Casandra R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-30", "description": "I am a big fan of Applebee's. \n\nI love the fried chicken salad and the steak-and-potato-salad and the french fries and the Wonton tacos.\n\nApplebee's also has a pretty good beer selection for a chain restaurant.\n\nHowever, I can't recommend the Applebee's at Atlantic Terminal in Brooklyn, unless you go during the day.\n\nLet me make things clear.\n\nI've eaten at this particular Applebee's at least three times during the day, and I don't have a single complaint about the food or service during these visits. \n\nAt night, it's another story. \n\nThis joint does not know how to handle a crowd.\n\nMy friends and I started venturing into Applebee's to watch UFC events last year because the Buffalo Wild Wings next door was getting too busy on UFC fight nights. \n\nOn February 5th (night of UFC 126), my party of three (along with plenty of other customers) was kept waiting outside for 30-40 minutes despite the fact that there were at least five open tables inside the restaurant!\n\nWe were only seated after I brought the empty tables to the host's attention. \n\nA more-or-less identical scene played out on February 27th. There was a big crowd outside the restaurant, at least five open tables inside, and a staff that didn't give a damn.\n\nAnd after we were finally seated, the service was extremely slow, and my food was cold when I received it. \n\nSo from now on, my friends and I will be avoiding Applebee's for UFC events because the poor service ruins the entire experience.\n\nAnd it doesn't have to be that way. The aforementioned Buffalo Wild Wings deals with much, much bigger crowds, but is run like a well-oiled machine on UFC nights.\n\nAgain, I've never had any problems with this Applebee's during the day. \n\nBut at night? The people of Brooklyn deserve better!", "author": "Michael C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-09", "description": "This place was horrible. HORRIBLE. I went with my boyfriend when we needed a quick bite. We walked in to hostess waited for three minutes. We were seated and quickly decided what we wanted. After five minutes no one came over not even for our drink order. We waited.....5 minutes 10 minutes about 15 then we gave up. We just left just got up and walked out 100% horrid service.", "author": "Kenny B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-14", "description": "Actually, this review is for the Applebee's located within the Atlantic Mall (which for some reason is not listed). Suffice to say, my review is only three words: Worst. Place. Ever.", "author": "Leonard P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-10", "description": "I came here for dinner with my mom one day. It was pretty empty and the restaurant was not crowded at all. \n\n- The restaurant was a little dirty. We had to ask to have the table wiped because of a sticky substance and I found a pair of earrings and a ring on the seat cushion. It was as if no one had picked up after the previous guest.\n- The waitress was OK. We didn't know what we wanted, so we looked over the menu and the waitress acted as if we were wasting her time. Um ma'am, this is your job. You are supposed to help customers if they need help deciding. Also, she didn't listen. I specifically pointed to the advertisement for a half rack of ribs for 9.99 and she brought out a full rack which cost over $20!\n\nDidn't try any of the alcoholic beverages, so I will probably go back and see what their bar experience is about.", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-31", "description": "We come to this Applebee's about once every 6 weeks or so. There is usually a LONG wait for a table on the weekends. Afterr you're seated the service goes pretty smoothly. The waiters try to keep up, sometimes you may have to wait a little while longer because your waiter is so busy. Buy the food is familiar so it's ok . i like their Pammegranate martini's, and the Pina Colada's, and the bahama mama . haha.\nAll in all this place is ok. If you go on the weekend then you have to expect  the mass crowd.", "author": "Kristy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "I went there for lunch with my son last week and I loved it. We ordered the 2 for $20 lunch special which I found delicious, and also good portion wise. My waitress and serving guy were wonderful. I was very pleased overall. No guessing and figuring out the tip either since it's printed on the receipt. I also liked the fact that there were multiple tv screens with a variety of games to enjoy while eating and talking. Perfect place for a parent to go with a teen.", "author": "Jrodriguez R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-22", "description": "Horrible experience. Horrible. The food is disgusting, service was horrible. 1 hour wait with hardly anyone in there. \"Potstickers\" were like cardboard cutouts, tasted like complete garbage. My appetizers were brought out AFTER my main entree was given to me. Do not waste your time nor money going to this pitiful location. ribs were sticky and fries were DRENCHED in oil. It was as if they were microwaved, not fried at all. Disgraceful, is what it is. Sigh. If you wanna waste your money, time, and tastebuds COME HERE.", "author": "Sanaa D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-02", "description": "I can't believe I'm writing a review for Applebee's...but the experience there was too uncomfortable to resist. As Filipinos, my boyfriend and I consider ourselves 'people of color' and as such have dealt w/ our own issues with racism, but I personally have not been on the preferential treatment list as a result of Black on Black racism.  \n\nWell - there's a first for everything. \n\nWe came in and were promptly seated.  We ordered our drinks, appetizer, and food. Everything came out within 10 minutes. Then I began noticing the table across from us and behind us. Across from us was a group of 4 women who arrived before us. They hadn't received their food and when it did come out, the orders were wrong. Furthermore, one of the women asked for the popcorn shrimp in the sampler she ordered and was told that there was no more shrimp. Meanwhile, I got my California shrimp salad with no problems. The table behind us had to ask for menus and ask someone to take their order. Once they got a waiter - he gave them attitude after they asked why it took forever to be attended to and left the table!\n\nEVERYBODY in that restaurant that night was mostly Black, Latino, and the two Filipinos (us).  The waitstaff was all minorities too. Justifiably, the women were upset and while the waitsaff was trying to keep them from speaking to the manager - one of the women got on her cell phone and called the business line! After a heated exchange on the phone, the manager comes out and finally deals with them. \n\nToo little, too late.\n\nWhat was supposed to be a relaxed evening, turned out to be a pretty sad one. While our waiter was nice to us and the food was alright - I can't overlook the performance of the others who treated those women so poorly.", "author": "Yvette C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-22", "description": "My daughter wanted to go to this restaurant for her birthday.  the waitres did not paid us no mind when called more than 3 imes.  the food was horrible. i order the 2 for 20. gave me an old looking dried rips with fries, not even salad. the pina collada was nasty.  never aGAIN W ILL I GO THERE.  REGREAT NOT GOING TO MCDONALD INSTEAD WITH MY KIDS.", "author": "Lorena S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-17", "description": "Be prepared to wait and if you have Jordan as a server be prepared to be totally forgotten about.. He forgot to put in our food orders, took forever to bring us our drinks, and hides whenever you need him.. Awful service... Ordered the steak, asked for medium well, it was CHARRED...", "author": "Simone A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-06", "description": "I went on December 25th, and most of the places around there were closed. The service was pretty good but the food was a little greasy. We got the 26 dollar offer, which includes two main dishes and an appetizer. Even though it was late, we were treated kindly and the food was properly presented. I would give it another shot, for sure.", "author": "Rafael M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-18", "description": "This place has the worst service. I arrived and stated I had a party of two 5 minutes later another couple walks in and says the same thing and they are sat before me. They are extremely slow. I waited 30mins for a drink and had to have it taken for the bill. I don't know who the manager is but they need to be fired along with all the other workers at this establishment.", "author": "Ashley G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}