{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-06", "description": "I can't even rate this a 1 because this place was horrible. Horrible service. Horrible food. And I even got a stomach flu the best day which was the cherry on top of this horrible experience. I DO NOT recommend this location at all.", "author": "Jacquelyn Marie R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-05", "description": "One of the worst meals I've ever had--the  $25 strip steak  came  with broccoli that was so overcooked it was like eating green mush.  The steak itself was fat and gristle.  Service was slow  but adequate.  I will avoid this chain at all costs.", "author": "James B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-18", "description": "My food was good, had a simple burger and fries.\n\nThe service was SLOW , and it was only Lunch time 12 pm  and not a lot of people were there .\nIt took a really long time for my food to come out. \n\nMaybe they were cutting the beef lol. \n\n\nNext time I would think twice before coming back.", "author": "Shade C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-18", "description": "I was very hungry and came here to have some lunch. This is the worst Applebee's I've ever been to. I ordered French onion soup and it was the worst soup I've ever had before. It felt like they put soup from refrigerator in a cup and then made it warm in microwave. The steak I ordered was overcooked. The employees are young students, but it is little bit hard to understand what they say, it feels like you are appeared in ghetto, so it made me uncomfortable. \nI won't come here.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-21", "description": "Went out last night in an attempt to take my boyfriend out on a small date to celebrate. I usually have no problem with Applebee's, I love it. From the appetizer to the only dessert I get at Applebee's, the Triple Chocolate Meltdown. Now let me explain something- if there were a grade lower than 1 star that I could give this place, I'd give nothing. My server, Cheyenne, was extremely inattentive to my table. We waited 15-20 minutes to order our appetizer and sodas. Now let me start off with the appetizer. We got the combo for $18.99, which I thought would be worth it. It came with 3 measly (but delicious) chicken quesadillas, stale nacho chips and a decent Spinach/Artichoke dip, 6 mozzarella sticks you could taste the freezer burn on, and boneless BBQ wings that were basically poppers and were not appetizing at all. Then after that it took ANOTHER 15 minutes to get her to come back to take our orders. We both ordered salads with the burgers we ordered. He got a house salad with balsamic vinaigrette and I myself ordered a blue cheese lettuce wedge salad. His salad came first and only, with stale croutons and rotted tomatoes, the lettuce was obviously old and the \"vinaigrette\" was more over just vinegar. My salad on the other hand never came because according to my server, she thought I just wanted bleu cheese dressing on my burger, which I discovered on my bottom bun. My boyfriend got the Classic Burger (which is stated to come with lettuce, tomato, onion, and pickle) and he added bacon to his burger for $1.19. I orders the Mushroom Swiss which was literally just mushrooms and melted Swiss cheese. We received our burgers (mine being quite delicious) and his being just a party, bacon and the bun. They completely forgot to put on the burger what COMES with it. We waited another 5 minutes for him to get these condiments. We ate, freezer burnt fries included. Then instead of waiting another 20 minutes to flag my waitress down, I used the tablet on the table to order my dessert. After I finished my burger and waited for my dessert, I headed to the bathroom the first time that night. In the LADIES room were 2 girls (12-14 years old) and a boy in a hoodie around the same age. I ignored it, until I came out to wash my hands and the boy kept his face from me and even had the audacity to snap a picture at me. I exited the bathroom and literally had to wait for the manager Alex to be done flirting with a woman at the bar to complain. After telling him, he did nothing for myself (didn't offer to take something off the bill, a discount, something for free- nothing, when any manager would've). I finished my dessert- which NEVER gets messed up, except this time my ice cream was basically melted. We receive the check another 15 minutes later and I- being extremely displeased with the experience, paid EXACT cash and change and my boyfriend and I left the money on the table and walked out. Then and ONLY then did my server show he first genuine show of concern all night when she chased us down the block asking if we paid, because there was no card swiped. I in turn told her that the money was on the table and we proceeded to walk away. Worst experience ever.", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-21", "description": "This is the worst Applebee's I've ever been to . The staff is so rude and it's mostly black girls , they look pissed and rather gossip than take care of their customers .Do not go there !", "author": "Yannlo F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-15", "description": "Let me tell you about this Applebee's, today me and my boy friends ate at this location,  my food was cold, after I told the waitress about my cold food, the waitress headed up my food, I ate my meal, I asked for a glass of water 3 times, the water never came, I got from the table, walked to the front of the resturant, asked to pay my bill and to see the manager, I told the manager about the problem, he started making excuses for the employee, I gave him heads up!!!, three will be not tip at all, I was served cold food, and had to asked 3 times for water, then the manager tried to give me receipt without the list of things ordered, so I asked for the receipt with the list of things I ordered,  I checked the receipt, and sighned it, things got worst, me and my boy friend came with diarrea from eating food at Applebee's.", "author": "Gia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-16", "description": "Best restaurant ever! Beats the hell out of the ones in LA.\n\nHere's what you do:\n- Get the boneless chicken wings\n- Order a quesadilla\n- Quesadilla will have sour cream that is virtually inseperable from the iceberg lettuce\n- When you get to the last quesadilla piece, you top it with the chicken skin and the iceberg sour cream mix. (The skin should look like it was crawling across the plate.  Extra points if you line it up next to the quesadilla and move it like it is actually crawling on top)\n\n\"It was good. I'm still picking it out of my teeth\"", "author": "Kyle S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-26", "description": "The hostess at this establishment between the hours of three to five pm on Tuesday. She is rude and disgusting. I will not be coming back with my family. The staff members all sitting in the front and looked at us like we were stupid. Our waitress had to sit us at the table. She was friendly. I wish I can give you zero stars till you change your staff!", "author": "Shaheen F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-11", "description": "Do no come here. The food is terrible. If the run out of one ingredient for a dish, they will replace it with whatever they have at hand. I told the waiter about this, and they tried to convince me that I was wrong. The service is probably underpaid and overworked because is the worst service I ever had. I am not coming back, neither is any of my friends.", "author": "Alejandro P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-28", "description": "HORRIBLE!!! This is the word I use to describe my experience here. It took an hour for my food to come out. He waitress said it was because of my steak still cooking. Once I got my steak salad...here were only 7 strips and they were COLD!!! The waitress took forever to bring out our food and did not have the etiquette to keep checking on her tables. The manager was horrible as well! She was suppose to come back and take my replacement order but never did. She did not seem apologetic about the situation at all. I do not recommend this place at all. They need to get it together! Especially if they are near the Barclays Center!!", "author": "Asia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-03", "description": "Disclaimer: I blame myself for this experience, because Applebee's is known for being mediocre.\n\nI went there last Saturday with a friend. We decided to take advantage of their 2 for 26 menu, where you get one appetizer to share and 2 entrees. We got the spinach artichoke dip and chips for an appetizer. It was really, really good. For the entree, I got the 9oz steak (I asked them to make it medium) with veggies and fries. My friend got the shrimp basket. I also ordered a Bahama Mama cocktail ($7.99).\n\nWhen they brought the steak to me, I thought it was a piece of grilled pork at first, because of the color. It was a weird greyish, flesh color. The fries were over-fried and overseasoned, as usual. I bit into the steak. \n\nThe steak was the culinary equivalent of coming home from summer camp only to find out that your parents had gotten divorced. It was tough and extremely grey inside. My jaw actually hurt from eating it. The only reason I didn't send it back because 1) I was starving and 2) I figured they would just trash it, and I don't like wasting food. \n\nThe cocktail I got tasted good, but it hardly had any liquor in it.  To salvage the evening, I decided to order their Kahlua Mudslide dessert shake($7.70). It tasted like a frappucino with maybe a dash of liquor in it. When the bill came, I that they charged me $8.35 EXTRA for the Baileys. I had to speak to a manager, and she knocked it off the bill.\n\n\nNever, ever again.", "author": "Sonjay M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-15", "description": "*mediocre food.\n*cute decor.\n*steak burger was just alright.\n*double loaded mashed potatoes are superb.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-27", "description": "came here for drinks with friendus on a Friday night, took about 15 minutes to be seated by a hostess who paied us no attention. Then sat down at our table, no one came to our table for at least 15 minutes no even to say hello. food was ok. tamika the server came to our table maybe once the whole time sitting there everytime we wasnted to order something else we had to seek her out. customer service sucks to say the least.", "author": "Shaniqua S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-26", "description": "This place got 1 star because the waitress was sweet. But the food is tasteless, over cooked and I suspect the cabbage on my Asian Tacos had gone bad. Never again!!!!!", "author": "Candice C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-20", "description": "I visited the applebees on flatbush ext two days ago and i honestly believe it was the worst Applebees ive ever been to. The employees are of course young students but they seemed very unprofessional unlike the other locations. They were mostly females just hanging around and talking as though they were not at work. Their language was even ghetto and made me uncomfortable,even their supervisor who was a male seemed so complacent and unprofessional while he gave orders while chewing food. He was even yelling \"so theres only 2 servers today\"?My waitress looked like 16 and messed up my order and the place only had about 5 tables seated. I didnt receive the other half of my meal until the first part was already done.smh.then she tried to play slick and over chArge me and my fiance.she gave us a bill for 35 took our debit card and came back with a receipt for 43 eventhough we gave her a tip in cash already.then 5 min later shes like ohhhh i saw you looking at your receipt and i realize i did something wrong so im going to void it and redo it because i charged u for something extra...what????? Why would she even pull something like this. They are shady...she wanted to see if i would catch it and plus they take wayyyyyy toooo long to bring your food eventhough the place is quite empty..i will stick to the one on flatbush junction instead.way better customer service.\n\nAlso since i just remembered.the establishment is depressing and old. They didnt even know if they had jerk chicken wings on their menu because i overheard a server asking the unprofessional supervisor.and also they gave me 3 sauces with my sweet potato fries.i had to ask the waiter wth it was because it taste like sweet vomit.she said maple syrup....sureeeeeeee.smh. I came here to this same place when it first opened and it was horrible then. Twice was enough to never ever go back.avoid this place. The employees dont know anything.", "author": "Marlene K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-20", "description": "\"The food tastes like sweat \u0026 despair\"\n\nWhatever turned normal turtles into Ninja Turtles is whatever radioactive crap was adorning my chili cheese nachos. The drink was watered down nothingness and my friend's steak meal consisted of... well touch the tip of your thumb to the tip of your pointer finger to firm a makeshift circle - well that is how large her steak was. You know how large her steak was in the actual menu - LARGE. \n\nWhen my meal of nachos arrived we were all intimidated by the size because it is definitely meant to be shared, until we removed the first chip, which was laden with topping. You know what was under that chip? Nothing!! Just layers and layers of barren, dry, toppingless chips. The topping was so sparse it barely made it past the top chip layer. I pointed this out to the waitress who brought me extra topping close to the end of my meal - which I thought was complimentary and ended up being a $2 charge. \n\nUgh, you know Applebees I used to love you. That Mandarin Orange Chicken Bowl used to be so satisfying, but after this experience, maybe I need to pause.", "author": "Kara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-21", "description": "Kitchen doesn't have a vent and the smoke filling the place makes it hard to see after a while. It must be a health code violation. The service is awful and slow. They don't seem to have regular knives, only steak knives. I asked for a knife to cut my burger-- got an enormous steak knife.", "author": "tt p."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-07", "description": "I'm not sure if I'm writing in the right Applebees but the AB i went to was in this little shopping mall place. Anyway, I came here for my sisters birthday with the family. Not only did we wait almost an hour for seating, when we were seated, the waitress left us for almost 10 minutes and never came back for our water and menus. I know that night was packed but how can someone not even come by and drop down the menus ? We were left sitting there staring at each other for a good 10 minutes.  Whatever, on to the food; the waitress missed 2 of our orders and when they finally came out, the food didn't look appetizing at all. The steak was overdone, the ribs tasted dry with no flavor. UGH this place was a disaster. \n\nI thought all AB's were the same but coming here and experiencing this place, I think not. The AB that was in Staten Island was wayyy better than the one here. \nSo anyway, the bill came up to be around $200 something with tips and tax. We couldn't wait to get the hell outta there. This place sucks, and I'm usually not one to complain. I'm definitely not coming back here. Next time, I'm venturing out to Buffalo Wild Wings just downstairs.", "author": "Shannon Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "I like there food. Love Their chicken wontons. My only dissatisfaction is that they stopped showing ufc fights. Bring them back.", "author": "Rudy C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}