{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-25", "description": "Hunger makes a person do crazy things like walk into Applebees. I was meeting a friend for lunch and this location was right across the street from the LIU Downtown Brooklyn campus so we ducked in for a quick bite. We were seated immediately but our server didn't appear for 15 minutes. The place was only half full yet we barely saw our waitress. The food was average. Save yourself from the pangs of hunger by eating somewhere else.", "author": "Jeffrey Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-06", "description": "I came here with a bunch of friends on New Year's Eve. The waitress seated us near the bar despite the fact that we were a bunch of high school girls and would much prefer other areas. Well, the waitress was very friendly but unfortunately, the food was cold, the drink sucked, the dessert was too sweet and no one was really filled up or satisfied - and our bill wasn't a small one. Not a great experience..", "author": "Jing Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-20", "description": "Not my favorite Applebee's location.  Staff is friendly, and the food is Applebee's standard.  They do have happy hour specials and karaoke though.  I prefer the one in Bed-Stuy. :)", "author": "Koku K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-14", "description": "After being seated, my wife and I waiting over ten minutes to be waited on. After no one came over I went back to the hostess stand to inquire about the where about of our server. She went about ensuring me that we will be soon served and then she went to her apparently engrossing conversation with two servers hanging around the front entrance. After another five minute me and my finally gave up and left for good. When I pay my hard earned money in restaurants I expect much better service. Since such a thing seem in-convent  for Apple Bee's staff, I will never in-convince with my presence or my money again.", "author": "Joshua G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-08", "description": "This isn't my favorite appleebee's, but it's not my least favorite either. If you come for Happy Hour it's not too bad.  The service is often not so great but it is a chain restaurant.  There's not really much else in the area.", "author": "diana m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-31", "description": "Heh, i like this Applebees. It's not the greatest but it's alright. The food is good. I stick to my Penne Pasta, It's great! hehe. The presentation of the restaurant itself is nice!", "author": "Kyle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-23", "description": "This Applebees is lots of fun during happy hour. The bartendars are really nice \u0026 make hella drinks (try the perfect margarita w/ olives \u0026 salt). I've been going here for the past few years since they had Karoake (which they no longer have for some stupid reason). They now have video games \u0026 they have TV's to watch. Now for the food.... ummm it's ok. Just ok. I used to love the buffalo wings but not anymore since they started over cooking them. I would recommend stopping here for a quick drink but heading somewhere else to eat. Sorry guys.", "author": "Nafeesha P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-18", "description": "awful! the wait staff was well...too comfortable. \n\nI went with my bf tonight, spur of the moment. He ordered steak with potatoes and i had some meat balls w/ fettuccine. One word...YUCK! My bf had asked for his steak medium well....he got a piece of rubber. My meatballs tasted like they were poured out of a can of chef boyardee!! SERIOUSLY!! it had the nastiest texture. \n\nIn the end, he brought us the \"check\" which was basically a receipt, no book, and had the nerve to hand it to me personally and say \"here you go sweet heart\" and wink and tell my bf \"i got you son\". wtf? how did these people get hired??? \n\ndon't go...atleast not to this one....my bf has a horrible stomach pain now...wonder why....", "author": "Yinette T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-05", "description": "Okay, I've never written a review before but I HAD to write a review. I have gone to this Applebee's 2 times before and gotten the Mexican-Style Chicken Salad, and it's really good. My daughter got the kids' size chicken and fries and she never complained. The service is really great, the waitresses are all very accommodating and nice and always come to ask how things are. However, today, I took a chance - EVEN AFTER SEEING THE ALMOST 18$\\PLATE - I ordered the asiago steak. When the waitress put it down on my table I literally had to catch myself before I laughed! It was a fairly decent size of steak but there were literally 5 potato chunks (it was supposed to be served with potatoes and \"seasonal vegis\") and 4 pieces of broccoli and 2 small baby carrots. I said okay I'll eat it, portion control anyway, it's okay. I go to take a bite of the vegis and they're freackin' hard as a rock! I almost busted my tooth! I just had to warn everyone NOT to order steak. Need more options in Atlantic Center for sit-down food!", "author": "Brooklynnn B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}