{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "There is a mouse trap literally under my feet. The artichoke dip was burnt. Manager literally interrupted the waiter while she was speaking to me asking for my order. I'm sitting behind a pay station of theirs and the employees are speaking rudely. A employee is wearing Nike Slides to work? Since when is that allowed. Is disturbing and shameful that this is the standard here.", "author": "Lashanna R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-08", "description": "Standard Applebee's American fare. The service is beyond horrible. The hostess made us wait for 20 minutes when the restaurant was half empty or apparently completely filled with imaginary people. The manager, I guess depending on how you look at it, let a couple of homeless people use the bathroom. I guess that would have been nice if there was no one there. But the stench alone when they walked passed our table almost made me vomit.\n\nThey took forever took our order and we were pretty much ignored for a good portion of the time. No one came to check in on us and before our food even came we were presented with the bill. Lapin had actually forgotten his cellphone and came back and our bill was still there with our dishes even after we left 15 minutes ago. \n\nThe only reason, we visited here  is the prices are decent and they plenty of ongoing specials and the food isn't that bad. I had fried shrimp with french fries and stole some of Lapin's boneless wings but I would visit another Applebee's instead of this dump if I am really craving some \"cheap\" American Food.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "If I could leave it at zero stars, I absolutely would. So we sat down and it took the waitress ten minutes to get to the table. She said she'll give us time to decide and tried to walk away. I stopped her and told her we were ready to order. So we ordered three meals off of the the kids menu and a two for twenty.\n\nY'all....it took seriously 30 minutes for our food to come. What food came out first? Only the meals for the two for twenty. No appetizer, no kids food, nothing. I tried to have the kids eat the chicken basket I ordered and everything was stale and cold. 5 minutes passed, still no kids food or appetizer.\n\nI hate when the waitress says, \"Your food is coming out shortly, the kitchen is busy and backed up.\" This was 20 minutes after she ordered my food. Can I at least get my appetizer? Or the kids meals? It was a yogurt with apples!! I've worked with Applebees before. For 2 years. I know this game. Tonight I've never seen anything like this.\n\nI walked out. Never walked out of a restaurant before, but this one took the cake.\n\nSeriously, don't bother going here. We settled for smash burger. Kids ordered the exact same thing and it came out quicker than our 10 minute wait at this terrible place.", "author": "Porcia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-24", "description": "Applebee's has definitely fell off the chart in my opinion. Do keep in mind that I have visited there twice this week, including today. \n\nEarlier this week, I stopped by with my four yr old neice. We were greeted nicely and was seated at a table. I would say his/her name but it's not necessary as I am angry at Applebee's as a whole at this point. The wait to order things took way too long - i even called out to get the server's attention serveral times and was ignored.I ordered a 12oz sirloin steak dish and my steak was 6oz and was tasteless. The portions were a joke - seriously. \n\nMy experience today was a better joke, I promise. I sat at the bar - there were about 5 people behind the bar, including a manager, but yet it took 10 mins to even place a drink/appetizer order. I ordered a margarita and after two sips returned it immediately. It tasted more like sour mix, only. seriously. I steered from cocktails and decided to be safe and get a draft beer - I ordered a blue moon and was somewhat satisfied. I orderd bonesless honey bbq wings. They were horrendous. the sauce on the wings were heavy and made the wings slimy and the sauce itself had no flavor. \n\nCAN YOU BELIEVE THAT MY BONELESS WINGS WERE STILL FROZEN/COLD IN THE MIDDLE?? I almost threw up right there, but the bar was packed and that wouldve been embarrassing lol. uuugh im disgusted. The bartender comped by bill but i at least still tipped him, although i wanted to just reverse time.", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-10", "description": "Went to this day applebee's on a non busy wednesday night with a friend, and was seated next to a table with four patrons. The waitress blatantly spent the majority of the time servicing the table with more patrons vs our table. It was so bad my table had no napkins, so i asked the waitress for napkins..received none. I had to ask another applebee's worker for napkins. So when it came tip time, my tip reflected the lackluster service that we received. We paid through the little box and requested the receipt via email. The waitress comes over and slams the receipt on the table with an attitude (I guess due to the poor tip). Well \nwaitress Nailah S. you should work on your waitressing skills and providing the proper service to all your customers. \n\nI found the food to be decent although the friend that i was with said that he immediately had to goto the bathroom after eating (explosively yikes!). \n\nI personally do not plan to eat at this applebees again.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-30", "description": "Standard fare.  Depressing venue.  Looks like it's been in a time capsule since 1988.  We came here a few years ago because someone always wanted to try the chain.  I still tease him about it.\n\nIf bland food is your thing...here you go.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "The service was very unprofessional. One waiter did not know anything about the food a runner lied about an incorrect order. Other orders were also incorrect. The food was not good either.", "author": "Ari W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "The service was horrid.  Our drinks had pieces of the filtration system in them that looked like snot -- meaning they weren't cleaned out properly.  Food was sub-par with smaller than usual portions.  The restaurant smelled rancid.  The waitress took forever and brought my credit card back to me covered in grease from her fingers.   Just a bad experience overall.", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-25", "description": "I stopped in here to study since my school was closed on the Friday after the celebration of mass genocide and enslavement of the Native Americans (err... Thanksgiving?) \nI sat at the bar and was greeted by the bartender, I paid 7$ for a crappy beer - not many quality choices on tap here and certainly not worth the 7$/pint.\n\nThe staff always seems to be yelling or talking about their latest personal endeavors which negatively impacts the dining experience, luckily I had my headphones in and was too zoned on organic chemistry to care. That is until the manager brought over one of those sound-devices for the televisions and placed two of them right next to me, and none anywhere else - they were also on almost full blast. \nWhy?\n\nLong story short, save yourself the calories, dollars and poor dining experience and go elsewhere. Buffalo Wild Wings down the street at Atlantic is somewhere I've yet to have a bad experience at, or there's plenty of pubs around the area on 4th Ave or Downtown BK.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "The only complaint is that we needed to wait for a host when we entered the restaurant. But what can I say? This is Applebee's. Food was excellent for the price. The server was very attentive.", "author": "Miku T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "Whoa going by the reviews here doesn't look like many people enjoy this place ? Of course we can all have different experiences .\nI happen to be in the area \u0026 before heading home we decided to get a bite to eat.  Not much to be said about the décor since all Applebee's have similar décor , this place is pretty big tho in comparison. \nOnce seated we got our menus, we decided to share the 3 for all we included the Chicken Tacos , really good .. Steak quesadillas towers also good \u0026 the boneless Honey BBQ wings good as well , all choices I've had in the past so I know they would be good.\nFor main dish two of us wanted the Chicken oriental salad but came to find out they have discontinued it ? if this is true that sucks this was a great salad. \nThe two of us decided to go with choices from the take two menu , both tried the Shrimp Linguine with the Green goodness wedge salad. \nLinguine was good but in a red sauce? this was odd but didn't taste bad. the wedge salad was pretty tasty. I had my meal with a Strawberry lemonade this was not bad a bit on the sweet side but mixed together it was good. One of us had the Thai salad this good as well. \nPrices are decent since we got from the take two menu , the appetizer \u0026 regular salad were a bit high but normal prices for these type of places. \nOur waitress was pretty slow \u0026 looked like she wasn't having the best of day , she did seem like she was alone. \nOverall our meal wasn't bad , prices high for the kind of food they serve but decent if you choose from the specialty menus.", "author": "Ginette P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-15", "description": "\"Together is good!\" \"There's no place like the neighborhood!\" Oh, Applebee's. You are so weird. I was wandering around post a Yelp Elite event and my friend wanted a nightcap on the way to the train. She thought there was a Brazilian bar near the neighborhood and it turned out it was in Williamsburg. Derh. Nothing was open and we couldn't find a bar for about 5 blocks and finally saw Applebees. Right in front of the DeKalb station. Alright. Let's do this! \n\nI will admit, I rarely have ever eaten here. Actually, I think my first and only time was in Atlantic City when no one could decide over where to get dinner one night. But they have a 2 for $20 deal where 2 people can share a luxurious appetizer and have each their own entrees for only $20! Yeah. . . . Ok, the food isn't that bad. It's just bad after you stare at the calorie count on the side. I was cracking up and instagraming photos of their desert shooters. A little shot glass is stuffed with chocolate mousse or some kind of sundae juice and topped with a pile of whipped cream. What I don't understand is how can a shot glass of desert be over 800 calories?!!! WHAT DID YOU DO TO IT to make it that FATTY?! Really!? I understand a piece of cake. A milkshake. But an 800 calorie shot?! Okay. I'm done with that rant. \n\nI had a glass of cabernet after staring at the menu for awhile. Our bartender was sweet. Den Den \"Living Room, Living Room\". We met an oddball character, Andy, that offered us his 'breadstick'. And I found out what a sound box thing for tvs is. Oh, and then we had a Selena Gomez dance off party outside when retiring to our beds. Happy Hour also seems to exist all the time here. I'm pretty sure my unemployed sister took advantage of this when she was working at Target last year in the Atlantic/Pacific mall. \n\n\"See you Tomorrow!\"", "author": "Ingrid S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "I came to this location after shopping around there.My server was very quick and super nice! My order came out quick and hot btw delicious! I left him a good tip. I will be back.", "author": "Ide I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-22", "description": "This was the absolute worst dining experience I have ever had in my 24 years of life. I have come to this location before for lunch with a few friends and that experience was awful as well. \n\nToday was my last final exam and my classmates and I decided to go for some drinks and apps. Keep in mind that this was around 1:30 pm and the whole restaurant was empty. It took 10 minutes to sit. We ordered our drinks and it took 45 minutes to get those. Our sangria was delivered in pitchers with no cups. The rest of the table got their drinks and we still didn't have our sangria cups so I asked the waiter, Jaquay, for the cups and he said they had no clean wine glasses. Keep in mind it was 2pm and there was no one in the restaurant; you can't tell me you don't have any clean wine glasses! 10 more minutes pass and he brings 6 soaking wet wine glasses to the table. Then he proceeded to tell us to write down our food orders on a piece of paper for him. I was appalled. The food took another hour. When it came down to cleaning up the table of empty plates they just piled up by the dozen. And it took forever for him to break down the bill for us. I honestly don't know how he is still employed at this establishment or how this establishment is still in business with the poor service that they offer. I will NEVER be back.", "author": "Diana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-25", "description": "I came here this past Sunday for lunch before some shopping. This place was empty, I think due to the cold weather, no one wants to come out. The waiter, everides was so nice. I ordered mango iced tea, roast beef, bacon, mushroom melt sandwich and that came with fries. I didn't like the bacon, so didn't eat that, but eeverything else was good. Especially the drink, u even get a refill. The drink was only $3 and food was about $13. So not bad for lunch..\n\nI will come to this location instead of the altantic terminal one next time.", "author": "Ilene E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-29", "description": "I'll start off by saying that we walked in and there was no hostess to greet us. The other employees were watching us and gave no direction or advice to us until we walked further in to the restaurant and asked. We were moved from the table we were going to sit at because Jasmin was loosing tips because there was a party in her section. When we arrived at Jasmin's table it was dirty (left over food). Jasmin seemed to be annoyed that my wife changed her order( the look on her face) once before she put it in. When she returned with our plates for the appetizers( forks and napkins) she placed  them on the table not so gracefully( knifes not included). Me seeing that the young lady was in a bad mood, I tried to lighten things up by starting small talk. I asked about the private party across from us, if it was causing her to loose tips. Jasmin stated \" I make my money\". When she returned to the table another time I sincerely asked how her day was going and pointed out that she seemed a little upset; with a frown on her face she said \"no I'm ok. Jasmin immediately started to clean the table next to us and said to herself...don't ask me about my Fucking day or...who are you to ask me about my Fucking day. Never the less I saw and heard her say it even though she was not looking at me; I was looking at her. At that point the private party turned on a radio and started playing loud music for there private party. The music wasn't bad, I thought it a little odd because they were not in a private room. Never the less I do understand that people can have a bad day and maybe Jasmin was having one. As a paying customer we should not have to be subjected to poor service and poor attitude because you're having a bad day. I didn't want to leave her a tip but I did leave her something that was in line with her poor service and attitude. My family stated that she did manage to smile at them a couple of times. To little to late for me. The food was fine.", "author": "Jay T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "Went here for the first time with 2 friends to see the Packers/Giants game yesterday. It was 22 degrees and we asked to not sit in the area that's on the outside of the bar since the windows looked cold. We asked to sit at a corner table closer to the bar that had a good view of the TVs.\n\nHowever, the hostess said she wasn't sure if she had a server for that table which was fine. But then as soon as we were taking off our coats at our table right by the windows, 2 people were seated at the table we asked about which was kind of frustrating. \n\nAnd the other thing was that we were FREEZING at our table by the windows. We were by the door facing Flatbush Ave so it was quite uncomfortable. If we sat somewhere warmer like closer to the bar in the middle of the restaurant, we would've stayed longer but it was too damn cold, we decided to head home. The table behind us we're all wearing their coats.\n\nOther than that, food was good. Our waitress had a lot of tables but she was very good balancing all the tables. I'd go back since I live in the neighborhood but next time, I'll make sure to ask to please not sit by the window.", "author": "Cristina H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-25", "description": "Ever been to an Applebees and had a blast? Well that your own fault.\n\nA friend of mine just won his first mma fight #taylorgang and we planned to just grab ONE drink at some other place. He suggested the happy hour here and that was a great idea.\n\nThe happy hour started whenever it did but didn't end till we left at midnight. The bartender Anika took great care of us and was pretty easy on the eyes as well. Drink after drink, we knocked them back and she put them back up. We got to the point where we NEEDED FOOD lol.\n\nThe point I'm getting at is, this place had a lively environment, great bartender, and a copious supply of libation for a VERY reasonable price.\n\nCash and credit.\n- Don't forget to tip.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-22", "description": "We waited 10 minutes for the server to come, and he never came. This is why I do not eat at applebees. My sister and cousin waited to go and I was being a team player. We left!", "author": "Jannaia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-24", "description": "Just....don't go here. I have no intention of ever going back. Like ever. This Applebee's on my my list of never go again places.", "author": "Simi P."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}