{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "Absolute worst applebees I ever visited. The service was terrible. Walked in the place was dense not alot of customers, noticed the fat ass security guard talking to the hostess, were not attentive to customers coming in at all. Told me to wait 5 minutes for a party of two. It took 30 minutes to get seated and half the restaurant was empty. Sat down to dirty silverware, could clearly see they were not washed properly if they washed them at all. The young lady who took our order, drinks everything included was very incompetent. We were seated for 1 hr 15 minutes and didnt even get a drink of water. The staff is majority young black thots I am just being honest nothing professional about this place so never again.", "author": "Danielevrod F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-11", "description": "The service here is terrible.... actually scratch that. This place should be shut down. I came in tonight to meet my friend for happy hour. It wasn't even busy and we had to wait 10 minutes for the bartender to [not wipe the bar counter] come over with a cocktail napkin that she ran under the faucet to wipe down the condiment sauce in front of me. I then told her that I'd wait for someone to come over and sanitize the counter with a rag. She then proceeded to tell me that they ran out of rags and that she could go in the back to put some sanitizer on the cocktail napkin that was already falling apart... Excuse me? But that is beyond gross. We then had to wait even longer to have the saucy counter cleaned and not once did she ask us for our drink order during the time. We finally managed to trouble her for a drink after she repeatedly held up her finger and told us that she needed to close out another party. The service was extremely slow after receiving our first drinks. When we finally got the drinks, my friend made a simple request for a lime with his drink. She actually grabbed his drink from him and proceeded to plop a lime smack dab in his neat tequila. Seriously? Aside from violating 39 health codes from this, how did she know how much lime he wanted in his shot?? I wasn't even able to get a second drink until the very end of my time at the bar. The bartender never checked on us and she kept disappearing. Of course it wouldn't have been proper by then, if she hadn't charged us regular prices for the happy hour margaritas that we ordered. I didn't even care at that point, I just wanted to leave. Seriously. This place needs to either close or they need to clean house.", "author": "Lydia H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-14", "description": "Waited at the host's post for 30 mins. She was filling Uber eats orders in the back while many people were waiting for seating for a really long time. I had a really long day and I really just wanted to unwind. She didn't even greet us with. Sorry for the wait. She just proceeded to be rude to me and my guest because she was upset that we were growing impatient.", "author": "Shaleema J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-07", "description": "Ok first of all the workers are basically teenagers. The service \n is absolutely terrible. I had to wait like 30 minutes in between each entree. The food was great tho. But I wish the service was a little better. It's a no for me dawg! Nah!", "author": "Ranique R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "Mom was in town and insisted on going to Applebee's even though I told her that all the locations in this area suck, ESPECIALLY THIS ONE. Things started out OK but as anticipated quickly deteriorated after we were seated (at a table that was freezing, it was 13 degrees outside). 20 mins after our order was taken, another waitress walks up to the table \"Hi are you ready to order?\"...assume the first girl never entered it. We waited 40 mins for COLD coffee and hot chocolate (when we mentioned it was cold she just shrugged and walked away instead of offering to bring hot ones) an additional 40min for salads (!!!) no silverware, no napkins, and terrible waitress (#1) who forgot the fries and clean bottle of ketchup that we ordered (one on the table was disgusting \u0026 empty) and never checked in after we got our food. \n\nThe only saving grace was the new manager Tracey-Ann who was just transferred, I could tell she was new to this location because when we first walked in she actually warmly greeted us. When we complained of everything she discounted accordingly. I hope she can turn this place around---I literally ONLY wrote this review to give her due praise.\n\nBottom line with Dekalb \u0026 Gotham markets blocks away the competition has escalated, get your ish together Applebee's", "author": "Jen H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-16", "description": "The cook is shitty! The quality of the spicy chicken was poor and the bun was STALE! Mofo tried to play it off by toasting it, but you can tell! I'm not stupid lol! I asked for a new bun, however, the second one wasn't much better! Ugh...NEVER AGAIN! My first mind told me to fuckin' go home haha! Let me shut up y'all! Peace!", "author": "Stephan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-20", "description": "The food was nasty  ass hell had to send my order back and waited 20 minutes  until I canceled it  the server was slow as hell I will never waste my time or money in this place it was horrible  I dont want to give it any stars", "author": "Ann P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "Talk about Incompetence, it's completely dreadful    \n\nThey struggle with simple tasks \u0026 dealt with it for almost an hour\n\nI promise you this, I went back to the store literally the 4th time just to spell out the most simplest stipulation for my order that they misunderstood for the 4th time.\n\nI did not ask for the most difficult order \u0026 remind you we ordered online, so the stipulations are all there digitally. what is the excuse?", "author": "Andrew J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-03", "description": "Went to this location today, and after waiting 15 minutes to be sat, the table wasn't even clean. The host wiped down the table but it was wet. We did receive menus and sat for another 16-20 minutes without ever having a server stop to even offer water. Three servers were standing at the cashier near the bar, and the couple next to us asked the waiting servers for water and were told, \"that's not my section. Your server is busy.\" He asked how long he'd have to wait (he'd been waiting at least 10 minutes) and was told \"I don't know.\" in the rudest tone I've ever heard from a server. My boyfriend and I left as our total wait at that point had been nearly 45 minutes and we weren't certain we'd ever be served.", "author": "Alycia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Only grading my server, Nia. She was very pleasant, professional and accommodating. She made sure I was satisfied and didn't appear to be annoyed when I changed my mind about having one meals packed to go. Def. Earned her tip. Great Job Nia!!", "author": "Tanisha H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "I've been to this Applebee's location a handful of times. Poor service. Dirty glasses. I don't recommend. This location is notorious for waitresses pretty much disappearing. And you have to hunt them down.", "author": "Nadia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-07", "description": "Oh my goodness if I could give this place a zero or negative 5 stars I would. I try not to write negative reviews because it may just have been me but this Applebee's Location is already known to have the worse of the worse service. To the point where I think they make being a horrible worker a qualification to work there. So we strolled in Applebee's because they supposedly had a promotion of $1 Margaritas. So the hubby and I had time to kill before a movie so we waited to be seated, wasn't too long of a wait. Then once we were seated over by the bar area and we waited 25 minutes ( no lie, I kept track of the time because we still had a movie to catch ) just for the waitress to decide to come over and bring the menus. When we first sat she zoomed by us and said she would be right with us, then 25 mins later she gave us the menus and disappeared again, then 15 mins later after I talked to a manager looking fellow, she popped up just to tell us that the promotion didn't apply to this location that they were only doing it in the Coney Island location. Note the whole time she was talking to us, she had a attitude like we were holding her up from something and she did us a favor by stopping to take our order.  \n\nGranted so much time has now been wasted, and her lack of hospitality was starting to urk me we just ordered two drinks from the bar anyway. The bar was probably about 3 feet away from us, so how long could it take to whip up some alcohol and put it in a cup. They obviously proved me wrong, 20 mins passed from giving the girl our order and not even a glass or water much less a bar drink or utensils for the appetizer we ordered graced the table. \n\nWe kindly walked out, they obviously skipped the customer service portion of the job when they were training these people. I've been to hole in the wall spot's that are constantly bust that have better service than what this Applebee's was giving. They need to just close this dirty location.", "author": "Elethia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-11", "description": "So I don't my bad review will mean anything after seeing all the bad reviews written by everyone else. This restaurant claims to close at midnight, but they turn the lights on, turn off TVs and begin handing out checks at 11pm!! A customer walks in at 11pm because you say you're open until 12!! An 11pm customer should have the same experience as a customer at 5pm!! And I say this a former restaurant manager!! To feel a bit rushed at 11:45 is one thing but an hour before closing is ridiculous. And it's across from the Barclay Center!! where events are held and people come in late!!", "author": "Janelle W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "Nice place, nice decoration and it is huge! Their speciality seems to be all kind of meets. We had chicken and pork and both dishes were very good and big. They offer free french fries refill. The only critic is that we had to wait too long for the food, like 40 minutes.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-25", "description": "I'll never come here again. Damn roach was on my Nieces Apple juice then jumped off and just crawled across the table like he owned the place. \n\nWhen we told the manager he took $15 off of our bill.  I kindly gave it right back to him. He brought it back with about 40% off. I didn't want to pay that but my Aunt didn't want a scene. \n\nNever Again! Disgusting.", "author": "Maya B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-03", "description": "I'll start off by saying, I'm not the biggest fan of chain restaurants. However, a relative of mine was in NYC and wanted to get a quick bite, and I suggested Applebee's. It was a Friday evening back in August and it was pretty crowded, the hostess said it would be about 15 minute wait, and it turned out to be a bit less. She sat us toward the back and said a server would be around shortly, that was not the case, she took quite awhile.\n\nI opted to get two items from the 2 for $24 menu...my daughter had the chicken tenders and fries, I had the Tilapia with potatoes and broccoli. I actually didn't have the highest expectations for my meal but they were exceeded. The Tilapia was well seasoned as were the potatoes. \n\nHowever, the service left a lot to be desired, she took awhile to take the order, she disappeared and didn't ask if we needed anything, and the food took quite awhile to come out. While I'm not the biggest fan of chain restaurants I received much better service at the Applebee's located just a few blocks away at Atlantic Terminal.\n\nIn short, thumbs up for the food, but thumbs down for the lackluster service.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-04", "description": "Unprofessional customer service Doetha the host at the front was not at the post. I waited 10 minutes for her to come to the hostess station. She said it would be 20 minutes wait for the food and it took 35. During my wait other customers came in and began comparing and questioning was this self service because she was not at her post. At that point, I asked for the supervisor and he took 10 minutes to come out. Jardert the manager was unprofessional as well. I requested a refund and he would not provide me a receipt and both him and the hostess were trying to get me to still take the food. I would never go back to this location again. I see why they have 2 stars", "author": "Jasmin J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-16", "description": "This has to be THE WORST Applebees ever. We walked in there is 1 hostess 3 servers at the front we are there for about 7 minutes before we sat ourselves in the bar area not even an acknowledgement.\n We waited 30 minutes for a drink, our server could barely speak English. The 2 girls bar tenders start fighting. Like legit real life fighting some black girl with blonde hair and some other black girl talking mad garbage all the people in the bar area were shook. We finally got our food 40 minutes later it was all appetizers btw. 2 orders of wings and 1 order of mozzarella sticks  fucking cold. Like wtf is wrong with this location the food sucks ads, the service sucks even worst and the bartenders are so ratchet who fights in front of roughly 30 people. \nSafe yourself don't come here only regrets", "author": "T.Mosa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-21", "description": "Worst Applebees on planet earth.. If you are looking for the worst food you can get in NYC, you have arrived! \nI ordered on UberEATS, food was delivered on time... however...\nThe \"medium\" burger I ordered arrived super well-done, dry and with charred buns.. oh and with no toppings at all (no lettuce, tomato or pickles).. the other meal I ordered was just as miserable and missing the drink as well.. \n\nThis place must be shut down.. will wait until a Chili's or Fridays opens up nearby", "author": "Moe H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "Really really terrible. Nobody greeted us when we arrived so we found a table. Had to wait 15 minutes to order our drinks then another 15 minutes to receive them. \n\nMy fries were cold and drink was unbearably sweet. \n\nGot food to go and it was super expensive. Opened it up when I got home and the portion was like kids size. \n\nWill never be returning to ANY Applebees EVER again. \n\nShould have looked on Yelp, my mistake.", "author": "Kelly G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}