{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-14", "description": "Took long to come the food. They give this little tablet they never said they charged for playing game. But when I asked the waiter he just slipped out without answering. Not nice", "author": "Shami D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-23", "description": "This place is abysmal even as far as Applebee's go. I thought I'd grab a quick, cheap appetizer salad and soup for dinner on a Wednesday night, but sat in the booth for 15 minutes before the hostess came back over, apologized and took my order for the waitress who was MIA. Sat there for another 15 minutes before I even got my drink. The food was pretty basic, but edible when it came out yet another 15 minutes later. The hostess had come over while I was at the half hour mark and still waiting for my food and said she'd get them to comp my meal, but that never happened. Appalling service.", "author": "Dalayce S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-10", "description": "Came to this location as we used to always come. It was really busy as it was really nice out. I would like to point out that bartender was very rude to our waiter as he was asking for our simple drinks that we've been waiting for for about an hour +. The bartender that day was worried about the guys and her friends who she basically catered too. That's is very nice but such business should not take place while there's a full house. On top of that we had to cancel a part of our food tht didn't come out in time for us to eat everything together; then cancel the drinks as well. That's no fault of anyone as it was crowded but the wait for that in addition to the drinks was overboard. If the workers were more focused. Things would've been a bit more organized. \n\nOnly reason I give two stars is bc this place has a sort of sentimental value for myself and my sisters. But the workers need to do better. *sigh*", "author": "Rae O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "My experience at this applebees was absolutely terrible. When my party and I arrived the restaurant was close to empty and happy hour was about to begin. We opted to order various appetizers as well as the $1 margaritas. All off the appetizers we ordered came at different times. I ordered mashed potatoes which after my long wait, arrived cold. Another person in my party who ordered a baked potato received a lukewarm potato. As I am writing this review, we are still awaiting a basket of fries. To wait an obscene amount of time to receive cold food is absolutely unacceptable", "author": "Ari B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "This may be the worst Applebee's in Brooklyn.  Quite frankly I'm turned off from the whole franchise because of it.  Long wait to be seated in a fairly empty restaurant.  Drinks came missing ingredients.  Appetizers were awesome, but it was downhill from there.  Water tastes pretty weird, tap or not.  Entree took long to arrive and arrived cold.  I Undertipped because it was such a bad experience.  Most of it is frying and microwaving precooked food, and they honestly failed at this last night.  No bueno", "author": "Vanessa J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-28", "description": "This Applebee's bye far is the worst one I've been to. My food arrived semi-hot as if it was pre-heated and not served fresh. I was told by a colleague that the food quality is better during happy hour but I don't think I will be giving this restaurant a second chance because the expectation is that food should be consistent no matter the time of the day; The waiters weren't very warm and it took quite a while before our order was taken, nonetheless, customer service was satisfactory.", "author": "Ashley D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-15", "description": "Came here on Valentine's Day. The service was terrible. The host keep saying the high chairs were available. I asked for the regular chairs. When I got a seat the chair was dirty. Food and greasy was on the chair. I asked the waiter to have someone clean it. They didn't seem too happy about cleaning the seats.  I ordered the $26 for 2 entree and 1 appetizer. Food was good but definitely too salty. I got two waters with the food. The waitress do not offer straws. What chain restaurant don't give straws to the customers. Applebee's have new wireless machines on each table for customers to order food, pay and to play games. But to play the games on the machine it cost $2.99. That's how the chains get the customer to cough up more money. The plus from Applebee's is the free champagne on Valentine's Day. I will stick with the Times Square Applesbee's. Not coming back here again.", "author": "Shiu Lei W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "i don't know why this location has such horrible reviews... the hostesses here are angels sent from god. i don't know how they don't lose it - and that to me is excellent customer service. they are always smiling and friendly even when the wait can seem chaotic.", "author": "Emily A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-05", "description": "Came here with my boyfriend yesterday b/c we saw a sign posted on their window advertising that they now served the \"Impossible Burger.\" However, when my boyfriend asked for it, the waitress had no clue what he was talking about, so he had to explain to her what it was. She then recognized it and told us they don't have it yet... Seriously Applebee's???? You have a sign saying you have it, when you actually don't??? That's false advertising and COMPLETELY UNACCEPTABLE.", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-27", "description": "Current situation : came in here very hungry , ordered the food and waited sooooo long for the food to come! \nNow I am waiting for the check and guess what it takes soooo long that I might get hungry again! \nI'm trapped in Applebee's", "author": "Sophia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "They should just shut down this place already The food takes forever to come and when It does it's nasty . The shrimps taste like straight powder , This place has a body guard slouching around on his phone . The hostess is rude and unpleasant , you would think they would have a hostess who was great given the fact that this person who who greets you and gives the first impression but nope  and the waitress are rude screaming full blown conversations over your head . The table was sticky , we didn't meet our waitress until 20 mins into sitting even though this chick was literally just standing in one spot . They don't pay attention . Shut this place down . The only skill these waitress have are keeping a steady attitude and eye rolling . Very unprofessional place .", "author": "KaylynNicole R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-24", "description": "I have one hour for lunch so I decided to grab a burger. Went in sat down, and waited. And waited and waited. Then the waitress went up to a table and sat down. I figured ok, she'll take their order then come to me. I'll be patient. Nope. She just sat there hanging with her friends/family. I got up and left along with another table that must have been waiting a while too. Lunch ruined.", "author": "Lo B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-07", "description": "This had to be one of the worst experiences we've had at Applebee's ever ! We sat at the bar where the bartender was very rude . She wasn't attentive to us at all . When we asked for a drink she ignored us and walked away . She had an attitude and when we said we were going to sit at a table she snatched our menus from us . We spoke to the manager and he said he would take care us . We were seated and the hostess was rude . Our server was rude . Our food took over 20 min . We finally decided to leave and pAid for our drinks . Never had an experience like this ever in Applebee's", "author": "Sherard W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-24", "description": "I organized a breakfast meeting here because I saw that it was empty. Then I ate the breakfast and realized why it was empty. I got the blueberry pancakes which I could immediately tell were precook end and reheated (they were exactly the same size, similar shape and were hot but not crisp). I was told by my other associate the coffee tasted like bitter water. The other, got the omelet and suspects it was the source of an irritable stomach for the next several days. No one liked their food and I regretted overlooking McDonalds. I won't be eating here again for breakfast ... and probably not ever. I'll go to Juniors across the street for solid sit down fare. They never let me down.", "author": "Rasool B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-07", "description": "the service is terrible, the food lasted a lot, while others came last and left faster, I asked for water three times and the waiter forgets not to return anymore, I would not recommend anyone to that place. the cold food and the hard steak.", "author": "Yoselin N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-30", "description": "Visit Date: December 29, 2013\n\nThis Applebee's is actually a real cr@pplebee's! I don't feel they are known for great food, when I used to drink this restaurant was actually a cheap way for me to get drunk and pig out after 10 PM. Hubby and I wandered in here after seeing a play in Brooklyn before catching our train home. \n\nI was slightly upset because I had just lost a pair of good gloves that I just bought so I ordered a chocolate shake. There weren't many vegetarian options on the menu, applebee's has never had many vegetarian options, usually I need to chose a meal and ask them to prepare it without meat. I wasn't in the mood yesterday so I just ordered the four cheese grilled cheese and tomato soup. Hubby had a chicken and pasta dish. \n\nHis chicken was blackened (or burnt). The chocolate shake was terrible I sent it back (and I never send back a shake), the tomato soup tasted like a cross between campbell's tomato soup and tomato sauce (it wasn't a good combo) and the four cheese grilled cheese was probably just one cheese grilled cheese on bland thick white bread. The cheese had an eerie elastic quality to it. \n\nDon't come here if you are at the Atlantic Terminal in Brooklyn, it's not worth it. They also play poppy club music and as I've written in prior reviews I am not a fan of poppy club music while I'm eating food.", "author": "Diana Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-01", "description": "For starters, they sat us at a dirty table, gave us dirty plate and utensils , didn't give my son his apple juice or waters we requested until about 30 mins after we sat down , we had to ask for a steak knife and some sauces  multiple times , fries were cold .. overall an awful experience", "author": "Adriana R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-04", "description": "SIDE NOTE: This is from a few months ago but I'm still mad about it .\nSo, where do I start? One thing I can say is that we were seated relatively quickly , which was great because we were hungry. It went downhill from there. I'd ordered the Chicken Tenders (Please, just order something else) and a Frozen Lemonade, which was the best part of the meal unfortunately. My friends each got a burger with fries. I was looking forward to my tenders until the plate came to me with FOUR small pieces of chicken and about FIVE fries. I literally paid $15 for a snack plate because I sure wasn't full after that! My friend had a burger and asked for nothing on it except bacon and cheese. Two burgers later and still got the order wrong! She did get to speak with the manager which was great but we left feeling TOTALLY unsatisfied. Go elsewhere if you want a filling meal.", "author": "Nicco K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-07", "description": "I used to joke that they added the tiny flakes of chicken in the quesedilla with a potato peeler. Gave them another try after 5 months. Still terrible. Manager refused to fix it because \"it's portioned\". In other words: Yes, we rip you off, but it's all in the corporate plan. Sent mine back. Friend arrived later. He thought he had a system: \"You have to tell them BEFORE you order.\"  See the photo. Didn't work. It's all in the plan. Seven cents worth of chicken is going in the quesedilla. That's it. That's the Applebee's way. They're dying for a reason.", "author": "Brooklyn G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-24", "description": "-hey can I have a Brooklyn (beer)\n-what? \n-Brooklyn beer\n-no there's no Brooklyn\n-ok, Heineken then\n-....no there's no Heineken \n-what about Stella?\n-wait.... no Stella, sorry. \n- (well i understand) ok, any beer you want \n\nHey, then all the waitress disappear for about 10 mins.. I was at the bar ready to place my order while having the last sip of that blue moon glass.\n\nWhen she finally came with a mad face I placed my order and she didn't ask the person who was with me.. my friend was like -so I don't exist-", "author": "Kayler D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}