{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-25", "description": "Sat at the bar for 10 min before any one asked what i would like. During Happy Hour Domestic beer is half off/ they ran out of all the domestic beer and gave no alternative. The manager was rude and refused to give an alternative. Charged for food we did not eat. Brooklyn Beer Company beer is no on the happy hour menu in Brooklyn.  Horrible do not waste your time. Ghetto", "author": "Jeannette S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-20", "description": "Many restaurants have come and gone from this spot near DeKalb Avenue.  I've eaten here a couple of times and the food is OK.  Nothing stands out, but nothing was bad either.  The staff seemed a bit unfocussed on occasion, but maybe there is a lot of turnover there.", "author": "Brandon D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-19", "description": "We were promptly seated but the waitress took forever  to come after we spoke to someone than she decided to show up and instead of getting us our drinks she proceeded to go to the side and start texting and after about a half hour our food and drinks arrived and the drinks were wrong and my steak wasn't well done !! So no tip from me !!", "author": "Nehan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-04", "description": "I began to frequent this Applebees at Atlantic Terminal  because the service at the one on Fulton at the Restoration had become so horrible the bartenders there are rude and you can sit and wait at least 10 min before you are acknowledge and asked your order. While I guess the bad service is part of who Applebees is because I getting the same service a the one at Atlantic Terminal.  I only sit at the bar and the service is horrible the bartenders are anything but pleasant and I guess that's because the managers Donas ha and Carl are rude as well. Applebees Corporate office so needs to teach their bartenders and managers what customer service is about. You picked the job the job didn't pick you.", "author": "Michele A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-28", "description": "It's not easy really to rate an Applebee's. This one is basically fine. I think the one out by the end of the 2 train has moderately better food, but this one is your standard run-of-the-mill Applebee's. My SkinnyBee margarita tasted exactly like cocktails I make with Trop 50 lemonade at home, which at 100 calories makes it a pretty OK drink. However, my strawberry mojito had a funny flavor to it. \nOverall it is startling to me how often this chain puts out lame-looking plates. My appetizer sampler was as always huge and looked lavish when brought to the table, but somehow my BF's Quesadilla Burger, served on a weird turquoise plate with a handful of pale fries, just didn't have the visual punch that a cheeseburger deluxe would have at your average diner. Steaks ordered at an Applebee's also somehow come out looking forlorn. \nService here was more efficient than at the extremely busy Applebee's location on Fulton St. and unlike the Manhattan locations they do offer the two for $20 and late night appetizer specials the chain is known for.", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-20", "description": "Chain dining isn't my usual deal. I know this place very well; I used to live down in the area. It gets crowded. Look, just don't go on a Sunday morning/afternoon -- people went to church and want to get their eat on, so that's all I have to say.\n\nThe service is hit or miss in this place. The food is just okay and definitely doesn't blow you away. Its just all around mediocre. Its not BAD... I've been to bad Applebee's. Its just a little on the loud side, crowded and a little ghetto. But if you can get thru that, then you'll be okay. I hope.", "author": "Christine J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-18", "description": "I will never go back go this Applee Bees with my kids. Terrible service and the Manger Mr. Lila is the worse. I waited at my table with hungry and tired kids for 20 minutes before our orders were even taken. This site has the potential to be great but with the level of unforgiving customer service they will always get lackluster ratings.", "author": "Ronica W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-19", "description": "It was nice, wasn't busy that day. Our server was also doubling as the bartender so she wasn't as attentive to our table as I'd like her to be.", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "Pretty good Applebee's restaurant. Clean place and food is good. Great service, too.", "author": "Jan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-21", "description": "Went there yesterday after work and I will not go there again. Service is REALLY BAD. Took along time to take order, food and appetizer was cold. Spoke to manager whom also seem that didn't care much. I was never a really big fan of Applebees when it came to the food, but tried it again after a few years and still not  good. Those who do like going to Applebees I suggest you go to Manhattan you might get better service cause here is NO GOOD. Employees are more involved in there phones then serving you.", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-21", "description": "Staff were excellent however I was served under cooked fish, chicken and greasy rice. Send dish back. Pretty much same dish came back out. Ordered a breadstick. Breadstick was raw dough on the inside. Paid and left. Within an hour developed mild food poisoning. Eat out a lot in NYC. I have never had such a bad meal. Never again. I consider this review a public health warning for others considering eating there. Totally unacceptable. Great drink specials though, I hear. So glad I didn't order the $20 steak. I was only ripped off for $14 instead.", "author": "Liza M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-26", "description": "This review is only for the breakfast. A friend and I had a few very early hours to kill Downtown on a cold November Sunday morning, so we looked for a decent place to spend a lot of time but not a lot of money. Junior's and Applebee's (and not much else) were open at 8:00 a.m. They had similar menus but Applebee's was cheaper. For $6.99 each we had the \"NY Slam\" with sausage and the ham \u0026 cheese omelet with potatoes \u0026 toast, coffee \u0026 tea. The food was pretty standard, not great but not terribly disappointing. My eggs came runny but I got them corrected without a hassle. On the one hand, the service was a bit too relaxed, but on the other hand, we hung out for a good long while with no pressure to keep ordering. I'd do breakfast there again but only if I had to be in the area.", "author": "Sharon C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-04", "description": "Worst service I could ever experience. Staff is really rude and do not have customer service skills. If you order an appetizer they bring it out with the food. They should def change the staff. A few times I seen roaches coming out of the kitchen and crawling on the walls. Just plain nasty", "author": "Chris P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-07", "description": "Well when i first got there with my family it was empty, but we still had to wait for a table. Food was great but the constant waiting for drinks and food was annoying.", "author": "Nicole K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "The waitress was friendly but this seemed forced since she was serving too many tables.  It took her a while to come back with our drinks and when our food came, it took us some time to flag her down to request A-1 sauce.  The crispy green beans were tasty.  We ordered the 2 for $26 special: the steak and the crispy shrimp.  The steak wasn't good at all and the mashed potatoes that came with it had an incredibly strong butter taste.  The shrimp was good and crispy as described in the menu.  All in all, a decent experience but I don't think I would be strongly inclined to return since the food was a bit underwhelming.", "author": "Eve N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-06", "description": "Desperately hungry for a real meal I hesitantly walked into Applebees. Coming inside I was immediately put off. My server was dressed absolutely inappropriate (and not in the least bit attractively), the radio seemed to be playing nothing but explicit and sexual music, and the bar was full of loud drunks. I was confused whether I had stepped into Applebees or Hooters! Doesn't quite go with the family friendly atmosphere the place seem to present itself as initially. Upon being seated my experience continued to spiral quickly downwards as despite having my order ready, my waitress was having too much fun sitting down and chatting with her boyfriend rather than serve me. Even after finally getting her attention and giving her my order, I actually had to remind her to get my drink before she finished up her conversation and peevishly fulfilled my simple request.\n\nAt this point I was very tempted to leave, but my stomach kept me in dire hopes that maybe things would change. They didn't. My waitress eventually got up to tell me that apparently my meal was taking longer than expected before going back to chatting, which must have meant they just started cooking it because I enjoyed a good quarter of Football on the TV before my server finally came with my dish. My incredibly small dish mind you. When my server laid down the dish I looked at her assuming this to be but a small part of my meal, especially considering what I had paid, but no, this was really it! Don't trust the pictures on the menu. Alas, I reluctantly bit into my slider burgers which were mediocre at best, but I couldn't even taste the taco \"tower\", a term used so extremely loosely that \"layer\" would be a more proper term. Even worse was the buffalo wings which were obviously half cooked and horribly seasoned! \n\nI was appalled, after going through so much with the nasty atmosphere, terrible service, high prices, long wait, and now my food was not only ridiculously portioned but not even properly cooked? Fed up with the place, I asked my waitress to give me my bill. She disappeared behind the kitchen only to come back again another 10 minutes later. Short of some ones I gave her a big bill asking for my change to be returned to me promptly as I had to leave. That she did fast for once, but it was only later on the train home that I realized she had either miscounted my change or more likely took an undeserved 20% tip! I was tempted to go back and demand to speak to a manager, but then the food really kicked in and I found myself enjoying a nice case of food poisoning for the next 24 hours.\n\nWhen I write a review, I prefer to take a very in-depth approach in hopes to properly provide my readers with all the details and information they need, even going to going at lengths to try a place multiple times in order to completely weigh its worth properly. Yet this place needs no eloquence to get the point across. Avoid this place, if you MUST eat in the Atlantic Terminal Mall by all means eat anywhere else but here.", "author": "Travis M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-06", "description": "Slowest.  Slowest place on earth.  Took about twenty minutes to get a Menu.  Then it took another twenty minutes for the waitress to remember us and take our orders.  The food was decent, but there are much better places to eat around here.", "author": "A A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-21", "description": "the service here is terrible !!!!!!!!! the servers are rude and they lie about the waiting time. the owner of this chain store needs to get it together and make the changes necessary in order for me to ever come back again!!!!!!! 10/10 would NOT recommend!!!!!!!!!!", "author": "Jada D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-26", "description": "If my review was based on the appetizers I would rate Applebee's higher but since I am writing a review about my overall dining experience I had to give it a lower rating. I have eaten at Applebee's on a few occasions. I must say there appetizers are very good. I LOVE their Grilled Chicken Wonton Tacos, full of flavor and by far the best appetizers they have to date. The Chicken Quesadillas Grande and the Steak Quesadilla Towers are good as well. Their drinks are okay. Sometimes they are weak and sometimes they are just right. However the low rating goes to the main meal, their entrees are not the best. I've had better entrees at Fridays. One time I ordered the Sizzling Chicken and Shrimp and my food was smelled burnt and taste burnt. It was horrible. The second time I ordered an entree was a year or so after my first entree mishap and the food was decent, nothing special. It was so immemorable that I can't remember what I ordered. Overall the service is okay and the appetizers rock while the entrees did not!", "author": "B T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-10", "description": "I loveeee APPLEBEES!!!! My favorite to eat is the steak and shrimp mmmmmmm!!!! This Applebees is very friendly, I like how the waiters are always on top of things but also know when to not keep coming back!", "author": "Kissenia C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}