{"aggregateRating": {"reviewCount": 230, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-03", "description": "Today i was at this Applebees at the bar and as the bartender REBECCA i think her name was she had thick black rim glasses but no name tag thought it was ok to curse like a truck driver as she spoke to the waitresses she used the words F$%K and S#$T like it was ok in a restaurant where kids are and when i made a comment she just sneered at me with no response . I guess applebees thinks its fine , but i wont be going there anymore .", "author": "Rich H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-24", "description": "I've mostly only ordered take out wings since this one incident from a good 8 months ago but I finally figured I should give an honest rating about what happened here during a sit down meal because it was definitely a strange and unusual experience. I came by here with a friend of mine to order a nice lunch. It took a good while for our food to come but whatever right? At least our food was there.\nSo we start eating and my friend says, \"what the hell!?\" And lifts her fork out of her meal, to reveal a long string of plastic, that was literally cooked into her food! So I'm somewhat humored and she's a little pissed. I say that they probably accidentally cooked in a plastic wrapping from a straw or something, as though that realization, would make her any less grossed out and unhappy with her meal. She flags the waitress, who is super surprised by said non-edible plastic and goes to the back to get her another of the same dish.\nA little bit of a wait again, her new meal arrives, she starts eating and says, \"you have got to be f*****g kidding me!\" And now she's pretty pissed and disgusted because there is another long, relatively thick sheet of plastic cooked into her meal again. This one even bigger than the one from before! Naturally I'm dying laughing and while she could see the humor in it, she was also pretty upset because while she was still hungry, she was understandably too put off to bother trying for a round three with her meal. She didn't even want to risk eating any of mine after that. The waitress luckily just removed the cost of her food from the tab because, Ugh lol.\nI'm giving this more than 1 star because I've ordered take out wings since then and at the very least, they tasted all right and also because what happened to my friend was somewhat hilarious at the time but still though pretty gross and messed up :/", "author": "Donald W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-10", "description": "Horrible customer service all 3 times I came in here. Extra long wait; no update on your order; never anyone at the door to greet you", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-21", "description": "Very slow staff even on lunch hour where there are no one else around but you.\nFood is just the same as any other Applebees.\nI think that if there were any other option on the area besides this one, I;d rather go there than here. Period.", "author": "AlmaGrace S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-23", "description": "This is the worst Applebee's I have ever been to in my life. Very sad because it used to be really good. It now looks dated, it's quite dark, with subpar service, watered down drinks and even the food was not up to snuff. Other than one lovely geeeter upon entering, the people at the door were hanging out. No hello, goodbye or anything. The place wasn't crowded, yet service was slow. I've never experienced such an awful time in an Applebee's. I hate writing bad reviews, but revamping \u0026 retraining needs to happen.", "author": "Dakeeta G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-25", "description": "Hmmm ok well it is Christmas and all but this is the Second time we have been there. The service was pretty slow but the worst part was that the general manager came to the table to drop off our food and when we complained to him he gave us some kind of stank face. After that we sat feeling awkward for a little while and then decided to try to smooth things over with him when we tried to smooth things over it seemed to make things worse, at which Point we asked ourselves why are we doing this at all in fact why do we come here at all? At the end of the day it is not the worst restaurant in the world but not one that we will be going back to again after the weirdness that we experienced today.", "author": "Eugene E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-16", "description": "Service is horrible.  There is no form of management overseeing this place. I called three times to place an order to go. Twice I was hung up on and when I called back I was on hold for 12 minutes and the girl who answered the phone was extremely rude", "author": "Rosita J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-07", "description": "Just left, sat down at the bar for about 10 minutes and wasn't even acknowledged by the greeters, sweaters OR the bartender. Area wasn't clean, I sat in front of used glasses and tissue.... Still wasn't acknowledged. Never go here if you'd like to destress after work. You feel like you're clocked back in just to ask for a glass of water.", "author": "Jeffrey P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-05", "description": "I was going into eat breakfast with my son who I had promised pancakes and we walked in and the host told us breakfast was over. So I told my son we had to leave but he was getting upset because he was hungry (I had just rushed him to the doctor for a fever, meds started kicking in and so did his appetite). The manager came over and said he would serve us breakfast it was not a problem. That really made out day and the food was delicious, our waitress was lovely too.\nOnly con was the hostess, if the manager so easily offered to serve breakfast then it probably wasn't a big deal. The restaurant was pretty empty and all the host had to do was ask instead of allow paying customers to almost walk out the door. Keep in mind I think it was 5 minutes after breakfast ended, it wasn't a far of time.", "author": "Shaniqua G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-19", "description": "I haven't been here in a minute! Food is still disgusting, but the bartenders know how to make a hell of a drink. I ordered a few drinks and the bartender was in top of everything. She was multitasking like crazy. I got to give it up to her. Manager came around to see if all of the guests were good. Also, another quality I did like was that the manager wanted instant opinions from his patrons. Pretty cool. Sports were on tv, so I didn't miss the Bulls game.", "author": "Gio W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-09", "description": "Worst service ever.... Not kidding. Never write reviews but making the exception now. Ordered a cocktail first one had no liquor in it asked for some in it and they come back with it in a smaller glass with again with out liquor.. Very disappointing for a national chain.  \n\nPs food is cold also", "author": "Scott F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-08", "description": "Not the best service. We sat the counter for over 10 minutes before we were even acknowledged at the bar. I was disappointed but I thought it was more of a management problem since I have a background in service industry. The bartender was so busy that he really didn't get very good service. I never even learned his name. But he shouldn't be stretched so thin that he's not able to provide good customer service.", "author": "Barbara Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "Came here for lunch. I was floored by how delcicious everything was. And great prices! The decor reminds me of my childhood. Will return!", "author": "Claire D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-23", "description": "Please don't go to this place. i got assaulted by two guys in Applebee's. I spent two days in the hospital. Nobody tried to help me while i was getting beaten up. The manager was more concerned about getting his bill payed. This place is very dangerous especially at the bar and the bartenders are friends with most of the criminals who come there.", "author": "Catt A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-17", "description": "This Applebee's really made me question whether or not I'll be going to an Applebee's again anytime soon! I had to wait about 30 minutes for two easy meals, which was extremely frustrating after hearing another customer complain about delayed food service as well. Another problem was the quality of the food; NOTHING LIKE ADVERTISED. I was extremely disappointed with my Classic Clubhouse Grill sandwich which was supposed to contain \"toasted bakery bread.\" Yeah, that bread was more or less 99 cents' store fresh. Besides that, I also had a problem with my chocolate chip sundae, which came with a cold chocolate chip cookie (which made it hard to scoop with the spoon) and horribly placed whip cream and oreo cookie pieces. However disappointing the food and wait time was, the service was still okay. The restaurant has a comfy, ambient environment, that is not too loud. \n~The food is also adequately priced!", "author": "Bilal A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "I've been here a few times for \"Applebee's to go\" I liked most of the staff and the food was pretty good, I ordered the margarita chicken and shrimp, It had tons of shrimp but only like a half cup of rice....still trying to make sense of that...but for 10 bucks I cant really complain, also the wait time wasn't too long which is what keeps me coming back.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-29", "description": "DO NOT GO HERE. They consistently have the worst service I've ever had anywhere. Multiple times they've charged me the wrong amount on my check ($54 for some nachos and a glass of water? REALLY!?!). Do not trust the employees at this place, as they're all incompetent. Clearly Applesbee's does not hold they're employees to any sort of standard. It's impossible to get anyone's attention, and you'll be waiting 30 minutes for a beer. This place needs to shut down. Go to the one on Atlantic if you're really set on going to an Applebee's. THIS PLACE NEEDS TO SHUT DOWN!", "author": "Suvojit C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "You have to try the chicken wonton tacos in happy hour menu. I ordered that with shrimp skewers.  Drinks were great too.  Happy hour half off.  Can't go wrong.", "author": "Jasiri S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-23", "description": "1st time I came here it took about 40 mins to get seated. Then the server didn't come to take our order until 15 mins later. We ordered 8 drinks only 5 came, we told the waiter and he gave us an attitude and ignored us. We had to get the manager! Now for the food, it was cold and disgusting! \n\n2nd time I went was about a year later, we got seated right away, the server was very nice and friendly and sweet he took our order very quick. Our burgers came pretty fast. \n\nSo the two stars is for my second experience. I recommend you to go to the other Applebee's a few blocks away its so much better.", "author": "Connie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-01", "description": "This is NOT the one in Atlantic Mall, this is the soul less, ratchet one across the street from LIU. You'd have a far more superior dining experience if you went to the $1 a slice pizza store a few feet away from this Applebees. You get the feeling that management is very hands off and the staff is not held to any type of standard. I've had two separate friends relate experiences where they saw actual fights go down between diners and staff. The last time I went against my best interest my lazy unprofessional waitress took almost 15 minutes to appear because she was too busy being thirsty and flirting with the table of men next to us..  When my boneless chicken arrived it looked as if it had been scraped into my plate from someone elses leftovers and the burgers were as usual undercooked. I knew from past experience that getting the manager wouldn't be of much use. Their Happy Hour is a joke, the bartender showed us it's just a mix of hardly any alcohol you are better off getting your own bottle. I would never go to this place again, it needs a real overhaul from top to bottom.", "author": "Ariel S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Applebee’s Grill + Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave Ext", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/XnIQmTYtNfuX5EMM16sRtw/ls.jpg", "@type": "Restaurant", "telephone": "+17188340800"}