{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-23", "description": "If I could can give 1/2 a star I would! I'm forgiving of the place being crowded the day before a holiday, however I am NOT forgiving on sh*tty subpar service. I booked this venue for my daughter's 2nd birthday party tonight from 4-6 and the hostess was terrible and disappeared for long periods at a time. \n\nWhen it came time to cut the cake we had to wait until their stupid show was over before we could have out daughter could blow out the cake (We have about 20 mins left for our table) The hostess takes the cake for it to cut and doesn't come until it's time for our time was up! The birthday girl or my guests DID NOT even get any cake!! The hostess already had the check in hand ready to clear out at 5:58 (time stamped on the receipt) and REFUSED to give my daughters' grandmother a cup of water and told her she needed to wait on this ridiculous long line! \n\nif you want to throw away $140 of service as shitty as their carpets then this is the place to go!\n\nYOU HAVE BEEN WARNED!!", "author": "Tamara R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "Positive review:  I must say I'm not quite sure why this place has received negative reviews. I brought my four year old son here after work on a Tuesday evening around 5:30pm and we had a great time.  The place was quiet. Only a few couples with their children. The staff were friendly and helpful. My son had a great time. I will be back.", "author": "Shmuel R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-04", "description": "Came to Chuck E Cheese for fun with two friends. We had coupons: $25 for a large pizza, 3 sodas, and 30 tokens and $20 for 100 tokens (usually 90 tokens). We waited for our pizza to be deliver and when it did, it came out to be looking like a medium size. They offer free refills on the soda but they add way too much water than soda. \n\nAfter our food, we started playing the games. Honestly, I don't expect the place to be perfect but some of the machines are really dirty. For a token a game, the price is definitely worth it but you really don't win that many tickets. My favorite was the basketball, wheel of fortune, the sketch book (too bad it \"ran of paper\" when we went to take pictures). Be careful because sometime the machine just eat your token or doesn't work at all, so you have to go find the workers.\n\nThe prizes are honestly not the best but hey, you don't really expect much for such cheap games.", "author": "Jasmine C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-25", "description": "I tried to go with my little sister for a birthday gift to have fun for the day and they wouldn't let me in because they said I had to be 21 years old to enter and I was 18 at the time...that was really saddening", "author": "Janjay S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-20", "description": "saw a little mouse run across the playing area.  another customer ask if he just saw what he thought he saw.  and I said yes it was the real Chuck E.  at first he though it was a ball of some sort cause it went by so quick.  and if chucke cheese wants to verify my visit.  I was there yesterday between 11am - 12noon  wearing a white tshirt and khaki pants with new balance brown walking sneakers.  I was with a 1.6 yr old.\n\nand was upset all the riding games had the out of service tags on them.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-04", "description": "I have nightmares about this place.  \n\nAs part of the community service initiative I am a member of, I took my young mentee here for a weekend outing after she told me she was eager to go.  I have only been to Chuck E. Cheese once in my childhood and I have no recollection of my experience so I wasn't sure what to expect.\n\nThis Chuck E. Cheese is teeming with young children whose parents make a beeline to the food area and leave the kids to \"play\" with no tokens.  A majority of the games and rides are occupied by children haphazardly twisting and turning joysticks and wheels to no avail, so as to not allow paying customers a turn at playing.   My mentee was pretty upset when she found that one of the only vacant games was the bowling machine. There was also a point where we put a coin into a machine only to be met by another child sprinting forward to press the \"start\" button,  leaving my mentee with one less token yet no utility gained. \n\nThis is definitely not a place where \"A Kid Can Be A Kid.\"  Unless that means fending off other children from taking your turns.", "author": "Virginia T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-30", "description": "DONT DO IT. Terrible, terrible service.", "author": "Sam W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-20", "description": "I had low expectations.  I am very happy that we had an overall good time.  We will come back.  We were here twice so far.  Once was a friends birthday party.  Both times it was fairly clean, bright and no louder than any other arcade or amusement park.  If you want quite go south a bit and visit the Botanical Gardens.  Really.  It is a wonderful place.  You should go there.  Anyway, it was very easy to spend an hour or two here.  There were enough electronic games and old school games like skeetball to keep my 6 yr old busy. The food is of course fast-food.  Yes, most all the staff seemed unhappy.   But this isn't Disneyland.  If it matters to you, you should know you will encounter a few unsupervised free range young children and more than one stressed out overstimulated adult.   There were also several broken machines and we lost a few tokens.  Overall I wish I saw staff patrolling the gaming areas.  I think engaged staff supervising the guests would have made this 4 star fun instead of 3.", "author": "Jeff K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-25", "description": "Omg this place is horrible every time I go in there, most of the machines are out of order or they steal your coins.. It's annoying!! I'm not wasting my time anymore", "author": "Malia B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-21", "description": "Hide yo wife!  Hide yo kids!  This place is for the rats and I don't mean the big scary mascot.  I have nephews and lots of little cousins around so I've had a go a few times at this establishment, though admittedly, it's been in the burbs.  I went with my cousin and her son to celebrate his belated birthday and we thought it would be perfect since we also needed to go to my favorite place in the world (Target) after a few hours of unlimited, sensory overload fun.\n\nPro:\nYou automatically get a table when you purchase food\n\nCon:\nThe food took over a half hour to arrive\n\nPro:\nThe salad bar was half decent and apparently people like to use cheddar goldfish as croutons.  \n\nCon:\nFries were really cold when they came out\n\nPro:\nThey use some sort of system to stamp a number on your hand so you can't steal people's kids\n\nCon:\nThere were no children worthy of kidnapping.  There were a good group of little tyrants running around and I even heard a few drop the F bomb like  it was nobodies business\n\nPro:\nBathroom is kid friendly.  They have small toilets for the little people\n\nCon:\nNot that helpful to have these little toilets when there are doors missing\n\nPro:\nGood number of trash receptacles\n\nCon:\nSo why was there a mound of chicken wing bones and pizza crust on the floor?\n\nPro:\nGoing with a 2 year old means that you don't have to purchase a lot of tokens and when they run out you can still take him to games and he thinks he's playing.\n\nCon:\nThere is something morally wrong about conning a 2 year old.", "author": "Donna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "I took my 14 month year old son here to get him out of the house and was really pleased with the service and experience here. It wasn't as crazy as I expected for a Saturday, but it was Valentine's Day so that may have been why it was not packed. We ordered a pizza that came out hot and my son liked it, we played some games and rode the car rides. The staff was all super friendly and kept asking how the pizza was and if we needed anything. I also appreciated that when clearing tables, they sprayed sanitizer and wiped down each table pretty good which made me feel better as a germ conscious mom. It was also very reasonably priced - there's no charge to get in and you just pay for food and game tokens. Fun Valentine's Date!", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-09", "description": "Abject stupidity could be defined as writing a review about Chuck E Cheese's and thrilling the readers with a somber diatribe about how bad the food was. Even more disturbing is a review about Chuck E Cheese's which laments the fact that there are so many kids running around. Hello? This place was created for kids, not adults. If you are going to Chuck E Cheese's without a child you have much larger problems than your e-persona on Yelp so we can just leave it at that.\n\nThis was not my first trip to Chuck E Cheese's. I have been to a variety of outposts over the years with my kids, all begrudgingly so because I find them all to be dirty on top of dirty. However, there are a million little hands eating food and playing games all day, I can't blame them for it getting dirty, but I can blame for it staying dirty. This Chuck location was pretty clean early on a Saturday morning as I dropped my daughter for a birthday party. I surveyed the machinery and shockingly, almost every game appeared to be working. Again, if you have never been to a Cheese's in another location, usually half of the games are operable at best.\n\nIf your kids don't enjoy themselves at Chuck E Cheese's, it is probably your fault. It is like a kid not liking bubbles or balloons, it's basically impossible. The lure of spending $20 after $20 to win tickets that turn into a stuffed animal for 1,000 tickets is crystal meth for kids, they just can't get enough.\n\nThe most important thing about all Chuck E Cheese's and this one as well is that when you enter with your child, you and your child both get the same hand stamp number. You can not leave the place unless your hand and your child's hand matches. So although it is occasionally dirty and unkempt, loud and universally disgusted for its food, it is a classic destination for kids for a couple of hours and it is comparatively safe. Since this one is located within the Atlantic Center Mall, training it here is as simple as it can be. Enjoy, then wash your hands like five times.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "My four year old son LOVES coming here and I enjoy coming with him. It's clean, the salads are fresh, and the staff is all very friendly. I would highly recommend not coming on the weekend or school holidays though, because when it's crowded, it's crazy. I only bring my son on weekday mornings when there are just a handful of preschoolers playing.", "author": "Cassie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "My children are having a wonderful time, though it's better when my oldest comes to earn tickets for my younger two. Many reviews said the place was not clean. I've been here over two hours, and I've seen 4 or more people cleaning. As I entered the ladies room someone was cleaning, not easy to keep a place this large with this amount of different people clean. I wonder how many have servants in my house you make a mess you help clean it. I enjoyed my time though it was toooo many people.", "author": "Deborah C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-01", "description": "Chukee looked like he wanted to quit his job. They should hire someone who will be enthusiastic around the kids. The buffet used to be ok. Now the food sucks. They do not have any more Italian sauce, also avoid It on the weekends because it gets very congested with kids running around, bumping into the little ones.", "author": "Kim B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-06", "description": "because it's the closest one to me. a lot of things are broken here. the ticket counters, the cotton candy machine, the ice cream machine, a couple of skeeball machines. bathrooms are filthy too. 9 out of 10 stalls are disgusting. I'm not sure if that's due to the patrons (probably, but the staff needs to clean it more often) \n\nthe pizza is terrible. definitely tasted microwaved. I think all their food is microwaved. the only decent thing I got were the buffalo wings with celery sticks. chicken nuggets were terrible too. you just wanna gnaw on it for a little and then decide that it's like eating cardboard so you eventually spit the rest out. won't be ordering that again (thank god i got the kids portion and not the adult size) oh the food took FOREVER to come out too. I was starving by then. came in late at night. the one good thing: it's open late. \n\nthe worst thing about chuck e cheese? that toy redemption line. yeh, some of the patrons are pretty ratchet and take forever to pick out their toys but be considerate! you see 15 ppl behind you and only ONE person behind the counter, hurry the heck up!!! and then when you get there, everything costs 400+ tickets and the ones that cost like 50 tickets aren't even worth buying. I could go to the supermarket and get that for 25 cents in those gumball machines. do better, please!\n\nthis place has potential. i think management needs to step their game up. but I do appreciate that they still do the kid and guardian checking with the uv light stamps", "author": "Ms G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-12", "description": "visited this location with my daughter last week.  She loved it.  We stayed away from the food because its basically over priced fast food that doesn't taste good.  So we just went in for the arcade.   My daughter had a good time but the longer we stayed in there the more crowded it got.  there were no tables all were reserved for parties.  As we were leaving we noticed they were holding the line of about 60 people waiting to get in.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-03", "description": "When I'm in Brooklyn and I have a hankering to get my Skee-Ball skills on, I head on over to Chuck E. Cheese.\n\nThis place has pretty much every kind of game you can think of: pinball machines, skee ball, NASCAR racing games, basketball shooting games, a video version of \"Deal or No Deal\" and of course Whac-A-Mole. You know: Whac-A-Mole, where you have to use a mallet to hit the head of moles that come out of the various holes. The perfect game to play when you're pissed off at the little kid who cut you off at the Simpsons video game and you need to take your aggression out. \n\nI only give it three stars because, on the day I went, there was no mallet for Whac-A-Mole so I had to use my hand, which was hurting afterwards. Also, the air conditioner wasn't working by the video game section so we were literally steaming.\n\nThe main thing you have to put up with are the little witches....i mean children who are running around the joint. Sure, it's a little funny when they're watching me hit stage 20 of Galaxian but it's even funnier when I'm pushing them out of the way so I can redeem my tickets for a prize.", "author": "roderick A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-26", "description": "My kids really love this place...I would have given them 4 stars but because the pizza isnt as good as it use to be nor the coupons 3 it is. oh what the hell my kids love this place so 4", "author": "Chantel E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Fun and friendly staff, attentive security guard and inexpensive. What more do you need for a fun worry free family day out? Go!!!", "author": "Lynn K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Chuck E. Cheese’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave\nAtlantic Center Mall", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jfxzNdSwQZbO8japbGoEFA/ls.jpg", "@type": "Restaurant", "telephone": "+17187834570"}