{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-03", "description": "Very well organized place ( Thanks Monique) my freinds knew her very well we came today to celebrate my Freind daughter birthday .if i have kids i would defetinely come here to celebrate birthday . ( there buffalo wings \u0026 mozrella cheese and Pizza are amazing there sell beer and wine for adults only)This is located in the Atlantic Terminal mall, \n\n\nVery conveinet by mta transportation :\n2,3,4,5,B,Q,D,N,R- Trains.Atlantic avenue - Barclays center  Subway station .\nL.I.R.R. ,\n\nG- Train - Fulton street\nC-Train-Lafayette street\n\nBuses:\nB41, B25, etc buses", "author": "L L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-15", "description": "More like Chuck-up Ew, Jesus.\n\nIf you come to Brooklyn and end up eating at Chuck-E-Cheese, you have issues. And not like Julia Michaels but that's just as bad.\n\nBrand name advertising has done very well for this franchise, as all of the little kids think it's awesome. You're in Brooklyn for God's sake. Get your kids some proper pizza and don't let them be homogenized like the rest of the country. Wake up people.\n\nAnd yeah I ate here. Blame one of my friends in Brooklyn. Well actually blame her 2 kids. Well no blame her. She pulled those reins ffs.", "author": "Fox E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-12", "description": "Ehh, not the best of places! \n\nI ventured here today, for the first, and more than likely, my last time. A few weeks back I brought my daughter to Target and she wanted to go here, but it was too crowded, so I owed it to her, but after a few minutes, I regretted my decision.\n\nYou walk in, you and your group will get a stamp on your wrist (it's weird because I couldn't even see the stamp, but whatever). You can then proceed to the line with the food packages (pizza or salad bar) or you can engage in free play and purchase tokens or a refillable card. \n\nIt's a bunch of games here, most of the games are only 1.8 points, which is relatively inexpensive (+1). The staff is pretty young, but they were responsive and helpful (+1). This is a cost effective place to take your kids for their birthday or merely for a leisure day out. It's a similar premise to Dave \u0026 Busters-- games provide you tickets, which you can later turn in for a prize (+1)\n\nNow, here comes the negative; what's the worst part is, it's mostly not due to the business itself, but it just destroys the fun-- the people here at this location, are the pits. I couldn't count the amount of kids I saw running wildly without a parent in site, kids misbehaving right in front of parents, who were too busy engaged in conversation to parent their minor child. Kids who play a game fifteen times in a row despite a long line of kids waiting for a game. I had a little girl steal my daughters game, that she was playing, but my daughter said it was ok, but I didn't feel it was acceptable.\n\nAnother complaint--several of the games didn't work at all, and others, just took your card swipe or coin, but you got nothing in return (-1) \n\nThis place is a notch up from Kids in Action, that place is dirty, but much more well behaved children. However, I wouldn't bring my daughter here on a regular basis, even though she enjoyed it here, I'll stick with Dave and Busters.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-21", "description": "So much better!! They have new games. I alway run into like 4 games that don't work but this time NOPE!! They now have security and more visible management. This really was the best time i had there and so did the kids. Space invaders game is awesome!!", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-08", "description": "This place is disgusting. I will never be back here again ! Only tagged along with a friend because her little cousin likes it, but this location is DISGUSTING!!!!", "author": "Petty G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-27", "description": "Just celebrated my daughter's 3rd birthday today and honestly didn't expect such a well organized set up by this outlet's team! Very impressed with the attentiveness of manager and the hostess to our party. It was probably the most easiest party to organize since I booked everything online with some minor changes and questions. I couldn't get through to the outlet via telephone, but you could call the general customer care number and they will get back to you. The outlet did call me the day before the event which was great. There were enough high chairs for our party that had 3 babies. Also for parents that are wondering, they do serve beer and wine. The only thing that is a downside is the ticket counting machine. They should have something where you can put all your tickets in one machine instead of having to insert the ticket one by one. We ended up not redeeming anything cos it took way too long to count the tickets. Besides that we really had lots of fun and are very impressed with the management of this Chuck E Cheese! Oh Chuck E got rid of his band, now he's going solo :|", "author": "Yani I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-15", "description": "It was pretty good, my daughter enjoyed herself. I left when it got crowded. It's better to go during the week, you have less crowds there.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-30", "description": "I've never been one to take my child to Chuck E Cheese, but on Saturday I found myself at Target in Atlantic Avenue Terminal, picking up an order around lunch time.\n\nThe only way to avoid missing lunch was to go see the third most famous mouse in America, Mr. Cheese himself--Mickey and Minnie take the first two places, right?\n\nWe actually liked it. The games especially. The timed game passes rock. You pay, you swipe, your kid has a ball. They had a mini basketball court that my future NBA baller only realized existed when I made him use the bathroom.#momlife. \n\nBut he had fun running around in the very spacious area, going from one cool video driving game to a fair-type shooting game to a rocking boat game that was out of order. We found a few of them displaying that majorly disappointing blinking error message. \n\nI felt a little off balance being there because I couldn't see where he was at all times. The fear! There are so many games and structures, and kids and parents and workers selling cotton candy and balloons (had to buy one for $2) and stuff that adds to the hectic experience of Chuck E Cheese. But there was tight security at the front entrance that made me feel a bit more relaxed, once we were leaving of course.\n\nThe food was OK--especially the bbq chicken wings in the family sampler. My son's pizza looked a little over done but he ate half of it and I \"encouraged\" him to eat a few of fries on my plate.  \n\nWe'll probably be back a few times or maybe every Saturday.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "Good place to bring my nephew and niece in here, they all have fun in here.\nThe reason for 4 stars is the place is dirty, they dont clean it often. Most of the earing tables are dirty and seats as well!! No parent would let his kid eat on thoese kinds of tables!!", "author": "Serj D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-17", "description": "where to begin....service was amazing, the pizza came in about 20 minutes. Mr. cheese did his best to create a welcoming atmosphere and a personal experience. Pizza was great, not reused (as my children told me it might be). Was a great night with my ladies. Would return.", "author": "Rat R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-17", "description": "I don't have children but I'm spiritually 12. I went here on a Saturday with some friends celebrating their son's 1st birthday, which is a little too young of an age for this place, I'd say it's best for kids around 4 and up. \n\nGET TO THIS PLACE EARLY! It gets really packed on the weekends and trying to get a table was a nightmare. They offer a variety of pizza and chicken on their menu, once ordering you receive a number card for your table and your food is bought to you by a server. There's a drink station where you can get free refills, as well as a paid salad bar. You can also purchase a birthday cake here, same day. \n\nThe games were pretty decent, there were plenty to choose from like basketball and pink panther. A few of them were adapted from mobile games, like subway surfer and fruit ninja, which I suppose is a sign of the times. \n\nAn overall decent place to treat your kid to.", "author": "Ciera T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "Yeh, I don't understand why everyone is so damn triggered by Chuck E Cheese's.  I am a straight up snob, my wife is worse than me, I was expecting something out of deliverance maybe.  I was expecting to see toothless meth heads huddled around a trash can fire, I was expecting to see apathetic staff and just like dirt everywhere.  And who doesn't love to hear a good news story\nAbout a group of parents having a knife fight at their kids birthday party?  I was shocked to be happily surprised\n\n1)The place is clean and new looking \n2)Staff was actually helpful and friendly.  I was expecting to see the glazed over apathetic\nMouth breathers that you find at Home Depot but, damn it, there is hope for today's youth\n3)The place is large, not crowded and my kid loved it. Sunday at noon, I was expecting a mad house. \n4)for 12 dollars my kid played for over and hour on various rides and games. \n\nwe didn't eat but we noticed several trays of fried things come out of the kitchen.  It looked to be on par with an Applebee's or your standard chain restaurant\n\nWe spent like 1.5 hours there and my 3 year old was\nReady to go.  \n\nOne thing I would complain about or critique is the amount of shooting games.  But hey, I'm the parent and we didn't play any games where something was shot or murdered or hurt.   There was still plenty of interactive games and other stuff to keep his interest.  \n\nWe gave our redemption tickets to some random child and skipped the imported plastic toys and candy.  \n\nI will be back the next frozen weekend day.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-23", "description": "We were happy to bring over our 2 years old daughter until we found a rat running around the play area . I informed the worker and the black lady who was busy making cotton candy seems like I irritated her. No words reply to me and just call 2 more workers to look around for few seconds and no reply and no feedback after this ! I've call the DEPARTMENT OF HEALTH AND HYGIENE right away to file a complaint . Ridiculous to found a rat in this place that full of kids and serving food . The workers are all rude and no apology after all these . Be careful if you choose to have the food in there . Please stay away before the officer check them up . Crazy dirty rodent home .", "author": "Connie Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "Being childless but having a kid (little cousin) thrust on me on my day off of all days was a jarring experience. I had to formulate a plan of action that would rightfully crown me the best cousin in all the land. I haven't been to a CHuck E Cheese in years and never to this location so I felt like a noob as I walked in with child in tow.  I was greeted by a nice young lady who asked me if I was there for a party and then asked if we were just there for the gaming or did we plan to eat as well. I was unsure so she stamped us in and informed me that all the tables were reserved. More on that later.\n\nMy little cousin walks me over to the machine that you use to put money on a plastic card so that the kids can use as currency. It was pretty affordable, $20 can get you a good amount of play time so that was a pleasant surprise.  Unfortunately to me the place looks pretty barren,there aren't that many machines or games in my opinion so it got pretty dull quickly watching my cousin look around for the next game to play and going back to the same game or having to wait her turn. The place quickly started to get packed. So the tables that are all reserved? Apparently you cant sit in their precious booths unless you are eating one of their famed pizzas. I did NOT like that, I had to stay on my feet the whole time trying not to lose my cousin in the throng of folks.This was a turn off to me so I spent my money at Buffalo Wild Wings which cost me more but a point had to be made!\n\nPros-\nAffordable\nClean Bathrooms\nThe staff here is VERY nice and pleasant. Their customer service is top notch so I commend whoever does the training. Shout out to the young lady who mans the ticket counter where the young chaps, use their tickets to buy \"prizes\", she has the patience of a Saint.\nThe stamping of the forearm they do to ensure kids aren't kidnapped is a great idea.\n\nCons-\nNot many games or activities to me.\nTicket counter machines kept breaking down", "author": "Ariel S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-30", "description": "If I could give this place lower I would. I found out only certain outside food items were allowed while others aren't from a staff member who had an issue and threatened to kick us out. But I also saw that same staff member allow a non service dog into the establishment. So I guess there are some rules that can be broken and others that can't.", "author": "Taslima B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-25", "description": "I went to chuck e cheese on 7/25 and ordered food and it came out cold.  When I went to complain the manager refuse to come out of the office.  How can they serve a cold chicken platter they are trying to give me food poisoning.  However I feel the manger should be fired for not coming out and addressing the matter larger some of money that I spend.  Today is the worst it has ever been since I have been coming here.  If this is a new manager fire him and get the other one back", "author": "Judy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Besides it being crowded it was a great atmosphere for children my son had a great time. The pizza was fresh. A cup is close to 3$ but you get free refills. The staff was great. My son got a free ball. He was not interested in collecting the tickets. Lol he did enjoy the games. My son is 2 years old so i had to follow him around. For the bigger kids there free to run around", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-26", "description": "this place is trash, I rather to go to the ones in queens that have more and is cleaner this place reminds me of the neighborhood that used to surround it before the gentrification. I dislike coming here and haven't been here in yrs for that same reason. Last time I was there I had food on my table and as we were getting up to leave someone asked me if I was eating the left over pizza my kid didn't want I said no and she said if she could have it before I said yes she took it and gave it to her kids. I was like wtf I grabbed my kid and flew out of there", "author": "Billye D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Just celebrated my son's birthday party and I must say that I was very impressed.  Everything was wonderful. We had a great host, her name was Talia. She was very attentive and always there when we needed her. The pizza was great (plain and pepperoni) also the wings platter of BBQ and buffalo. We got the Super Star package which was $23.99. We also had chocolate and vanilla ice cream and the vanilla cake with icing sprinkles was delicious. Every one had a great time especially the birthday star who got to go in the ticket blaster. I would definitely have another party here. Thanks guys.", "author": "Lee R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-25", "description": "I am currently waiting over an hour for our lunch order. We will not be back. I absolutely do not recommend waisting your time/money on food here.", "author": "kathy b."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Chuck E. Cheese’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave\nAtlantic Center Mall", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jfxzNdSwQZbO8japbGoEFA/ls.jpg", "@type": "Restaurant", "telephone": "+17187834570"}