{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-28", "description": "I went here for a friend's daughters b'day. Next time i will just send a gift! This place is crazy, smelly and unorganized! There are so many sticky little brats running around. The kids were so loud, sticky and annoying i don't understand how anyone could be a pedophile. ehh I'd rather loose a leg than go back.\n\nEverything is old and falling apart, save the money! The kids won't remember it, but ohhhh you will.", "author": "Kimberly F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "Had my daughters 9th Birthday Party here she reall had fun the Manager was very helpful and the hostess was very into helping my daughter feel special overall the kids were happy", "author": "Ola C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-14", "description": "As much as I adore Ryan's review, I have to point out that he did take me on a date here... To his credit, Atlantic center doesn't have many food options unless you want to contend with the thugs in Mickey D's. \n\nI have to admit that the games are fun and it's nice to revert back to childhood for a bit and donate the prize tickets to children. If I knew any kids in the area, I would definitely take them here for an afternoon of entertainment, but I would feed them before because the food prices are RIDICULOUS. The salad bar is okay and the cheapest thing on the menu because 1) what kid wants the salad bar and 2) you can get as much as you want. \n\nChuck E. Cheese himself is pretty horrifying, but as long as you can avoid looking at the multiple TV monitors showing the music videos that accompany the Chuck E Cheese versions of pop songs such as \"Like a Virgin,\" you'll be fine. \n\nSadly, we weren't the only people there unaccompanied by minors. We were just spending the couple tokens we got with our food, but apparently people over the age of 18 actually go there solely for entertainment purposes.", "author": "Haley C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-04", "description": "Oh my gosh this place is a zoo! I mean literally. THe children are wild, the adults aren't any better. My daughter was riding on a horse ride and another child just hopped right on the back. Ride after ride this happened, and I had to keep kicking kids offI WOULD NEVER HAVE A BIRTHDAY PARTY HERE FOR HER! the line for food litterally took up a quarter of the space. the food (pizza, soda, salad bar) was definitely overpriced. My 6year old god daughter seemed to be enjoying herself but I was extremely horrified. the bathrooms were semi-cleaned and the heights of the toilets were children friendly. If i have to go back, I pray it's during the week because Saturday night after 8pm was HELL", "author": "Taryn S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-27", "description": "Chuck E Cheese, decked out in his rat suit once made my baby sister cry.\n\nFor that he must suffer the 1 star rating.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "My son celebrated his 7th birthday here yesterday and had the best party ever!!!! We were so impressed by Lou (the GM) and his team. The flow of the party was perfectly organized and my son's friends had a blast! I asked the birthday boy last night what he thought of the party, and he said that it was the best party he has every had :). I highly recommend the 10am birthday party time slot...we virtually had the place to ourselves.  Thank you Chuck E. Cheese for making his day so special, and for taking care of all of the details...it meant the world to us!", "author": "Mandy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-24", "description": "Came in here to kill some time while waiting to be seated at a nearby restaurant. OH MY GOD, THE SAVAGERY. I thought children were supposed to be innocent and played nice. Nope. They were all exactly the same. Pushing each other around not waiting for their turn. Throwing food on the floor to show that they did not want to eat anymore. Little boys taking turns on the race car games to not try to beat each other but to have the opportunity to slouch in their seat and drive with one hand. Not to mention the jungle gym was not enough for these little savages. They had to climb on every machine even when other people were using them. All this while the mothers watched in silence at what seemed to me as approval for the way you should act in public. I would not be surprised if these little monsters used their pants for their bathroom breaks because the restrooms were spotless.", "author": "Vinny B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-27", "description": "look, it ain't the Ritz.  But you don't go to Chuck's for the food, you go for the kids.  I can't believe we have grown men and women writing reviews of this place is if it were meant for them.  Get over yourself.\n\nmy son is 14 months old so he can't play too many things by himself but he really enjoys the noises and lights, and he liked the little things you can ride on.  When there are a lot of kids, he seems to have a lot of fun playing with them.  \n\nIf it's raining outside, there aren't that many better options than the rat's lair.  Just make sure you eat BEFORE you arrive.", "author": "danny s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-12", "description": "This is a good place to take children under five for a birthday party or just to horse around.  I came here for a kid's party  on a Friday night and there were wild kids running all over the place playing video games.  The service was incredibly slow.  The pizza and wings literally took almost 1 hour to reach our table and it was not worth the wait.  The place was severely understaffed with just one cashier taking the food orders.m  My advice to people is don't come on a Friday night or if wild kids screaming bothers you.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-17", "description": "Gave it 3 stars there chicken bbq pizza is a delight.  Fries are not greasy either.  The wait is a mother though.  Also as I said in the arcade chuck review only weekdays.  This place is a zoo on the weekends.  Not even sure if its fair for the kids.", "author": "Felipe R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-01", "description": "The only eating establishment in New York City where being accosted by a giant, giggling rat does NOT earn said institution a citation from the Board of Health.  In fact, this pro-rodent behavior is encouraged at Chuck E Cheese (this is presumably the rat's name, though I'm none too sure of what the 'E' stands for) and the little kids seem to love it.  Children will love Chuck E Cheese for every reason BUT the subpar pizza.  They have 800,000 different arcade-style games that will distract the little buggers from the mediocre nature of food they'll barely touch anyway.  They will be far too busy diving into plastic ball pits with their sweaty brethren to even take a bite of Chuck E Cheese's culinary staple.  For the adults, the experience will be pure hell if you don't have kids and are forced to endure this midget perspiration extravaganza.  Parents might just find C E C a slice of heaven as their children are transformed from nagging little brats into \"Disciples of the Rat.\"  Avoid the salad bar at all costs.  No good ever came out of an \"All you can eat\" salad bar.  And don't stare at the televisions for too long.  They pump out Pro-Chuck E propaganda, and before you know it, you'll be pining for the rat's inferior, dairy-based offerings on a daily basis.  \r\n\r\nB.Y.O.G.T.= Bring Your Own Glue Traps", "author": "Ryan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-03", "description": "I love comming to this Chuck E Cheese because of the ski ball! My 11 year old loves it there and so di I! Their pizza is just like pizza huts!", "author": "Michelle Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-26", "description": "ridiculous! never again! staff is good! some kids try to take your kids tickets from machine! my kid is 2 yrs! so rude!", "author": "Mrs.n W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-31", "description": "Went there for a little relative's birthday party. Kids had loads of fun, even some adults in the party sneaked out from the birthday table from time to to time to play the games  :-) As much as I did not enjoy all the noise and running after the kids who had too many options and wanted to play all the games at once, this is a great rainy day option for kids, so I will definitely be back...", "author": "M S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Chuck E. Cheese’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave\nAtlantic Center Mall", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jfxzNdSwQZbO8japbGoEFA/ls.jpg", "@type": "Restaurant", "telephone": "+17187834570"}