{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-11", "description": "I enjoy going here with the kids and the kids enjoy it a lot .. The pizza is ok  lol .. I don't know you'll need to try it your self. \nStaff is friendly and drinks are refillable. Not to many games but enough to keep the keeps active and not get bored to easily, and the prizes are usually at best decent. Come eat pizza, relax and have fun.", "author": "Issac L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "This was my first time in Atlantic Mall Chuck E. Cheese. It was not bad for a Saturday and a birthday party going on. The three stars came from 1. They do not let your child/ren under 18 out of the facility unless an adult okays it. 2. They were staff constantly cleaning up. 3. The staff and customer service was helpful. BUT, half the games did not work and have the ticket counters were not working either. For a busy place like this with a lot of kids this was not acceptable. Also they are under staffed. It took me about 20-30 minutes just to get to the counter to pick a toy. On a bust Saturday there should be at least 5 people behind the counter ESPECIALLY when the facility is hosting a birthday party.", "author": "Alania A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-01", "description": "went on 12/01 please do yourself a favor and avoid this place nothing positive can be said management should be ashamed the way this location is runned", "author": "Jose R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "My kids loved this place. But I realized one IMPORTANT thing about Chucky Cheese that if you don't come here with coupons you get REALLY ripped off. I overpaid for my tokens while another group paid next to nothing because they came prepared with coupons on their phone. The games are great. The food is ok. The pizza crust is so tasteless it reminds me of Matzah. Drink refills are free which is nice. I expected it to be more noisy than it was. But really the noise wasn't too bad.. And I get migranes.", "author": "Andrea K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "What an amazing place to celebrate my sons 1st B-Day !! Every little detail was perfect, we had so much fun ! Food was amazing and the host named Talia was really helpful! Can't thank you enough for this perfect day !!!", "author": "Dunja L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "This place is horrendous. The machines are always owing tickets and it takes 5 minutes to finally get someone to show up. Imagine being with a 3 year old waiting on each machine for 5 minutes! On top of that - 1 out of 3 machines don't function - which you can't confirm until you swipe ypur card twice... then to find someone to resolve the issue forget it. Horrible place - dirty and crowded with workers that are sleep walking.", "author": "Susy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "If i could give no stars i would like really big space and you have a hundred tables but only 3 machines for the kids to play with like rediculous  the staffs attitude was worse then the customers which was awful. Just not a child environment but its suppose to be for kids and the guy dressed as chuckee should be able to fit spending time with the bored children in between his shitty dance routine. Anyway costs to much and just over all waste of time and money very upset my 3 year old was asking me why they didnt have anything for her to play i have to tell her they do but just  not enough games for the 200 kids in a room with only a few working machines that totally suck.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-03", "description": "Oh hell noooooo! Never come here on the weekend! Food takes 45 minutes to get to you. Food that doesn't require much preparation, wings and fries! And let's not forget that first you have to wait in line for at least 20 minutes (if not longer) to order this terrible food. It's so busy your child will have to wait in line. Machines that change tickets to receipt are broken (not all of them but at least 2 at the time). Also, there's a cotton candy machine which has mold in i", "author": "Natalia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-07", "description": "Oh boy, the joys of having kids you get to spend countless hours in this place. This is only our second time at this location and it's not too bad.  It has changed since the first time we were there. There used to be a big overhead tunnel maze for the kids to play in and a slide right in the center of the place. When we returned the second time it was gone and I was glad about that. It was just a mad house and not good for the smaller kids which of course mad the smaller kids want to go in even more. But it's gone and they have re arranged and spread out all the other games. Makes it seem like there aren't that many things to do but your kids will find things. \n\nYou will be exhausted from moving all over the place bouncing from game to game. \n\nYou will be frustrated when you get to some of the game and they are out of order \n\nYou will be a little annoyed when the games that are working take your tokens and then you have to hunt the employee, whose job it is to try to fix said game and refund you back any tokens you lost. \n\nYou will have to keep an eye on your kids and their tokens and their tickets because some seedy child will try to swipe if not monitored. They will also try to jump right in front of your child in lieu of waiting their turn. \n\nFood is kid approved. I think they've recently revamped their menu to be more parent friendly\n\nBathrooms have mini toilets for kids and normal size for adults. Thought that was cool and it would be cooler if they were cleaner like a lot cleaner. \n\nOverall it's not as much of a chore as you think and your kids will be tired. \n\nMy kids are three and six, I will obviously be back", "author": "Cieanne E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-28", "description": "It was my sons 1st birthday party and this was a last minute option because of the rain.  But that 20/child cheap show they have at this place is top grade A rip off. I understand they have a schedule in place but I don't want to feel rushed at all. How is it that when u pay that amount of money you get 2 hours in the reserve section but if you walk in an pay 5.99/ child you can stay as long as you want?!?!? Absolutely out of this world ridiculous! Whoever came up with that plan needs to be fired. If I had known I have  to pay 20/child for some rat to hug my kid and sing happy birthday then to be rushed to eat dry cheese pizza and stuff root beer down my throat in 2 hours I would've stayed home. \nThen when you go to play the machines they take your coins and when you win the machines ran out of tickets It's too many options in the city to go to chuck e cheese again. Not worth it.", "author": "Jemise W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-20", "description": "I will grant you that as a middle aged single male, I am not their target audience. However, to call what they offer for lunch a \"buffet\" is to stretch that word to the breaking point. \n\nI have seen better buffets at a homeless encampment. I am serious. I used to do homeless outreach for a non-profit, and I have seen homeless folks living in a train tunnel have a better variety of food available than this ridiculous excuse for a buffet.\n\nIt's described as an all-you-can-eat pizza and salad buffet. The salad? One type of lettuce and three toppings: Cherry tomatoes, broccoli and baby carrots. That's it. And three types of limp, lukewarm pizza tanning sadly under a heat lamp. And some sort of dessert pizza that looks like it's just pizza dough with some vanilla icing on top.\n\nEven for only $6.99 (not including a beverage) it's not worth it.", "author": "David M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-26", "description": "If I was able to give no stars I would because this location deserves none. HANDS DOWN WORST EXPERIENCE. I WILL NOT RETURN!!!\n\nI will not recommend the Atlantic Mall location in Brooklyn to ANYONE due to the worst experience one could have with his or her children. the issues as follows:\n\n-the tables weren't clean , so we had to clean it ourselves\n-either the rides were not working or broken (eating the token or not giving you tickets). How is it possible for the maze to be out of service? not even Mcdonalds maze is out of service.\n- photo booth that takes crappy pictures with a weird line in the middle of each picture.\n-fountain drink machine missing ICE with need of cleaning\n-staff members who wear pants under their bottoms flashing the children their non name brand undies\n-security guards who asked for patrons to get off the ride because it was near closing time, shouting the countdown of when the place closes\n\n\nI would expect for those who are hired to have a sense of customer service and are able to articulate themselves properly. My experience goes as follows; the staffs were beyond unprofessional. There is nothing wrong with a team of young staff members to relate to the children however I blame management for not training these individuals properly. I literally had to retrieve a staff member to refill the soft drink machine with ICE. As I requested ICE the staff member rolls his eyes and looks at me with a blank stare for 10 seconds seemingly bothered by the request. You would think I ordered porter house steak with such a stare. No way a customer should have to inform staff there's no ice available and have staff say, \" do you need ICE right now.\" let alone staff who rolls their eyes at such a small request that was paid for by the customer. \n\nThe tone that the cashiers and other workers use around children is not appropriate. My children are not use to hearing curse words in their household let alone at an establishment that was not free. As a minority it hurts me to see the staff members represent themselves and the establishment in such a bad light. The workers are in need of diversity training and/or other trainings for a conducive workplace. \n\nThe security guards were just as bad as the other workers. I understand customers have to be reminded of the amount of time left till closing (which was repeated every minute by two guards from 10:55 until 11:00pm) however having to explain to a security guard that one child is feeding the ticket machine and the other is still on the ride. The security with a nasty tone requested for me to take my child off the ride. I am so sorry but that was flat out wrong especially if the ride was ending in a couple of seconds.", "author": "yudelka g."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "I've gone here two different times, both to have lunch after seeing Disney on Ice at Barclay's Center. The first time I was here (November 2015), half of the games were broken and the food took an hour to arrive, so I was pretty bored due to that. Not only that, but most of the toilets in the bathroom were child-sized, and only 3 or 4 were adult sized. Imagine having to squat over that with a full bladder-no fun! My second visit to this location was an improvement. The games were working this time, and the pizza came out in 20 minutes. They still had the awfully small toilets, but it's better than waiting in a looong line at Barclay's Center after Disney on Ice ends! So, all in all, it depends on the time of day you go there. The food is really good, and it's fun to watch them do the birthday song with the kids.", "author": "Jillian T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "I heard there's dedicated parking but I couldn't find it at the time.\n\nLocated on the top floor of the mini mall, which I must say is a great mini mall equipped with Target and Victoria's Secret, food, Bath and Body and couple other little shops, this Chuck E Cheese is busy with youngsters and parents having a good time.  I thought is was fairly clean for this venue and the only tears I saw where from the kiddie's that were told it was time to leave.  \n\nAll the machines and games seemed to be working, service was good as expected, food was delivered within a reasonable time frame and seating wasn't too difficult to find.\n\nMy recommendation stamp has been placed here.", "author": "Natasha S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-04", "description": "A COMPLETE ZOO!!! I took my nephew here as a treat and when we left I told him never again! The police had to be called because these two parents were about to start fighting! It's a place for kids for crying out loud! The kids aren't really much better either! My nephew had a good time but I was very concerned for his safety every other minute. Very crowded!", "author": "Bayyina B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-09", "description": "My only piece of advice is COME EARLY. They open at 10am and that's when I arrive. There is usually 1 or 2 other parents there who have figured out the secret.\n\nWhen they first open of course everything is great. My son gets to play all the games he wants without other kids bumping into him causing his nose to bleed,( this actually happend before we were hip to the benefits of early arrival) stealing tickets or wanting to fight for a turn.  We arrive early, were in and out!!!", "author": "Felicia P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-11", "description": "The children seem to have fun, but it's loud! The food is okay but be ready to wait half an hour!!", "author": "Véronique T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-11", "description": "NEVER AGAIN IN LIFE!\n\nExtremely crowded and not enough things for children 4 and under to do. Parents let their children run around unsupervised and then want to scream and disciple the child loudly because they couldn't find them. This made no sense whatsoever. On top of unsupervised children and loud parents my son and myself were literally followed around the game section by a group of three little boys. First they asked me for my tokens. Of course I told them no. So instead of them asking their parents for money they followed us and waited for us to play a game then jumped in and tried to play with us. I didn't mind at first but drew the line at the basketball game (there was only two basketball and four kids trying to share which meant my son got bumped out of his own game). \n\nThe place isn't that clean, the food is overly expensive, the wait for the food is ridiculously long and the prizes are horrible. We stayed for about one hour and left. Next time I'd rather take my son to the ball pit at McDonald's playhouse before I come back to Chuck E Cheese. \n\nOverall: Never again!", "author": "Chantel H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-07", "description": "This place is awesome, a restaurant and redemption arcade in one-- games, prizes and pizza. I don't even mind that the pizza is middling or that you need about 7000 prize tickets for a tiny nickel piece of candy. But I do kinda mind getting charged $1.99 per cup of tap water. Plus tax.\n\nOn the positive side, they stamp kids and the parent who brings them in with matching invisible ink codes. This helps me resist the temptation to abduct my children from their mother during my court-appointed visitation hour.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "My kids love going to Chuck E. Cheese's.  It's low cost entertainment.  A handful of tokens, pizza deals and a massive jungle gym.  Sadly to say, today we had an excursion and the entire jungle gym was gone.  No one seemed too chatty to explain why, but it does seem that it is permanently gone.  This is the only Chuck E. Cheese we've ever visited, so not sure if all of them normally have jungle gyms.  It's a big deal that it's gone.  Why remove such a popular item?  \n\nKids still had fun today.  Got a whole bunch of tickets.  We've waited for 35 minutes once for a pizza, but we only ordered that one time.  Not sure if it's normally that slow.  Weekdays mornings and afternoons are the best.  No crowds.", "author": "InnLing A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Chuck E. Cheese’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave\nAtlantic Center Mall", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jfxzNdSwQZbO8japbGoEFA/ls.jpg", "@type": "Restaurant", "telephone": "+17187834570"}