{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-12", "description": "Very nice spot on a very hip street full of a plethora of restaurants to choose from.  The food was delicious, the dessert stood out for me the most. We had the green tea icecream (I think that's the  name). Staff were friendly and prices were affordable.", "author": "Teresa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-09", "description": "It is a good budget sushi place.  The fish is always fresh and good, everything is always very clean, and the service is good.  I've been here a dozen times or so over three years and have always been content if not entirely impressed with the choice.\n\nThat being said, the portions are a bit small, and the selection of fish tends towards the cheaper ones -- for example, the sushi platter comes with omelette, squid, fluke, and octopus -- all the cheaper types of sushi.  The chirashi is just three pieces each of tuna and salmon plus two pieces of sliced Japanese omelette.\n\nKeeping in mind that having lived in Japan for three years hasmade me a bit of a snob about Japanese food, this place should still make 90% of people who might order from here very happy.  If you want higher end stuff, though, go across the street to Ki.  If you want cheaper (and not as good) there is Mitoushi on Atlantic.  If you want better sushi for this price range, Migita on Montague is better.\n\nThere is open air seating in the back which is nice on a nice day.  No decor at all though.", "author": "Frank L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-17", "description": "I can't say anything about their sushi or the service or the atmosphere of this place.  I can say that I ordered delivery tonight and i wasn't too impressed.  The edamame ($4), though an impressive generous portion, needed to be cooked more and salted more.  The shu mai ($4.50) were overcooked and underwhelming.  And the chicken teriyaki ($13) and the accompanying salad was watery and bland.  Probably won't order from here again.", "author": "Jonathan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "I am so in love with this place. This by far is one of the best Sushi places I have ever tasted. The place is in a very convenient location in downtown Brooklyn. The customer service is spectacular and the food is delicious. My favorite rolls to order is the spicy shrimp roll and the Fantastic Roll. I am a shrimp lover so if you want to get great sushi to eat choose these rolls. My best friend and I fell in love with this spot two years ago and have been dining here ever since. The prices are reasonable and everyone is extremely nice.", "author": "Krystal W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-06", "description": "The best way to eat dinner here is to choose a couple of things from the specials list and then ask the waitress to bring you some items of the chefs choosing. All the sushi and sashimi plates are prepared so carefully and masterfully. They really take the time to make the plate look beautiful, and the fish is always fresh. The cooked plates are really good too. Great gyoza. If they have the tuna dunmplings, absolutely get them. It's thinly sliced tuna wrapped around a crab and apple filling. Amazing!", "author": "Heather M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-12", "description": "Great spot! They filled my take-out order in under 10 minutes. Sushi rolls were stuffed to the brim, and prices were reasonable. The dragon and spicy tuna rolls were delicious, and they serve their sushi with a little side of pineapple chunks, which made for a sweet way to end the meal!", "author": "Diana P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "Take out  is great. Everything is really fresh, including the avocado. I had the spicy salmon, salmon skin, eel and avocado, and peanut avocado rolls. Brown rice can be swapped for white rice, which is great. Miso soup is tasty and not too salty.", "author": "Roberto A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-07", "description": "Kyoto is my go-to spot for sushi. Sure; it's not the absolute best I've ever had, but the prices aren't Blue Ribbon steep either. The fish is solid, consistently good, and for an easy dinner in the 'hood, I'd recommend it without hesitation.\n\nOne thing that Kyoto HAS mastered is its customer service. Even if the waitress screws up your order (likely), she'll be so apologetic and smiley-sweet that you'll feel like an ass for asking her to correct it. Or, order delivery, and you'll be treated like a queen (or king, if you swing that way). \n\nI've had very good veggie shu mai here, but I can't speak to any of the other cooked dishes. Kyoto does serve almost everything with darling little carrot flowers, which are difficult to explain but are incredibly endearing. They also always include a free bowl of chopped pineapple with delivery orders.\n\nBottom line: These people are nice. The food is nice. It's not a destination restaurant, but, hey -- reliable local joints are nice, too.", "author": "Krissy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-01", "description": "I have wandered in here looking for food at odd hours of the day (3-4pm) and have always felt welcome.  I'll agree with the other reviewers that the service is absolutely friendly and impeccable and it's a pleasure to eat here.\n\nI don't know that the fish is the greatest and freshest that was ever fished from the sea, but one thing I do know is that the \"special rolls\" are really darn \"special,\" using all kinds of imaginative and unique ingredients like apple and mango, which add a tasty sweetness and interesting texture to the rolls.  Of course, you can also get your old reliables here as well.  And the tuna dumplings are to die for.\n\nOverall, a very solid neighborhood place.  As soon as any visiting friends say they are craving sushi, I bring them immediately here.", "author": "Anna O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-16", "description": "I love the special rolls here!  The romance roll is my favorite, with mango, avacado, and crab- it's unique and tasty.  The cooked food is pretty good, with a cheap and quick lunch special.  \nIt is not the atmosphere that Ki has, but it is very reasonable, and has a good quality of fish.  Great for the price.\nService is always friendly, and the owner is often there to supervise.  \nDelivery is quick and always accurate.  \nI'm a fan!", "author": "Christina O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "Our favorite place to order take out from. We order here almost weekly. Great rolls, always fresh. The spicy tuna is one of the best out there. Gyoza is great too. I've never eaten there, but pass by all the time. Delivery is fast and orders are always correct. What else can you ask for?", "author": "Kitty B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-06", "description": "We definitely go for the lunch special on a weekly basis. In my opinion, best sushi lunch value in the area! Any 2 rolls (from a large selection), salad, shumai and edamame for $8! Plus they take credit card which is fairly rare in this part of Brooklyn. Service is solid and they try to be very friendly. \n\nSushi isn't the best or freshest, but it assuredly satisfies your craving.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "cozy, friendly. great food.  treated myself when I had some downtime, and was glad I did. the spicy Chilean sea bass appetizer (special) was amazing.\n\nI came back when jury duty gave me an extended lunch.  Sweet lunch specials. I wish they had an appetizer menu specific for lunch, but the tuna dumpling was worth it.  Service just as friendly and efficient.  And wanting an appetizer in addition probably means i'm just being a tad greedy, anyway with all the food you get for $9.", "author": "rk t."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "The salmon and yellowtail sashimi were perfect - very fresh!   I ordered the Tuna Dumplings based on reviews here and they were excellent!! Thinly sliced raw tuna in the shape of a dumpling stuffed with lobster salad is a wonderful idea!  It even comes with a tasty mesclun salad with a mustardy dressing.  The avocado salad was good but a bit of a let down since it's over iceberg lettuce; however the ginger dressing was good.  Overall, this is a great neighborhood sushi bar with delicious fish at very reasonable prices.", "author": "Susie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-14", "description": "Kyoto to me is definitely one of the best sushi spots to go in Brooklyn! The food always tastes fresh and never have to wait! The only thing that bothered me is The B rating they got, but a lot of restaurants in that hood have B ratings!!!", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-14", "description": "This place was just ok.  We got 2 different rolls and a hand roll, and everything lacked something.  I'm not quite sure what it was, but everything lacked a little extra flavor I was looking for.  The waiters were nice, and attentive, but I don't think I would come back here again.", "author": "Mason S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-07", "description": "Kyoto use to be a decent sushi place. Over the past five years I've noticed the prices rise while the portions shrank and the quality drastically declined. I appreciated that they started to use the Internet to take orders. Maked life easier for me. That is until I noticed that the owners decided to charge inflated prices on food delivery sites. A sushi/sashimi combination on their in house and delivery menus is currently $23. If you order the same entrée through the Internet be prepared to pay $26. That's just one example. Almost every item's price is inflated online. I called Kyoto and confirmed that it wasn't a mistake. That was it for me. I've contacted the websites several times to inform them of the price issue. Even though it states that restaurants are contractually obligated to match their in house prices on their websites they've done nothing. Another case of NYers being nickeled and dimed to death. If you like Kyoto make sure to order over the phone to avoid being ripped off.", "author": "James S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-16", "description": "I was shocked by how amazing the food was here. The fish is very fresh and consistently delicious. And free sake to boot! Try the spicy tuna roll it will blow your mind!", "author": "Frederick V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-05", "description": "I can only speak to the lunch special.  Coming here for lunch does not make me feel guilty about leaving my pb\u0026j at home.  For $8 you can get your choice of soup or salad, 2 rolls, a small pile of edamame, and 2 shumai.  The salad (of the iceberg variety) has yummy dressing and is a decent size.  You also have about 10 different rolls from which to choose.  Service is incredibly prompt, so you barely have time to fumble with your phone to quell the self-consciousness of dining alone.  The only thing, if you are listening Kyoto is that the tops of the soy sauce bottles look really dusty. Otherwise, I have, and shall, return.", "author": "Ana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "Kyoto is perfect if you're looking for a solid sushi that won't break the bank. Delivery is always quick, and the guy who takes my take out order couldn't be nicer. The sushi is good, I've never had anything unsatisfying. Ki is better, but also much more expensive...", "author": "Danielle P."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Kyoto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "115 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/XgCNWOcuivDv-SsBz6gw9A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225888"}