{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-24", "description": "Nice place for lunch. Good prices, especially for Cobble Hill. I had a huge lunch for slightly more than $20.\n\nThe food was fresh and the chefs did a great job with the sushi. I had vegetarian rolls. The avocado was perfectly ripe. The rice was al dente, just as you want. \n\nI'd come back.", "author": "H. Stephen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "This is a nice little sushi place. I like their sashimi and simple rolls. The price is reasonable and service is very fast. Great location too!", "author": "Candice Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "I've never eaten in the restaurant but have ordered delivery multiple times and am always left satisfied.\n\nSometimes you just need a solid sushi fix, or some miso soup when the spring/summer weather is somehow 50 degrees. This place doesn't disappoint. My go-to favorites are just the salmon avocado roll and the crunchy spicy salmon roll. Nothing fancy, just the basics, but that's all I need. There are six pieces to each roll, and they're $6 each. Plus, free delivery through Yelp (and they're always there by the estimated delivery time or earlier).\n\nI definitely recommend this place and will have to give it a try in the restaurant sometime soon!", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-23", "description": "I got food delivered from here and there is so much that comes with the lunch box! I got the Chicken Katsu lunch box, which came with the chicken katsu and rice, miso soup, salad, shumai, 6 pieces of a California roll, and edamame! Oh my! And all that for $11!! I also decided to try the Age Tofu. I'm not sure I would order this again because the batter seemed as though it wasn't fully fried because it tasted floury. Everything else was good though. I would recommend this especially for the lunch special", "author": "Spurthi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Kyoto is legit. I don't know why I've never eaten there before, but I'm glad I finally did. It's one of the mainstays on a stretch of Smith Street that's slowly dying. It looked like they were getting a lot of delivery orders, so I'm glad they're staying afloat.\n\nTheir menu is less traditional than Ki down the street, but different isn't a bad thing! Plus, that allows you to order things like the tuna \"dumplings\", which is literally lobster salad and avocado wrapped in a thin slice of raw tuna shaped like a dumpling. Topped with some roe. Two large pieces and a little side salad in the middle. Holy crap, that was amazing. I want to eat that every day. And only $10!!!\n\nThey have an extensive sushi and sashimi menu (though they weren't serving some of the more exotic items I wanted to try). No matter. I ended up getting the red clam, baby yellowtail, and mackerel. All were fresh, but the red clam was probably my favorite. You get to choose whether you want it as sushi or sashimi, so that's nice (same price). Most are in the $2.50 to $5 range.\n\nI also ordered their namesake Kyoto roll, which was yellowtail, white tuna, topped with eel, smoked salmon avocado, and roe. So good. I'm a sucker for eel sauce. They also do 8 pieces rather than 6 for their special rolls, so that was a nice surprise!\n\nAll in all, a pretty good sushi experience, and I'll definitely be ordering delivery from them more often.\n\nOh, and they have some pretty good lunch special deals!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "My go-to! I always get the samurai roll and miso soup and it's always reliable. I order from them once a week with my husband and we've never had a bad or late order. I do wish they had more app options.", "author": "Sulekha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "This is my go to, no-brainer, sushi spot for me in the neighborhood. I'm def a regular and haven't found anything that beats the balance between their consistent price, quality, and service. It's the perfect go to spot for your week day sushi fix or a delicious  inexpensive dinner. Their quality of food is consistent and never disappoints wether you eat in or order delivery. A few of my favorites are the Kyoto roll, princess roll, rock shrimp appetizer, Katie dinner special, sushi and sashimi platter, or even their fried rice - all these are 5/5 for me. Yes it's not a fancy spot, but it's still cute, intimate and most importantly the prices are great while serving  good fresh food!!", "author": "Zareda N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-02", "description": "4pm on a Monday proves to be a quiet experience by 4:30 I was the only one in the house.\nMaybe that was to my favor in regards to the food.\n2 rolls and a beer put me back $22 bucks before tip.\nDespite the really quick service, the food was delicious and presentation was on point. Definitely give it another try. Cheers!", "author": "Phil W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Every time we've eaten there, the food has been good. We love ordering their sliced seared tuna which has a smokey flavor and some type of chili oil? Amazing. Also like the black pepper tuna, as well as the tuna dumplings which are stuffed with creamy lobster filling, great textures. While the cold appetizers are our favorite part, the sushi is also solid. Everything tastes fresh!!", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-23", "description": "Delicious food and reasonably priced. Portions are great. Went on a Tuesday night after the gym. Unassuming and comfortable. We'll be back. I'd recommend the sweet potato rolls.", "author": "Craig B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-28", "description": "I feel iffy about rating a restaurant with otherwise solid food based on quality of delivery, but I have to say that their Asian delivery man was remarkably rude. \n\nI gave a decent tip, not great, but when I arrived at the door to pick up the food and thanked him, the guy ROLLED HIS EYES and stormed off. It's an optional tip (and it wasn't an awful tip, 10% or so), not part of my bill. If there's a minimum amount required to avoid attitude, please indicate it on the order page.\n\nIt's a shame that a meal can be ruined by such a minor part of the experience, and I'm sadly going to have to think twice about dealing with this guy's attitude for future orders. Petty and oversensitive? Maybe, but I don't feel like dealing with it when there's 5 other adequate sushi places around.", "author": "A H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "I ordered for pickup. Everything I ordered was so good!! I ordered shrimp tempura, sweet potato rolls and pan fried vegetable dumplings, everything was delicious! Portion sizes are great compared to other places I've been! Defiantly coming again", "author": "Donna D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "I found this place thanks to my handy dandy Yelp app. Wanted Japanese food for lunch, but something different. They have a few of the standard bento boxes as lunch specials but one caught my eye... the mango teriyaki box (with chicken or shrimp). So I locked my computer and went for a long stroll.\n\nThe hostess was very friendly and recommended the shrimp over chicken. I took her advice and placed the order to go. As I waited, I glanced at the various dishes being consumed by the customers. Everything looked delicious, with large portions and beautiful plating. The restaurant is fairly small but cozy and welcoming. \n\nAfter a few minutes my order was ready and back to work I went. \n\nThe lunch box had pretty large, plump portions and everything was delicious!\n\nThe California rolls were large with well balanced proportions. The gyoza was perfectly bite sized and full of flavor. The salad was fresh and crisp. The soup was good and had little noodles in it, a nice change. And the edamame was a great addition and perfectly steamed. \n\nThe best part was the shrimp. Large, meaty shrimp in a teriyaki sauce that had a subtle spicy kick, but also a mildly sweet flavor. The veggies and mango were julienne so they offered a perfect balance with each bite.\n\nI will definitely go back but next time I'll dine in.", "author": "Kiki K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-18", "description": "Ummm have they lost their damn minds? I used to order from this place until i just went to order and they raised their prices $2 per roll! Their rolls were already crazy expensive and now they want $7 for a regular tuna roll and $17 for some special roll? Theres a place in the city that i go to with top notch sushi and their prices are lower! I legit turned around and ordered from an Indian place instead and im not here for this bs. Kyoto you are greedy and not that good get yourselves in line and lower those damn prices.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-01", "description": "Came here with my girlfriend for some dinner before our movie at UA Court Street. Very friendly, attentive and professional staff. Not to mention very tasty sushi. I'd recommend the Princess roll. Lol I know, I know. But It's got a good crunch, fish, eel (and that tasty eel sauce) and avacado. Just the right combo.", "author": "Arcadio M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-21", "description": "Good price, but you get what you pay for.\nThat, and the crunchy tempura bits in our special roll were stale.\nToo many better options to return here.", "author": "Matthew D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "Came here for dinner many times. It's in a great location on Smith Street close to Bergen Street (F,G) and Jay Street Metro Tech stations. Food is solid. We usually order a bento box and some rolls. Staff is really friendly and service is fast.", "author": "Mikaela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Came here for the first time for take-out... It was grrrreat. I wasn't really sure what u wabted. The Hostess gave me some suggestions and was really helpful. My favorite was the scallop sushi. It was super sweet. I will be ordering from here again!", "author": "Candace M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "I'm pretty impressed by this Chinese owned Japanese sushi place, we originally wanted to go to Ki sushi but were told it'd be an hour wait \u0026 wAndered into here. \n\nKyoto is a small space but warm and inviting, sushi bar had 3 hard at work sushi chefs that night and 2 frantic waiters running around, the place was pretty packed but luckily we got seated within minutes.\n\nWe ordered 5 regular rolls, tuna, salmon, Philadelphia, yellowtail and scallion , salmon avocado \u0026 a \"special roll\" recommended by our server the princess roll, along with a bottle of plum wine.\n\nThe rolls were great, fish was fresh, rice consistency was just right but we agreed the princess roll was too overbearing, my friend commented that these \"special rolls\" were probably for people who don't enjoy regular sushi. \n\nGreat prices, nice servers, fresh sushi. I am a fan", "author": "Sophie H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-12", "description": "I work in the area and place orders over the phone for lunch at least once a week. I've never had an issue ordering for delivery however, I did have a horrible experience dining in. \nThe other night my girlfriend and I decided to come here for sushi and desert. We were gestured to sit at a booth however no one greeted us. Once a waitress came she asked us what we wanted. I politely responded \"May we have two menus\" as no one had even bought menus over. \nAfter our sushi was bought over, about ten minutes into dining the waitress bought our check over. It was not crowded, we were not being loud or obnoxious, and neither of us had finished our food. \nI instantly felt guilty thinking that the restaurant was about to close so I looked up the closing time on my phone to check. The restaurant closes at 10pm. It was 8pm. When the waitress came back I told her we'd like to order desert. She simply responded oh, and crumbed the receipt. When she came out with our desert, again she bought the check with her. At this point I felt unwelcome and just paid. Throughout our dining experience no one checked on us or refilled our water and again I had to ask for menus. After paying on my card and leaving a cash tip the waitress comes back and says \"this tip is not enough, you have to pay 20%\". There was no mention of a 20% tip on the receipt, and I didn't make a fuss, I just did the calculations and gave them the 3 extra dollars that came up to 20% and left. No one said goodbye or come again. \nI felt really low walking out knowing that I was unwelcome. I noticed that no one else in Kyoto was being treated that way but, I also noticed that no one else in the establishment looked like me. \nThat being said I will no longer order Kyoto, nor will I dine in. Hopefully management reads these reviews and they make changes towards being more welcomingand inclusive to ALL of their customers including POC and LGBTQ folk.", "author": "Kenyana C."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Kyoto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "115 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/XgCNWOcuivDv-SsBz6gw9A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225888"}