{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-23", "description": "I ordered the Anago Tempura, Ichiban Roll and Unagi Don. The Anago Tempura tasted delicious but totally forgot it had fish in it since the taste of the cream cheese and asparagus overpowered the anago. The Ichiban Roll was good, but not my cup of tea. I usually order the rolls with raw fish, not sure what got me to order a roll that was fried like tempura. The fish was cooked on the outer edge and raw in the middle, so it felt kind of weird. But the taste was good. The Unagi Don was great and had many pieces of unagi.\n\nI also had the green tea tempura ice cream and it was great. One of the better ones that I've tried. It was just the right size for 2 people to share.\n\nThis is a place that I would come again if I'm ever in the neighborhood, but would not purposefully take the train for.", "author": "Wendy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "This place is awesome. We always order for delivery, and they are on point with their service and the fish is always fresh. I highly recommend this place for take out.", "author": "Chico N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "This review is for delivery only.  I ordered a Phoenix roll and a green salad, giving special instructions not to include tempura flakes on my roll.  As soon as I placed my order, I received an email saying my food would arrive in 45-60 minutes.  I was surprised when my food arrived within a half hour, and with no tempura flakes!  I'll definitely order from here again, and hopefully eat at the restaurant soon.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-11", "description": "Ok, I really like the sushi and the prices here.  I would definitely come back.  I cam with a friend who had been before.  \n\nWe shared a bunch of rolls: ladybug, paradise, and one more i can't remember.\n\nIt was good.  I would have to come back again to see if it was great.  I was very hungry at the time and had a few drinks before lunch.", "author": "Ji-eun L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "Discovered these guys on seamless, and glad I did.  Smith St. tends to overload you with choices, and this small shop might be easily overlooked with the much brighter signs nearby.\n\nBe it dine-in or delivery, the food is always great.  Delivery is not quick, but they also don't claim to be.  They are accurate when they estimate about an hour.  Food always arrives hot (when applicable) and is always tasty.\n\nThey have good selection, fresh ingredients, and the prices are spot on...   It's not discount sushi, but then again.. do you really want discount sushi?", "author": "Jiimy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "This review is for the lunch special only.  It is a SUPERB bang for your buck.\n\nThe special includes soup or salad, choice of two rolls, shumai, a generous portion of edamame and hot tea - for $8.  I arrived starving and left stuffed.\n\nThe decor is nothing fancy but clean, the food is not suuuuper outstanding but good and the staff is friendly. \n\nWhat more could you ask for? Kyoto hits the spot.  \n\nLexyloo~", "author": "Alexis H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-13", "description": "Simple decor. Nothing fancy. Waitress was friendly and attentive. The lunch menu is quite a bargain. My lunch meal consisted of salad, 2 rolls and edamame for $8. I had a craving for sushi and I wasn't disappointed. The rolls had more substance than rice (a plus in my book). The white tuna and spicy tuna was fresh enough.\n\nThis is the place if you need a sushi fix. Sushi that tastes good at a reasonable price.", "author": "Elaine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "Five big YAY's from me. We went in there after Wild Ginger across the street wouldn't seat us, even though it was 10:28 and they stop seating at 10:30 (love that place, but the no-seating-after-10:30 policy is bizarre and irritating).\n\nAnyway, Kyoto turned out to be a wonderful discovery. How does a vegan get fed at a sushi place, you may ask? It's all about the veggie rolls. And the ones here, are perfect. Fresh, juicy, and there's ELEVEN choices. That's the most I've seen on any sushi menu for veggie rolls. Every single one I've tried -- the cuke'n avocado, veggie, peanut, shitake -- have all been divine. \n\nThe staff is sweet. The place is very basic, but it's cozy. Also, very fast delivery and take-out.", "author": "Asya G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-18", "description": "If happiness is a good neighborhood sushi bar, love is an exceptional neighborhood sushi bar.\n\nNow, it took me a while to get here, since there are a ton of Japanese restaurants in the area, and the decor doesn't give it away, but Kyoto is THE best thing going and the same price as everywhere else.\n\n1) Get the tuna dumplings- these babies are lobster salad wrapped in thin slices of raw tuna- decadent, delicious and downright delectable.\n\n2) Get a special roll- I try a different one every time and have yet to find one I don't love.\n\n3) Delivery is great but eat there sometime- they put a real effort into plating and you really feel how special this sushi place is compared to the 50 others in a 5-mile radius. Also, they have a great back patio.\n\nOh and please don't tell anyone- I hate waiting at my neighborhood spots...cough cough Frankie's.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-02", "description": "My order took one hour to come. But I wish it wouldn't have come at all seeing as it's given me the worst food poisoning of my life. Literally 12 hours of projectile vomiting. When I called to ask the manager whether anyone else had reported getting sick he suggested that perhaps I just overate (\"you ordered 3 rolls and udon all for you, a girl?\"). Awesome.", "author": "Maya G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-11", "description": "Haven't tried their lunch special but came here for dinner. Excellent fast service. The waiters are very friendly and check to see if you need anything. The food was fresh. I have to say their Appetizer selection is pretty unique. I had the Aged Tofu and Wasabi pork shumai for the first time. They were not stingy with the portions. My main was the Mermaid Roll which was incredible. For a standard price you will get great quality food and big portions.", "author": "Tara R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "This sushi place is a real treasure in Brooklyn! Special rolls are huuuuge and delicious, everytime I go there I try something new! Obviously sushi chefs knows what they are doing!And baked cheese cake- once you try that you will forget all other cheesecakes you've had before!", "author": "Jen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-25", "description": "This is my Friday night delivery food spot.  I actually look forward to Friday nights spent at home because their food is great, and delivery is super fast.  I can only speak to the rolls though, as Ive never ordered anything else. My absolute favorites are the the Meteor Roll (sliced apples inside) and the peanut avocado roll.  The rolls are light on the rice and heavy on the good stuff inside.  \n\nI stress that it is a fabulous delivery spot.  Not worth a trip there in person.  It's clean and friendly, but the decor is just not good for a date spot.  Think loud piped in Muzak (we heard three Neil Diamond songs, one Barbara Streisand, and Mariah Carey), bright lights, and more of a pizza parlor feel.  No sexy lighting or minamalist decor here.  Unfortunately, when going out for Sushi, we go elsewhere.", "author": "Angel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "Great reasonably priced lunch specials of either bento boxes or two sushi rolls.   The lunch includes soup and salad.  A typical bento box is chicken or salmon teriyaki with rice, a California roll , two small dumplings and a small ear of corn .  You can also get shrimp tempura or chicken Katsu (a fried chicken cutlet ) with the bento box lunch.  In the warm weather there is a nice backyard patio.   Or you can sit at the sushi bar.   The staff gets the usual courthouse crowd back to work on time .", "author": "Dawn D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-21", "description": "Went last week and got the lunch special it was gross the spicy tuna rolls where all spicy mayo and mushy and warm. I will not be returning", "author": "Dave R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "I often get delivery from here and it's usually wonderful. It's not super fancy and it's not always perfect, but it's my favorite quality-for-price sushi bar. They might not air ship from Tokyo's Tsukiji market (like Ki across the street claims to), but their fish is fresh and tasty. Yum.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "Great little spot with daily lunch specials I couldn't say no to. Fresh, tasty, well priced with great service. Cozy and comfortable. A great choice since Ki across the street is usually so busy. Makes this a hidden gem in plain view. Go here.", "author": "Sean R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-05", "description": "It was okay.\n\nThe service was very good.\n\nI tasted the edamame, haru maki, gyoza, miso soup, empire roll, California roll, mango salad, and katsu. \n\nThe California roll was whatever. The empire roll (king crab, spicy tuna, avocado, and mango) was edible. I ate half of each roll and was unimpressed.\n\nI am admittedly not a big sushi guy, so if you are, go to another review.  \n\nI'm just submitting this one to add to my Yelp resume.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-16", "description": "their delivery is unreliable, i called after waiting a very long time for delivery and after keeping me on hold for a while he came to say that they will leave shortly, which obviously meant they never even filled my order, i would not order for delivery from them.", "author": "m m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "I've only had the teriyaki salmon lunch box here because there is NO GREATER VALUE IN BROOKLYN! For $10 you get a nice chunk of salmon with onions and zucchini, rice, edamame, salad, gyoza (which I sub for veggie dumplings), a California roll and pineapple. Even getting a slice of pizza for lunch seems like a rip off after Kyoto's lunch special. The salmon is always done perfectly and my food is ready in 10-15 minutes. Love this place!", "author": "Tanja S."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Kyoto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "115 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/XgCNWOcuivDv-SsBz6gw9A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225888"}