{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-18", "description": "Consistently Good Sushi.  I've been ordering from them for 3 years now and keep coming back.  I'd give this 4.5 rather than 5 because they don't have some things I really like such as uzu zukuri, but that's pretty minor.\n\nI'm a big fan of the Sunny Roll, and the Tuna Tortilla thing.   I have yet to have a mediocre to bad experience.   Their delivery is blazingly quick as well.\n\nThere are probably better and fancier places, but Kyoto is very, very good and fresh, extremely consistently.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-23", "description": "Ordered a lunch special here with chicken for delivery.  This was a GREAT deal for $10, got plenty of food for my rumbly tummy and all of it was delicious!  Highly recommend and will definitely order from again.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "Great choice for lunch on Smith Street. Good lunch specials - two rolls, edamame, shumai, and miso soup for $9, or a variety of bento/teriyaki bowls for $10. Good service. Not great for groups - it's a smaller place. They have delivery and takeout.", "author": "Claire M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-16", "description": "Had to stop for dinner on our way home to Philly from Brooklyn and decided we had a craving for sushi. First place that popped up on google was  Ki Sushi. We go in..super trendy...45 minute wait. So we walk out and see the huge sign on the store front of KYOTO right across the street. Best decision I've ever made. Simple interior but fresh fish and a nice variety of rolls. We wanted sushi, not a trendy scene so this fulfilled our goal 100%.", "author": "Anna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-14", "description": "Fabulous Sushi!! My sister and I got take out from here a few weeks ago and EVERYTHING was delicious! Spicy Tuna roll is fantastic and delightfully tangy. The Fantastic roll is incredibly tasty with a great variety of seafood and vegetables. They also have shitake mushroom rolls, which are very hard to find. Excellent flavors and textures! The staff was very friendly and they were quick to have our order ready. The interior is beautiful with fabulous ambiance. Prices are reasonable and portions are generous. Try the shitake roll and the Fantastic roll!", "author": "Natalie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "I've been here many times, and I've never once been disappointed. The only time I've eaten something I didn't like there was when I tasted one of their crab dishes (but I can't stand the taste of crab anyway, so it's not their fault). Their rolls (not bread rolls, maki rolls) are to die for. My favorites are:\nAlaska Roll (raw salmon, cucumber, and avocado)\nSpicy Tuna Roll (mashed and seasoned tuna)\nSpicy Salmon Roll (mashed and seasoned salmon. They'll ask if you want it crunchy or not crunchy. I choose crunchy)\nPeanut Avocado Roll (slightly sweetened roasted peanuts and avocado)\nThe atmosphere isn't anything special, but it's nice. Everything is sparkling clean, and on hot days the A/C saves the day (it's an especially powerful A/C, more than standard central A/C systems. Little things count, too). The service is wonderful. Once we went for my brother's birthday, and the waitress apparently heard me say \"Happy birthday!\", so we were all surprised when he was presented with complimentary ice cream. I think that says something about the service. The food is prepared quickly, too. Four plates of at least three rolls are prepared in 10-15 minutes by only two sushi chefs. Overall, the entire restaurant is wonderful. I highly recommend that you go.", "author": "Samuel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-15", "description": "DELICIOUS! I have been ordering dinner here a few times a week and it is consistently delicious and service is quick. \nTry the spicy tuna (boring I know) and the \"Fantastic Roll\"", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "I love this place - I can walk in here on a saturday night - sit right down and the sushi is always really good.\n\nBest kept secret on Smith. The only reason I am telling you all about it is I think they deserve more biz - though I think they kill it with the take out.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-29", "description": "I love this place.  Their rolls are super affordable and very tasty.  I would say there is never a long line to get in.  I have been there late like 11 pm, and they are still open.  It has dim lighting so for all those photographers addicts, this is something to consider, being an intimate dark atmosphere of closeness.  I've been here for lunch, \u0026 they have a really affordable special, and my favorite is their chirashi and their rainbow roll.  It is nice decor and also really wonderful service.  It is a bit loud so be prepared for the top 40 music.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "It's regular sushi, priced right for lunch. Maybe the rice is not vinegar filled enough? I had salmon avocado and shrimp asparagus. The former was good, the matter was fresh but the asparagus was too powerful. Miso soup was great. Got and flavor filled. Shumai and edamame come with the lunch special and both were great. Service was fast and sweet.", "author": "Yael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-27", "description": "Four words: Eight dollar lunch special. \n\nThis includes two yummy rolls \u0026 salad or soup, shumai and edamame. They also throw in pinapple for dessert. \n\nI wouldn't say it is hands-down the best sushi I have had in Brooklyn - for that, I'd go over to either Koto (no Y in their name) or Hibino- both on Henry St. - but, in a pinch, Kyoto does me right!\n\nService wise - the delivery is quick and their staff is quite friendly. Once, after finishing lunch at the restaurant,  I realized that I'd left my wallet at home. I felt like a total idiot, until I explained the situation to the server who put me at ease. Naturally, I came back and settled up. Just the fact that there were no sour looks or attitudes about the whole debacle really says a lot about their service.", "author": "Joanna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-12", "description": "Not bad and decently priced, but wouldn't say it is a place that I would go back to all that often for lunch. It had a basic menu and a sushi lunch special which included a soup or salad, edamame, 2 pieces of shumai and two rolls (I chose the Philadelphia and the Spicy Crunchy Kani rolls). The shumai and the edamame were a nice touch since you don't often see that on sushi lunch specials. The rolls were just okay. The Philadelphia roll was a bit too light on the cream cheese and also included asparagus. Personally I am not a big fan of asparagus in my sushi rolls, but it did add a nice crunch. The spicy crunchy kani roll was less mayo based and more hot sauce based, so I wasn't as thrilled by it. Overall though, service was very quick so it is a good spot if you are short on time and want some decent sushi and extras to fill you up at lunch!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-07", "description": "Went here for lunch with my buddy on a snowy tuesday. I hadn't been here in about a year and they have definitely gotten way better. It doesn't smell like they just cleaned everything with cheap disinfectant and they no longer play hi energy bathouse  music - but most importantly the food has gotten way better.   Lunch special comes with miso soup that tasted freshly made and thank god not over boiled and dead.  The salad is a decent little salad with a standard \" orange \" colored dressing that was little sweet and mayonaisey for me.  The Lunch box had some shumai- ok   salmon teriyaki - smallish but cooked well and the sauce was flavorful and not too sweet or heavy. The shrimp tempura roll ( I subsitituted from the included california for an extra 2 bucks ) was  spot on . Crunchy hot cooked to order shrimp tempura with ripe fatty avocado and made better by the fresh jalapeno they sent with it.\n             The only miss was they forgot that I had ordered brown rice and i guess that takes an extra ten minutes to steam so i had wolfed through a good part of my meal by the time it came. And I have no idea what to do with the one inch stub of corn on the cob that is n the plate is for.\nBut the whole shebang for 12 bucks - decent service and plenty of hot green tea... would def go back anytime and sure i will.", "author": "Bite M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-07", "description": "This used to be our go-to sushi place for delivery. Unfortunately after countless orders, we will no longer be eating or ordering from Kyoto again. We ordered at 6:45pm on a Saturday night and I called at 8pm to see where our food was. The guy on the phone was SO INCREDIBLY RUDE. He rushed me off the phone saying \"we working on it\" and then simply hung up on me. I immediately called back and he said he didn't know when the food would be ready and that we could cancel our order. We had already been waiting an hour and 15 minutes and I wasn't in the mood to order somewhere else so I said we would wait. He said \"ok you cancel\" and immediately hung up on me again. No apologies, no explanation, just hung up the phone. I said I was going to wait and he heard \"cancel,\" but at that point I was too annoyed to call back. With so many other sushi spots in the neighborhood, I will take my business elsewhere.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-12", "description": "After getting very frustrated with the long wait for delivery at Ki, I made the switch to Kyoto Sushi.  It's always fresh and delivered quickly.  I love that their two roll lunch special comes with edamame, shumai, salad and some pineapples (for dessert).", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "After trying Ki Sushi recently and absolutely loving it, I decided to check out the less hyped and more nondescript Kyoto Sushi practically right across the street. The menus are pretty similar, though prices here are a bit lower and portions larger. \n\nThey offer a phenomenal dinner combination special for $16, which includes entree choices spanning from teriyaki chicken/salmon/shrimp, to thai style shrimp and mango, to shrimp \u0026 veg tempura, and sushi and sashimi. I was absolutely amazed that the sashimi option comes with 12 pieces of fish. Wow, that alone would cost more than $16 in every restaurant in the city. Damn, Brooklyn, I see you. The bf ended up ordering the shrimp and vegetable tempura dinner combo, which was served in a generous portion of 4 jumbo shrimps and about 5-6 pieces of veggies. The dinner set also came with edamame, fried shui mai, haru maki (spring rolls), a california roll, steamed rice, soup AND salad. I was glad to steal several bites from his plate as he was actually unable to put it all away. Being the princess that I am, I naturally ordered the Princess Roll off their special rolls menu. It was a very flavorful roll made with spicy crunch tuna with unagi, salmon, tuna and avocado on top drizzled with unagi sauce. I was glad this roll wasn't too big in circumference, making each piece relatively easy to eat in 1-2 bites. \n\nI was pretty surprised to see how empty the dining room was on a Saturday evening, especially since Ki next door is always packed. I did notice a lot of people phoning in delivery orders and coming through the door for takeout, so I guess that comprises the majority of their business.", "author": "Cecilia Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-26", "description": "Was disappointed by this place. First of all, it has a \"B\" rating which I usually stay away from, but my friend recommended it.\n\nThe lunch special was good enough and definitely cheap, but my second order was done sloppy and fell apart.\n\nThere are many other sushi places on this street with better ambiance and quality food.", "author": "C J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "Ordered for delivery. The fried tofu was yummy and so was the chicken fried rice (loved it). Very fast delivery. Also noticed the lunch special deals which are very great. Would definitely come again!", "author": "Siv L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "I really like this place, and will go pretty far out of my way to pick up sushi on my way home.\n\nI've gotten into a bit of a rut- the tuna avocado roll and the angel roll are my standards.  I sometimes feel like the guy answering the phone knows it's me because of that order.  And I'm by no means a neighborhood regular!\n\nIt's missing a star because it can be a little inconsistent.  Sometimes it's just good, not great.", "author": "Heather Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "This place is mine and my bf's Sunday Night Sushi Staple (sometimes Thursday nights too). This place has amazing service and the sushi is always fresh. We switch it up with the special rolls but always include the spicy combo in our orders. Can't go wrong here!", "author": "T. K."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Kyoto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "115 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/XgCNWOcuivDv-SsBz6gw9A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225888"}