{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "I went here over the weekend with my mom who was visiting me for the week. I wasn't in the mood for anything when we decided on sushi. According to my handy dandy yelp app kyoto was the closest sushi place with a higher rating, so we decided to check it out. \n\nThey didn't disappoint, not only were they super close the G train, which I needed to go home, but the sushi was super yummy. I ordered an eel avocado roll (my favorite always), spicy crabmeat and the salmon mango roll. They all were substantially better than the other sushi places that I have recently frequented and I was super full from the three rolls I ordered, normally I'm kind of full. So not only were the rolls packed full of flavor, but they also were way more filling than most sushi rolls. My mom ordered almost the same thing as me, but instead of the eel avocado she got the dragon roll. She felt the same way I did about this spot, she loved it. Her favorite was the spicy crabmeat roll. \n\nThe only thing I wish this place did differently was that they had a pick your own sushi roll special, we just ended up ordering the rolls we wanted individually.", "author": "Rosemarie H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-16", "description": "Rudest service ever. Will not eat or order from here again . \nWe have been in person, but a few days ago ordered  delivery. After 2 hours waiting for 3 simple rolls, we called and were hung up on once, told by some guy he had no idea when our food would be ready and they are working on it.  No apologies no nothing.  He sad I could not cancel as I ordered through delivery.com and I had to call them. Of course delivery told me the Opposite.   So bad Communication and Customer Service.   Our order never arrived so I guess somebody got the message.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "I really like this place. I went there everytime when I visiting New York( from Boston). The fish is fresh and the price is reasonable! The staff there are nice and friendly!   I definely recommend this place for Sushi lover.  Following are my favorite dishes-   Miso salmon,  sealed black tuna and tuna dumpling!", "author": "Huan Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "Tried this location for the first time ...take out for lunch. The mango shrimp (box) was great!!!! Tasty, large portion, presentation exceptional. Next visit I will be sitting in..", "author": "Judith M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-04", "description": "Came here because Ki across the street was full and had a long wait.  While it was very cheap, it was just okay.  Think I'd rather wait for Ki next time.", "author": "Ajay R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "When I lived in the neighborhood, this place opened up. It was a welcomed addition to upper Smith Street. It won't blow your mind (go to Ki Sushi across the street for that), but it won't break the bank either! consistently good sushi at the going rate. Best value:  the $9 lunch special (2 rolls, a handful of edamame, soup or salad, and shumai). It was a lot of food that hit the spot.", "author": "C S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-29", "description": "I tend to avoid Japanese restaurants that are not Japanese run, as I notice many on Yelp do the same.  I was drawn in by the number of customers and lunch special. On a snowy Saturday, seeing folks in a Japanese restaurant normally implies quality.  \n\n$12 Sushi lunch...Nice salad to start with creamy dressing.  Miso was better than servicable.  Sushi was quite good.  Big fresh fish- good sushi.", "author": "Franny A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-31", "description": "My boyfriend dragged me here because Ki Sushi was too crowded and he wanted me to be more \"open minded\" (I wonder what he really meant with that comment.......)\n\nThe sushi here is really buffet grade with friendly staff (a little overly attentive) and price.  We ordered 3 rolls and a sashimi platter, and all were ok. \n\nThe decor is....sigh....not the chicest.  They were also blasting 90's R\u0026B music when we were there, which I found super amusing in a sushi joint. \n\nIf you want good sushi, go to Ki Sushi.  If you can't get a table there and would like to be \"open minded\", you can come here.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "Ordered the salmon avocado roll and shrimp tempora, very delicious!!! And the prices are reasonable!", "author": "Takia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "Affordable lunch special that comes with miso soup, california rolls, edamame, salad and depending on what oyu order corn, shrimp shumae, etc.", "author": "Chrissy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-24", "description": "We went for lunch and it was fine. The food was average sushi at reasonable prices. My biggest complaint would be that the lunch menu was very restrictive. There was only one sushi option and it was only five pieces- not much if you are very hungry. However, at $10 it is very affordable.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-19", "description": "Ughhhhh. My friend and I ordered sushi for two, while I got a side of spicy tuna and one uni. Both were a mistake. The spicy tuna had scales in it and I was picking them out of my mouth during the meal. The $5 single uni was worse, because there were shell fragments in it that gave way to a grainy texture, similar to egg shells in a soft omelette. But harder. Ruined the whole sushi. I paid money for this, you'd think they would prepare it properly. The desert was also measly six little cubes of pineapple. Our tab came up to $50. Never coming back here. Osaka is pricier but at least they know what they're doing.", "author": "Luca M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "I absolutely love being able to get anything delivered in New York.\n\nEveryone raves about the tuna dumplings, so naturally I had to have them - they do not disappoint. Lobster salad encased in thinly sliced tuna; heaven. A revelatIon, if you will. I also ordered a spicy salmon roll and one of the special rolls, a tuna crunch with salmon and eel on the top. Fish was very fresh and tasty and delivery fast, even on the weekend.  The portions were a tad small, even by sushi standards, I probably could have eaten a little more to feel really full.\n\nWill definitely order again next time I'm in Brooklyn!", "author": "Josie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "Worst service (delivery).  They never delivered. After 2 hours we called to check on the order and they accused that we were calling the wrong restaurant and hang up the phone. Horrible customer service.", "author": "Yukes O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-26", "description": "Great sushi restaurant. I'd say the quality of the fish here is one of the best in the area and the prices reflect it. The decor and service are forgettable so it's easy to skip this place and head to any of the other dozen Japanese restaurants down the street, but it's definitely worth a try. Try to order something besides the usual salmon and tuna rolls when you're here. Last time I had some kind of tuna tar tar pizza and it was delicious.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "Affordable price with quality food! The tuna there is so fresh and delicious! I'll definitely come back for sashimi  :D", "author": "Vicky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "This place is Awesome.  The first time I ordered the Phoenix Roll. Yesterday, I had the Rock Shrimp as an appetizers, The Eel Avocado and the Spicy Maki Combo. Best Meal ever", "author": "EM W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-28", "description": "Terrible experience with delivery.  Took way too long and they clearly don't understand consumer loyalty.  We are done with them.", "author": "Cory W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "Our regular take in sushi place in the neighborhood. Been here to eat once, but not the biggest fan of the restaurant itself. It's kind of dark, and not particularly great in terms of feeling like you are going out and treating yourself to dinner. So we prefer to take in from them. \n\nFood- fair prices and everything is always fresh. Their spicy tuna and salmon with avocado are solid choices. I also like some of their vegetable rolls. They do a good sweet potato tempura as well as a shitake cucumber and a peanut avocado roll that is particularly tasty.\n\nA good solid takeout sushi place in the neighborhood.", "author": "Sara K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "Excellent lunch menu.  Sunday afternoon.  Ordered an Unagi don, miso soup.  Soup had seaweed, tofu, And enoki mushrooms!  Healthy serving, even though I found it odd to have edamame as a garnish.  Service is attentive and decor is simple and elegant.", "author": "Albert W."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Kyoto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "115 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/XgCNWOcuivDv-SsBz6gw9A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225888"}