{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "This place has literally become my favorite Japanese in NYC. Excellent quality of Sushi and Unagi Don", "author": "Ivy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Stopped in for a quick lunch~ their lunch special seriously can't be beat- only 9 bucks for 2 rolls, dumplings , edamame and your choice of salad or miso soup. Food here is very fresh and delicious. they have a nice selection of sushi/rolls/sashimi even for the lunch special. I would not say it is a perfect sushi place or fancy but their food quality was absolutely amazing for the price. the service was pretty nice too. i really enjoyed my lunch and would definitely recommend it to others.", "author": "Hailey P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "Best sushi in the borough hands down. They deliver to almost anywhere and the dine in isn't bad either.\n\nThe food display is top notch....i mean it. Half the time you just want to stare at the food but once you dig in omg. The rice holds well, the fish is fresh,  the smoked eel is the best part to me.....try dissolving the wasabi in the soy sauce and dipping the roll in there. Yum!!\n\nTreat theses guys well and you'll reap the rewards in the long run.\n\n*cash and credit*", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "Great atmosphere and service. Everyone who worked there was so nice. The menu was very affordable and the vegetable fried rice and vegetable dumplings were delicious.", "author": "Kristen A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-04", "description": "I've been a customer of them since 2008. Loved their sushi/rolls. But seems that quality of fish declined significantly. Sometimes tuna/white tuna/salmon taste a little funky, not fresh. Overall, their specialty rolls are still pretty good! Delivery is fast-never had an issue.", "author": "Ekaterina F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "I have passed this place for years. This weekend  me and my friend stopped in for dinner. It was standard sushi and very affordable. Everyone who worked there was very nice. All and all I would return", "author": "Ann C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-28", "description": "Amazingly bad! Food is not very good. Staff has communication problems and, on top of that the credit card machine is not working properly", "author": "Edward S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "5 Stars in all aspects: great service, clean establishment, nice ambiance and spectacular, fresh food. Highly recommend checking this place out.", "author": "Maria P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "What a pleasant surprise amongst the variety of offerings in this neighborhood. \n\nAll appearances indicate a typical casual sushi joint. The kind at which no Japanese are likely employed. Nonetheless, I was served a most delightful sashimi platter. The presentation alone was exquisite. I'm gona have to dip back in next week and remember to snap it before it disappears into my belly. \n\nSweet sight aside, the prices make it even sweeter. Higher than average places of this category but they really hit the mark with quality and quantity. And I haven't before seen a standard regular sashimi plate with the variety of fishes they laid on. 3 each of tuna, salmon, whitefish, white tuna (seared outer edges, oh my) and 2 pieces of an avocado fish cucumber wrap thing that was a highlight in itself. \n\nAlso had a couple of squid sushi à la carte. So glad I did. They go beyond the juicy squid slice slapped on a ball of rice, sneaking a shiso leaf in between and topping it all with ikura to make like eyes on a fish. As adorable as delicious. \n\nI walked out stuffed but already mental-scanning my schedule for a return visit. Maybe to try something else on the menu but...more likely to order exactly what I just demolished. Yes!", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-15", "description": "I really wanted to like this place because it's so close to where I live. But unfortunately, will not be going back:\n\nI've been there twice- the first time the sushi tasted off (not fresh) and then last night, I found two hairs in my tuna roll. \nWould not advise.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "Since I am a pretty, pretty princess, I ordered the Princess Roll. \n\nSushi purists, beware. This isn't the type of sushi experience where you are savoring the beautiful simplicity of the fish. This is a spicy, crunchy tuna roll with eel, tuna, salmon, and avocado on top. But it tastes GOOD. \n\nIn fact, everything I've had here tastes good. The gyoza, the tuna dumpings, the Sunny Roll, the Fantastic Roll...I have yet to be disappointed.\n\nKyoto is not spectacularly decorated, and although that doesn't matter much to me, they seem to do a lot of takeout/delivery business as a result. Overall, I must admit that I prefer Ki Sushi across the street, especially aesthetically; it is far more conducive to a date.* However, this place is an excellent option when there is a line out the door at KI, as the fish is fresh, and they have more than a few interesting combination rolls.\n\nAnd it's cheaper. Which matters if you're, you know, me.\n__________\n\n*I hate to mention it, but our waiter suffered from a case of body odor that was impossible to ignore. My date probably chalked it up to my usual stank, but I can imagine how it could ruin a date for a man with generally good hygiene.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-21", "description": "Got delivery through seamless. My fault for getting non-sushi items from a sushi place, I guess, but the food was pretty awful. Mixed tempura, salmon, chicken entrees. I'm struggling to not puke right now. Also, each dish was about $6 more than it should've been. We thought the high prices meant quality! We're idiots. I'm off to hunch over the toilet.", "author": "Average J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Love love love. Their lunch specials are great and super cheap. The food is so good that paying the \"regular\" price for dinner is of no mind. The spicy crabmeat roles are my favorite, as is the teriyaki shrimp box meal. The service is warm and friendly. We go almost every weekend.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "We ordered Kyoto sushi for one of our wedding guests who has significant food allergies. There were some hiccups with the delivery person finding the correct address but my friend said the sashimi combo was delicious and he had no issues with any food allergies. Thank you very much!", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-21", "description": "This place has always been constantly good. I wish for the price the portions were larger but it isn't a huge deal. Also if they delivered to my area that would be swell! Other than that, this is a nice cozy spot to have a date night, dim lighting and every time I went there r\u0026b is playing. Lol..", "author": "Danessa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Whenever I'm in the mood for sushi, Kyoto is my go to spot for delivery, however, one evening my husband and I decided to have dinner inside.\n\nWe were the only customers at the time, but that slowly changed after a few minutes because four other groups came in for dinner as well.\n\nThe restaurant is small and cozy and the service was great!  Our waiter was very nice and showed my husband how to open up a bottle of Japanese soda.  There was a particular way to open the bottle and our waiter was gracious enough to show my husband how to open it.  I've had Japanese soda before, but I was not particularly fond of the one they offered at the restaurant.  None the less, my husband loved it!\n\nWhen it was time to order, we ordered edamame as an appetizer, the teriyaki chicken box for my husband, and I ordered two rainbow sushi rolls.  The edamame was fresh and nicely salted; my husband's chicken teriyaki box came with a lot of food.  Besides his chicken teriyaki, it came with a side of edamame, a small ear of corn, six pieces of California roll, two little egg rolls, four pieces of shumai, miso soup, and a salad.  Since my husband is allergic to shellfish, I had extra food to eat in addition to my rainbow rolls, which by the way were delicious!!!!\n\nAfterwards we ordered dessert.....and yes, I still had room to eat.  Hubby had the tempura ice cream which he loved, and I had red bean mochi....I love mochi!!!\n\nI am always satisfied with the food from Kyoto Sushi!!!  Arigato!!", "author": "J Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-29", "description": "I usually order lunch here . Food is great . Customer service sucks . They sent me the wrong rolls with my order . I called and they refused to change the rolls and hung up the phone . I called back and the guy was very rude . Bottom line they didn't change the rolls even though I've been a loyal customer for years .  They've lost me as a customer !", "author": "Tenisha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "See my previous review on this place. \n\nJust finished a delicious lunch in their delightful garden. This place is so much better when dining in. The Sushi was delicious, washed down with a cold beer and excellent attentive service.\n\nI underrated this place before and duly acknowledge that now. I will be back for sure!", "author": "Howard B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Bumped into this sushi spot on a walk with my 11 yr old niece, sushi was great and the prices were very affordable. Both her and I enjoyed our lunch! Restaurant was clean and spacious - recommended for a low cost but high quality meal!", "author": "Cynthia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-18", "description": "Overall , the sushi here was very good. I ordered the Mermaid Roll and the White Tuna Roll. I enjoyed the sushi, the service not so much. The restaurant had 3 customers and it took 30 minutes to receive my order ,because they were too busy making Take Out orders instead of serving patrons in the actual restaurant. This type of service is unacceptable!", "author": "Arielle D."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Kyoto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "115 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/XgCNWOcuivDv-SsBz6gw9A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225888"}