{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "My favorite sushi joint on Smith.  The fish is consistently very good, and their appetizers are interesting and delicious.  \n\nI especially LOVE the unagi don (eel).  It is super sweet and succulent, with just the right amount of lovely fattiness.  The dish comes with the most wonderful Japanese pickles, and the rice is decent.\n\nOne thing I REALLY don't like about Kyoto is the miso soup.  It has no flavor. Why?  I don't know.  And it is consistently like this so they must be making it this way on purpose.  Oh well, I can't have everything.  I also wish that there sake list were a bit better, but when I want sake I just head down to Dassara or the East Village.\n\nThe service is very warm and friendly.", "author": "Russ K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Absolutely delicious. Very accommodating for my shellfish allergy too. Will be back again soon.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-25", "description": "Lunch special is $9 and looks like it worth $25. I was like \"yo, I didn't order all this?\" BUT, it's just the way it comes and it was sooooo damned good. \n\nJust typing this, I'm fiening for that spicy crab roll I had. \n\nI'm hungry.", "author": "Edgar S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-26", "description": "I'll start with the positive. The prices here are good, but not so low that they cause you to worry about the quality of the fish. I was either seduced by the prices or I have intermittent bouts of amnesia because I ordered from here again about a year or so after a particularly unsatisfactory experience. A friend and I had dined at Kyoto on a holiday weekend, and we were the only people in the restaurant (I also remember the restaurant being completely empty when I used to live closer and get take out from there, back when their sushi was a step above mediocre). It was uncomfortably warm in there, and there were flies buzzing around. My friend and I had ordered different rolls, but both with tuna. When our food arrived, we both thought the tuna tasted very fishy, and it even looked a little discolored. When we told our waiter, he insisted that the sushi was fresh and that it was a different kind of tuna that we might not have been used to. He wasn't rude about it, but he was insistent. Whether or not it was a special kind of sushi that was just designed to taste rotten, we weren't interested. But it took a few more back and forths before he took our plates away and offered to replace the rolls. We were nauseous at this point, so we just asked for the check. I have never had to send sushi back before, not even supermarket sushi.\n\nRecently, I ordered from here again on seamless, not realizing it was the same place until the food arrived. The sushi wasn't expired this time, but it was sub par at best. Thankfully, I hadn't ordered anything with tuna.", "author": "Sandra G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-27", "description": "Dropped in there and had the shrimp tempura roll. It was very good and came out quick. The service was pretty good as well. This used to be my favorite lunch spot but the music during the day was terrible and often loud. I will have to check out lunch again. Going to grab another roll soon", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "One of my favorite sushi spots in the hood for good quality yet inexpensive fish. Lunch specials are a great deal. It's not fancy but it really is good quality", "author": "Jessie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "Walking distance from Hotel Indigo and a fantastic experience.  A warm towel when you are greeted at your table.  Terrific selection of rolls at reasonable prices.  A chill relaxing ambience.  Sushi in Brooklyn doesn't get any better than this.", "author": "William F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-26", "description": "Good sushi. Pretty good service. Pretty good prices. You won't leave unhappy. You won't tell your friends it's the best sushi you've had. You won't overpay. You might review it on Yelp.", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "I have never been inside this place, but I order from here at least three times a week for work. Their lunch box specials are amazing. It is always fresh, warm and delivered in a timely matter, even during lunch time. For the price you pay, there is relatively a lot of food. I highly recommend ordering from this place.", "author": "Aleksandr S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "They have really fancy sushi rolls here. I like the imagination of them. Here's what we ordered:\nPhoenix - spicy lobster salad, seaweed salad, tempura flakes, crab meat avocado wrapped with soy bean seaweed\nLadybug - two types of tobiko! \nAmerican Dream- yellowtail, tuna, kani, avocado cucumber inside \u0026 seaweed powder caviar outside\nParadise - eel, avocado, crabmeat inside topped with tuna salmon steamed powder\nand one more that I forget in name but in flavor was DELISH. \n\nThis place is no nonsense - not as fancy as Ki Sushi across the street but in terms of taste, a serious contender. Good service and totally reasonable prices. I would go back.", "author": "Marin G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-04", "description": "Stopped in for lunch today after realizing that Ki Sushi (across the street) doesn't offer brown rice (boo Ki!).  The lunch special was pretty decent. For $9 you get soup or salad, 2 rolls, a bit of edamame and 2 little shumai. The sushi was decent... Not the freshest I've had but definitely not bad. Good, solid value.", "author": "Nana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-16", "description": "Sushi snob here...and I'm definitely a fan of Kyoto Sushi. \n\nI stayed at the Aloft BK for a 2 week business trip and I frequently walked here (maybe a 20 minute walk? - totally worth it) for dinner. \n\nI'm liking the quality of sushi AND loving the shrimp tempura udon. \n\nHits. The. Spot.", "author": "Shannon A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "Came here on New Year's Eve and it was delightful! Relaxed atmosphere and yummy food! To start I had miso soup which was definitely more flavorful and tasted more homemade then miso soup you get most places. My friend and I shared the shrimp shumai which was super delicious and fresh. Then for rolls i had salmon and avocado roll, shrimp tempura roll and a spicy crab crunch roll. I ordered too much! Couldn't finish it all lol. It was all so yummy and fresh! I am definitely coming here again!", "author": "Kellie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "Great sushi restaurant.  Very kind staff and the food is absolutely amazing.  I'm very satisfied each time I go here.", "author": "Megan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-05", "description": "After trekking my way across the country to Brooklyn for a work trip, I really enjoyed the chill atmosphere of Kyoto.  With maybe 10 tables max, it definitely presents a relaxed presentation, which was very welcomed after a long travel day.  The sashimi platter was also great, and service on the mark.  Great spot.", "author": "Mel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "Dinner was outstanding a few weeks ago. Big fresh portions of delicious special rolls served quickly. The spicy mayo is actually spicy too.  \nSo today I decided to go to test their lunch special and I was just as impressed.", "author": "Paul V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "This is my go to Japanese restaurant in the neighborhood. Casual and comfortable, Kyoto is an affordable place to get some fresh sushi. My husband and I typically order sushi (salmon, yellowtail, scallop, uni, eel avocado roll, spicy scallop roll...) and some hot appetizers (gyoza, rock shrimp tempura). It is consistent and hits the spot. Delivery is fast and fresh as well.", "author": "Erica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "Nommy. nom. Nom. Super tasty sushi. It's your standard spicy crunchy salmon roll and sashimi. it's fresh and flavorful. They deliver far and somewhat reasonably priced. Their wasabi shumai is the bomb and their lunch specials come with edamame and two fried shumai pieces. Delish.\n\nOh and they deliver pretty far. Another plus! Find them on delivery.com", "author": "Valerie V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-07", "description": "Good Food, good service, pleasant décor. Wife had the Mango Shrimp Bento box, and I had the Beef Udon. Great taste,  and enough to take home. Will be back...", "author": "CT J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-05", "description": "I have never been inside Kyoto Sushi, but I have ordered lunch delivery at least a half a dozen times and I have not once been disappointed.  I work in Brooklyn a couple times a month and this place is my go-to-lunch spot.  They have an awesome 2-roll \"lunch special\" that includes 2 rolls (go figure), shumai (fried shrimp balls), a small green salad, edamame, and a few cubes of pineapple.  It's a pretty good amount of food for less than $10.  The have a nice selection of rolls even for the lunch special and I usually just go with the basics: spicy tuna, avacado and salmon, shrimp tempura, etc.  The service is SUPER fast and I have consistently been impressed with the freshness.", "author": "Nicole T."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Kyoto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "115 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/XgCNWOcuivDv-SsBz6gw9A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225888"}