{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Kyoto Sushi is definitely now one of our go-to Japanese restaurant in the neighborhood.\n\nWe always walk pass by this place and we finally decided to have lunch here on Saturday since we were craving some Japanese food. \n\nWe chose to sit at their lovely back patio. (Although in my opinion they could improve the back patio a little bit more) \n\nI chose Salmon Teriyaki lunch special on their menu. It came with a miso soup and vegetables salad with ginger dressing. Not to mention that it was served with California Roll, Edamame, a portion of corn and greens. It was delicious and sumptuous for a $10 value.\n\nWe washed down our meal with a cold bottle of beer. The staff are great and we did not have to wait very long for our food to be ready. There's definitely a repeat visit to this restaurant in the near future.", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "Decent food with a decent price. I was in the neighborhood and was craving for sushi. Ordered their chicken teriyaki bento box. It came with California roll, edamame, shui Meis, miso soup and salad. I never had a bento box accompany edamame so that was a plus. It  as a raining day and they were flooded with their take out orders. The waitress was attentive. Overall service was good. My entire lunch was $10.89. Last but not least, it was a bit too dim inside. It was probably due to raining and cloudy day. Should have turn on the light a bit to brighten the mood.", "author": "Weiming L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-20", "description": "Ordered take out \u0026 was very disappointed. The fish tastes a bit old. Quite revolting. Will not be eating here again", "author": "Imogen A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-11", "description": "This place is not bad, sushi was great, then I tried the hibachi seafood, and it was a disappointment. The food was overly done and very burnt. They also charge you for their sauces like ( eel sauce, spicy mayo, etc) so watch out. Their ginger salad is pretty bland too.", "author": "Anthony W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-19", "description": "It was my mistake not read carefully of the reviews before going, run into another Chinese owned Japanese restaurant. I knew selling Japanese food in US is making more money then Chinese food, but please at lease show you heart, do it right.\nStarted with the greasy tempura was a signal of leading to a bad dinner... then the sushi rolls comes.... I hate to waste food... but really no appetite of eating mushy sushi rolls.", "author": "Connie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "this resturant is my favorite。the food there was amazing ，ocean roll is my favor which is shrimp tempura inside and avocado and eel on top 。they also have lunch special everyday ，price is about $10 ，but you can have lots food ，the sushi lunch is good 。everytime i went there ，the fish was alway fresh 。one time i ordered sushi and sashimi \nthat was super ，the price is lower but the food was fantastic ，i love this resturant ！！！", "author": "Yanyu Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-02", "description": "An excellent, if not typical Japanese restaurant with all the fixings of what makes Kyoto Sushi a hit - fresh food, quick and efficient service, and a nice warm ambiance for which to dine - but there's another element that makes this place a true standout, in my opinion.\n\nThey have a menu item, a dish called \"Pepper Shrimp\" which is utterly, utterly  fantastic.  This is the reason I will drive from Queens to Brooklyn to have dinner at this place.  * Correction * this is the reason I will nag and plead with my bf to take me to dinner at Kyoto Sushi!  \n\nThe PEPPER SHRIMP is a delectable entree and a shrimp dish that is hard to find anywhere else.  The jumbo size morsels are truly huge, and they give you plenty of it.  I have honestly not had such a dish at any other Japanese restaurant I've been to.  In fact, I don't even know what makes this dish \"Japanese\" but I don't even care, it's simply that good.  An order will consist of about 10 pieces of this delicious, fresh, slightly spicy, crispy, and juicy, jumbo shrimp, white rice, and miso soup.  For $13, that is remarkable.  \n\nTrue story.............. a few weeks ago we went on vacation somewhere in the Caribbean (don't remind me, I am still in withdrawal), to an island touted for fresh seafood, and though we had an incredible time, and enjoyed quality food during our stay, I hearkened back to the memory of Kyoto's Pepper Shrimp dish one night, as I had had a similar shrimp dish while on vacation and it just could not compare with Kyoto's far superior dish.  And, it was also very pricey at almost $25 for the entree.  So, as soon as we got back to the States, I asked my bf to bring me to Kyoto so that I could redeem that shrimp meal, ha.  \n\nNow, if they ever take the Pepper Shrimp off the menu for whatever reason, I have no reason to go back to Kyoto if I am not in Brooklyn, specifically in that neighborhood!!", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-02", "description": "Kyoto did its job of satisfying my hunger, and that's about it. \n\nI ordered a spicy tuna and spicy salmon roll to go. The food came out quick. Too quick. I get home to find a long hair connecting from a piece of sushi to under the ginger. Not happy at all. \n\nThe sushi was mediocre at best. Their rolls had very little rice on it and the fish was oozing out while in the tray. \n\nGreat place if you're starving and want real cheap sushi. Otherwise, go across the street to Ki Sushi.", "author": "Just B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Kyoto Sushi serves up standard affordable take out sushi with a friendly neighborhood vibe. Eating in is comfortable for a casual date and comes with good service. Menu is skewed toward making you order rolls, although you can also have plates of sushi, sashimi, chirashi, a $30 omakase, teriyaki, and noodles. The menu is large and varied, and of what we tried the food is solid. \n\nKyoto is popular with the neighborhood and had a decent in house audience for a place that is well known with the take out crowd. There is seating for 35, so not a big place. Tends to be a bit dim in here during the day and in the evenings. If you have a group of 8, coming early would probably be sufficient, and they can merge enough tables together for the group. Anything larger than that may be overwhelming for other diners. Solo diners are very welcome here, with multiple two top tables or the option to eat at the bar in front of the sushi masters.\n\nPerry I and I were looking for a light dinner and ordered:\nMiso eggplant\nOshitashi (cold spinach)\nYellowtail roll\nYummy roll (spicy salmon topped with salmon/tuna/yellowtail)\n\nFor a neighborhood not-fancy sushi joint, the quality and portion sizes were fantastic. We enjoyed all of our dishes and they were brought out in the order they were finished by the kitchen in a nice rotation of tasty options. The service is attentive, but not obtrusive, and very patient. And for $30, we ate really well.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "I love their spicy crunchy shrimp rolls and the shrimp shumai's. Nice environment. Friendly staff. Fast service and cheap prices.", "author": "Emanuel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "Excellent sashimi lunch special \n\nMy co-workers got several different Chinese style dishes \n\nEveryone was very happy\n\n5 out if 5 of us recommend this restaurant for lunch... and probably more", "author": "Fred B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "This place is legit. Great fish, great selection of rolls and sushi/sashimi, and amazing prices. No frills decor and very casual, perfect neighborhood sushi place. We come here often and always will.", "author": "Jonathan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-13", "description": "Wow! The go to Sushi spot had dropped the ball! After a meeting at work my manager, some coworkers and I decided to go here from lunch. We had a very rude waiter who seemed very annoyed with his job. We split the bill between four cards and when the waiter came to take the checkbook he snatched it and started to check in front of us how much we all gave him in tips. After not being satisfied he gave us the book back and demanded that we give him more! WHERE DO THEY DO THAT AT? I put the checkbook down and continued to walk out because the meal was paid for and the tip was given, he then followed me outside yelling that this isn't right. I was so embarrassed.Try Sumi Sushi ! Their great! Better prices too!", "author": "Michael O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-21", "description": "Moms birthday we alway do sushi and this place has been a favorite for us for the last few years. Love all the rolls and I like always picking a new one to try. Next time I'll be sure to take pictures before scarfing down on dinner. Delicious", "author": "yolanda c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "This is probably my favorite sushi place in town. If you're going to splurge, this is the place to do it. The service is prompt but gruff, though I'd argue that's part of the great sushi feel. Our waiter, Weiquin, was able to give us good guidance was happy providing us drinks and appetizers. Everything you heard is 100% true! You guys should go to this place! It's the best place to spend time with friends and family!", "author": "Jenna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "Good, solid family-friendly spot to grab reasonably priced sushi.  Consistent on freshness and the staff is always smiling.Can't ask for much more in this neighborhood.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "I enjoyed a relaxing Tuesday lunch here with the hubby and 1 year old. Ikea high chair provided. Fresh food and good lunch special prices with pleasant service.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "The lunch special can't be beat. $9.00 for 2 rolls!! Not only 2 rolls but also comes with small salad(or soup) few edamame and 2 shumai!! \n\nSushi tasted very fresh as well. Ordered online and came to pick it up for lunch 15 minutes later! \n\nDon't miss out on their awesome lunch special! Also heard they have a patio/garden for outdoor dining out back! I will have to check that out.", "author": "Chrissy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-02", "description": "I was craving for Japanese food and sushi for lunch at work a few days ago, so I did some research and decided to order from this restaurant. The delivery called me first and I told him I would be outside soon and he left the building, so I was waiting for him outside and called him back. The total of the food was $9.80 but when I asked him, he said $10.00 and like an idiot I gave him $2.00 tip. I was so ready to give him less than that.\n\nFood:\nSweet Potato roll and Boston roll were actually and surprisingly well made and the shrimps were slightly sweet and meaty, just the way I like it. I didn't like that there was  avocado in the Boston roll cause typically it comes with just shrimp, cucumber, and lettuce.\n\nI was quite surprised because they gave me edamame which I absolutely love. I prefer it served chilled and slightly cold, but some restaurants serve it fresh and hot. Shumai was included in the lunch special, it was nothing special. The green salad, was just your usual salad, also nothing special.\n\nI like the quality of their food, but I don't think I will be a returning customer since the delivery man doesn't seem to have a lot of patience to wait and thanks for charging me an extra 20 cents, guy.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "The empire roll was SO good. One of the best rolls I have ever had. I hadn't had sushi this fresh in a long time. Didn't care for the shrimp tempura roll much. My bf got the tornado roll and thought it was also really good. The shrimp in the hot and sour miso soup was SO juicy and flavorful and fresh. If I lived in the area, I'd be here every time I had a sushi craving!", "author": "Mehreen M."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Kyoto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "115 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/XgCNWOcuivDv-SsBz6gw9A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225888"}