{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "I went with my family on Saturday for dinner. the place is clean , the food was amazing, sashimi was so fresh , the staff were so nice and patient! We really enjoyed the food and the atmosphere, we were differently go back there!", "author": "Mude C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-29", "description": "\"Let's go to Kyoto\", she said.\n\"It'll be good today\", she said. \n\nI rolled my eyes when my coworker suggested (read: insisted) Kyoto for lunch but I am a pushover that was too hungry to argue so off to Kyoto we went and today's visit confirmed that, indeed, Kyoto sucks and has officially been blacklisted from my lunch options. \n\nLike another reviewer mentioned coming here is like playing the lottery. Sometimes it's passable (albeit mediocre) and other times like today the sushi is straight up rancid. Yes, you read that correctly. Rancid.\n\nWhen you have options like Hibino and Ganso in the neighborhood there is really no reason to give Kyoto your money.", "author": "Siobhán H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-04", "description": "Was there for lunch. Flavors good and fast service. Small but nice restaurant. Didnt like that my soup and food was cold.", "author": "Janae W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-01", "description": "There's nothing like cold sake and raw fish on a hot day. \n\nMy fiancé and I came in for a late lunch. The lunch menu is pretty limited, just one page of their specials. We ended up splitting the sashimi lunch plus we each chose a 2 roll combo. Each special comes with miso or salad plus a few shu mai and edamame. \n\nThe miso was surprisingly good. They didn't skimp on the tofu and even threw in some enoki mushrooms. The broth was great and even those it was sweltering outside, I downed the whole bowl.\n\nThe sashimi was great. We got 3 types of fish (tuna, salmon, and unknown) plus 2 pieces of a salmon roll wrapped in cucumber. I wish I knew what that was called because we really loved it. \n\nFor the rolls, we split salmon skin, salmon avocado, eel roll, and crunchy spicy crab. Eel was definitely our favorite and the salmon skin was a bit too fishy for me. \n\nWe noticed they had sea eel on special and ordered two pieces, as we don't come across it often. The presentation was pretty, though the pieces were dissimilar in size. \n\nThe lunch specials are a really good deal - the 3 lunches plus sake came out to $50 and we definitely didn't feel cheated on portions.", "author": "Anne W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "I was craving sushi for dinner before I heading over to a friend's place to hang out. After debating between Ki Sushi or Kyoto, my boyfriend and I went for Kyoto because of better prices. We were glad we did! Kyoto was having a busy night but we still managed to get our sushi \u0026 sashimi for two pretty quickly. The sashimi was fresh and the sushi was neatly done. For what we paid, the portion was pretty big that we had a hard time finishing everything.", "author": "Celia Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "Walked into this place after looking at the menus of the other three local sushi places in the neighborhood and found them to be the most reasonable.\n\nI had the Sushi Sashimi Combo, but what I really wanted was the Sushi for two but I didn't want to feel like a fat bastard. It was a solid 4 out of 5 for me in terms of flavor. It isn't the freshest sushi I've had (God I miss Tokyo) and it is hard for me it seems still to be impressed by anything in Brooklyn. The wasabi was fresh and the standout was the eel.\n\nIf you're looking for a quiet and more soothing atmosphere Kyoto has that down to a science. Feng Shui was absolutely kept in mind for this floor plan. \n\nWorth a trip at least once for the overall experience. I can honestly say that I will probably return again.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-22", "description": "So, last night I ordered the sushi and sashimi combo for delivery. It was a Thursday night, around 6:45, and it was not raining or snowing, so I expected to receive my food in about 45 minutes. After waiting for 1.5 hours, I called Kyoto and they said it would be another 20 minutes and that they are \"very busy at night.\" I finally received my food 2 hours after I ordered it. \n\nThe food was fine, but a 2 hour wait is ridiculous. I won't be ordering from them again.", "author": "Ellen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-13", "description": "This place is a neighborhood treasure. I am vegetarian and love their miso soup and peanut avocado roll.", "author": "Ab A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "This is the second time we ordered in this restaurant. Most of food are unbelievable delicious and very, very fresh. Especially the Sushi and Sashimi. The Mango Shimp and fried rice are also very delicious. You would never regret to go this restaurant.", "author": "Wenlan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Keeping this short and simple, Kyoto serves good quality sushi at affordable prices. There is a competing sushi place called Ki right across the street. The ambiance there is more suited for a date than here. Kyoto is a nice place to order sushi that won't break the bank. I have only tried basic rolls here and they were great. If I'm around the neighborhood and not feeling fancy I will come back here.", "author": "Naomi T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-16", "description": "This is the 3rd time in a row I ordered from them and it took between an hour to hour and a half and the food showed up cold. Food is decent, not great, but for the price it's solid. But if you order anything like chicken teriyaki or soup expect that it will likely be delivered an hour after it's cooked and won't be warm", "author": "Kabeer M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-28", "description": "Order here if you want your evening ruined by a rude delivery man. \nOrdering from Kyoto is like playing a lotto.  Might get good food or might get cold beef nagamaki and a stale tuna roll and attitude from the delivery man.\n\nI've ordered from Kyoto at least 12 times over the past half a year so I speak from experience and not a single event.\n\nThe hot food is below average, very constantly. The sushi on the other hand are inconstant. I've had good sushi, soft smooth tuna sashimi, delicious lobster salad wrapped in tuna and black pepper tuna. I've also had chewy seaweed in the rolls and rice that tastes like it's been lying on the counter for several days before they used it. Hot food is always cold because it cooks way faster then sushi and then sits on the table waiting. \n\nTo top it all off the asian gent that delivers the questionable meal looks at the tip and smirks and says something in his native tongue that sound a lot like F***k you. Probably in the country he is from it's appropriate to tip a $20 for driving 3 blocks on a scooter in a beautiful 74 degree weather and then taking the elevator to the final destination and being an hour late. But in my mind a tip has to be earned. It's not obligatory to tip for doing a poor job. A customer has to feel like something extra has been done on top off what he asked for, but somehow it is long forgotten tradition and now a tip is part of the bill and the price keeps going up at the same rate as the service quality is going down.", "author": "Paul Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "Had a taste for sushi while out shopping and this was the closest (open) place. The sushi was decent, not bad or good and the service was okay, again nothing amazing, but no complaints.\n\nWe went with the shrimp tempura, spider roll and fried oyster roll. The shrimp tempura and spider rolls tasted like any other I've had. It was my first time trying a fried oyster roll and it was good. I think it would have been better somewhere with better quality sushi.\n\nI probably won't go back here as I was just passing through the area and it was close.", "author": "Ashlee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "This has become my go to sushi restaurant in Boerum Hill. The staff is friendly and the chefs really take pride in their work. My favorites are the shumai, carpaccio, and yummy roll. Definitely worth a trip!", "author": "Russell D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Yummy! Another great place to go for the family weekend dinner.  My kids loved their California rolls, edamame, fried gyoza and of course green tea and red bean ice cream.  We ordered different chef special rolls, sashimi and ate it all.", "author": "Lily L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "Solid. Very solid. Apparently I can't write a short review so here is some more text.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "Here for the lunch special.. bento boxes about 10-11 bucks big portions and you don't have to choose soup or salad because you get both", "author": "Brittney W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "I choice there special dish omakase , it has 9 different kind of sashimi including toro,king salmon,baby yellow tail ,madi, fresh oyster, sweet shrimp, yellowtail, sea eel and sima aji. It only cost $35 ,it is so fresh and delicious!", "author": "Fen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "I am slightly obsessed with this place. My husband and I walked by one day and decided to give it a go, and, an \"OMG This is so good!\", this has been our regular place since.\n\nThe fish is always fresh, melts in your mouth and all of the ingredients are fresh. And, it's great quality, and portion for the price!", "author": "Deborah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Tonight I decided to treat myself with the $19 sashimi plate. Took only 10 minutes to be prepared. It was AMAZING ! Best sashimi I've had in NYC! Everything was so FRESH! The assortment and presentation was 10/10. I have ordered from Kyoto in the past and it still quiet good but tonight they out did themselves! I guess the key is consistency, consistently, consistency. Thank you though!", "author": "Zoe B."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Kyoto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "115 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/XgCNWOcuivDv-SsBz6gw9A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225888"}