{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-01", "description": "I have been here a few times and it is pretty good. I have tried a few different sushi rolls and have also ordered entrees from the kitchen (teriyaki and hibachi entrees) when I wasn't in the mood for sushi.  Their sushi is fairly basic-I tend to get pretty simple rolls, which were good, but nothing to write home about. The entrees that I have had there are also good-I enjoyed the Hibachi more than the Teriyaki. All in all the price is right here and the food is good.", "author": "Molly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-14", "description": "I have ordered from Kyoto regularly for a few years but will never order from them again. I placed an order and two hours later was still waiting for the food. After the first hour of waiting, I called and was told the food was on the way. When I called back at two hours, I was told they were still making my order. They were incredibly rude on the phone. I will never order from here again.", "author": "Jessica O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-07", "description": "The food is always solid, but it's the service that seals the deal. Good food, reasonably priced, in a very warm and friendly atmosphere. We tend to go early with the kids and they are extremely family-friendly as well.\n\nWe rarely stray from sushi, soups, and edamame, and all are excellent.", "author": "Joel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-23", "description": "Love love love this place!!  Excellent sushi, delicious negimaki, the pepper shrimp are so good and you actually eat them with the shell on!  The dinner box gives you a generous portion of great food for only $16.  Trust me you can't go wrong with this japanese restaurant.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-01", "description": "Not that good. Ordered the chicken fried rice and the hibachi chicken. Both filled with mushrooms so if you don't eat those, be warned!!! Chicken was dry, rice flavorless. Pretty much pouring the dipping sauce from the spring rolls on it to make it taste better. Also took over an hour for delivery.", "author": "A U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "In the few years I've been coming here I've never once been let down.\n\nPrices are very reasonable.. maybe even better than reasonable.\n\nThe place is always clean and staff is always pleasant.\n\nThe food, no matter what I've ordered, has always been great.. well the sweet potato roll wasn't my cup of tea but I'm sure that's just a matter of taste.", "author": "Alex G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "Reliable service, decent sushi and great prices.  \n\nWe go almost weekly and order the Sushi/Sashimi for Two.  Huge plate of rolls, sushi and sashimi.  Items are fresh and they're good with substitutions.  Rainbow roll is fantastic. As is the Green Dragon roll (eel/avocado.)  \n\nGood deals for lunch specials too.  For under $10, you can get soup or salad, edamame and siu mai appetizer, and your choice of entree.\n\nStaff is really friendly without being obtrusive. Seems like everyone that comes in there is a regular.\n\nTry it and I'm sure you'll be back.", "author": "Saccha D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-05", "description": "Very bad, should be reported \u0026 closed down!! Must of been here 25 times, I loved the food and the prices... But once I got close to one of the waitresses there she told me the most disgusting thing!!! Once you are done with dinner and/or lunch your unused scraps are reused for the next guests... OMG I almost threw up!!! Nasty people... If you consider yourself brave and still want to go, I recommend the spicy tuna tempura roll... However for me, I draw the line at eating another persons scraps...", "author": "Thomas T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-22", "description": "It's frustrating to find a restaurant with satisfactory food but with the mood ruined when the server has limited English.  After she took the order, she returned twice to ask whether she had the order correct.  The music was loud.  The soup was lukewarm.  That was the last straw.  We left.", "author": "Harvey K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Great sushi, order from here all the time.  I got the shrimp fried rice for the first time the other night and wow...pretty f'n awesome.  Very nice staff and prompt delivery.", "author": "Anastasia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-05", "description": "The food here is generally pretty decent but kind of overpriced for what it is.  The sashimi salad is great!", "author": "Mojdeh M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-27", "description": "I come here 1 or 2 times a week for lunch. Prices are good, fish is always fresh, and friendly service. I've never been disappointed.", "author": "Seth L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-18", "description": "I got the Sushi Dinner Box and tuna dumplings for takeout. Great sushi, highly recommended.", "author": "Justin H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-02", "description": "Great budget alternative to Ki... Dinner specials come with plenty of food. Staff is friendly, the place could be a bit cleaner.\nThe food is fresh and good, Not the best... but u get what u pay for I guess...", "author": "Jon O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-04", "description": "If you are a sucker for tuna and avocado like me, this place is for you!  They have a very inventive sushi chef who comes up with new ideas all the time, and they are always happy to take special orders and substitutions.  The service is very friendly and they always spend a few moments talking to you before they take your order.", "author": "Tamar K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-03", "description": "Food is good, filling, does the job when you're strapped for cash (in nyc) and need a large bowl of udon or roll of sushi. Service is good, courteous. Decor and ambiance? Needs a little help... But other than that, good place for a quick work lunch or dinner.", "author": "Steffany E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-04", "description": "I'm having a weekly love affair with their tuna dumplings.  I fear I may soon find out whether Jeremy Piven's \"I got mercury poisoning from eating too much tuna\" story is true.", "author": "elisa v."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "the lunch special is great! any 2 sushi rolls, a big bowl of miso soup, a good helping of edemame (which I was totally not expecting), shumai (was really good!), and a little side of pineapple. at $8, veryyy good bang for your buck. the reason I didn't give a 5 was because they got lost on the way to deliver and because I wasn't a big fan of the eel roll", "author": "Nicole A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "love this place.  their fish is consistently fresh and delicious, service is friendly and delivery is super fast.  their prices are also very reasonable -- around $4 for basic rolls.  my favorite sushi around.", "author": "noah g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-20", "description": "best sushi in the area. great staff. reasonable prices. better than ki sushi- as long as you don't care about the \"scene\". not fancy just straight up great sushi", "author": "Amy S."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Kyoto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "115 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/XgCNWOcuivDv-SsBz6gw9A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225888"}