{"aggregateRating": {"reviewCount": 25, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-19", "description": "For a wholesome, healthy, filling, and fast lunch in DUMBO you can't do better than here. Forget grabbing a BEC at a deli that's gonna charge you $10 or a heavy, pricey meal at a sit down place. After lunch at M\u0026V, you'll feel great about what you just ate and how much time (and potentially $) you saved. \n\nIt's that not prices are super low - expect to pay $10-15 - but for how much you get it's super worth it. All the options to make your bowl are on display so you know what to choose. It's like Chipotle but actually healthy. There's a range of vegan and vegetarian options and a few meat choices. As a meat lover, I usually lean towards that when eating out, but damn the tofu here is phenomenal. As are the sweet potatoes. I also loved the kale and black beans. These are veggies done right, well cooked and seasoned.\n\nI actually had enough left over to have this for dinner too. So really a very high value meal both for price and taste!", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-19", "description": "Food is good, but nothing to write home about... but the 2 star is directly reflective of the service. It was my first and last time there. A crowd of people gathered at the unmarked order area, where no one knew who was first or who was helping who. The young girl who I was unfortunate to have help me made me feel like I was ruining her day by being there. Not a smile or a hello or thank you...\nThen all the employees hung out in the corner till someone waved/verbalized for help. \nAnother dumbo fail!", "author": "Jeremy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-15", "description": "I love the fact that I was able to find something healthy in the area from one of our buildings. It gave me a \"Dig Inn\" feel from the city which incorporates healthy eats with flavor. You can choose from a box or a bowl for lunch. Base of a salad or rice, topped with 3 sides and a protein. Furthermore, you can add one sauce and one topping to this. \n\nI went for the salad base with a kale salad, squash, sweet potato mash and salmon. There was so many flavors going on that it really was good individually until I mixed it all together. My only issue really is that I added a little too much (specifically speaking about green sauce) that overpowered my taste buds. I didn't mind the extra crunch and sole flavors of each side dish, but note to self when I give it go again, skip the sauce at the end!", "author": "Cindy U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-01", "description": "If you're looking for clean fresh food, this is the place! I got the broccoli, Brussel sprout slaw, brown rice, and oven roasted wings over a mix of spinach and romaine! The bowl was Def too much food for me, would get the plate next time! Wasn't a huge fan of the Brussel sprouts bc they were a bit too bitter for me! The wings were def way burned but I just peeled off the skin before eating! Besides those two things, everything else was amazing!", "author": "Janice K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "M\u0026V has the coolest aesthetic ever. Awesome ornithological wallpaper, faux fur draped modern chairs, and super big windows for that natural sunlight. This place was built for for Instagramming!\n\nI ordered the Verde Veggie bowl and roasted chicken leg/thigh. The bowl was great. Loved the roasted broccoli and the avocado, which had... spinach dip(???) or something similar inside the hollowed spot where a pit used to be.\n\nThe chicken thigh was pretty good. Nice and crispy. Also came over a side of rice, which was pretty filling.\n\nEnough for two meals!\n\nPretty good lunch option for when you're looking to be relatively healthy.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "I've had many good lunches at their Midtown location, so I was very excited to hear they just opened a new location in DUMBO Heights! It's not huge, but we were lucky to get window seating. I loved the interior design - very modern and stylish. \n\nI ordered a bowl with spinach, Vietnamese chopped salad, turmeric honey dijon chicken wings, vegan mash, and roasted cauliflower. It was delicious! All the ingredients tasted fresh and nutritious. I paired it up with one of their flavored/infused waters, which was lightly accented with coconut water, apple, lemongrass, lime, and Himalayan pink salt. The flavors are very subtle, but it was refreshing. \n\nThis place is conveniently located near the High Street Station and a great option for a healthy lunch/dinner!", "author": "Nataly N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "New location, same great service \u0026 food!\nI have visited the location in lower Manhattan and midtown prior to this visit. I was happy to come across this location while searching for vegetarian food in Brooklyn.\nI visited on a Monday afternoon, wasn't packed so I was able to get seating. I ordered the plate with vegan mash, salmon as my protein and two sides-chatted avocado(slight up-charge)and tomato, cucumber,kalamata fennel salad. I got a vegan brownie for dessert and the blue magic lemonade. Service was quick and friendly. Food was delicious as always and I was able to do some people watching as I sat near the window and enjoyed my healthy yet, warmly satisfying meal.\nI can't wait to return( I went again the next day btw:))", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-02", "description": "I have only been to the DUMBO location and went there because of the healthy options and while their food is actually good, there are a couple of problems. The ventilation is bad, I always end up going back to work smelling like the whole menu, the staff is impersonal, on the unhelpful side and they have a strange policy of only giving you sauce with your food if you get a bowl and if you get a plate, you need to pay 25 cents! Why? When asked, the person at the register said that was the policy. Ok.", "author": "Peri S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Ordered on caviar: tofu bowl with vegan mash, spinach, watermelon, and thai chili noodles. It came in a slightly soggy bowl because of water from the watermelon i assume, but other than that everything was perfect! Healthy and tasty. Soft flavorful tofu, and the carrot sauce was an awesome, slightly sweet and tangy addition. Pairs well with tofu and thai chili noodles. Glad that they opened up a place so close to work!", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-09", "description": "Really fresh, healthy, and tasty!  I've only ordered from M\u0026V for delivery but every time it has been great.  I usually get a bowl with the braised chicken, sweet pots, and brussels and it lasts me for two meals.  Love having healthier delivery options in the area!", "author": "Jen D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-12", "description": "$17.15 for a bowl of spinach with tofu and half of avocado! I thought it was a mistake  and asked the cashier why is it  $17.15? He said \"because of avocado\". I asked again: \" a half of avocado $6?\" He shrugged and said: \"Yes!\" \n10 min later another cashier  came to me and said they will refund me $5 for side of veggie ( I didn't get any extra  side of veggie). Anyway they never refunded it. So I never came back. \n $17.51 for vegetarian  bowl is too much, guys. Even for Dumbo.", "author": "Viktoriya R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "Natasha, the assistant manager, was incredibly helpful and responsive to an order malfunction through Uber Eats. I love their food, and Natasha provided me with a complimentary side order as a result of the long wait time and difficult Uber Eats biker. I will definitely continue to order from here again--the food is high quality and so are the people who work there!", "author": "Caitlin E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-04", "description": "Worst Delivery Experience\n\nI ordered my food through the Seamless/Grubhub app, super easy, reasonable pricing, etc., etc.  I was ok with the 90-100 minute delivery window.  However, 100 minutes came and went and tracking the order on the app shows it was not delivered yet.  I was having my lunch delivered to a business and asked the delivery to be left with reception.  I order from local places all of the time and this is the first issue I've had.\n\nI finally went to reception to let them know to look out for a delivery and it was sitting on the desk.  There were three people trying to figure out who to call to inform the delivery has arrived.  In all previous deliveries, I've received a call from reception because the delivery driver has my information to give to reception and my name.\n\nMy food was cold and the crappy paper bowl is soaked through with the juices from the food.  I have not tried the takeout or dine in experiences yet for this place but for sure stay away from delivery.  The three people at reception told me they asked for my information from the driver and they told me the driver just kept repeating \"Kevin H\", \"Kevin H\", etc. and stormed out.  Nice, thanks a lot for the excellent service.  Unfortunately, because the tip is determined at the time of ordering, I can't adjust it.", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "I am freaking obsessed with this amazing restaurant. The food here is always on par. The first time I had mulberry and Vine was in catering. And they're great as catering order too! Service is so personable and after eating here you don't feel awful about yourself but truly full and satisfied. The place is a 15 min walk from my work and I make the effort to take the walk. My fav is the Thai glass noodle and the vegan mash. You can't really go wrong with any of the choices though. You choose a base of spinach or romaine...have 2 veggies a protein ... A base and a crunch...and a sauce. My fav crunch is the coconut crunch! I see myself coming here probably almost everyday. I brought over my other coworkers here too and they love it as well. I'm serious..this is going to be a really serious addiction!", "author": "Pinky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Visiting the area.  Great find after crossing the bridge on a sightseeing adventure. \n\nThis is a great place to get your fill of good, unprocessed food. Nice relief from the norm. Good to be able to eat out and not feel bad physically for doing so. Small place physically, but serve very filling portions.  \n\nI had chicken, broccoli, mashed potatoes, and a grilled avocado. Yum, yum, and yum!  \n\nStaff was also very friendly and helpful with food recommendations.", "author": "G S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-28", "description": "As someone who works and lives in Dumbo I was thrilled that a new, healthy lunch option opened here. The food at Mulberry and Vine is solid: my go-tos are the kale, black bean, and avocado salad and the spicy watermelon salad in the summer (cannot wait for that to be back). But it's the service that really makes this place a winner. The staff is exceptionally warm, friendly, and accommodating. My friend and I were eating there and wonder out loud what the vegan brownies might taste like and seconds later an employee brought over 2 brownies on the house for us to try. It's that sort of special attention and service that will keep me coming back! Heads up: it's CARD only, no cash!", "author": "Hannah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Delicious new lunch option in DUMBO! The fare is healthy and quick when you're rushing back to the office before a meeting. The portion was well sized for $12. I ordered a plate:\n\n- Baked chicken thigh (super flavorful)\n- Sweet potato mash\n- Chili glass noodles \n- Kale black bean avocado salad \n\nWould highly recommend!", "author": "Helen S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-13", "description": "Pretty good food, but considering the sheer, gigantic size of its footprint, and that it's a premium, organic fast-casual restaurant with tables and chairs - and even silverware to eat with - it seems very odd and stinging to not provide a restroom. It even has a large hallway with numerous doors that would fool the unbeknownst customer to a non-existent bathroom...", "author": "T G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-08", "description": "I have been here for lunch a few times. Good healthy food, average service. They should get rid of the plastic lids and rubber bands when you get the good to go. Not a very sound choice for a place targeting healthy people...", "author": "Cosimo M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-06", "description": "I don't think this place actually has gluten free food.  I've had several celiac relapses and they only seem to happen when I eat here.  The review score is based solely on that.  The food itself is delicious, though when ordering sometimes the brown rice would be littered with old pieces that were so hard it would hurt my teeth.", "author": "Scott C."}], "servesCuisine": "American (New)", "priceRange": null, "name": "Mulberry \u0026 Vine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/kHqinlTFOimviH7TGbQeBg/ls.jpg", "@type": "Restaurant", "telephone": "+19178102827"}