{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Stopped here for drinks on a Monday night, as it was late and most places were already closed, yet French Louie was still going strong with a late dining and drinking crowd. Really enjoyed our drinks, service and a casual atmosphere. The decor is light and crisp, and the staff did not rush us out even though we stayed way past closing time.", "author": "Katherine G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-30", "description": "I had a restaurant week dinner here last Friday. Overall, it was OKAY, but not that memorable.\n\nI was impressed that we arrived and our table was waiting right for us at 8:30 PM. It was also in a spot closer to the front, away from the other patrons more tightly squeezed together (I get it, it's NYC, that's how restaurants are).  \n\nThe waiter was pretty sharp at first. I did feel like after a while, we got lost in the shuffle and were hardly checked on. I had never tried steak tartar before, and it was very good. I ordered the duck for my main course, and while the serving was not huge, it was solid.  The mousee for dessert was decent, but the whole experience felt delayed as we had to flag down waiters to get their attention.\n\nIn addition, their is something odd about the restaurant. Next to our table, their was an unmarked door. I went down the stairs looking for a bathroom and realized it was a staff area when I saw a sign on the door saying \"Staff Holiday Party Next Week.\" I think they need to mark the door with staff only or at least have a sign for the bathroom!", "author": "Jon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "A very nice bistro with great service and food.  I ordered a hake dinner and my son ordered a duck dish.We both liked them a lot.  Service was quick and cheerful. There seem to be a lot of regulars here. The owner or manager spent time with some of the diners and gave us a very warm goodbye.  I would go again.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "As great as the food is at French Louie -- and it really is delicious -- it's the service that really makes this place so special. Casey has been our server the past few times we've been there and she never fails to make an already excellent dinner exceptional. Smart, attentive, funny, super knowledgeable of the menu and the wine list, she proves that people come for the food but return for the hospitality. Management, give her a raise. PS: the steak frites are the bomb and I wish that Gruner came out of my faucets. See you again soon.", "author": "charles p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Incredible service. Came here for a birthday dinner for my bf, and we were blown away by the excellent wait staff. Our waiter was patient and observant, and clearly very experienced. We never felt interrupted/intruded and always had our drinks filled at the right moments. I wish I caught his name- thank you for an amazing dining experience!", "author": "Angela K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "Excellent food! I'm still partial to Buttermilk Channel, but this is a solid spot for homey French food. I had the grilled trout, a side of frites and a few bites of my friend's steak frites followed by profiteroles. My entree was just amazing, and the portion was huge. Perfect fries. Didn't love dessert but I'm not a huge profiteroles person. Awesome service and ambience, too!", "author": "Gab G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "~*Review #500!!*~ That's what I'm talkin' about!\n\nBeen a fan of Buttermilk Channel, so I was eager to try their fancier French sister. \n\nThe space of the restaurant is HUGE, and toes the line between fancy and casual. On one hand, you have candlelit tables and nice lighting. On the other hand, you have cartoon stencils and a cartoon mural on the wall. It makes for a nice, chill vibe.\n\nThe place was quite packed, and we were given the choice of a table in the front by the bar or outside in the backyard. We picked the backyard, which is spacious and beautiful, but it was so humid that day that we changed our minds and asked to sit inside. The servers were very nice and understanding, and even gave us a better table than before!\n\nThe menu is pretty awesome, and we were hard-pressed to choose. We started with the grilled foie gras, which was amazing and probably one of the best I've had. It was served with pickled grapes, shaved fennel, and rhubard, and while those were great, the unadorned foie gras itself would have been perfect on its own.\n\nFor mains, we shared the Bavette steak frites and grilled trout. Sort of a good offset, one heavy dish, one light dish. The steak frites were done well, although the steak was more medium than medium rare as requested. It was still really tasty. And the fries were spot on. The grilled trout was very light and crispy. It was served with fingerling potatoes that had the most amazing smoke flavor, cucumbers and radishes, and trout roe.\n\nWe finished with the profiteroles with cardamon caramel sauce and pistachio ice cream for dessert. Incredibly sweet and indulgent. Definitely satisfied my sweet tooth!\n\nService was great throughout, and while it's pricier than Buttermilk Channel, it's definitely worth the extra $$$. Definitely going on my list of favorite places!", "author": "Steph C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "French Louie is one of my new favorite restaurants in Brooklyn. And that's not that much of a surprise, considering the pedigree of the owners and chefs (most notably Buttermilk Channel).\n\nIt's not an every week type of place, but more of a semi-special occasion spot. They have tons of seating inside and out (including a gigantic backyard). I thought it was going to be classy to a fault, but it was actually surprisingly casual. We were originally offered a table by the door, but decided to go outside, but it was the most humid day of the year, and they were nice enough to bring us back inside at a nicer table in the back. The waitstaff was overall amazing.\n\nNot to be outdone, the food is also top notch. Started out with the grilled foie gras (because why the hell not?). It was served with pickled grapes and fennel. The foie gras was incredibly rich and needed nothing because it was the best I've had in a long time. But nevertheless, all of the added flavors really boosted the dish (especially the grapes). Great for sharing.\n\nAll of the entrees sounded amazing, but we eventually decided to share the grilled trout and the Bavette steak frites. The steak was slightly overcooked (more medium than medium rare), but the flavors were excellent. Great fries too. And the salad, while completely unnecessary since I'm a carnivore, was actually a nice addition; it wasn't just a few pieces of lettuce thrown together, but seemed thought through.\n\nThe grilled trout was a much lighter dish, with a flaky with a crispy skin. It was also served with these delicious smoked fingerling potatoes. They had a crispy exterior and a smooth silky interior. Kind of like smashed potatoes that weren't smashed. It was all topped off with some trout roe, which was just the icing on the trout.\n\nFor dessert, we had the profiteroles, which... let me just say, save room in your stomach. Pistachio ice cream over half of a cream puff shell. Three of them. Yummy.\n\nThey also have some interesting cocktails, and a great whiskey and apertif list. One of the bartenders actually came over and gave me a personal recommendation on an armagnac when I couldn't decide on my last drink.\n\nAll in all, French Louie is doing everything right. Can't wait to be back. Hopefully, I'll be back sooner rather than later for their Monday night dinner prix fixe!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-02", "description": "Ate at the bar. The monkfish dish was delicious. Market greens were different, but in a good way. Just nicely flavored, pungent greens with no other additions. Great bartender. \n\nUpdate: the menu changed and those lovely greens are no longer on it :/", "author": "M W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Good drinks. Mussels were delicious. They came in an interesting sauce. The fries were perfect. Also had the Steak frites, the steak was tasty but perhaps a bit too salty.", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "I went here for a quick bite. They have a back area that is very nice. I had the steak tartar, and my friend got the mussels. Got picture of mussels, but sadly i dug into mi e before i remembered to take pic. Will have to go back and get a pic. Looking forward to it.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "Very sad to say this restaurant has now \"fallen\".\n\nI've been several times.      I've been 3 times.  The first two times were great.\n\nThe food is slipping and the service is just downright terrible.   My husband and I had brunch here on Sunday (Jan 20th) with two friends and the prosciutto on my fried chicken was slime-y (thrown under a broiler).  The fried chicken (cordon bleu) was over fried and dry.\n\nOur waiter was rude.  She mixed up our drink order... we had to ask several times for our drinks.  When the wrong drink came out, the waiter told the bus boy to deliver it to another table.  After asking 3 times, we finally got our correct drinks.\n\nThen, the coffee we ordered never arrived.. we asked a second time...  now she was getting irritated and rude.   The waiter came over to tell us another waiter was taking over.     Finally the coffee came.... with no spoons and no milk.  So we asked for that.   I was beginning to wonder if I should ask for our food to come with plates.   Sloppy, sloppy.\n\nJust sad.   I so wanted this place to be good.  I was embarrassed as we invited friends to meet us there and we were let down.\n\nGood luck getting it back in shape .... sloppy service.", "author": "J M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "I am always happy with this scrumptious cuisine. Be prepared to wait the length of time it requires to prepare and cook as it is made just for the diner! I do not eat gluten nor dairy, but Love French cuisine. They have accommodated me the several times I've eaten there. The staff are quite knowledgeable and professional. Sharing is met with respect as is each request we've made. Enjoy. Give your tastebuds a treat! Subtle, refined and elegant. Taste, that is. Dress is comfortable.", "author": "Sandy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "We came to French Louie for brunch on a Sunday morning (11:30am) in early October. Our reservation was ready and waiting for us. Service was prompt and quality. Food portions were a bit small, even for comparable restaurants in the Brooklyn area. Food quality was good. Cost was fair for the quality of the food, not for the portions. Drinks were middle-of-the-road.\n\nI had coffee (good), bloody mary (good, but pickle veggies weren't great), and crab benedict (good but not enough). Many of my party had 'scramblers' and were impressed. The main complaint being the incredibly hard bread that was served with their plates. It was nearly inedible and painful on the tooth to bite into from their reports. I certainly wouldn't mind coming back, but it might not be my first choice.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "A most charming and authentically French place . Lovely garden patio in the back.\nWonderful ambiance and service. Charlotte , our waitress was so personable and knowledgable . Went there for brunch and had the freshest Oysters and a true to the recipe genuine French Buckwheat crepes: very delicate and not too sweet-absolutely the best I had on this continent! Highly recommend for a discerning palette.", "author": "A B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "I wanted to love this place but was a little disappointed. I was here for brunch and ordered the regular bloody Mary (virgin) and felt it was a little too sour. Maybe vodka makes a big difference. I ordered the special- duck hash with a sunnyside egg- pretty tasty but very small portion. I also ordered the creme brulee french toast. I thought that was pretty good but would be much better as a desert. I decided to add on the avocado tartine because I didn't feel satisfied with my french toast. The avocado spread was just like guacamole and they did put a lot. It also has a lot of citrus so the pickled tomatoes didn't really go well but it was really pretty. The bread was overly toasted so the edges were impossible to cut through. I cut out the center and scraped the rest of the avocado off. The table next to me ordered a sandwich and the woman was putting in some serious work to try to cut through her toasted bread as well. It might've been a bad day or batch of bread. I also had the side of chicken sausage. For $7 skip it completely. It was really dry and small- just order another plate for a few more dollars. Another thing I wasn't happy about was when I asked to move to the table next to me because I was going to order more food and the table was already full. This table was a little bigger and for two people. When I arrived one person was sitting at the table so I didn't think it would be a problem for my party of two to switch over. The server asked the manager and they denied our request. They said a bigger party will be coming. Well literally 2 minutes later the host walks over a party of two and seats them at the table. When the rest of our food came out the waitress wasn't even sure where to put the plate because out table was full so we literally had to eat with our plates hanging off the sides of the table.Pretty bummed about our experience especially since it has such good reviews.", "author": "Honest R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "~*~Happy 500th Review To Me~*~\n\nCome here for a birthday celebration and we both loved it! Being a huge fan of Buttermilk Channel, I was so excited to visit the higher end sister restaurant. Charlotte, our waitress, gave us excellent recommendations throughout the night. We both ordered French 75 (blend of champagne, lemon and cognac) to start off the night. For entrees, we ordered the Bavette Steak and the Duck Au Poivre. I know they are very well known for their steak, but I personally loved the duck. The blood orange marmalade was an excellent touch to the dish. As for dessert, I was able to pull Charlotte aside earlier that night and tell her to add a birthday candle to our dessert. I was originally really disappointed when I heard that their famous orange caramel \u0026 pistachio profiterole was replaced by their gram cracker s'mores profiteroles. However, Charlotte made it work for us. Instead of using the pine ice cream (which is supposed to have a more woody campfire taste), we were able to swap it out with pistachio ice cream...and it came out fantastic! Thanks for making the night special for us!", "author": "Win C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-29", "description": "'French Louie' refers to Louie Seymour, an interesting character from the past. How did the owner choose to name after him is unknown.\n\nSimple and clean decor. Noisy. Flies (ok, it's summer, but ...). Slow service - an hour wait. The patio looks comfortable. I like how they serve the house wine, by letting you taste it first. Also like how they replace the utensil, from a wooden box.", "author": "Irene E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "Lunch with a close friend --10 years and counting--plus an appetite for French anything (food, love, cities with food that make you fall in love, etc) equals a two-hour lunch at lovely French Louie.\n\nLots of seafood (those mussels at the next table smelled amazing after I ordered) but alas, I got the grilled trout po' boy. Poor me. It was actually really good. Fantastic pickle tanginess bursting all over the already flavorful, tender, juicy and so fresh fish, a nice sized portion, and a lightly dressed side salad with tasty herbs. While my friend had the awesome-looking vegetable socca--chickpea cake. Next time I'll try the salad niçoise socca (if I don't smell the mussels before I order). \n\nWe were both impressed with the decor: simple and modern with so much personality. And we agreed we'd like to come back during warmer weather for lunch/brunch in the outdoor space.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Every time I've been to this restaurant, all the food has been fantastic. Dinner might be expensive, but breakfast and lunch are not bad - expect to pay under $20/person. Service is good and the interior is very tasteful. There really are no flaws that I've seen.", "author": "James S."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}