{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "I've been here a few times and this place continues to impress me. The egg bowls they have for breakfast are fantastic- try the mushroom one it's great and the sausage one might be even better. The staff is always super friendly and the drinks are amazing. I've noticed that on the weekends between 10AM and 1130 is crowded, so before or after I've been able to pretty much walk in.", "author": "Scott S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "The food and atmosphere are both five stars! Atmosphere very friendly and definitely feels like a neighborhood place! Always good to have a reservation, though.\n\nFor dinner, the steak and roasted chicken are particularly delicious. I also like the seasonal sides, such as the brussels sprouts and grains. The gougeres are delicious and indulgent, but a bit heavy. For dessert, the profiteroles are particularly lovely. Highly recommended!!!!", "author": "V P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "What a great meal !\n\nFrom the start the service was GREAT, Brian our server was very knowledgeable , helpful and guided us through the specials. The cocktail menu was novel and all were delicious (Try the Sarsaparilla Sour.)_ we ordered the specials and 4 of us ordered different items so we got a fairly thorough sampling of the menu. Every item was a hit ! Delicious and well presented.\n\nCannot say enough about the food, drinks, service (Thanks again Brian) and ambience. I am usually reticent to post about places love, because I dont want to have to wait for a table (selfish - I know)  - but please go, enjoy and say hello to Brian ...", "author": "Bob G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Had brunch here and it was delicious. Service was friendly. Make a reservation though, this place gets busy!", "author": "Sarah O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-11", "description": "AMAZING!!! Couldn't wait for French Louie to open and it doesn't disappoint!! The steak, the snails, the chocolate mousse, are delicious!", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "we came here for restraint week.. the hostess was sort of strange... she put us (4) in the corner table right next to a couple. I asked to change tables just because it was too tight for four of us in the corner and secondly there a couple in the next table. its abit awkward if they wana be all lovely kissy touchy and we are ontop of each others. the hostess took some offense that I requested another table. LOL! but whatever over that hurdle... the appetizers were good start- mussels, beef tar tar, and beets. entree was delicious but not the duck confit.. its abit too sweet for our liking... the dessert was the pistachio. it was so sweet!! everytime u take a bite u need to wash it down with some water... dessert can be much better.. our check came out to be like 243$ plus a bottle of wine. they accidentally charged us a different wine price than the menu. the waitress was able to fix it. overall the food was food to delicious but i will skip the dessert", "author": "Lola S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-20", "description": "Went there for lunch recently and was underwhelmed with their food.  Got their burger and fries...nothing special. Service was attentive.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "Heavy yelp user (for reference) not a big yelp user (for reviews) but as a Chef and fellow industry professional, this place has it all. Great food, great drinks, and a great vibe!\n\nNot to mention the manager, Doug, stepping up to the plate and recognizing a long wait time for a table. \n\nWill be pushing business this way as long as I live in BK!", "author": "Jordan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Wonderful experience!  We didn't have reservations but able to get a table for Sunday Brunch.  Service is excellent and food was very good.  Everyone in my group was happy and would return when we are in the area.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "LOVE IT - avocado toast is amazing. The pickled zebra tomato was a great surprise. And the patio is perfect to hangout in summer.", "author": "Melanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "Sunday Brunch was amazing!  Bloody Mary's were exquisite!  Made reservation on the way there,  was seated within 15mins. Will definitely go back whenever I'm in Brooklyn", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "Great spot for brunch. Nice and casual atmosphere with extremely friendly service. Came here with a group on a Sunday and didn't even have to wait for a table. Croissant French toast - need I say more!", "author": "Anna F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "Staff was SO FRIENDLY.  Went for brunch. Accommodating, pleasant. Coffee was tasty. Eggs with goat cheese was a little rich. Will return.", "author": "N K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-14", "description": "Food was good.  Service was OK; nobody re-filled our wine nor water glasses nor served us bread even though some tables were having it.  I wonder it one has to ask for bread?  Not sure.  What's up with the dude who just drops the dinner plates onto he table?  For the overall experience, it's pricey.  We were at Le Coucou last month and paid only about $60 more for an absolutely special and stellar meal and service with comparable amount of food \u0026 wine for 2.", "author": "Princess L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "Went before a Bruce Springsteen concert for dinner. Food was fabulous!!! Steak Frites was very tasteful and perfectly cooked. Steamed mussels are a MUST have. But most of all the service is AMAZING from hostess to server. Can't wait to go again.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "Went here for winter RW. Service was outstanding and the food was just as good. For me the must orders are the mussels for appetizer and trout for dinner. They had a good selection of beers and wines.\n\nThis was one of the better places I've been in NYC. What truly made this place shine was the attention to detail (both with the food and service). Definately on my radar from now on.", "author": "Matthew J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "Lovely Brooklyn restaurant. The Eggs Louie were delicious. Perfectly poached eggs on toasted croissant. Nice wait staff and pleasant atmosphere. They have outdoor area but with rain I didn't have a chance to check it out.", "author": "Farrah D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "This place blew my mind. One of the best meals I've had in New York. The decor is stylish and intimate. The staff are knowledgeable and polite. I will definitely be coming back here.", "author": "Laura S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-09", "description": "Horrible dining experience on Sunday April 9th.  The lamb special ($30) was served nearly raw.  When we asked for it to be cooked a bit more, the request was met with a dirty look.  When it came back out, it was still ridiculously undercooked.  A second complaint about the undercooked lamb fell on deaf ears.  They made no effort to accommodate us or mke it right.  Never again.", "author": "Tony F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "I came here for my birthday dinner with some friends, we sat out back. \n\nService: Perfect balance between friendly and efficient. Normally I like making friends with servers, not so when I'm with 6 of my own, so the semi silent service was appreciated. Very knowledgeable about the wine and food. Complimentary glass of wine, birthday and all. \n\nFood: I got raw scallops to start. Very good. Excellent if there was less of that burnt-earthy tasting puree on the plate. Whole porgy for the main. It was...unmemorable. I kept reading about their blood orange founder, but that was off the menu, and this was just okay-ish. My friends seemed more satisfied with their steak, scapes and rabbit parpadelle. Dessert was incredible, and I'm not a desert guy.\n\nAmbiance: Perfection. \n\nPrice: 6 people about $300 before tip, so a bit pricey. \n\nI'd be back to try some more food for sure.", "author": "Nati R."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}