{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "My group of four had originally had a reservation at Bacchus, but after waiting 40 minutes and still not being seated, we ventured over to French Louie, fully expecting to wait even longer because we were walk-ins.  Instead, we were greeted by an incredibly warm hostess who immediately offered us a table.  \n\nThe night only got better from there.  Our server was attentive and upbeat, which erased the negativity we had experienced at Bacchus.  Wine was reasonably-priced and delicious.  Love the anchovy frites and the carrot and beet salad for starters.  For entrees, my husband had the duck, while I had the rabbit pappardelle -- both were delicious!  For dessert, our group split profiteroles, the pot de creme, goat cheese ice cream (!!), and two different types of cheeses.  We left feeling stuffed and happy.  \n\nDefinitely plan to come back!", "author": "Laura M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-03", "description": "Extremely salty from appetizer to entree, I lost my appetite halfway through because it was so unbearably salty. Shouldn't call itself a French restaurant - there's nothing French about the food and it really tarnishes the name. Service started out friendly but eventually left our water glasses unfilled for the second half of the meal.", "author": "Sandra K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "Absolutely delicious food - try the anchovy frites and the gnocchi - and great service. The waiter brought out two kinds of wine to try based on my request for a recommendation - loved the attentiveness and help!", "author": "Liz S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-04", "description": "I plan to come back for a backyard brunch the minute weather allows it.  We came here on a Thursday night and the place was hopping at 9 pm.  I ordered the Frenchie salad (delicious, although kind of heavy on the French dressing) and the spring gnocchi, which was perfect--pillowy nuggets of gnocchi accompanied by fresh and flavorful vegetables.  I will also note that portions are pretty small/light--I didn't mind it at all, since I wasn't starving, but something to keep in mind.  We split a bottle of rose which I don't think was particularly good but still drinkable.  French Louie also makes their own ice cream, so we tried the chocolate, vanilla and goat cheese for dessert.  They were all great--particularly the chocolate which was very intense and almost umami--clearly they used a high-percentage cocoa.  The goat cheese was also excellent--I recommend if you are not put off by the idea.  It was reminiscent of thick greek yogurt, or a very creamy goat cheese.\n\nCan't wait to return and try more of the menu!", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "Came here with a big group including the bf and sat in the backyard.  Everything was perfect.  Apps, entree, wine, service, ambience.  This place is a gem.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Incredible food, top-notch service, terrific wine list, all in a relaxed and friendly atmosphere.", "author": "Holly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "I give French Louie 5 stars because of its commitment to freshness, quality, deliciousness and warm friendly \u0026 knowledgeable wait staff.\nThe menu has a good range and its possible to put together many different kinds of\neating experiences here.\nFirst time we dined we were shocked that the food was as good as it is. I had the\nflounder \u0026 my husband the duck. Both were excellent. We came again and had the steak and the Grand Socca which was wonderfully tasty and its great to see a restaurant provide more than lackluster vegetarian options. This was exciting food.\nThe dessert of profiteroles was fantastic, the wine choices are interesting and outside the typical range of menu by the glass.\nThe room is attractive but can be very noisy so we pick our times...but always happy to come here. The outside space has 2 tiers, one for dining and one for drinking \u0026 relaxing......which is lovely\nHighly recommended", "author": "Kate P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "A delightful place for lunch (haven't yet tried it for dinner) - everything so well prepared and fresh, with special compliments on the heirloom tomato soup, avocado tartine, peches melba, and butterscotch pudding. The staff is welcoming and accommodating, and the dining areas very comfortable. I'm usually not a fan of outdoor dining, but the patio at French Louie is lovely, with a large awning  providing protection from the sun.", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-28", "description": "Cool vibe inside. Had a good brunch but expected it to be more memorable food based on how awesome things are at Buttermilk channel. Go to check out the design and have a snack and a cocktail. I would skip brunch.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "Very nice place and a very pleasant backyard. I'm not sure what's exactly French here, besides the wine, but who cares, food was delicious. I didn't like the first wine I tasted so the bartender opened a new one - no drama. Pretty negative point though: One of the waitresses took my friend's plate although he wasn't done. It's not even like if the place was packed, nobody was waiting for a table. No reasons to rush.", "author": "Charlotte G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "One of my most loved places to dine in Brooklyn. Great food, great service, great times. I highly recommend.... Sit in the garden if possible.", "author": "Darlene L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-22", "description": "I have never written a review before, but after months of looking forward to having dinner at French Louie, our experience was utterly disappointing. The wines by the glass were not good, so we ordered martinis. The oysters were fishy. The steak (the more expensive, dry aged cut) was fatty, undercooked and over salted. The accompanying french fries were soggy. My duck was tough and raw in the middle. Even the dessert - profiteroles, which are supposed to be light, were hard. \n\nThe atmosphere was nice and everyone was super friendly, but with all the fantastic restaurants in the neighborhood, I will unfortunately not be back.", "author": "Kate E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Perfect brunch spot. Enjoyed the creme brûlée French toast and steak tartare. Both were real treats for the taste buds. Great atmosphere and service as well.", "author": "Laura T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "Lovely food, attentive staff and warm atmosphere. Dinner is awesome but it's also a great spot for a weekday business lunch. My favorite dish I have tried so far is the mussels in dijon mustard.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-16", "description": "I really wanted to like French Louie. I live in the neighborhood and love Buttermilk Channel so was anxious to give it a try. A friend and I arrived early to avoid a long wait and it was full but not crowded in the bar area.\n\nWe had a bit of trouble getting the hostess to acknowledge us. When she finally did, she told us flatly that there was a wait for a table for two. When I asked her how long, she laughed rudely and said, \"I have no idea, it's our first week.\" Trying to get a bit more information, I asked, \"Well do you think it's more like 15 minutes or an hour?\". She responded, \"It's between 15 minutes and an hour.\" There were so many other more polite and helpful responses, I can't imagine why she would have chosen that one.\n\nFor a restaurant trying to position itself as a neighborhood standby, they have a funny way of making you feel welcome.  I left without eating and won't be back soon.", "author": "Camille K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "We drove in from Mamhattan to celebrate a birthday. Definitely worth the drive even with the Brooklyn Bridge under construction. Friendly attentive service and amazing food at reasonable prices. Every dish was superb.", "author": "Karen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "This place is so good.  So good that I want to go here everynight because I know it will soon be nexttoimpossible to get a table once the rest of NYC figures out its awesomeness.  Service is topnotch; cocktails are sublime.  And the food?  I'm writing you from a coma right now.  French Louie now ranks as my favorite neighborhood spot, possibly one of the best spots in the city.  Yes, it's that deep.\n\nWe had:\nTo start:  him:  Hotel Chevalier, radishes;  me: French 75, oysters\nMain: him:  lamb neck daube, languedoc-roussilon; me: point judith flounder, piqpoul de pinet\nDessert:  him:  profiteroles with sherry caramel and fennel sorbet, nonnio; me:  goat cheese with mixed berry and something else special, averna", "author": "Rrose S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "5 Stars for the Eggs Louie. Space is nice, garden is great, staff are cool. Nice addition to the neighborhood, and I hope they do well.", "author": "Matt P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-17", "description": "French Louie is a lethal combination of expensive and bad.  We ordered the mussels, dry-aged steak, and the skate.  The Mussels were served at lukewarm/room temperature and tasted old, slimy, and fishy.  They also had this weird white mayonnaise on the shells.  We ate a few and let our server take the rest away.  (We had indigestion for much of the night).  The Skate had very little taste, and the crab-infused dirty rice on the side had little more.  The bisque sauce was tasty enough, but cold, and not enough to save the dish.  The 28 day dry-aged steak (at $36) was unseasoned, undercooked, tough, and largely flavorless.  The little thimble of home made steak sauce that came with it was the best part of that dish, as it allowed us to choke down the meat.\n\nIt's too bad the food is so dreadful because the space itself is nice and the outdoor garden is positively beautiful.\n\nAt the end of the day, though, there are many solid french-style bistros in the area where you can get far superior (and cheaper) steak, mussels, and fish.", "author": "Steven G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "We ate here on Saturday evening....waitress was superb young lady....knows the menu well and gave us wonderful service!\nSardines, Tomato salad and Rillettes were delicious \nLamb Chop, Duck Allard and Chicken were washed down with a nice bottle of Frog's Leap Cab....\nI think French Louie knows their business.....thank you!", "author": "Simon M."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}