{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-21", "description": "One star for the short grumpy unattractive  hostess. We went hoping for a Table for 3. My 5 year old gave her a sticker and she literally looked at it as if he'd given her a used Kleenex. I hope to try an earlier hour next time. Really could do wo the sourpuss greeting. It can't be that hard to replace a hostess.", "author": "mj b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "Well designed space, love the mountain scene on the wall, great service, great food. I recommend this place to local friends and those visiting from out of town.", "author": "K C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "I had dinner at French Louie with my wife this past weekend.  The food, the service, the ambiance were all topnotch leading to a very enjoyable dining experience.  I highly recommend French Louie.  I had the duck and my wife had the flounder, both were superb.   In my opinion it is one of Brooklyn's best restaurants.  As other reviews mention the owners also own Buttermilk Channel.  I have been to Buttermilk once and thought it was very good but I prefer French Louie.", "author": "Paul A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "we came here for my graduation celebration and it was lovely. our waitress was so attentive and thoughtful - they even brought out a dessert on the house to help celebrate! the food was fabulous. our favorites were the hake and gnocchi. we ordered a bottle of the pinot from willamette valley and it was a perfect addition. we can't wait to go back!", "author": "Grace B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "I went here for the first time for brunch with my parents, who were in town from upstate, and we all loved it.  The food was delicious, the service was great, and the space is lovely.  There have been a long series of restaurants in this space, and I really want this one to stick - don't understand any of the negative reviews.", "author": "Karen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "French Louis is a very ambitious and well executed restaurant. I find myself wandering in late night for steak tartare and a warm basket of gougeres. This is an amazing addition to the neighborhood and I look forward to a long and serious relationship with the inspired smoked sardines.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "Brought my mother here when she was visiting the city. Gougeres were perfect to start. We had the duck \"allard\" and dry aged steak, bravo on the house steak sauce. Profiteroles and pineapple tart tatin for dessert were a nice finish to a solid meal. I'll be back soon.", "author": "Heather G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "My neighborhood has scores of restaurants. French Louie is quite special, original menu, great friendly service, the best beef tartare, delicious ramps, sardines and everything else we ordered. And the hostess was beyond friendly.", "author": "Ruth L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-02", "description": "Showed up early on a Friday when everything seemed to be going against the restaurant. Food inspectors showed up for first inspection. We sat in the backyard. Very Pleasant. Guy gesticulating at the next table almost got me with a glass of red wine, then rain moved through and we took the rest to go. Throughout these bizarre events the staff could not be more pleasant and apologetic...even for events that had nothing to do with them. Great service and the food was excellent....but main dining room was loud!", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "I am so lucky that I just happened upon this place. It was about 10:30pm and I was walking in the rain to find somewhere to get some grub. Not a huge American portion, but something made with thought that would leave me with a great memory. Found it here!  I walked in and was immediately able to sit at the bar. Ordered the duck breast with mashed potatoes and olive spread, \"Allard.\" I ordered it medium rare. It was phenomenal!!  The duck was a nice portion and included the skin. And if you truly love duck, then you wouldn't want to miss out on the skin. It was tender, juicy and so full of flavor!  The potatoes were great. The olives left me with the desire to make a serious effort to try to incorporate more olives into my daily schedule. I almost settled up and left after that until I realized that they had desserts!!  Ordered profiteroles with fennel ice cream and a nice drizzle of sugary goo. It was the perfect dessert!  And it really represented French portions and flavors well. Not swimming in goo. Just enough to make you enticed to sop it all up with the flaky, croissant-like profiteroles as the fennel ice cream melted. I told the bartender who served me with a smile the whole time that if I could, I would have licked the entire plate clean. The ice cream was just delicious. Thick, dense, fresh ice cream that really left me satisfied. The only down point of the experience was when I left to walk back to the apartment we are staying in and realized that I could have been dining here since Tuesday!  But we leave to return to our home in Atlanta tomorrow. Wish I could have eaten here again and again. And I truly hope they remain successful for next time I am in town so I can eat the exact same menu items. Such delicious food!!  And with the whole meal mentioned above, the bill was about $35.00. This food was made with some serious thought and love. Cannot wait to come back!", "author": "David F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "The food was very delicious but their service was so-so. They must have been slammed. Would try again, especially in the spring and summer when the outdoor area is open!", "author": "Leah W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "I loved this place! My friends and I went for some drinks on a Sunday before attending a nearby show, and we liked the vibe so much that we returned for dinner (and of course more drinks!) after the show. We had the mussels which came in a delicious mustard sauce, and also some fabulous fries. The food was excellent. I had the bellini, which was perfect, and my friends had cocktails and were very pleased. The staff was fun and kind and super attentive. I'll definitely be back. Thanks French Louie!!!", "author": "Jessica F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-20", "description": "Went to French Louie on one of the arctic nights we've been having.  The atmosphere was warm and inviting.  I had a lovely very reasonably priced glass of pinot noir as I waited for my party.  Our server was attentive and knowledgeable.  Then the food came.  I was recommended this place by several people whose opinions I trust, so maybe we hit an off night, but I was truly unimpressed.  We ordered \"Le Grand Socca\" - their vegetarian Middle Eastern inspired entree as an appetizer to start.  It was fine, but really lacked the Middle Eastern flavors I craved.  The dish also begged for acid, which I found was a theme throughout the meal.  \nFor mains, a friend and I ordered the porgy (as it was recommended as one of their best entrees) and the \"Bavette\" steak frites to share.  The Bavette steak is a fancy name for a hanger steak, though our server told us that it would be the more \"tender\" option.  The steak was cooked to specifications across the board (my table ordered from \"black and blue\" to \"well done\" - don't ask why people even bother with steak if they're going for well done).  The steak came out tender enough (standard hanger texture) but VERY overly salted.  I get that because it's a cheaper cut they feel they need to enhance the flavor, but the salt was overpowering, especially on a dish that comes with salted fries.  The fries were 100 percent the star of the meal, which is confusing, but at least they nailed something.  \nThe porgy just did not, despite it's efforts, remotely live up to the menu's description.  The \"concord grape brioche\" lacked even the most remote hint of fruit flavor, and the accompanying veggies just weren't bright enough to stand up to a brown butter sauce.  I wanted acid. So. Badly.  \nDessert was a disaster and I'd avoid altogether.  We got a lime pie that was atrocious. That's it.  Just inedible. \nFrench Louie isn't bad and it isn't great.  It's fine.  It's meh.  I would go there again if I were wandering Atlantic Avenue on a cold night and needed some good wine and decent sustenance.  I would not, however, venture out for the sole purpose of eating at French Louie.", "author": "Lindsay D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-08", "description": "So I had kept seeing French Louie pop up on a the hot and trendy lists. I also saw that  they had worked out the initial kinks that new restaurants face. After finally eating there I have to say, I don't get it. We ordered the pork and rabbit rillettes as an appetizer, it had the consistency of tuna salad and didn't have much flavor. It even looked like it had rolled over onto its side when the waiter was bringing it out even though it was upright when it made it to the table. For my entree I had ordered the roast duck breast Allard. When it was served it was served with the grey side up which made for an ugly presentation. I had flipped it over to see the whole piece and there was a nice crisp skin that was sitting in the jus that would have made the presentation 100% better if it was served that way. Aside from the presentation I had also found it a little over cooked and tough. I had tried my girlfriends also, she had ordered the roasted king mushroom and while it was ok, it seemed to miss what it was aiming for, there were earthy tones but the sauce was overly salty sweet and sour all at the same time. She had also noted that the pieces of potato she had in there were under cooked. Aside from the food, the service was nothing to write home about. Our waitress came over and then disappeared for a extended periods of time. By the time we were done with our meal we were itching for the check and still couldn't locate out waitress,which after a mediocre meal can be frustrating because you just want to leave it all behind.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Delicious meal. Delightful service and at prime time on a Friday night! I will definitely be back!", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "I eat here at least once a week, the staff is extremely nice and the food is amazing ( try the le grand socca) The lighting is nice and dimmed so it's perfect for a date. Outdoor seating is awesome and the wine list is really well thought out. You won't be disappointed!", "author": "Akram S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-02", "description": "I was there recently and my partner ordered the duck dish on the menu but it was not up to snuff and we asked for it to be replaced with something else. Our server turns to us and says 'what are we supposed to do with this'? The owner/ manager obliged graciously though. Besides, the food was okay considering the $ spent. Not going back any time soon", "author": "S K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-15", "description": "I wanted to love this place.  The space is terrific, the ambiance is great, sepia lighting, etc.  The menu had so many things on it I wanted to try. Here's the bad part.  First of all, it took at least 20 minutes for a server to come to our table.  Granted, Saturday night, but there was an empty table right next to us so it's not like it was fully packed.  More importantly, the food was really disappointing.  I won't go so far as to say it sucked, but there was always something missing. In the case of the soup, it was incredibly bland. I must have used the salt shaker at least five times during the course of the soup.  And then I got a middle eastern themed vegetarian dish. Okay, maybe I should have stuck to French, but the description was appealing. I would have been perfectly fine but they kept throwing in weird flavors where they didn't belong.  The olives, for example, were overpowered by a strong orange flavor.  Bleck. I won't be going back.  Though, like I said, very pretty space.", "author": "Rewps 6."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-13", "description": "Wasn't able to try the restaurant, but I felt compelled to write a review because of the service. We had asked the hostess if we could get something to eat, but the waitress said the restaurant was closed. Fine. So we asked if we could get a drink at the bar, but again she said that they don't serve until 5pm. However, she did give us a menu for us to take a look despite the restaurant not opening for another 45 minutes. Fine again. But as we were walking out of the restaurant, we could hear the hostess laughing with the other restaurant staff about how dumb our question was. Firstly I don't think any service establishment should allow staff to talk about their customers in that way, especially if the customers are still around and as a result I give this restaurant a zero for its service and I am sure I won't be back to try the food as there are just too many other choices in Brooklyn for me to choose from. My friend asked me for my opinion on the place as he lives around the area, guess what my answer will be.", "author": "Clifford K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "We intended to dine at La Vara but lost our table thanks to the Brooklyn Bridge being closed to traffic. (No fault to the restaurant... we blame Mayor de Blasio and the MTA for being an hour late for our reservation!) So -- finding ourselves all the way in the area between Boerum Hill and the Slope in Brooklyn, we franticly scoured Yelp on our IPhone for something we could walk to with ease. On Atlantic Avenue was a place I had heard about from friends... French Louie. Let's start with the hostess -- as warm, friendly, charming a professional as one would hope to engage on a frustrating evening. She went out of her way to accommodate our party even though the place was packed -- and it was a Saturday night! Now let's move to the physical restaurant -- a neat bar, small, intimate, very \"Brooklyn hip\" without being douche, and a restaurant that is not overly loud, elegant without being pretentious, warm, inviting... we instantly felt very comfortable. (There is a large, outdoors back dining area that must be delightful in the summer.) Now... the menu. EVERYTHING sounded delicious... with the small-plates reading as inviting as the entrees. We shared an order of gougeres (small, cheese-filled puffs) and roasted brussels sprouts with grains in a harissa yogurt. Wonderful. The \"Frenchie\" salad was far more delicious than the simple detailing on the menu -- the bacon was hand-cut and perfect. Most of us opted for different steak/frites dishes -- the aged-steak was perfect and each of our meals came to the exact specification of what we ordered -- be it rare, medium rare, etc. We got what we wanted. The only disappointment was at desert... the spiced chocolate pot de creme with orange madeleines was insane... craving it now just thinking about it... but the house-made ice cream (that evening coconut) unfortunately had too many ice-crystals to make it stand out. That was the ONLY less-than-perfect aspect to this fine restaurant. Did I mention that the service was impeccable?  Attentive without being annoying. If you want a fine meal, an eclectic French menu, this is a wonderful choice.", "author": "Jon M."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}