{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "I must agree with the masses of others that this restaurant deserves a 4. All the food we had was good, we ordered the mussels, soup, steak  frites, and profiteroles. The service was very attentive. The tables are packed close together, so you'll be cozy with the neighbors!", "author": "Amy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "The minervois at $10 a glass is great.Loved the chicken liver pate.Sister restaurant is Butter Milk Channel, so you know things are done right. I had the Trout Po Boy but I think corn meal batter and fried would have made it tastier. The baguette was a little too hard, maybe they use same one for the lamb sandwich with the a jus. I think they need a different bread for the trout. My friend ordered the mussels which came in a white wine sauce which was delicious but not hot. Will definitely be back to have lunch and give it another try.", "author": "Luc B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Soooooo gooooood! Came here from Hawaii and Chef Souvi always rocks the grill! Highly recommended.", "author": "Joey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Excellent place for a fine dining brunch or lunch. (Haven't tried it for dinner.) It's mostly French-inspired with a modern twist. They have an outdoor area which is very nice.", "author": "Mary R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-22", "description": "Just not good. Trying to be French bistro with flair but it's trying too hard. Moules frites and steak frites should be the best on the menu at a French restaurant but steak was poorly prepared and moules were heavy, not fresh, and underwhelming. Also bavette was not bavette. Service was good except for food requests. No changes to the routine of the kitchen are allowed apparently. Also, check your bill. Charged for items we never had", "author": "Ryan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "Have been here several times restaurant week and not.  So disappointed tonight.   Service indifferent at best.  No attempt to ask or answer questions about menu.  A parade of staff walking back and forth.  Main dining room pretty empty at 830 on a Sunday eve garden somewhat busier but not mobbed. \n\nWhite asparagus soup for 15$ and not even a full bowl with minimal asparagus flavor.  Anchovy frites excellent.   Ordered moules and frites.   The moules nice and fresh but barely warm.  But the real killer is the complete lack of interest in the part of wait staff.  Completely disengaged from customers. \n\nSadly, taking it off the list.", "author": "Stuart K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "Worst service. Our waitress (dinner on 5/12) was nowhere in sight for most of the night (had to wait close to 45 minutes to even order our food) and we had to flag down multiple other waiters for anything.", "author": "Chloe A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "Tried French Louie for the second time. Not times underwhelmed. I had the steak frites and while the fries were good the steak was bland and flavorless. Was really looking forward to steak. First time was brunch and that was mediocre as well. Over rated and over priced.", "author": "Dean B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Came for Saturday brunch with a reservation, which is a must-have because the place was packed!  Tried one of the benedicts and the french toast.  Very tasty and impressed by the serving amount.  We're so used to leaving brunch hungry that it was nice not to for once!!  Great service too.  We will be back for sure!", "author": "Kathy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "The duck potatoes \u0026 chicken sausage was delicious. The trout was good \u0026 my friend loved his cheeseburger.", "author": "Safet F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "I had a fantastic meal here!\nDon't let my (somewhat) trim figure fool you-I love to eat...and as I just had a wedding and the holidays, I've been packing away some delicious food these past months.  Still, I can't remember the last time I had a meal I enjoyed as much as my meal at French Louie.  \nMaybe it was in the details, like the delicious white sauce, that definitely had mustard in it-yum, that the oysters came in popping yet complimenting the jam on the bread it's served with.  Or maybe it was the cozy, intimate interior, or that I was with wonderful company (my awesome husband!).  Or maybe it was that we weren't paying for the meal as we had compiled money we got from Christmas gifts from family to treat ourselves (jk it wasn't that although I'm sure it didn't hurt).  \nWhatever it was, this is definitely a new favorite of ours in the neighborhood, and although it's pricey, we're excited to come back....hopefully before next Christmas.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "French cuisine had always been on the bucket list, and the list of decently priced French restaurants keeps getting shorter.  However French Louie has been opened for a while now, and despite it's relatively high pricing, the value is still competitive.\n\nThe mood for dinner is primarily set for a romantic outing by candle light, however it can also be suitable for reunions, anniversaries, or even the underhanded business deal.\n\nService was very accommodating.  The food was excellent.  Highly recommend the Monk Fish and beet salad.  The foie gras is a little to rich in fat and should be served with baguettes as a spread to dull the saltiness.  \n\nYes, the food critque seems terrible but do not let that cloud your impression.  The food ghat was good was really good, and the food that lacked balance was really off putting.  No middle ground here.  Still give this locale a try, practical experience far outweighs \"expert opinions\".", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "As my fellow diners Jon \u0026 Alan B. said in their reviews, we definitely had higher expectations for French Louie. We expected nothing short of amazingness after seeing \"93% recommended\" on OpenTable. I liked my meal more than theirs, so I am ok giving it a 4* review. But nothing really stood out as amazing for this restaurant to make me come back.\n\nI think we all had the steak tartare appetizer, and I was very happy with the taste and portion size. Some restaurants don't have this kind of item on the Restaurant Week menu, and when they do, it's too small. This was definitely the highlight of the meal for me.\n\nI wanted to be healthy but ended up getting the steak frites entree. A generous portion of meat, but obviously not the best cut. Lots of french fries and a salad that went untouched on my plate (and on my dining companion's plate, too). Dessert wasn't that impressive, a chocolate flourless cake with cream? I don't know, I'm not a dessert guy.\n\nService wasn't bad, but it wasn't as good as I had the night before at Beauty \u0026 Essex for RW. If you're in the area, it's a solid meal for sure. But I wouldn't trek my way out there from Manhattan again. Sorry, Louie.", "author": "Rob P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-30", "description": "This spot had potential, a very quaint/comfy interior that lacked the pretension I was expecting from a french restaurant in boerum Hill  (really awesome neighborhood btw, give it a walk after coming here). My group of 4 was seated and the waitress started off by giving her suggestions from Restaurant week, and I began very pleased with my appetizer, the steak tartare. It was served with egg yolk and was a healthy portion. While I don't usually like raw beef this was well put together and prepared.\n\nHowever, after we placed the order I felt the service dropped, with the waitress hardly checking on us (I wanted to place a drink order half way through). The main entree I chose was not the best, a super salty pan roasted cod. My friend said he would have sent it home, I wasnt in the mood to.  After what seemed like a bit of delay to get the desert, It ended  up being a very small portion of mousse and flour less cake. \n\nMaybe it was just an off night for them, but I don't think I was wowed at all to make a return here. As my good friend rob likes to say, after finishing the meal I was \"over it\".", "author": "Alan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Prices may be high but the place is very good! We have been here multiple times for brunch and the friends we bring really like it. The restaurant has a nice feeling. The food is really good. My fiancee enjoyed the scramble eggs very much. I am a fan of their burger. We all liked their creme brulee French toast. My friends liked an appetizer pastry I cannot remember the name. And my friends ordered more fries because they liked them a lot.", "author": "Manuel Alejandro C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "A visiting friend from Florida selected this place for a Sunday brunch get together. Nothing particularly French-y to the interior or restaurant design. However, I love the feel and over all vibe of this place especially the back patio dining area and it's a stone's throw away from where we live.\n\nThe brunch menu seems intentionally small and Cordon Bleu immediately caught my eye; it's fried chicken served layered with benton's ham and mornay sauce. I was impressed by the presentation and the portion is unexpectedly filling, but unfortunately, it did not blow me away. I thought that the fried chicken coating was slightly hard when it was served to me and had to scrape some off to enjoy the chicken itself. \n\nWhile the customer service is awesome, with their price point, I'll probably scout around for a better brunch place in my neighborhood.", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "This place is under the radar but the food is top notch. My husband and I are food snobs and this place never came up until we went searching for a Friday date night spot in Brooklyn. What I also love about Brooklyn is that there is never that obnoxious 1-2 hour wait for a table on a Friday like those in the city. Every dish was delicious and flavorful. We started with the Watercress salad which was light and refreshing. I had the pappardelle with braised veal and my husband had the bavette steak which were both really good. We also the apple tarte tatin which was warm out of the oven. The best thing was that the meal was just over $100 for such a well prepared meal. Can't wait to go back!", "author": "Queena T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Went here for restaurant week, so they put a high emphasis on aesthetics and it worked well for them. I had a pan seared salmon and a steak tartare that were both light, fresh, and satisfying. Chocolate cake served with orange was also a treat.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "While the food is delicious, it's heavy and the steak was not appropriately prepared. We got the sardines, mussels, 28 day steak, red rice, and chickpea pancake. While the sardines were good, there were only two of them. The mussels were in a heavy sauce that was a tad too heavy for my liking. The 28 steak was not prepared according to our request, and it was basically overcooked. Now, considering the price of the steak, I would imagine that the care for this meat would be better. The red rice was interesting as it was mixed with greens. The chickpea pancake was probably our favorite item on our table, and it was very original as well. The downside is the noise. In fact, the table next to us was so loud that my left ear was ringing the next day. The tables are on top of each other, and the couple next to us overheard us talking about the noise level. They agreed that it was unbearable. All in all, I have been to better French establishments in the area where food was prepared with more care and I was able to hear my better half.", "author": "Donna P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-01", "description": "RW review: NOTHING SPECIAL.. It's over rated and hyped. At least the dinner. It's more American food, French is only in the restaurant name. Steak I got looked and tasted like the one at Applebee's, no details to presentation. We ordered duck, which was over cooked and nothing special. Cauliflower soup tasted good and that's it. Desserts are basic and nothing special. I also felt rushed throughout the dinner with minimal breaks between courses.\n\nFood presentation: below average\nService: good \nFood taste: average\nAmbience: good", "author": "Sandeep L."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}