{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-25", "description": "We went here on Saturday, a party of ten.  2 stars says a bunch of things were poor....\n\nThe service at the start was haughty.  My friend, in his late-20s, much younger than the average customer, a little scruffier than the average customer, arrived early and was told to wait in the vestibule in a way that made him feel out of place.  As we arrived, we had to wait there too till the table was ready, 25 minutes later than the reservation.  \n\nThe food was mixed.  There's a lot of salad, steaks and frites there.  And none of the above were really good.  I was sat between two vegetarian women, one had the sunchoke soup, I tried that too and it was great, the best thing there.  The other ordered fries and salad, and both were lame.  She left both and the waiter did not ask if there was any problem as he took the still-full plates away.  The fries are so thin that once they're cool (and they were half-way there on arrival) it's just a bowl of thin chips.  The salad was mainly big ugly leaves.  And the steaks, they were just OK.  Fine if they'd been served in a hero at a local bar.  \n\nBut French Louie is charging $30+ for entrees, add more if you want sides with them.  At those prices, they're inviting comparison with great restaurants, with craft or market table.  And French Louie is way short of great places in every department.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "I went there for Valentine's Day dinner, and the food was AMAZING!!!! it was beyond my expectations, very well mannered staff. I had the bittersweet chocolate gateau for desert and my partner had the blood orange cheesecake, absolutely mouth watering. Well worth it for the price paid.", "author": "Meghann B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Had to write a review after spending a lovely time here with some old colleagues. The interior is beautiful and well sized. Server's were very attentive and the food came out relatively quickly. This was impressive seeing as it was full on Saturday night dinner at 7PM so bonus points for that.\n\nI ordered a whole fish entrée which was outstanding but I also could've just eaten the side of french fries and be satisfied. They were crunchy,thin, and well salted. My friends got everything from the Linguine to the Steak tartar. We ended up picking off each others food so I'll speak for them and say EVERYTHING WAS DELICIOUS.\n\nWill surely come back here for Brunch next time.", "author": "Triston K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Came here without a reservation on a Monday night around 7-8pm. The dining room was full, but the staff offered us the option of sitting at a small table in between the dining room and bar area, which was shared by other diners. \nThe ambience here is dimly lit, simple and modern. The service was polite and efficient. We decided to have the tuna and le grand socca for our entrees. The entrees were served shortly after we ordered. My boyfriend was happy with his tuna dish, although the serving of tuna was on the smaller side. It was accompanied with cauliflower, and a sauce that was delicious. \nI was also happy with my entree, le grand socca. It consisted of a large piece of flatbread made from chickpeas, with hummus, radish, green salad, and pickled vegetables. The flatbread had a strong chickpea flavor, and went well with the pickled vegetables and hummus. The edges of the bread were a bit hard though. \nWe enjoyed our dining experience here and would gladly come again.", "author": "Su L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "One of the bet spots in Brooklyn - definitely my favorite brunch in Boerum Hill. \n\nThe indoor area is cute, but the back garden is magical (on an nice day, of course!) \n\nFor dinner, the steak frites are incredible. I'm not usually one for fries, and I never leave a single one behind when I order this. \n\nFor brunch, get the socca! It's a chickpea based pancake with an egg and tasty cauliflower salad on top. I typically also get the buckwheat ricotta crepes to share with the table, because when brunch I like a few bites of sweet. The avocado toast is also great, and if you're gluten free they'll put the avocado mash and toppings on the socca chickpea pancake because that doesn't have gluten. I would order it that way for fun without needing to avoid gluten because the socca packs in interesting spices. \n\nTry to make a reservation though because there is typically a wait!", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "More impressed with brunch than dinner here (taken into account the price). The outdoor seating is very relaxing and less noisy. Every dish - eggs Louie, French toast, or the side of potatoes and cappuccino - although simple and traditional, is executed amazingly well, with a touch of their own spin. The Eggs Louie are served on a croissant - a perfectly crispy one - and the crab flavor is in perfectly. The French toast - crispy on top, soft inside, served with delicious huckleberry jam, and isn't too sweet - was delightful. The potatoes were crispy, well seasoned, flavorful and not too starchy. Service was fast and friendly. Plus it's possible to get a reservation ahead of time. Will be back!", "author": "Lucy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Buzzin! A fab little spot. We went there in a larger group and the staff were so accommodating. It's a busy place and has a great vibe, really nice waiter who gave recommendations and had a laugh with us. Plus were super nice when I managed to end up sitting in a puddle of coffee \u0026 one of our party got lairy on too many bloody Mary's!\n\nOn the food front, I had the Eggs Louie, it was tasty but small. Another diner had the French toast crepe thing.. was yum! Most of our table had scrambles and again, all were small (eggs were in little cups) so we ended up adding on some fries and a cinnamon patisserie 'item' - so descriptive today! \n\nIt's a lovely spot here, would definitely return, just with a smaller appetite.", "author": "Lele S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "Very charming place for lunch/brunch with a backyard patio that would be perfect for al fresco dining. Love the menu, it has a little something for everyone so it's a crowd-pleaser. \n\nAvocado Tartine is an awesome version of avocado toast with the addition of pickled green tomatoes (I love a good punch of pickle) on really great bread piled high with avocado, which almost justifies the price tag. Order a \"le socca\" or two, I've never had one before and LOVED it. Savory thin chickpea pancake loaded up with toppings, both versions are delicious. Can't go wrong with the burger royale either, and order an extra side of fries bc they disappear fast. Skip the grilled trout po'boy, it was pretty fishy and the bread was too hard. The s'mores profiteroles were a fun way to end the meal, who doesn't like ice cream? Profiteroles are always a mess to eat, but I'm not even mad that I got sticky caramel chocolate sauce all over my spoon and hands because their version with the smoked marshmallow was worth it. \n\nBonus: if you're lucky, the secret in-house-artist/unidentified employee will draw you a French Louie on your takeout bag. Make a reservation and your brunch friends will love you for it.", "author": "Lillian Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "We had brunch here, 5 people. Quite a nice place, the air conditioning needs to be stronger though. We ordered fried chicken, egg Louie, French toast, mimosa and etc. Fried chicken really had a lot of food, French toast also had a large portion, it is soft and creamy. I highly recommend egg Louie, it has pitched eggs, croissant, and very fresh, soft vegetable", "author": "Xinrui Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "The food was everything I hoped for and more. Delicious. All of it. Great music selection for the ambiance. The wine was tasty and I would have had an entire bottle but it was a week night. I got a customized bag for my take away Dessert which was adorable. And the staff was sooo nice :)", "author": "Tashay G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "I brunched at this place and it's a great find - takes reservations, large space with outside seating, and great food. We each tried different dishes and shared the creme brûlée French toast. I loved my Eggs Louis because someone finally realized croissants are much better then English muffins. My friend's avocado tartine looked like the photos and something I'd try next time. The trout po' boy was so pictured we opted to try that, too. Although my friend was happy with it, I would be disappointed by how hard the bread was \u0026 the quantity of bread (too much).\n\nSadly, service is slow and flagging staff is a challenge but if you aren't in a hurry or have friends with you, it works out. We were also presented with the wrong check and that had to be corrected.", "author": "Urszula P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-21", "description": "On my last business trip to Brooklyn, we decided to try French Louie. It has a great menu and every item we tried was made beautifully. I recommend the Lamb but I could have had almost anything on the menu. The service was excellent as well. It was a relatively casual place with truly fine dining.", "author": "Gibb S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-30", "description": "Let me start on the Good Foot -\n\nHands down the Music in this place is all the way 5.  I am an old soul trapped in a young body, and being in an establishment that can appreciate classic Motown artists has gained some respect from me.\n\nHOWEVER, as quickly as I was to give my respect to the person responsible for his great selections, he gave me his back, and that was the owner.  I asked to speak to him, but he was uninterested in what a patron wanted to speak to him about.  So that was a negative experience. But Ellen, whom I suppose is the restaurant manager is what brought me back a second time.  \n\nNow as for the Food-\n\nThe mussels normande come in this phenomenal sauce, that has you questioning what the hell is in it, and tops off your taste buds with an amazing apple butter sauce on bread (unfortunately, its only 1 slice of that goodness). That apple butter took my mother back to better days after the first bite. \n\nThe Merguez Linguine - did not hit on any level, and I had to have it remade because the first bowl of noodles were hard and not cooked through.  \n\nThe Bavette steak, was just okay, could use some steak sauce for the dryness.  They do have a slightly tasty in house sauce they will offer you on the side when requested, but it doesn't beat A1, sorry. \n\n...and, Drinks, well...\n\nThis second visit, might be my last visit for a while...the bartender, Jeff was the icing on the cake...this guy turned his back to me when serving me my drink, but aside from that, he served me a cocktail with a fruit fly in it.  Who does that?!  Take some pride in your work.  Every patron, and I mean EVERY ONE of all SHADES deserve the same treatment.  Remember you are in the Customer Service line of work.  And my $$$ is just as flowing and green as the next.", "author": "Yasmin R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-31", "description": "This is my 2nd visit to French Louie this time for restaurant week. Can't say I had the best experience nor was it awful. The food was hit and miss. The pate was delicious. Creamy and full of flavor. The escargots was great. Awesome sauce and great combination of flavors on the plate. Steak tarte was good but slightly underseason. The duck confit was pretty good. The meat fell right off the bone and the skin was nice and crispy. The Steak frites was nothing special. The Steak was very average and the fries fried nicely but to salty. For dessert the lemon cake actually tasted old and stale. Bread pudding was average. Now for the service. Not great. They were attentive but not friendly at all. I sensed snootiness.Our first server seemed to get upset with how we ordered and not specifying it was the restaurant week prixe fix. We also was never asked if we wanted go order drinks. In mid meal we changed to a different server. Again not friendly at all. She told us our choices for dessert was a lemon cake and chocolate gateau. We order one each. When it came we got tbe lemon cake and a bread pudding. When we told the runner we were suppose to get a chocolate gateau she said no you order bread pudding. It wasn't that big of a deal so didn't want to argue. When the server came with the check we told her you gave us bread pudding she said \"oh yes they just changed it.\" I think the right thing was she should have informed us and make sure it was ok. It was almost as if since it was restaurant week they'll just get what we give. There was no care what so ever. Also, when I told her the fries were too salty she hust said ok. No apology nothing. During the whole meal no one came to check of us. They did do a good job clearing the table. Also the food was a bit of a wait between courses.", "author": "david l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "Went to lunch on a Friday afternoon. Service was excellent! Very intimate setting, and casual. Very cute for lunch! \n\nWe had the pickles appetizer and I had the tuna steak salad it was perfection! My boyfriend had the avocado toast and he loved it! Definitely will be returning to try the rest of the dishes!", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "I was pretty happy with my brunch selection of French Louie, as recommended by my Brooklyn buddy, Pete D. I made reservations a couple weeks out and a table was ready for us when we arrived. The restaurant is bright and airy and has a beautiful outdoor patio. Our server was fantastic and all of the serving staff seemed to be working together in harmony, filling waters, taking drink orders when needed, etc. \n\nWe started with the Everything Mary which was very solid. There were so many delicious-sounding options for brunch that my husband and I decided to just share a bunch of plates. To start, we went with the Frenchie salad and avocado toast. Both were delicious and a great, not-too-heavy start to the meal. \n\nThen, we went on to share an order of the cordon bleu. Oh boy. We probably should have thought more about this decision as we had just spent the previous night sampling chicken wings all over Brooklyn. This plate is definitely best when shared as I can't imagine how anyone could eat an entire plate on one's own. It's super heavy and dare I say a little too rich. I love fried chicken but probably wouldn't order this again. \n\nOverall, really enjoyed my experience at French Louie for brunch and would like to check out dinner sometime.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "INCREDIBLE, adventurous food. Amazing. Super exciting menu. Winter foie gras dish was my favorite dish. Best food in BK.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Loved the food and drinks. Steak tartar was fresh and well seasoned. I also ordered cast iron roasted chicken and it was really good. Nice place to have drinks and dinner with friends!", "author": "Magdalena J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "This is my favorite brunch spot in Boerum Hill/ Brooklyn Heights area. The pastry of the day was divine! Brunch was fantastic, went back for dinner one evening unfortunately it was less impressive hence the 4 stars.", "author": "Kimberly E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "It was such a pleasure dining here on Valentine's Day. I got the squash Wellington which was très delicious. Squash wrapped in puff pastry with vegetables on the side. The staff were very sweet and we were able to be seated right away even without a reservation.", "author": "Racquel B."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}