{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "Found French Louie on a Friday night, when I was trying to find a new restaurant in the neighborhood that my wife and I have never been to, love this place!\n\nI was able to book a table last minute on Open Table for 7:30, we got to the restaurant about 30 minutes early and they were able to sit us, which was really nice.  The ambience was very nice and apparently they have a nice backyard patio that can also host large parties.  \n\nNice wine selection so I got a glass of Bordeaux, the menu had great French options to choose from.  We started off with the watercress salad, which was very refreshing.  I got the Bavette Steak Frites and my wife got the Sweat Pea Pappardelle, you really can't go wrong with anything on the menu.  A really nice dinner that anyone can enjoy to be quite honest. \n\nI'm planning to come back and try to place for brunch, Buttermilk Channel is a sister restaurant so I would assume French Louie has a pretty good lunch as well.", "author": "Shad B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Stopped by there for one of our regular Saturday's brunch. They have the amazing outside patio with flowers and tons of natural light.\nI got crab croissant, and my boyfriend ordered grilled trout on a baguette. The food was amazing! Fresh, tasty, and delicious. The only thing is the baguette was pretty \"rough\", but that is ok for French bread:) The service was also pretty good, both our waitress and hostess were friendly and helpful. I'll definitely be back, and highly recommend this place to anybody.", "author": "Alena B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "I've only been here for brunch a few times, and the food has always been fantastic. Eggs Louie (eggs benedict with crab on a croissant, comes with a small salad) and the creme brulee french toast (with whipped creme fraiche and berry compote) are definitely standouts. French fries are extra-crispy, but the duck fat potatoes were underwhelming and the taste of green onions overpowered the richness of the duck fat. \n\nThe only thing knocking this down from a 5-star rating is the service and wait times - so come early! It took about 35 minutes for our food to come out.", "author": "Ann Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Came here with my co workers for lunch. Great atmosphere as we walked into the restaurant. The servers are awesome and helpful. I got the steak frites medium. It came with fries and salad. The servings size was nice for the sides. The steak itself is what you could expect. Overall the food is wonderful. My coworkers got the burger and they were fat and juicy. The fries and salad were a nice side to go along with the meal. Overall I would definitely come back. Maybe give that 28 day dry steak a try that cost 40$.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "Outstanding. An amazing brunch, with one of the best bloody Mary's I have ever had. The Everything Mary. The vodka is flavored with all the good stuff that's on an everything bagel. Insane. And it wasn't too spicy as some Mary's can be. \n\nMy friend and I both had eggs because brunch. I went for the eggs Louie, which is little strips of croissant with an over easy egg and pimento sauce with hollandaise. Just the right size to be filling and not overwhelming. It was fancy resto brunch not diner brunch. Quality over quantity. Yum. \n\nThey serve counterculture coffee. \n\nWaited only about 15m to be seated on Sunday at 1, and the hostess was really on top of the waiting list and super friendly.", "author": "Claire F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "My fiancé and I went to brunch this past Sunday and we arrived as the brunch crowd was winding down, which was great as the restaurant thinned out. The food was delicious, we had the fried chicken cordon blue and the smoked trout scrambled eggs. The bloody marys and bloody marias were also delicious.  However, as the brunch crowd was coming to an end, the staff started prepping and having meals in the back part of the restaurant. They also started sweeping the floor between the tables, which we found a little unprofessional. We're both ex restaurant workers. I also noticed someone who seemed to be a manager ask a waiter to speed up a table or ask what was taking them so long. All in all the experience was nice, but we could have done without watching the staff eat their meals and do their side work.", "author": "Sunita S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "I love being able to go to a beautiful place and know that the food and service will be amazing each and every time. The reliability and consistency matters and is greatly appreciated! Thank you! The duck is always perfect -- you can tell how much your chef cares about everything. I've been to FL about 6 times now and it's basically my new favorite spot.", "author": "Kristy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "Steak Tartare- Great\nSnails - Really really Great\nMussels- Good\nAnchovie Frites- Great\nDuck Breast- fucking awesome\nCod- Fucking awesome\nSteak Bavvette- really good\nTrout- fucking awesome\ngnocchi - not traditional but still really great\nMerguez Pasta- great\nSmore profiteroles w/ pine ice cream- really great\nDrinks were meh- drink wine.\nService for a 7 top- exceptional \nThe end.", "author": "Thomas D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "One of my favorite restaurants!!! Delicious, interesting food, beautiful ambience, etc etc. My one critique: went there for lunch yesterday and got the grilled trout po boy. The sandwich is served on a long baguette that is nearly impossible to cut through-- so hard! This makes it really messy/unfun to eat. They should really cut the sandwich in half in the kitchen, or use different bread. It was just kinda icky to get all the remoulade on my hands and squish the trout as I tried to saw through the sandwich.", "author": "Karen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "Wow! What a lovely place. The Fried Chicken Cordon Bleu was spectacular! My wife had the French Toast which was awesome! \n\nService? 5 Stars\nKichen? 5 Stars\nAtmosphere? 5 Stars\n\nThis was the best brunch I've had in years. Don't walk, run.\n\nShout out to Rezeta and Doug! Thank you!!!", "author": "Peter T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "It was our anniversary and I called ahead to make something special as a surprise for my wife.  I wasn't specific about anything other than mentioning it was our anniversary. The restaurant did an awesome job as they gave us a great table, mentioned our anniversary (points for me with the wife) and treated us really terrific.  Oh yeah, and the food was spectacular.  Really well prepared and thoughtful dishes.  The prices are super reasonable for the quality of the food, talented chefs preparation, and artful presentation.", "author": "Don S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "I throughly enjoyed my meal here. I came with a small group for restaurant week where I had the steak tartare, Le Grande Socca (chickpea flatbread), and pistachio parfait. I was looking at some of the reviews previous to mine saying it was nothing special, but I was amazed. The only thing I didn't enjoy as much was the chickpea flatbread mainly because I didn't like the flavor of the squash (that was just me personally). The steak tartare was delicious and the parfait I could distinctly taste the pistachio. I tried the steak from someone else's plate and I thought it was the best I'd ever had. I would definitely recommend it, despite that I didn't get the dish! And of course everything was beautifully exhibited as you can see from the pictures.", "author": "Lili V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "Cute little place. Tried their burger, mussels, po boy sandwich and potato and leek soup. All were very delicious except the mussels were a bit too mustardy for my taste. I would recommend going here if you are around the neighborhood. (No need to search it out).", "author": "Soyung K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-21", "description": "I probably wouldn't be writing this review had I been able to try the food but we left before we got seated. We wanted to sit outside and the host rolled her eyes and seemed annoyed that we were willing to wait, even though there were tables open. After a while I called for her to check and she blatantly ignored me and kept walking. Another server over heard my call and when I asked for him to get the host to check the time he said \"no, you can\" and turned away. That was when we decided to walk out. \n\nJust rude.", "author": "Meghan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "I love this place so much. I have only been here for brunch and lunch -- but after trying nearly everything on the menu, you cannot go wrong.\n\nThis place is packed for brunch -- so be sure to get on OpenTable and make yourself a reservation. Once you get there -- you will have to navigate through a little bit of stroller parking -- but worry not -- it is all worth it!\n\nStart off with a Bloody Maria (tequila instead of vodka) - and begin to peruse the menu of wonderful. My last outing I decided to be a day of decadence -- so my partner and I went all out. We ordered all of our super favorites: \n\nPersimmon and Endive Salad -- Fresh and delicate \n\nAvocado Tartine - the pickled green tomatoes make it explode with flavor and the eggs are always cooked to a perf medium.\n\nEggs Louis - Poached eggs over a crossaint with crab hollandaise. OMG. Always consistent, delicious, and decadent.\n\nSteak Tartare - perfect portion, so flippin fresh\n\nAnd then some more Sweet Action on tap.\n\nService is always solid, friendly and welcoming. The bartender let me try some Bison vodka -- and it is actually delish! I might get a cocktail with it next time.\n\nSee you all there.", "author": "Jaclyn V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Nice patio and friendly staff in French themed bistro.\n\nI had a nice 12 oz. 28-day aged steak along with a French cab/merlot. We started with two different oysters and a gruner veltliner. Interestingly the gruner was from the finger lakes and was the only wine by the glass that was not French. \n\nThey had a nice cocktails and beer list. \n\nThe wait staff were very friendly.", "author": "Lucas B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-20", "description": "The brunch I've had here is great. Love the ambiance, music selection(SO MUCH YES), staff (for the most part other than one bartender that was super unfriendly). We live in the neighborhood and have been here loads.\n\nUnfortunately the dinner menu hasn't been up to par. We've ordered a good portion of the menu and a lot of it is great. However, two times that we ordered the buvette steak it's been weirdly prepared. It was almost like the meat was boiled and was chewy vs having nice charred edges. We always order steak meadium/rare and both times it was uniform color all the way through. I've also noticed the quality of the dishes the last two times in general weren't what they used to be. My other main complaint is the burger IS NOT ON THE DINNER MENU. It seems like a given that if you have an amazing burger that should be on the menu all day.. no?\n\nI'll be back once the burger is on the dinner menu. :)\n\nbrunch = good\ndinner = ok", "author": "S L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-21", "description": "Food was good but our server seemed miserable and it made for an uncomfortable dinner. I went for my birthday and it was disappointing and tense. We were seated and then ignored for 10 minutes without getting water or anything. Questions about the menu were met with annoyance and fuzzy info. I had been looking forward to dining at French Louie for a long time, but can't imagine returning. For the price range, the service was completely inappropriate.", "author": "Jackie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "Food was top notch,  price was reasonable for the exceptional quality,  service was absolutely perfect.  It's rare that I can't think of more to put in a review,  but this place just nailed it. \n\nThis is one of my favorite restaurants in Brooklyn now- I'll be back.", "author": "David C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "Boyfriend and I came here for brunch on a Saturday. Unfortunately, the server we had was horrendous and took forever to bring our food. The food was delicious but our experience was disappointing. Our server didn't even apologize ‍", "author": "Rosie G."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}