{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Great food, great service.   This feels like my personal cheers.  Every dish I've had is GREAT.  They prove that Brooklyn must be the new Manhattan. I LOVE THIS PLACE!!!", "author": "Gilbert P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "I ended up here during Restaurant Week just by chance. I was impressed by how many choices there were on the Restaurant Week menu (and the great price). I chose a salad to start and the steak frites. It was all very delicious. The space itself is very cozy. Dim lights, nice ambience. I had dinner with my dear friend, but this would be a great romantic dinner spot too.", "author": "Heidi D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "I live in the area, so I'll be nice. If you like dijon mustard soup, then order the muscles and french fries. If you like eating an entire piece of fat and you like spitting into napkins all night (disgusting that I had to do this in front of my date) then order the Lamb Chop. The place is beautiful, outdoor area is great, service excellent... but I would never pay over $200 for a meal (for two) like that again. Shame on the cook.", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Great brunch spot that takes reservations and the Socca is gluten free (without the freekah)! Highly recommend!", "author": "Katy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "So cute! Came for brunch - can't wait to come back through for dinner. Got the Louie breakfast with crab and poached eggs on a croissant - so light and flavorful and delish! Also had the everything bagel infused Bloody Mary which was a great addition. Everyone I was with had a couple entrees and cocktails and everyone left happy. Had a bite of the French toast which was also SO good!", "author": "Jamie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "I'll keep things short - interior small and chic, food is delicious and savory, but small in portion. Bill comes out big. All-in-all, worth it for a romantic dinner with your significant other or a scrumptious lunch with a close group of friends.", "author": "Hao H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "It was a long wait for brunch (they'll take your number thankfully) but worth it for the quality of the food. Had the buckwheat crepes, avocado tartine, trout po boy, mushroom egg scramble and the socca (chickpea flatbread/cauliflower/freekeh).\n\nEverything was great, though the avocado tartine was probably the highlight and the chickpea flatbread the most interesting.", "author": "Ramesh D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "Make reservations for this stylish and romantic little restaurant. I came on a Wednesday and luckily had reserved a table - unlike the many people turned away at the door. There is a small but well appointed bar at the front where you can wait for your friend/date with an expertly mixed drink and a narrow jewel box of a restaurant with an airy back patio. The interior is reminiscent of a French bistro with narrow tables and mirrors but updated in a modern white. \n\nNow on to food! We started with a selection of briny east and west coast oysters - they were tasty but we were told the east coasters were from two different places, which was confusing - I also didn't like that the ice was melting so much that the oysters were capsizing! Next we tried the snug harbor greens - a simple green salad well dressed. Finally, we shared mussels and an order of fries. The mussels had merguez in them, making them very rich and the fries were thin \u0026 crispy as I like them. \n\nAll of the food was really high quality and prepared with expertise. It's also useful to note there are several vegetarian options on the menu as well as steaks so you can suit most tastes here! Downsides are few, but it's quite expensive, we felt a bit rushed, and it's a small space. \n\nOverall, a delicious and well done meal!", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Perhaps you've heard of a popular eatery called Buttermilk Channel? No? Well, it's THE brunch place in the area, but some people like me were getting too lazy to walk all the way down there. Thankfully, it's like the owners heard my thoughts, and opened up a spot less than a somersault away from my apartment. Yay!\n\nThere's nothing to complain about here, expect the smidge of a wait on weekends for brunch. But otherwise, it's all gravy (and biscuits)! There's your typical heavy French options, with lighter fare as well, and A+ drinks to ease you into whatever kind of meal you wanna have. For example, I could chow down on some steak frites if I'm hungover, or have a fluffy scramble with sparkling water post-yoga. \n\nFood is great and perfectly portioned. Servers are sweethearts. Also...the atmosphere is adorable. Great for a cozy winter night in.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "I've been to French Louie 3 times - once in 2014 for wine \u0026 steak- cooked to perfection, paired with a red so delicious that I still remember it 4 years later. Twice for a drink with my friend at the bar, and third for my birthday dinner last night.\n\nThe entire experience was phenomenal - the staff knows how to give you a prime birthday experience. Mack (the FOH manager) and our server were attentive to me \u0026 my guests by constantly refilling our glasses of bubbly \u0026 water, pairing blood orange sorbet with our store-bought cheesecake, and letting us linger after our meal for a bit to digest.\n\nFood - \n1. Smoked sardines - I loved sardines from a can as a kid, but haven't had them since my elementary school graduation. These are adult sardines - huge chunks of fish to go with crusty bread and some fragrant butter.\n2. Anchovy fritters - Holy shit, the crusty lemon they serve these with blew me away. I didn't even know I could eat a lemon whole. I wish there was more fried lemon. As for the anchovies, they were good too. But something about that lemon added a bit of je ne sais quoi to the dish.\n3. Mussels - These were finger-licking good. I hate people that slurp at the table, but I couldn't help myself this time. Don't waste a single bit of the sauce that covers the mussels - they give you some delicious apple butter toast to prevent this sacrilege. \n4. Seared foie gras - The star of the show. We ordered two. One for the table and another as my friend's main course. It's tiny, but don't let the size fool you - it's essentially an animal's fatty liver disease, so it's rich enough to not need more of it. But I wanted more. My friend was onto something when she ordered it for her main course. Can't stop thinking about the spice cake \u0026 huckleberry jam it came with - everything about the salty/fatty/sweetness of it is gonna follow me for the rest of my life.\n5. Duck Au Poivre - Damn. The peppered crust. The portion alone is impressive, don't let the pictures on Yelp fool you. Just get it, trust me. \n6. Blood orange sherbert - They were onto something with this seasonal treat. Went amazingly with our plain Junior's cheesecake. I'd love to come back and try their other offerings!\n\nIn conclusion, 100/10 experience, go wine \u0026 dine in ambiance \u0026 hospitality.", "author": "Anna N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "ALWAYS A DELIGHT!\nWe've dined here many of times and it is always excellent! Food - Scrumptious Service - Completely on point Ambiance - Perfect for meeting friends for your monthly brunch get together. not much more to say we they are consistently excellent", "author": "Helena L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "Don't miss out on restaurant week 2016 at French Louie! $38 for a three course dinner. The restaurant was packed on a snowy Friday evening buy the service was remarkably relaxed and friendly. They have a nice cocktail menu and a good selection of wines and beers (try the sour ale)!\n\nAppetizers: the butternut squash soup was fine but the mussels were outstanding. This is a GIANT bowl of seafood and the mussels themselves were plump and juicy. The mustard cream sauce they were served in was excellent.\n\nEntrees: the steak frites was a large, filling portion and the steak was nicely cooked. What really made this dish shine, however, was the incredible house steak sauce. Make sure to ask the waiter for this! The trout entree was also nice and the bread salad it was served on top of was very flavorful.\n\nDessert: the cheese was okay but the profiteroles were a better choice. These little morsels were drenched in a caramel cardamom sauce and were a great way to end a lovely meal.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Backyard is great, perfect for summer.  Service was solid.  The food just wasn't great with exception of escargot.  Smoked mackerel had no smoke taste. Lamb was pretty fatty (fries were great).  And snap pea salad ($15 by the way) had basically vines in it. They gave us a steak knife.  For the salad.  \"I've never had to fight my salad,\" my wife said.  So much promise, we probably won't be back,", "author": "Jason F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "Just like at the other restaurant run by these guys, the super popular Buttermilk Channel, brunch here was excellent.\n\nRecently started this summer just in time to coincide with the good weather, brunch is a great time to visit to enjoy the beautiful backyard seating area. The menu is pretty small, so we didn't go crazy, but the choices are strong:\n\n- Chocolate-Almond Brioche ($4)\nThis was a really excellent pastry to begin the meal with. Served nice and hot, it was so buttery and much more chocolatey than these breads usually are. Make sure you start with this for a very satisfying appetizer.\n\n- Creme Brûlée French Toast ($12)\nThis is a great idea - the crackly, crispy texture of creme brûlée on the outside and the smooth, whipped interior go together very nicely. Maybe slightly too eggy, as the inside was borderline liquid smooth, and it barely resembled toast, but it was still tasty.\n\n- Thick-cut Bacon ($6 for 3 strips)\nVery thick indeed, this was an excellent plate of bacon that provided some much needed meat to complement the sweet of the french toast.\n\n- Burger Royale ($17)\nNot a fancy pants burger, but rather a very fancy Big Mac. The thin patty might have you concerned at first, until you realize there are two of them. It turns out that this was one of the best burgers I've had recently. The meat was shockingly juicy considering how thin the patties were, and the bun was nice and soft. Not only that, but the fries were excellent too - very crispy and well-salted, making you wish there were more. Make sure you come for brunch so you get to try this burger.\n\nI would have liked to try some dessert, but I'm not sure if there was anything as we were not offered any. Other than that, service throughout was good. Definitely make sure you request a seat out back when it's nice out. The food was good enough that I definitely wouldn't mind returning to check out the dinner menu.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-28", "description": "I came here with my cousin for Jan/Feb 2016 Restaurant Week (lunch)- I ordered the Steak Tartare (egg yolk, chile oil, and pickled mustard seed), salad niçoise socca (chickpea flatbread, rare tuna, olive aioli, soft boiled egg, and salad greens), and the profiteroles (vanilla ice cream and cardamom caramel). My cousin ordered the snug harbor greens (banyuls vinaigrette and torn herbs), grilled trout po'boy (remoulade, red cabbage and fennel slaw on a sourdough baguette), and the profiteroles (vanilla ice cream and cardamom caramel). \n\nAfter studying through the RW menu, reading countless Yelp reviews, and sifting through delicious photos of food, I was thoroughly convinced that I would have to try this place. Everything on their RW menu looked very appetizing and I had a difficult time choosing what I wanted for my first and second course. The third course however was going to be an easy one. You have a choice between the profiteroles or something called \"Nancy's Camembert\" (rye ficelle, huckleberry jam and endive), which hands-down I was definitely going to choose the profiteroles. \n\nAs for the first and second course, I thought the best thing to do would be to just order whatever would normally come out to be the most expensive, as I would maximize on my savings. Honestly, had I gone with that strategy then I would've ordered the steak tartare and the moules frites. However, for some reason, I decided to get the salad niçoise socca which turned out to be the worst mistake. At the time that I arrived at the restaurant, I skimmed around the dining room to see what the other patrons were ordering. Two women sitting next to me had ordered the salad niçoise socca. It looked appetizing, and on the normal lunch menu the salad would've been a pricey $16. \n\nI started off with the steak tartare, and it was good. I wish; however, that they served the plate with a few more pieces of toast. As other people started on their second courses, I saw how delicious the po'boy trout looked as it was coming out of the kitchen. The moules frites looked even better. At that point, the salad niçoise socca looked like rabbit food, and I was becoming regretful. It was too late to change my order. The second course arrives at our table and I immediately made a sad face. Thankfully, my cousin gave me a piece of her trout po'boy because the salad niçoise socca was not good. I didn't even take a photo of the salad because I was so disappointed with the dish. There were 3 small pieces of rare tuna. Most of the mixed greens were rotten (on that note: my cousin ordered the snug harbor greens for her first course and most of the mixed greens in that dish were also rotten). The chickpea flatbread as it was placed under the salad had been soggy. This is possibly the worst dish a person could order. They should not include this on their RW menu if they really want to showcase their best dishes and have people come back (because isn't that really the purpose of participating in RW)? Had I not been able to taste the trout po'boy, I probably wouldn't have rated this restaurant has high as I did, and I probably wouldn't have come back. The trout po'boy really saved it. I would definitely still come back for the trout po'boy or for some of the other dishes that I didn't get to try.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "I be been here a few times before and it has always been good. Tonight was excellent. Amazing smoked mackerel app and trout main course. I've been to French Michelin star rated restaurants that weren't this good. Service was friendly and knowledgeable. Wine was selection was diverse and delicious. Also, reasonable. I was expecting the bill to be much higher.", "author": "David A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-04", "description": "Decided on the regular menu instead of restaurant week.\n\nBeef tar tar - good quality wasn't crazy about the flavor. Edible not outstanding.\n\nOctopus itself which I didn't get to snap a pic of was excellent but did not like the sauce. Hubby liked it.\n\nFoie Gras was on point.\n\nOysters well its oysters can't go wrong.\nWashington ones were awesome and plumpy.\n\nMains we had for the man a nice steak the dry age we asked medium requested it even be a little more rare than a little medium well. Almost perfect slightly more well on the outside sadly but very good. Salad and fries that came with were good too.\n\nMussels were excellent loved the mustard sauce overpowering as it might be. Hubby wasn't a fan of the sinus clearing effects. The sweet toast that came with was great too.\n\nFor dessert the 1st thing on the menu the 1 every1 orders is the 1 to go with. Nothing better than doughy gooey ice cream caramel drizzle nuts. It's ok if you can't pronounce the name order the munchkins lol.\n\nStaff was excellent and service did not disappoint. Very cute date spot.", "author": "Maya B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-20", "description": "I came here thinking I was going to taste the best French toast of my life for $12 bucks or even more - whatever I donno but it sure was pricey for having a thick piece of cube\n\nAnyways I sure did ask for some syrup because it was just way to dry for my taste....\n\nMy waiter barely even paid any attention to me and my", "author": "Bedor E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "Good brunch place. Have been there a few times now. Pretty much anything on the menu is good.\n\nThey are also welcoming of children, and cater to special asks for kids.", "author": "Ninad S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-02", "description": "Service wasn't as I expected to be. It's a very expensive restaurante but we ordered from the \"restaurante week\" menu, we didn't order anything extra besides the prefix menu so maybe that's why service was horrible.  The girl wasn't really giving us a good service, no water refill, etc\nFood was meh, well what I ordered was nasty to me,  the taste of everything wasn't good. I had a soup as appetizer that wasn't even hot. Place doesn't have a \"french look\" plus it was too dark and many tables in a small space. A little uncomfortable. I didn't like anything to be honest and won't go back again,  thank God I didn't spend more money.", "author": "Fernanda S."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}