{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-20", "description": "French Louie is a busy neighborhood restaurant with a modern French menu and a cute ambience.\n\nI wish I could give French Louie 5 stars.... and I almost gave them 3. I've been twice in the past month - once for lunch when it was quiet and once during brunch when it was busy.\n\nLet me start off by saying they have one of the best burgers I've ever eaten in a restaurant. SO juicy, flavorful, perfectly cooked.... and kind of cold. While I'm at it, the fries were cold too. And it took about 55min to come out of the kitchen. \n\nThey also have one of the most delicious salads, \"The Frenchie.\" Little gem lettuce lightly coated in a bright red oil laid over a healthy serving of delicious dressing which you discover underneath the lettuce. I love the composition of this salad because it allows you to have as much or as little dressing as you want. One suggestion is that the bacon is too crisp and over rendered, almost like little rocks.\n\nFrench Louie, I really like you and I want to eat your food all the time. But, please be faster and send me hot fries with my 5 star burger.", "author": "Katey G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-13", "description": "Great spot. Outside seating in the back is pretty. Bench style seating.\nI had the french toast Creme Brulee which was slamming. I wish that I wasn't hung over when I was there but nevertheless, it was yummy.\nI ordered a Bloody Mary to cure my ill and that was ok. Menu looks good and I will definitely go back for dinner and brunch again!\n\ngood for groups\nbar in front is a bit small but cute\nprices are in line with the hood $$$\nThey take reservations", "author": "Luis B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-09", "description": "Had a reasonable brunch here, but overall food was just OK and service lacked a bit given I suppose a crowded Saturday brunch load.\n\nThe space is long and narrow - bright overall and has a cool vibe - definitely one of the highlights of the neighborhood. \n\nI had the trout scramble and was surprised it was so small. Came in basically a small bowl - maybe a cup. Also, overall was pretty bland - could use a bit of seasoning like cheese or salt or something to bring up the brightness.\n\nAsked for extra crispy bacon and they really delivered. Bacon was great but overall wound up leaving honestly a little bit hungry and wish the portions were more substantial.", "author": "Bob K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "Wow. Wowowow, French Louie is ~lovely~. Easter brunch with my friend was simply divine. We made a 10:30am reservation and were seated outside. \n\nWe ordered mimosas, the crème brûlée French toast, avocado tartine, and some sweet fries on the side. I had seen Yelp photos of the French toast and thought it wouldn't be enough--hence the fries--but it was perfectly filling and bigger than it looks. The fries ended up being leftovers. \n\nThe French toast was delicious and a fun twist on the classic. Although the sugar was a bit burnt in places on mine, it had the perfect crack and crunch to compliment the yummy bread. My friend enjoyed her avocado tartine and said, quote, \"the pickled green tomatoes really set it apart with a fun tangy burst of flavor.\" NICE.\n\nOverall, this place is pretty dang near perfect. The vibe is classy, the backyard feels like an escape, and I'm sure you can't go wrong with anything on the menu.", "author": "Naomi D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-22", "description": "The brunch menu here has several items that I wanted to try. So far, I've knocked the Crème Brûlée French Toast off the list! At $16, it isn't cheap for what is basically 2 slices of brioche bread topped with a crispy sugar crust. The bread part was eggier and squishier (in a soggy kind of way) than versions I've had at other restaurants, but it was cool to try this here, and the ambiance is perfect for a brunch date or for catching up with friends.  \n\nHopefully, they will still have the Cordon Bleu and Burger Royale once it gets warm out, because I really want to come back and try those items while sitting on the patio in the back of the restaurant!", "author": "Nataly N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-21", "description": "Super cute and cozy spot for brunch with great (and surprisingly fast service), but the food didn't quite hit the spot.\n\nHere's what we ordered:\n\nAppetizers:\nRadishes \u0026 Olive Butter - The radishes were raw, fresh, and crisp, but they're served on top of tons of unsalted butter and sprinkled with a heavy hand of dried olives and salt. Wouldn't order this again.\n\nAlmond Madeleines - Fresh and warm out of the oven with a side of marmalade. They weren't overly sweet and paired well with coffee.\n\nMain Course:\nBurger Royale - The burger was pretty tasty and well seasoned. The fries were decent, but tbh, Shake Shack is more satisfying.\n\nCordon Bleu - The chicken was super tender, but flavor-wise, it was pretty bland. The prosciutto gave it a hint of salt, but maybe this is the kind of dish that's more suited for people who are hungover.", "author": "Sylvia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-09", "description": "A charming slice of the European vibe in Brooklyn. The restaurant has a cute back patio area that's worth a visit once the weather warms up. \n\nI visited for Saturday brunch and tried the merguez scramble: a delicious little pot of eggy goodness interposed with peppers and spicy North African sausage flavor. I also had a cocktail (Negroni) that was well-mixed and tasty. \n\nThe service in particular was standout. I felt very taken care-of by my server and tipped appropriately.", "author": "Evan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-10", "description": "Solid dinner in a beautiful, unassuming spot on Atlantic Ave. The menu is compact, with steak and seafood as the stars. Wine and beer selection is good - notably mulled wine, perfectly spiced!\n\nWe had the Bavette steak frites and Whole Grilled Dorade. Both come with nice sides - thin fries and fresh salad for the steak and citrusy mashed potatoes for the Dorade. The steak is made to order (so takes 25 min), well salted, and with a nice aioli on top. The fries paired well with the mayo and ketchup. The Dorade is large and lives up to the name - the full fish, lightly charred and topped with greens. Good size and flavor. \n\nOverall, there wasn't anything exceptional about the steak or fish, but both were well made, a solid spot for a dinner date. Tables are candlelit and for winter, there's a nice decoration of fir leaves.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "I went to French Louie with my girlfriend. It was a great date place!  We will be back. \n\n1st thing - it is French so service is SLOW. That is my only knock. \n\nFood is well prepared. We ordered oysters on the half shell. The minute sauce was spicy and garlicky. The girl friend and I split the roasted chicken and corn casserole. The chicken was well chicken. Nothing special but that casserole. OMG. I want to go back just for the casserole. I am not sure how they made it. It was crunchy yet soft.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-21", "description": "Pretty little place and good service, but underwhelming brunch offerings.  The radish and olive butter appetizer was confusing. Why so salty?  Where was the bread? It seemed like a waste of perfectly good butter.  \n\nBurger and Cordon Bleu were both decent, but nothing you can't get at 1000 other brunch places in Brooklyn. It's a cute place with good service, but nothing exciting enough to bring me back again.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "I've now been to French Louie twice, and each time was spot on! The first visit was for brunch with friends, and I ordered the cordon blue entrée everyone on Yelp! raves about... the one with fried chicken, ham, and succulent cheese sauce. And, if you are wondering, YES, it is THAT good! I would return over and over for that dish.  \n\nThe second time I visited French Louie was for a working lunch. For this visit, I really, really wanted the burger. However, everyone in my dining party was ordering salads, and I didn't want to appear like a hog--I mean, come on... a double patty! Ugh! Oh how I wanted it (look at other reviewer pics of it, and you will certainly have food envy). Ok, I'll stop now and get on with the story :) So, instead of the burger, I decided to go with the French Dip sandwich instead. I was a bit scared that it was going to be dry and plain, but it was far from that! It was super succulent and very, very tasty. In fact, I usually ask for mustard for beef sandwiches, but this one was so flavorful that it needed nothing else!! I wanted to slurp up the remaining gravy at the end, but, again, it was a work lunch... so I dared not pick up the bowl and drink it down like I normally would . =)\n\nNext up is a visit for dinner!", "author": "Scott B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-04", "description": "Much like a scene from Groundhog Day, Every time I go to French Louis, I have the same exact experience, never really learning my lesson.\n\nI really, really wanted to love this place.  The name is great, the location/parking situation is convenient, the staff is super friendly but at the end of the day, it is still about the food. And that is where I found them just very average.  And I say this having been here during restaurant week and non-restaurant week.\n\nThe mussels are decent but nothing really special.  They were definitely fresh but at the prices I'm paying, a little more than a handful would have been nice.  The Steak Frites I've had numerous times and every time they totally over salt it.  They cooked it well to exactly my level of medium but they dressed it with just way too much salt.\n\nWith a name like French Louis, you better come correct.  And they don't live up to it.  \n\nWill I be back?  I'm not sure.  Having just come back from France, I guess I've been spoiled.  Still, I've had better French food, even here in Brooklyn.", "author": "Alex L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "Awesome brunch today.  We had buck wheat crepes with creme fraiche and Eggs Louie, which was eggs Benedict with crab over a croissant.  This was the most amazing eggs benny I've ever had!  We topped our meal off with warm almond madeleines with orange marmalade, which was delicious.  Coffee is legit and service is super sweet.  Atmosphere is great with a nice array of 80s music playing, and our waitress was terrific!  Highly recommend!", "author": "Sharon W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "Have you ever had the avocado toast with pickled green tomato!!! My mouth is watering all over again.  Completely and utterly delish.  I was so upset that the tomatoes were finished.  I also had the white wine oysters .  I have to admit nothing I sampled was nothing but delicious.  The waiter was attentive and it was a good vibe just go have a cool lunch or to just hang and grab a beer.  Can't wait to visit again.", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "Visited French Louie with an old friend as a recommendation. Could not be happier with the service, atmosphere and of course the food. Whole night was fantastic and would recommend a visit to this lovely restaurant.", "author": "Mark T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "So glad we found this place!! Me and my wife were looking for a new brunch spot and we decided to give this place a try. WOW! We ordered the burger royal, eggs Louie and the creme brûlée French toast. Let me start off with the French toast; hands down the BEST French toast I've ever had!! It's not even fair. I can write a book just about that French toast and it still wouldn't do it justice. Just try it, and you will see what I mean. The burger was prefectures cooked and juicy, the fries were amazing, and the eggs Louie was to die for! To top it off the service was great. Everyone was polite and welcoming. But anyway....why are you still reading this review!!! Get over there ASAP and get that French toast!!", "author": "Charles A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-06", "description": "Our family came here to celebrate Chinese New Year's Eve, and we had a absolutely great time.  Food was great: the whole grilled fish was fantastic, my rainbow trout had a crispy skin yet tender meat, and my husband loved his steak.  I ordered a cocktail and was happy with the heavy dose of alcohol. The service was non-intrusive yet attentive.  Best of all, my kid was loving the burger on the kids menu and the desert that she generously shared with us (I mean, I paid for it after all?!).  So when Marie has a good time, everyone in the family has a good time!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-26", "description": "We came here for their Thanksgiving prix fixe meal last week so I can't speak for their normal menu but I bet it's awesome based on our experience.\n\nThe food was AMAZING - and they didn't skimp on amount of food either (while also not giving too much - portions were perfect). The turkey white meat was SO tender that even I could eat it and I normally have a really tough time eating white meat even when it's cooked well* (read: not dried out). [Side note: eating white meat usually comes down to a texture problem for me due to getting radiation to my mouth about 4 years ago.] So, basically, if I could easily eat that white meat, then you KNOW it was tender. They also had super interesting ideas executed perfectly - a squash soup with smoky mushrooms that reminded my boyfriend and me of Korean hobak jook (pumpkin porridge); a merengue-topped slice of pumpkin pie; and the best part of the meal - and an idea I want to copy, a cornbread stuffing that blew our minds!\n\nThey had a great selection of wines and our server was SO patient with my mom, who rarely drinks alcohol and only knows she likes Pinot Grigio. They let her try a few different wines. In fact, the servers were all super nice and attentive at such a busy meal. They also offered to check our coats since they were so bulky because it was 25° out.\n\nThe restaurant is super cute too. Low, romantic lighting. Little candles on the table. The bar area is up front and there's an outdoor patio out back that I'll definitely be hitting up come Spring! Plus, I need to go back and try the cocktails cus they sound delicious!!", "author": "Sahar N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "I had an awesome little brunch at French Louie!!! I ordered the gluten free avocado toast which comes on this amazing \"soca\" bread made of chickpea flour and spices. It feels like a fusion between a crepe and a pancake and it is delicious! The toast is also served with tomatoes, olive oil, fresh herbs and a soft boiled egg on top. \n\nMy friend and I sat in their back patio. It was such a nice day out and it felt great to sit in the sun! They have a big awning though so I imagine they can cover it up on really hot days. \n\nTheir drink menu looked incredible overall. I had some of their sparkling rose. I personally like really dry roses and this hit the spot for me!! \n\nI'd highly recommend French Louie for a great brunch. I'd personally love to come back for dinner as well!", "author": "Caitlyn C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-10", "description": "At a slow time during the day I went for a late lunch. 40 minutes after ordering the server had not been by my table once. Terrible service! The food was fine once it finally arrived, but can't get over that first impression of no service at all...", "author": "Hanna P."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}