{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-07", "description": "Ya know, when I wake up on a Sunday morning and want to grab brunch, I expect to have a great meal, maybe slightly over indulge a little bit and just enjoy the morning. It was a rainy morning last Sunday and so I really wanted to make the day better. A friend had recommended the food for dinner here so I thought, great let's go here. \n\nI ordered a Poached egg crab croissant. My companion ordered an egg scramble. A side of bacon, a side of duck fat potatoes. The taste? Fantastic. \n\nSo why the low rating? It was a breakfast for elves. Croissants aren't known to be scarce commodities that have futures contracts assigned to them, so why can't I have a full croissant on my plate? Why does it have to be half a croissant? Like literally half of a croissant. It's unheard of. Where did you find the miniature chickens to pop out miniature eggs? Were they actually quail eggs? Is that why I had to shell out $14 for it? Where did you hide the \"essence of crab?\" In the shrubbery added to the plate to attempt to fool me into thinking I got more than half a croissant and eggs from chickens infected with Zika?\n\nHow about that scrambled egg bowl. Was there 1 or 2 eggs used to make it? I know my dining companion was only 5 foot tall, but she can eat more than a single egg. Why did I have to pay $2 for each strip of bacon? Why $6 for a single potato chopped up?\n\nI would understand paying $50 for half a meal if I were living in Denmark, but not here. .\n\nI had to go to a local bakery around the corner after this meal and find the missing half of my croissant. They hadn't seen it, so I bought a full one there.", "author": "Sal W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Love this place!!! Definitely a neighborhood gem!!! We never had a bad meal here!!! Everything was so delicious!!! The only downside is the kids menu is not great, so if you got picky eaters, don't bring them here. My two youngsters hardly eat anything while we were there....so my husband and I decide not to bring them next time when we go, just do a date night/lunch.", "author": "Dong V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Delicious but price is high...def a treat yourself spot. Great decor and there's outdoor seating. Had the fried chicken and at that point i knew my life was finally complete. Order the fried chicken, you'll understand.", "author": "AR A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "Awesome awesome awesome place! Mac, Doug, and Ellen and the rest of the staff were all so helpful and accommodating with our surprise birthday brunch. The food was great, the unlimited mimosas were on point, the service excellent. This was the only place that would take my reservation for brunch without hassle and crazy time restrictions. \nI'll definitely return here in the future for brunch and will try dinner as well. Thanks French Louie!\nThe only reason why I'm not giving five stars is because our area was a bit hot and seemed to have poor air flow.", "author": "Jaydn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "With so many places to eat in Brooklyn/NYC, its not uncommon to say that I have been to a local place only 2 or 3 times since living here (7 years, where did the time go!?).  French Louie is different-- I have probably dined here 15+ times-- sometimes with my parents or large groups of friends, and sometimes just me and my baby, for a glass of rose and their gougeres.  The food is consistently great and service is usually spot-on.  Two very enthusiastic thumbs up.", "author": "Vanessa B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-13", "description": "A good meal overall. \nI really liked the ambiance and the soft lights, and how cozy this little restaurant is. \nWe had the Frency (?) salad as a starter and the duck and the tuna as a main course. Profiteroles and ice cream for dessert (those two were very intriguing but yet... Just like the rest of the meal, I wish they had that \"wow\" factor). \nService was great, we had a very attentive waitress. \nJust a little bit pricy for what we got (ended up being $160/couple without a bottle of wine)", "author": "Fabrizio U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Super easy to make a reservation for 6 \u0026 responsive communication beforehand letting me know making a reservation for 7+ = prix fixe brunch menu. We were seated as soon as we showed up (you know this isn't always the case, even with a reservation) \u0026 the service was good. 5/6 ordered the same thing (socca), plus a myriad of cocktails, coffees, etc. All the orders were correct \u0026 the food was delicious.", "author": "Teresa G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-20", "description": "Went here for dinner recently with my bb, after making a reservation with OpenTable. It was a beautiful evening, so we asked if any outdoor seating was available. We were promptly told that there would be a long wait - funny enough, several groups were seated outside not long after we were seated... maybe you can request outdoor seating when making a reservation? Guess I wasn't clever enough to think of that, if so. Anyhow, the cocktails and food were both good, and we had decent-sized portions. Overall a pleasant experience.", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Very pleasant experience! Great staff, vibes and a nice backyard. And the smoky mussels are absolutely delicious.", "author": "Fluffy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Great spot! Love the low-lit, trendy atmosphere they created, food is of high standards and the drinks are well made. Plus they don't push you right out the door once you put down your fork. Loved it!", "author": "Vanessa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-01", "description": "Was excited to finally try this place for brunch after hearing so many good things. While it seemed promising with its adorable backyard, nice minimalist interior and stellar service it left a little to be desired when it came to the food. \n\nThe cocktail list looks fabulous, however it was a little too early for a cocktail. We started with a fantastic peach ginger tart- which was their pastry of the day. Soft, warm and delicious we felt we were in for some GREAT brunch entrees. \n\nI ordered the avocado toast with a soft boiled egg. The serving is definitely generous, however the avocado was WAY too salty, almost too much to eat. It was a shame since the peasant bread was crusty and delicious, but overall with the salted avocado it was inedible. \n\nMy husband was super excited to try their burger with raclette cheese- though thought it odd they didn't ask how he wanted it cooked. Turned out they slice the beef patty in half and put the cheese in the middle- hence drying out the burger. He also said the cheese was a little lacking, just a thin slice and he was pretty underwhelmed.\n\nI will say the french fries were crispy and delicious, so that was a redeeming quality. I would give it another chance for dinner or to try their sweet brunch items, as the buckwheat crepes with ricotta and berries, and their french toast both looked FABULOUS. Maybe we just didn't order well. However we probably won't be rushing back after the disappointment.", "author": "Angelique L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Superb service!  From greeting by  the maitre D to the waitress. Very clean and comfortable atmosphere. Although it's a snowstorm day, it was pretty crowded. We arrived 15 mins earlier than our reservation and was seated right away. Thank God. \nThe foods and desserts were superb!!!  They had the chef special today which was the rabbit legs. So delicious. There were 5 of us so we got to taste 5 different dishes and 5 different desserts. All satisfying. There was no disappointment. Will definitely going back again. Hopefully will go back when its warmer so we can sit at the outdoor tables.", "author": "Sylvia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "Delicious food and great service! I've been here 2 x in the past month, once for brunch, once for a mid day lunch. \n\nI had a great crab meat Benedict at brunch. It was delicious! Lunch I had the tuna nicose on chickpea pancake - again really yummy. Fresh flavours! Oh and my friend and I shared the chocolate pot with Madeline's, heaven!", "author": "Bridget R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "Very cool spot with classic French dishes and pretty good wine list. Wish I made it in more often.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Excellent\n  One of my top 5 favorite restaurants.  Well done Brooklyn!!! The sauces and flavors are perfectly balanced.  Get the 28 day aged steak medium rare.  No sauce needed and not oversalted.  PS Mark the bartender is f@#$%^$g awesome.", "author": "Makis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "Overall, was pleasant. We came in at 3:04 and missed the brunch menus. It ended at 3. However, \"a special exception\" was made and we also were able to order from the Brunch menu. \n\nThe Bloody Mary with the tequila is amazing \u0026 so is The burger and chicken cordon blue, a little salty, but It's out of this world. Just don't get the bacon, it's like the supermarket brand kind. \n\nThey need to step in their bacon and dessert game. I'd go back though!", "author": "Peter P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "We had a really lovely dinner here.  Service was great and the restaurant is quite nice inside plus they have a good amount of seating in their garden.\n\nStarted with the snap pea salad and chilled squash soup.  The salad was a nice change from the usual salad with the pea shoots and a lot of herbs.  The cold soup was good, nothing you couldn't easily make at home.  It was topped with a very pretty and colorful assortment of garnishes though to keep in interesting.\n\nFor entrees we had the socca and merguez pappardelle.  The pasta was quite good.  It was intensely flavored and everything really went well together.  FYI, the merguez is the ground meat style (which may or may not be the \"real\" kind) and not the sausage style you may have seen before.  The socca was surprisingly solid, not just a vegan/gluten-free afterthought.  The baba and yogurt were extremely flavorful, right up there with the best middle eastern restaurants.  \n\nThis was our first trip here and we'll be back.  At the end of the day, that's the best endorsement a place can get.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Had friends staying in Prospect Heights, so ventured my way off the island on the C train to French Louie for a Sunday brunch.\n\nI'd been here once before, but for after-dinner drinks, so the memory is a little hazy.  This is a spot that CAN be visited for dinner, but is much better suited for brunch.  Dishes are inexpensive and delicious, and the menu is pretty creative.  We were seated at the front, which is adjacent to a pretty, old-school mirrored bar where the bartender was mixing plenty of cocktails pre-noon.  They offer a few iterations of the Bloody Mary - one with everything bagel spices.\n\nService was quick, friendly, and unobtrusive.  I had the avocado tartine - was practically forced to, as it's rare I'll turn down a dish with avocado listed as an ingredient, much less listed in the actual name.  It's definitely tiny, so if you're super hungry, order some side pastries or split it as an app- but it's delicious and feels healthy.  2 poached eggs atop smashed avocado with pickled green tomatoes and country bread.  Photographs beautifully too...", "author": "Emily R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "French Louie is the perfect casual brunch spot. The interior is quaint, white and clean with natural light coming in from the front window and back patio area. Not very large, but they don't over seat the place so it's not crowded. \n\nThe brunch menu has something for everyone with elevated staples like creme brûlée French toast and the cordon bleu which is a fried chicken and prosciutto concoction. Solid coffee for the cherry on top. \n\nYou definitely need to check it out if you are in the  area- even worth a trek from Manhattan. You won't regret it!", "author": "Linda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "As I've eaten here roughly 50 times, I can't really believe that I have yet to write a review. I've been for lunch, brunch, and dinner, and each is well worth the time and money. The flavor combinations, attention to detail, and genuine hospitality of the space and staff is really top notch. \n\nThe cocktails are well conceived, interesting, and tasty; great Bloody Marys for brunch. I enjoy the seasonal menu changes, often daily specials, and that they source as much produce as possible from Snug Harbor Farms on Staten Island. And for those on a budget, the Monday night price fix is a welcome respite from NY prices.\n\nFrench Louie is also not one of those Brooklyn places that's too cool to offer reservations, and if you plan to go on a weekend, or during peak brunch hours, definitely call ahead to avoid a wait (especially if you hope to dine in their shockingly serene idyllic garden space in back!).\nI can't recommend this place highly enough.", "author": "Jack C."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}