{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "Very friendly service and they also have a nice garden area in the back for when the weather is nicer.  The snail appetizer was delicious.  It came with a side of house-cured bacon, grits, and mushrooms--all went well together.  I also liked the brussel sprouts side which was tossed in a yogurt sauce with some sort of grain.  I got the bavette steak (similar to a flank steak?) for my entree which was fine, but nothing spectacular.  Husband seemed to enjoy his roast duck.", "author": "Mandy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "Great spot for small and large groups.  The service is excellent. The anchovy frites were excellent.  The pan fried skate with crab \"dirty rice\" hit the spot.  We went with a group of 12 and they were very accommodating.  Excellent variety of French reds and whites.", "author": "Charles L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-06", "description": "Visited with three others for dinner.  We had a very hit or miss experience.  A few stand-out dishes, but mostly misses.\n\nThe good: french fries, snap pea salad, the key lime tart, and the vegetarian main (\"Grand Socca - a combination of spreads and salads on a delicious flatbread of some sort)  are all really terrific.\n\nEverything else we ordered was, at best, meh.  My duck breast was bland, the jus was weak and had not been thickened to make a good sauce, while the accompanying potatoes were mushy (probably because of the jus).  My wife's lamb navarin was also not terribly flavorful, and another dining companion found the skate almost inedible.  The pineapple tart tatin with coconut ice cream was also quite flat - it was sweet, sure, but that's about it. \n\nService was slow, inattentive, and a little aloof.\n\nBottom line: nowhere near as good as Buttermilk Channel.  And when dinner for four (with wine) runs $300, it is a special occasion.  At least in my world.  I don't spend like that every day, so when I do I expect everything to be worth that price.  But I could have gotten better food and faster service for half the price at three other places within a two-block walk.  I definitely will not be back, and advise you to either stay safe (order only dishes that have consistent strong reviews from others) or stay away.   I'll be doing the latter.", "author": "Edan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "Go here! Everything was delicious. The fried date salad was unbelievably innovative and balanced.  I had the skate and my friend had the pork and clams for our main course. I don't know how I could go back and not eat the skate again. It was so wonderful, I would have licked the plate if no one has been looking.", "author": "Dana A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "super delicious french food and incredible cocktails. for food - the anchovy frites are a must have. there also: perfectly cooked french fries, warm and cheesy gougeres, chickpea flat bread (mmmm), and amazing lamb merguez pasta! ive eaten there twice so far, and the last time we had a gnocchi that we all fought over. cocktails are interesting, delicious, and matt is an extraordinary bartender who made us drinks way better than we could have imagined.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "Very good experience.  They do not accept reservations and we went on a Saturday evening...about an hour wait...but we waited in their garden and had drinks.  The Third Rail is a nice drink and would recommend it if you like a little heat.  After an hour plus, we asked someone how much longer it was going to be, and the owner returned with some gourgeres and some bubbles gratis.  This wasn't necessary, but it was very cool of him to do this as a little taste of something to eat was perfect.\nWe were sat shortly after.  Our waitress was very attentive, loose, and funny, which I prefer to formal.  The decor is not ugly, as one reviewer mentioned.  That's just a silly comment.  \nFood was fantastic. We started with the oysters, which were ok.   For our mains, we ordered the fluke, steak frites, duck, and skate.  All were perfect.  Sides were the asparagus and the cauliflower.  While everything was cooked very well and the portions were great, the fluke and the cauliflower are standouts and I would go back to get these.  \nWine list was reasonable and the wines by the glass were good. We had two bottles of the Jasnieres and a glass of the Chinon.  Reasonable wine for a reasonable price.  Not great but good. \nDessert was the pineapple tart tartin and the profiteroles, bot of which were awesome.\n\nSure, they are new and there are a few things to work out, but it is well worth the trip.  I would go back.  \n\nTo the owner who brought us out the goodies and wine while were were waiting:  Thank you.  This was a nice touch.\n\nFor: the more \"often\" occasion.  We'll be back.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-26", "description": "Responsive service, but that's all - food was pretty terrible. Their overpriced (for the quality) Bavette Steak was undercooked and rubbery, fries were burnt to a crisp, and the drinks were poorly made, with the alcohol totally overpowering the other ingredients in mixed drinks. Others at my table also had issues with their orders, including an obviously burned chickpea-based pancake that was burned to blackness - I don't even know how they justified bringing that one to the table - and their pork \u0026 rabbit rillettes tasted like tuna salad. Oh, and if you're going to serve a fish filet with bones still in it, you should probably warn people.\n\n2 stars, but only because the wait staff was friendly and attentive. Otherwise, just 1 star.", "author": "Nick R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-26", "description": "Based on the reviews here, seems like I dined at a completely different place. Only the wine, mint tea, and spiced chocolate pot dessert were passable. Scallop Ceviche too lemony. Gougeres way salty. Grilled Trout was just awful -- flavorless, layered over cold, hard, half boiled potatoes and a strange mix of radishes and cucumbers. It's not easy to swallow a very high price bill for bad food. Will not return or recommend.", "author": "Annette L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-09", "description": "I've been five times in the past few months. The food is fantastic and the staff and service are terrific, BUT the sound level is literally deafening. I'd only go back with earplugs. It's really a shame because if you didn't come out deaf after having missed half of the conversation this would be a great place.", "author": "Howard R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-16", "description": "Cute neighborhood place, but food lacking.  26 rating on Zagat?!\n\nOrdered the smoked sardines, Frenchie salad, papardelle, gnocci a la parisienne, kale and escarole salad.  \n\nHighs:\n- Service was friendly and competent\n- Cocktails were good and wine selection was better than exected\n\nNot so highs:\n- Sardines are difficult to do well.  These were really oily and fishy\n- Pasta had good flavor, but needed another minute of cooking time.  Ribbons nearly stood on their own\n- Gnocci was dry from being over-baked\n\nMaybe off night?  Might try again when in the neighborhood", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "Wow! Beyond expectations! The snap pea salad which is a seasonal delight was amazing and I had the Bavette steak which was cooked perfectly and tasted unbelievable! The decor was stunning (um gorgeous terrace?!!) and the waitstaff was super knowledgable and friendly. Total hit!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Had Saturday brunch in February at Louie. First off, the service was exceptional. We wandered in off the street and they we able to seat us in exactly the amount of time they promised. A rare feat. We had the salmon tartine, Eggs Louie, bacon and raw oysters. All very good. The wait staff was extremely attentive and well informed about the wines. I'll go back next time I'm in Brooklyn. Oh, also great people watching.", "author": "Bill R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "I am sure by now you know that these are the people who own Buttermilk Channel, everyone's favorite brunch venue.  I was not skeptical at all about trying out this place because of their rep and I was not disappointed.  definitely great french cuisine.   I enjoyed the duck and the Lion's tail drink.    both great.  The setting of the restaurant is dimly lit, not intimate by quiet.  There is also a nice deck in the back.  They definitely put some thought into it.  Great date venue or classy, wine sipping spot for a group of friends", "author": "Jean L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Came here during restaurant week on a Wednesday night February 2016. It was packed and for good reason! The food is absolutely delicious with each plate invoking a myriad of flavors all melding together in perfect unison. Now, I  am not at all familiar with French cuisine but if you've got an appetite for something different than the usual American fare, try this place. The plates are smaller than typical places in that you probably won't have any leftovers to bring home but will be satisfied and full. The space is small too with tiny square tables packed closely together. It's a loud restaurant so don't expect to hear your dining partner very well. I heard older people (50/60s) leaving the restaurant saying the food was great but the noise was unbearable. I can understand that sentiment but it's not enough to keep me away! If you want to enjoy really delicious gourmet, artfully crafted dishes you must come. You truly get what you pay for here. This is quality over quantity. You won't be disappointed.", "author": "Tamara S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-11", "description": "I came here looking forward to a steak and martini dinner, which I have enjoyed a few times at French Louie. I was disappointed on a couple of fronts. 1. The martinis are no longer served in martini glasses. They are now using those thimble-sized little \"coupe\" glasses that so many bars are now using for cocktails. There is nothing worse than ordering a cocktail and receiving it in one of those offensively tiny glasses, especially a martini. 2. The steak comes with salad. What happens when you put a hot piece of meat on the same plate as salad? Not only was the salad wilted, but tonight, half the salad was actually rotten. Garbage. Had to scrape it to the side after inadvertently eating rotten salad with my steak. Overall, I am sad that I can't depend on my neighborhood go-to French Louie anymore, for a great martini and steak dinner. Especially for the price, it should be very consistent and reliable.", "author": "R W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "Had a birthday brunch here last weekend. There were 12 of us, mixture of adults and kids. Firstly they allowed us to book in advance which was really helpful. The food was delicious and the drinks unlimited and they even did me a custom menu with my name at the top. The staff were really helpful and attentive and the food was good (madelaines with a creamy sauce to start, mixture of mains including burger, poached eggs, vegetarian option and french toast) all of which were epic. Can' t recommend this place enough. Unfortunately it rained, but we will definitely be back here in the summer when the garden is open.", "author": "Sarah J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-25", "description": "Maybe it was an off-night, but I had dinner here and everything I tasted (the steak, the papardelle, fries) was oversalted. Service was pretty decent. and cocktails were strong I had high hopes for this place but don't think I will come back .", "author": "Yomofolo O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-15", "description": "Wanted to like his place but just cant.\n\nThe space and ambiance If the food was good it would be a great date or dinner with friends spot.\n\nThe Jardiniere Pickles which were bland, very sweet and poorly trimmed.\n\nThe Tomato Salad with melon and herbs was the high point of the meal.\n\nThe Fois Gras and Country ham terrine was also very sweet. The terrine itself was prepared ok, but there was like a sweet sauce, and then some unripe strawberries which were maybe supposed to provide acid, but were also very sweet.\n\nThe Skate with dirty rice and crab bisque was edible but the skate tasted like it was frozen at some point. \n\nThe service was friendly but fairly slow.", "author": "Jason W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "my lamb was perfection- tender, flavorful and so juicy the grilled escarole and omelette complemented it just perfectly  by far my favorite part of the meal. the steak tartare was okay - I'm not a huge fan of mustard seeds or pickles so wasn't really my speed -personally prefer to taste more of the flavors from the meat. at the end of the meal we had tea and I just loved it's presentation. nice decor, friendly service - excited to try more items on their menu!", "author": "Nicole K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "Very nice ambience and great food.  The frenchie app was great with amazing little pieces of bacon.  The snap dragon salad was solid but not anything super special.  The skate was very good and the la socca was very different/delicious.  The best thing was probably the Brussel sprouts.   Incredible.  \n\nOur server was soooo nice and made it a very comfortable and inviting place to eat.  Just as good as buttermilk.", "author": "MC M."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}