{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-25", "description": "It makes me sad to pay a lot of money for food that isn't good. \n\nCame for weeknight dinner. We spent $100 + tip for two mains, a winter salad, fries, and two glasses of wine. Our mains were the pork and clams and skate with dirty crab rice. Both were bland (under seasoned, texture-less) and disappointing. The pork and clams came with three clams, which felt wildly unjust for a $25 dish.\n\nThe service was a bit aloof but not unfriendly. Our server never followed up with us after the food came. Perhaps she knew it was terrible.\n\nThe place is not without merit. The dining room is beautiful. We've actually been here once before for dinner and enjoyed it. The steak frites and lamb frites are nice--well prepared and tasty, though still pricey at $25+.", "author": "Nikki C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "Great first impression from a hostess who was warm and welcoming - a rarity in new/trendy spots.  The place was packed so we sat at the \"communal\" table up front (FYI, not communal whatsoever - just a 4-top that staff apparently chooses to use for 2 parties of 2 when necessary) and luckily our seat mates were friendly. \n\nThe mussels were hands down the best I've ever had and I eat a LOT of moules frites...huge mussels served in a creme fraiche/whole grain mustard sauce with apple butter toast on the side.  This sounds like an odd combo but it was absolutely delicious.  A definite must try.  We also shared the giardiniera pickle appetizer which was very tasty. \n\nFor our entree we shared the fried skate and lamb pappardelle.  The skate was the lighter of the two (despite being fried, it was not greasy at all) and came with a crabmeat sauce that complimented it perfectly.  Lamb pappardelle was slightly spicy, very hearty and perfect for a cold weather meal.  French Louie hit it out of the park again with this course. \n\nDessert was a pineapple tarte tatin recommended by our very friendly and helpful waitress and was yet another phenomenal course.  I had to go with the French 75 to drink which was a very nice sized pour and cut through the richness of our entrees perfectly. \n\nThere's really nothing bad to say about this place other than the fact that it was completely mobbed which isn't ideal, but that's no reason to deduct any stars.  Well done French Louie!", "author": "Lindsay F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "I went here tonight to celebrate my birthday and the staff was very attentive right when we walked through the door. The atmosphere was perfect (sit outside if weather permits!), our waitress gave excellent recommendations, and the overall experience was just what I was looking for. \nStar dishes: the anchovies were so good, my mother ordered 3 servings!; the pineapple tarte tatin with toasted coconut ice cream was absolutely perfect; the squid ink pasta with rock shrimp and mussels was a wonderful summer dish. \nI will DEFINITELY be going back.", "author": "Nedia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "This place was great! Po' boy was delicious. Loved the mustard herb sauce and trout m. The staff was awesome and super friendly:-) always near by to save fallen silverware.", "author": "Chloe-nile A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-04", "description": "Venue: cute restaurant with bar and outside garden area.\n\nDinner:\nSteak - Juicy and nicely cooked.\nLamb - Super tough and wasn't enjoyable at all since it took forever to cut and chew.\n\nBrunch:\nCordon Bleu - Comes with two large pieces of delicious fried chicken, slices of prosciutto and lettuce. \nSocca - Really light and thin layer of \"chickpea flatbread\" and little bits of toppings sprinkled on top. Interesting and tasty, but small in portion and not filling at all.\nDuck Fat Potatoes (side) - Not what was imagined and definitely not recommended. It's just bland, roasted/baked potatoes in a small skillet.\n\nService: Friendly staff, but food takes too long.\n\nOverall hit or miss on what you order.", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "I came here for brunch with a friend. This place is just adorable. The food was fantastic! I ordered the Eggs Louie and it was delicious. My friend ordered the mushroom and goat cheese scramble and it was also excellent. We also ordered the radish side with creme fraiche and loved it. Our bloody marys were also made very well. The atmosphere had a cute french bistro vibe. There service was excellent even though ti was packed and the servers were very friendly. I am definitely coming back! I would suggest making a reservation. This place gets pretty packed.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "Such cute little spot, very date appropriate with its mood lighting :) I went here with friends, and it's definitely also a great place for small groups. Went here for the restaurant week deal which is 3 courses for $38. I ordered the butternut squash/sweet potato soup for my appetizer which was lumpy and didn't have a very smooth, soupy texture as it should so thumbs down to that. For the entree course I ordered the steak and frites, which was really tasty and was cooked medium (a tad on the dry side but it was tasty enough not to need so much steak sauce). My friend ordered the trout which I tried a little of - that was delicious. To finish off, I ordered the chocolate ganache cake with hibiscus mousse. This was slightly underwhelming...my friend ordered the profiteroles with ice cream which was spot on. I think there was some type of salted caramel sauce added because it had a malty, salty but sweet flavor to it. Service was excellent but I do have to minus the one star as I was disappointed with the appetizer and dessert.", "author": "Mellie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Very cute and friendly spot. Food is good and somewhat original. Decent wine selection. Great for local casual dining experience. Pretty outdoor seating. Will cone back:)", "author": "Valerie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "My friend and I had a stunning meal here. Each dish was more beautiful and flavorful than the last. Service was impeccable from start to finish. A treasured addition to Atlantic ave", "author": "Adrienne P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "Great food, great service, great addition to a neighborhood where you can never have enough French restaurants. I'd even go as far as saying that I enjoy it much more than Buttermilk Channel (though the two are completely different). Love their radishes with butter, brussels sprouts, and most of the brunch options. The cocktails are also delicious.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-25", "description": "Ugh. I feel like an asshole writing this, because everyone was really friendly and the space is so great and I want this place to do well...\n\nBut our food was not that great. It just wasn't. Sorry.\n\nThat being said however, we'll probably go back because everyone was really friendly and the space is so great and I want this place to do well.", "author": "Will B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Being discriminating has a price. Case in point: I adore my friend Vivian. We can share everything and anything about each other, our friends, our family, our work. It's great. This is the hallmark of a true friend: a confidant that's up for anything and everything, I feel.\n\nOf course, there's always a catch. I never see her. But when we do get together, there's no question where we go. Like my pal Viv, this place has it all: great food, great backyard, great drinks, great service.\n\nWe like to go for dinner. The lobster is always delicious- melts in your mouth- and the creamy hollandaise just makes it that much more sinful. We always get both East and West Coast lobster- I have to say I'm partial to the East Coast usually; what can I say. \n\nRecently we tried the pork \u0026 clams; the pork shank was fork-tender and the clams quite flavorful; I had to be THAT person and grab bread to soak up the broth. No regrets there.\n\nWe always get the heirloom carrots (out of guilt, we think, we never eat vegetables when we meet) - frankly I think I could devour anything paired with their black caraway and yogurt sauce.\n\nJust like with Vivian, I'm not afraid to overindulge or share anything; I once had four of their bourbon drinks (we were there a very long time.) Be prepared for a massive migraine the next day. What? Did I say migraine? I mean hangover.\n\nBut what really makes this place feel like home is the service. I can't say it's because we look so blissed out through each course, but each and every server looks and tells us how much they envy us (and yes, they work there, they get to eat this stuff more often than I do.)\n\nIf you don't like the place, I'll take your seat, preferably outdoors. Maybe it's a good thing it's not superclose to my home, I'd be broke. But happy. The way I feel when I hang with Viv.", "author": "sylvia l."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-06", "description": "Went for dinner on Sunday. Service was very good, staff was friendly and helpful. \n\nHaving gone to Buttermilk Channel years ago and liked it, we were surprised by how disappointing our food was. Steak tartare was a flavorless, gelatinous patty topped with a cold runny egg yolk. It was served with some chopped cornichon that tasted fresh from a can and two slices of thick rustic bread that I assume was supposed to be used to choke down the steak. I wouldn't have been surprised to learn the ingredients were sourced locally, from Trader Joe's up the street.\n\nMy wife and I ordered the lamb special and the duck entrees. The duck arrived overcooked and tough, gray and gamey. The only flavor was from some kind of soy sauce reduction that it was swimming in. Three small potatoes and a fistful of olives were thrown into the mix and are best ignored. The lamb was likewise tough and bland, served on a bed of red rice that was probably the tastiest thing on the plate.\n\nThe portions were large, and some might think that for these prices, large portions would be a good thing. Not so. \n\nHoping to end on a positive note, we ordered ice cream for dessert. With some of the best ice cream places in the city within a square mile from the restaurant, I would have thought this to be a no brainer. But we should have cut our losses at the entree.\n\nThe music was a little loud, but the place is comfortable and elegant without being pretentious. If the prices were lower, I'd give it another shot, given their reputation with Buttermilk Channel. But with so many other choices in the neighborhood, it's very unlikely I'd go back.", "author": "M C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Quaint, clean, airy and fresh...i mean the food and the atmosphere! Had the hake fish dish and it was tenderly cooked to perfection with delicate flavours and not overwhelmed with stock or salt. Loved this place and want to go back for more. Table mates ate duck which was so delicious and cooked also to perfection. The beef tartar appetizer was super fresh and I highly recommend it. Service was great and wait staff was friendly. Must go!!", "author": "Via G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "Atmosphere and friendly, happy service is solid 5 stars, especially in the garden. \n\nFood varies somewhat wildly from 3 to 5 stars. \n\nStarters: Sardines are wonderful, the best. Anchovies also really fun. Try the jardiniere pickles. Gougeres are somewhat dry and disappointing -- you don't want to get those wrong, it lets everyone down! Terrine of foie gras was bizarrely salty, it didn't work. \n\nEntrees: All the steak frites are surprisingly good. Bone-in could maybe use a bit more seasoning. Skate was perfect. \n\nWines by the glass all good and reasonably priced.", "author": "Mark B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "one of the best lunches i've ever had!\n\ncame here with coworkers for lunch on an offsite. LUNCH WAS SUPERB. i had beef heaven overload with the steak tartar appetizer, followed by steak frites, cooked perfect at medium rare. YUM. their fries are amazing. Not to mention; enjoyed with a Cote Rotie (thank goodness, paid on company's dime $115 a bottle) for dessert, i had the chocolate pot de creme with orange madeleines. super rich but delicious. perfect with espresso! belly was very happy. will definitely be back for dinner one day!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-07", "description": "I went there last evening for my birthday and though the food was great, the service was not stellar.  I did not feel welcomed, nor pampered, even though I told them it was my birthday.  Will not go again and do not recommend.", "author": "L S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "The food is good and the ambiance is excellent. The appetizers are gorgeous especially the foie gras and the mussels. And the steak is a must order with chips. I always order Old fashioned for a drink! I like sitting put doors but always bring a repellent unless you will be bitten to death.", "author": "Rollin L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-06", "description": "Sorely disappointed! The folks at Buttermilk Channel (one of my favorites in the neighborhood) recommended I check out their new place, so I went to French Louie tonight expecting something akin to BC's absolute deliciousness.\n\nNothing was really that good about the service or food. The decor was cute, good place for a date or dinner with friends. The server was nice but had this weird crazy eyes thing going. We ordered the oysters and he was like \"OYSTERS!!!\" and got all wide eyed like he was real freaked out. We thought maybe there was something wrong with them. But then we realized he had the same reaction to everything we asked for, haha.\n\nMy glass of wine took 20 minutes to come after my friend got hers, even though we ordered at the same time. The service was sloooowwww.... and our table was positioned in such a way that it was really impossible for our server not to see us. Yet somehow he managed to ignore us for exceedingly long stretches at a time.\n\nI got the soup en croute. Gross. It was a bowl of liquidy broth with a teeny amount of  shredded pickled onions and croutons in it, covered by a hard shell of yucky bread that looked like a muffin top. I think they just threw a slab of dough on top of a bowl of beef stock and baked it. \n\nAnd then I got the flounder grenobloise.\n\nWow, hey, I just looked at their menu to double check what I had, and I realized that they changed the name of my dish! Apparently it used to be \"FLUKE grenobloise\" and not flounder, which sounds like the Sewage Monster from that episode of the X-Files, which tasted pretty much like what I got. It was a small gooey white smushy fish. Still on the bone, covered in capers and rubbery old cauliflower. \n\nI really hate to waste food. But I left most of this on my plate. My friend got the skate and neither of us was impressed. We got profiteroles for dessert, hoping they would redeem the place, but they weren't even that great (despite the reviews here). They were like someone poured Bisquick into a cool shaped waffle mold, put in a scoop of vanilla ice cream, and doused it in Aunt Jemima. Meh. \n\nThe whole thing was like $140. Not worth it.", "author": "Julia Child .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "We had a great time here and were taken care of with heart. I had the duck and my dining partner had steak frites. We finished it off with yummy goat ice cream and huckleberry sorbet. The only thing we couldn't make sense of was the radishes in butter. It was yummy starter, but a bit odd. We finished it, though, if that's any indication.", "author": "Roxanne K."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}