{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "The food here is very good and the portion size is just right. \n\nWhile here for brunch I had the creme brûlée French toast which is a must have for creme brûlée lovers. I had the burger royals which was amazing. The burgers were cooked perfectly and dressed to the nines with French dressing on the burger. \n\nI'll definitely be back.", "author": "Anthony S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-24", "description": "Had a quick Saturday brunch with two friends. I ordered the socca - delicious, one friend got the smoked trout with creme fraiche scramble - delicious, and one friend got the creme brulee french toast - very rich, decadent, sweet and huge!\n\nVery good, attentive service.", "author": "Jaclyn M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-11", "description": "I simply cannot remember the last time I walked away from a restaurant of this caliber so disappointed and with such a strong feeling that my money was so poorly spent.\n\nThe wine list is different than the one on French Louie's web site, with many wines priced higher than shown on that list.  Despite seeking reassurance from our server and the wine person that a particular wine had the qualities we were seeking we found our $60 bottle to be dull and lifeless.\n\nThe starters of anchovy frites (four anchovies for $10) and mussels normande (about a dozen mussels, lost in an overpowering leek/cider/mustard/creme fraiche sauce, $16) were immediate letdowns.\n\nThe gnocchi were dense and rather tasteless.  The trout was the high point of our meal.  A side dish of salt-baked sweet potatoes tasted like roasted sweet potatoes, despite the way they were described.  Again, not a good value, as we received five miniature sweet potatoes for $11.\n\nA request to a server that attention be paid to the rest room, which was littered by guests who found the trash bin overflowing, was, apparently, not heeded.\n\nAs others have said, expectations are high, owing to the reputation earned over the past three years and the quality of Buttermilk Channel, French Louie's sister restaurant.  I don't expect to return to French Louie.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-16", "description": "Pretty good although nothing to write home about, at least in my opinion. I have friends who swear by the pork chop but it's not my thing. The oysters are ok but not comparable with places that specialize in seafood and not cheap at $3 a pop. The food is not memorable in my opinion and it's not worth coming back given so many great options in the vicinity.", "author": "nina s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "Walked in alone on a rainy weekday afternoon for a late lunch. About two weeks ago. The restaurant was more than half full.\n\nI was promptly seated. I ordered smoked sardines for appetizer purposes - the sardines (3) were good - sweet, smoky - but full of those tiny little fish bones just big enough for me to worry about swallowing, so this created some unforeseen messiness to the meal...There was also a cold hunk of butter on top of the fish, which was difficult to spread on the yummy crusty bread provided. Probably would've been ok to nix the butter, OR would've liked for them to keep it at room temp so as to help with the spreadability. \n\nFor a main course, I had the roasted beet socca. It was tasty! The bottom layer is a chickpea pancake of sorts, and is fantastic! Crispy outside, soft middle. All around this is a generous smattering of some sort of whole grain I could not identify (shame on me, I guess), which was easy to eat and crunchy. The roasted beets were both red and golden, and were topped with a tart yogurt dressing. There was a heaping pile of vibrant mixed greens as well. At some point in the meal, I realized that there were also bits of caramelized onion around and on top of the chickpea flat bread. It was delicious and I would have it again.\n\nThe staff stopped by often to take my used dishes, refill water, and to check things were going well. Would eat here again happily.", "author": "Andrea F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "This was my second visit to French Louie, and Saturday Brunch was definitely better than dinner. The high prices are unwarranted, as both meals were not outstanding. There was nothing wrong with the food or the service, but the bill indicated that we should have had an excellent experience where it was just ok. We left feeling good, but with no plans to return.", "author": "olga m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "This place rocks in food, ambiance, and service. The food is such good quality and you can tell the chefs take pride in what they do and use quality ingredients. Everything I've had there was simply delicious.\n\nThe ambiance is also great. Good music is played at the perfect volume so that it's not too loud, but you can hear what song is being played in the background. The place is clean and the dim lighting is very nice.\n\nLastly, the servers and hostesses are all very friendly, accommodating, and attentive. We had a surprise party here over the weekend and the staff was awesome in helping us orchestrate the plan. \n\nOverall, you can't go wrong with this restaurant and will leave after having a very pleasant experience.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Totally loved this place for a laid-back brunch! The service was exceptional, friendly and quick, and the place is adorable. I was expecting it to be busier on a Sunday morning, but we got a table easily, no wait. Pro-tip: order the madeleines. Warm from the oven with just enough spice to make them interesting, they're easily the sleeper hit/highlight of my experience", "author": "Taylor G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "This was a culinary triumph!!! I ordered the duck with was exceptional \u0026 my husband ordered the lamb. Perfect!!! Don't miss out on the Frau Gras, which was a draw for us!  Helped us sample \u0026 pair wine with our dish.  Attentive staff, friendly, clean!!!   Da' best!!!", "author": "Laura K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "We stopped in for a bite on a Friday night and really enjoyed it. Small, but focused and excellent menu. The service was fantastic and the atmosphere out back I. The garden was great. \n\nIt's a bit pricey but worth it.", "author": "Brian V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-21", "description": "Didn't even eat here. I asked a server to ask the hostess who was literally a couple feet away from him how much longer the wait would be, as we had been for like 15 minutes for a table outside.  He replied, \"no, you can\". It just seemed rude and I didn't feel like my business was appreciated so we left.", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Last Sunday went there for brunch, atmosphere is really nice in there and the service was great. Even though it's brunch but still have a lot of choice to choose, also as a French brunch I think the price is very reasonable so definitely I will go back again", "author": "Derek F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Every time my fiancé and I come to French Louie we have an incredible experience. The service here is always impeccable, food great, and the atmosphere comfortable and refined yet in an understated way so while this could be a romantic date spot, you also wouldn't feel out of place coming dressed in casual summer clothes.  \nNothing is amiss in the service here. All the staff is charming, genuine, attentive and very knowledgeable about the menu and happy to answer questions and give guidance. The owner, Doug, does a great job and is usually there greeting people and is clearly the big reason why this and Buttermilk Channel, his other restaurant, are so successful. He has great vision and knows how to execute. If he opened other restaurants, I would certainly want to try them too.  \nWe've been coming here since they opened and still remember on our first visit the spectacular roasted carrot salad with pistachios and citrus. The menu changes seasonally as it should and as some general comments, the steak/meat dishes are always 100% on point (complete with great frites with an addictive aioli dipping sauce). I've also had delicious pasta dishes including spectacular gnocchi. There are always a handful of appetizers that appeal so we often start with an oyster and chicken liver pate (so so good!!) but recently had grilled octopus in squid ink and seared foie gras. \nWe sometimes get a cocktail which are always very interesting/creative and delicious but usually get glasses or a bottle of red wine. The staff always helps us pick a good option depending on what we are looking for that day. \nWe sometimes have dessert, since I have a big sweet tooth and they are always good but I'd almost rather have a cheese plate and dessert wine to finish, which is another excellent option!\nThe only reason I didn't give 5 stars is that the menu isn't always 100% consistent for me. I have had a few occasions when I've had something that's just good but not groundbreaking. I feel like some fish dishes have sometimes been a little bland/not as flavorful a dish as most of the others. However, we typically navigate the menu well enough to only order items that we really love. \nHighly recommend for an outstanding overall experience and memorable evening!", "author": "Heather B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "4.5 stars. My friend and I have work lunch meetings ( and they allow us to linger forever) here and I adore the lunch. The tuna nicoise is a combo of the grand socca  with some greens and pickled gardiniere veggies ( and yummy slightly seared tuna). Yum. My friend always has the chix paillard which I'm aiming to get next time if I wasn't so sold on the tuna. I've also seen this chicken cordonbleu situation but don't have the room to consider it (only in dreams). My hub and I go for dinner and enjoy as well. It's most certainly improved from our very first times ( also theirs) and the service is always kind and generous, super-attentive. That goes for a lot especially since this neighborhood was filled with top-notch dining and service ( including formerly, the fantastic Jolie) and I would say those days are gone ( in the customer service department, at least) but not French Louie: knowledgeable, friendly, funny and warm. The owner is just the nicest person.\n\nI always order the steak tartare app as a main with fries or the grand socca. I could just chew on the gardiniere veggies all day long and tried to make them at home. I had a pickled fried green tomato and goat cheese salad special that I would kill for, seriously, some of this stuff should be keepers, but sadly aren't ( the lunch menu could invade the dinner menu a bit for both yum and more variety and that is the *only* reason I would consider taking a half of a star in theory, away.", "author": "aimee m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "We arrived here for brunch on a Sunday morning. It's a very cute restaurant, gives you a cozy feel. There is outdoor seating, I believe, for when the weather gets nicer. The staff was friendly and the service was great here. \n\nI ordered the Socca from the brunch menu. It is a chickpea flatbread with roasted cauliflower and buckwheat with sunny side up eggs. It tasted fresh and flavorful, which surprised me considering the ingredients. They definitely made it great here. Very tasty! If I come back here, I would try out the other dishes since those look good to try.", "author": "Irene G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "Completely delicious...i wish i could eat here everyday.every piece of the meal eas on point...i am a big fan of buttermolk channel and i was worried that it may not be as good..but was grateful to find out it is just as good but in a different way...i will most definitely be back!", "author": "David T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "My husband and I have been to French Louie several times before for brunch - our most memorable time being the day we got our marriage license down at the Brooklyn Court! Tonight we went for dinner to celebrate a new apartment and -as usual- we loved it. The squash with ricotta, nicoise olives, rosemary and brown butter was exceptional. It seemed like a potentially heavy starter but it was so unctuous and yummy and balanced, we had to fight not to finish it and save room. It was soooo good! I could have had that as my entree and been super happy. We split the dry aged steak frites and, while I have had better elsewhere, the well-mixed (perfectly balanced) cocktails, attentive service, and cozy but refined ambience was enough to make this entire meal extraordinary. We finished with a sour cream crepe cake with bourbon pecans and coffee ice cream which was just lovely. French Louie - you hit all the notes tonight: service, food \u0026 ambiance. Thank you for your hard work and attention to detail.\nKeep up the good work!!", "author": "Heather M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "Yum! We were here for brunch and it was delicious! The cauliflower soup was superb as was the apple turnover! We both ordered the Bloody Mary and whoa holy yum! One of the better ones I've had since living in NYC. We will definitely be coming back for more.", "author": "Ariel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Went for dinners during NY restaurant week. The steak frites was awesome! Although the duck confit came out too dry. Plating was gorgeous. Would try again.", "author": "I. C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-05", "description": "Some things are really, really good here (like MINDBLOWING), and others (which sound like easier dishes to get right, actually) are only okay. Overall I do like coming here and the atmosphere and service are always wonderful.", "author": "New Yorker N."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}