{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "My friends and I were happy to find this place after the restaurant we planned to go to was closed for a wedding. Lovely atmosphere - modern, unfussy, contemporary. Prices were more than fair. Great beer selection. There were two oyster selections and the ones we chose were shucked and cleaned nicely. We also had the heirloom tomatoes - a nice seasonal menu item. Everyone at the table enjoyed their entrees and the lime merengue tart was excellent. The house-made amaretto for desert was also a highlight.", "author": "Claire T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "Really beautiful garden compliments a chic restaurant that is laid back with attentive and helpful service. We've been here a few times and always enjoy the food.\nClassic French staples are done well which makes it's a great option in the neighbourhood. If you can get a spot outside it will make for a fantastic meal!\n(French fries are spot on!)", "author": "Iain M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Excellent food and service.  I wouldn't take young children because it is a small space, but my teenagers loved it.", "author": "Cathy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "French Louie seemed very inviting while we explored Atlantic Ave, so we couldn't resist having dinner there! The back patio did not disappoint. Smoked sardines were top notch, and so was the \"roasted king mushroom\". The bread on the grand socca dish was burned, but the gracious staff more than made up for it. The chef (or the manager?) came to our table to apologize and gave us extra attention. I've rarely seen this kind of courtesy in any restaurant.", "author": "Vlad B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-14", "description": "I was so excited to try this place out for brunch after never being able to get into Buttermilk Channel. The first great part about this place is that they take reservations...I feel like no one takes reservations anymore, so I was super pleased about that. When I got there (without my date mind you) they immediately sat me and brought me water. My boyfriend was a little late because parking in the area is notoriously bad, but they didn't rush me at all which was lovely. We ordered the Eggs Louie and the Trout Po Boy. The Eggs Louie were absolutely fantastic! Rich, creamy, buttery, definitely not a health-kick meal, but really great for a treat. My boyfriend said the Trout Po Boy was delicious, and something like he'd never tasted before. We really enjoyed the food here, but there was one thing that really killed the mood, hence the -1...it's so dang loud in there!! I don't know if its echo-y ceilings, loud music, or perhaps this midwesterner still isn't used to the Brooklyn brunch crowd, but it was unreasonably loud. I could not hear was my boyfriend was saying and he was sitting directly across from me. When we were leaving I noticed that the front of the restaurant was much quieter, so try and get a table up there if you're looking to chat.  Overall the food was great, but it wasn't really what we had in mind for our romantic brunch date.", "author": "Hayley M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "This is a wonderful French Bistro. Great atmosphere and excellent food. Seared scallop appetizer was delicious, mushroom entree was sublime, profiteroles for desert were only mediocre though. Despite dessert experience, this place is terrific - would love to return on my next trip from San Francisco.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "My husband and I ate here for our anniversary and it was fantastic! We started with the mussels Piperade and they were my favorite part of the entire dinner. We shared the cote de boeuf and it was so flavorful and perfectly cooked. Wine was great, service was great!", "author": "Megan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "Love this restaurant. I've had brunch on weekends and dinner; both are excellent. The garden in the back is beautiful, quiet and shaded in summer. Inside can be a little noisy, as almost all NY restaurants do. Service is always excellent, knowledgeable and friendly. Reservations for my birthday dinner, even though I kept adding people one by one to the table on a busy Saturday, were not a problem at all. Brunch prices are surprisingly reasonable for the city. I'll keep coming back, with great pleasure.", "author": "Marion B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "My boyfriend and I have tried the smattering of French restaurants along Atlantic Ave between Bond and Brooklyn Heights... French Louie is BY FAR our favorite. The food was amazing, starting with the octopus and \"frenchie\" salad and ending with the mussels (app), Bavette steak, and spiced chocolate pot de creme... Truly delicious! What really made our experience five stars was our server, Brian, who went above and beyond to make us feel special (it was my boyfriend's birthday dinner), checking in frequently, and making sure our wine was always topped off. Really, an exceptional dinning experience. Thank you Brian and French Louie!", "author": "Ab A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-20", "description": "Brunch here was weird and horrible.  Bad, bad coffee--very mineral-ly with a strange aftertaste.  This was a red flag and we should have got out then.  Regrets.  We had the trout tartine and the cordon bleu--everything--I mean everything--had a sour, bitter taste.  The service was helicopter mom, every three seconds, we were being asked if everything was ok.  That's not attentive, we felt harassed  This was the worst brunch that we have had in many years and we go out a lot.", "author": "Ella H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "The food is awesome, but it's not surprising since it's coming from owners from Buttermilk Channel. The thing i adore about this space is the outside space. Always nice to dine al' fresco in NY!", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "Had a amazing dinner here with fantastic friendly, on-point and enthusiastic service. Beautiful space and it will now be one our my go-to place. The combination of space, service, good drinks and food is a 5 star - really hard to find these days. Owner of Buttermilk Channel brings his impeccable hosting over. Awesome experience overall.", "author": "Vilasinee B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "The good news is that, over a year later, French Louie has definitely caught on.  You now need a reservation for peak meal times, and may not get one in your preferred slot.  Based on my experience this past Friday, the place now gets super crowded and so, unfortunately, super noisy.  The food is still of high quality, the menu remains smallish but varied and challenging, and the wine list still includes a lot of good values.  The service on a busy evening is understandably a bit frazzled, and the noise level makes communicating with the servers a challenge, but the basics (food delivery and presentation, pick up of empty plates, etc.) are all handled professionally.  I certainly intend to go back, but I will try to find quieter times and avoid peak slots on Fridays and Saturdays, when the noise level makes normal conversation impossible and thus reduces your pleasure in a fine meal.  Or I'll come in the summer, when the delightful garden is open.", "author": "Willet W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-08", "description": "Love French Louie! Good food and good people. They go out of their way to make customers happy!", "author": "Anne B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "OK, so I'm not sure what it would be like eating inside; the decibel level was 92-95 - similar to standing next to a jackhammer. The garden however, was quiet and lazy with a warm summer breeze wafting through. There's enough room out there so that there is no cramming in. That's just the beginning. The waitstaff was genial, jovial, and efficient - aand then came the food. My own dishes were the smoked sardine appetizer - perfectly smoky, slightly briny with a tapenade butter and whole grain bread accompaniment. My main, a dish of papardelle with 'smack your momma' merguez sauce was like a 4th of July fireworks display of flavor zings - and the bed of pasta perfectly al dente. A knockout! Our shared dessert selection of profiteroles and the lemon meringue tarte - neither cloyingly sweet) provided the perfect finish. With our Cotes du Ventoux wine at table, we could have been in Provence, yet we were in the heart of Brooklyn, with a perfect staffer from Long Island (she admitted it). We're going to wear this place out!", "author": "Mike D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-09", "description": "I really want to like French Louie (really enjoy Buttermilk Channel and want another local go-to restaurant), and have gone there twice, hoping for good service and food. The first time was only okay, but it was their first week being open, so I cut them some slack. Last night we returned, and regretted it. A) my husband and his sister got food poisoning from the steak tartare, B) despite being completely empty at 930 on a Sunday, they seated our party of 5 in the back, crammed into a 4-seater with an extra chair and an incomplete table set-up, and C) the food was simply not tasty and the service lackluster.  I don't even want to bother going into the details of the food because it was so unmemorable. But I won't be returning unless they revamp their menu, kitchen staff, and service level.", "author": "S_Z_ C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "Ate here the other night with a friend who knows the chef. Wow! Delicious, creative dishes and amazing wine. Highly recommended!", "author": "T K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "Me and my native New Yorker friend popped into French Louie after my red eye flight from the west coast. It was Labor Day Sunday. We were promptly seated toward the back of the bistro. I loved the busy vibe and patio which we opted out of due to direct HOT sun that day. Our server was super nice and personable. I had the trout po'boy while my New Yorker had the Socca. With both dishes neither or us were disappointed. Food and service stellar and all worth the value. Would return sooner if I weren't so far away.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-29", "description": "The atmosphere is lovely. The service attentive but not cloying. Great wine recommendations too. But the food was disappointing. The chicken looked perfectly crisped but lacked seasoning. It's bed of lentils, also unseasoned, were soupy and bland. My friend's steak, although cooked to a perfect medium rare, also lacked any flavor. What a bummer. I'd return for wine and oysters in a heartbeat but will eat dinner elsewhere.", "author": "Stina P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-14", "description": "DISCLAIMER: I live in the neighborhood; I am a big fan of Buttermilk Channel (the original restaurant by the owners of French Louie); I visited French Louie last week on a weeknight and very much enjoyed the experience. The food was delicious, the service was acceptable for a new restaurant, and though it was not inexpensive, I felt it was worth it.\n\nTHAT SAID, I decided to go back on a weekend, aware that they do not take reservations and fully prepared for a wait. Walking up to the entrance, I saw a large crowd standing in the vestibule. I spoke to the hostess, told her I needed a table for two people, and she assured me that it would be a forty-five minute wait, adding that it would possibly be sooner. I went for a drink in the area with my friend, waiting approximately forty-five minutes, after which I went back to the restaurant to check on availability and spoke to the hostess. She looked at her chart, and said the following, VERBATIM, \"Well, a lot of people are taking their time, so it will probably be longer than I thought.\" I asked, \"How much longer?\" She pulled a flippant sneer and said \"Eh, it's hard to say. Maybe... twenty minutes? And... there are people in front of you.\" \"How many people?\" [Long pause, shrug] \"Hmm...  A LOT.\"\n\nLet me say that I understand the mechanics of arranging tables on a Friday night in NY, at a restaurant that does not take reservations. If a hostess says \"forty-five minutes\",  I expect maybe an hour. If a hostess says, \"two hours\", the message is that the wait will be longer than normal and the implication is that perhaps I should search for another option. Mainly, one does not expect an attitude of indifference from the hostess. The hostess's job, particularly in a restaurant that lacks a reservations department and thus has no other way of managing time, is to give patrons a clear and honest estimate of the anticipated wait.\n\nAfter this second interaction, my friend and I went to another restaurant, sat down, ordered, and received a phone call some two hours after we first spoke to the hostess. After the insufferable \"Your table is ready\", I explained that given her deliberate ambiguity on the time estimate, I had found another option. Her response: \"OK, thank you for waiting, we will see you next time. Good bye.\" The click of the dead phone line came before another syllable could be uttered.\n\nThe disappointment at this point arose from the hostess's handling of the situation. My objection is the dishonesty. If we had been told it would be a two hour wait, we would have thanked her and found another restaurant. But we were told it would be \"no more\" than forty-five minutes.  A diner's only basis for arranging his or her evening is the word of the hostess. \n\nDespite the above, I do plan on returning to this restaurant soon and giving it one more chance.  Fingers crossed.", "author": "August G."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}