{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-20", "description": "Just was not impressed although I seem to be in the minority. I ordered the Moules Frites, and while the frites were find the moule were meh. Dry, rubbery, with no sauce to speak of. Ok because no bread was offered for dipping anyway. My wife's Pappardelle as likewise borderline unremarkable and just plain boring, with what was called a ragout on the menu was just some vegetables thrown over the top of the dry pasta.  Sorry, not for me.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-04", "description": "A very up-and-down experience... We had just finished watching \"The Hundred-Foot Journey\" which of course put me in the mood for French food...\n\nSo... while some of the things we had here were good, ultimately the experience was a huge disappointment. Among the good (great) things was the foie gras (though tiny and very expensive for the portion size), the cocktails (excellent), and a chicken dish which was absolutely perfect.\n\nThis was offset by poor service (don't sit us at the worst table in the house in a mostly empty restaurant), a chicken liver mousse which was tasty but came with a horrible bread, and the world's worst duck au poivre dish (a big fat fail in every respect- overcooked, under-seasoned, bad flavor combination, etc).\n\nMaybe they could fix these issues but yeah we're used to great French food... we wouldn't return.", "author": "Art C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "We came here for my father's birthday. We have been impressed so far with certain French spots (i.e. Pardon My French brings back nice memories, it was fun) so my expectations for French Louie was high.\n\nAnd, the experience was totally worth it. They did everything right in my book and scored five stars.\n\nI was extremely pleased with the reservation process (we had 8 peeps in our party), the timeliness of being seating, the service was amiable and the food was extremely fulfilling.\n\nThe place was a bit tight but it gives the appearance that they are busy and popping (which they are). Every table was filled to capacity. We were in the back and noticed they had backyard dining, too. Decor was also casual and modern.\n\nOur waiting staff was the best. I really wish I remember their names because they really accommodated us. We always have crazy requests for x, y and z and they didn't have any issues trying to make us happy. Shout-outs to them for making our experience memorable.\n\nThe food was impressive. French food is known for small portions but believe me, I couldn't even finish my meal. I had the grilled trout Po' Boy which was very tasty and heavy-duty. \n\nThe waiting staff brought my dad a dessert since it was his birthday which was really sweet. He was full that he couldn't finish it either but we were all able to sample the sugary goodness. Lol.\n\nThey are somewhat pricey but not enough to bring tears to your eyes. But I must add this tidbit; their dinner menu is much more expensive than their brunch menu. The crowd is much more livelier and casual during brunch so if you are looking for \"fun and laid-back vibes\", brunch is where to be. I think dinner time, you may have to be decked out in your fancy threads. \n\nLast but not least, the drinks were on point. Everyone had mimosas but I tried both; a mimosa and also a Bellini. Both drinks were equally buzz-worthy.\n\nOne of the few French spots that are worth your time, stomach and money.", "author": "Gail C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "Hey Louie. As predicted, I couldn't quit you. And I'm glad, because:\n\n1. You've recently become my favorite Louie, now that CK has been outed as a bit of a creep.\n\n2. Your brunch has become a go-to, and it transcends most of my previous dinner complaints. \n\nAfter about a dozen visits, you've cemented your place in this neighborhood's desperately underserved category of gorgeous, just-a-smidge-fancier-than-casual date spots. While I wouldn't say I'm deeply in love, I have a guarded affection for your lively bar, your picturesque patio, and your beautiful food. The one incident we had many months ago remains the only problem we've ever had with the service; in fact, I love the staff here. \n\nThat said, some of my complaints remain. On occasion, I do still feel as though the meal, though impeccably plated, did not necessarily justified the price we paid. This can be an expensive evening out, and I wish all your dishes were both as beautiful and weird as the Grand Socca, and also as delicious as the duck au poivre and the chicken liver pate. Sometimes they aren't, frankly. I still wish I was a millionaire so that I could afford to drop $150 on a meal that wasn't always as satisfying as I might like, but I'm just not. \n\nBut you've won me over. Not only is your brunch very tasty, but you've endeared yourself to me by allowing me to make RESERVATIONS. Like a civilized adult.\n\nWhen I am going to pay too much for eggs, I appreciate knowing when I will be able to eat them. I appreciate knowing the exact moment at which I will be able to soothe my awful hangover. It makes a lot of difference in whether or not I'm just going to cook them myself, or come in and drastically overpay for morningtime cocktails.\n\nAnd you do eggs well, Louie, and any way I'd like them. The scrambles are lovely (and surprisingly generous portions), the soft boiled egg on the avocado toast is impeccable (quite a small portion), and pairs well with the pickled tomatoes. And when I spring for the Eggs Louie I enjoy the poached, runny goodness that leaks out all over the croissant/crab combo. If you prefer a heavy brunch and hollandaise isn't enough, there's fried chicken cordon bleu and double burgers topped with raclette there just for you. Shockingly, I have yet to indulge. \n\nWhen I do, I can only imagine that the arteries in my heart will clog just as the love in my heart swells even more for you, Louie.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-28", "description": "Overall a lackluster brunch with a few bright spots. \n\nThe Eggs Louie were completely devoid of any crab. What little was there seemed deliberately hidden under the eggs and hollandaise. Sure, it was tasty, and the croissant was a nice change up from the usual English muffin, but for $15 I'd liked to have tasted some crab. \n\nThe beef tartare and duck fat potatoes were also delicious, but there couldn't have even been one whole potato in that tiny skillet. $6 for a single layer of thinly sliced potatoes. \n\nService was lukewarm, and the waitress didn't even notice when she spilled creamer on my husband's jacket. Somehow not surprised this place is owned by the same guy behind Buttermilk Channel. The awesome 80s music that was playing was the highlight of the meal.\n\nI generally enjoyed my brunch while I was there, but looking back on things now, I'm not sure if I'd jump at the chance to return.", "author": "June P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "A wonderful French-bistro style restaurant in a cool Brooklyn neighborhood. We decided to give French Louie a try during restaurant week and it did not disappoint. The atmosphere was lovely on a Friday night - bustling and busy, but not loud or obnoxious. The staff at the restaurant was lovely - everyone from host, to coat check, to waiter was very attentive and pleasant. \n\nWe decided to split a lovely bottle of Cotes du Rhone, although their cocktail menu was very enticing as well (next time!). Our appetizer of chest gougeres was a perfect complement to our wine while we waited for our meal. The restaurant week menu also included an appetizer and we decided on a bibb lettuce, bacon and blue cheese salad, which was light and fresh. \n\nMy husband had the traditional Steak Frites and I opted for the Leg of Lamb Steak Frites, and I am glad we tried both! The flavor and seasoning of my lamb was deeply delicious and cooked to perfection. We both noted how tasty and crispy our French fries were, very authentic accompaniment to our steaks! We split a decadent chocolate mousse for dessert and left feeling \"comfortably full\" - not stuffed but very happy. \n\nWonderful French bistro that transported us back to Paris cafes! We will certainly be back to sample more authentic and creative dishes outside of restaurant week.", "author": "Anna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-18", "description": "I really was excited to come here finally and yet I was left wanting more. I would say this place is more French fusion than French cuisine. My bf is from France and is always disappointed with the food here in the States. We were recommended this place and decided to give it a try. \n\nWe started off with the foie gras and escargot, very different from what you would expect traditionally. I felt the the foie gras was under cooked and tasted a little bit too sweet. It didn't really taste like foie gras at all. The escargot was a bit messy to eat and more salty than expected from the sauce it was cooked it. Underwhelming for escargot,\n\nI was satisfied with the lamb leg chop. Nicely seasoned all around. The aioli was really good with the pomme frites. My bf had the duck au poirve. Nicely cooked, but really lacked that pepper taste. \n\nI want to come back again to give the other dishes a try.\n\nThe service was excellent though!", "author": "Kim D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-05", "description": "Average. Maybe a smidge above average. Certainly not with coming back for. Had the scramble which was average brunch fare.", "author": "Meryl D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "Another day, another restaurant week review....\n\nThe restaurant atmosphere is nice but it is a bit loud. It's a bit cramped (so voices get loud) and they play jazz music on top of that. It was not too loud to hear the other person and tables for more than two seemed to have more space.\n\nThe service...exceptional... they were very good making sure we had everything we wanted. \n\nThe only issue was that I eat a late lunch and was not that hungry. They would not let us split the restaurant week 3 courses and I had to order something. I got the soup and both of us ended up eating too much. It's not that big of a deal but was an inconvenience.\n\nThe food - good but nothing I will be craving but solid good food. Good portions too. We got tghe cauliflower soup, the mussels,  the steak with fries, and the profiter rolls. The steak was a bit salty but good. The best part was the mussels. They were in a mustard sauce but it worked and was good.\n\nWe went for restaurant week, but they also have a prefix 3 course dinner every Monday.\n\nOverall pretty solid place", "author": "Jon C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-06", "description": "A lovely vibe with an interesting menu. I ordered the socca from the brunch menu and found it to be quite bland. My aunt had the scrambled egg with merguez sausage but spent most of the meal looking for the tiny pieces of sausage. We decided to treat ourselves, after lackluster mains, to the creme brûlée French toast. It was lovely and fluffy but again lacked any depth of flavor. The accompanying creme fraiche and berries weren't enough for the portion of toast. Lastly, in a restaurant that must have had at least a dozen families with small children at one time there was no baby changer in the bathroom. That seems like an easy fix, surely!", "author": "Hardeep J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Somehow out of our party of 6, I was the only French Louie newbie. And for my first Louie brunch, I was advised to get the Cordon Bleu. I did as was told, and was glad. The fried chicken was tender, the Benton's ham was not too salty, and the sauce Mornay was perfect. It's a huge portion, but I was a bit disappointed that mine was not quite as huge as others at the table. Oh well!\n\nI probably should have stayed with a regular Bloody Mary which actually looked nicer than the $1 extra Everything Mary with the bagel infused vodka?! More fixings. Oh well!\n\nThe next time I come for brunch, I'll be sure to try the Eggs Louie, or one of the scrambles, but at $13 for scrambled eggs, I might hesitate. Oh well!\n\nService was friendly and the food came pretty quickly. Since this is not one of those all-you-can-drink in 90 minute type of brunch places, we didn't feel pressured to rush. A nice leisurely pace at the expense of not getting buzzy. Oh well!", "author": "Jerry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "Kids don't belong in midnight movies, hookah bars,S \u0026 M dungeons or French Louie. My husband and I were looking for a non-kid friendly restaurant since we wanted an adult meal out without our lovely kids. That's a tall order in Brownstone Brooklyn. This seemed like the place for an adult meal on a Sat evening...until we heard 'em. Not one, but two little ones, talking loudly in the yelpy way kids do from the beginning of our cocktail through to dessert. Please peeps, 95% of the restaurants are kid friendly; please take your kids to those and leave some safe space for an adult only eve. I was with my amazing lovely kids all day and I love them and love yours too, but come on! \n\nFood was excellent. There didn't seem to be any specials when we went, or at least our attentive waiter didn't inform us of any. Husband said it was one of the five best meals he's ever had! He had the duck. I only noticed one vegetarian entree on the menu (Socca-something).I ordered it. It was interesting but just OK. We'll be back again and we wont bring our kids to a restaurant that isn't meant for kids. Please save this supposedly safe space for adults and we'll do the same.", "author": "Felicia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "This place is absolutely sublime. It's one of the few restaurants in Brooklyn that actually make you feel like you've been transported to another place and time. I had brunch here on a beautiful autumn morning. From the moment I entered the restaurant I felt welcomed and well taken care of. The staff here is really amazing. \n\nThe food y'all! Let's talk about this food!!! The food is absolutely delicious! I dropped about 90.00 bucks on brunch for two and I didn't leave feeling robbed. I was filled and satisfied. The avocado toast with egg on top was just wonderful. The creme brûlée French toast is the stuff dreams are made of. \n\nI don't know how they make it but God it's good. The crusted sugar on top is so delicious and the rest of the bread is soaked and soft. It's an amazing combination. Top your brunch off with some champagne and I promise you will not remember how you lived without this place.", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Came here last night for Restaurant week. Everything we had was awesome along with the wine and the beer. Service was great ! Place itself is so pretty with a beautiful outside area\n\nFor starters we had the Steak Tartar and the muscles which was in some type of mustard sauce\nFor Entree we had the Duck Confit and the Pappardelle \nDesert we both had the Lemon cake with berries", "author": "Alexia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-22", "description": "If you'd like to take out a date and enjoy some good food but don't want to be bothered with hearing your dates stories, oh boy do I have a great place for you!  I have to admit, the food here is pretty good but it is truly too loud in here.  They also sit tables very close to each other so if space is what you desire, you won't get that here.\n\nWe typically order mussels in the traditionally served white wine / red wine / champagne sauces so the mussels in a mustard sauce here were definitely something that we were looking forward to and they were truly delicious but too heavy.  The portion size is also pretty small -- not like the typical pot that you get elsewhere.\n\nThe smoked sardines were very tasteful but you only get 2 of them.\n\nThe 28 day aged steak was ordered medium but it came out as well done.  I don't like sending food back so I just chowed it down.  Flavor wise it was ok, but at $50.00 for a 12 - 14 oz. cut, I feel that it should have been larger.  The steak came with a side of red rice and kale which was delicious.\n\nOverall, the food was okay but it's simply too loud here.", "author": "Leonard G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "Excellent dinner the other night! We shared gougeres, the radishes with olive butter and a delicious kale salad to start. The steak frites was perfection and the house steak sauce is to die for. Terrific dessert and great service made for a really nice dining experience..", "author": "Leslie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-21", "description": "The menu was interesting, and the food prep was lacking in thoughtfulness for the eater. I had some lunch special - a beet salad served on chickpea flatbread. Let me assure you - it tasted delicious. Delicious! I will definitely try to re-create it at home. But, the beets were too large, requiring a knife/fork (and leading to some mildly uneven roasting), and the chickpea flatbread was so difficult to eat that I couldn't enjoy it with the salad atop of it.\n\nThe iced tea was skunky. I know it's not common to have iced tea in a \"French restaurant.\" But if you're going to offer it, make it good.\n\nFinally, the service was just so surly. As in, the host never used words around me. He stared at me when I walked in, never greeted me, brought things to my table (e.g. menu, drink) without saying a word. And my actual server finally came over and her greeting was \"You ready yet?\" Just set me up to be mad at the place. Luckily, the food actually was tasty, with the above caveats.", "author": "Cathy B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-23", "description": "Pappardelle was horrendous!! Don't do it. The steak was fine. Brussels sprouts were not good. Service was good.", "author": "Mindy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-17", "description": "FAN-TAS-TIC!!!!!!! Went for dinner - LOVED! Went for brunch - LOVED! I can never go wrong with French Louie because few people dislike French food and even fewer dislike French food that is executed perfectly. Duck fat potatoes, escargot with bacon..... like Julia Child with a lumberjack flair.\nI went for a double date, with my parents, and with my boyfriend - all three times were exquisite! I will for sure be coming back.  \n\nBravo Doug Crowell and Ryan Angulo!", "author": "Derek S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "Best brunch in the neighborhood and the wait time let's you know it's true.  Cocktails so tasty, hollandaise on point, fresh everything.  To the trout poboy I say thank you.  Crab, salmon and all the fishes delicious.  Really happy French Louie is in the area.", "author": "Eve H."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}