{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "We were really looking forward to trying one of our local neighborhood restaurants and were sadly disappointed but the service and average food. We went with a group of six and we all ordered appetizers, mains and desserts. \n\nThe good was that the mussels were delicious. \nThe bad was everything else including the male server who had attitude. I ordered the steak frites and my fries were soggy and the steak was mediocre. Overall the mains were average at best. \n\nThe desserts were overly sweet which overpowered the other flavors. \n\nThere are too many great restaurants in this city... so why would we bother returning to French Louie?", "author": "Misha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "nice casual french bistro in boerum hill. came here for restaurant week (RW) and the menu is rather extensive compared to lots of other RW offerings around the city. specifically, they offer lots of items that are actually ON their menu. I enjoyed the generous portions of mussels normande to start. could really taste the mustard at times. I couldn't decide between the trout and steak frites, but I succumbed to the steak frites. the bavette steak was nicely seasoned and cooked to a perfect medium. can't say the fries were that great though, but they were decent. my fellow yelper peter y let me try some of the trout and it was delish as well. finished off with the profiteroles which were a nice light dessert. overall, great meal in a charming setting.", "author": "Peter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "Two visits. Two wins. Really loving French Louie. It ain't cheap, but everything is so good it's worth the price.\n\nThey have a drink called the Everything Mary (brunch). It's a Bloody Mary with EverythingBagel-Infused Vodka. Whatchutalkingbout Willis? Get this drink. It's inventive and amazing. Garnished with a bagel chip to boot!\n\nThe brunch menu has something for everyone and the Eggs Louie dish was incredible. Perfectly poached eggs on a toasted croissant. The only thing missing was the blanket I wanted to wrap myself in while I was eating it. Get this dish. Just solid made-with-love food choices all around. \n\nOne challenge FL seems to face - but hardly worth losing a star over - is the staff. It's been a bit inconsistent with the friendliness of service. Some seem to walk a fine line between friendly and phony. Not a bit deal, smiles are smiles, but I've noticed a few of the waitstaff trying too hard (reaching over guests meals to refill water glasses, for instance) which can come across as a lil' rude and/or disingenuous. \n\nOtherwise, amazing.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "High price, but still a good value at that price point. Food is consistently delicious, with multiple seasonal dishes on the menu. Service is consistently great. And ambience is nice. We keep coming back. And, based on how consistently busy they are, I think the neighborhood agrees.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Happened upon this place and it was Restaurant Week (which usually makes me cringe as a former hospitality person). The menu was fantastic, dare I say the portions were a little big, but truly tasty and fresh. Unlike many restaurants they didn't \"cheap out\" on portions or quality. Everything was prepared expertly. Will definitely go back in the future. Highly recommend the gazpacho, mussels and berry dessert. Also, the sparkling Jura wine from Tissot never disappoints.", "author": "Eric H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Good food... Perfect setting! Mike made magic in serving us!! This is definitely a Brooklyn gem...", "author": "Stephen J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "I came to this restaurant for restaurant week and it was great!\nFood was delicious and service was outstanding. Highly recommend this restaurant.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "Our experience at French Louie was tre magnifique! We really felt transported to a classic French bistro via the amazing food and considered service. Our waitress may have been a bit new (as she seemed nervous) but she did a fantastic job walking through the entrees and offering suggesting for our drinks. \n\nFor food, we had: \n\n- Chicken Liver Pate - I love pate, but this was not my favorite, but it may be a matter of texture. The pate was a lot more fatty than I anticipated. \n\n- Pickles - Get them! I loved the carrots the best\n\n- Roasted Butternut Squash Soup - I know we got the least French dish on the menu but hear me out.  Everyone in our party of four loved the soup. The chickpeas were so tender and the butternut squash was incredibly flavorful. It was also a fairly dense dish all things considered. \n\n- Bavette Steak - I did not try the steak but damn those french fries were amazing! The accompanying salad was also thoughtfully dressed.\n\n- Gnocchi - this was a solid vegetarian option as the gnocchi were incredibly soft and tender. \n\n- Goat Cheese Ice Cream and Profiteroles - the profiteroles were not my favorite but I loved the homemade ice cream. Don't be thrown off my the goat-cheese flavor - it's actually very subtle.", "author": "Bianca Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "Things my girlfriend (who, let me say, is extremely picky) said at our dinner:\n\nFor ambiance this place is an 11. (Spinal Tap reference!)\n\nOh my god this is good (Buckwheat Pappardelle).\n\nWe have to bring my parents to this place. This place is sooo cute.\n\nWe went on the first night that they opened cause it coincided when we wanted to go out and we were curious (we both like Buttermilk Channel a lot). Both the food and service was excellent. Everything we got was great plus we saw some dishes come out that we were like damn, that's for next time (especially the soup!). It's a perfect date spot but I could also see it being an easy place to take the family or friends as well. Prices aren't that bad (we had two drinks each and dessert, an appetizer to share plus two entrees and it was around 100). I would highly recommend the Flounder. It was cooked perfect and the blood orange is an excellent touch. Also it's always a great touch when the owner comes over and thanks us for coming out. The guy was really nice and made us feel super comfortable. All in all, a great experience.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "Actual quotes from my actual wife:\n\"This is Grocery good\"\n\"This may be the best restaurant in the neighborhood\"\n\"This is what Dover was trying to do\"\n\nThis is the new outpost from the owner of Buttermilk Channel in the old Jolie location on Atlantic. It's cute that this space seems to stay French. \nI always thought this space was a tad awkward, but with the light colors the space works better (IMHO) that it has in past reincarnations. \nHere's what we liked.\nDrink: Jura Cremant. Sancerre Rouge. Normandy Old Fashioned (actually, didn't get, but totally should have).\nEat: oysters. Snails (there's bacon). Lamb (basically slow cooked lamb in a rich wine sauce). Oxtail with homemade pasta. Pineapple tarte Tatin. \n\nService was top notch. \n\nThis is a somewhat casual place that makes kick-ass food. Is it a destination spot? Maybe not. Would I come from Manhattan to eat here? Probably not. \nIs it in the top-5 list for this end of the neighborhood? Easily.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "So far, a solid entrance into casual french food by the Buttermilk Channel folks.  I can't really say there was much \"off\" about the experience to not give it 5 stars...but 5 stars is FIVE STARS, people!  We put our name in and wandered around for the 45 minute wait, as the bar was too crowded for a pre-dinner drink.  \n\nThe service was great--our waiter did an excellent job describing and recommending our wines, starters and entrees.  The graciously pour tastes of wine, so you're not stuck being an asshole if you don't like your glass.  Thank god.  I hate not being able to taste the wine, unless I know I'm ordering swill in a bottle and just have to suck it up.  OMG, the radishes with butter.  I love radishes with butter.  OMG, the gougeres! I love puffy cheesy pastry.  I won't even tell you about the warm lobster whatever delishthing I started with.  Don't eat.  Save for me.  I got the mushroom something tasty thing for an entree. \n\nThe profiteroles for dessert were light, fluffy, airy and flakey.  My only complaint was that the fennel ice cream tasted like a big glob of licorice, and it was dolloped ON and melted THRU the profiterole so you couldn't get away from the taste.  We were actually asked what we thought of the dessert and both agreed it was \"too much\", the ice cream should be on the side.\n\nAlso, we were seated at their \"communal table\". Unlike B-Channels, the \"communal table seat about 7 people, and we were put with a table of 5.  So it was like we were crashing a group's big night out.  Too cozy under the circumstances.  There are plenty of 2 tops (and a no ressie system), so we should have been asked if we were OK with sitting there.  It was awkward, since the other group was quite boisterous (and  had every right to be), it was just hard to have a normal conversation under the circumstances.", "author": "Kelly T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "Started with a delightful AF Dog of the South something tequila-based cocktail. I fully enjoyed my cod but you shouldn't expect to be filled by it. Mussels were a big hit. The BF was slightly disappointed by the Berkshire pork but appreciated the carefully selected seasonal produce. There were a couple of hiccups in service, but they were graciously acknowledged by the staff. Ambience was trendy BK and intimate. Would recommend to others!", "author": "Greg W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Really good meal with one objection. The drinks were delicious and we ate mostly wonderful food, but would definitely advise anyone interested in the steak frites to go with the bavette. My husband ordered the dry rub which turned out to be about 1/3 fat and gristle, despite a significantly higher price. We mentioned something to our server, but they didn't make any adjustment to our bill. We overheard at the table next to us that the lamb chop was the same case with respect to being a mediocre cut, so definitely a pity. That said, the bavette was pretty much perfect, and we really enjoyed the pickles and fois gras to start!", "author": "Alit E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "Amazing service. Wait staff was competent, friendly and efficient.\n\nGood orange madeleines are hard to come by and french louie has definitely got it down. MUST GET THE eggs louie - has real delicious crabs!!!", "author": "Cody L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "Came here with friends on a Thursday night and it was still packed. Good thing we had a reservation. Food was overall good as were the drinks, but pricey. Drinks were small and weak on alcohol. \n\nFor apps we got escargot, foie gras and roasted cauliflower. The only thing out of these I recommend would be the cauliflower, which is disappointing because I usually love foie gras and escargot. Entrees were better. Got the lamb chops and they were tasty.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-09", "description": "This was a great little stop. Very quaint. I would definitely go back. Really cool neighborhood. Great service. Tasty bites. Great drinks. 5 for ambiance and 3 or 4 for food. Had steak that was too well done and fatty. Muscles were okay.", "author": "Burton M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Very nice and classy , went here for brunch  , service was good , good food but limited choices !", "author": "ID K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-05", "description": "Atmosphere: Extremely romantic, dimly light. Perfect for date night. Cute tiny little bar up front to sit at while you wait for your table.\n\nFood: I had a salad and the roasted root vegetables which were delicious. HOWEVER, my date ordered his steak medium rare and it came out VERY WELL DONE. No, no, no. \n\nThis is the only reason I give it two stars. For a French spot, you should be able to properly cook steak and frites! Get it together, Louie.", "author": "Kelsey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "French Louie is a very cute brunch spot! The food is good (although not crazy outrageous but definitely solid). I ordered the smoked trout eggs and they were more soft scrambled and topped with creme fraiche and scallions. It was a deceptively large portion and difficult to finish but was truly yummy. The toast it was served with was good but a little too crusty and very difficult to bite into. The salad is was served with was fine. The eggs tasted great with a side order of the duck fat potatoes which were delicious. We also ordered the warm madeleines which were nice and served with a yogurt dip (with a hint of cardamom that I honestly could have lived without). \nThis place is so cute and there are so many other delicious sounding things on the menu that even though the food wasn't perfect (although the service was!), I'd definitely go back.", "author": "Sara P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "The cod with kimchi was awesome! atmosphere was lively but still felt intimate and staff was really great! delicious roasted veggies as well- maybe the best Ive had!", "author": "ellie i."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}