{"aggregateRating": {"reviewCount": 341, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Best brunch I've had in a loooooong time. Get the eggs louie or whatever the eggs benedict dish is called. its amazing.", "author": "Genevieve M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-06", "description": "Bright cheery atmosphere.  Great music.  Friendly accommodating staff but why oh why does it take over half an hour to get your food?   Multiple visits continues to prove this.   Need more gluten and dairy free option.", "author": "Mari P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "One of the best meals I have had in a while. Started with the oysters and gougeres. They were superb! I highly recommend the trout- perfectly cooked! I don't think you can go wrong with anything on the menu though.", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-24", "description": "Very friendly staff.\nBut, horrible food! Wrong decision to go to this place for dinner. The worst squash soup I have ever had, tasteless and too thick with raw prices of carrot! pan fried trout: two thin layers of tasteless fish, no sauce, some pieces of Apple! The dessert, chocolate mousse?? Horrible. Grainy texture no taste of chocolate. I bet the chef has never tried their own food. Oh, and the wine, cheap wine for $14 per glass. Is his a joke? Absolute rip off.", "author": "Maryam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-24", "description": "There are so many great restaurants to choose from in Brooklyn that as a rule I try very hard not to go to the same place twice. I will 100% be breaking my rule for French Louie. So happy this little gem is only a few blocks from my apartment. \n\nThe restaurant is a bistro-type atmosphere: tea lights on table, bustling wait staff, closely packed tables and cute bar area in the front. While it can get pretty loud (there were times when it was difficult to hear my three table mates), I'd still call the place warm and inviting. \n\nMy meal started with the roasted carrot and citrus salad - light and  delicious. Next up  the pan-fried skate over dirty rice - another dish I would order again in a heartbeat. My tablemates were equally satisfied by their Bavette steaks and the handful of apps we ordered including the fried anchovies, pickles and radishes. \n\nThe wine list is relatively affordable (you can get a decent bottle for around $42 bucks). \n\nCan't wait for FL to start serving brunch (I imagine there will be Buttermilk Channel like waits), but will definitely be visiting for dinner again soon.", "author": "Mandy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-15", "description": "Slow and impersonal service. Apparently medium well here equals burned.  Glad the wait was short because I would be angry if I had a long wait for such crappy food and bad service. Save your money and try someplace else. Two stars just because the wait was short otherwise it would be one.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "Not only is the food here amazing, but so is the service. Had my first experience here on a Friday night- it was packed. We were seated rather quickly for how busy it was and the hostess was so friendly and accommodating to my dinner date who is rather picky and not the best restaurant guest. We had the frenchie salad, the sardines, the pappardelle, the beef bourguignon, and my dinner date had the steak. All fo which were AMAZING. not to mention the plethora of cocktails that were executed perfectly. Don't be dumb. Eat here.", "author": "Kristen P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "This place is absolutely delightful. My husband and I came here for our anniversary and the food and service was impeccable from start to finish. The scallop ceviche was light and refreshing. The gnocchi was insanely good and my husband got the 28-day steak which was delicious. We finished it off with the pineapple tart which my husband didn't want to share after he tasted how delicious it was. By the end of the meal we were deciding all of our friends who we wanted to bring here. This place is such a wonderful addition to the neighborhood!", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Excellent food (duck breast, frites, mussels) and really skilled friendly servers. The decor is lovely, minimalist chic, including the outdoor space.", "author": "Anne G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "My husband and I went out here on a friday night after randomly finding this place nearby us on Yelp and I gotta say that the food and service was great. The waitress kept apologizing about the wait but we only really waited 10min so it wasn't so bad (but I did make reservations). They were so nice and attentative the whole time. The fried anchovies were amazing so you must try this! We had their cocktails which were also very good. I had the bavette steak (delicious) and my husband had the pork and clams which was also a good and hearty dish. For dessert we had their homemade pistachio ice cream and pineapple tartin with coconut ice cream. We were in absolute heaven.", "author": "Ruth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Food and cocktails are delicious. Very fresh, simple and well-balanced dishes. Something for everyone including those with a refined palate. Great presentation and service. Bustling and louder in main space. Quiet and pretty patio space for warmer weather.", "author": "Gungsadawn K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "Amazing food and great service by the staff -- had the gnocchi and pan fried skate with profiteroles as the dessert.  Waitress was very attentive and multiple people on staff asked us about our experience throughout the meal.", "author": "Stephen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Great restaurant, definitely not talked about enough. They are a great brunch spot, and a great dinner spot. The best of French food that we love, but also just things that can be hard to come by, like soft scrambled eggs.\n\nThe staff is knowledgeable and good. The food is excellent. They do so many things well it's hard to name them off. Oysters are solid, lobster (in the summer) is solid. Champagne excellent. \n\nGood place to do it up in Brooklyn.", "author": "Petra A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-24", "description": "Excellent scallop starter but the bluefish was not cooked enough. Service is excellent. Wines too expensive.", "author": "JP A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "French Louie is a French-American bistro from the owners of Buttermilk Channel. The menu offers a great selection of fabulous and tasty fare.  The owner is always so friendly and welcomes us each time. The bartenders are adept at making any cocktail one could request. The servers are warm and friendly and the backyard garden is always packed in the nicer weather.  This restaurant is on a consistent 'go-to' for me and my husband and we love to take friends there as well!", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-03", "description": "Warm, cozy place. Interesting and  diverse menu, however some dishes fell a little flat. Overall good food though, and I will definitely return", "author": "Vito B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Love this place.  Great energy, and great service.  Had the lamb which was delicious", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "I've been here now for brunch, lunch, and a beer. All three times have been without complaint. Try the creme brûlée French toast (brunch) or chicken paillard (lunch); they are to die for, and the staff are truly charming and friendly.", "author": "Trevor L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-10", "description": "Nice, with some work yet to be done. Two stars for the food, with a bump-up for the friendly service.\n\nWe started with Anchovy Frites -- i.e., fried anchovies, not fries with anchovies.  Interesting, but I won't order again.  The gougeres were puffy but boring, with barely a cheese flavor.  Bavette steak was tasty, but pricey at $25 given the small portion.  Cocktails were nice.\n\nLast word is on the decor: ugly, ugly, ugly.  Really detracts from the dining experience.  Cheap flatware, too.  Oh well.\n\nNot worth a trip, but fine if you happen to be on Atlantic Ave.  But only meh.", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "Review for dinner on a Saturday night.  For 1st-timers, we had a wonderful time.  Excellent service, very creative dishes and wonderful decor! Dessert and wine choices were amazing!   You had me at goat cheese sorbet and oh man how can I forget the profiteroles...simply delicious!", "author": "Jj L."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "French Louie", "address": {"addressLocality": "Boerum Hill", "addressRegion": "NY", "streetAddress": "320 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JoFDgSIkX8qQRlwiYk1y9g/ls.jpg", "@type": "Restaurant", "telephone": "+17189351200"}