{"aggregateRating": {"reviewCount": 102, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Very impressive! The price is very good and good portion. We ordered rice and noodle and chicken wings, cheaper than other places, very surprised by the food quality! Tasty and want to come again. Will come for sure next time if we come to Brooklyn. Hope it has a second store in Manhattan.", "author": "Summer Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Food are so delicious，clear and cheap，and dishes are big portion。I will come back to eat with my friends or families。", "author": "Yuanting H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "I stumbled upon this restaurant while searching for a quick bite downtown with bae, and lemme tell you. This is the BEST, FRESHEST, MOST AUTHENTIC, CLEAN, AND FAIR PRICED dumpling restaurant I've ever been to. I come as often as I can. My orders are done so fast, always hot, and satisfying. We need more places like this!!!", "author": "Brooke N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "The overall experience was good. I enjoyed the stir fried beef. But I do wish the service was quicker and they have reservation available via their website. Anyhow, I will come back again when I want some chinese food.", "author": "Saul K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "So filling, so quick, so good! Great price! I'm always happy to see them making fresh dumplings everyday!", "author": "Lety M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "This spot has an absolutely delicious cold noodle, paired with vegetable dumplings all for $7 I can't get enough.", "author": "Laura B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "For a few years, we walked right by this place.  The last few times we actually stopped to look at the menu and it was much nicer than I remembered from the last time I had looked.  So a few weeks ago, I was craving authentic Chinese and figured I'd give it a shot.  I was most impressed.  The Chicken Dumplings were PLUMP with filling and very tasty and I probably would have been fine with a meal of 9.  The \"dry noodles\" with pork were not what I was expecting (the meat and bean sauce you get at the hand-pulled noodle places).  Instead it was a very tasty, high-quality stewed pork like you'd get in a Xian Foods \"burger.\" \n\nI'd probably give a full 5 stars if they served fresh, hand-pulled noodles.  I also wish they had real hot chili/oil available on the counter/tables instead of Sriracha (great for Vietnamese, but totally out-of-place for Chinese).  I may get to go next time so I can add my hot oil at home.\n\nWill return again and again!\n\nUpdate: Raising from 4 to 5 stars. We eat here almost weekly. They do have hot chilli behind the counter if you ask. Their rougamo sandwiches are fantastic and an especially great deal as a combo (with soup). Their soups are good but you have to hit the \"sweet spot\"--too early and they may only have one type ready (corn chowder or vegetarian hot and sour), too late and they may have none. We've almost never been there when there was NOT at least one Chinese (like FOB Chinese) customer eating there, so that is always a great sign that a place is both authentic and not a rip-off).", "author": "Matt B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Best tasting pork and chicken dumplings. They are also the most reasonably priced restaurant in the area. The dumplings are made fresh to order unlike another well known dumpling seller nearby. Have gone here for lunch about 10 times in the last three months. Soups are also excellent.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "As a Chinese I'd like to endorse the authentic dumplings (gyoza) here - tasty and juicy inside. The beef in noodle soup is good as well, aromatic and tender. And all of this is quite cost effective, good for either locals or tourists.", "author": "Travis W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "Cheap noodles and dumplings. The noodles have a flavorful broth, the dumplings are filling and super tasty. There are some rice dishes but I'd stick with the noodles. The rice to meat portion is heavily weighted to the rice, you will have lots of leftover rice. Super cheap and tasty, definitely stop in.", "author": "Daniel Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Heaven sent dumpling spot. I pray to god this play stays in business forever. The Beef Noodles in Soup is so amazing.", "author": "Sapphire J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Wanted a quick meal in the neighborhood and decided on xifu.  Ordered the beef noodle soup and salad with a side of pork dumplings.  Very affordable and really tasty.  The dumplings were so good we ordered another round.  Will be back for more!", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-31", "description": "This place was once \"Siz-In-Pan\" but has since been replaced with \"Xi fu Foods\", which still sells dumplings, though not as good, and features a wider menu. The other offerings lack flavor and seem to be a half-hearted attempts. I've tried the rice dish with meat on top, egg drop soup and the pork bun/burger. The egg drop soup was strange. It had corn kernels and was very sweet which is nothing like I've had before... not in a good way.\n\nWould I try this place again? Probably not. Definitely not as good as it used to be. Sad.", "author": "Jimmy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "In town for a show at BAM, walked around the hotel to find a place to eat.   Came across Xifu Foods....amazing.   Hole in the wall, low on atmosphere but high on flavor.   Had the 12 boiled pork dumplings in the hot and sour sauce/soup.   Husband had the curry deep fried wings and pork noodles.   The jiaozi were perfect, juicy, just the right chewiness in the wrapper, and the sauce was just the right combo of chili oil, chilies, black vinegar, and scallions.   The pork noodles looked wonderful....stewed pork fragrant with star anise, cubes of firm tofu, bean sprouts all topping a nice bowl of extra long chewy noodles.   And the prices are dirt cheap.", "author": "Dean W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Yo this place was amazing! Supper cheap price but amazing flavor and combos. Simple menu but delicious. I had the beef noodle soup and chicken dumplings $8 and amazing flavor. Seriously coming back tomorrow. HIGHLY recommend this spot.", "author": "Iván G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "A vey modest little spot hiding in the never ending expansion of downtown Brooklyn. The dumplings are handmade with the most flavorful juicy fresh filling. Every bite reminds me of homemade food. I had the pan fried pork dumplings, sesame noodles, pork sandwich, and boiled dumplings in soup. Every dish was made to order and I couldn't ask for a better Sunday morning meal. The atmosphere of the place is similar to a typical Chinese take out. So it's easy to dismiss them as one of the fast food places. But this is as good if not better than the dumplings I had in Flushing (Chinese food Mecca in Queens). After you place your order, be patient, don't keep asking how long is your food going to be ready. Appreciate that they make your food from scratch as we are losing small mom and pop shops who just want to feed you good food. The sesame noodle is also the best I've had. The sauce has a hint of Sichuan peppercorn. Ask for spicy you will get a generous dollop of homemade hot sauce.", "author": "L T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "One of our favorite places recently! Both beef and pork rougamo are awesome, the sesame noodle is also pretty good, with such reasonable price, it is definitely a good place if you want try some decisions Chinese food!", "author": "Ruolu W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Great food, friendly people, and clean restaurant! The veggie dumplings are super delicious!", "author": "Yuan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Very authentic Chinese food for an affordable price. My favorite and go-to place for dumplings and noodles in downtown Brooklyn. Beef noodles are the best.", "author": "Amanda P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "the food is cheap and the size is huge. as a Chinese, i can ensure you this place is totally worth to come", "author": "Jingfei H."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Xifu Food", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "318 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/27VPX8q7znNiwkkS5xeKRA/ls.jpg", "@type": "Restaurant", "telephone": "+17182378886"}