{"aggregateRating": {"reviewCount": 102, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Xifu food is a small but cozy place when you can enjoy delicious dumplings and lots of noodle soup goodies at a reasonable price in Brooklyn.  This is my second time there and i must say i was never dissapointed . On a good day yiu can get to see your dumplings being handrolled right on the premises it couldn't get any better than that. I will definitely be recommending this place to my dumpling loving friends.  Keep up the good work.", "author": "Almaria B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "The stewed pork noodles were cheap and delicious. The portion size was good. The fried pork dumplings weren't that great (maybe because I waited to long and they got cold). \n\nThis is a great place to pick up a quick bite. I will be back!", "author": "Mimi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "This local place is a gem! The pork over rice with egg was delicious and big portion. Sometimes you crave that nostalgic childhood comfort food and that bowl just hits the spot. My Irish husband has had his fair share of beef noodle soup and he said this place has the best beef noodle soup! Prices are unbeatable, super fast service. We'll definitely be back!", "author": "Mimi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "Love it here! Great dumplings, made fresh. The prices are amazing for this area... definitely check this place out!", "author": "Rena M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-07", "description": "$2.00 for six hand rolled chicken, pork, or vegetable dumplings, add another 3 dumplings for $1.00. The math will get you in the door. These dumplings are made fresh to order but don't expect crispy fried dumplings, these are not of that texture, but they are great for the price. The dumplings areaverage and tge yo go packaging does noy give you a top for your dumplings just a wax paper wrapping. I carry out because the place is always crowded, the location is on a busy street in the heart of Downtown Brooklyn.\n\nThe Beef Noodle Soup is life changing.  For $6.00 you get a bowl of hearty beef chunks, rich broth, crisp vegetables, bean sprouts, and noodles, lots and lots of noodles...It was worth every penny. \n\nThis place is low on amostphere and space just get a carryout and enjoy lunch at your cubicle. \n\nBring cash unless you plan to spend over ten dollars.", "author": "Letty C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "I was reallly excited to try the food -- they look really good on menu and so low on price, but I got so disappointed when the dumplings came with little meat, the minced pork rice dish came with almost no flavor. I ordered a lot but had to throw about half portion away just because I didn't want to eat more. \n\nAlso it's not the cleanest place you could find even for Chinese food standard. I didn't mind that too much, but the food put me off.", "author": "You Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "Cheap and authentic Chinese food is a little hard to find around Downtown Brooklyn, but in comes Xifu Foods. This place provides some delicious Chinese food for cheap price.\n\nI ordered the pork dumplings, spicy cumin beef rougamo, and the beef noodles in soup. \n\nThe pork dumplings was good. Outside was thin and crispy. Inside was really juicy. The juices was dripping out. \n\nThe spicy cumin beef rougamo was decent and its not overly spicy. There's a slight hint of spice in there. \n\nThe beef noodles in soup was amazingly delicious. The soup was hot and flavorful. Full of beef flavor. The noodles were spongy and is perfect for this kind of noodle soup. I think you should add some vinegar and hot sauce to kind of cut back on the fattiness of the soup stock. \n\nAll that food and I spent a little over $10. Heck yeah...I'll take that any day.", "author": "Alan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "Always walk by. Decide to get a snack. Small place, looks cute. Staff is friendly. Inexpensive based on the area it's in. We ordered chicken dumplings, order of spring rolls, curry chicken wings and a chicken dumpling soup. The dumplings were good, I mean based on the rest of the food i think this was my favorite. The spring rolls were blah. The filing was nothing much...i left like it was mostly the outer casing. I didn't like the curry chicken wings but the BF did. They are meaty but don't expect a sauce with this. The dumpling soup was ok the BF said. It was just plain broth with green onions and chicken dumplings. Honestly it wasn't all that. One of the people in the back(kitchen) kept coughing as if they had some phlegm going on. It grossed me out. No thanks I wont be back.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "The dumplings here are inexpensive and tasty but he service could use a little help. \nEither they mix up the orders - giving your order to someone else or tack on 10 extra mins because they're being \"made fresh\"\nToday, I called in my order and arrived 15 mins afterwards only to be told it would take another 10 mins to cook. Either they started when I walked in to pick up or they are the slowest dumpling makers in all of Brooklyn!\nDon't visit if your short on time or value your luch", "author": "NiCo R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "It's near the train station. Freshly made comfort food at such an affordable price with seating! come here after work whenever my lunch failed me.", "author": "Foodie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "I love this place. The food is excellent and the price is cheap! I would go here every night just for the stewed pork on rice (F1).", "author": "Deb C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-23", "description": "Not enough protein too much Rice. Yeah sure the prices are good but when I order a rice bowl I want more than just a top layer of meat over a giant mound of rice. \n\nBtw I asked for beef and got pork. AND THE SRIRACHA IS CLEARLY NOT SRIRACHA! \n\nThe only thing stopping me from giving this place one star are it's prices.", "author": "Sam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "Moving this review to correct business. Had it under business that was previously in location. \n\nWas surprised by the quality and quantity at the price. Had a chicken bowl and dumplings and it came to $8 and change. It was my first time ordering and I really wanted to try some dumplings but it was honestly a lot of food. The chicken bowl on its own was pretty filling and I would have been enough but at $6 in nyc I was expecting them to skimp on the portions. The bowl is a rice with some chicken katsu and a nice green papaya salad so a sort of Asian fusion. The pork dumplings were very tasty and well prepared with a nice sear on the bottoms. Would definitely try again", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "Our trip leaving NY was cancelled beause of the snow， so we had an extra day to explore Brooklyn. then we were luky to find this hidden but amazing place in our last stay in NY although we walked a lot in snow，it was worth it.Every dish looked so good and we ordered a lot and had a way too full dinner. the beef noodle soup is so good that I just did not want to stop eating. the corn soup made me miss home. The prices is so good and we ordered 5 kinds of food that just needed to pay $18. The host is super nice！", "author": "Yue B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "Not bad! Great value for what you are paying for. Definitely go for the dumplings (6 for $3? yes please). The other pieces on the menu are a bit hit or miss depending on your taste.", "author": "Austin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "This place was super cheap. The beef noodles soup ($6) tasted pretty good. Love the beef and the noodles but I just didn't drink much of the actual soup because it was a bit too oily for me. Ordered the pan fried chicken dumplings ($2) as well and they were amazing, they were pretty big in size, perfect dough consistency, and juicy on the inside. So happy I went here for lunch.", "author": "Kay Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "Ordered stewed pork over rice and pork rougamao, which were okay. The stewed pork for the rice had very little flavor and very little portion of protein to rice ratio. The eggs were okay, didn't have that strong flavor I was looking for. It was weird to have warm cucumber as vegetables, maybe other leafy greens would be a great pairing for this dish. The rougamao, however, was absolutely delicious and tasted freshly made! The outside was crispy and the inside was so soft and flavorful!\n\nMy only complaint was the wait and very limited seating. I recommend calling them to order 15-20 minutes in advance to speed up the waiting time. \n\nBut for the amazing price, I can't really complain!", "author": "Xin Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "One day I will be brave enough to get past my favorite Pork Dumplings and Hot \u0026 Sour Soup Combo for $6!\n\nLove this and always drop by when I'm in Downtown!", "author": "Rob B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "Overlooked authentic Chinese at very reasonable prices. Seating is limited to 3 tables. I stopped by on a weeknight and ordered pork dumplings, a pork bun, and sesame noodles to go. Staff was super fast and friendly; they spoke Mandarin, another indicator of the authenticity. \n\nTotal = $9\n\nThe dumplings had a rather thick semi-fried skin, which balanced well with the juicy filling, which isn't as salty as other comparable fast food places. Careful when you bite into it as the juices started squirting out. \n\nThe pork bun is not as oily as other comparable ones and comes with more fatty parts in the pork. I'd like to try the tofu with egg one next time since the bun is perfectly crispy.\n\nThe noodles were pretty good but wish they'd put more cucumber and bean sprouts. They use peppercorn oil and sesame. You can tailor the spice level. Will definitely come back!", "author": "Jess J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-07", "description": "Went here during lunch break with my coworkers, I love dumplings. I got the veggie dumplings, they were very good and the price was right. Only thing I didn't like; the hot ginger tea is from a packet and was way too sweet. Also, there isn't much seating.", "author": "Alex P."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Xifu Food", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "318 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/27VPX8q7znNiwkkS5xeKRA/ls.jpg", "@type": "Restaurant", "telephone": "+17182378886"}