{"aggregateRating": {"reviewCount": 102, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-28", "description": "Cheap, big portion, popular, and tasty hole in the wall Mom and Pop shop! Hot noodle bowls, freshly fried and steamed dumplings. No words needed. Just come and try a huge meal for $10", "author": "Elliott W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "My wife loves this place so much, she often bring me Rougamo and dumplings as my midnight snacks. I love it XD", "author": "Jiayu H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Hidden gem in Downtown Brooklyn: 6 decent dumplings for $2, noodle soups for $5, etc. Strongly recommended!", "author": "Peter O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Love this place! Cheap but delicious menu, the boiled dumplings in soup are awesome, and 2 dollars for six dumplings is a great deal. \n\nThey get really busy around the lunch hour and don't have much room for a lot of people to wait inside so if you are busy, make sure to call ahead your order.\n\nBest items on the menu: \nRougamo \nBoiled dumplings in spicy and sour soup \nBeef noodle soup \nPassion fruit tea", "author": "Cherie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Best bang for your buck around. Food is cheap but delicious. I've had the pork and chicken dumplings, cold sesame noodles, stewed pork noodles, beef noodle soup, spicy and sour dumpling soup, and regular dumpling soup - all are delicious, with the sesame noodles, dumplings, and beef noodle soup being standouts. Good idea to call ahead to order takeout, as it can get busy and take a while. Seating is limited.", "author": "Adam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Came here on the recommendation of a friend, and am so happy I did! The food is so delicious and a very good deal! We had the pork dumplings, stewed pork rougamo, stewed beef rougamo, and cold sesame noodles, and all of them were spectacular. We will be back often!", "author": "Tatjana K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "Formerly known as \"Siz-In-Pan\", it's the same exact place,decor and (most likely) people just with an expanded menu. Not sure if they still do the scallion pancakes anymore....\nThe Chicken Dumplings get 5 stars in my book. They are simply delicious; but don't let the picture on their menu fool you, they will NOT make your dumplings crispy. I asked \"why not\"?? (she gives me a blank stare and said) \"there is no why...we don't make them crispy\"....so there you have it! \nHot and Sour Soup is very good, China Town style, a bit heavy on the heat, but so good. I did not like the Beef Rice Bowl (mushy rice, way-too-soft beef had me feeling suspect, weird flavor), Spring Rolls have no kind of flavor and soaking in oil. I still want to try the Beef Noodle Soup and Chicken Rice Bowl.\nBut for such cheap prices ($2 for 6 dumplings) this is one of my go-to lunch spots.", "author": "Tiffany I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-11", "description": "I was disappointed in the service. My order wasn't placed properly and had to keep reminding the staff what my order was. It's an average dumpling noodle shop. It's decent for it's price.", "author": "Steve F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Randomly walked to the neighborhood in the raining day and want to give it a try ! Was really impressed !! Their chicken dumpling and beef noodle soup is really good !!", "author": "Yuni C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Many tasty lunch options for unbelievable prices. Hidden gem. We're not too familiar with food options around here and this was a life saver on a boring memorial day lunch.", "author": "Dekel A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "Have come here multiple times. Very affordable and tasty dumplings. The people that work here are also very nice and attentive.", "author": "Rhea S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-29", "description": "There was a huge roach on the counter, after I had placed my order of dumplings. \u0026 the pans were dirty.", "author": "Mirna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-01", "description": "Although the name has changed it still feels like siz in a pan (logo still up). Food prep is tad slower which I thought would be a great indication they are taking their time to cook. I was wrong when I bit into a cold spring roll. No not warm but cold like it went from the freezer to fryer). Dumpling soup was a bit bland and really boring (I had to season it up), dumplings kept their texture, weren't too thick at all and the filing tasted like pork. Only complaint is a hair or something like it was in one of them. Overall this needs to just start from scrap to succeed.", "author": "Clari B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "It's a great place for lunch and snack. Tasty dumplings in good price.  Save my trip to Chinatown.  Menu need to be expand for food variety.", "author": "Vienna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Great for cheap noodles and dumplings. A lifesaver if you work at BAM and earn an usher's wages.", "author": "Lauren E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "My pork rougamo (spelled, elsewhere, \"roujiamo\") was an astonishingly tender 3 oz of chopped pork, maybe shoulder meat, sandwiched in warm bing bread (an unleavened mini-pita). Not as large or spiced as Xian Famous Foods's. But at a bargain $3 instead of Xian's $5, I'll return for more. Hen hao, xiexie!", "author": "Josh K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "My wife and I are both vegetarians and went here for the first time tonight.  Everything was delicious and very reasonably priced. We'll definitely be back!", "author": "Zach L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-24", "description": "They have nice food, but the service is bad. \nThe guy ahead of me waited for like 25-30mins for his order and he wanted to cancel his order b/c he's already be late for class after the long wait. The cashier refused to to it. That guy ended up leave the store w/ no food and no return of any money! I waited for more than 20-25mins too! They should have informed customers for the unexpected long wait before taking more orders!", "author": "Wenbin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Super super cheap. Better on average than this type of restaurant in China. We got pork roujiamo and it was great, beef noodles, and they were fantastic, and dumpling soup, which was really good. Would recommend to anyone. No need to go out to flushing. This is the real deal.", "author": "Ben B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "This place is a hidden gem in the neighborhood. I LOVE their dumplings and noodles, and it's really fantastic how great of a value it is. For $5 I can have a filling bowl of delicious beef noodles, and the style is very authentic to what I'm used to having in China. They also offer the Rou Ga Mo sandwiches which I'm looking forward to trying, but take my advice and get an order of pork dumplings and beef noodles. You won't regret it!", "author": "Byran D."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Xifu Food", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "318 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/27VPX8q7znNiwkkS5xeKRA/ls.jpg", "@type": "Restaurant", "telephone": "+17182378886"}