{"aggregateRating": {"reviewCount": 102, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-23", "description": "I recently started working in the area and am happy I stumbled upon this place. \n\nEverything is so cheap for downtown Brooklyn I'm always surprised. At this point, I'm waiting for the prices to increase. \n\nThe chicken and vegetable doubles are good even without soy sauce and that's something to be said. \n\nThis third visit is on the account of a cold I can't seem to get rid of is search for some soup. With a little help of soy sauce, it really hit the spot.", "author": "Leilani G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-08", "description": "It's a great place for lunch. The service is fast and the appetizer is authentic. However, the noodles are just ok.\nYou definitely need to try rougamo here!!\n\n肉夹馍很不错，水饺都有点软了，口感一般。面条也是又软又黏，作为炸酱面，就很一般了", "author": "Gigi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-20", "description": "Freshly made dumplings filled by hand right before your eyes? What more could anyone ask for?\n\nI've become accustomed to restaurants selling frozen dumplings from the local Sam's club so this was a pleasant surprise for me.\n\nThe curry wings were really good also. The only thing I didn't care for were the corn soup.", "author": "Chi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-29", "description": "I was out and I was hungry so I try this little hole-in-the-wall Chinese. Excellent pork dumplings the wrapping was steamed and soft on top and crunchy on the bottom. They were fast they were cheap they were delicious. Excellent snack to continue my shopping.", "author": "Demetra D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-25", "description": "I went here 3 times before today and absolutely loved it. I'm visiting NY again and decided to drive an hour to come again. Dumplings were disgusting. Ordered multiple orders and all were soggy and drenched in oil. Couldn't finish it and super disappointed. \n*the cook in the back and other staff members were different than the people I usually see so management may have changed?", "author": "JJ H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "Xifu Food has northern Chinese style food. The dumplings are amazing here! $3 for 6 dumplings. They have very good deals here. The ingredients are very fresh. My only complaint is my beef noodles soup has too much oil in it. Other than that, good food for good prices.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-24", "description": "I have been to many dumpling spots but this place has some of the best pork dumplings in the area. The bottom is perfectly crispy and the inside is juicy and slightly soupy. Although they are most known for their dumplings, they have other authentic dishes like their beef noodle soup and zha Jiang mian. I try to come here earlier in the afternoon because the dumplings are more fresh due to the constant flow of customers.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Xifu is Asian street food done right. It's beyond affordable, and the buns are top notch.\n\nI'd even venture to say they do it better than Xi'an. What little pretension Xi'an's accumulated over the years is completely absent at Xifu.\n\nIt's basically a hole in the wall that's been given a nice coat of paint. Super barebones with a staggeringly cheap menu that has all the stuff you'd expect from a super casual joint in the seedier parts of Chinatown. You've got your dumplings, your soups, your noodles. And they take credit cards! Though you get a discount with cash.\n\nImagine Yaso Tangbao, but like... 200% cheaper. And a bit greasier.\n\nTheir \"rougamo\" buns are delicious. Never heard the term before, but it's basically like regular bao, but sightly grilled/pressed. I got the stewed pork one, and it was worth the price of admission. Only $4, but you would spend way more for a bun of similar quality elsewhere.\n\nAlso got an order of boiled dumplings in spicy \u0026 sour soup. \"Soup\" is kind of generous, as it was just a step above chili oil. But so delicious. Heartburn-inducing, but delicious. Came $12 to an order for just $6!!!\n\nCouldn't leave without a hot and sour soup (my favorite). It could've used a bit more red vinegar, but all the component parts where there - the bamboo shoots, the fungus, etc. Pretty solid.\n\nStaff was friendly, and there's a few tables inside. They're open til 8:30 on weekdays, so a good post-gym dinner.\n\nAll in all, I'm pretty sure this is going to be my new cheap eats neighborhood spot. Especially since Ganso recently closed, and other places are a bit too \"fancy\" when I'm just trying to indiscriminately stuff my face with food.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "Yummy cheap affordable food. \n\n6 dumplings of your choice (chicken, pork, veggies) for $2. Who can beat that ? Nowhere else besides downtown Flushing nowadays. \nThey have everything from pork bowls, beef bowls, burgers and noodle soup dishes to what they're famously known for ... Dumplings. \n\nIts is ALWAYS packed in here. \n\nSo be prepared to wait . And I mean wait ! \n\nI used to spend my entire lunch break (30mins) waiting for my food. And even now when I call in advance for pick up they still manage to have me wait for 15-20 mins. So I literally do have to gulf down my food.  \n\nToo bad they don't deliver . \n\nA lot of my colleagues love this place.  \n\n***A tip to management - please consider doing delivery. Theres lots of office buildings in this area. \n**hint hint**", "author": "Katrina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-05", "description": "Surprisingly decent. Perhaps intentionally derivative of Vanessa's Dumplings and/or Xian Famous Foods. Portions are large, and although prices are a dollar or two more now than they were a month ago, good for them making a profit, because what they charge is still more than reasonable for what you get. It's simple food, really. Salty not sugary, oily not greasy, sauces are definitely watered down, but there's still plenty of white pepper and Sichuan peppercorn to legitimately excite the palette. Dumpling dough is thick, noodles are thick, nothing is pristine or sublime, but, again, this is cheap food, and it's fast food, it's basically perfect for my needs: $10 for two plates to be stuffed, before shows at BAM; no need to suffer through any of the mediocre high-priced bland cutesy places in the neighborhood.", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "This place is so inexpensive it's insane! I work close by, and i this place gives you a good amount a food for the low price. \n\nThe place is not an attracting place but the food makes it up. It's not dinning service it's more fast food service . It's a pretty narrow place so if you go in big groups better take it to go . \n\nThe FOOD tho ! It's pretty damn good i just had the dumplings as a starter but definitely would go back to try some more . 6 dumplings for $2 is a steal or a combo meal for $6 . * fiants*", "author": "Chastity M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "I absolutely love this spot.\nIncredible prices.\nAuthentic flavors.\nDelicious and fresh, mom and pop owned. \n\nGet your lunch here! \nI love the cold sesame noodles and their pork over rice bowl. And I think each dish is something like $3-6 dollars only.", "author": "Yin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "Very good food.  Sooo good!!! The rougamous taste just like they do in china. Really good food and service here.", "author": "Bao N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-23", "description": "Came to this hole in the wall eatery for lunch and expected to be wowed. Instead I found the meal to be pretty underwhelming. The dough in the vegetarian dumplings was too thick for my liking and didn't really stand out. I ordered the chef special of the day which was eggs and tomatoes over rice or noodles. I opted for the noodles and was disappointed. They were bland and cold, topped with a plain tomato omelette. No sauce, no flavor. I wouldn't order this dish again. My husband did really like his stewed beef rougamo. So there might be some other things on the menu worth ordering but I'll probably opt for yaso tangbao next time I'm in the mood for Chinese street food.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "$2 for 6 dumplings? I'll always try food for a deal! Bit when the dumplings are actually delicious, that's when you know you have a gem.  \n\nI love this place, the only issue is I wish it was open longer in the evening. It closed around 8:30. \n\nIt's the perfect place for a fast dumpling order. Makes me miss prosperity dumpling in Chinatown!", "author": "Mary A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "If you're looking for some cheap dumplings that are full of flavor, you've come to the right spot.\n\nHow I lived only less than a block from here and didn't know it, I will never understand...\n\nOrdered the dumplings in hot and sour soup. This dish took a bit longer than others, I noticed. Several customers who ordered after me were able to get their orders before. This is a no frills place, you get your food in to go containers, even if you're eating in. \n\nI opened up my container and I could immediately spell the aromas of peppercorn and vinegar. Dumplings were good size, and full of filling. A bit on the saltier side for me, but still delicious, nonetheless. Soup blasted me with so many spices. It was simple, yet, spicy, and aromatic.", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "$2 dumplings. $6 noodle soup. You can't beat that. The fried dumpling here is very juicy and the crispy in texture! I usually get the chicken, highly recommended. You can get 6 pieces for $2 and you can add another 3 pieces for an additional $1. I've also tried the 12 piece dumpling in soup. The broth is very aromatic from the sesame oil. The beef noodle soup is pretty good too. They give you three pieces of beef. I also like that they add scallion to the dumplings and noodle.\n\nCredit card accepted.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Excellent food at an excellent price. We ordered the veggie dumplings, pork bun, and pork noodles. The portions are enormous and we had to take most of the food to go. This place has good veggie options. The noodles are chewy with a nice heft to them. They also have a ton of condiments on the table so you can add extra heat or vinegar as you please. This place is definitely worth the visit, but make sure you arrive early because they close around 8 on a Friday night.", "author": "Maya N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-27", "description": "Stopped by for lunch.  Stewed pork noodles and pork rice were very good. Would have been 4 star but for hot and sour soup which I could not eat as it was too oily and greasy.  Will come back tho!", "author": "Paul W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Fast, cheap and good taste. One big bowl of Stewed Pork Rice only cost $7.5 Cash has discount. \n\nBeside the rice, I highly recommend the Stewed Pork Noodles and Rougamou.", "author": "Jiayi R."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Xifu Food", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "318 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/27VPX8q7znNiwkkS5xeKRA/ls.jpg", "@type": "Restaurant", "telephone": "+17182378886"}