{"aggregateRating": {"reviewCount": 102, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "With all of the Vanessa's dumplings in NY, this is SERIOUSLY a gem in downtown Brooklyn!! Want affordable dumplings and noodle soup? THIS is the place. \n\nThe prices are amazing - like $3 for 9 dumplings pieces! The dumplings were tasty and fresh- my only critique is I wished they offered a steamed option rather than fried. \n\nThis is a very casual place. Sure, the restaurant isn't glamorous by any means but the pricing and food speaks for itself. Cash is preferable or $10 min for credit cards. \n\n11/10 - will always come back for the dumplings.", "author": "Carol D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-11", "description": "Xifu food is an unpretentious eatery, a classic hole-in-the-wall, with no frills and killer food. I had the chicken dumplings and the spicy beef noodle soup. When they say spicy, they mean spicy, so be wary! Still, the heat didn't detract from the rich, aromatic broth. The noodles were soft but not overly so, and, though I would've liked more chew, were very good. The dumplings were maybe my favorite part: I ordered chicken dumplings, which cost around $3. Overall, for a beef noodle soup, dumplings, and soda, I spent about $12. You can't really get a better deal in the area unless it's from a food truck. That said, I could've easily spent more without minding.", "author": "Asma A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "This little shop was a bit hard to find as there isn't any large sign directing you to the place so be careful not walk by it because you'll be very upset if you don't get to try their dumplings.\n\nI ordered the chicken and the pork dumplings. 4 pieces each. $6 total. And worth every penny. They are pan fried right when you order so it took about ten minutes to get my order but as they say good things come to those who wait. \n\nVery simple dumpling but was bursting with flavor. The dough was thin and had a slight crunch in some areas while still remaining very soft and easy to eat. The meat inside was definitely the star of the show with the juices bubbling out as soon as I took my first bite. Love love loved these dumplings and for this price, it can't be beat.\n\nJust a forewarning there is very limited seating so you may have to take it to go. I dined in since it was pretty empty however I soon found out that 8 dumplings were too much for me so I asked for a lid and they were more than willing to give me one so I could pack it up. Reheated them at home and they were good as new! Will definitely be coming here again.", "author": "Esther A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-08", "description": "SUPER affordable dumplings, very similar to Vanessa's (minus the sesame bread)! No frills, few seats.\n$2 for 6 dumplings (pork or chicken) and a little extra for the veggie. The dumplings are pan fried, and skin is thiccc. \nBe careful when biting into it because they're super hot !\n\nThey also have an assortment of noodles (dry or with soup), rice dishes, and Chinese bun/burgers similar to Xian famous foods.\n\nTheir 'spicy' is the MALA type, so if you get the cold sesame noodles spicy, be prepared for tongue numbing. I'd rather get that dish non-spicy to preserve its refreshing quality.\n\nCome here for cheap eats, but they're not the best dumplings you'll ever eat. I prefer mine steamed or boiled.\nBut I definitely want to try their beef noodle soup.", "author": "Kimmy U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "I'm shooting a 3 star here! \nCleanliness- Thumbs down. I dined in and tables had not been wiped down maybe within the last 6-10 guest. \nService- Service was descent, was't terrible, wasn't great. Food came out relatively quickly, even though they were out of chicken fried rice there were other options.\nFood- The best dumplings that I've ever had. I decided on the chicken dumplings and lets just say they did not disappoint, I like how they had a little crunch to them but weren't burnt.\n\nThe dumplings were so good, after I left and made it around the block, I decided to call and place an order for a pickup. Things that made me frown- I called and on the other end of the phone a man answered by saying \"hello\"... just \"hello\"... I thought maybe I dialed the wrong number, I finally asked \"is this a restaurant\" - You cant answer a business phone like a house phone man; the woman took over the call and I was able to place my order and by the time I made it right back to pick it up..... the order was wrong... :(\n\n\nIf I'm in the area, I'll probably go back b/c the dumplings were that good!", "author": "Kris P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "How did I not know about this place sooner??? \n\nReasonable priced, decent authentic food, friendly not-your-usual-Chinese-restaurant service, convenient location, and credit card accepted. \n\nI'm definitely back when I crave for Chinese food and too lazy to go to Chinatown or 8th Ave.", "author": "Maria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "Spring rolls are legit.  Great prices authentic.  Really good I would recommend for cheap and quick with great quality", "author": "Scott T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Worth the price. It's delicious!\n\nBoyfriend and I have tried the beef noodle soup, the pork dumplings, and the sweet and sour soup. Don't get the sweet and sour soup. \n\nThe beef noodle soup was delicious! The broth was extremely flavorful and the beef aroma was super strong. The noodles were also very well cooked. It wasn't too undercooked or overcooked. And it is a pretty large portion. \n\nThe dumplings were delicious too. It was potsticker style and the dumplings had thicker skin. Be careful when you bite into it, its similar to a soup dumpling. Avoid burning your tongue. \n\n$2 for 6 dumplings and $6 for the beef noodle soup. Where in the hell, these days, can you find a meal that cheap now?", "author": "Frances T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "Great food. Love the fresh dumplings and the prices are great. I am so glad I found this small spot, don't miss it!", "author": "Adrianna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "Had the stewed pork over rice with two egg roll and drink combo,$9. It was not bad. I liked that it wasn't overly salty. There were a lot of rice fyi, I guess as filler. My friend had the fried chicken over rice. \n\nThe girl at the counter was nice. She also upsold me a $1 sesame ball. It was pretty tasty actually. Took off one star because place is dirty. It would make everyone feel better if the table and seats weren't sticky.\n\nI like the prices here!", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "Xifu means master in Chinese, and Xifu Foods masters satisfying Chinese cheap eats. For under $10, you can get an assortment of very tasty noodles, soups, dumplings, rice, and spring rolls. According to the lovely lady behind the counter, they have been at this location for four years but recently changed their name. \n\nSeating is tight, with maybe 10 spots. Since it was a Sunday at noon, we didn't have any trouble getting a table or having room for the stroller. (No bottom here btw). So definitely do not bring the entourage or a huge family.\n\nThey speak Mandarin and English here. Food is solid for the price, fast and satisfying, but nothing would really knock your socks off.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Combo (Stewed Pork Rice + Sweet and Sour Soup + 2 Fried Spring Rolls) + Cold Noodle + Beef Noodle Soup + 6 Pieces of Pan-Fried Pork Dumpling = $19! WOW.\n\nThis place is a hidden gem in Downtown Brooklyn- so hidden, that I never realized this place even existed. And apparently, they've been open for 4 years. Feeling defeated that I had given up on finding delicious and affordable Chinese/Taiwanese food in my neighborhood, I ventured out for Chinese/Taiwanese food in Chinatown and Flushing.\n\nIt was until one day I was on my quest to find a cheap lunch in Downtown Brooklyn that I stumbled upon this place. We all know about Yaso Tang Bao and Golden Fried Dumpling. Yaso Tang Bao has good dumplings, but it's expensive and Golden Fried Dumpling is cheap but has horrible dumplings. Whereas, Xifu Food has delicious dumplings and noodles for a very affordable price. It's amazing that given the big portions, an entree rice or noodle dish will only set you back $5. The appetizer dishes like the 6 pieces of the pan-fried pork dumplings will set you back $2 (add 3 more delicious pan-fried pork dumplings for +$1) and 2 fried spring rolls go for $1.50. And for those familiar with Vanessa's Dumplings, Xifu is probably even better in the sense that the menu is slightly different and the noodles and sauces taste much better here. \n\nI would even go as far as to say that the food here is better than what you can find in Chinatown. The pan-fried pork dumplings is nicely pan-seared- and for the Yelper who complained that they couldn't make the dumplings \"crispier,\" we're not frying chicken here! It's perfect the way it's made. Any \"crispier\" will give the dumpling a burnt taste and a black bottom. The noodles and rice dish remind me of food that I find in Flushing. The sauces are authentic yet simple. I wouldn't consider the food bland or immensely flavorful, but there is enough to make it taste and smell really really good. I could smell the food as I was carrying it home and when I got into the elevator, there were people who commented on how amazing my food smelled and because I didn't want them to know where I got it from, I told them I picked it up in \"Chinatown somewhere.\" I know I'm horrible, but I really don't want everyone to go there and drive up prices. I'm still baffled that this place has been open for 4 years and the prices of their dumplings is still at 6 for $2. That's insane.\n\nPlease don't come here. I want this place all to myself.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Love this place! It's absolutely affordable! Im addicted to chicken dumplings and beef noodles soup!)", "author": "Mikhail S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-01", "description": "The chicken chicken dumplings were very scrumptious... the chicken filling was juicey and the dumpling had a nice chew to it", "author": "Ursula L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-07", "description": "This is one of my favorite dumplings spots in NYC. It's run by an adorable family, the pork and chicken dumplings are fire!", "author": "Chau M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Finally, a Chinese place in the neighborhood with chinatown prices and decent food. Before Xifu, the best option for cheap food in the area was Golden Fried Dumpling, which had low prices but barely edible food.\n\nXifu has low prices ($3 for a sandwich, $5 for an entree-sized soup,  rice+meat, or noodle+meat dish) and good food, probably the best Chinese in the area if you just want something and you're not after something specific like Szechuan food. This place is also tends to be pretty quick on weekends (not sure about weekdays) and generally has room to sit without a wait.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "The very definition of a \"blink and you'll miss it!\" The dumplings here are phenomenal and such a good price. I've had the pork and vegetable. The noodles are also really good. It's enough food for two dinners and it's impossible to spend more than $10. A great go-to in downtown Brooklyn.", "author": "Julia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-21", "description": "I'm visiting from California and if I'm ever in this part of Brooklyn again, I'd definitely come back. Really good dumplings and the prices are so unbelievable. $3 for 6! Wish I could find a little hole in wall spot like this back home.", "author": "Sherry N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-29", "description": "I really wanted to like this...and maybe I'll give it another shot with another dish, but MAN were my zha jiang mian noodles SAAAALTY. Hope the owners are taking notes!", "author": "Sherry W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "$5 for lunch?! Sold! I LOVE dumplings, and am sad that they've become a trendy thing in the city, so the prices go up and up. But not here. One Lincoln bill and I had lunch -- 6 chicken dumplings, 2 spring rolls and a bottle of water (you can choose soup instead of the beverage). \n\nNo-frills, small location. But cheap fresh eats and nice staff. Win!", "author": "Meridith G."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Xifu Food", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "318 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/27VPX8q7znNiwkkS5xeKRA/ls.jpg", "@type": "Restaurant", "telephone": "+17182378886"}