{"aggregateRating": {"reviewCount": 77, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-05", "description": "I saw this chain featured on a \"Best Pizzas in NY\" YouTube video and am glad I got to stop in for a couple slices just before closing!  Amazing thin crust cheese with really sweet tomato sauce. \n\n3 *'s \n+$1 slice\n- Sweeeeeet Sauce\n\nYT Erik Wade", "author": "Haywood J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-06", "description": "They give you a pretty big slice. In my opinion, it has too much dough. The crust is soft, and there is not enough sauce. I would be ok with that if they just offered hot sauce,  but they only offer the standard dry seasonings. Still a good deal at a $1 a slice but not something I could eat everyday.", "author": "Travis D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "I popped in mid-day for a quick slice and was pretty impressed for a dollar slice.  I opted for a pepperoni, which was 1.75 and a regular cheese for a dollar.  They came out fresh from the oven.  They were huge slices.  Crust was thin, loaded with cheese, and good pepperoni spread.\n\nRestaurant looks run down and a bit dirty.  But who cares?  Get your pizza and dip out.", "author": "Jimmy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "This is 1 block from our house and we are here multiple times a week just to grab a quick slice on the way to and from meetings, games, etc. Always hot \u0026 fresh and rarely have to wait. Employees are friendly, too!", "author": "Tiphanii M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-09", "description": "Avoid / Be Advised - I personally watched a homeless man sprinkle a large quantity of salt onto a slice of pizza and his filthy hands. He than proceeded to take the large amount of salt that was in his hand and try to sift it back into the salt container. I was mortified and disgusted when I saw this. Honest to G-d, after seeing this - the place should be shut down. Employees are a bit scary and yell and fight with each other. Overall the quality of the Pizza is deplorable - When would you be so cruel to yourself by going into this place. Never again! Nothing more I can add or say. Very Bad - So bad and disgusting, that I'm not sure why I didn't place a 311 complaint in for this.", "author": "Louis R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-15", "description": "Best 2 Bros location in NYC. Tastes so much better than some of the Manhattan locations. Pizza is always hot and fresh. For $1.00/slice, you can't go wrong.", "author": "Shawn G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-17", "description": "Pizza that's worth it because it's only 1 dollar. The cheese pizza is a dollar. Any other toppings they add 25-50 cents.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "This is exactly what I wanted. $1 cheese pizza with the pepper flakes. The dough is so good! I personally think it's better than dominos haha. Great service, easy and fast. Would recommend if you are in the area and need some food", "author": "Annie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-05", "description": "Worst pizza I've eaten in NY...ever. Only went because my wife was starving and didn't want anything far from the hotel. The slices we were given didn't even get tossed back in the oven for warming up. Didn't feel like asking the girl at the register to warm them up because she wasn't the least bit friendly. \n\nPizza tasted pretty bad. Soggy, sauce was bland and gave me gas. I can chow down a dominos pizza and not have that happen to me! Goes to show you the quality of this stuff.\n\nIf you want GOOD pizza in Brooklyn, take a hike to L\u0026B Spumoni Gardens on 86th or even Lenny's on 86th for that matter. \n\nAVOID 2 BROS!!!!", "author": "Joe N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-13", "description": "Don't even bother waiting in line at this place. I stepped in figuring I could get a quick slice. With only one person ahead of me I figured it wouldn't take long. \n\nThey ordered and got their food I step up and somebody cut me off. No big deal that happens and that's not the restaurants fault. I step up to order after them and instead they take somebody behind me.\n\nForget this place I'm out...", "author": "Michael F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-14", "description": "I am a big fan of New York pizza including dollar slice- it's a NY institution. However, I would not set foot in this particular establishment. It's full of homeless or homeless-looking people at any given time. Appears extremely dirty. Please turn into a normal pizza place.", "author": "James W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-12", "description": "I came in after 10am- Google said they open at 10am. They were making the pizzas and I asked a teen at the counter if they were open yet. And he rudely said No- then looked down. The employees here have Zero people skills. I ate at a few other 2 Bros Pizza locations. For the cheap price you have to come in with the lowest expectations. The pizza has dry tough crust, bland sauce from a can and its often barely warm pizza.", "author": "Steve K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-10", "description": "Poor customer service. Instead of explaining the special, the staff had an argument with one of the customers. Not only an argument between the tall guy and the customer but the tall guy said \"Get the FXXX out of here\". That's when I intervene and told the tall guy that was not how he should conduct business.  Just sharing that good customer service is not the norm at this pizza place. The tall guy on the photo is very unprofessional and rude.", "author": "Lily P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-11", "description": "NO, this is not your standard NY pizza... This is not even fast food pizza quality!\n\nYes, it's cheap. I give them that.  $1/cheese slice and $14/a whole pie (with either mushroom or pepperoni, I got half of each).\n\nI never knew they used canned mushrooms for pizzas, but it was obvious here.  The mushrooms were still soft and wet, not enjoyable at all.  The crust and the cheese were whatever.\n\nThe employees, you can tell, don't want to be there.\n\nDon't know about the other locations, but this one, avoid!", "author": "Silvia G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-07", "description": "We were in the neighborhood at the civil court and dropped by to get a plain pie.\n\nFor the price of $8, it was very decently priced. It's definitely one of the cheapest pizza places in Brooklyn. The sauce was tangy and robust and cheese covered every surface of the sauce. The crust was crispy, but a little too thick for my liking. However, around the store, they did have oregano, Parmesan cheese, and hot pepper flakes, just like other pizzerias.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "dollar pizza is so new yorker, how many times it saved all of us while running and rushing all over the city. quick tasty bite!", "author": "E. M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-03", "description": "I don't know why they put a phone number if they are did t pickup any phone calls all the time, plus last order they send me a very cold old pizza not a fresh one, i don't know why they treat the delivery customers like this because they can't complain !!!", "author": "Rawan Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "Not quite sure why the ratings are so low. Hard to complain when slices are $1. \nYes I said $1. Not much you can buy for four quarters these days, but often when deciding what to eat for dinner I consider how it will cost me at least $5 to pick up a single measly little item from Foragers or Peas and Pickles and I think hmph, Probably should just get a pizza. \nYou will feel slightly jipped if you spend money on toppings... that's where they get you. Order a large cheese pie, lightly baked for a doughy fresh meal for two. \n\nI apologize for the poor quality photo featuring two lonely slices in a large box with hardened cheese, but the rest of the pie sent me into a food coma before I could take a pic. \n\nPizza Rule #1 do not let any individual or activity get in the way of eating a hot, fresh and ready pizza.", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "This is hands down one of my favorite pizza joints in NYC. Nothing like a hot slice of New York pizza bigger than the paper plate. I love it! The most enticing thing about 2 Bros is the price. If you get a regular cheese pizza it's $1 a slice. They also have a deal where you can get two slices of cheese pizza and a can of soda for $2.75! YOU CANNOT BEAT THAT! If you're going to order a box of this pizza (which you probably will after one bite) make sure you have cash no cards are accepted.", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "You know the deal. \nConvenient, one dollar pizza that isn't bad. Not the best slice but not bad -even by NYC standards.", "author": "Allana D."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "2 Bros Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LjyOUL8oXr1kWUEplSj2uw/ls.jpg", "@type": "Restaurant", "telephone": ""}