{"aggregateRating": {"reviewCount": 77, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-14", "description": "I can't comment on the pizza as I sit in my apartment starving. I ordered a cheese and white pizza with broccoli. Pizzas never came because they ran out of broccoli. It was via seamless so the best option instead of sending one pizza without broccoli is to send no pizzas at all. We live in the only place in the world with a grocery store on every block but I am guessing that the broccoli species has become extinct because I can't imagine another logical explanation. Come on business owner. All pizza in NYC is garbage. Keep an emergency bag of frozen broccoli in the back fridge. Yes I would have been upset if my pizza showed up with no broccoli but I don't even like broccoli that much. No one eats pizza to get their daily dose of vegetables in. IF THERE ARE 2 BROS WORKING THERE THEN ONE SHOULD HAVE LEFT TO GET THE BROCCOLI.", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-19", "description": "Do I have to give any stars? This place is filthy and by far the worst pizza shop EVER! I ordered my pizza which took forever. The men behind the counter were busy handling cash and food with no gloves while checking cellphones and ladies all at the same time. While waiting I had to use the restroom so I went in and to my dismay it was filled with trash. Yes garbage in giant black plastic bags swarming with flies. Both sink and toilet were unreachable. I'm assuming the staff uses the same restroom right? Immediately did a u-turn and exited the store. Went back to sit in my car looking into the Resturant in disgust. I'm sorry to say but Two Bros is officially on my \"Sh!t list\" for places not to eat.", "author": "KT T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-15", "description": "This $1 slice is just fine. I used to eat it before I found out there were several better dolla options if you wade into the mall. But don't get me wrong; it's just fine. A few desperate months ago I ate here for both lunch and dinner and got a little bit of a throat cold-- granted it was the winter and I was sucking wind hard trying to blow off the fresh slices. \nI love the widdle tables and the widdle benches and how there is no door so the people just spill out into the street with their pizzas like trash from a hoarder's garage.", "author": "Carl W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-27", "description": "When they first opened up they were excellent. The place would be packed all of the time. Now when I go in there it's to scope out the slices and I usually walk out. The lack of cheese is just sad. You can't even ask for an extra cheese slice! You're better off getting a slice with topping because it seems those don't have a lack of cheese.", "author": "Leticia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-18", "description": "I love stopping by this place then ever I am down town Brooklyn.  They have this $1 slice pizza.  It is always right out of the oven, and I always get at lease 2 slice to eat when I am there. If only they would put a little more cheese on the pizza. That is the only fault. The pizza place is always crowded,  but the service is always fast. You also need to pay with cash.  I heard that there are places that serves better dollar pizza, but I have not eaten from any of these dollar pizza place. Try it out.", "author": "Carl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "For those possessing an extremely exclusive, discerning, and sophisticated palette--har har har--2 Bros Pizza is arguably the best place to grab a fast, cheap bite to eat before/after performances at BAM Harvey Theater. It's literally right around the corner, there's such a high turnover of food and clientele that everything is always fresh and relatively clean, and it really is a much-welcomed breath of fresh air -- beautifully contrasted to the likes of Beckett or Chekhov or Ibsen. Perhaps not the world's greatest pizza, but so what! It's only a couple bucks: you'll be full, you'll be fine.", "author": "David L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-05", "description": "Yep, the plain slices are only $1, hooray! That said, when the person making the pizzas decides it's o.k. to handle money, touch anything and everything in the place which includes the door to bathroom and / or storeroom AND THEN put his hands in the cheese to make another pizza, a big fat NO to that!! This person did all these things while wearing gloves but kind of defeats the purpose of the gloves in the first place, no?? Witnessed this today when I stopped in there to get something to drink and am kind of regretting not going to the 7-11 right next door in stead as I unfortunately have grabbed a slice there in the past. Never again.", "author": "Beth W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-12", "description": "I dont understand, it's  $1 pizza. what did you expect gourmet? I won't say the pizza is great, but it hits the spot when your on the go, or when you got two bucks. Whenever I'm around LIU, I stop by. Yes the floors are kinda dirty (high schoolers) and limited seating, but It's a DOLLAR!", "author": "Eric G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "Cheap and quick. Three slices only cost me $5 and I waited less than 5 minutes to have the pizza reheated in the oven. The pizza is really crunchy and the ingredients taste good too. I would personally recommend the mushroom if you have no problem eating them. The only disappointment is you rely completely on luck if they have what you want. Pepperoni and white pizza was out so I couldn't get either. You can also get free wifi from the stores nearby so it wouldn't be too bad to grab a seat if you're okay with the place being hot and hectic.", "author": "Charles C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "Regular slice of Pizza for a dollar (way below market), and this two bros has a lot of specialty slices at \"regular slice market prices.\" So that means an eggplant, vegetable, or broccoli slice for $2-2.50.  You can't go wrong.\n\nDon't expect thin crust Grimaldi's pizza at a dollar, it is what it is take it or leave it.  I'll take it.\n\nIf they put one in park slope, crown heights or flatbush, i'll take it even more.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-03", "description": "In terms of value, this place is right up there. \n\nWhat I mean by that is that there are plenty of places that charge $2.50 for a slice that are no better than 2 Bros. There are also other $1.00 pizza places that are downright awful. The slices here are actually surprisingly decent, and considering they're just a buck, I'd say it's not a bad option.", "author": "Roy K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-28", "description": "The only reason this place gets more than 1 star is that it is open relatively late which helps after a night of drinking. Those who have been giving this place raves have not tasted pizza in their young lifetimes.\n\nThe pizza is size is decent, and the crust is not bad, however, this slice has almost no taste. Insufficient flavorless sauce is the main problem with the pizza, and no amount of salt, garlic, or oregano afterwards cannot save it.\n\nAgain, great when you need something in your stomach and do not want anything off the dollar meal at the McDonald's next door and you do not want to risk the even worst food next door at the 7-Eleven.", "author": "Leonard P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-06", "description": "Bargain value is definitely a 5-STAR. The pizza is good. I cannot distinguish the taste from other slice places.\n\nWhat takes away from the experience is the lack of cleanliness in the establishment. Bike tracks and shoe marks on the floor pull it down. People who don't clean up behind themselves. Even on a grab and got to me.\n\nAlso the bum begging for a dollar didn't help.\n\nOverall you get what you pay for. None of this would happen at a spot where I overpay for pizza.", "author": "Rahim R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-13", "description": "I've been to other 2 Bros Pizza locations and the reviews vary. Why you might ask. Well because I'm convinced it tastes better at different locations. This location however is the worst. I had two slices and didn't finish either of them. I ate about 60% of each and when I got to be about an inch and a half from the crust I just threw it out. It was just dough at that point. With that said both slices (which were from different pies) didn't have much cheese or sauce and was just largely dough. Hence why 40% of it just went into the garbage.", "author": "Rojé G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "I was skeptical about $1 pizza, but I was starving and needed something quick. It was quite crowded so I figured it couldn't be that bad. I got a regular slice. It's ready to go before you even finish ordering ur drink. Anyway, the slice was actually quite good. Didn't taste like $1. I do enjoy my pizza slightly on the crispy side, and this was chewy. But it's all good for $1.", "author": "Esther T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Whats there not to love about a dollar please? What kind of pizza and service do you expect for a dollar pizza? I give it 5 stars, place is quick, always ready to hand you as many slices as you want, no ifs nor buts. I have never been disappointed with a dollar pizza, plain and simple. Staff b doing their job.", "author": "Luis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "Any NY native can skip my review b/c I'm a tourist. \n\nI've been to NY 437 times, but somehow I never had a slice of NY pizza until yesterday. I really wanna go on a slapping spree at Pizza Hut, Dominos and Papa Johns. No wonder all the New Yorkers I know talk so much trash about those places. \n\nTwo nice large slices of pepperoni and a soda for just $4. Can't beat it. The crust was good and complemented the pizza. The cheese tasted kinda smokey. Just the right amount of sauce. Walk in, get your pizza, sit at a stool and eat it and then leave. It was great. \n\nDefinitely better than those jumbo \"I'm too drunk to notice this tastes like crap\" slices they sell here in DC on club nights. \n\nWord of caution: I don't think those two guys working the counter were actually brothers.", "author": "Ordale A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-03", "description": "They say bread is the cradle of civilization; a staple food that fostered life for the masses throughout the years. Pizza must be the genetically enhanced race that supplies strength and fosters the will to carry on in stressed college students and the general masses.\n\n2 Bros Pizza provides quick, cheap, and solid pizza that pleases the taste buds and nurtures the soul.\n\nThere is almost always a long line along the pizza counter, but don't be dismayed at the thought of wasting your valuable time standing in a queue. The service is super quick and the before you know it, you're next in line to place your order. So be courteous and know what you want to order. Don't be holding up the line! (some of us have lectures or work to go back to).\n\nI come here for the sustenance and the nourishment that only decent pizza can provide. Every slice I had were good or very good, the type of goodness you feel when biting down into a warm crisp well made New York pizza. Feel free to douse your slice(s) in the complimentary oregano, red peppers, garlic, and other spices available on the high top tables.\n\nThere are benches along the walls where you can sit, compose yourself for a moment as you take a respite from your busy day and eat a pretty good pizza.\n\n1 plain cheese slice is $1*\n2 slices and a soda can is $2.75\nSpecialty slices (which are still dirt cheap, roughly ranging up to $3) can be purchased at the front of the pizzeria. Do not wait on that crazy line to order these. Go to the the front of the counter that meets the street and that is right under the menu to order a specialty slice. I discovered this the hard way.\n\nThe pizza here is good. The pizza here is dirt cheap. The pizza here brings me momentary comfort from my studies.  \n\nCome here to satiate your appetite for a mere dollar. President Washington would be proud.\n\n* Seeing this brought a tear to my eyes. The guy at the counter nodded his head knowingly in approval.", "author": "Joan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "Tips for a successful meal at this particular 2 Bros.\n\nFirst off: I would say that the plain slices aren't really worth the $1, relatively speaking.  How relative?  \n\nFor one, the slices at two of the Manhattan 2 Bros. I've been to (6 Ave and 37th, 8th Ave and 38th) are vastly superior when cooked well - thick crust with lots of cheese.  The 2 Bros. here in Brooklyn skimps on the crust and sometimes the cheese as well.  \n\nAnd for two, for $2-$4, I can get a better meal experience and better slices...at the VERY SAME RESTAURANT.  Howzat?  Avert your eyes from those cheap, tempting plain slices, and turn them to the counter with premade pizzas with toppings.  For only 50 cents more, you can get a slice swarming with meatballs.  For only $1 more, you can get a creamy ricotta-topped white slice (depending on what's available, with or without hordes of olives), a slice teaming with veggies, a buffalo chicken slice, or a full sausage and peppers slice.  \n\nEach of these topping-ed slices is a meal on its own for the light-medium eater.  For a big eater like me, 2 topping-ed slices is enough to fill me up.  And their taste, while not great, is definitely superior to the mediocre plain slices' taste.  \n\nAnd because the topping-ed slices have been sitting out for a while, be sure to ask them to make the slices hot.  DO NOT ACCEPT THEM IF THE PIZZA GUY BRINGS THEM OUT OF THE OVEN EARLY.  Ask him to heat it a little more, or you'll regret it while eating a warmish-lukewarmish slice.  \n\nSo to recap:\n- Avoid mediocre plain slices.\n- Topping-ed slices are good value and fill you up.\n- Ask pizza man to heat the suckers up until they're crispy", "author": "DC C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-04", "description": "First impression of New York...\n\nI was hungry and I couldn't ask for something more. A staple in NYC food culture, the Pizza.\n\nTwo slices for $2.00. $2.75 and you get two cheese slices and a soda. $4.00 and you get two pepperoni slices and a soda.\n\nDo you see the problem here?\n\nYou're probably thinking, \"Cheapskate Californian, can't even appreciate an earnest deal for a decent meal.\"\n\nActually, I can appreciate it. It's the mediocrity in quality and pricing that's disappointing. \n\n3.5-4 star average on Yelp from the many other locations. Man you guys are killing me, hopefully Grimaldi's will live up to the hype or else I might need Leonardo (the ninja turtle) to slice my taste buds off.", "author": "Ryan M."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "2 Bros Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LjyOUL8oXr1kWUEplSj2uw/ls.jpg", "@type": "Restaurant", "telephone": ""}