{"aggregateRating": {"reviewCount": 77, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-23", "description": "Cheap and open late. Pizza is \"meh,\" as is the staff. Definitely not a place to seek out if there are other alternatives open.", "author": "Alan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "Cheap, quick and tasty! If you come before 2 pm, its not always fresh. And cashier is rude.", "author": "Maria P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "Went here on a recommendation from a friend of mine who is from Brooklyn. This place was delicious and easy on the wallet. I enjoy these $.99 slice pizza joints in Brooklyn much more than the coveted places that start with a G. Stop in here if you are in the area. Worth all 99 pennies.", "author": "Tyler S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-16", "description": "Okay it is not the greatest pizza in the world but it is definitely worth $1 per slice and I am sure the pepperoni at $1.50 a slice is also worth it. $2.75 for two slices and a soda?  Sounds like the 1970's!  \n\nWent on a slow afternoon and the pizza had just come out of the oven. The guys behind the counter were pleasant enough and if you rank the slice against other $1 slices, the rating goes to 4-stars!  \n\nThere are guys charging almost $3 a slice for pizza in NYC...I'll take 3 fresh slices from 2 Bros instead!", "author": "Neil B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-09", "description": "I loved Two brothers Pizza until 30 minutes ago, Everytime my brother has a game we order 2 pizza pies. So today my husband and I stroll in to get 2 slices, as were waiting on line the guy rolling the dough out coughed on the dough and the open white bucket of tomato sauce. We immediately walked out I'm disgusted and appauled I will never patronize any of your businesses again!!!", "author": "J O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "Honestly,  it's dollar pizza,  so what can you say. Bread is thin, sauce is scarce,  cheese feels cheap but God when you put it all together it works so well. I love this place although I probably shouldn't.", "author": "Aleksandr S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "Much better than its nearby competitors. You basically get a full slice for a dollar. Quick and cheap lunch or dinner. You cannot go wrong.", "author": "Gabriel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "2 Bros is absolutely amazing, I find myself eating four slices at a time! Slices are ALWAYS FRESH right out of the oven. This pizza tastes like its definitely worth more than one dollar, but for that price it makes it that much more worth it! I would recommend for anyone who loves pizza. The sauce is a garlicy flavor, and the cheese is also great. Also the fastest service I've ever had.", "author": "Felicia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "It is what it is, dollar pizza. (1.5 for shrooms, 2 bux for for a pretty decent eggplant slice) But it is also Where it is...  OK imagine this, it was so and so's last day at work and you go the obligatory happy hour send off and have 3 or 4 pints on an empty stomach, say good bye/good luck and get on the Q train... halfway over the bridge you realize this was not such a good idea.  Now you get off at DeKalb half drunk, needing to pee big time and still needing to get up the hill... don't panic,  you have a dollar and 2 Bros is right there... hey you know you would pay just to use the bathroom so look at it this way. 1 dollar to pee and it comes with a free slice of pizza, which soaks up the beer very nicely thank you.  How cool is that?", "author": "Alan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "A good pizza for the price. They get a lot of foot traffic so you'll get something fresh. The place seemed a bit dirty and seating wasn't very comfortable. They have a good special, two slices and a soda for less than three dollars. Not a bad place to catch a bite at a lot price.", "author": "G K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-12", "description": "Great slices at the Nevins Subway loco but they only gave cheese slices on Sundays :(", "author": "Chris D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-14", "description": "Why do I come to this place? I mean seriously why? The pizza is garbage. After you've have Johnny's, Il Porto and even Not Rays, you sink your teeth into this crap and there's no comparison. However, as crappy as it may be, it does the job. Anytime I'm in the neighborhood and need to grab something really quick while I'm on the go, its definitely the spot. I refuse to do McDonald's, wings are too messy for a quick snack so Two Bros. is definitely the best option. Then again what can you really expect for a buck. Definitely get what you pay for here.", "author": "Sonny A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-08", "description": "Good Cheap Pizza, service is quick and pleasent! Enjoyable for now!!!!!!", "author": "Michelle E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-29", "description": "I mean this is the scariest looking Two Bros Pizza that I have ever seen before but hey it's $1 a slice.", "author": "QC C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-09", "description": "The $1 slice of cheese is definitely worth one dollar.  In fact, it seems to be the city's most superior slice for a buck.", "author": "Alf O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "I'm very surprised by the low star reviews, this is my go to pizza spot in the area. I've never ordered a plain slice (they look a little wimpy, but they are a dollar, and always fresh out of the oven) however, a mushroom slice is about as good as it gets. Any  slice with a topping gets reheated, and gets nice and crispy after a return to the oven. One qualm, no parmasean, but worth checking out for sure.", "author": "Fred D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "The food and service in this location is great.  The cost of my pizza(s) are worth it.", "author": "George W."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "2 Bros Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LjyOUL8oXr1kWUEplSj2uw/ls.jpg", "@type": "Restaurant", "telephone": ""}