{"aggregateRating": {"reviewCount": 77, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-01", "description": "Place is aight. \nOne really shouldn't complain about a slice that it's a $1. \nIt's a large, chewy and hot slice. It will do. You are just hungry. \n\nYou don't really crave this unless you are drunk or starving... or both. Premises are not the cleanest. Lines moves fast - so make sure to locate the condiments that you want while you are still on line because you will want to be in and out of there quickly.\n\nHave your dollar ready, get you slice and get out. \nHowever, I'm probably not coming back. Sticking to the St. Marks \u0026 W4th locations. \n\n* Dollar pizza does not discriminate but some people that frequent this place might. \nYes, you will find some real dirtbag sh*t nugget here that will keep yelling \"ni hao\" at you just because are an Asian girl. Gross. Nope. Go away. WTF.", "author": "Carina C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-19", "description": "So bad I signed up on Yelp just to complain. Ordered thru Seamless, took over an hour for delivery.  Numerous calls with them saying it's on the way unless the line was busy. Will never order from them again.", "author": "Kel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "Tried 3 different flavors of pizza here and everything was good and decently priced. Most likely will come back here when I am in the area!", "author": "Sangee K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-05", "description": "As a dollar slice connoisseur, I never have high expectations for any dollar slice, and this place was still a disappointment.\nThe slice: There was barely any cheese on my slice. I don't know if the whole pizza was basically cheeseless, but there was barely a sprinkle on my slice. I'm not sure why they even served it to me. I should have gone back from a different slice but I left the store before I noticed.\nThe ambiance: The store was playing bass blasting trap music so loud the tables were shaking. Employees talking to each other had to scream to be heard. Everyone ordered their pizza to go probably because they wanted to avoid tinnitus.\nOverall, this store is the scourge of NYC dollar pizza pantheon. Skip it and check out the other dollar slice joint a few streets away. It's worth it.", "author": "Eliza D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-13", "description": "i have been waiting for two hours for my order to get here never order from here just so you can't say anything to them every single on of there stores won't answer its shit shit shit shit shit shit fuck this place", "author": "Julian G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-05", "description": "tl;dr: pizza pies are expensive for mediocre pizza. Paid $60 for 4 large pies.\n\nWe ordered 4 large pizzas (1 cheese, 2 pepperoni, and 1 veggie) from here because we were looking to feed a group of 6 for cheap. Since the slices are so cheap, we expected the pies to be on the cheaper side, but it was more expensive than the 4 large pizzas we had ordered from papa john's the week prior and for much less quality pizza! Also, the veggie pizza was just a bunch of broccoli and cheese. I would look elsewhere to order large pies.", "author": "Cecily S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Downtown Brooklyn needs more places like this. Dollar pizza that is made and served at lightning speed when business picks up. The quality is not compromised and the space is adequately big to accommodate the hoards of high schoolers that come through in the afternoon.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "This location has GREATLY improved. Maybe it's under new management? Anyway, I tacitly withdraw my previous review. This 'zza now doesn't emerge from the oven, black and scorched anymore.These pies are now decently pleasant to munch. More like 'regular pizza' served everywhere else. And I must admit that it is a boon to get a whole entire pizza pie for just $8 flat. Not even any tax. So, the quality of the pie now makes fiscal sense. This bargain is worth it at last. Whatever issues remaining with the taste of these floppy slices, can easily be covered up with a handful of oregano, garlic salt, or chili flakes from the canisters on the counter. Grab it like a rabbit and go!", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "2 Bros Pizza is pretty consistent in Manhattan. You get what you pay for, but definitely better than most dollar pizza spots. 2 slices and a coke was a great deal for me and a homeless friend. With only 7 bucks between us we did well. decent pizza and fast service. wouldn't recommend eating in there as it's hot as hell but it's beautiful to est in the park outside.", "author": "Dmitriy U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-20", "description": "This place is FILTHY!!!  Bums come in to fish the trash for bottles and cans and the tables are disgusting. We had a server who was sooo rude.  When we asked that our pizza be warmed.  She stated it was already hot.  We asked again and she threw the pizza in the oven and did not take the rest of our order.  When we spoke to the manager about it he just nodded his head and continued to knead dough.  ENTER AT YOUR OWN RISK!", "author": "Tara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "I wish I had money like Taylor Swift and Beyonce, but in reality I'm your typical broke New Yorker. I refuse to degrade myself with McDonald's anymore, so when I need cheap fast food that tastes okay enough to finish, I hit the one-dollar pizza joints. This pizzeria and college-student trap near LIU and Metrotech is good enough. The cheese barely covers the sauce and dough, but who cares when you need to fill your belly? Maybe when I finally marry a rich man, my dining options will change.", "author": "Behlor S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-20", "description": "An insult to NYC pizza.\n\nAt best a notch above a Sbarro's in some mall I the middle of nowhere.\n\nUndercooked crust and gluey cheese.\n\nLook elsewhere", "author": "D.R. B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-27", "description": "At 4:00 when you haven't had lunch, an 18\" cheese pizza for $8 from here tastes great! The lack of a posted menu was disturbing, however, when we asked the woman running the register how much it would be to add a topping and she replied, \"24.\" We inquired again, and she repeated, \"24.\" She seemed bored and possibly high, and frankly, I find it difficult to believe it costs $16 to add a little pepperoni to a cheap cheese pizza.", "author": "Patricia J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-05", "description": "First couple of bites when your're hungry feels like you're eating god-sent goodness. However, after a couple more, you realize the amount of oil in the slices could make the U.S. send troops to invade 2Bros like they did to the Middle East. This pizza for the broke; the pizza with toppings sitting out there in the view for so long that even my dad would have come back by then. #$1for1slice", "author": "Jeeper K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-18", "description": "If you want to see the cesspool of Flatbush of the 1970s and 80s, stay here for a couple hours during lunch and dinner. You'll meet the most interesting people off their psych pills and the occasional meth addict asking for change. \n\nWhile you enjoy the real life entertainment, you can eat like a king for under $5 USD. Plain slices are fresh (as much as it is possible). DO NOT order any toppings and ALWAYS use a straw with the soda can. Service is muy exellente! \n\nAnd if your paycheck is coming tomorrow and your stomach can handle eating paper products, your best bet is to come here to quash that hunger and hold it off until the check clears.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "As a Brooklyn Tech Alum (Class of 2016), I have been to this pizza place countless amounts of times in my four years of high school. Whether it was with friends or by myself, the pizza quality stayed mostly the same over the years. I like this place, because I can eat until I am full for under $5. The pizza is pretty decent, too. You can't say that about many other $1 pizza joints. I have made so much memories with friends at this place, it isn't even funny. I would definitely come here again when visiting the area, great pizza when you're on a budget!", "author": "Timöthy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-29", "description": "my ratings reflect the $1 price per slice. for the quality, quantity, taste, speed - there is nothing wrong with the $1 regular cheese slice from this 2 bros chain. if you're in the area and want a quick cheap lunch, this is the place. sometimes the lines get long (especially after school), but staff does a good job moving the line along. note they tried at one point to collect tax (1.09 per slice) but that was an epic fail. Slices are fresh (one worker told me once they make on average 500 pies a day). One negative is, at that times, you get harassed by homeless people asking you to buy them a slice.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "I've been here once, but the one time I went the pizza was fresh, hot, big, cheesy, and well seasoned.  It must have been a good day. This was quality pizza for only one dollar.  It tasted like at least a 2.25 slice  They have the pizza ready before you can get out your dollar.  \n\nThe scene ranges from homeless people to students to people taking a lunch break from work.  I had mine to go.  This one was definitely better than any dollar slice I've had.", "author": "Monique S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Where else can you get pizza (a full sized slice) for $1?\n\nI love 2 Bros. The food is delicious and the staff is friendly. With $12 you could feed 4 people (2 slices each and 4 drinks).\n\nMinus one star for those tiny, hard to eat on tables.\n\nOverall: I'll be back", "author": "Chantel H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-15", "description": "Tasty cheap pizza. Two Bros. Hoards of high school kids. Scarce seating. Stand up eating. A solid everything slice for $2.50, or bare bones for $1. Guys working the oven are fast and to the point. What more do you want?", "author": "Suanne L."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "2 Bros Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395 Flatbush Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LjyOUL8oXr1kWUEplSj2uw/ls.jpg", "@type": "Restaurant", "telephone": ""}