{"aggregateRating": {"reviewCount": 38, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "I love this little takeout place! The wings are by far the best menu item, but the rice is always delicious. Super affordable and the people are always friendly. The place has been around forever and you are really supporting a local business.", "author": "Carly G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-30", "description": "It's... food.\n\nJust your run-of-the-mill uninspired local taco place that are a dime a dozen on Seamless.\n\nDelivery was quick. Burrito was gigantic. Tacos were meh, but the guac was good.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-15", "description": "I put in a lunch order for delivery at noon, as I had a series of meetings throughout the afternoon starting around 1:30 and wanted to eat beforehand.  Over the course of the afternoon I try to find out where my food is and get told by the delivery person, when he finally deems it prudent to call me 40 minutes after the food was meant to be delivered, that I must have put in the wrong address because he can't find it and that couldn't POSSIBLY be a result of his own shortcomings.  \n\nFastforward to 2:00 and past the series of phone calls I had to trade with both the delivery person and the restaurant because, apparently, none of them can read a map, and I finally get cold, congealed approximations of the food I ordered (minus the salsa I paid for), mostly squashed together after having presumably being flung around with great force as the delivery person took a jaunt to the other four boroughs before making it the quarter mile to my office.  The food wasn't just cold, but also entirely bland, and the order was incomplete.\n\nTo recap: \n\n-My food was over an hour late\n-I had to leave multiple meetings to handle the incompetence and apparent total lack of basic navigational capabilities and/or critical reasoning from the restaurant and delivery staff\n-The delivery person insinuated multiple times that I must have given him the wrong address because there was no building in existence at that address\n-The food was bland, cold, congealed, and completely smashed together into the equivalent of a lumpy smoothie\n-Part of the order was missing\n\nI could have walked to this place, ordered and eaten in person, walked back to my office, had coffee, walked to the restaurant, eaten again, and still been back in my office with another cup of coffee in the time this debacle took.", "author": "T. N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-06", "description": "Service is quick. Food is bland at best. Avoid the \"fried fish\" it's mostly likely frozen sticks like the ones they feed kids for an afternoon snack at a daycare. You can taste the freezer burn. Would be nice if they actually prepped and fried it in house. Enchilada sauce is tasty but overall if my office were not ordering and paying for this once a week I would never eat here. So many other options where the restaurant actually cares what they are serving and how they are serving it.", "author": "A.C. D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-09", "description": "The food is really good . The delivery guys are somewhat quick and nice . But .... I am so sick and tired of the RUDE man who answers the phone and takes your order ! I'm a regular ordering at this place , and this guy is constantly rude ! I think I'm about done ordering from this joint , because one day I may just loose my cool and go there and punch him in the kisser ! Food is great though lol", "author": "J B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-18", "description": "Last time ordering because of the delivery guy I just had , he was rude , inconsiderate \u0026 told me if I don't come down I won't get my food , mind you this is after me telling him I'm in a wheelchair , I had to ask my neighbor to go down and get my food otherwise I would have stood hungry , I was confused as I ordered yesterday and stated as I did today to come up because I'm wheelchair bound and the delivery guy came up yesterday and I also tipped him $5 the delivery guy today didn't get no tip , as for the restaurant food is delicious no complaints there but won't be ordering anymore due to the unprofessional manner of the delivery guy tonight", "author": "Bkz Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "This a great \"rescue\" spot from the rest of mediocre, overpriced options on Court Street. Always my go-to eatery during lunch, this place has good variety at reasonable prices. The two dishes I recommend are the (L4) rice with grilled chicken and black beans as well as the salmon dish.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-10", "description": "everyone should be aware:\n\n*****************C health rating******************************\n\nit's a shame because the food is good - but c health rating.  do not eat here.", "author": "Rachel P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-22", "description": "Think I'm going to be nauseous. Got cheese enchiladas to go, heated it up, and this intense rotten cheese smell permeated my apt. Threw it down the trash chute to get rid of it, but the smell has lingered. No cheese I've had in any enchilada has ever had ANY smell, much less one that makes you gag.\n\nThe 1 star is for the minimally smelly black bean taco I ate first.", "author": "M R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "Love this place. the price is right and quesadillas are awesome! the guy who takes orders could use an attitude adjustment, but food is good, and the PRICES! right in my budget!\nthe guacamole is great!", "author": "Lorraine Lola W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "High score just for the fresh tortilla shell. It makes all tacos taste better.\n\nYou can ask to swap whatever  taco with a fresh tortilla, just costs like 50 cent more.", "author": "Susan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-19", "description": "This place is horrible from the decor to the food. First off I came with my family Sister and children. We ordered simple buffalo wings, nachos and cheese and shrimp tacos. The nachos was stale, cheese was stiff like it was sitting out for three days, the children did not even like their food. Buffalo wings were okay, nothing special. Simply put just dodge this place. Ending up eating across the street at the pizzeria way better.", "author": "Kevina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "This is crazy we order food from seamless and it say it will tak about 40 minutes to an hour.  Well guess what its been over an hour and we had to call the place.  They say they will come in 10 minutes which they bs too.  It took over a little over 2 hours.  \n\nHowever the food is great!!!  It was still hot!!", "author": "Kandi T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-05", "description": "The food here is amazing however the gentleman that works behind the counter, non-Chinese Hispanic male, has an attitude problem. I understand that maybe he is having a bad day but everytime I order, I get a diva attitude.\n\nMost of my friends I work with at the criminal court building down the block has had similar problems with this dude.\n\nBeware.", "author": "Kenn A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "Language barrier is an issue here. Simple order of 1 quesadilla, 1 burrito, 1 enchilada and 2 tacos was delivered as 2 quesadillas, no burrito and the enchilada wasn't the one we ordered. The tacos and drink were the only thing they got right. Kinda wish I didn't tip them as much as I did. Food was bland and had to be doused with sriracha to enjoy.", "author": "Alexis D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-08", "description": "The food is amazing, but I had to take three stars off for the customer service. I thought it was just me because I'm extremely picky, but the Indian guy that takes the orders is super unprofessional.", "author": "Anonymous P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "Entered here after a particularly long day.  From the outside the place doesn't look welcoming at all.  The awning has seen better days and unlike it's neighbor Tio Pio it is rather austere, it Is very reminiscent of a Chinese take out place.  Without much thought, I decided on their steak, vegetables and rice order.  Their vegetables where steamed, plain, no spices which went perfect with their rice which had plenty of flavor.   Their steak was perfectly seasoned and cooked.  Cut on long slices and placed on top of the rice.  This order came with salsa which went with the rice nicely.  Their food was great and it really hit the spot.  Looked around saw a lot of folks eating the burrito which looked very good, definitely will try that next time.\n\nPS.  Returned for the burrito, it was pretty good.", "author": "Gabriel O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-23", "description": "We've been ordering from this place for years and years. Lately, they not only raised their prices, but the people who take your order are significantly less than friendly. The food is still decent for what it is, so we crave it and order it occasionally, but it's become a bit of a buzz kill.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-08", "description": "This is the second time I ordered from this place and both times the food was not good. The tacos are mostly bland which would be one thing, but the guacamole was honestly horrendous, like no guac I have ever had. The nachos we ordered had broccoli on it, I love broccoli but this is just weird, and did not taste good. Maybe they have some decent dishes but major pass on the tacos, nachos and the guac.", "author": "Jesse L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "Looks can be deceiving. From the outside, this place looks like it should be closing up soon. Go inside to place an order and it's a different story. I'm new to the area but so far id say this is hidden gem.\n\nI got the steak combo. Not only was it cheap, it was also pretty darn good. Not a huge serving but more than enough for a meal.", "author": "Jay L."}], "servesCuisine": "Tex-Mex", "priceRange": "Under $10", "name": "The Original Fresco Tortillas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "113 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/cFu7mQYwgQUs1fQOjRxfVQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182378898"}