{"aggregateRating": {"reviewCount": 38, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-02", "description": "I wrote a review for the Original Fresco Tortilla but then I realized it's the same business. The entry I wrote is under the older listing.\n\nAgain I have to reiterate:\n\n\"Absolutely terrible service. I can tell they don't want my money since the guy taking my order gave me so much attitude. It was as if even taking my order was such a bother. I ordered two items with no special requests. I thought about it after calling and decided to cancel. I am not giving this establishment any of my money. Poor customer service and attitude\"\n\nNot free delivery, min $10 and I see I am not the only one having an issue with the customer service.\n\nIt may be cheap but I don't need to encourage that behavior with my money. \n\nMy 2 cents.", "author": "Kaity H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "I like this place.  It is not because of the ambience or the crowds that it draws.  In addition, there is not even the best air ventilation for the few tables that it has inside, yet its main attraction for me would be the steak and grilled shrimp in a crispy taco.  These two tacos were not only affordable but tasted better than I expected.  My hubby got the Mexican rice with steak and there was a decent portion of steak.  He was so full after eating it.  We also were given plenty of condiments such as salsa and sour cream.   It was a tasty meal.  I will definitely come back.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-26", "description": "\"Fresco Tortilla\" is a hidden treasure. ($$ wise)\n\nCourt street is full of over priced eating spots that always leave me struggling to decide whether to spend $7-$10 on lunch or risk  the future health issues of eating fast food. \n\nI love Mexican food, and will eat inauthentic food if I haaave to. \nI won't do Chipotle's though, even though its close by. I'm not a big fan. \nSo I've been hoping to find a place like \"Fresco Tortilla\" for a while. \n\nI found this place through my boss, and I actually dig the food. $4.50 for a burrito!? That's awesome. The side of sour cream is free along with guacamole inside the burrito, the food is hot, and tasty.  I have had  Asian-Mex food in the passed, and its scared the heck out of me. But this place has decent, hot food at a decent price. \n\n\nThumbs up: I actually like the grimy look to the place. The steak in my burrito really made a good impression on me. And they didn't put so much beans in it, that it was all that I tasted. \n\nThumbs down: Its too soon to say. :)", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "Had many burritos and quesadillas here. The quesadillas are great, especially for the price. The burritos are quite large for even an overweight individual.\n\nIt's kind of fast food, so i get slightly worried when they grab a bunch of sliced of chicken from a bowl and throw it on the stove. I've had a few too many incidents where my stomach was extremely unhappy with something i ate after getting something with chicken in it.\n\nI would recommend asking them to make it hot or just take it out and microwave it a little bit... just to be on the safe side.\n\nThis is not exactly a restaurant. People just wait around to pick up their food. That said, I really wish they would fix the decor a tiny bit. It could really use some help.\n\nI updated my stars from 3 to 4. It's really a great quick place. The quesadillas are awesome.", "author": "cary s."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-18", "description": "This place sucks! The food is actually not bad that is if you can actually get a proper delivery with a proper order! Called over two hours ago (mind u i live three blocks from the place) and delivery guy finally showed up with HALF the order! Called the place to complain and get the rest of my order, guy promised to have it delivered in 15min, half an hour later i call only to find out it hasnt even left for delivery yet. Cancelled the whole thing. Heres the breakdown, if a Mexican guy picks up the phone then you may get your proper order in a reasonable manner, if its a Chinese guy (with ZERO english) then do yourself a favor hang up the phone and eat elsewhere.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-17", "description": "Fairly cheap for the Brooklyn Area, especially compared to other Mexican places around the neighborhood. The interior was not that great. I got a burrito which was filling but they didn't wrap the burrito they left it open for me to wrap which was annoying. The tables are arranged way to tightly for people to sit comfortably.", "author": "Allen A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "Great combos and low prices.  I order from them every time I'm in the mood for some tex-mex. \n\nTheir half chicken is amazing and under 6 bucks.  It's grilled just right and very tasty.  It comes with two flour tortillas, bbq sauce and one side.\n\nMy usual order though is their amazing grilled steak enchilada which is five and change and is so tasty and filling.  It comes with rice, black bean, lettuce, tomato and red Sauce.\n\nNot a fancy place by any means, but pretty good fast food.", "author": "Lana A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "This is your standard grubby Chinese-Mexican taco joint.  Cheap, cheese quesadillas that my kid loves.  The all-dark meat chicken has some bits of fatty yuck in it, so I'm more likely to go for the black beans if I want a filling.  Rice is mushy, and the only Mexican thing about it is the color.  Haven't gotten food poisoning so far.  We just stick to the quesadillas!", "author": "Kari T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "Its kinda scary when you first walk in because its tiny and grimy, but the food is good and cheap. They only take cash, which is a pain. We ordered a chicken burrito and taco salad and it was all delicious! Generous portions and fast service.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-29", "description": "This is a good cheap tex mex hole in the wall.  Almost everything is filling pretty decent and under ten dollars.  I agree with the previous reviewer who said to add the hot sauce, maybe even ask for an extra container.  I had a chicken burrito and it was very tasty and filling.  I will definitely come back here or order delivery.  It reminds me of a similar place I used to go to along time ago around 14th street in Manhattan.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-13", "description": "Kind of grubby and grimy looking little storefront. \n\nBut it's SO cheap, and pretty darn tasty. \nThe steak combo platter (my usual) is about $6 and comes with rice, beans, lettuce/ tomatoes and a little cheese. \nThey also give you sour cream and salsa on the side with all of the combo meals. \n\nThe steak is pretty standard, just grilled. \nIt's their tortillas that are the absolute stand-out best part of the food. \n\nWarm, thick..almost like a cross between a tortilla and a pita. \nI have no idea if they make them in house or just warm them on the griddle, but they taste darn good. \n\nThe food is a little bland, so be sure to have some hot sauce handy. But when you're", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-17", "description": "Two stars at best. I'm surprised this place gets such high ratings. Flavorless and cold our food was not satisfying. I asked for crispy shrimp tacos, they sent me soft shell. The \"salsa\" was nothing more than tomato puree with a little bit of onion added in. Merely decoration. The only reason I'm giving this place two stars is for their shrimp. To find an affordable shrimp taco in this city is hard enough as it is but next time, I'd order from one of those Chinese Mexican places before I dial Court Street Fresco Tortilla's number again.", "author": "Valerie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-29", "description": "I order from this place frequently. About what you'd expect. Not really authentic mexican by any stretch of the imagination and fairly slapped together food. Of course it tastes good. Sadly I will stop eating there now though. Last week I called and the guy who answered the phone sounded like a real piece of work. He answered the phone by saying, \"yeah? if you wanna delivery I need your address yo.\" Next while placing my order he responded to each new item by saying, \"Yeah, next??\" Like I was just inconveniencing him the whole time. AN HOUR LATER and still no food I call back and he answers the phone this time by just saying, \"Yeah?\" I tell him politely it has been an hour and asking if our order is on the way and he says, \" I think they preparing it right now...it's been an hour? oh well bro, we are really busy'. And then he tells me he had a question about my address anyway. Ummmm? what? If you want to be treated like a piece of dirt call here, lord knows there is probably plenty of it in the actual food.", "author": "Adam K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-11", "description": "This is a good cheap tx-mex place. I cash only, they deliver and service is quick.", "author": "Luz M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-14", "description": "Their nachos are great, and the quesadillas (which I usually hate) are medium plus, at least.\n\nService is quick, and I think they have free delivery, which would be pretty cool if they weren't on my block. \n\nThe only thing I would change about this place is that they only take cash.", "author": "David L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-20", "description": "Went there for lunch. It is a typical Chinese style take out place, narrow seating area with a few tables.\n \nDidn't check the previous review and so didn't order the half-chicken combo. Instead we got some tortillas and a guacamole quesadilla. What can I say - the portions were small to match the prices and not very good. My friend complained that the guacamole in the quesadilla wasn't very fresh. Over all the quantity and price was comparable to the McDonald's across the street but the quality was not. No plans to go back there again.", "author": "Richard L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-20", "description": "Not getting all the high reviews here.  The food is bland and unoffensive, not bad, not good, just nothing.  We ordered the tacos, tortillas, burritos, and it's all just bland even when smothering everything with pico de gallo sauce.    The one thing that's pretty good here is the chicken wings.  Maybe it was because it's the only food with any kind of favor.  I was surprised how good they were.  Better than Atomic Wings and comparable to Wing Bar but much less expensive.  Two stars for the good chicken wings.", "author": "S L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-08", "description": "Been going here to eat for years..love it! Yeah its gringo food, but its cheap and filling. Chicken fajitas are my favorite, and the wings aren't bad either. Best place to go when you want mexican gringo food.", "author": "S F."}], "servesCuisine": "Tex-Mex", "priceRange": "Under $10", "name": "The Original Fresco Tortillas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "113 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/cFu7mQYwgQUs1fQOjRxfVQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182378898"}