{"aggregateRating": {"reviewCount": 166, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Awesome veggie burger with buffalo and sweet potatoes on the side and the people there are super friendly", "author": "Beatrice C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-03", "description": "I would rate lower if I could. Food tasted like bland dirt and that's insulting to dirt. Also waited 17 minutes for fries that were sitting in the warmer.", "author": "Dan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "I have ordered one power bowl to go with tofu. It was delicious, but, as others have noted a bit WET -- too much dressing. I did notice that those eating in had significantly larger portions than my to-go portion. Is that fair?  So I will definitely go back, but may eat IN.  Great service with nice people.", "author": "Taylor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "fresh, clean food. Great for vegetarians and new temporary vegans that have been inspired by \"what the health\"! haha", "author": "A E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Great salad and turkey burger. Manager was kind and gave me bottled water when the water machine broke.", "author": "Jen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "Divine breakfast sandwiches! Had the ham and egg and the salsa and egg. Both were perfectly done.\n\nThe coffee was just the right kind of strong.", "author": "Rachel F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "Finally!!!  A yummy, healthy, and friendly fast food joint in Brooklyn Heights.  To say this is a much needed addition to the neighborhood would be a vast understatement.  The kale and grain bowls are delicious (my favorite is the power bowl) and just the right amount of food.  I have dramatically increased my consumption of greens since this place opened a month ago and my body is thanking me for it.  Everyone who works here is incredibly friendly, welcoming and seems genuinely happy to be there. My only complaint is that you need to check your order for accuracy before you leave, because they are prone to error (forgetting your fries or the avocado you added to your bowl etc).   MAJOR points for staying open until 10pm.  I work late, and there is only so many times my waist-line can handle Indian food at 9:30pm.  Thanks B good!", "author": "KB S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Here from California.  Was looking for a healthy place to eat.  Stumbled upon this place and I am glad I did.  Enjoying the Mediterranean salad.   This is a great place if you are looking for a healthy alternative.  Very tasty.", "author": "Shirley V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Can someone say yummy!!!!!!! I came here once, twice, three times. I will definitely be coming more. I mainly get the watermelon and feta salad. Omg!!!!!!!!! I love the  taste of the ingredients in every bite. The staff is nothing but polite. I cant stop with the incredible service and food you get. You can be good to you and your cravings at b.good....keep it rocking!!!!", "author": "Giselle J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "B.good is easily one of my top three places to eat in Brooklyn heights. They have so many healthy food choices available - protein bowls, smoothies, juice, burgers, etc. I usually order the power bowl with the power grains and fried egg - this usually fills me up and I can save the rest for later. The restaurant has a farm-to-table feel and they do a good job striving to keep their customers happy; I haven't eaten anything that I haven't liked yet. Make sure you download the APP! B.good is very generous with sending free smoothies and sides from time to time so have the app open when you scan at the register. I come here to eat a lot so would definitely recommend to friends and family.", "author": "Marc L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-16", "description": "My salad was delicious and fresh - the chicken especially was most and tender, not dry and stale. Love that they have lots of healthy options. I definitely want to come back and try more stuff. \n\nThat being said, their logistics could use some work. Wait time for orders is long, but there is not nearly enough space for people to stand around near pick-up. When I came by at 1:30pm the line was consistently out the door past all the unused seating. Staff were very friendly and apologetic - there was even one guy whose whole job seemed to be wrangling the line so it didn't block the exit. Maybe get rid of some tables and have a better traffic flow? Your food is good, but it isn't quite fast yet.", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "I was there yesterday for my first time I had an excellent service and very pleasant with the employees!!!", "author": "Damian P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Burgers, Salad Bowls and juice. The restaurant being very busy during lunch is evidence of people appreciating locally grown and healthy food options.", "author": "E R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Great food, fast service. Can't ask for more than that. Definitely coming back again when I'm in the area. Recommended for any burger enthusiasts", "author": "Marco D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Food was excellent. I got the southwestern salad. It was packed with chicken, roast corn, avocado etc. Prices were reasonable. There wasn't along wait at all. Employees were really nice. I will be back.", "author": "Joanna A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-19", "description": "Second time we've ordered take out for the office from here. The menu looks great and the food sounds good. Unfortunately, they can't seem to deliver. The curry and grilled avocado bowl has twice arrived looking terrible and tasting only slightly better than bland. Where's the curry? Seriously, there's literally no curry flavor here. If they included a dressing to go with this, I wouldn't know because they don't label anything. I would say their fault is inconsistency, but both times I've ordered this item, hoping it to live up to its description and both times have fallen flat. So far, they're performing consistently below mediocrity.", "author": "Brendan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "I love this place! Always fresh and healthy! I even started taking my friends! I highly recommend this place to anyone!!", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "This place is great for quick food in Brooklyn Heights. I've ordered several things now and they've ll been good an fresh. What inspired me to write this review is the staff. They really go above and beyond as far as service and friendliness. The person working at the register weekday nights always remembers me, and is always so friendly, patient and helpful with all of the customers. It's my current \"go to\" spot.", "author": "Elizabeth H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "This place is such a great addition to our neighborhood. The smoothies, burgers, salads and bowls I've tried have all been uniformly great - wholesome, tasty food that is locally sourced. For a chain, it has a small town feel - some of the staff know me by name and all greet me warmly. You get the sense that they're happy to work there, which creates a friendly atmosphere. Highly recommend for a quick, delicious and healthy alternative to other fast food joints.", "author": "Persephone H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-01", "description": "Here are five words you never want to hear a manager say when you're paying nearly $15 for a salad: \"Hey, easy on the beets.\"  For $15, I want the person making my salad to damn near do away with the measuring spoon, I want the container overflowing with goodness and I want management to offer equal parts quantity and quality.  Alas, this is not the case at B Good on Montague.  And that really is a shame.  B Good's salads really are tasty.  I just wish there were more of them.  \"The Juice Shop\" on Adams happily throws caution to the wind when it comes to portions and for less money.  So you know how B Good could B Better?  Stop skimping on the portion sizes.  And if you're going to instruct your employees to do so, at least do it out of customer earshot!", "author": "MaLora M."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "B.GOOD", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/zR5PBnIdbRry0-GB89r9qg/ls.jpg", "@type": "Restaurant", "telephone": "+17185224663"}