{"aggregateRating": {"reviewCount": 166, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "I've tried the salads and the bowls and both were really good.  The Harvest Kale is my favorite, the dressing is amazing.  The portions are the perfect size.  It's nice and clean and bright inside with lots of seating so it's easy to eat in or take out.", "author": "Larissa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "This review is so long overdue! A new and welcome addition to Montague street! Food is not only healthy but delicious every time! The staff is so pleasant and friendly and really go out of their way to greet you when you stop in. Place is super clean and plenty of room to sit and eat lunch or dinner. I downloaded the app and received a side for free which prompted me into trying out B.good and I'm glad I did! It's become one of my favorite places to eat in Brooklyn heights and truly cares about it's customers. Highly recommend- you will not be disappointed! A+!", "author": "Elle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "Went back around 2 pm on a Thursday. Most of the prime lunch crowd had passed, and the place was pretty empty.  Service was considerably quicker this time.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "The best veggie burger ever.The food is favorful,the place is always clean and the staff are friendly!", "author": "Darline S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "Management needs to keep an eye on the place. Recently, my experience here was sub-optimal. As a matter of fact, it was terrible. Burger was terrible, fries were terrible, they screwed up my order, unfriendly staff, etc. all around bad experience.", "author": "Fredric W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-20", "description": "Ordered a turkey burger and sweet potato fries to go. The fries were black so burnt they were inedible and they were cold. The turkey patty was way too small for the bun it came in so are the burger and still had half the bun left. Would not recommend.", "author": "pamela b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "I have to give only three stars, because for everything I liked, there was something I didn't like.\n\nThe food is prepared fresh and is tasty. If you're a carnivore, vegetarian or vegan you'll find something to eat here, including salads with kale and quinoa and other fresh ingredients. They give credit to the local farmers with whom they do business, although they're not organic farms. \n\nI had a burger and sweet potato fries. I had ordered the burger without chipotle sauce but they put it on anyway.  It was a good burger. The sweet potato fries they first tried to serve me had been sitting around for awhile and were cold and soggy. THEY SHOULD NEVER HAVE BEEN SERVED TO A CUSTOMER.  I asked for fresh ones and they were made for me with no argument. They were very good.\n\nI requested my burger without the bun, so the person who took my order asked if I wanted it with vegetables instead. I asked if there was an extra charge for that, and she said no. But when I got the bill, I was charged. I pointed this out to her and she said, oh sorry, I was wrong. I decided to keep them and they were also very good.  But really, staff -- know what's free and what isn't before you offer it to the customer.\n\nThere's no ambience. It's a large, cold, echoey fast-food room. There's no \"dining experience\" here, but if you're hungry and want something healthy fairly quickly, it's not bad. The prices are what you'd expect -- more expensive than fast-food joints but not outrageous. The staff is friendly but I heard bickering behind the counter regarding whose job it was to do what. Some workers wanted to hang out while others were doing all the work. LOL. Typical, I suppose. \n\nI DO NOT recommend ordering ahead and picking up your food to-go, because you won't see the mistakes that will be made with your order (old, cold food or additions you didn't want) until you get home.\n\nEven though I liked the food, I would probably eat here again only if I were in a hurry and hadn't had my daily vegetables. Other than that, probably not.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "This is my overall favorite place to eat in Brooklyn Heights. The workers are the sweetest, they even get to know you by name! The food is amazing, it is all fresh and healthy too! I love going in there, the atmosphere is great, they never mess up my orders and the food is always done quickly which I love. Would highly recommend to anyone in the area looking for a great place to eat!", "author": "Samantha C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-22", "description": "Customer service is horrible. Called two times to inquire about one of the items on the menu. The first call I was put on hold for three minutes until I finally hung up due to the long wait. For the second call she said she couldn't hear me, put me on hold, returned to my call after I waited for two minutes and she hung up on me. Seemed like a good place to order food from but based on both of these calls alone I will not purchase anything from here in the future.", "author": "Lauren J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-29", "description": "Terribly slow. They claim to be fast and to go. Ordered a salad and it wasn't ready for 25 minutes.", "author": "Alexa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "I always eat here, but only started using yelp last month. So I decide to give them a big support on yelp since they have always take good care of feeding me :) they are fast and foods are always fresh.", "author": "Cathy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "A more affordable option to get those \"bowls\" we all love around the city. Breakfast bowls, acai bowls, quinoa bowls, etc etc. quality ingredients, friendly service, and a rewards app that gives free food.", "author": "Nicole G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-30", "description": "It was good. But let's be careful on what we call 'healthy food.' I had a bacon cheeseburger with ranch dressing; no matter where it is sourced from, it is NOT healthy. That said, we were after tasty rather than healthy and this place delivered. The fried were cold, but still tasted good. My only complaint was the aucustics. Went at lunchtime on a Thursday and it was LOUD. REALLY REALLY LOUD. MUST GET OUT ASAP LOUD. There is nothing to absorb all the noise and it was jam-packed. So, I would recommend taking food to-go as opposed to eating in.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "Love this place. Food is amazing and SO fresh. The tea is the best!", "author": "Jessi B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-01", "description": "Food is great!! Customer service sucks!! Kataya was very RUDE. My friend and I were regular customers before but we stopped going since that day KATAYA treated us so bad.", "author": "PJ F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-12", "description": "First time trying this spot although the concept is cool-with the visibility of the back of house line my experience is why I won't be coming back. During what was clearly a busy lunch time I was sitting at the counter across from the grill waiting for my order. A girl in the back that was tracking orders and telling cooks and preps what she needed was SO RUDE to the staff- one grill cook in particular. That visibility concept - I can see you too. I won't come back to place that treats their people that way.", "author": "Angela G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "I am addicted to b.good. Every ingredient in the salads and bowls are super fresh and high quality. After I eat here I feel satisfied and healthy but not like I'm going to be hungry again in an hour. You don't get that gross feeling like the ingredients have been sitting around in bins for days or like you could have made the bowl at home. You could not have made the bowl at home! The dressing is amazing and not like anything you have at home. The people who work at this location are all super nice and amenable to change requests and additions, and the food is made really quickly.", "author": "Jenny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Perfect place to go if you want a delicious healthy meal. Tends to be packed but that's because the food is so good. I ordered a kale gains bowl with quinoa and tofu and I was full for the whole day ! Everything is made fresh and worth the price. I also really loved the atmosphere of the place and will defiantly be returning soon !", "author": "Veronika O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "I find their food to b. good! Very good. I'll spend more than average here on a typical lunch but it's worth it. Would come here every day but then I'd be broke. People that work here are also very friendly - a rarity in the nyc fast food industry. Only thing they need to do is post their drink prices on the wall, deeyar. Because I wanna try their rosemary lemonade but not if it's, like, $5, naw I mean?", "author": "Haj da P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "My fiancé \u0026 I are loving the addition of B Good to the neighborhood for a quick meal! He religiously orders the turkey burger with gouda cheese, mushrooms, and carmelized onions (I think it's called the \"Adopted Luke\"?), and I've ordered salads and smoothies, which I've enjoyed.  One thing I didn't enjoy was their fries - they're not bad taste-wise, just felt they could have been a little crispier.", "author": "Michelle R."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "B.GOOD", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/zR5PBnIdbRry0-GB89r9qg/ls.jpg", "@type": "Restaurant", "telephone": "+17185224663"}