{"aggregateRating": {"reviewCount": 166, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "I work across the street and I go here a lot, they have the best vanilla milk shakes. The staff is very friendly, the food is good. it does take time to prepare bc it's all very fresh. If you're in a hurry ask how long the wait will be, they are honest. Good place to get healthy food on montague st.", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "God bless healthy food ! \n\nI feel really happy to see such new business around! We were at Brooklyn Heights yesterday, looking for something to eat and here we go!\n\nThe story of the business is written on the wall to the left when you enter, thanks to that uncle Anthony who advised to \" be good \". \n\nI was not really hungry so order the kale crush, 209 calories only, who would believe? Banana, pineapple, pineapple juice, apple and kale. SoOoOo GooOod!\n\nMy boyfriend tried one of the kale \u0026 grain bowls, spicy avocado and lime. He loved it. They also carry burger, breakfast and kids menu.\n\nWill be back soon :) Great job guys, also the donations board caught my attention, congrats.", "author": "Ceren A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-10", "description": "Usually B Good is good but tonight the grains were so undercooked they were barely edible, and the bowl had almost no dressing. They need quality control.", "author": "E T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "I eat here quite often as it's close to my job and I never grow tired of their selection of salads and grain bowls. The owner must have read my mind, as I'm a clean eater but have an addiction to french fries and sweet potato fries which are on the menu. The food is made fresh and the drinks are usually unique delicious flavors.", "author": "Janice W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "A healthy addition to the neighborhood. Nice to have this choice of b.good amongst the five guys and pizza places down the street. Good juices and sides too, only con would be that they have forgotten to put a few items in the bag upon picking up my order.", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-04", "description": "This review is for delivery. \n\nWe got delivery last week and I ordered a custom burger. They forgot a expensive,extra topping I ordered on this. The burger was dry and small. Bread wasn't toasted or grilled. \n\nThe fries weren't good at all. They are supposed to be healthier, which is great, but they used old green potatoes. You could see the green color on the skins. This wasn't very appetizing. \n\nThe highlight of our meal was the shake, it was the best! \n\nWe didn't finish our $50 order and ate chips at home to fill ourselves up. \n\nI won't be ordering again.", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Best meal in a long time. I will be back as often as possible. Salads were unreal (I got the watermelon and feta) spicy avocado grain bowl was so flavorful and fresh, veggie burger with blue cheese was so satisfying and cooked separately from the meat burgers which is vital.\nMy 2 1/2 year old was treated like an all star and after crying that we ate all our food and didn't leave him any, we got him the grilled cheese kids meal which he devoured with the biggest smile. \nWere all leaving feeling great.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-09", "description": "I don't know what all the hype is about this place.  I commend the use of all natural fresh ingredients and vegan options,  but the flavor is lacking.  The turkey burger tasted like a dry hockey puck.  The bun fell apart from being dry.  Basic seasoning of many dishes doesnt seem to exist; salt and pepper please .  Orderered some \"crisp veggies\" side dish. Nothing crisp about them. Sauteed with a bit of browning on them doesn't mean they are \"crispy\" . And theres nothing worse in my book than soggy french fries.  \n Sorry, but b good could and should b better, a lot better.", "author": "Douglas H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-31", "description": "Healthy \"fast\" food alternative with very friendly staff. Super accommodating to every diet imaginable with free refills on fountain drinks - all of which seem to be housemade iced teas and juices. \n\nThe menu is also seasonal and changes frequently. I love the ginormous salad/grain bowls. Nice option when you're hungry, don't want to eat junk but also don't want to spend restaurant time and money.", "author": "Susan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "b. good. The name says it all. If you want good, healthy food. Local, grass-fed, and my salad tasted like... salad. :)  Its the place I'd go to when I'm in my \"dieting\" mode. Super fresh. Lots of options of grains, salad, burgers. They gave me a free soda since it was my first visit. I'm not sure if thats a standard thing they do, or I'm just \"so special\". :)", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "If you're looking for a cheap and healthy spot to eat, look no further! I've come in here several times with my boyfriend and we have yet to be disappointed in the taste . The portions are not that big but for the price the quality is really good. My favorite is the Cousin Oliver burger - it has lettuce, tomato, onions, and homemade pickles. A classic burger but delicious !", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-29", "description": "Unbelievably disappointed. Ordered to-go a spicy avocado warm bowl and when I got it home I realized only about half the salad was actually in the bowl. If you're going to charge $12 for a salad, at least give me a full bowl of kale. Ive been to many of their restaurants in Boston this was my first experience at this location. Overall extremely unsatisfied. Go somewhere else if you want a filling meal.", "author": "Brittany P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Was in the neighborhood and stopped in here. Tried the spicy avocado and lime salad with tofu.  Justin made it with love hehe.   Actually it was the friendly staff in general why I decided to stay.   Thank you.  I'll be back.", "author": "G A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-20", "description": "I applaud the use of local produce but the \"healthiness\" comes mainly from the fact that the portion sizes here are ridiculously small. A lunch salad that only has ~200 calories means you're getting at most 1/2 a cup of kale. The new Roasted Root \u0026 Mushroom salad was painful to eat: it lacked flavor, some of the ingredients were hot while others were super cold. The turkey burgers are good but when ordered with vegetables instead of the bun you'll end up hungry in 1/2 an hour.", "author": "Rudi M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-19", "description": "Worst customer service. Everyone is rude in this place, cashier looks bothered to help us. The woman who does the Shakes was rude borderline aggressive when I asked her for un empty cup to get water. Unacceptable. Management should really step in and provide better training and customer service.", "author": "Keren O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-21", "description": "Terrible. We live literally 2 minutes from here and when we got our food home it was freezing cold. My veggie burger tasted like it had come straight out of a fridge. I've been here a few times now but I don't think I'll go back, it was that disappointing.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "b.good is all good to me. After finally stepping in this eatery few months back, it's high on my go-to for lunch stop. I invited an employee of mine, and he was sold. Food is delicious and visibly prepared with their open-concept kitchen. I enjoy watching my food prepared as much as I enjoy eating it. I recently cut meat out of my diet--bye bye turkey burger--but the switch to their salads was seamless because they are super delicious. And nutritious: Brussels sprouts, pepitas, sesame carrots, quinoa, and kale yeah! \n\nPlus, the manager and staff are helpful and friendly.", "author": "K R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "B.Good... Wow.  Great place.  Healthy, fresh, great tasting, service is amazing.  We've been going here for lunch every Saturday, they even know me by name! In never thought Kale and quenua could taste so good!", "author": "Tom K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "SOUTHWEST CHICKEN SALAD!!! I've had it before but I think they tweaked the recipe. The dressing has a smoky/spicy taste that I don't remember. Anyways it's one of the best salads I've had in a while.\n\nThey have a really great app too that you check in with. After a certain amount of visits you get a free side or smoothie.", "author": "David G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-07", "description": "Return? Maybe in a pinch. but not frequently \nAtmosphere (3) - Mainly takeout so pretty sterile \nService (3) - Friendly but not terribly proactive - I had to call them out to get their attention\nFood (3) - Portions are small (don't expect leftovers), Sesame 5 (4), mediterranean chicken (2), watermelon feta salad (3)\nDrinks - n/a\nCost = Meals are $10-$12 before tax/tip", "author": "Will S."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "B.GOOD", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/zR5PBnIdbRry0-GB89r9qg/ls.jpg", "@type": "Restaurant", "telephone": "+17185224663"}