{"aggregateRating": {"reviewCount": 166, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-01", "description": "Has a chance to be decent, but isn't. I got the avocado \u0026 lime grain bowl with chicken. In reality, it was really a bowl of the spicy sweet sauce with some of the other stuff mixed in. The chicken was over cooked and not much in there, there were almost no grains, and the meat was cold, which is interesting considering I waited 20 minutes for my order. I couldn't even finish eating it because it was so thoroughly drenched in sauce. Zero interest in returning, might as well just go to chipotle, it's way better.", "author": "The T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Absolutely the best burgers in the area. Fast service and tasty food, what more can you ask for. Oh and they also support the local school PS8 too! Go check it out!", "author": "M F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "came here for lunch. \nhad a chicken burger made as \"west side\", basically grilled chicken with avocado, cilantro, fresh salsa, chipotle puree + lime. i also had a kale crush smoothie made with kale, apple, pineapple, banana + pineapple juice. burger was yummy + not dry. smoothie was good. would return here for lunch when in the area.", "author": "Cassie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "This place is great! I pop in here for a smoothie at least once a week - if not for  bowl or salad - because I work in the area every day. A lot of places tag themselves as \"healthy\" and aren't, but this place really is. I eat their food without feeling any guilt after, and I always feel great but full. It's also ready super quickly!", "author": "Elise O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Sweet potato fries and veggie burger were pretty solid. They have Kensington high quality ketchup and mustard for self serve! No regrets on the kale smoothie, though I ordered the kids version to conserve some cash. Honestly the meal wasn't very filling so be prepared to eat again soon... and try not to be turned off by the radish portrait on the wall with a placard saying they're beets", "author": "Ivan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Food is delicious and healthy. I've had a few of their salads and a chicken burger which was really good. The wait isn't long at all and the staff is pleasant. It's not too close to my job but when it's nice out I make the trek for lunch (and pass up westville which is my favorite) because the food is that good.", "author": "Jeirlynn J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Finally. A healthy and affordable place to grab a meal, without being forced to eat at a sit down. Conveniently located right on Montague, I find myself going in here multiple times a week to grab something healthy and filling. The staff at the Montague location is friendly and pleasant and are always accommodating. I hope they continue pushing for the importance of local and fresh food. Their app is easy to use as well and grants me little freebie's every now and then too. Portions are a generous size and I'd say the price is fair the most I've ever paid for a bowl being $13. Love their food, and I will continue to return!", "author": "Ayla A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Love this place! It is a really great healthy option and it is really close by to me. I suggest getting the power bowl with the super grains plus their Lucy blue smoothie. Staff is super friendly and the place is always clean.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "I love this place! Stumbled across it seeking out a smoothie shop on Montague and was pleasantly surprised by all it had to offer! The smoothies are great yes, but the food is even better! Fresh ingredients, beautiful presentation, and full of flavor. The brussel sprouts are delish and the burgers are creative and unique. I will definitely return soon.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Awesome options for vegan and vegetarians! Super Yummy! Recamend ordering ahead of time though.", "author": "Lmgotstyle .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "I love the fact that I have a b.good right near where I work. On the days when I forget to pack lunch, I know that I can grab something delish without feeling guilty because they have healthy options for me! I've tried the Harvest Kale salad, as well as the Spicy Avocado and Lime salad. Both were really good, and satisfying. In fact, the spicy avocado salad was so hefty that I only ate half, and had saved the other half for dinner later that evening (Tip: I took it home, added a 2 hard boiled eggs and some walnuts and actually had enough to share with my boyfriend lol).   \n\nI also really like the staff at the counter. I was actually THAT customer who didn't know what or how to order, and the cashier was really patient and helpful with me. I appreciate that! It also doesn't take them that long to prepare your meal so if you are running short on time, they can get you in and out in 5 minutes. In addition, if you ask for a cup, they have a water fountain in the back where you can help yourself to water. I can see myself being a frequent customer here!", "author": "L. H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Wow! Such nice staff, Jason - nice woman at counter - funny guy shouting orders at pick-up - all smiling, helpful, trying hard to get everyone what they want in time. And - not least - GREAT food. Kale sallad with Brussels sprouts etc was so fresh and filling. Added grilled chicken  \nBrooklyn star", "author": "Anna G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-29", "description": "B. Good? How about b.better. Ordered via postmates and the burgers were dry and crumbly and the French fries flavorless. The two stars are for the spicy slaw that helped mask the flavor deficit.", "author": "Becca J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "3.5 stars. I ordered a burger and veggies. Bread on the burger wasn't super fresh but ok otherwise. Veggies were good and had a lemon taste to them. I would return and try something else next time.", "author": "V M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Really delicious food! Healthy, fast, friendly individuals working behind the counter. Great location, lots of choices. I'm a big fan!", "author": "C S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "After several heavy meals during our NYC visit, we were on the hunt for a lighter option, and b.good fit the bill. Each of us loved our food, which took a while to be made for a quick-service restaurant, but we appreciated the fresh and local ingredients.", "author": "Joe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Probably the best \"fast food\" place in the Northeast. From burger to bowls to amazing sweet potato fries, this place has quality and for an affordable price!", "author": "Clare C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "I have been to b.good at least four times.  I usually have to vegetable burger.  Today I am having a kale and grain bowl and let me tell you my belly is happy", "author": "Bill T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Delicious, wholesome food with lots of choices. The restaurant is extremely clean. Staff are energetic, friendly and fun!!!!", "author": "Shanaya J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "I go to school nearby, and somehow only recently found out about b.good. However, I'm very glad I did. I've been there twice, and both times, I was very satisfied with what I ordered. The food tasted very fresh and was delicious.", "author": "William E."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "B.GOOD", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/zR5PBnIdbRry0-GB89r9qg/ls.jpg", "@type": "Restaurant", "telephone": "+17185224663"}