{"aggregateRating": {"reviewCount": 166, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-17", "description": "I have been a patron since the first week this location opened. There was great anticipation prior to its opening since there are not many food establishments providing these food options in the area. \nThe opening weeks had some issues, but they were minor. Even at that point with all the issues of opening a new location, I thought the establishment was incredibly vibrant and deserved 5 stars. The managers were incredible and the staff was exuberant. \nThe food business is incredibly difficult and trying to reinvent the wheel is a big challenge in this industry. Overall b. good is effective in their efforts. \nThe food is adequate and the prices are fine. \nAt this point my personal feeling is that b. good has lost some of the momentum they so intensely had when they opened the doors. I cannot provide an explanation. I just would like to have the same insanely great experience I had when they first opened. \nI am attempting to be constructive in my review because I do understand how difficult business can be; especially the competitive food and hospitality business. \n\nI will say that almost anytime I do come in, the establishment is clean and the tables are always wiped down. Good work team. \n\nConsidering that the food  is adequate and the prices are competitive, I feel that the staff exuberance is a bit muted. I only mention this because that was such an amazing part of eating here. This is what separated b. good from most any other establishment in the area; the real feeling of being home. With a little tweak I think that can be done again.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "I had a spicy avocado bowl and it was really delicious! Also, really nutritious. I loved how many vegan/veggie options they had. \n\nI'm so glad I walked in to a get a smoothie the other day because I'd never heard of them. It's in my neighborhood so will definitely go again. It's fast, the staff is very friendly and patient (I took a while to choose). \n\nThe burgers looked really good too so I'm looking forward to trying one of those!", "author": "Zana T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "I didn't realize that b. good has locations throughout the U.S. as well as Canada and Switzerland. \nOn our way to a picnic lunch in BK Bridge Park, my friend and I stumbled here last week.\nSimilar to other places with the emphasis on grains and fresh ingredients, this establishment is  healthy but fast. For some reason, my friend and I waited quite a while for our order. I believe it's because the staff seemed to take pride in arranging the ingredients and doing it just right.\nWith many good choices such as salads, grain bowls, sandwiches and burgers, I finally settled on the Spicy Avocado Lime Quinoa bowl (or you may choose grains). I asked for a substitute--instead of queso fresco cheese, I wanted Halloumi which they happily obliged. They also carry a line of prepared fresh but bottled juice drinks (12 ounces \u0026 a somewhat steep $5). I chose the watermelon.\nMy friend decided on the Farmstand Tomato Basil grain bowl. About $16 later we received our order and headed to the park. You may; however, eat at the establishment as there were enough tables. Interior was clean and staff were friendly.\nWe both really enjoyed our grain bowls as all the ingredients were fresh and healthy.\nThe portion size was about right and quite filling. I enjoyed everything going on in my bowl---quinoa, avocado, kale, sautéed veggies, black beans, grape tomatoes, halloumi cheese, lime, cilantro and a fiery chipotle-red pepper vinaigrette dressing. \nSince I like to eat healthy oftentimes, this place is a nice addition to Brooklyn Heights and a winner!", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "This place is sparkling clean, and has a menu bursting with great ingredients.  I love  that you can go healthy with a flavor packed bowl or salad - or get a burger with fries.  At first I didn't realize there is a great selection of natural sodas - went back to the register and ordered one.  Am eating the Spicy Avocado \u0026 Lime bowl over grains with a black cherry side and am super happy!", "author": "Margaret C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "The restaurant is clean. The seating is a problem, if you're a dine-in person like me. It can get very crowded, if you come an hour after they open. The prices are a bit high, considering there's a Five Guys directly across the street. As for the food, the chicken Caesar salad was okay, I guess. The fries had a burnt taste, but overall were edible. The double burger was delicious. Service can be slow, depending on the day, so it's best come early. In conclusion, they need to fix their prices accordingly, spending $20+ isn't how I want to spend my lunch break. Oh and if you're thinking of getting their signature fountain drinks, make sure you're pulling the lever all the way down! Otherwise you'll be enjoying seltzer with artificial colors.", "author": "Vladimir S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "B. Good just flipped my day upside down.  I was on my way home after an unsuccessful day of trying to play music in Brooklyn Bridge Park.  I got caught in the rain and had to carry a heavy cart of equipment back home.  On my way to the train I suddenly realized \"oh snap, I have a free smoothie on my B. Good app.\"  Immediately the day had some new hope.  I changed direction and headed towards Montague street.  When I got there, the worker was so nice and smiley and served me that free, awesome Acai Smoothie, no strings attached.\n\nOf all the food places I've ever gone to, no one has ever given me as many awesome deals as B. Good.  Just writing the name B. Good makes me crave going back and having another of their delicious burgers.  I really appreciate that they are health conscious and make a serious effort to humanize their workers and make a connection between their food and the people who make it.  \n\nMuch love B.Good!\nNaveh", "author": "Naveh H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "Fast, healthy and fresh. Loved the avocado + quinoa bowl. However, a bit on the pricey side as this carry out bowl was $15.", "author": "Nastasia Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "I was so excited to see a B.Good open in the neighborhood! Whenever I'm visiting family at home in CT, and in a hurry and want some decent fast food, b.good is my go-to. This location is similar to all the others- ample seating, same look, same menu. I love the Roasted butternut salad--butternut squash, cheddar cheese, apples, pomegranate all make for a delicious salad! They have a little something for everyone from salads, grain bowls, burgers etc as well as a kids menu. \n\nExcited to have a healthy fast-food option in the area!", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-01", "description": "This place is great if you like dry, overcooked burgers, stale buns, burned fries and poor customer service. Never. Again.", "author": "Heather G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "While I'm not entirely sure that a dressing soaked salad with tons of grilled chicken and cheese is entirely healthy, I must say that B.Good provided some really tasty food. We had a chicken caesar salad, a watermelon feta salad and corn. Everything was pretty fast, the staff were pretty friendly,  plus they have rather interesting fountain drink options. \n \nWhat they really probably should consider at some point is some trays for the food. Kinda hard to carry three plates and a drink to my table without a tray. \n\nThe atmosphere was sort of somewhere between a diner and a fast food joint. Just a notch below Panara atmosphere-wise. But better than say, Wendy's. A good place to grab a quick bite or takeout but otherwise unassuming. \n\nBut the food was super tasty, well prepared, flavorful and fresh. The portions were generous. I will definitely be back.", "author": "Emily P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "My boyfriend and I love the spicy avocado \u0026 lime grain bowl (with chicken, extra chicken for him). It's delicious and packed with lots of veggies! Pro tip, download the app and advance order your takeout to avoid the wait!", "author": "Carina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Food: Delicious, healthy, large portions, full value.\n\nPrice: Expect to pay $7-10, and not regret it.\n\nService: Attentive to your tastes and preferences, customer service oriented, smiles everywhere.\n\nMy favorite dish is the spicy avocado and lime kale and grain bowl. Very filling, great flavor. Also, try their smoothies. The peach and cherry smoothie is great!", "author": "Blake H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "Only in Brooklyn Heights once a week for work \u0026 never have time to explore but today I did \u0026 stumbled across this gem! I'm not a natural food junky but the seasonal salad was amazing! Great portion \u0026 great flavor. Service was quick \u0026 price is on point.", "author": "Alexandra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Awesome, healthy and tasty!\nAlso you can order on the app and grab and go :)\nWhen I don't pack a lunch this is where I eat.", "author": "Jeff W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "A coworker has taken me here three times now and I have not been disappointed yet. Their turkey burgers and salads are delicious. The food is always fresh and the service is quick.", "author": "Dan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "The service was amazing, specific call out to Ashley who was incredibly helpful and nice!", "author": "Rachel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Really liked this place and how it's \"fast food\" but healthy. We got the Bacon and Apple Bowl and the Spicy Avocado and Lime Bowl. I shared them with my two kids, ages 8 and 6. They don't like kale (or too much healthy food) and they did complain that there was \"sooo much\" kale in the bacon bowl, but they both ate the bowls! I really liked the taste even though the ancient grains had something that felt undercooked; I'm not sure if it was undercooked or is that the consistency it was supposed to be. I ordered take out so I couldn't ask. Also, the bacon and apple bowl had no apples, but it did have cherries so the kids liked that. The red pepper vinaigrette dressing was really good and I usually don't use dressing. I would definitely go there again;  I felt good about the easy healthy choices and the staff were awesome and helpful!", "author": "Lydia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Came upon b.good in Brooklyn. The staff was so friendly \u0026 helpful. The kale avocado bowl \u0026 burger were delicious, for a fair price. I want one of these in my neighborhood!", "author": "Emme S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-13", "description": "They say you only get one shot at a good first impression. B. Good made a great first impression, aesthetically. The employees were nice and helpful. Unfortunately that is the last of the good first impression. I placed my order online and picked up in the store. My burger bun was charred/burnt and the burger (beef) was very well done. The fries were pretty good albeit a bit cold. I'm hoping this was a one-time, off their game moment that I can attribute to being new and getting settled in. I will be giving the spot one more chance. I'm hoping it's not for nothing.", "author": "Colleen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "AMAZING FOOD AND SERVICE 100% of the time. This place is clean, brand-new, very healthy and very delicious. Casual environment but it's comfortable for sure. I have never encountered a negative employee or been dissatisfied with service. A great business to support definitely! Xoxo", "author": "Jade A."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "B.GOOD", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/zR5PBnIdbRry0-GB89r9qg/ls.jpg", "@type": "Restaurant", "telephone": "+17185224663"}