{"aggregateRating": {"reviewCount": 166, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "I kid you not when I say that I decided to resign my lease when I heard this was coming to the hood. I used to go to the original location in Cambridge during college, and was elated to know that finally, FINALLY, bk heights would have a delicious, healthy, fast food spot to replace Ziggys (rip). The food is delicious and doesn't make you feel gross afterwards. My only complaint is that I wish the acai bowls (only $5!) were available on the weekends.", "author": "danielle t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Excellent salads and grain bowls, tons of options and add ons, and the loveliest staff.", "author": "Fern F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-26", "description": "I come here pretty often because the food is fresh and tasty. But the service has gotten worse and worse everytime I come. The people who work here are slow and dont prioritize orders.", "author": "S F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-21", "description": "This place has awful service.  I have ordered from here multiple times and every time I say I will never order again, but unfortunately it is the only good salad place open for dinner in my neighborhood.  I just picked up an order and for the second time in a row, they forgot to add the grilled chicken that I paid extra for to have on my salad.  Last time, they also forgot to put on my dressing.  The food is good... if you actually get what you ordered and paid for.", "author": "C. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Awesome that they are coming to NY!!! Been eating there in Boston for years and one thing great is that the menu keeps evolving and getting better. Burgers, salads, bowls, all good. Love the spicy avocado bowl. Great for kids too.", "author": "citizen l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "The Elizel burger with grilled asparagus is one of the best hamburgers I've ever had. I've been there for it three times already. The first time it was awesome, the second not as good, and the third (yesterday) best ever. Fries are just so-so but the ketchup is out of this world. It has a spicy kick to it. I've also tried the something Luke burger, which wasn't that great, and had a small piece of beef that seemed to be uncooked. The fountain drinks are great, and they have raspberry seltzer, which I've never seen anywhere. Looking forward to trying some of the bowls soon. The staff are nice and friendly and the decor is just beautiful. But the tables aren't that comfortable if you sit on the bench side. They kind of hit your legs at the wrong place. Also, every time I've been there, the tables have been dirty. Staff should wipe the tables more frequently. I actually saw a customer cleaning her own table. Little things like that could break a business here in the Heights. Aside from that small issue, it's a great place, and I'm very happy to have it here in the Heights. Looking forward to going there for many years to come!", "author": "Laura K."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "B.GOOD", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/zR5PBnIdbRry0-GB89r9qg/ls.jpg", "@type": "Restaurant", "telephone": "+17185224663"}