{"aggregateRating": {"reviewCount": 166, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Great healthy fast food! Love their seasonal salads and bowls when on the go running errands, bringing one to Brooklyn bridge park, or ordering in when working from home and looking for something fresh. \n\nI love the harvest kale salad, spicy avocado and lime bowl, and all of the smoothies. When I'm really hungry I like to add a veggie burger to my salad too to make it heartier but still full of healthy vegetables. \n\nTo me the concept is similar to bychloe but not vegan (which is great since I'm not vegan!)", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-10", "description": "Ordered the avocado lime bowl... disgusting. The flavor of the dressing overpowered the whole bowl and made everything soggy. Ordered sweet potato fries on the side.  They were extremely soggy as well and flavorless. Also, one of the girls preparing food was touching her phone with gloves on and wiping her eyes with her tshirt. \nMy friend orders a chkn sandwich and said it was dry and tastes funny\nWould not dine here again yuck.", "author": "J T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-23", "description": "I was so so excited for this. Because of the good reviews and delicious photos. I went out of the way thinking while in Brooklyn we might as well kale. I brought my meal to a party and literally everyone asked what is that? It looks so nasty. The egg was cooked through. Drowning in sauce. And I ended up throwing it out (to chanting from the crowd) without eating it. Got pizza instead. Look at the photo, imagine the pungent smell of an overdone egg, and judge for yourself.", "author": "Anna D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-25", "description": "Great concept, but service is poor.\n\nWaited 25 min for a burger and fries.\n\nNot sure if the cook was on break, but he was texting or something on his phone for a while, then finally made the food.\n\nBurger was not topped the way I asked and the potato fries were ice cold.\n\nPlace was completely empty, with 4 staff that I could see so not sure why the service was bad.", "author": "Joe A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "What a perfect addition to Montague Street! This counter service, fast but fresh food concept is just what the neighborhood needed. They offer fresh salads, grain bowls, organic chicken sandwiches, \u0026 burgers... all made with fresh, local ingredients.\n\nOn our first visit, we tried two different chicken sandwiches (the Buffalo and the Luke). Both were super tasty. For sides, we got the sweet potato fries and grilled zucchini with shaved parmesan... all spectacular.\n\nNote that the prices are very reasonable for this area, which is certainly welcome! AND the portions are big!! Definitely a win for me!\n\nI will conclude my review with a special shout out to their sweet potato fries. They are oven baked and utterly mouthwatering.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Yo, this place slaps! The employees are slow as shit, but it's whatever. Every employee i've met is super chill and nice. 10/10 would recommend, especially to vegetarians.", "author": "Abby C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "I have been here 3 times, so far So good. First time I tried their west side burger. It was small but good. I downloaded their app and got a free side. Today, I ordered the spicy avocado and lime salad and also got a free smoothie.  It was delicious! I can't complain about the food.", "author": "Jocelyn R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-12", "description": "Been eating there for few years now but the last time I picked up a power bowl - it was half full of a bowl. The food is delicious but very disappointed in the half full bowl for lunch that was $11.50", "author": "Rajinder K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "I never heard of b.good before walking inside on a whim with a friend. I am wary of most \"fast food\" type of establishments  and chains but thought \"How bad could a place called b.good be?\".\n\nFirst of all, they offer plenty of vegan options and a few of their menu items were vegan without alterations.\n\nI ordered a meal with bok choy, quinoa, mushrooms, almonds, and ginger (I think it was called Ginger Almond Salad). There was an option to add protein including tofu but I thought the portion was perfect as is for a late dinner. For lunch I might try adding tofu.\n\nIn addition to food, they offer a selection of smoothies and a variety of presumably homemade drinks such as beet lemonade. I didn't get to sample any on this visit but I may do so next time.\n\nMy friend and I were given friendly service and greeted with a smile. We came after a night class and ordered our food to stay. Even though they were closing within the hour we never felt rushed which is very rare in a city full of apathetic people in a rush to go nowhere.\n\nb.good is open late, offers fresh and healthy food at a fair price, and great service. I would definitely return to sample more of their menu.\n\nb.good to your body, it's the only place you have to live. ;)", "author": "Anya N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "Healthy, fast food with great flavor, seasonal specials and local partnerships. Love all the salads, soups and smoothies. The burgers are good but a little small. Prices are a little high but worth it for the quality of food. Everyone is friendly, organized, attentive and will go the extra mile. This location has the best staff!!! They just need to deliver and beef up their burgers a bit.", "author": "Kiki K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "It's been a while since I checked a place out on opening day, but I've really been looking forward to the opening of b.good for a while. Another fresh salad/bowl-type place with local ingredients? Count me in!\n\nIt was insanely hectic, but I guess people are enthusiastic--I certainly was. My coworker and I had a bogo coupon, so we used it. I got the spicy avocado and lime quinoa bowl, and he got the curry and grilled avocado. \n\nWe waited nearly twenty minutes for our order--we were both pretty incensed, especially as our other coworkers, who randomly showed up nearly 15 minutes after us, were both served first. The manager, Noam (sp?), came over and was awesome--really apologetic, and we get it's the first day (and a crazy one, too!). He gave us both coupons for free bowls in the future, which is great customer service.\n\nMy bowl, which had a little too much dressing (and was too wet), was otherwise delicious. My coworker loved his. \n\nI'm sure they'll iron out the kinks soon enough. We'll definitely be back.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "My first time here. I ordered zucchini spaghetti with egg plant meatballs. Fresh and tasty and \nfull of veggies. Eggplant meatballs were baked and had a very nice flavor. I can't wait to come back and try more of their healthy fare.", "author": "Beth O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "I was feeling pretty lazy about cooking tonight (like most New Yorkers probably) and decided to order delivery. Shocker! I almost hit the reorder button on my go to place but decided to spice things and try something new. I ordered the Spicy Avocado and Lime Salad with Sweet Potato Fries. The delivery was quick and nicely packaged and the food is bomb! The salad is a large portion and they have many other healthy options to choose from. I'll definitely order from them again.", "author": "Madison N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Loved this place I ordered a south west chicken salad it was amazing and they grill the chicken so it's not cold in the salad. And there's no extra charge for add on topping I your salad", "author": "Genesis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "I ate here the other day and was surprised to see a b.good in NYC.  I had been to their locations in Boston over a decade ago.  b.good is a fast food place that serves very healthy things that are local, grass-fed, etc. and are often not classically health food.\n\nI had a burger.  The beef was very lean and came on a wheat bun.  I ordered a side of sweet potato fries and my wife got a burger without the bread and substituted in some greens and veggies.  The veggies weren't seasoned much but it was all very good.  \n\nThe staff was friendly and knew the menu very well.  One thing is that they get very busy at lunch during the week, so plan ahead.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "Online menu is outdated. We came here for the breakfast sandwiches and açaí bowls and they serve neither. Plus, unfriendly staff.", "author": "Miriam P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-26", "description": "I really hate to give out merely a decent review because people working there are really nice. They don't mind striking up a conversation with you, no matter how busy they are and have to multitask.\n\nThe problem is I just cannot justify how a power bowl - mostly made out of various greens and an okay boiled egg - and a side order of kale juice can bounce the check up to nearly 20 dollars. Maybe this strategy will work in a Williamsburg hole in the wall with stingy servers and people voluntarily line up for 10 hours for it, but in a Brooklyn Heights comfort food chain outpost? Not so much.\n\nOther things on their menu aren't as outrageous but they still screams overpriced to me. Just look at the burgers, which aren't any meatier than the Banh Mi sold next door at Hanco's (which I love by the way), but can be way more expensive. They don't taste bad from my friend's perspective, but I just don't see myself shelling out cash for this rather than at Shake Shack.\n\nThe power bowl was pretty generous, portion size, as I struggled to finish. But it's not as fulfilling as one might've wished. Plus to bear through the layered bitterness of kale, Romania, some of the peas (seriously), and all that, by the time you finished half of it it's no longer appetizing.\n\nAs of now there's not much to keep me coming back to this place. But I think they have a good foundation of what good food is like, and can definitely use some improvements. And as I emphasized, people there are real nice!", "author": "Wayne C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "This is my favorite new place in Brooklyn Heights. A great selection for both plant and meat lovers. The salad and grain bowls are perfect for me since I prefer to mostly be on a plant based diet. But occasionally I'll eat a hamburger with a salad side. And, the cauliflower side is amazing as well. \n\nStaff is friendly and quick. It's very clean and I enjoy eating there. Outside seating when the weather is nice. Great addition to the Heights and another win for healthy eaters, joining Vegetarian Ginger which is on the opposite corner.   Though b.good has nice and healthy organic meat options too. \n\nManagement seems to really be on top of things and the staff seems to get along well.  Happy place to relax and enjoy a meal.", "author": "Jack Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "Grandpa and I stumbled upon this place en route to Pier 6 and decided to stop by for a quick lunch. \n\nWe got an adopted Luke and cousin Oliver. I'm not too picky when it comes to burgers and this place hit the spot! The ingredients tasted fresh and the burger juicy. The flavor was just right (I often find burgers too salty/over flavored, but not here!) Grandpa loved his burger, too! \n\nHousekeeping..\nThere's a menu on the glass window outside. Upon walking in, you order at the cash register and wait for them to call your name to pick up your order. We went a little after 1 and it was still quite crowded! The staff was so friendly that made me thought I was back in Texas \n\nI want to go back and try the rest of their menu!", "author": "Jolene J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "I ordered from here on seamless. I ordered a burger, two sets of fries, a smoothie. What did i get? A burger that was cold. A smoothie with no straw. Not a fry to be seen. Great. Very useful. Of course i want to have my smoothie with no straw! So i call them up and no one answers. B GOOD Should learn to B GOOD. New name should be B. BAD with delivery!!!", "author": "S W."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "B.GOOD", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/zR5PBnIdbRry0-GB89r9qg/ls.jpg", "@type": "Restaurant", "telephone": "+17185224663"}