{"aggregateRating": {"reviewCount": 166, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "EVERY TIME Justin has a smile on his face and welcomes me. He welcomes everyone. He is friendly and professional. He is wonderful! Today I came in with my friend to have dinner and we were helped by Terry and Justin. We found out that they both pulled a double shift. We would not have known it if we weren't told. They were both helpful and professional.\n\nOh and by the way - the food is EXCELLENT! 2nd time having the Maple Bacon Burger - juicy and delicious with a wonderful coleslaw crunch. Love, love, love the Beet-Ginger Lemonade. It will be my summer go to drink. \n\nOkay - so I'm never sure if I'm going to like eggplant dishes. My friend had me try one of her eggplant meatballs (vegetarian) and it was so delicious. The sweet potato fries have a nice crispness and are tasty.", "author": "Dana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-01", "description": "I'm pleasantly surprised at this place. Was looking for a low key meal that wasn't too heavy and we stumbled upon this little gem. \n\nTheir sweet potato fries were delicious. My sister and I enjoyed our beef burgers, they have a good variety of styles and they were well executed. The chicken one was a bit dry, and I like how they have option of veggie as well.\n\nThe registers are on the lower level of the store, with communal tables when you first enter so you don't have to bring a stroller down if you're a parent, but may be difficult for you to order if you're by yourself. They have meal options for kids including mini smoothies.\n\nOverall, it's a great place to grab a tasty casual meal. Quality is good, seating is plentiful, and they have enough variety to keep a group happy. Would gladly come back.", "author": "Susan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-06", "description": "DELIVERY WARNING... \n\nI order delivery with Grubhub. Waited for two hours my food never showed.\n\nI called between the estimated time to check on my food. 35-55 minutes.\n\nI was told by BG phone the food was sitting waiting for the delivery guy.\n\nI waited another hour for my food to arrived. \n\nAt this point I'm starving. \n\n2 minutes before BE GOOD closed I got a called from BG. Saying the delivery guy dint find my place the delivery guy was upset.\n\nI'm writing this review very disappointed and starving.\n\nThanks for nothing.", "author": "Yara L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-23", "description": "I've had B.Good in PA before so I was excited when I saw them on doordash.\nI wanted something healthy for dinner and I knew they would have healthy options. I got the acai Berry smoothie and a West side veggie burger.\nI placed the order at 9:17 pm. I also called around 10pm because I realized how long the delivery was going to take although they were closing at 10 pm.\nMy veggie bugger was very cold and sloppy. The Guacamole and salsa were good but would've been better on a warm veggie bugger and bun. The smoothie is great but there is no straw or napkins in the bag. My order got here at 10:30 pm.\nI'm a little disappointed because I've had food from this franchise before. Maybe I'll try it again during the day to avoid these issues...", "author": "Danielle B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-24", "description": "Was in the area and wanted to eat something reasonably healthy.\n\nYou order right when you walk in, and they give you a beeper.\n\nThere's tons of seating inside.\n\nI went with the zucchini \"noodles\" with eggplant \"meatballs\". Lots of quotation marks. The meatballs were the best part. Rest of it was just okay. Decent sauce. Balsamic glaze was much needed. Portion size was acceptable for around $11.50 (which isn't terrible for being in Brooklyn Heights, but I was still hungry afterwards).\n\nIf I come back, I'll get something with real meat.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-12", "description": "Gluten free veggie burger.\nIt was alright. The fries is baked but it seems fried either way it was good.", "author": "Irish M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Let's start by saying.. it was a Sunday and I searching for more like brunch/ pre dinner food. Def what made my search harder is I try to only eat organic food. I'm ovaries wouldn't have it any other way. (TMI) I couldn't find anything good when I was searching on my phone and was about to give up until someone said to just come down this strip. Saw this place and jumped out to see what it was about and if it had any organic options. \n\nI gave it 4 Stars because the worker didn't seem to really know what kind of food/ ingredients they carried and that annoyed me. She said they didn't have any organic options \"just normal stuff..that's not greasy\". I decided to read the menu and i was sold on when it mentioned the farms and locations where they get the ingredients from. I'm all here for it!! \n\nI ordered the avocado bowl with chicken and brown rice. It didn't look like it was a lot for $14 but it was fulling and I think I'm obsessed. It had soooo many veggies! Ones I would usually pick out of food but eating it all together with whatever orange sauce that is -was everything!\n\nIf you want to eat healthy but aren't too big on veggies try the bowl I got. Ask for extra sauce if you could.", "author": "Tinnil S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "Have to move to a 5 star review thanks to Chelsea who is consistently friendly, knowledgable, welcoming and helpful! She is an asset to this location!", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "My friend suggested this place that I had always sped past while on Montague Street. This is the equivalent of a healthy Five Guys. \nLocation: On Montague Street in Downtown Brooklyn so is not hard to find. They have lots of seating- booths, counter seats and seats as soon as you come in. The place is very clean and the staff is very nice. I appreciated that the person in the register took time to answer my questions despite the line that came outta nowhere behind me.  That being said she forgot to add the bacon on my burger which is probably why it looks so sad in the photo- bacon always makes things better!!\nFood: as usual I was being healthy (low carb) so my food may not look too appealing, but it was tasty. I got the West side burger without the bun. Note that the cilantro is not pronounced so if you're one of those cilantro tastes like soap people this won't bother you at all. In terms of the avocado, it's more like guacamole without any seasoning... and yes, I know I am a guacamole/ avocado snob. I just feel that you shouldn't present it like guacamole if you can't put the effort in. And if it's supposed to be avocado why is it mashed up? I know how to chew avocado without incident! I can say these additions to the burger didn't do anything for it. It was really the chipotle sauce and salsa that saved the burger from being an epic fail. I'm not always a greedy pig, but I can say that I could've done with more food- I was not full in the least bit after eating. (Lesson learned - if you want to be full or disgustingly full go across the street to Five Guys)\nMy friend got the Power Play with chicken and sweet potato fries. She enjoyed it and said it was a nice change from her usual salad. She also was gaga over their beet lemonade. It looks refreshing, but I didn't try it for myself. At the register they have \"brownies\" which the cashier assured us are delicious so maybe one day I'll try one. I just thought it would be helpful to mention that for anyone who likes dessert wherever they go. \nCost: this was pretty expensive for burgers and fries. I know I was paying for the freshness of the items so I won't gripe too much about it. I would definitely come back here, but it won't be too often! At least not at these prices.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-16", "description": "If you want a nice medium rare tavern burger, you won't find it here. If you want a greasy roadside burger like shake shack you won't find it here.but if you want a stale hard bun you will find it here.", "author": "greg j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-31", "description": "3.5- I've eaten here a few times but am now just getting around to posting about it. It's good food. I've ordered a salad and burger there before. Both were good but the service was nothing to rave about. The first time I went in for lunch, I had no issue getting a salad. The staff was friendly and nice. The food took a little while to get but nothing awful. The second time we went in for dinner. The staff kept rolling their eyes when people came in and they were very put out. It was obvious they just wanted to go home. Our food took a good while to come out. The food isn't bad but it isn't great. It is meant for getting a quick healthy bite to eat. I think some of the food is overpriced. For what you get it doesn't match the price. My husband and I went in and got our meals and it was between 40-50 bucks. We could go get something way nicer for that price. The place has lots of room to sit and is clean.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "So, I always said I would write a review about this place but I didnt get around to it, even though I honestly come here a few times a week for their avocado toast with zaa'tar. You don't see that everywhere do you? Their eggplant meatballs are good too. \n\nBut the more interesting story is how I started becoming a frequent customer. I went in once and they had a really, really long line. We were all waiting patiently but I guess something was up so it wasn't moving fast. Nobody complained but one of the managers was so apologetic about the wait, that she didn't let us pay for our meals. Everyone was really happy about that.\n\nEver since then, I started noticing how uniquely nice of a culture this place has, and I come here as often as I can. Go in and you will see that all of their workers are extremely friendly.", "author": "Tee J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Great service \u0026 quality food. I ordered the southwest chicken salad \u0026 a kids size kale crush shake. It was filling and fresh. Workers are friendly and courteous.", "author": "Kyr V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Tastes good ice cold.  So, sadly I live in a neighborhood with very limited delivery and takeout options that are healthy and gluten free.  B.Good will deliver to me, although they are nowhere close.  The downside? Delivery time is abyssal- never less than 90 minutes.  Food is always cold.  But that's not their fault.  And honestly- the order is always correct and somehow the food always tastes delicious, even cold- even the fries... so I continue to patronize them.  One of these days when I'm in their neighborhood I look forward to trying their food hot :)", "author": "C. G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "the food yummy! i love their huge-diametered shallow bowls and their salads are large enough to make you feel full, much like a sweetgreen salad or chopt salad in taste.\n\ni'd get the dressing on the side if you're getting a salad. i found that my entire salad tasted quite homogeneously of vinaigrette.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "Beautiful day outside and wanted some quick take-out for dinner to enjoy by the nearby waterfront. Lots of healthy options here that look to be quite filling. Wednesday night and no line to speak of.\n\nThe burgers looked really good, but pulled myself away from them and ordered a bowl instead. Got the Toasted Almond \u0026 Ginger quinoa bowl ($11) and a drink ($3). First off, the drink station is great - a nice selection of blended lemonades as well as unique colas (not your usual soda fountain). The Beet Ginger Lemonade is delicious, just the right balance (albeit a tad sweet). Bowl is layered with quinoa/kale at the bottom, and cabbage/mushrooms/bok choy/other veggies over that. The toasted almonds are all placed on top, so it takes a little work to mix together everything properly. Ingredients are individually tasty but better blended together - I like the fact there is no overwhelming sauce that takes away from the vegetables.\n\nFor take out, service here is good - took about 8 minutes for food to come out. Great option for lunch or a take out dinner.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Wow, just wow! I had to go to the appellate division in Brooklyn the other day, and on my walk back to the train, I decided to get a bite to eat;  that's when I stumbled upon this gem.  After looking the menu over, I decided on the spicy avocado grain bowl, which comes with kale, sauteed veggies, queso fresco, grains, avocado, black beans, corn,  grape tomato,  cilantro, chipotle puree and a red pepper vinaigrette topped with a fried egg (which is optional), and it was phenomenal...I mean,  I kept \"mmmmmmmmmm\"ing after each bite... that's the indicator; it was delicious! I also really was knowing the exact calorie count of my meal. Please open one of these in midtown Manhattan (east 50s), pretty please!!!!", "author": "Athenais A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-02", "description": "Ordered delivery after having a great pickup experience. Wouldn't recommend this for anything other than the fries which are UH-mazing.\n\nGot a burger which tasted how it looks. \n\nI believe in this place but am passing on delivery. Will be visiting in person in the future though. Happy to have a healthy-ish option enough to give the a pass on the burger experience.", "author": "Kevin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "Their kids menu is amazing and my toddler loved it!! A mini burger with applesauce, broccoli and sweet potato fries plus a kale-pineapple smoothie all on a kids sized plate?!? Awesome! Also, my gluten free bun was the best gluten free bread I've ever had. So impressed. Will definitely be back!", "author": "Alanna F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-28", "description": "After a long weekend of unhealthy Thanksgiving food, my system was aching for some healthier options so I decided to go with B. Good.  I opted for the El Guapo burger along w/ some sweet potato fries and was a bit disappointed.  The chicken was beyond cooked to give it a super hard rubbery texture.  Maybe because I ordered this through Doordash and the kitchen to table time was extended from a minute to fifty minutes but the bread/bun itself had the texture of cardboard - one bite and the burger fell apart.  Sweet potato fries were far soggy and very soft.  \n\nAll in all, I may try B. Good one more time since most of the reviews seem to rave about the place but my first impression left a lot wanting.", "author": "Shubham S."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "B.GOOD", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/zR5PBnIdbRry0-GB89r9qg/ls.jpg", "@type": "Restaurant", "telephone": "+17185224663"}