{"aggregateRating": {"reviewCount": 166, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "Every time I come here my order is messed up. Also they charge vegetarians extra for substituting (not adding) tofu for meat. I won't be back.", "author": "J F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "I love B.good! They have great local food for a reasonable price. Their food is always fresh and amazing. My favorite item is their kale crush. If you're in the area check them out!", "author": "Vivianna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Friendly staff and tasty food, although a little pricey. I went in because I wanted a quick healthy dinner and free wifi. All of the employees were incredibly attentive and seemed genuinely happy. The wifi was steady and consistent. And their roasted veggie sides are made to order.", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Just had the kale minestrone soup. Very tasty", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "The food is delicious and well reasonably-priced, the people working there have fantastic customer service skills, and the order to-go app is so practical and gives me free food basically every 5 visits. Plus, the mission and ideals of the restaurant (bringing ingredients from local farms) is fantastic.", "author": "Mona S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Great spot for both kids and adults. The staff is friendly, food is fresh, and menu is filled with wonderful healthy options that taste like a treat!", "author": "Gabrielle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Excellent, fresh food. The app makes it easy to order. I love how some of the offerings change based upon the season.", "author": "L J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Completely blown away by the quality of food and cleanliness of the restaurant. Will definitely be returning anytime I have to work I that area.", "author": "Caroline P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Best place ever. I wouldn't known about this spot if it wasn't for my boy Albert. Give him a free salad too.", "author": "Andy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Had a great lunch at b.good. Loved the kale salad. The grilled chicken (additional) was way better than typical grilled chicken you get in salads. The staff was really, really friendly", "author": "Dan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "Great food but really slow service. Since they're still kind of new I tolerate it but definitely plan to wait awhile for your food.", "author": "Coco B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "The food was delicious!  Everything I've tried, from the bowls to the sides to the smoothies, has been very good.  Would highly recommend a visit.", "author": "Jason B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "A great addition to Montague Street!  I really like the grain bowls and the smoothies.  My daughter is a huge fan of the kid's meals.  Fancy condiments and a friendly staff round out the great experience.  Definitely get the app for easy ordering and free stuff!!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "This place is great!  I first discovered b.good in Boston, and was glad to see they opened up a Brooklyn location.  The food is made with all natural ingredients, often local, and they do a great job with healthy but also tasty food.  I usually get a burger or the \"Lucy Blue\" smoothie.", "author": "Jeremy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "This is the most healthy, tasty, inexpensive food i have come across in a very long time. I absolutely love this place. I think the service is friendly and fast.  I am in love with the avocado kale bowls. The mixture of fresh vegetables and wholesome grains ensures that you dont have to substitute, flavor for a healthy meal. You can get it all in one.  I highly recommend this restaurant.", "author": "Tricia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "I eat here at least once a week.  The food is really tasty and unlike a lot of chains, it's healthy, fresh, and uses local produce.  The staff is super friendly (really!), and with their loyalty program, you get a ton of free food.  If you live or work in the area, it should be a staple of your diet!", "author": "Dana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "Fine dining it's not but if you want excellent quality food prepared fresh, with a side vibe of farm-to-table, BGood is your place. Burgers, salad bowls, drinks are all excellent and made with inventive combinations of ingredients. Breakfast on the run? Their egg/cheese/bacon sandwich and coffee knocks any deli in the city out of contention. The one time there was a mixup on my order, they credited my app with 6 free grain and salad bowls. How cool is that?", "author": "Richard C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "I love this place! The staff are lovely and know what they are doing. The food is made quickly but always tastes delicious. My 2 year old loves it and so does my 71 year old mother in law does too! Having a healthy but fast meal is perfection with kids. I see lots of people having business lunches for a longer period of time. The place is hygenically clean. Just try it!", "author": "Joradna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "I absolutely love this place. The food is fresh, tasty and very reasonably priced. The service is amazing every time I go as well as the quality of food. I introduced my cousin to it and she's in love with it now too! I've tried quite a few different things from the breakfast bowls, burgers, smoothies and açai bowls. I have yet to be disappointed. The staff is really friendly and very accommodating.", "author": "Alexandra L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-30", "description": "I give 4 stars because the food is yummy and creative and seasonal and I am oh so happy to have this healthy quick place nearby. However, I've eaten here almost 15 times and every single time there is a screw up. One or two items left out of a bowl, an entire sandwich forgotten, generally discombobulated staff. Everyone is very nice and means well and apologizes but somehow this operation must be streamlined! It seems like there are so many (too many?) people working back there for this many mistakes to be made. Otherwise B Good I love you!", "author": "Julie K."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "B.GOOD", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/zR5PBnIdbRry0-GB89r9qg/ls.jpg", "@type": "Restaurant", "telephone": "+17185224663"}