{"aggregateRating": {"reviewCount": 32, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-05", "description": "My friend really wanted to eat here because it's her favorite spot and seeing as how we were tight on time and she had the app I agreed to eat there with her. We both ordered the (excuse my description I don't know the name) chicken with spinach, quinoa,spicy broccoli, tomatoes, and Parmesan cheese with a pesto dressing and some sort of spicy dressing. \n\nNow I don't know if this is the norm but I found the chicken to be lacking flavor when tried independently. The tomatoes were well seasoned and firm, the broccoli was good but I was annoyed because I received more of the stalk than the head. Everything else was pretty okay. We were also given two strawberry mint beverages because our order wasn't ready when we arrived, also on top of that they had to be made again. No big deal we all make mistakes. The drink was the strawberry mint which to me tasted a tad watered down but it was good overall. \n\nNow to the actual restaurant and cleanliness, as someone who used to work at a restaurant before I have to say the restaurant was dirty. The counters had food and crumbs just sitting there despite the fact that there were more than enough workers present to clean it. There were also salad covers just sitting there open and the front display really needed to be cleaned. The tables were dirty and had napkins just left there. Now I can understand if it was 12-2 pm because most restaurants have a heavier influx of customers during those hours but it was Saturday at 7pm so I really don't understand. \n\nThe employees were really nice and I believe the store could be much more than what it is. As far as price I have to admit prior to coming in and tasting the salad I was annoyed that it was 13 dollars, however you definitely get enough for 2-3 servings so I wouldn't say it's expensive at all. I would probably come back to this location because it is close to my job but I definitely recommend they do some more front and back end cleaning.", "author": "Andria A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-03", "description": "Good grief- I love other sweet greens, but this place does not have their stuff together-\n\nOn two separate occasions I've ordered ahead.......only to wait 20 minutes still to get my food. On both occasions the order has also been wrong, including them not including the protein (the most expensive part?!?!?!?) this last time.\n\nOn the other occasions it's always been a long line that takes forever to get through. Let's not mention the always dirty counter or the attitude that the employees have.\n\nSweetgreen was a staple for me in DC and their other locations don't seem to have the same problems but this location is not worth the hassle there always is.", "author": "Elliott W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-08", "description": "I love sweetgreen, and I was so excited when they came to Brooklyn. \nThis location just gets worse every time I stop by.\nOnce, the trash was overflowing to the point that when they tried to empty it out, trash got on the floor and they barely cleaned it up.\n\nI went in today and got on the line; this is my story.\n\n1. noticed the rice in the rice cooker was sitting there exposed, they didn't even bother covering it with the lid.\n2. One of the employees had a hand full of chicken and just carried it from the kitchen to the containers in front. \n3. The kale, was it washed? It seems like it wasn't. It was huge pieces of kale, usually it's chopped up.\n4. You guys ran out of chicken, and I was told it would take a while. Instead I received a small portion of the blackened chicken...\n5. You guys ran out of almonds and just threw whatever was left in the container into my salad, crumbs.\n6. Two of the employees got into a heated argument, and they started cursing. A few of the other employees ran into the back to break it up.\n\nThis was a huge disappointment. The salad was inedible and I threw it out. What a waste.", "author": "Shaima C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-25", "description": "I love the food, it's so good and so fresh. I have 0 problems with the quality of food- but the workers? Where is the manager? The girl who was handling my food today was shoving food I didn't want into my bowl and talking to the guy behind her having a full on conversation. She wasn't paying attention to my order at all. It seems more like a hang out than a job.", "author": "Mari E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "Sweet Green is a great addition to the neighborhood, especially for those who are looking for a healthier alternative. \n\nMy mom and I came here and she was really impressed with all the different variety of salads that they offered. It was her first time and I think her head was spinning with all the choices so I finally decided for her. We ended up sharing their warm bowl curry chickpea bowl and their fish taco bowl, sans the tortilla chips. \n\nBoth bowls were distinctly different in flavors and was very filling. I especially like that my server asked me how much dressing I would like (light, medium, heavy) so the bowl is made to my liking. \n\nAs for the staffs, they were absolutely wonderful. Everyone was very nice and friendly. Decor wise, I love the natural lighting but design-wise, I thought it was okay. Reminds me too much of Ikea so it felt like SG was just playing it safe and kept their design simple. \n\nOverall, I like SG and I like that they are in my hood. I also like that they are only a block away from Trader Joe's because I visit that place offend too. Btw, definitely try their spicy cashew dressing. It's amazing!!!!!", "author": "Nga C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-24", "description": "I love the SG franchise anywhere else.  Who's in charge of hiring or onboarding/ training these employees?!  No one knows ever knows anything if you inquire about anything that should just be matter of fact for employment, and they are unapologetic about it.  There are often discrepancies between charges, depending on the employee doing the checkout.  The only guarantee you have here is ordering via the app.  Among the assorted flavors of personalities here, you can't really say any one employee is excited to do their job.  They often hide out back to avoid managing the line.  If I'm gonna continue to pay $20 for a simple salad that I can assemble myself with the ingredients from across the way at TJ's, then this location needs to refresh and start over.  It's unfortunate as this is the perfect hood in which we don't mind paying the price for excellent service and decent eats.  I'm truly disappointed in the lack of consistency after my appx 20th visit since the grand opening.", "author": "Vinita N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "I love sweetgreen and am so excited to have it in the neighborhood now! I hadn't realize the location had already opened so I decided to stop in as I was walking by this afternoon around 4:30.\n\nI really like the set up of this location. Very airy, lots of room to walk through and lots of seating. The ceilings are high which makes the place feel really open. Service was great and each staff member I spoke to was really nice.\n\nI love that they switched over from the mixing bowls and now mix your salad directly in your paper salad bowl to reduce waste, use less water, etc.\n\nI'm a huge fan of the chicken + Brussels salad (tip: switch the romaine for kale and add goat cheese), and love the pesto vinaigrette and the balsamic vinaigrette dressings.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-04", "description": "I love the food at sweetgreen but this location has issues with the staff, service and cleanliness.  The napkin holders were all completely empty, most of the tables were dirty and the floor was littered with napkins and food.  There were more than 8 workers behind the counter but I still had to wait for several minutes before someone stopped chatting and helped me, even though I was the only person in line(!)Who's the manager here?--you can do better sweetgreen!", "author": "Eric O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "I love sweet green and attended the private tasting \nEveryone was so sweet and kind. I got a salad and a cucumber lime drink. \nI like the design of the store with its potted plants and community seating. It reminds me of a college library\nMy curry cauliflower salad was delicious. I really need to try the squash fries. \nThanks sweet green", "author": "Dionne H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-07", "description": "A co worker of mine told me about this new restaurant in the area so my friend \u0026 I decided to check it out. I like the healthier options in the area \u0026 with fresh ingredients Sweetgreen adds to that dynamic. They do a variations of salads in a larger portion size than most restaurants \u0026 more costly than most restaurants. A salad will cost you between $12-$15 after taxes. For two salads with a extra topping of avocado ($2.00) \u0026 cheese ($1.25 or $1.50) it was $30 for two salads. The food was good \u0026 fulfilling, \u0026 they offer sugar free beverages \u0026 water. I would've liked a beverage that at least had sugarcane in it, but that's just me. You can definitely tell it's a new restaurant that hasn't really got in the groove of keeping it going while it's busy. They don't accept cash, which is ugh \u0026 there was a customer at the register with some sort of issue \u0026 4 workers were standing there in addition to the one at the register helping her out, while there were about 4 people still waiting to served. Working more efficiently I think will happen with time, but overall this was a nice treat.", "author": "Felicia I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-29", "description": "Ordered Harvest bowls: the sweet potato was missing and the rice was so hard it was impossible to eat. Very disappointing, especially for such a new location. Honestly, with Cava so nearby, I would just go there", "author": "Carrie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-04", "description": "I usually love sweetgreen, but someone in this particular location has too heavy of a hand on the black pepper. The first time I had the harvest bowl at this location, it had so much pepper that it was inedible. I figured it was an anomaly and moved on with my day. But again, today, with the winter squash salad, the same exact thing happened. I usually love me some spice, but at this quantity, it is an a-salt on pepper. Please fix!", "author": "Tammy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-10", "description": "I'm glad that there is a sweetgreen here now, however it somewhat tastes different than before. I'm wondering if it is just because they changed their bowls. I remember the salads would be more filling and larger. I had the harvest bowl and it wasn't warm at all. I also had the shroomami salad today (my all time favorite), but I'm surprised that there is cucumber in it now. I am not the biggest fan of cucumber, and thought I would like it with this salad, but still don't. The warm bowls should definitely be WARMER, considering it's so cold these days now! The space is really cute and instagrammable. Service is fast even when there is a crazy lunch line. I would say that the mushrooms in the shroomami salad were also super salty this time. I've recreated this recipe before at home and I like my own version better now. The spicy sunflower seeds need to be spicier!", "author": "Pinky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-02", "description": "I'm delighted to finally have a SG location close to home. I'm not a big salad fan, but I cannot get enough of their warm bowls! The Curry Chickpea \u0026 Chicken Pesto Parm- are my go-tos. They're generous in size, and the warmth is filling, so they split well into 2 smaller meals. I highly recommend the Kale Gingerade if you like a little kick in a cool beverage; it's a fall special. The store officially opens tomorrow, but they're doing a free salad and drink this weekend for those who signed up. The dressing station got a bit backed up, but the staff was warm, welcoming, and wished everyone a sweet day on the way out!", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-27", "description": "Service is great! No have no idea what these reviews are about. However one major issue was that the Kale wasn't washed! Twice I had a mouthful of dirt. Disgusting. Curly kale requires a deep wash! Please make sure you clean it up better! I want to see you stay!", "author": "Sulekha P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-06", "description": "Sorry to say I agree with most of the negative reviews of this location. The staff needs supervision and training. They run out of stuff and wait until the last minute to replace it, I went to the Broadway location many times at different times of the day. The staff at that location worked like a well oiled machine. They have an assembly line kind of process. This location everybody is bunched together at one end or the other and it appears as if the right hand doesn't know what the left hand is doing. \nI was so excited when I saw they were coming to downtown Brooklyn. I hoped that they were just having a bad evening when I went but after reading these reviews dating back to January of this year I think that management needs to have more of a presence in this location and the entire staff needs to be re-trained and closely supervised. I threw out half of the salad that cost me 15.00 because it didn't taste fresh at all. I never experienced that at any sweetgreen EVER.", "author": "Pam A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-25", "description": "I want into sweetgreens  today to get lunch. The young lady that waited on me was so so rude. As she was making my salad she was just throwing it into the bowl. The food was all over the counter. When I bought it to her attention she just rowed her eyes and walked away. The attitude this young lady had was was unbelievable. If I'm sending 16.00 for a salad I expect good service. If I walk into a place to eat it should be clean. With that being said sweetgreen needs to hire people that know about customer service", "author": "Sherwauna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "I love this location. The energy is always upbeat and the employees are always smiling. I continue to visit this location because not only is my salad always prepared correctly I walk out feeling appreciated and catered to as a customer.  Good job management and employees.", "author": "Geneva F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-14", "description": "Best customer service! Came into sweet green for two salads. Ordered the falafel salad and unfortunately had to wait for the falafels to cook. The wait time was longer than expected. As I say and waited, a very kind gentleman approached me and told me that because of the long wait, my salad will be complimentary as well as a drink from the refrigerator. It's been a very long time since I have received such amazing customer service. Will definitely be returning to sweet green.", "author": "Diana G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-31", "description": "I was ridiculed and mocked at this sweetgreen. I will not come back again. I was shocked by the service here. My friend ordered a dish and the woman gave him the completely wrong order. I tried to order my bowl many times but was told to wait because the employee had a friend he wanted to talk to for fun while i was ordering my bowl. I couldn't believe it. That same employee decided to mock me when I couldn't decide what dressing i wanted. Him and another employee burst out in laughter at me. He then snorted and laughed that he had to wipe his nose and touched my food in the dish. I am going to report this to sweetgreen.", "author": "S W."}], "servesCuisine": "Vegetarian", "priceRange": null, "name": "sweetgreen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/RuVFElgjUqGJqPztU8gA4g/ls.jpg", "@type": "Restaurant", "telephone": "+13477676800"}