{"aggregateRating": {"reviewCount": 32, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "Friendly staff, clean facility, quick service, large portions. Overall top notch fast food salad place. Wish there was more seating. Roughly $14 dollars without a drink", "author": "Josh S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-16", "description": "I LOVE Sweetgreen and was so excited when this location on Court and Atlantic finally opened. I've been to this location a number of times thinking it was a fluke that something was always an issue. Usually out of this or that ingredient. \nA couple of times the mushrooms were so salty, it was inedible. \nAlso, when it's time to add the dressing, they over dress and basically ruins the salad. Sometimes it's because they use a nearly empty bottle of dressing, which is almost enough for light dressing, but then they get a new bottle of dressing and start over adding another whole portion of dressing. \nIt seems as if people are often distracted and either socializing or arguing.  \nIn general, the restaurant could be cleaner. The bathroom had about an inch of water on the floor. \nI've been to locations in Dumbo, Williamsburg, Flatiron, SoHo, Union Square, and Meatpacking and they're all consistently good and never too salty, never over dressed, and the staff was just making salads and seemed friendly and focused. \nToday's salad was over dressed. I won't be going back to this location.", "author": "Loretta S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-06", "description": "Love the salads here. Ingredients are fresh, healthy and delicious. Overall, a great addition to the nabe. But I am forced to agree with many others here - the service, and the place itself needs work. The music was blaring so loudly that even when the supervisor yelled across the room to another staff member to turn down the volume, she was not heard over the din. The place also seems messy and disorganized. Many of the staff I hate to say, seem interested in attending to anything other than customer service. Frankly, this should be easily fixable. Just a matter of better training and management involvement.", "author": "Barry P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-12", "description": "Salad is good but my only issue is the fact that they don't have cash as an option to pay for food nobody doesn't want to pay with a card all the time highly annoyed because I was about to walk out of the place and not get any food but instead I got it on the house which was nice but cash should be an option to pay.", "author": "Tiffany N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-17", "description": "Service .... not impressed at all\nI went here on a Sunday, 12/15 at about 5pm. This new location does not set the bar on the weekend like their other locations like Williamsburg or the city. The girl behind the prep bar made my salad sloppy and rushed. I had to pull her back numerous times to ask her if she put in all the ingredients as listed on the menu. Then the guy behind the register counter was completely engaged by the conversations of the  staff were having with themselves. He barely looked at me and was annoyed I was interrupting his conversation. He then charged me and seemed annoyed when I asked him for a to go bag. I mean isn't that your job to ask me not me ask u....\"Is it to go or to stay??\"\n\nThe staff def needs to visit the other locations and see how great those workers treat their customers. I was excited to see this location finally come to our neck of the woods but unimpressed and disappointed to see their work ethic!", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-05", "description": "This place has a LOT of things I really believe in: local and healthy food, reusable or zero-waste containers, great value. I'd love to be a regular. \nHowever, the staff is terrible and spoiled the experience. I've never tried any location of the franchise until today and the attitude and lack of professionalism was so off-putting, I am not sure I would try again.  Mind you it was raining today and the place was far from crowded. There were plenty of staffers yet they all were chatting with each other, standing around staring at each other to step up, rather than greeting and waiting on customers. When they finally did, they weren't all that nice. To add to this, the tables weren't clean, the trash bin was a disaster, and some of the ingredients were a little past their prime (the apples and wild rice specifically) If this is such a horrible job, perhaps it is time to move on. Where was the manager?  Please intervene.", "author": "Bo H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-05", "description": "Love sweetgreen very much, and never thought I would leave a bad review of one however this location has forgot to put chicken in my bowl-- THREE TIMES. I understand once, but how does that even happen? I go back and double check my order each time and all three bowl orders 100% included chicken-- no accidentally deleting of chicken. Three times is just ridiculous and I will not be ordering ahead from this location anytime soon, I recommend in-store so you can make sure you're getting everything you asked, and paid for. 2 stars cause sweet green is the bomb but this location really needs to get it together. There were also only 3 other people's orders waiting and very few people inside, so it's not like it was overwhelming.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Best salads in Brooklyn! They make them perfectly and their blackened chicken is delicious. Really great customer service!", "author": "Gwen L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-26", "description": "I frequently visit Sweetgreen, the one in Williamsburg and the one downtown. I am very upset with the service I received at the downtown location on Monday afternoon. The restaurant was filthy, as if they don't clean as they go. Not only that one employee in particular was very rude. Her attitude drove me to think that she did not want to be at work and with dealing with people that is unacceptable. I was not satisfied with my visit and will think twice about going to the downtown location.", "author": "Janiece B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-29", "description": "Wow turn down the music please. When you walk in it is just blasting. The staff can't hear your orders and it is painful if you dine in.", "author": "Bridget S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "Best place for a quick and awesome salad! Staff is always smiling and happy to help!", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-10", "description": "App is awful and service is slow. Submitted an app complaint issue while I was standing in the store on their network with the app stating I was \"offline\".  Really? Even on your network? #annoyedandhungry", "author": "Juliana P."}], "servesCuisine": "Vegetarian", "priceRange": null, "name": "sweetgreen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/RuVFElgjUqGJqPztU8gA4g/ls.jpg", "@type": "Restaurant", "telephone": "+13477676800"}