{"aggregateRating": {"reviewCount": 61, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "This store is in a great location and the area around it is lively. The store itself is bright and makes you feel like you just stepped into a great vibe due to the openness.\n\nThe food is good and the staff is very friendly. I had the guacamole green salad and it was very refreshing and appetizing. The avocado and the lime jalapeño vinaigrette is a nice touch. \n\nThe drinks are light and flavorful as well. I have the cucumber, lime, and ginger drink and this is one of my favorites. I can drink this all day and feel refreshed.\n\nCome out and visit this location then stop over at the Brooklyn bridge park when you're done.", "author": "Martin V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-11", "description": "overpriced salad... but you get it anyway cause there aren't a lot of food options in dumbo...", "author": "Susan P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-02", "description": "Have loved sweetgreen since they were just their tiny Georgetown flagship. But this location is the worst one I've ever been to. Suuuper slow service, and they keep making errors with the ingredients of their standard salads.", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "Why people focus so much in bad things? Don't know but well. Came here on my trip and people were so friendly and patient. Clean rest, fresh veggies, deli salad. Great spot!", "author": "Yunel A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-25", "description": "The salads here are unique and tasty, and I find it helpful knowing the calorie count. It's just a bit hard to justify paying so much for a salad that doesn't totally fill you up, though.", "author": "Nicole O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-26", "description": "I am glad that other reviewers have mentioned the need for signs to educate new customers because I felt stupid when yelled at while I was following others in line to order here. If no one stands at the beginning of the salad counter, how can I know that I should stand there while dozens of employees are hanging around? Mid-way between the beginning of the line and the cashier, the salad lady asked me to walk back to order (no one was behind me) while mumbling to her colleagues her dissatisfaction with my ignorance; needless to say I walked out instead. Awful experience!", "author": "Adriana C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "Sometimes I wonder how places can possibly stay in business, and this place really made me wonder.\n\nThey don't take cash, which is not only annoying, elitist, and unethical, but should be illegal.\n\nThe employees were yelling up a storm as they joked and hung out behind the counter. \n\nAnd the food is barely mediocre. Wouldn't even call it mediocre. You can eat healthier than this without having to compromise taste like you do here. Meh.\n\nAll in all a fairly irritating time.", "author": "Alessandria E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "The food is very good, and they have a very convenient online ordering system so that you can order lunch, go down and pick it up instantaneously, and get back to your office without wasting the 30+minutes it takes to get food anywhere else in the DUMBO food desert.  The interior design is pretty good.\n\nI've ordered from here, either in person or online, about 15 times so far.  Things I *don't* like about Sweetgreen:\n1. If you don't order online, it's a pretty long line and the staff make mistakes sometimes (but this may get better after they've been open for a while).\n2. They don't take cash.  This should be illegal -- this is the USA, I should be free to purchase food without having an intermediating institution (like a bank or credit card) involved.", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "First time here. I must say the staff are amazing and very helpful. Such a friendly environment. Very clean. The food is so good.  The Guacamole Greens salad is...wow! The staff recommended it and it sure was delicious. I'd come here again and again if not just for the people. Great job!", "author": "David P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-17", "description": "I'm well-aquainted with Sweetgreen and was thrilled that they would be helping solve the barren land of food that is DUMBO. I'm hoping that this is just because they are a new location because so far it's definitely not up to Sweetgreen standards. There's hardly anything in my salad besides lettuce and dressing. I think the management needs to make sure the employees who are new to the Sweetgreen family understand that the company's culture is one of generosity and community. I don't see that reflected here yet.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-03", "description": "The food is definitely tasty, but it is too expensive to  consistently leave out dressing if they're running low or to skimp on components such as protien or even greens. Other reviews expressing this sentiment are not outliers.", "author": "Casey H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "I live in Boston, work in New York, and go to Sweetgreen near-daily whenever possible (mostly in Boston since the lines in New York are enormous).  I was stoked to try out the DUMBO Sweetgreen.\n\nUnfortunately, ALL the other negative reviews are right: the workers clearly hate being there, refuse to make eye contact, and ignore you as you're waiting in line even though there are four to five people standing around doing absolutely nothing.  In fact, the entire time they were making my salad, they were rolling their eyes - no greeting, no eye contact, and they looked pissed AF to be there.  I don't understand how this is acceptable.  I am paying $15 for a fancy salad with extra attitude.  \n\nI showed up after a sixteen hour travel+workday at 9pm, saw that there was a tiny smidge of kale left in their cartons, and asked for my usual custom bowl with kale as a base.  They picked up the tiny amount of kale, put it in my bowl, and I asked if I could have more kale.  I know that they prep gallons upon gallons of kale and easily have more in the back.  My response was: \"we don't overstuff our bowls.\"  Translation: \"I am far too lazy to go get another container of kale.\"  \n\nThe food is as fresh as the other locations (plus one star - sorry - the rest of the experience was awful).  But they need to seriously consider retraining their staff, or finding people who want to work there.  \n\nUnfortunately, because DUMBO is such a food desert, and everything is so overpriced, I imagine this branch will do just fine even with such a subpar customer experience.", "author": "Cathy Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-07", "description": "Food was delicious as per usual but I'm going to have to agree 100% with Darren N - the employees who worked there seemed burdened by having to do their jobs.  Despite my pleasantries, I could barely even get them to make eye contact with me.  I used to live in Washington DC where SG started and back then the employees were happy to be there and eager to please (and interact with) their customers.  I will return to this location because I love the food but my loyal business (and 5 stars) will only be won if and when they fix this major issue.", "author": "KB S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Great go-to Salad spot. Lines can be long but move relatively quick. Hopefully you get Mimi to make your salad. - she was the best!", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "I love sweetgreen and was very excited to have one open in dumbo but the staff at this location has been so horrible on 3 different occasions I'm going to say you're better just going into Manhattan and finding a different sweetgreen there. Or download the app and order online so you can skip the rude and negative interactions with the employees.", "author": "Valerie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Sweetgreen is everywhere in NYC and we are so happy to have it in Dumbo. It is so good so fresh so easy making healthy eating pure joy. The salad additions and dressing are many and satisfy all tastes and diets.", "author": "Tess G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-23", "description": "Good tasting salad, but the customer service simply ruins the experience. Having opened recently, you'd think that the staff would be eager to help customers. Personnel seems bored and, frankly, hostile towards customers.", "author": "Eusebio P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-27", "description": "Lots of grit and dirt in their salads. Everytime I bit into my $15 salad, I kept biting into small grains of sand or dirt. Not what I expect from a premium salad bar. So disappointing :(", "author": "V S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "This restaurant is right where the iconic photo of the Brooklyn bridge is located. The salads are made fresh. They were fast and the food was good.Perfect for a hot summer day.", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-17", "description": "Don't waste your time; store is extremely mismanaged. I just spend half an hour in the store despite the line not being that long. The concept is assembly line salad but that only works if there are competent employees at each station. Otherwise you end up bottlenecked and waiting at multiple stages of the process. Yes, the tourists are responsible for some of the delays but the staff is not competent and is disorganized. Skip it!", "author": "J M."}], "servesCuisine": "Vegetarian", "priceRange": "$11-30", "name": "sweetgreen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "50 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9b1tkPcX2tWi96Lsul4B9Q/ls.jpg", "@type": "Restaurant", "telephone": "+13477574900"}