{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "My boyfriend and I came here for dinner on a Thursday night.  We had the loaded nachos, guacamole, and shared one of the combination plates.  It was happy hour so I ordered a passion fruit margarita and my boyfriend ordered a mango margarita and a modelo beer.  We were full by the end of the night.  My only complaint was that we asked for the loaded nachos with the jalepenos on the side but received it with the jalepenos on the nachos.  It wasn't a big deal, we just picked them off.  The service was pretty good, our waiter checked in with us before happy hour was over to see if we wanted anymore drinks.  We sat by the window which was probably a bad idea because there was a draft so I wouldn't suggest taking the table by the window.  The tables are also pretty small. I would go back there again with other seating arrangements.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-25", "description": "-I'm 99% sure the Chicken Quesadilla was chicken and slices of Kraft American cheese.\n-Service was indifferent at best.\n-Marg was good but pricey.\n-Bill was $50 for two people. Cash only was annoying for what is a normal restaurant.", "author": "Nick P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-13", "description": "Mediocre Mexican in a city of amazing Mexican options. It's also not cheap. For a family of four, get ready to spend 80 bucks. \nOh yeah. And you have to pay cash because I guess the owner prefers to not pay taxes.", "author": "L R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "Wonderful Tex-Mex in Cobble Hill! Cute place, that looks small from the outside, but actually has a large dining room upstairs, and a backyard outdoor garden! Hefty portions, and consistently good! Cash only! But they also have an ATM upstairs.", "author": "Meri K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-12", "description": "I have been here a couple of times. The food and drinks are consistent and the service OK. So, when my brother said he had a hankering for Mexican and we were close, we said cool,  let's stop in.  \n\nWe walk in, are greeted cherrily, asked how many in our party and asked if we wanted to sit downstairs or upstairs.  We opted for upstairs and are brought to a petite booth. We ask  to be seated at one of the empty more spacious tables around us; two out of the three members of our party are larger and the third is tall. We knew it would be an uncomfortable meal seated in the booth presented to us. The server said they expected to be full and that that was pretty much our only option. We tried to work with her but,  it was really uncomfortable.  \n\nWe asked to be moved and are begrudgingly offered the booth across from us that is the same size which, we turn down.  Then finally we are offered the roomy table we needed/asked for in the first place and were yet again told about how busy they expected to be.  There was a hint of you all should be grateful that we accommodated you. \n\nWe all three were done by that point and opted to leave.  The customers comfort, needs and reasonable requests are not inconveniences to a good business but,  to Lobo it is unthinkable. Never again.", "author": "Amelia F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-14", "description": "This place fucking sucks. Sorry, but they do. People were super nice and service was quick. Everything was clearly microwaved. Pork tasted horrible and chalupas were soggy. Come on guys!!! Cash only either? Save it for the hip places. I had to pay $2 extra to pay cash. Who the tits carries cash in bk? \nShitty food. Waste of money.", "author": "Rob H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-02", "description": "Food: 5 stars\nMargaritas: 5 stars\nWait staff: 5 stars \nManager: 0 stars \n\nI fully understand that there are a lot of restaurants in New York that are cash only. However, this was not disclosed (blatantly) until we received our check. The waiter was incredibly friendly and said that we could speak with the manager as they have swiped a single credit card for large parties. He sent the manager over and she did not deliver the same information. She was not only short and rude, but she did not offer solutions other than using their ATM machine. Anyway, we all got cash out. We sat waiting for someone to collect our money for 15 minutes and no one came. \n\nWe all got up and walked to the bar, where the manager was standing facing the wall and texting, and asked how we could get our check taken care of. \n\nI said to the manager, \"get a credit card machine\" and she boldly retaliated \"tell the owner.\" I then asked her how and she had no response. I then told her that we waited for 15 minutes and she, then again, had no response. \n\nSuperior food, superior service, inferior, lazy management. A total buzzkill.", "author": "Derek P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "I've held off writing this review for years because of the sad fact that too often, once something gets too popular, it gets ruined. \n\nWhelp, since I've moved away from Brooklyn and won't be able to visit Lobo regularly anymore, I figure it's time to give it the review it deserves. \n\nSimply put - there's no good reason that Lobo isn't more full of people every time we go. There's no good reason we don't have to wait for a table, or wait a long time for our orders. Above all, there's no good reason the price isn't 20% higher. \n\nThe food at Lobo is authentic Austin style tex-mex, executed perfectly. The selection of beer is likewise just what it should be - you can order a coupe of different flavors of Shiner depending on the season. The service is speedy as all hell and the waiters are friendly, attentive and never forget anything. And for all of this, you get to pay surely what's less than is warranted -- no matter how many times I go back, I always feel a little dirty, like I paid too little for what I received. \n\nLobo is everything that's right with Cobble Hill -- it's a double-edged sword that it's not getting the attention at deserves. For the time being, though, it remains a somewhat hidden gem.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "Small place we stopped in to eat at. Honestly how many food places still don't accept cards. We waited to be seated and then were told to find a seat outside on our own. Outside was cute and quaint, but the waiter was impatient and a little snippy. My Bloody Mary was ok but the waiter was not happy to answer any questions about the menu. Even tho reviews said there was unlimited chips and salsa I had to mention it and request the chips. The wings appetizer was good, the chips were good and the salsa was good.when the food came I was the only one satisfied (I had a chicken quesadilla and flautas) as my husbands chicken fried steak looked like it was fried in old oil and tasted like liver. When he mentioned it to the waiter he was told maybe he wasn't sure what steak tasted like (he later took part of the price off the menu). Why not all since none was eaten. The oil issue was evident again with my aunts fish. There was a lack of seasoning and the crust was weird. My other aunt also saw the oil issue with her wierd looking onion rings. The mashed potatoes and the garlic spinach was bad. When the waiter asked how the food was and we explained this he said he was not the cook. The food was mostly left on the table except for my food. Terrible terrible", "author": "Latasha W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-04", "description": "We sat for two hours before we got our food. It was not worth the wait. Even the bacon was gross, how do you mess up bacon?", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "My wife and I visited Lobo restaurant Monday and we were glad we did! We loved it! The chicken enchiladas and the beef Chalupa's were very delicious! better than what we expected. \n\nThe ambience was very very nice... very cozy and comfortable.  We sat upstairs which was even more better. Lobo has a moderate amount of Mexican nostalgia which gave it  a nice feel as well.  (Not over done). They also have downstairs seating but it's a small area and has a professional bar. \nThe service was very very friendly \u0026 professional. Our waitress was Celia. She was very friendly and kind to us. If you visit this restaurant please asked for her. This will definitely be our new Mexican food spot!", "author": "Darryl S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "I've eaten here a few times and it's one of the few legit Tex-Mex places I've been to. Happy to recommend!", "author": "Steve L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-05", "description": "The place has nice decor, really cozy. Outside patio area as well, which is a plus. Got greeted by the hostess and bartender as soon as I walked in. Although, the waiters were sitting at a table on their phones half the time. Drinks were given to us right away, Texas Tea was tasty. Appetizer came almost instantly. Chicken quesadilla was great. I order the enchilada and two taco combo. It was good but my chicken tacos had hidden bones in them. The refried beans were very obviously spoiled and smelled rotten. The waitress just believed \"I didn't like them\". Hopefully no one else ordered them! I would have much rather been offered another side dish, rather than just getting a side plate to \"scoop\" off the beans. And still having rotten remnants on my plate.", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "Everything looks fresh coming straight out the kitchen nice relaxed feeling with big Texas servings. Waiter and the customer service is amazing. Highly recommended I will definitely come back and try something  different on the menu. There's a bar and a 2nd floor with plenty of room. Great place all they needed is big texas drink menu maybe they do have but I didn't see it on the menu nor did I ask.", "author": "Dandy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-07", "description": "The food is pretty good, and they have a good selection of drinks. Three stars because it's annoying that it's cash only.", "author": "Katelyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Food has taken it up a notch- if not more! Love getting margaritas, chips, and a recommendation for a meal from one of the friendly staff members. A++++", "author": "James H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-02", "description": "Stopped in just in time for brunch, went with steak and eggs and that came with a side of potatoes. Overall, pretty good size portions... What really won me over was the strawberry mimosa, perfectly infused with tequila!", "author": "Barry G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "I really enjoy Lobo's happy hour - $6 margaritas and the best chips and salsa - what's not to love? Food is solid, fun Tex Mex - not extraordinary but sometimes you just crave some yummy, sloppy, cheesy goodness...", "author": "Leslie J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-20", "description": "Friendly staff\nDrinks were delicious (try the blood orange margarita)\nFood was cool (not great but overall good)\nAtmosphere is pretty cool\n\nIf I happened to be in the neighborhood, I may stop by.", "author": "Marcelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Their chicken is not that good but the tacos are really good super super good!!!!!!                                                      yum.", "author": "Jay D."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}