{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-23", "description": "This was pretty good. Fairly basic breakfast burrito and great service. I'd come here again just for the good vibes.", "author": "Ernesto P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-29", "description": "The first time I went to Lobo I had their battered fish 'n chips which was so good, I was left licking my lips. I thought the fish seemed slightly wet inside but, kept eating as the flavor was amazing. After several hours however, I had a very runny stomach and realized the fish had been undercooked as, my boyfriend had had the fish too and experienced the same symptoms.\n\nI did however give Lobo a second, third and fourth try and have never been disappointed again. I highly recommend their burgers as they are flame-grilled and taste utterly amazing. Their flavored margaritas are also to die for and is part of the reason I keep going back (they do them virgin too, which I discovered when I was pregnant).\n\nThe only suggestions I'd make is: 1) Don't take a vegetarian there as options will be limited. 2) If you have the fish, be sure to ask them to cook it well.\n\nDespite one bad experience, I love dining at Lobo.", "author": "Liesl L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "there's a special they have..I think only on Fridays... salmon and it's great. The waitress said that the chief Angel makes it. Angel is a genius!!! The salmon was cooked perfectly.. on the rare side. Very nice.I ha dried okra too and it was great, not mushy at all.\nThe place is small but cool. There's a patio out back and a smattering of small brooklynite kids toddling around. It must be kid friendly.\nThis was my first time but there seemed to be plenty of regulars. We were there early so I don't know what it's like later.", "author": "Nanette S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Absolute best drinks in town.  The people are amazing.  One can't go wrong with great Tex Mex.", "author": "Jonathan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-14", "description": "Good Tex-Mex food, I cannot speak as highly for their drinks.  The I had their Texas Tea, which is Deep Eddy sweet tea infused vodka w/ water and lemon.  The drink was very mild.  I like my drinks with a little \"kick\" to it.  The soft tacos were good and their homemade cole slaw was very good.", "author": "Sabastian S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-24", "description": "I should have known not to order food when the chips came out cold with canned salsa. \n\nAs a Texan now living in Brooklyn, I am mortified that this food is labeled Tex-Mex. Tex-Mex doesn't mean poor quality Mexican food. \n\nThe enchiladas were filled with fake processed cheese, with watery reheated chili poured over the top. You could taste that these items had at some point been frozen and reheated because the sauce was separated and diluted. The so-called carnitas was blocky poor quality meat, and the beef inside the beef enchilada was not seasoned. \n\nSides: The rice was overcooked as if reheated in a microwave and the beans were lukewarm and unseasoned.The hard-shelled taco was flavorless ground beef with bits of cut lettuce and tomatoes that I could honestly make better at home myself for a tenth of the price. Margaritas are made of synthetic sour mix. \n\nFellow Texans and Brooklyn-foodies with a palate, don't make the same mistake I did.\n\nJohn Taffert, where are you.", "author": "M. W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "I was walking to the subway after work and saw the words \"tequila\" and \"tex-mex\" outside and felt drawn to it. They were advertising $6 margs outside so I figured I'd stop in. I almost let the cash only on the door deter me since I was out of cash, but I'm glad I didn't. They do have an ATM inside and there are a lot in the area! I moved here a few months ago and have had a hard time finding a Mexican restaurant that I like. Before I even had my drink brought to the table, 3 people asked me for my order, so they're very attentive. The hostess told me she just wanted me to be happy wherever I sat - the bar area, upstairs, or in the garden. The salsa is spicy!!! but so good \u0026 I give the marg a 3.5 out of 5 because it has a little bit more of a mix taste than I normally like but it is still good. I sat in the bar area and noticed it was a local bar for a few people, which I enjoyed witnessing. I feel like that is great for the neighborhood and company. I snacked all day \u0026 had a late lunch so I'll have to report back on the food.", "author": "Chelsea W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-18", "description": "Was a bit disappointed that the strawberry margarita wasn't made better it tasted like a fruit drink !!", "author": "Bella B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-22", "description": "I totally agree w/ Danny P. that this might be a great place to hang with friends and have a few homemade margaritas, but other than that, there's really not much here. In fact, I'd rate the \"Tex-Mex\" food they serve as bland and average at best, and the servers, while fairly attentive, had very little personality and added no flair whatsoever to the experience. We did have a drink at the bar prior to our dinner, and the bartender was friendly and entertaining. Sadly, that was the highlight of the evening.\n\nFor my entree, I ordered the Carnitas Extravaganza, which was far from an extravaganza. The dish consisted of what tasted like store bought fried corn tortillas, which were topped with bland shredded pork, lettuce, tomato, cheese, and ranchero sauce-- oh, yes, and there was an egg placed atop the dish, which was easily the best thing about the meal. Vinny ordered chicken soft tacos, and they were not up to par either. The best tasting item we had was the guacamole, which we had for our appetizer. And, although the taste was okay, Lobo's version was pasty and didn't seem very fresh.\n\nFinally, beware that Lobo does not take credit cards-- something we didn't find out until we were ready to pay. Luckily we had enough cash between the two of us to settle the bill, but it was definitely annoying they didn't take cards.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "I love coming here when it's spring/summer. Seating outside is perfect! Just the right amount of the elements. Margaritas are cheap and superb. The selections here are always great, from the nachos to bacon Mac \u0026 cheese. Great neighborhood, speedy and friendly service. The only down side is that it's cash only. C'mon. They do have an ATM on the second floor but a credit card machine shouldn't be that hard to get.", "author": "Mike T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "I had to be in Brooklyn to check out a site for my environmental assessment class. A friend of mine, also in the same class lives in Brooklyn but we were headed back to downtown NY because I had to make it to my 6 o'clock class.\n\nHA. Who was I kidding? We got off the next stop and decided to go for margaritas. She brought me here and boy was I happy she did. We got there during happy hour. $6 margaritas and pretty strong. I also ordered the steak salad. It came in a tortilla bowl and it was delicious. The place is nice, pretty small but they have an upstairs where it is a little more private and has seating for bigger crowds. \n\nThe bathroom is really really small, it is kind of creepy. Trust me, my friend warned me and I was still not prepared for how tiny it is. I felt like I was in Alice in Wonderland.\n\nBTW, they do NOT take credit cards but they do have an ATM machine. \n\nRegardless, it is a great place and very decently priced. I will be back!", "author": "Cynthia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-16", "description": "I have tried this place 5 times now -hoping it would get better -\n--food is always cold \n--the bar is sticky \u0026 needs a good cleaning \n--all of bartenders seem disinterested \n--bus boys just hang out - my empty dirty plates sat in front of me for over 10 min --it was not busy\n\nI wanted to like this place but I will not be back", "author": "Stacy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "This place is great! I would have given more stars but I'm really spoiled in being a recent transplant from Austin, TX. \n\nThis is the first time we've seen queso (and good queso at that) since moving to NY 5 months ago. Everything has great flavor, staff is really nice, and atmosphere is cozy. \n\nWe will definitely be back every time we need a taste of home.", "author": "Marisa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-28", "description": "Great little bar, wonderful food. Had lunch here. Good bartender/ server. Reasonably priced. Would definitely come back and try some more food. It's a \"dive\" bar. Just be happy you can get inside.\n\nOver 30 tequilas - if I only lived closer to this place I would come back every weekend.", "author": "Joshua G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "Dear Lobo, how I love your margaritas! Seriously, they are amazing and the main reason I'm even giving 4 stars(food-wise I'd give 3 stars)! The margarita is so fresh and the ratio of tequila is perfect! \n\nThe bartenders are also awesome! My best friend and I would find ourselves here quite often around happy hour while we were so exhausted/stressed from studying for our board exam and the margaritas and hilarious bartender were just what we needed. \n\nAs far as food goes, it's pretty standard tex-mex and always leaves me satisfied, but isn't the best tex-mex I've ever had. The portion sizes are huge so it's the perfect place to go if you're really hungry! I generally order the chimichangas or enchiladas-- both are good and standard. \n\nAs far as dessert goes, I really do love their churros!!! They are served with icecream which is perfect for dipping! It's actually one of the only places in the area that sells churros so I often come and get churros and margaritas and leave happy! \n\nThey have a great outdoor area which is one of my favorite places to sit on a warm day/night. They are cash only, but there is an ATM upstairs!", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-10", "description": "Got off to a rough start.  The bartender seemed a bit overwhelmed with a mid-day large group.  He was frustrated at first but became very friendly towards the end.  Food was decent.  Probably better as a bar hangout after work or for evening diner when it's fully staffed.", "author": "Carlos P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-17", "description": "Eh it gets 3 stars because of the dope bartender. He was pretty cool.  other than that, the food was bland and the wait was wayyyyyyy too long", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-04", "description": "Wishing I had gone to the Chipotle a few blocks away as I got food poisoning from my dinner here last night. Oh, and they're cash only, so you have to pay a $2.00 fee at their very own ATM machine to take money out. What a scam. \n\nDue to the lack of quality in their ingredients and aloof service (we had to keep asking the waiter for every water refill), will never be coming back.", "author": "Katie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "We love this restaurant - never disappoints! Great skinny girl margarita and salsa!", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-19", "description": "Definitely a solid choice for lunch, as I enjoyed my shrimp salad, but I did not like their guacamole at all, and the flavored margaritas were just too sweet for me (I know, it's a preference thing).  For my second margarita, I chose the original, and enjoyed that much more.", "author": "Michelle R."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}