{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-07", "description": "Food is just OK and service started off strong but by the end we felt like we have been completely forgotten.  It took way too long for the waiter to come with the check and when you're dining with a 2 year old, every minute matters.  On the plus side, the space is really fun and has a second floor as well as an outdoor area.  Normally, this place would barely pull 3 stars but I give it 4 because it's one of the few places in the neighborhood where you can dine out for Mexican food.  I especially enjoyed their booths, which were lined with some sort of cow/horse/zebra hair.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-14", "description": "I ate here last night and had a really great and filling meal! There was no table available when we came in, so they seated us at the side and we ordered drinks.   The host and waitstaff were all so nice, and the whole experience, but food and service was wonderful.  I had the fried chicken and it came with two sides, and it was definitely tasty and filling!", "author": "Dara M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-30", "description": "I came here on a weekday night probably an hour before closing. There were only a couple other parties still around but I still digged the atmosphere and super friendly bartender. Our food came quickly after ordering, got the baked fish tacos and a mango margarita. The fish tacos definitely had a spicy zing to them, sometimes it was a good zing but most of the times it was a bad burning in your throat zing. The rice and beans that came with the dish were pretty standard. Thumbs up to the margarita.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-24", "description": "I was already hungry when we went to Cobble Hill Theater to check out a post-work flick, so I was STARVING afterward. I had already scoped out Lobo as an option for our movie-and-a-dinner date, but I won't make that same mistake again. We were seated right away, but waited an inordinate amount of time to get any sort of attention from anyone. When we were finally able to order, we each picked enchilada dishes, and were uniquely disappointed by each of our meals. Megan said her \"sassy mama\" enchilada's tasted like spicy Hamburger Helper if you swapped out stale corn tortillas for the noodles. My \"chipotle shrimp\" enchiladas were super fishy and featured chopped up shrimp that had been poorly deveined (or not deveined at all). \n\nAll this combined with slow-as-hell service that uses \"cutesy\" as a smokescreen for \"lazy,\" and you've got yourself one hell of a Cobble Hill albatross.", "author": "Jason K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-15", "description": "The chips y salsa are FREE and happy hour margaritas are kickass! They're made with fresh squeezed juice! \n*Nothing more offensive than sour-mix margaritas and chips \u0026 salsa sold separately. \n\nAlthough the menu claim to hail from Austin? (website notes the proprietor is \"Texas born\"...) the food (migas in particular) falls short of great Tex-Mex found in ATX.  However, the cornmeal crusted fried okra, collard greens and mac are legit.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "Never had a bad meal here. Try the jalapeno cheese grits (recommended to share w/another person), they are delicious! the staff is so sweet and this place has really grown on me over the years I've been here. Fajitas are my go to and the chefs are very consistent with that dish. Happy hour is one of the better ones in the neighborhood too.", "author": "Shar Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-17", "description": "Not the best, not the worst tex mex. solid neighborhood joint.  CASH ONLY! credit card machines may bring this up a star.", "author": "Pat F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "We come to Cobble Hill just to go to this place. Amazing food, great prices, and the people that work there are super friendly. The pulled pork sandwich is insanely ridiculous but you can't go wrong with anything you order.", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-12", "description": "Ive gotta say, Ive only been here for brunch, but the food is always good and the staff is always friendly. its never crowded, and the have a nice enough backyard. I like it so far, but I have yet to make it dinner or lunch or to just have a different meal there, but I will in time.", "author": "Sashi K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-24", "description": "This is my go-to place whenever I have guests visiting the city. I love this place! The staff is friendly, the margaritas and Bloody Marys are great, and the food is the best Tex-Mex I've had in NYC. I usually get a Mexican entree, but they have a good selection of Southern-type comfort food entrees if you don't like Mexican. Whenever my partner and I decide to go out to eat, this is the first place I always want to go. I could eat here every day. BTW, it's cash only.", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-24", "description": "Two stars for the food.  Add one star for the drinks.\n\nFOOD:  Karim used to live in south Los Angeles and then Little El Salvador in VA, so Karim knows Latin food.  Chips and salsa are apparently the staple of every tex-mex joint nowadays, and the salsa here wasn't bad.  But the \"Over-stuffed Burrito\" I ordered was stuffed with mediocrity.\n\nBeer and vodka are my usual drinks of choice, but I couldn't pass up the massive margaritas this joint was serving.  I went with the sangre de lobo, which was a blood orange base mixed with cinnamon-infused tequila.  It was good to go, and after a second one, I was good to go.  \n\nATMOSPHERE:  There was seating on the first floor, but it seemed like we had a choice of sitting outside in the searing heat, or sitting upstairs where all the old people were congregating.  Is that normal for Brooklyn?\n\nSERVICE:  Our waiter was good.  I think I ran out of water a few times, but I compensated by drinking more liquor.  Water is for pansies anyway.", "author": "Karim Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-21", "description": "typical TexMex joint...nothing over the top....went here when my buddy was bartending- he makes a great ZZ Top (mezcal, tequila and some other yumminess).  Great tequila selection at this place.  I went to the one in Bococa, but they also have one in Park Slope.", "author": "Marc S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-31", "description": "We went to Lobo for my buddies' post-wedding brunch.  We were a huge (20-ish) group, but they had reserved plenty of space for us upstairs.  Our server was extraordinarily friendly and helpful -- he joked around with us and offered great recommendations.\n\nSome of the orders got mixed around or a little flubbed, which is understandable given the size of our group, but they went out of their way to make things right every time.  I had the 10oz burger topped with an egg, jalapeños, and queso, (don't worry, I took a picture for www.thisiswhyyourefat.com) and I'll be dreaming of it for weeks to come.  The cheddar jalapeño grits are worth the trip alone, and the Bloody Mary was the best I've had in ages.", "author": "Aaron W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-16", "description": "Good drinks....it wouldn't be a bad idea to actually make fresh guacamole instead of spooning it out if a can like I saw the staff do last night.  MAKE IT FRESH! Same thing for the bean dip....lazy...", "author": "Scott K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-17", "description": "Went back again on a crowded Friday night and tried the margaritas.  They were strong and good.  I also tried Dos Equis from the tap.  It was old tasting, it doesn't seem to sell a lot.  WHY CAN'T I FIND A FRESH DOS EQUIS IN NYC :(?  My wife ordered a taco salad and it was decent.  I ordered the Chimichanga and it was a surprise, I really liked it.  The waitress was OK, not the friendliest but efficient.  The clientele simply annoys me here, its like graduate Hipster school, a little more mature but still annoying.\n\n.......and still 3 stars!", "author": "Roy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-17", "description": "Update: This restaurant actually received a C rating! Owners have not updated the window and the rating still has \"pending\"! DO NOT GO!", "author": "Chris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-24", "description": "Go here for the margaritas and drinks -- very, very good.  Try the ancho infused tequila.  The blood orange is not really blood orange... more like pink grapefruit.\n\nSkip the food unless you are starving and crave mediocre tex-mex with your margaritas.\n\nThis place is never that crowded -- we've been here at all times of the day/week... they seem to get a steady but small crowd.", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "Love the Ribs and creamed corn !! Lots of food , low price and great taste. Every time I go I never get disappointed.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-30", "description": "Lame. In a hood with so many great restaurants, I'm suprised this one has survived. The free chips and salsa were the tastiest part of the meal. the \"guacamole\" was just mushed up avocado. Not that I don't love mushed avocado, but I don't call it guac - that's like calling a boy a man. \n\nThe veggie tacos were barely heated corn tortillas with grilled peppers and musrhooms in them - nothing else! no salsa, no sour cream, no beans, no nada! Folks, that's not a taco. (Maybe my issues with this place are vocab issues!?)\n\nAnd it's not just a veggie issue, my man's chicken enchiladas were super boring too. \n\nAnd for all that, it wasn't cheap - $50 for our two entrees and 2 beers. I say pass unless you're drunk, rich, and lacking in standards.", "author": "Patricia K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-12", "description": "What a horrible waste of a cool space and sweet little outdoor patio. The food here is godawful, like something I'd expect from a major chain Tex Mex restaurant at a small midwestern airport. The chicken in my chicken soft tacos had an extremely unpleasant aftertaste, like mildew, or maybe urine. The congealed cheese enchilada was made with only the best Velveeta, and the rice and beans had no flavor at all. At all. It was like eating lumpy paste.\n\nSeriously, what the hell is going on in that kitchen? If you have the cojones to call yourself a Tex Mex restaurant, how about...I don't know, maybe going to Texas for a week and actually eating some real Tex Mex there before whipping up your own \"special\" recipes? This was like what your schoolmarm Aunt Martha, who has never left her small Maine hometown, might make from memory or maybe just from looking at pretty pictures in a magazine. It was awful, unconscionable...what in the world? I can't get the awful clash of bad tastes out of my mouth. Maybe I never will. It was THAT bad.\n\nThe service was slow and kind of unpleasant, even though we were the only people outside, and there were bugs crawling all over the hot sauce bottles and obligatory Corona bottle salt and pepper shakers. The prices were way too high and though I didn't try any booze, I can't imagine even the best margarita in the world would have made up for the horrendous food. Somehow I doubt they offer the best margarita in the world.\n\nNo. Just...no. Avoid this place like the plague.\n\nP.S. If you want mediocre Tex Mex in Cobble Hill, go to Mexicali at Court and Atlantic. It's not good at all, but it's about a million times better than Lobo in every way.", "author": "Abigail S."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}