{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-15", "description": "I went to eat here about 6 months ago.  The decor is pretty cool.  It was full and we got a table for 2.  We were looking for place to have a few drinks, have an appetizer, and have dinner, and maybe even dessert.  We got a nice Hispanic waitress.   She took our drinks order and then I asked her if we can get free appetizer, as there was a special in Yelp.  She said Sure.  We got our drinks and were happily waiting for our appetizer when a white man (I'm assuming the owner) came over to our table in a rude tone of voice to announce that we were not able to get a Free Appetizer because the special on Yelp was \"not real\".  And why is that OUR fault???  The only reason we found them was because of Yelp map.  And why are they falsly advertising?  As a marketing major in college, word of mouth is the best form of advertising for a business, which is why you should always strive to keep a customer happy.  And if there is a special or a sale advertised, the restaurant should follow through.  Or maybe the man could have come to us with a nice attitude and say \"we're sorry we do not have the special anymore, but just in this case we'll throw in a freebie\", anything that would make us feel better.  After that, we cancelled the appetizer order and just went straight to dinner, ate and left and never to come back!  The food was not great either.  I just got a racist vibe from the owner and didn't feel welcomed at all.", "author": "A B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-09", "description": "don't go to Lobo when you're grumpy, because that drink you hoped would lift your spirits will take so long to make its way to your table, you'll transition to full-on pissed off-ness.", "author": "mike l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-19", "description": "Do you like leaving brunch sort of drunk from the most heavenly margaritas this side of the border? I do and that's why I go to Lobo. The food is excellent as well--Fredo's bean and cheese chalupas rock my world. The fajitas and the buffalo chicken quesadillas are also highly recommended. \n\nThe servers and bartenders are attentive and friendly.", "author": "Jennette M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-02", "description": "Wow, I'm kind of surprised at everyone's negativity about this place. I'm definitely no Tex-Mex expert, but I happen to think the food is really good here. Maybe I just haven't tasted their nasty dishes? My favorite thing to eat here is the pulled pork sandwich - it's delicious!!! I usually ask for a side salad instead of fries (which normally come with the sandwich), and that's really tasty too! Other dishes I can recommend are the guacamole, the fish tacos and Daisy's enchiladas. But most of all...their margaritas are FANTASTIC! I really can't imagine any place I'd rather be on a hot summer evening than sitting in Lobo's garden sipping one of those big margaritas and munching on some chips \u0026 guac.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-22", "description": "Lobo went under a renovation a few months back and I wonder if they also changed management? It used to be a decent enough tex-mex neighborhood joint but is now serving the cheapest grade cafeteria style food I've ever seen in this neighborhood.\nMy husbands enchilada plate was an alluring combo of beiges- cheap processed cheese food and bland refried beans. Nary a tomato or fleck of seasoning to be had. Looked straight outta the freezer. My \"loaded nachos\" were supermarket crispy taco shells broken in half and \"loaded\" with the worst quality pulverized ground beef I've had outside of my elementary school free lunch! Blech! Our service was...weird. The server seemed sort of drugged and getting our bill took 1/2 an hour- we finally just got up to leave and asked for it- they were so out of it we probably could have pulled a Chew-n-Screw and no one would have blinked.\nDone with Lobo until someone who knows how to cook a meal and run a restaurant takes over.", "author": "Lady C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-28", "description": "I like the fact some people are feeling like me with the Harvest situation. And I know that there's some Harvest dishes still buried in the Lobo menu but that switch up several years back was pretty weird to witness. One day you're a (sorta) Southern diner spot and then you got a giant bull's rack over your bar? If you ask me Harvest was going down the minute they renovated the cute corner bar into that giant oyster bar thing. At this point the line was unbearable for brunch (the only great thing about the place) and the food wasn't really all that but I do miss that cheese fried grits dish. But on to Lobo. I've had a recent string of Texan neighbors who love this place. They know it's not the best Tex-Mex food but also think it's the best in the area. I personally have only eaten at Lobo once with them and remember drinking Tecate with lime out of the can more than the food. I definitely had some nacho action and maybe a couple of soft tacos which were totally fine. I think what keeps me from going back is the atmosphere. I just can't get over the cheese factor as a former Harvest guy. Every time I see that neon sign walking up Warren Street I think that.", "author": "carl g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-11", "description": "I have gone to this Lobo several times and each time I go back I'm hoping the food will be better, but it never is.  The place seems really cool and I love Mexican food, but this food is always disappointing.  The only time I liked what I had was when me and a friend just had drinks and guacamole.  I think I've given this place enough chances and I won't be back.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-14", "description": "I love their food. Coming from Texas and loving Texmex, it truly does remind me of home. Not to mention their Margharitas are the best!", "author": "Mo M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-11", "description": "A couple of friends brought me here the other morning during a hangover. They both insisted that the best cure for a hangover is a beer and nachos, and at Lobo, it turned out to be true. Fantastic queso dip, perfect chips, a friendly guy behind the bar. Portions were freaking huge. Maybe that was a brunch thing, IDK. But next time I have too much to drink, I am going to swear by Lob. I'll be in there bright and early for my nachos. Oh, but I wish they took cards. At least there's an ATM in the restaurant tho.", "author": "David L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-11", "description": "I went to Lobo on a Saturday evening with a restaurant.com cert. I called first to see if i needed reservations, I was told no. When we arrived, we were told that there was a 45 minute wait for a table of 2. The hostess said that there was a party for 18 expected. We waited and waited, the hostess must have turned away 25 people with rhe wait time 9she made it an hour and 15 minutes. I went upstairs to see how busy it was and there were many empty tables there. While we were waiting, she took a party of 3 and 4 and sat them upstairs, even though she said that there was a big party coming. Finally, we sat after 35 minutes. We ordered small guacamole, rack of ribs and a burrito . Boy was the small really small. the other 2 dishes were ok, nothing special. for a rack of ribs, i thought it was a little small. Rice and beand=s were average, nothing special. However, at 915, the party of 18 started to enter(we were basically done with our meal)  My opinion of the pkace was that the food was average, service good but the ooverall tenor was mass confusion. None of the help seemed to know what was going on. I hear the drinks were very good, but  since they don't have frozen margaritas, i was not interested. I have had had better experiences, i will not be a returning customer", "author": "jeffrey b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-04", "description": "Excellent margaritas (the passion fruit jalapeno is just awesome), good chips and salsa, so-so food.  Cash only is annoying, but the on-site ATM makes up for it.  Nice little garden in the back.", "author": "Brad C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "The margaritas are really the draw. My favorite in the city and a great way to enjoy a warm afternoon/evening. The menu is no joke either. A great mix of texmex staples. Their mole is solid and the softshell fish tacos (ceviche) are well worth a go as well. I'm partial to the chorizo migas at brunch. Really can't find a fault with the place.", "author": "Nick H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-01", "description": "wow. ive never eaten such awful food in all my life.  went here for brunch on new years day.  they were busy and maybe to a fault because it felt like love didn't live in the heart of the chef anymore.  seriously.  we felt like our food came out of ortega packages.  my boyfriend even said that taco bell was better and you wanna know what? they are! the chili con queso was a bowl of velveeta cheese with some tomatoes on top.  did they get the recipe from the package of velveeta they opened?  needless to say, we didn't touch it.  our tacos, made old fashioned style, looked like chopped up hamburger meat that at one point came frozen and packaged in between 2 slices of parchment paper.  and the loaded nachos were nothing more than halved hard taco shells with some fixins on top.  there wasn't even enough cheese to go around.  and the french toast.  well that was special.  it tasted like egg, wasn't cooked enough and they messed up the bacon.  how do you mess up bacon? gross.\nwe left disappointed and $50 poorer.  came home and brushed our teeth to get the taste out of our mouths and this is the consensus of 4 of us.\non a lighter note, our waitress was nice.  and so was the other guy working there, though it seemed like he was having the worst day ever.  honestly, i would too if i had to look at that gross food all day and have it for family meal later.\nWOULD NOT RECOMMEND TO ANYONE WITH TASTE BUDS.", "author": "Sogol M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-31", "description": "Lobo stinks.  The food is bland and everything seems soggy.  BOO.", "author": "bree d."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-12", "description": "I crave the margaritas, and seeing as they are located only a few short blocks from my apartment, I feel I am on the verge of having a bit of a drinking problem...kidding. The original or fruit flavors are great, but it is so worth it to be a bit adventurous and try their infusions...cinnamon tequila with blood orange, brilliant!! They also give you some chips and salsa gratis, to go with your drinks. I can't speak for the other food but who needs it if you can fill up on tasty drinks!", "author": "Gianna V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-17", "description": "The food is alright, depending on what you get. It feels like the cooks aren't trying enough to make the food tasty - its more of a \"make the food because its my job\" thing. The margaritas and great and the selection of beer is decent. The staff is pretty helpful, except that one night it was packed. Otherwise its a pretty relaxed environment. I do go back regularly", "author": "Milly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-06", "description": "worth the trip just for the margaritas.  food itself is standard tex-mex, fish tacos and guac are the best items on the menu.", "author": "Heidi S."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}