{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-21", "description": "Tex/Mex?!  Are you serious!? Why is it that there is no decent Mexican restaurant in all of New York!?  Coming from California, this is an insult to traditional Mexican food.  Even Taco Bell is better than this crap!!!!\n\nA waste of your money.  Don't go here.  \n\nGawd... I move to NY from CA and there goes the Mexican food.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "I have not yet tried the food, but they have amazing blood orange cinnamon margaritas!!!", "author": "Anna Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "This is a great local spot as long as you know what to expect: simple food, friendly service, and excellent margaritas. If you're looking for creative food, go elsewhere. This is comfort food, I-just-got-off-work-and-I-can't-wait-for-the-weekend-to-start food, I'm-starving-and-I-don't-want-to-spend-a-lot food.\n\nWe always order the same thing: chips with salsa \u0026 guacamole, blood orange margaritas (or Coronas), and two quesadillas. The shrimp quesadilla is light and tasty. I'm craving it right now.\n\nThey also have an excellent brunch with my two favorite things: fluffy eggs and crispy bacon.", "author": "Astrid V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-24", "description": "C'mon, Lobo...let's have fun together.  Lighten up a little bit.\n\nI've been coming here over the years since it used to be Harvest and served Southern fare for dinner.  I have to say that the switch to a Tex-Mex decor and menu was definitely for the best.  They make a mean margarita.   This neighborhood needs a great Tex-Mex spot with some kick ass guacamole....and Lobo is just short of missing the mark.  \n\nI would come here more often but one thing has always been consistent about this place, whether it was in the Harvest days or now as Lobo:  the service practically sucks.  I say practically b/c there are some waiters there that truly always do their best.  But each time I go there for brunch, dinner, or takeout, I get treated like I just personally insulted whoever I'm dealing with.  They are so rude to me here. I keep hoping that one day I'll have an experience there that'll erase all of the hurts from the past, but alas--it has yet to arrive.  Half of the staff are teenagers who are from the neighborhood and a bit rough around the edges, so I'll give them that to be reasonable.  But to all of the adult employees: Shame on you for being so snotty!  This is Brooklyn, for crissakes!  \n\nLeanback/Leanback/Leanback/Leanback", "author": "M V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-21", "description": "The pulled pork sandwich is utterly outstanding!! The moment you taste it the flavors explode in your mouth. I also had an enchilada and a crunchy beef taco. The pulled pork was my favorite. Everything else was cooked and seasoned very well. Home made tortilla chips and salsa that has a nice spicy kick that slowly builds up and isn't over powering. I thoroughly enjoyed the food and the margaritas. I will come back.", "author": "Jesse R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "I'm a total sucker for Lobo. It's hard to find tex-mex or even good Mexican food in NYC that isn't either fancy expensive Dos Caminos style OR hole-in-the-wall Oaxaca taco style. Lobo fills that void with casual, nicely-portioned tex-mex in a comfy, fun atmosphere. They have a great selection of mixed drinks and margaritas, all of which are pretty tasty, and are decently priced. I like that they have a decent selection of vegetarian options, as well as endless chips and salsa. It's a great place to come with friends to get going on a night out.", "author": "Alison G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-12", "description": "Our server was friendly and competent but sad to say that the compliments end there. Decor is reminiscent of a strip mall Applebee's. Food is prepared with cheap ingredients and recipes are Americanized and unimaginative. This is the kind of Mexican food you'd get at an airport or a hospital cafeteria. Unless you're desperate and/or with a large party and don't want to wait for a table on a Friday night, I'd pass.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "I've been to Lobo Park Slope several times (it's in my hood!) but met a Carroll Gardens friend halfway and decided to check out the Court Street location.  Regardless of which location I'm at, I'm always pleased with Lobo!\n\nSalsa?  Fresh.  Servers?  Fresh...in a good way.  Very cool, outgoing staff.  Our waiter was witty and attentive, but not in that annoying way.\n\nI like the atmosphere and shabby chic Tex Mex eclectic thing they've got going on.  Also, the margaritas were no joke.\n\nAnother perk?  Restaurant.com gift certificates (both locations!) - but definitely not the only reason to check this place out.", "author": "katy f."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-06", "description": "Yup, food and service needs help.  I agree with the reviewer who said it.  I think the service people are likely nice, but maybe overworked- could explain why they can't get back to your table even to give you a check.  \n\nEveryone in the neighborhood says how they would have LOVEd for it to be good, but somehow the flavors are never more than bland...the food is a bit expensive for what you get.  The location is good.  Too bad the trucks in Redhook aren't always open, right?\n\nOOOH, yep, the cash only thing. \n\nWe like the guacamole with a margarita- so have a drink and the guac, skip the dinner, and get on the train to York street station, and go to Hecho restaurant in Dumbo.", "author": "grampa g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-27", "description": "I was here tonight with 4 of my friends and we had a good time. Margaritas a really good and food was pretty good. Will def come back.", "author": "Choss T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-07", "description": "After several trips to Lobo, thought a review was in order...  First, get a margarita.  They're good with the infused flavored tequilas.  The jalapeno tequila can be a bit over the top spicy, but good once you warm up to it.  If you can't take as much spice, try the ancho tequila, which gives a good kick.  The other flavors are good as well.  \n\nThe food is hit or miss.  After living in Austin for a couple of years, I know it is hard to get good tex-mex in the northeast, but Lobo does an okay job with the standards.  Our recent order of wings was a bit dry and overcooked, but they were better on a previous visit.  I'd stay with the standards, tacos, etc.  And lots of margaritas.  \n\noverall, it's a good spot for a drink (as is the location in the Slope) and an app, but not a meal.", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-23", "description": "Yes, two stars. Why? My margarita tasted as if no tequila was added, the salsa needed work, and while my entree was hot, none of the meats had any discernible flavor. Only the crispy beef taco held any promise. \n\nI've been told their brunch is great, but I won't have the chance to experience that anytime soon.", "author": "Rene D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "I LOVE LOBO!   The margaritas are absolutely perfect!  The queso and the guacamole are among the best i've had, and their super secret weapon is the pork tacos.  NOBODY ever has pork tacos and they are a bit of heaven.  They also have the rice and beans down just right, which, lets face it...is critical to good mexican.\n\nGreat service-- any time they've made a mistake, they go above and beyond to make up for it, and I love the set up of the place.  Very comfy- two small floors, and a very pretty courtyard out back for when the weather is just right.\n\nI can't understand the neg reviews.", "author": "Debbie W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-21", "description": "And by Tex-Mex . . . you mean . . . .???!!!!!\n\nFirst off - - there are fucking cow hides on the seats. Real or not I DO NOT LIKE THE SENSATION OF ANIMAL HAIR TOUCHING MY BODY WHEN I SIT DOWN TO EAT.\n\nThat's just the beginning of the laundry list of crimes this restaurant inflicts upon its customers:\n\n1) No frozen ritas?!!! Are you for fucking serious?!!!\n\n2) Rude rude waiter. My friend has a newly developed wheat and corn allergy but this guy was not impressed. When my friend asked if the salad had any corn he rolled his eyes and droned, \"Nnno.\" Then what did the salad come in? A TORTILLA SHELL. \n\n3) I don't even remember my meal. That's just how bland and uninspired it was. Obviously (yelp membership as proof) I like remembering my meals. This is a problem.\n\nOkay. Close with something positive. They have Lonestar. For $4 (fuckers - a six pack costs that much!!!!) Ahem. Positive. Ahem . . . uh . . . ???", "author": "Heckle H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-09", "description": "What am I missing?\n\nWent there two days ago. I got the 'Wolf' combination, which was a beef and cheese enchilada, and a beef taco. My girl got the chicken enchiladas. Ok, the salsa and chips were good...salsa is nice an spicy.\n\nMy taco was 'OK'. The beef is not seasoned, really. If you're expecting flavorful taco meat, then dump a lot of salsa on it. My enchiladas were average at best. The same beef that was in taco, was used. It was covered with Velveeta and chopped onions. Maybe I'm not familiar with 'True Tex-Mex', but is Velveeta the standard? I scraped it off...it was too rich, and reminded me of a late-night diner's attempt to do nachos.\n\nMy girls enchiladas looked OK...they didn't have any cheese on them, probably lucky for her.\n\nI'd like to go back, cause maybe we just ordered bad things. I didn't try the Guacamole...i actually wasn't too hopeful. I welcome suggestions for trip #2.  \n\nLobo has a billion things on the menu, and while Mexican food uses a lot of the same ingredients...maybe they should stick to making 30 things great, instead of 60 things average. I've tried Pacifico, and was similarly disappointed. Both may be good for Margaritas and snacks, that's it. Still looking for a decent Mexican place in the hood. However, it's pretty inexpensive, and my service was good. Just need to find the items that they make well.", "author": "Allen P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-16", "description": "Nice nabe joint.  Unpretentious and fun.  Mamas sassy enchiladas with beef, cheese, rice and refried beans was tasty.  Creamed corn was a little sweet and real good.  Generous amount of free salsa and chips. Upstairs with it's Texas decor and brownstone views is quintessential Cobble Hill and simple Tex-Mex.  Nice garden in rear for warmer days.", "author": "Franny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-14", "description": "Lobo provides solid, tex mex fare.  Everything I've gotten - including the drinks - is good.  Priced reasonably and I've never had to wait for a table.  Salsa has just the right amount of spice and paired w/ a never-ending basket of warm chips is yummm.  There is a cute outdoor patio in the back but can get overrun w/ squirrels which kind of freaks me out when eating, so I opt for indoors.  Decor is eh - the seat cushions are covered w/ animal hydes and that's kind of gross, but easy to get over.  I haven't found another sit-down mexican place in the neighborhood worth going to, so I'm happy with Lobo.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-20", "description": "The food here is OK. but the food took a long time to come. i ordered appetizers which took forever to come and a couple of minutes after our main courses came, giving us no time to finish the appetizers. The margaritas are pretty strong, so in my book that's at least 1 thumb up!", "author": "Mark K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-03", "description": "This place overall is okay. The food was okay. The drinks are pretty good. We went there on a Sunday it was pretty empty. I would say you can go here if there's no other place to go.", "author": "Darlene R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-03", "description": "Dan's negative review clearly has Tex-Mex and Mexican food confused.  As anyone who's spent time in Austin can tell you, there is a big difference.  \n\nFirst off, let me say for the record that this is better Tex-Mex than ANY of the spots in Los Angeles.  (Which was somewhat of a shock, since my fiancee and I had just about given up on ever eating good Tex-Mex outside of Austin ever again.)\n\nThe queso isn't perfect (texture wasn't exactly right), but again, MUCH better than any of the feeble attempts at queso I've enjoyed in Southern California, and definitely in Austin's league.  \n\nIf you're a Texas transplant or just someone who appreciates the fact that melted cheese + chips can take more forms than JUST nachos, you should definitely give Lobo a spin.", "author": "Kyle B."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}