{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-20", "description": "Standard Tex-Mex restaurant with decent food. They make a big deal of their margaritas which I didn't think were anything special. I judge Mexican places by their guac, which was pretty good here. I had the chicken fajita which I would also recommend. \n\nThe only thing I've got to complain about is the service. It took forever to order and get our food but I think they were just under staffed that night. I'd definitely come back and give it another chance.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-26", "description": "Calling their Mexican food Tex-Mex is like saying Dallas BBQ serves Texas barbecue.  I guess it's decent for New York, but the bar ain't exactly that high here.\n\nThat being said, some of their Tex-not-Mex stuff is pretty decent.  Chicken fried steak is a fine specimen, and they get the fried okra right. \n\nDecent, fresh margarita too.  Although it, like the rest of the menu, is way overpriced.  (And cash only, really?  I think you can find room for the credit card commission somewhere in the eleven bucks I'm paying you for an eight ounce beverage.)\n\nLobo only disappoints the Texan in me.  If you're not from there, you will probably think it's great.  I will keep waiting for someone here to open a Hill Country Barbecue level Tex-Mex equivalent.", "author": "Martin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-19", "description": "The guacamole tasted liked a 9-volt battery. Pretty sure that means it's off. And the fish tacos were really fishy tasting. And it took ages to find someone to refill our water.\n\nAt least they were kind enough to take a couple of things off the bill.\n\nI really wanted to like this place. Maybe it was just a bad night.", "author": "Robert K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "Great place for drinks. They have the best macaroni \u0026 cheese with bacon or grilled chicken. Everyone should come here", "author": "Adrian P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-05", "description": "The staff here is amazing! I love their waitstaff and would come here just for that. I realize more and more how important it is for great staff because for me that is what is memorable at Lobo. We sat outside in the patio back area under the little bit of \"canopy\". It was raining but it was nice to have dinner outside. I wasn't so impressed by the food but I just loved loved loved the atmosphere and the waitstaff. Very friendly and smiling and put me in a great mood. I would go back just for the atmosphere.", "author": "Sally W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "I've had my fair share of Mexican food, and Lobo had some of the best in Brooklyn. I really liked the atmosphere downstairs; really intimate and cozy. Upstairs is bigger and for larger parties. The margaritas were awesome and $6 during happy hour. The food was delicious and just enough. I definitely recommend the combo platters which comes with 2 or 3 different mini entrees and rice and beans. The service was also great. Our server was very sweet and friendly. Overall great experience. I definitely want to return, especially to try their Mac and cheese.", "author": "Kristina D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-05", "description": "Salsa is awesome. A little bit of spice but good flavor. The bean dip was also good, but I'm sure the cheese on top is wizz  The steak tacos were good not fatty pieces.", "author": "Lorgio J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "I go to Lobo quite a bit-- my coworkers maybe a little more than I-- and we still keep going. It's a little expensive and even though the food is nothing crazy spectacular, it's always been pretty solid. Frankly, we go for the margaritas and chips. Both AWESOME. \n\nOther than the margaritas and chips, this review is for the staff. They've always been consistently friendly. We had an awesome bartender named Sara there-- she is great. Not there so much, but when she is, she's always beyond attentive (even though I'm sure we can get annoying), super friendly and just really a stand out bartender in the land of too-cool bartenders that like to ignore you. Sara's awesome!", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-25", "description": "Average average Mexican fare. Cash only with, of course, an ATM upstairs. Decent atmosphere if you want to hang out with a rowdy bunch of friends and drink margaritas. Just don't expect to be blown over by what arrives on your plate.", "author": "Nathan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "The atmosphere was great! There was lots of seating inside and a great courtyard for outdoor seating! We were seated right away and given chips and salsa which is always a nice touch. The menu included a lot of Tex-Mex traditional dishes as well as some unique ones ( I had Daisy's Enchiladas and they were deliciousas). They also had a good selection of margaritas. My only critique is that there was no sign in the front stating it was cash only.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-11", "description": "Came here for brunch with my boyfriend. We sat outside. The service was friendly.\n\nI ordered 2 fried eggs on soft tortillas. They were served with salsa on top of the eggs, rice, and beans. Didn't really like the combo too much. I thought the beans were pretty good (kind of sweet too). I ordered a side of the chicken sausage (so yummy!).\n\nWould recommend for anyone who wants to spice up their brunch.", "author": "Siv L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-26", "description": "Lobo is like crack.  I go to Lobo way more times than is healthy but I can't help it.  I'm just naturally drawn to it.  I have a Lobo problem that I can't shake.  It's gotten to the point where I have had to vow to myself to go only once every couple of weeks, but even then I falter.  It's weird.  It's...addictive.\n\nI love tacos and I love booze and there exists no better place in the neighborhood to get both of them at the same time. The food isn't spectacular or anything, but their margaritas have a tendency to be flipping tasty and flipping strong, and after a few of those bad boys, the tacos taste pretty damn good, too.  \n\nBesides the margaritas, the chips and salsa are always solid.  As for entrées, I generally deviate between the chicken fajita hard tacos and the chicken fajita chalupas.  It's your standard Tex-Mex fair, but when you love Tex-Mex as much as I do, and because the cooks in the kitchen at Lobo rarely have an off night, standard actually means freaking tasty (especially with the margs).  The bartenders are amiable and the waitstaff is always friendly.\n\nOne note, though, is that I always go during happy hour ('til 7) and always on a weeknight.  Why, you ask?  Well for one, it's happy hour.  It's also much less crowded than on the weekends.  I abide by this rule simply because the one sub-par experience I've ever had happened on a busy Saturday for dinner when the drinks were watered down and the food wasn't that great.  My theory is that because they're much busier on the weekends, they have less time to spend on quality.  When it's less busy on the weekdays, there's less rushing around and everyone has more time to focus on making strong drinks and solid food.  You can't rush greatness, ya know?", "author": "Catherine C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-12", "description": "I so wanted this to be good but, it just isn't. The food was kind of sad. The gaucamole was a little brown and tasted old. The dish I got was an enchilada thing with sauce or cheese over it. It tasted like it came from a can. There is no mexican around here. Maybe I had high hopes. The margarita was pretty good but the food, no.", "author": "Feather A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "My roommate and I are training for a marathon and we went in directly after a VERY long run. We wanted something casual enough that we wouldn't be exiled for showing up in running clothes but didn't want to sacrifice taste. Lobo was the perfect spot!\n\nBy the time we arrived we were dying of thirst and ravenous! Our server was great - she kept our water glasses full and got our orders in promptly. The chili con queso is my roomie's favorite and we both ordered different enchiladas that were delicious. The portions were huge so we each had a take-home lunch for work the next day.\n\nAdded bonuses: A variety of hot sauces on the table for your choosing, the waitress is very candid and friendly, and the bartender is cuuute!\n\nLobo is exactly what it claims to be: Tex-Mex. And it does it well.", "author": "Lauren K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "Great food. Weird awkward staff. Cute decor.  They have a nice back yard area in summer.  Margaritas are great.  Menu is great.  Sad that they do not deliver though.  We'd give them a lot more business if they delivered. I bet a lot of parents that don't want to bring their children out would do delivery too.  It's a very family area so you'd think they would want the most business they could get. All in all this is a great place to eat at.", "author": "Tia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-19", "description": "Let me start out by saying that you need to order the Sangre de Lobo, a blood orange margarita with cinnamon-infused tequila. It is amazing, and I would like to have it on tap in my home.\n\nOther than the stand-out margarita, the rest of Lobo was just OK for me. The food was decent, but not great. I had the Skinny Twins enchiladas and way too many chips and salsa. The service was a little spotty. We ordered guacamole, but it wasn't brought out until we received our entrees. The waiter was very nice and comped it for us, which he didn't have to do. I appreciated that. It's cash only, which is kind of annoying in 2011. They do have an ATM upstairs for those who need it.\n\nI enjoyed sitting out on the cute back patio with my delicious and addictive margarita. I'd come back, but I wouldn't go out of my way for it.", "author": "Molly L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-27", "description": "If the entirety of my experience had been to come to this place, described to me as really good Mexican food, and have sangria, chips and salsa out back, it might have been a four-star review.\n\nThere's nothing wrong here, per se, as the back patio is fantastic when the weather's nice and no one really came out to bother us to come back inside because it was too late. The sangria, red especially, is absolutely tasty (it was strongly orange-flavored, of which I'm a big fan) and the obligatory complimentary chips were big and crispy and the salsa, though not chunky, was sufficiently spicy and tasty.\n\nFood, however, was bland and not particularly great, and had we not ordered main courses, that probably would have been fine. The fajita chalupa was ordered with beef, but came veggie only and the quesadilla was nothing special, and particularly soggy by the end. Both came with a heaping helping of sour cream, which just seems unnecessary if you're making really good Mexican food.\n\nService was adequate, though we lost our server for a bit in the middle I can kind of chalk that up to watching us talking, and probably not interrupting. There's a ton of seating, way more than I noticed upon walking in, and the ones next to the front windows seem to be the most coveted.\n\nBathrooms are upstairs, and don't forget there's a 1/2 step before the stairs that you* will inevitably trip on and make a fool of yourself in front of the whole restaurant.\n\n* - I.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-31", "description": "I love good Tex-Mex, but this place comes up short on authenticity. The menu items are great in theory (very Texan, chicken fried steak for example), but not so authentic to my taste buds. The queso( which I was excited about) was just OK, but the $6 margaritas were really good. The bartender was super friendly, decor, fun. Cash only, ATM upstairs. I've had better.", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-09", "description": "Lobo's got the goods in Brooklyn. Excellent guacamole, amazing salsa \u0026 fresh margaritas that are spot on (try the cinnamon margarita - yes cinnamon!)\n\nService is solid and the food has been consistent over the years that I've been going there. \n\nThe only negative is that they no longer deliver - which means if we were craving some good mexican we'd have to schlep over to Court street. Not a huge deal now that the weather's getting nicer, but in the winter it was a dealbreaker.\n\nAs it gets nicer outside the back yard is a perfect place to be low key and get a few drinks on. Recommended evening fun!\n\nKeep up the good work Lobo! Also nice cameo shots in Flight of the Conchords!!", "author": "anthony r."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-14", "description": "If you want overpriced, unflavorful food that will keep you up all night feeling sick, go to Lobo. \n\nWent here last night with some friends. Was happy with the service and decor which are right are target. However that did not make up for the lack of quality for the price they're asking. \n\nMy food looked like a dog relieved itself on a plate and didn't taste much better- though I couldn't really tell through the super hot sauce that no one warned me about. My real problem is how expensive it is- NINE dollars for a serving of guacamole? I wouldn't have ordered it if I had known. Similarly, $9 for a bitter and acidic margarita and $14 for a plate of spicy mush. Not my style. \n\nThe worst thing is that I have been up all night feeling nauseous and bloated. I will never go back there. Chipotle is a better use of your time and money.", "author": "Madeleine M."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}