{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "Get a fun flavored margaritas (like mango or passionfruit) and order a side of guac with the big baskets of chips they give you. I had the grilled catfish tacos, which were great. Flavorful and huge portions. Great place for groups.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-05", "description": "I ordered the fried chicken. And when it came out the chicken tasted as if it was deep fried with fish which I'm allergic to. When the waiter was told she made sure to tell me that her chef is a great chef and never gets complaints and nothing is wrong with the chicken. She also told me that because he said the order was good I would still have to pay full price but can have anything else on the menu. I declined. I would never come back here. The customer service was not good and I felt attacked..", "author": "Mariona S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-07", "description": "Let me start this out by saying any place that serves fried pickles automatically gets points in my book. I don't even like fried pickles that much, but just the fact that they are on the menu means that it is the kind of place I will like. \n\nThey somehow make their country western atmosphere seem cool not kitschy, and convince me that ordering a plate of country nachos topped in pulled pork is cool and not fattening. \n\nCome for the cute outdoor space and amazing margaritas and stay for the well made food. Some dishes are hit and miss, but I find as long as you stick with staples (enchiladas, nachos, guacamole) you'll be on your way to Tex-Mex heaven", "author": "Soey J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "Met up w/ some friends  here after work one day. One of those days were you want a meal that isn't fussy and a good  drink. I definitely got that here.\n\nThe had the sangre de lobo drink...recommended by the cute waiter. It was definitely a different drink...but very good... cinnamon tequila margarita... I know.. different, but a great choice.\n\nI had their dinner salad w/ steak. I know not the hardest thing to make but you know places will mess up a good piece of red meat. Fortunately for me, they did not. Seasoned just right..cooked just right... Made my salad sooo yummy. My friends I believed licked their plates soo that means something good.", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-18", "description": "One of my favorite spots in the neighborhood. Great food, fun and laid-back atmosphere. I love it for brunch, dinner, a quick bite before a movie across the street.\n\nLove getting that booth by the window -- I've had some great conversations tucked into that cozy spot!", "author": "Alison B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-29", "description": "Great food for a good price!  I can never finish my dish, so when i buy food here... i also consider it as if i'm buying lunch for the next day at the same time!  Margaritas are bomb, their other drink specials are great!\n\nDepending on the time you go, it can be mellow or real loud (but this is Brooklyn, baby... a loud restaurant with a bar is a good thing!). My boyfriend and i usually come here after our snowboarding daytrips to Vermont... we always look forward to ending our day at Lobo on Court Street.\n\nTheir chips and salsa are so delicious! It's hard to find a place where they give you in-house made chips, but Lobo never disappoints!  Their burgers are amazing, love the catfish and pretty much anything i've ever ordered from them", "author": "Vicky P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-31", "description": "Drinks always good, friendly staff. Food has gotten worst and worst, hence the two stars. Sorry Lobo. Great neighborhood place just do yourself a favor and eat elsewhere.", "author": "Pierre J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "was here just this past weekend. Food, drinks and service was amazing! Will definitely go back next time I'm in Cobble Hill.", "author": "Deborah G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "Only tex mex, very basic nothing special\nOrdered the queso and it was cut up velveeta cheese. Used filler lettuce on every dish. Wouldn't recommend unless you're starving, broke and down and out on life", "author": "Becca M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-17", "description": "Food is good and service was ok. I had the steak and eggs breakfast that comes with home fries. The potatoes were so hard that they got caught in my throat and I couldn't swallow. The steak had a great flavor. The bartender/sever was the only one working which seems to be why we had to seat ourselves and we received our chips and salsa minutes before we got our meals. The other meal was pancakes with bacon and eggs. Pancakes were good  fluffy and sweet. We also had a side of jalapeño cheese grits that looked like cornbread but taste great.", "author": "Imari C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-17", "description": "Vegetarian here, I'd have to say this place is definitely not veg friendly, thus the 2 stars. While the drinks were more than delicious (5 stars for that), there was no bean option for any of the dishes. The beans that they do serve are refried with lard. The cheese was sadly and obviously velveeta. Most of our meal ended up being lackluster mushrooms and iceberg lettuce. Very disappointing, as tex mex is usually a consistent option for vegetarians. The service was great, our waiters were diligent and present, but sadly despite this, I don't think I'd come back for anything other than drinks.", "author": "Amy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-01", "description": "Cash only- ATM inside.\nBlood orange lobo margarita is ah-ma-zing", "author": "Cydney H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-26", "description": "Came once to this restaurant for dinner and was singularly unimpressed.  Perhaps a bad night, perhaps brunch is better, not sure when I'll be back to test out either alternate hypotheses.\n\nDark wood paneling and rustic accents inside, with large bar filling up a good size section of the interior.  Seating is fairly comfortable.  On that relatively hot day, the ceiling fans and open front doors were inadequate for cooling, but we were hungry and the last place we looked at was similarly un-air-conditioned so we decided to live with it.  Service from our waitress was ok, although she tended to give the impression that we were inconveniencing her more often than not.\n\nImmediately went for a blood orange margarita, which was ok but not particularly memorable; they have many margarita and infused tequila choices.\n\nStarted off with an order of guacamole.  Chips are good but guacamole was below average and watery.  Had the fish soft shell taco, served on a large platter with ingredients to assemble the taco; quality and preparation of ingredients was ok.  A friend had one of the meat fajitas, also accompanied with similar ingredients to assemble; meat was overcooked and too salty.  Tried the creamed corn as a side; didn't like it b/c it was sweet enough to be a dessert but that's my own taste bias.  On a more subjective note, the corn kernels were tough.  By dessert time, wasn't really interested in having it there.\n\nOverall, the food underwhelmed.  With so many better places in the area, I probably won't go back.", "author": "Valery C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "Perfect margaritas. Friedly but smart bartender. Good little place. Food's ok. Come early to get a better seat at the bar.", "author": "Andy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "Went there for brunch/lunch last weekend with a large group. They accommodated us outside and were super patient with us when we had to wait for the stragglers to show up so that we could order. I ordered off the lunch menu and had an overstuffed burrito which comes with a small salad. Food and service was good, burrito was a bit blander than expected but to me that is better than it being too spicy. I would go back and recommend. \n\nAlso- they take reservations, in case you are worried about getting a table like we were [with our large group]\n\nInconvenient that they dont take cards but they do have an atm on site.", "author": "T .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-30", "description": "Love this Mexican restaurant! It's a classic for my husband and I, and we go there almost once a week. Their Margaritas are killer! The staff is great, nice, fun and very helpful. I can't really talk about the whole menu, as I always order the same - loaded nachos (reaaaally tasty) or their chicken fajitas (very fresh and tasty). \nAlthough the room downstairs usually gets a bit loud with the music and all, upstairs is comfy and not so loud (except on busy nights). A great place!", "author": "Sophie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-09", "description": "Good service, good ambience but very average food. We checked the menu Online and were very excited by all the options.  My husband got the tex-mex Benedict and I got the Huevos rancheros... The flavors were mediocre to say the least. We left there dissatisfied and wanting for more!", "author": "Aparna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "I love Lobo! We went there last night with a large group of people. The service was great. Our waitress kept the margaritas flowing and was one of the best servers I've had in a long time - very friendly and attentive. She even added a table when we had a few extra people join us. She even brought a round of complimentary tequila shots to finish off our meal. All of our food was great as well. I highly recommend this neighborhood spot.", "author": "Ann L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "Our any time, any day neighborhood spot.  Good food.  Usually get The Wolf or Huevos Rancheros and a margarita...definitely a margarita or two. Great service.  Comfortable. They made us feel like a regular from day one.  Our usual waitress even offers some help when our little one gets a little cranky.", "author": "Tiara P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-10", "description": "Great outdoor space, shame about the food.  Chips and salsa were ok.  The rest was mushy, overcooked but under-heated and a bit bland.  I've had better at taco bell.", "author": "Adam G."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}