{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-17", "description": "Another 3 1/2 star place, yelp should really let us do half stars. I'm ok rounding down to 3 for Lobo though. Let me get the few good points out, the margaritas are the best I've ever had, they use fresh juice and they really are very tasty. The outdoor seating area is pretty nice too on a nice evening outing. \n\nUnfortunately if you just wanted to come here for a margarita their bar is a tiny 5 seater and is usually full and grabbing a normal table might make you want to order food. The prices for the margaritas are quite pricey (think Manhattan prices), the prices for the rest of the menu are alright but teader on the edge of being a bit high.\n\nThe last time I went I waited a very long time for my meal and when it showed up it wasn't what I ordered and I had to wait quite a long time yet again for the right thing. The enchiladas are pretty good, the beans are refried which was a little disappointing.  The chili is decent as they use real meat and not ground meat like most places, they should cut the meat a bit more because you'll get a few spoonfuls with no meat then one with a huge chunk. The most dissapointing food item I've found on the menu is the pulled pork. The sandwich was obsolutely tiny, I've seen more meat on a subway sandwich than the amount of pork they put on their sandwiches. The bbq sauce they use is the sweetest sauce I've ever had (not a compliment) it really hides the flavor of the pork (not sure if thats intentional or not). I'm glad I had french fries to go with the sandwich otherwise I would have just had to lick the margarita glass between bits to balance out the sweetness of the sauce. I can only assume thats the sauce they use on all their other bbq items which is sad.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "I've been coming to Lobo for awhile now, mostly to cure a hangover with the Huevos Rancheros, Bloody Mary, and cup of coffee.  Although the coffee is nothing to write home about, the Bloody Mary is one of the best around.  There's something in it that packs a punch.  Also, they like to add creative garnishings like a slice of carrot to the typical olive and celery.  To top it off, our waiter gave me and ML a free Bloody Mary with ice along the rim!  Talk about thoughtful, considerate service!\n\nThe only drag here is the prices - the food IS really good - but Tex Mex is typically delicious mostly because you know in the back of your mind that you're not going to pay as much as you would at the Bistro-type bunch places.  That said, my Huevos Rancheros today was delicious even though I knew I was paying $8.50 (plus something extra for cheese) - a big plate of scrambled eggs, salsa, re-fried beans, Spanish rice, on top of tortillas...nothing soggy, all hot, yummy, and SPICY (I'm a sucker for spicy Spanish food).  Bottom line:  fantastic Bloody Mary, satisfying meal, and laid back, thoughtful service.", "author": "Christina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-11", "description": "Food was sub par. Was really disappointed by the quality of the ground beef, and my enchilada was so overcooked it fell apart when I ate it, and not in a good way. Wish I had gone to Taco Bell. The margarita was great. Service was also disappointing, saw 2 different servers throughout our night, one was phased and stopped checking in with us right around when we were ready for our check, which then took 15 minutes to get. Felt bad for the server that was still on, looked like she had tables on the patio, upstairs and then just us in the main dining room. I understand her situation, but if she couldn't handle the whole place, don't know why the other server phased. Will not be back.", "author": "Courtney D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-27", "description": "The guacamole was FRESH and the margaritas were good, however, they couldn't handle our party of 17, and to give them the benefit of the doubt maybe this is why the food was bland and it was unclear who our waiter was.", "author": "Louise T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-23", "description": "This restaurant is a sad joke. The waitstaff is absolutely horrible which is a shame because the margaritas are not half bad. The food, on the other hand, is incredibly bland, a poor excuse for tex-mex cuisine.", "author": "Maureen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-27", "description": "I love Lobos! The chips and salsa are always fresh and amazing. I think they serve the best Margaritas in the neighborhood! Try the steak fajitas they will will not disappoint! Also the staff is great! Very attentive, friendly and they always remember specifics, like dressing on the side or no onions :)\n\nHuge fan!!! Glad they are close by!!!\n\nJust remember they are cash only!", "author": "Katie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-16", "description": "I really like Lobo. Good margaritas and chips and salsa. Friendly service. It's not perfect -- food quality seems to fluctuate between above average and really good -- but I've always been satisfied and it's consistently one of the most comfortable restaurants in Brooklyn to chill/drink/snack whatever.\n\nI'm from Texas so that probably has something to do with my own comfort level at this place. And understand: This is Tex-Mex. It's comfort food -- refried beans and chile con carne, melted cheese for miles and fattening as a b*stard. Please save your breath if you're among the \"I know Mexican food because I'm from California and this isn't it blah blah\" crowd. You're missing the point of this place and probably of other things as well.", "author": "Jeremy E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-25", "description": "Great service great food great atmosphere I like the fact that it's 2 floors great place to go and have a good time with friends", "author": "Nagib A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-22", "description": "ok, i've been here a few times now, nachos are good and the venue is cozy. However the service is sometimes so bad that it to the point of ridiculous!  Our food arrived before the free chips and before the drinks AND before we even had cutlery. To get cutlery you are better off going up to the front and getting it yourself.\n\nMy friend ordered the fish tacos which she said tasted great but 3 minutes after we left her stomach started hurting like crazy and it all came up right there on the street!\n\nI would not recommend this place unless you just want to have a beer and some free chips.", "author": "C B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-23", "description": "I really want to give Lobo a 5-star rating, but I can't. \n\nDespite the delicious chips and salsa, awesome nachos and quesadillas, and my personal favorite, Que Linda's burritos (chicken burritos with a sauce that is to die for alongside rice and beans), the dessert is awful as is the service. \n\nI love a complete, well-rounded dining experience with a solid beginning, middle, and end. Unfortunately, Lobo's ending falls short. \n\nAs for the service, I don't know why it's so bad, but you better be ready to do a lot of sitting and waiting because these servers take their sweet time. Don't get me wrong, I don't want an overzealous, annoying server, but, come on, a little attention goes a long way.", "author": "Lisa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "Best margarita in the neighborhood. Fresh squeezed. The food is very good too. A nice place to go with a group of friends.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "Excellent fresh margaritas.   Great guacamole.   Very good fajitas.    All around great spot.   I highly recommend it!!!!", "author": "jeff s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-14", "description": "Love the brunch here.  Great service, laid back, and excellent food.  Outdoor seating as well which is a great plus.\n\nHighly recommended.", "author": "Stephen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-19", "description": "Their homemade chips and salsa are pretty much the best in Brooklyn, if not in New York City.  (The fact that some Mexican restaurants have store bought chips really irks me.) The chimichangas are delicious and the margaritas are pretty great. There's a nice little patio in the back if the weather's nice, too.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-30", "description": "i went in here, quite with the expectation that i might probably change my mind about tex-mex cuisine.\n\ni give two stars for the ambience and the scene in the restaurant.\n\nthe food, is nothing to write home about, it is not bad, its standard. with my high expectations in tow, it was a disappointment.\n\nid bring a date here for first impressions, because it is a NICE PLACE. however, if you are bringing a guy/girl who knows how to eat well and eat cheap, its not the place to get them impressed.\n\ni have, actually eaten better tex-mex in nj. *gasp*\n\nphotos are here\nhttp://www.flickr.com/photos/janjannn/sets/72157623197280017/", "author": "Stella S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "For the Margaritas alone they get 4 stars!!  Very decent grub at a fair price.  The guac is fantastic and the fresh chips addictive!  Ive had most of the apps there and so far they are tasty!  I mean there is better food to be had in the area, but happy hour you can get great deals.", "author": "Susan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-15", "description": "Seriously, Frances from Austin, I can't imagine where you were eating in Texas.  Born in Tyler, raised in Houston (with relatives in Austin), I've eaten all over the state of Texas -- and still do from time to time. Having moved to New York many years ago I've tried virtually every Mexican/Tex-Mex restaurant that's opened and Lobo, by far, surpasses any other I've tried.   The queso, Daisy's enchiladas, fabulous.  The Wolf, every man I know loves it.  The chicken fried steak, fried okra, perfect.  It doesn't get better than this and you can eat in the back yard.  Think I'll go tonight!", "author": "Linda L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-26", "description": "Back garden, check. Cinnamon tequila margaritas, CHECK! Eggy cheesy breakfast quesadilla, check.  Screaming out of control entitled kid with his laissez faire parents, check. I can't take away a star for the latter, but considered it for the waiter who forgot to put my marg on my tab, and after I had paid accosted me in the kitchen on my way out to ask me to pay for it. Really? Oh and one of the other times I was here, I had to find someone to pay because my waiter had just gotten fired--he was very nice, so I don't really know why. I like the food and the garden though so I'm keeping the 4 stars. Good go-to Mex in the nabe. Of course, being Court Street it's cash only. Fine, 3 and a half stars.", "author": "Krista B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-05", "description": "I am always searching for good Tex-Mex here in Brooklyn.  Originally from the great city of Austin, I crave this type of  food.  Lobo really hit home for me.  The food was fresh and definitely tasted like Tex Mex.  Of course the prices are a little much, but hey, I expect that in NY.  If you love Tex Mex, I am confident you will enjoy eating at Lobo.  The Daisy is my absolute favorite dish.  It's the classic cheese enchiladas with chili sauce, refried beans, and mexican rice.  Their margaritas might be high in price, but you don't need more than one or two (if you know what I'm sayin).", "author": "Reva J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-28", "description": "I don't often hand out one-star reviews to places I've patronized only once, but in this case I have to. \n\nWent in for a couple of drinks and some nachos. The bartender was friendly enough, and the margarita was totally fine. But the nachos - Jesus H. Christ. They used broken-up Old El Paso taco shells for chips. How frickin' lazy can you be? Go to one of the many bodegas nearby and buy some tortilla chips, at the very least! They were covered in canned refried beans and cheese that tasted like Velveeta. I was charged $8.50 for this atrocity. \n\nI didn't go in expecting the best meal of my life, but the food was positively repellent. I don't see myself returning.", "author": "Amanda C."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}