{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-01", "description": "The food is decent but definitely not the best Tex-Mex I've had in NYC. The waitstaff varies..sometimes the service is great, sometimes it is horrendous. Our waitress literally sucked her teeth at us the other night because we asked for more water (only our 2nd glass). I'll go back again though because the margaritas and guacamole are beyond delicious.", "author": "Eric M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-20", "description": "Serviceable Tex-Mex, for a fast food joint, but not great, Sauces are all straight from the jar (the mole in particular is pretty bad) rice was wet and undercooked and tasted like adobo bagged rice cooked in a rush. I had enchiladas- which were assembled and heated, but not actually cooked long enough for the flavors to meld. Salsa was fresh and had a kick, atmosphere was great and the servers were nice, too bad about he food.", "author": "fantasy l."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-01", "description": "The guacamole was average but the tacos were slightly better than average. The pork tacos were tasty and moist but maybe a tad too salty. Service was a little slow because it looked like they had more tables than people to wait on them after opening up the out door seating.", "author": "Lawrence L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "Is it the most amazing Tex-Mex food on the planet? No way. Does it hit the spot when I need it to the point where we come here at least every other week? Yes. The margaritas alone are worth the trip. Fresh juice, people- all the goodness, none of the mix, less of a headache the next day! I love me a classic lime margarita, but their special margaritas are awesome too. Food-wise: totally decent guac. Not the best I've ever had, but to me, pretty-good guac is better than no guac. My boyfriend loves the chipotle shrimp tacos. I often get the shrimp entree with tequila sauce. Sides include things like fried pickles (mmm), rice \u0026 beans, sauteed spinach, creamed corn, and garlic mashed potatoes (double mmm). Also: their mac \u0026 cheese is OFF THE HOOK. I also love the queso dip. Really tasty brunch too! Go for the margaritas, the cute ambiance, \u0026 good service; don't have huge expectations for the food \u0026 you won't be disappointed. I'm glad to have Lobo in my 'hood. CASH ONLY, Y'ALL.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-14", "description": "This place is great for a meal with friends, especially in the summer when you can eat outside. Sure, the food won't knock your clogs off like some other places on Smith and Court, but it is easy to get a table of any size, there are plentiful chips and salsa, and the margaritas are really tasty. I would recommend the burrito, if you're a vegetarian.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-25", "description": "A friend was visiting from Florida and we decided this would be a great place to go for a quick bite to eat. It had really great seating in the back, a really cute garden but the food is not the best Mexican I've had, (and i'm from CT). Also they only accept cash, but the ATM they had upstairs would not work for my card. The service was really good, very friendly ... but overall I'm not going back here.", "author": "Vanessa Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-20", "description": "The place tries a little too hard and the food was pretty pedestrian, and I like taquerias and roadhouse-calibre TexMex calibre. Our server could not explain a pungent peanut butter odor and taste in my fiancee's entree and volunteered to be of no further assistance on the matter. Weird. Drinks were lovely but you pay a premium for 'em. I don't know if there's better Mexican in the area besides the Red Hook stands, but I don't think we'll be back.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-23", "description": "When we're in the mood for mexican in the neighborhood, the only place we can really think of is lobo. We've been too many times- maybe 4 or 5, and every time we are disappointed by the bland food and poor service. It's not worth it, at all.", "author": "anna p."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-11", "description": "As a native Texan, I must say that Lobo was a huge disappointment.  My excitement about finding a TexMex restaurant in NYC quickly diminished after chewing on my very tough fajita meat.  While the décor was fun with cowhide seats and my passion fruit margarita was stiff, I left unimpressed with no plans to return.", "author": "Aileen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-19", "description": "eat at this spot about 1/month. texas tea and brunch is perfect in their outside garden. i know lots of people seem to hate on this spot, but we have always been treated great. friendly atmosphere, delicious tequila, and solid guac.", "author": "Sasha G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-30", "description": "When this joint was called Harvest, it was the place to gather for a great brunch. Now, transformed into Lobos with cheesy Tex-Mex decor (not even good cheesy, just lame cheesy... like American cheese, not smoked Gouda or something tasty like that), it's the place to avoid - at least for food. I think the bar is probably decent. Having just come back from a trip to Mexico, I realize I'm having withdrawals for an authentic enchilada, but Lobos' version of this, or a burrito, or even a taco is embarrassingly bad! As a veg, I have heard that a few of the carne options are OK, but nothing to brag about. And while they promised to preserve the original brunch menu, they even botched that up. A sad mourning for the loss of a good Cobble Hill eatery (sigh).", "author": "Dan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-23", "description": "Really, really wanted to love this place (they have Migas!), but was seriously disappointed.  The Margaritas were pretty good, and the queso was spot on Tex Mex (velveeta and rotel!), but the main dishes were awful. The tostadas were soggy and both the rice and the refried beans were bland, bland, bland. The salsa and chips were fine, but tasted like they'd come out of a bag. All in all, not worth the price or the time. Nice people though.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-25", "description": "I've been in the neighborhood for about a month now and had not yet found a decent Mexican place.  I decided to go there after ordering take out over the phone.  Once I got there, the ambiance was good so I decided to stay and eat there. They had no problem with bringing out a real plate for me to sit down with.  I had ordered a beer and before I had even taken a sip, I spilled it and broke the glass.  But the bartender just laughed it off and got me another. Here is the kicker: I tried to pay for the second one but she wouldn't let me. To take a potentially embarrassing moment for me and turn it into such a positive was great and something you don't expect.  The burrito was big and delicious and the guacamole was fresh. It came with a small salad and chips and salsa also. Five stars", "author": "Scott R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-16", "description": "I always see  Lobo when I'm on court street. One day my friend and i decided to try it out because we wanted maxican food. We were squished in the front by the window; was'nt a very comfortable experience. The food was not what I expected what so ever. My friend told me after leaving she has better so I knew this was not going to be a place i would visit ever again. On the plus side our waiter was super sweet.", "author": "James C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-16", "description": "I frequent the Park slope locale more, but I did go to brunch here once and I love love love the outside area. The breakfast portions are HUGE and delicious too.", "author": "K. B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-01", "description": "go here for chips, salsa and margaritas. bring friends and sit in the outdoor seating in back. a good time.\n\norder food if you want some major indigestion. i have not tried their more southern entrees (fried chicken, etc) but their tex-mex is better on paper, in my opinion.", "author": "Brian T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-14", "description": "While I'm not as enthusiastic as John, I agree it's a great place to eat or drink.  They serve a mean margarita, make some fantastic fish tacos and service during non-weekend-peak-hours is very good.  I've become a bit of a regular there lately, so getting the bill has become less shocking.  Be careful with the drinks, they add up quickly.  But otherwise, everything is reasonably priced.  Despite the nice Brooklyn view outside the large front windows, Lobo is yet another restaurant I consider a 'not-wanting-to-feel-like-I'm-in-New-York-right-now' destination.  Overall, it's reliable and comfortable.", "author": "Niles S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-27", "description": "The four stars is for brunch.  Served every day, Lobo brunch is a staple of my brunching.  The breakfast tacos (with chorizo, side of sour cream) and the Texas breakfast (buckwheat/pecan pancakes!) are both delicious.  The drinks, especially the sangre de lobo and the Texas tea, are very yummy.  Dinner has not impressed me, but I'll absolutely keep going back for the reasonably priced, delicious brunch!", "author": "Jessica W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-19", "description": "Now my friend from Baton Rouge was telling me this place was pretty damn delicious. With her southern expertise and having had Texas Tex-Mex, I usually hold her to her word. Now, having been to Tey-has myself recently, I've experienced great Tex-Mex (see my review of Chueys....oh my god) and I feel I can speak with some sense of \"authority\". So, Lobo was okay. It wasn't great, but it definitely wasn't bad at all. The food was pretty tasty and the ambiance was fun too. I'll go back and maybe try some alcoholic deliciousness next time.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-21", "description": "The room is nice \u0026 it's great there's outdoor seating. They have many exotic margarita flavors and infusions, not the normal corny stuff like \"mango\". The staff is superfriendly and the location's great of course. I liked the salsa, but the salad \u0026 the catfish dinner I had weren't very flavorful or distinct in any way. The prices are fair, so I'd come back here since it's near \u0026 good-enough, but I wouldn't come for a special event or a date.", "author": "John S."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}