{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "What is there to say that hasn't been said? Solid margs, free (awesome) salsa and chips, personable bartenders. Drink/eat at the bar solo or with a friend or two; families gravitate to the upstairs seating.", "author": "Edith B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "Great spot, very authentic Tex-mex. I've been here a few times and have stellar margaritas as well as a satisfying full of down-home comfort food.", "author": "Annie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-12", "description": "My opinion on Lobo varies from day to day...  it's not the kind of Tex-Mex that will knock your socks off b/c it is so good, but my wife and I continue to come back for more.  You will always get friendly service and a pretty good meal.  The decor and mood is just right for hanging out with friends or family because I feel just as comfortable swimming in margaritas as I do drinking water and eating a small appetizer.  The noise level is just right where you can hear your friends speak, but you don't feel like you are part of every other conversation in the building.  \n\nBack to the food, we've had probably almost everything on the menu.  They don't take many risks with the ingredients so I never really find myself craving Lobo, but that works in their favor as well because when trying to decide where to eat it is always in the running.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-19", "description": "Very rude wait staff and food that is just mediocre.  Cash only seems that it may be a scam about taxes, but that is just an opinion.  Very disappointed in the place.  `", "author": "Mary W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-17", "description": "What is it with Okies and Brooklyn? (I mean, besides Woody Guthrie.)\n:)\n\nThey make a damn fine margarita on the rocks (with salt please), which really hit the spot after a long workday. I could, and have, stuffed myself on the complimentary chips and salsa. The guacamole is up to lisa standards (and I have high ones. Okay, fine, I'm a snob), and as I have mentioned in my other Lobo review, the fried okra is also a must. I usually get the veggie tacos and can never finish all three which are stuffed with portabello mushrooms, onions and peppers. Everything the dude has tried when we've gone here has resulted in his continued membership in the Clean Plate Club. So, I guess it's good. \n\nThey are cash only and there's an ATM upstairs. They are also pretty kid friendly too. Every time I've been here the staff has been present/attentive and cool.", "author": "Lisa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-06", "description": "I've been a semi-regular here for 5 years, so I was surprised to find the average-3-star rating for this place. \n\nThen I read the reviews. OK, I get it. The service is reliably bad. That's why I knocked off a star too. But the complaints about the food? I don't get it. \n\nI've had everything from the catfish sandwich to the enchiladas to the salsa and queso - and it is, delicious. It's the best tex-mex food you can get in NYC, to my knowledge...and I track down tex-mex places like they're giving out free gold bars. \n\nAnyway, I don't live in the neighborhood anymore, so I don't feel too bad giving up the insiders secret: sit at the bar, fool! The bartenders are awesome, they're the ones controlling the music (usually), and you get WAY better service through them than through the waitstaff. So have a drink or three at the bar, get your grub on, and enjoy.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-01", "description": "Lobo has redeemed themselves!  I have started to go back on a regular basis.  After speaking with the owner, I was able to understand the learning curve of its employees coming from one location to the other.\nThe fried chicken had been a problem, but now it is cooked appropriately and the menu now states that the wait time for this item will be longer.  The perfect solution to this problem.\nI also found out that you can actually buy the salsa and take it home, a practice I am going to start.\nOverall, you can't beat the food, and that is why I went back and they have not disappointed me.", "author": "chris d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Clean restaurant, fresh food, friendly staff.  My brother from Southern California approves it's \"impressive for EastCoast mexican\"", "author": "Ev S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "I havent tasted anything bad here. I think the food is pretty good, the 'tex' food is great (pulled pork, burgers, etc). And you can't go wrong wit a burrito. It is CASH ONLY however, which is kind of a bummer but they have an atm.", "author": "Nick B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-22", "description": "The chips \u0026 salsa and regular margaritas are excellent-I would come back for that. The music was fun-basically my mix cd from the early 2000's which is excellent in my book.\n\nWe got shrimp tacos and they were pretty good, nothing special, but solid.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-01", "description": "Having returned to NYC from Texas, my wife and I have been looking for at least a non-embarassing Tex-mex option for a quick weeknight meal.  Lobo is probably the best we're going to do.  The salsa is spicy, although it is way too much like a pasta sauce with chiles, and our enchiladas verdes were not altogether appalling (though the verdes part of it is a pale shadow of what one would get in Texas; for some reason the tomatillo sauce was more sweet than sharp, which is a real puzzle).  Still, they have Lone Star, and it's not too expensive.  Worth a visit to fulfill your Tex-Mex craving.  \n\nAlso, I like the room. Although that may not matter on the whole, it made me a little happier with the food than I would have been otherwise.  It's homey.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-22", "description": "I came back to Lobo finally excited to try the food. I visited on a Friday during Lent, so I ended up doing the veggie soft tacos. Well, those were quite the disappointment. They just tasted like sautéed vegetables in oil, with no seasoning whatsoever. The sides were just okay. Sadly, I think the best part of the meal was the chips and salsa.\n\nMaybe I should just order a meat dish next time? Either way, with the plethora of apparently good Mexican places in nearby neighborhoods like Sunset Park, the chances of me returning for another meal here are slowly dwindling after this time around. Next!", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-27", "description": "Deece.  \n\nI came here to drown the law-student blues with my Koala friend, when the both of us were craving margaritas and chicken-fried steak.  I got mine with deep fried pickles and cole slaw because I wanted to be sure I ate nothing with actual nutritional value, and went with the traditional margarita.  \n\nThe margarita was strong and delicious, and the chips and salsa to start were completely addictive.  But ohh my steak.  Why you do this to me??  I told our perky waitress that I wanted it medium, not that I wanted it with half-cooked batter falling off it.  Aside from my steak's nip-slip batter moment, it was pretty delish, but my main gripe is the size.  If I had known I would be getting 7oz of skirt steak for $16, I would have walked my ass over to Popeye's to get a satisfying chicken dinner for 8 bucks.  Alright, this is the broke-ass student in me talking, but seriously I was saddened.  On a brighter note, the fried pickles were great and the cole slaw, while a tad mayonnaise-y, was cold, crisp and delicious.  \n\nIf I ever have money again, I may come back and try a different Tex-Mex favorite, but I don't know if I can handle getting hurt like that again...*sniff.*", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-17", "description": "I've eaten at this Lobo before, as well as the establishment in Park Slope, and I am always underwhelmed. I think they use too many onions and the prices are too high for what you get, but on a cold winters night I didn't feel like wandering around Cobble Hill when all we wanted was a nice strong drink and some hearty Mexican fare. Sadly, we did not receive either. \n\nThe food came out fast, like super fast, like so fast it makes you worry that it's been sitting under a hot light for a while. The burrito was completely lackluster, it had zero flavor. The refried beans, rice, and four cubes of tomato were mushy and tasteless. The chicken was fine, but I swear the sparse sprinkles of cheese were yellow American cheese. My companion, whose pork tacos were equally boring yet edible, insisted that it wasn't American but just really cheap cheddar. The drinks, at $8 each, came in small, thick tumblers and were insanely sour. At the bottom of each floated a huge chunk of lemon; lemon? In a Marg? \n\nFood and drinks aside, the ambiance was terrible. There were barely any other patrons upstairs with us late on Saturday and the place was blasting punk music as loud as can be. Now, I'm not an old curmudgeon, I appreciate all genres of music, but not when I'm eating. I'm pretty sure screaming is bad for digestion. When they finally turned it off, the other diners and I made eye contact and sighed in relief. All in all, I gave this place another chance, and I am sure this is my last.", "author": "Kristina V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-03", "description": "Went for lunch on a rainy day. Food was marginal, if that, service was terrible, and the noise level inside the restaurant was heinous and disruptive. I will not be going back anytime soon.", "author": "Josh W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-04", "description": "This place sucks. The bartender Ryan is a racist. You can tell by the crowd that they keep that people of color are not welcome and they make a point of it. Ryan made a racist comment and threw out one of my friends drink as he was drinking it. RUDE!\n\nTheir margaritas are nothing that great. It is TRIPLE SEC, Jose Quervo Tequila and Margirita mix....oh and sugar.... Big whoop.....", "author": "Hudson K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "I'm so picky when it comes to Mexican food, that it's not very fair of me to write reviews. But I'm doing it anyway...\n\nLobo had an impressive selection of Tex-Mex and less-Tex, more Mex options. I ordered the fish tacos, which were available with soft corn tortillas even though the menu only listed soft flour or crispy corn (I was glad I asked). The inside was a little dry, but the serving was tasty and filling, with a side of refried (yes!) beans and some rice.\n\nDecent guacamole in a decent portion as well... I always hate when they make you think there is so much more than there really is.\n\nHUGE bonus points for having Dos XX Amber on tap... huge enough to bump Lobo up to 4 stars!\n\nThere are TVs playing sports games and the service is good too, so I can see this being a nice place for a mixed group of friends to come.", "author": "Kirsten S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-27", "description": "My fiancé \u0026 I were walking around Cobble Hill today around lunchtime. I'd had positive experiences at Lobo in Park Slope, so I thought that we'd stop into the Court Street location for lunch. We walked in - crowded bar, few people at tables, busy bartender, no wait staff. The bartender was busy - totally get it. After not being acknowledged when we walked in, I asked if we could sit anywhere \u0026 was gruffly answered with \"sit there\" as she guided her chin at a table. Strike one. No \"hey there, feel free to sit anywhere, be with you in a minute\" kind of greeting. Busy doesn't give anyone a license to be rude. Anyway, we sat, were given menus, again, not even a hello. My fiancé went upstairs to use the restroom, so I figured I'd order guacamole \u0026 chips while waiting for him to return. The bartender bussed a table \u0026 went back to the bar without greeting me, not even saying \"I'll be right back\" - nothing. Then, the final straw - she disappeared from the floor for a good 10 minutes! So, we're not even going to be greeted or acknowledged and we're going to pay upwards of $60-$75 for the privilege? No thanks! We walked out \u0026 ended up going to Jolie on Smith Street. Not only did we had an awesome meal, but we were treated kindly \u0026 given excellent service. Sorry, Lobo. We won't be coming back!", "author": "Danielle Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-13", "description": "3/16/2009 \n\nI always see  Lobo when I'm on court street. One day my friend and i decided to try it out because we wanted maxican food. We were squished in the front by the window; was'nt a very comfortable experience. The food was not what I expected what so ever. My friend told me after leaving she has better so I knew this was not going to be a place i would visit ever again. On the plus side our waiter was super sweet.", "author": "James V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-04", "description": "If I could give this place more stars, I would.  I am not one to return to a restaurant- this is NYC! There are a billion to choose from-  but my boyfriend and I have been to Lobo five times, twice just in one week.  We have never been disappointed.\n\nThe margaritas are absolutely phenomenal and the collard greens are unlike anything I've ever had (I grew up in south Georgia, mind you).  I recently ordered the steak fajita salad and my dude got the chicken fried steak with greens and garlic potatoes.  Needless to say, we were more than pleased with our choices. \n\nWe've celebrated birthdays here and brought out of town family members.  Definitely our favorite low-key place to go.", "author": "Jen A."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}