{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-07", "description": "So I have to preface giving Lobo 4 stars by saying that I've never actually eaten here... but oh, have I had drinks here.  And this is one of the few places I'll actually trek to b-town for.  Their margaritas are to DIE for.  Try the ancho-infused tequila with any of the fruit juices like passionfruit (my favorite), mango, and strawberry.  They have other infused tequilas as well like jalapeno.  It's totally worth the trip.  Not to mention that it's hardly ever very crowded and I always find a spot at the bar.", "author": "Christina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "the food and service is good and all...but afterwards  u feel so fat and disgusting.", "author": "Ali F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-20", "description": "I love going here and I always order the steak fajitas with passionate fruit margaritas and my husband gets the grilled skirt steak with red wine sauce (yummy). The chips and Salsa are delicious! The service may sometimes be abit slow but overall a great place to eat .", "author": "Mayra N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-19", "description": "Been here at least 2 dozen times. The one thing I can say with certainty is that its never consistent. I've had a wonderful meal, drinks, and service one time, and the next the service is terrible, and the food only so-so. I don't know if there is a lot of turn over with the staff, or its just dependent on the day. Its decent tex-mex, but I've definitely had better. The ambiance is nice, and the back garden is super cute.", "author": "Karen V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-02", "description": "Terrible terrible service! Not sure if they were having an off night, but in the 90 minutes we were there, they screwed up the orders with three different tables, and when the waiter accidentally knocked over a customers glass of soda, left her standing there for quite some time. Eventually, she started mopping the table, floor and her own pants by herself! The worst was the barmans  attitude.Asked us what we wanted to drink before he'd even given us a drinks menu, then hardly ever came back to ask us if we needed refills. When we received our food,never bothered checking how everything was, or if we needed anything. Sadly, the food was just ok, and the drinks a little weak!", "author": "Jenny D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-04", "description": "Lobo is my favorite Tex-Mex place in New York. The chips and salsa, which are normally bland elsewhere, are really tasty! They have plenty of options for vegetarians, including some delicious bean and cheese tostadas. The ingredients are always fresh. Their mango margarita is definitely one of my favorite in the city.", "author": "Jess H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-01", "description": "lobo is a consistently good place to grab brunch, especially when you're deeply hungover. the prices are reasonable, portions fairly large. \n\nthey mix a mean margarita and have excellent sangria as well. also, pretty great salsa. \n\nit is a pretty reliable stand-by when you're just wandering around the court street area.  one thing: don't order the chicken-fried steak. \n\nit was like chicken-fried corrugated cardboard.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-09", "description": "the last time i was here will probably be the last.  i ordered a pitcher of sangria as soon as i got in.  it took about 10-15 minutes to get it and then the waiter kept trying to get rid of us because we weren't eating downstairs.  \n\nwe were actually waiting to be seated upstairs / in the back.\n\nfinally we were seated in the back and it took another 20 minutes for our order to be taken.  we also ordered some more sangria and drinks and that took way longer than usual.  \n\nwe had to ask for silverware, napkins, etc.\n\ncouldn't get the waitress to come over if our lives depended on it.  maybe they were short staffed? i don't know, but it took wayyyyyy too long to get anything at this place.  rar.", "author": "cary s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-14", "description": "mami-likey for sure.\ni was super boring because i was pretending to diet that night and ordered the taco salad thing... but it was actually really good.\nvery yummy chips \u0026 salsa too, and my boyfriend loved his veggie chimichangas ( i think that's what they were... fried.. cheesy?)\nit's right around the corner so i'm sure i'll be going back when the craving hits.", "author": "Jessica W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-17", "description": "Lobo service is ATROCIOUS. I sat in front of two bartenders and a server for a full 10 minutes - RIGHT IN FRONT OF THEM AT THE BAR- while they chatted to each other and checked their phones and stared into space and noone offered to help me. The place was practically empty with only two other people sitting at the far end of the bar who had already been served. One bartender was counting out his register but the other two were doing NOTHING. After a good 8 minutes the bartender counting out his drawer told me the other (who was texting on his phone) would help me shortly but the other proceeded to finish his texting and ignore me. Eventually I walked out and have no idea if they ever noticed.", "author": "sophia f."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-05", "description": "typical tex mex and nothing too special.  the one bartender there on the weekends is NOT quaint.  no, you're not cool buddy.  get over yourself.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-21", "description": "I was really disappointed with this place.  Fake cheese, coagulated beans and funky-tasting mushrooms made me not want to go back.  Also, a dish with Spinach Sauce came with no spinach in sight.  The margaritas were great though - maybe just sitting at the bar with some chips is enough here?", "author": "Eat It B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "I can't speak for the dinner menu but, for brunch this place is a favorite of mine.  My husband and I eat here regularly on Sundays and probably my favorite part about eating there is the staff.  Jen, the waitress is so quick with a coffee refill that you never see the bottom of the cup.   \n\nTheir omelets are ridiculously huge in size and I love that you can get decent grits in Brooklyn.  My favorite are the Migas, however.  I get them with chorizo and cheese.  They are so filling and tasty.  \n\nFor dinner, well, I have to be in the mood for Lobo.  I don't really think of it as Tex-Mex, it's more like comfort food to me with a Tex-Mex twist.  I always suggest this place when I am in the mood for goopy, cheesy, warming food.  It's good, it's not the best food in the world.  But, it ain't bad either.", "author": "Bridgette R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-15", "description": "i really enjoy the breakfast at lobo. The jalapeno cheese grits are amazing in a way that only heavy food can be. The Tulsas are great if you can sneak a nap in after breakfast. Cheese, beans, eggs \u0026 jalapeno grits, yum! I also like the Migas.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-07", "description": "Honestly, I don't think the food is that great at Lobo, but I like the atmosphere and the drinks. And, it's convenient. So, I keep coming back. I wish the food would get a bit better, but I've never had a horrible meal here, just mediocre. And, I always have fun and enjoy the vibe.", "author": "Mere M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-14", "description": "Skip this place...unless you like overly salty food (which has to be to cover up the less than fresh ingredients), consistently poor service, and and watered-down drinks.  Not worth it.", "author": "Joanne G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-19", "description": "Unremarkable food and absolutely terrible service make this a place to avoid.", "author": "Lou B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-03", "description": "Alright here's the true down and dirty about Lobo. The margaritas ROCK, the food always a disappointing shock. Seriously kids, there is no better cure for a sunday hangover (or any kind at all really) than a LOBO marg. They have lots of fancy dancy house infused tequilas that will make your cocktail one of a kind. I dream of their jalepeno margs. Spicy, tangly, cold and refreshing, ahhhh...\n\nThe one mistake I keep making though is the decision to order their food. Sadly, not good, not good, not good. I recently took a gander  nachos thinking they were safe enough...taco shell halves with american cheese slices topped with shredded lettuce. Sort of like a snack I made in the 4th grade.\n\nFinal thought, don't miss the delicious booze, but smuggle in some Taco Bell in your bag.", "author": "Zooey M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-31", "description": "Uneven, but often quite good.\nI suspect you need to learn how to pick your way around Lobo's menu -- the reason it's endured so long is mainly because those of us who've been going there enjoy the location and the laid-back vibe as much as the food. The margaritas are great, the chips and salsa are absolutely delectable. The appetizer quesadillas will keep you going for the rest of the day. Every portion, it seems, is value sized, so this is a great place to stop and refuel if you're on a budget. On the other hand, the ceviche I ordered here on a whim, while a very large helping, was also tasteless and rubbery. \nStick with the core offerings -- quesadillas, enchiladas, chimichangas -- and the brunch is excellent. Then just sip a margarita and watch the world go buy on Court Street.", "author": "Suzanne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-16", "description": "Came here a few weeks ago for some drinks and snacks with my girlfriends. It was Fantastic! We sat at the bar which was comfortable and spacious, unlike some bars where you are crammed in. The bartender was wonderful, very attentive and generous with the tequila in our ritas. The margaritas here are definitely more on the tart side which is refreshing compared to the super sweet ones I've had at the chain restaurants. They have other flavored ritas to choose from, I tried the mango and it didn't taste any different to me than the traditional one? We all shared the guacamole and vegetarian platter which included a portobello mushroom burrito, cheese enchilada and beans and rice. It was all delicious but not too heavy and perfect for sharing if you're not too hungry. Service was excellent and super friendly! Can't wait to come back next time I'm in Brooklyn and in need of some awesome Mexican food and Margaritas.", "author": "Natalie F."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}