{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "Loveeeee this place , only accepts cash which is a bummer but the food is AMAZINGGGG !", "author": "Charisma J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-19", "description": "Rude, rude, rude. Its been a very long time since I walked out of a restaurant. But i walked out of this one. Waitress was SO RUDE!! I'm not sure what was even wrong with her. But she was livid the whole time she served me.\n\nI stopped in after a spa treatment to enjoy a calm, solitary dinner. I sat in the bar area to keep it simple \u0026 quick. Boy was that a mistake. She was really angry, like boiling over...and she took it out on me for some reason. Eventually she abandoned my table and a busser took over. \n\nAnd although all of the registers have swiping mechanisms, they claim to be cash only. What a joke! My spa is across the street so I'll just take my credit card \u0026 business to the myriad other restaurants on Court Street.", "author": "Darlene H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "This place is awesome. All of the food is amazing!! From the nachos to the chicken fried chicken!!! Definitely get the cheese dip!!  The blood orange margarita is the best drink that I have ever had. Fernando is the coolest guy in the world!!", "author": "Erin D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "Lobo, I grew up with Tex-Mex. I know Tex-Mex. Tex-Mex is a friend of mine. Lobo, you're no Tex-Mex restaurant.\n\nBut seriously y'all, this place is pathetic. They threw Velveeta on top of a few mangled pieces of romaine and called that a side salad. Also pretty sure the tortillas were made in a factory.\n\nThe disrespect some other reviewers have mentioned here, though, extends beyond the waitstaff. I left Lobo about as irritated as any reasonable person can get over restaurant decorations. Do they think Texans are cartoon characters or something? How is this place even in business?", "author": "Ian C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "Honestly a total disappointment this is not authentic mexican food this is mediocre mexican food i think chipotle has more of a mexican feel than this no buenoooooo !!!!!", "author": "Henry M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "It's Tex-Mex food - NOT Mexican - people! Lobo is a neighborhood favorite and staple of ours. My husband and I always leave here full, satisfied, and maybe a bit tipsy from the fresh juice margaritas. The waitstaff is accommodating and efficient. Nothing beats enjoying your meal and drinks in the backyard patio/courtyard in the warmer months.", "author": "Jen O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Solid Tex mex and service. Good chips, good margs, good 'jitas. Cash only, atm on premises.", "author": "Greg M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "I love Lobo :)\n\n- Outstanding service (as a former waitress, I'm pretty judgy about this)\n- Delicious food (the salsa - they should bottle it and sell it!)\n- Brunch is reasonably priced, and the cheesy jalapeno grits are out of this world\n\nHighly recommend!", "author": "Marissa G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-04", "description": "3.5 stars. Honestly the food is always just \"ok\" for me (no more than 3 stars for food) but I really love the margaritas and the service is friendly (usually sit at the bar). We always have a good time.  I usually get the passion fruit margaritas. When I go to Lobo it's because I'm really in the mood for a margarita and salsa and chips. The salsa is good and spicy - last time I went the chips were stale but they haven't been in the past so will assume it was an off night for the chips. \nI always get enchiladas since I love enchiladas but theirs is just ok a little lacking in flavor and a bit dry. I should really try some different items on the menu and maybe find something I really like--maybe more tex and less mex. \nGo for the margaritas and sit at the bar!", "author": "Heather B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "I don't understand how this place only has a three star average. If you're not amped when you leave here, you're probably doing it wrong. I started coming here on the regular for wings years ago. I can't remember what first led me here. Possibly one of the only restaurants near my favorite movie theater. Then one day I tried the ribs (!). Eventually I also tried the Tex-Mex fare too. You really can't go wrong. The garlic wings are amazing. They make their own bbq sauce, which makes the bbq wings and ribs fantastic - I like my bbq sweet with at least a little spice (and my parents are southerners and I've had wings all over the country and NY - I'm not easily impressed). Bartenders... I've had my favorites (one I sincerely regretted not being brave enough to ask out the one time I was there and also single when she was working). They're all polite, chill, and good at their jobs, and remember their regulars. Free chips and salsa, which are fantastic. If you're not good people, don't come here. I don't eat meat much these days, and I don't drink all that often, but I always look forward to coming here. I'm actually overdue.", "author": "Kobie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-21", "description": "I went here for the first time tonight. I have always wanted to go here -- walking by it looks like a warm and lively place. I was very disappointed to discover that the food was VERY low quality and frankly, inedible. It's a fine place to just drink, the prices are reasonable, just DO NOT ORDER THE FOOD.", "author": "Mary l."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-14", "description": "There's that Woody Allen joke about the resort where the food is so bad, and such small portions too. Well, Lobo has big portions. I'll give them that. \n\nThis is Mexican food as created by someone who must have read about Mexican food in a Reader's Digest from 1962. The cheese on my enchilada's was definitely American cheese. The salsa tasted like it was Ragu marinara right out of the jar. It's edible if you've just gotten off your time machine from 1960s Milwaukee and have never tasted good Mexican food. \n\nBut, for those of us who have...stay away. Don't waste your time. \n\nBut I won't be too mean. Have a drink. The drinks are good and cheap. The outdoor backyard is nice. Sit and sip a drink. After you've eaten somewhere else.", "author": "Emily P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-05", "description": "I am not a massive Tex Mex fan, but I keep on going back to Lobo. The margaritas are great and their entrees are enormous (I tend to go for the smaller dishes or the Skinny Twins enchiladas, as they are more manageable for me). \n\nWe had never noticed the garden area before, I love it out there, it's nice and relaxed. Inside, I prefer upstairs unless we are hanging at the bar. It's best for groups up there and cooler in the summer. \n\nToday, I was totally jealous of the boyfriends Shrimp and calamari ceviche salad, it looked perfect for a hot day. next time...", "author": "Michaela E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Great food and usually great service. They are typically pretty fast to get you your food and it's always tastes amazing. Brunch. lunch, and dinner are always a great deal and full of great choices. I highly recommend this place.\n\nThere is an outdoor garden when the weather is nice and an upstairs with seating as well. There is a bar to sit at with two TVs if you want to watch a game. And, they're cash only so be sure to hit up the ATM beforehand, but if you forget to do so there is one upstairs.", "author": "Sarah .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "I'm not really into Mexican food, nor was this establishment able to change my mind. I am solely reviewing their brunch menu! (I will say my sister and her boyfriend come here about every week for either dinner or brunch) I've been going to Lobos with my sister and her boyfriend for years, I would guess around 7 years, so I am a seasoned reviewer.\n\nThe brunch is so good. Their buttermilk pancakes are so sweet! They taste like custard and they seem to just melt in your mouth in a good way. BEST BACON I HAVE EVER HAD. They know how to cook bacon crispy without burning it and that's very rare. Eggs are flavorful, they pair great with the pancakes. Home-fries are pretty standard. I usually get a mimosa and it's amazing not to mention strong. While you wait they give you chips and salsa l, add some hot sauce it's yummy.\n\nThe customer service is amazing, everyone there is so nice! 10 stars for customer service. You can eat outside, downstairs, or upstairs. I recommend upstairs, it's more comfy. It's very hard to find parking so come early and prepare to drive around. I never really had to wait too long for a table, maybe 5 minutes.", "author": "Dava P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "If your craving Mexican(oid) flavors, this place more than hits the spot. Nothing spectacular, but the food is fresh, flavorful and plentiful. They know what they are trying to be and they succeed. Service is prompt, friendly and the place itself is cute and has a pleasant feel. Seems to get a good eclectic crowd. Décor is warm, lots of wood, with tacky (in a good way) Mex touches. They accept only cash, which I never appreciate. But the prices are reasonable, so I suppose we can't have our churros and eat it too.", "author": "Barry P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-10", "description": "3.25 stars, really good soup, bad entrees, surly waitress\nNever been a fan of Tex-Mex (I love Mexican oddly though) so take this review with a grain of salt (the chicken needed some also frankly)\n\nDrink:\n\nSeasonal Sixpoint beer, 6 bucks,\n\n3.5 stars Didn't list which one but turned out to be Diesel which is a solid and properly priced stout. I would have gotten the Negra Modelo if this was a Mexican place but  not here.)They don't list a non-alcoholic drink menu which is odd or I would have gotten an Aqua Fresca or Jarritos if they had it (kinda doubt they would but I would have liked to know). Proper priced as said (maybe a buck too much) and a good selection for a warming beer.\n\nSomeone else had a sangria, was a small portion but it tasted fine.\n\nAppetizers\n\nCaldo De Pollo 10 bucks (Huge portion, well worth it)\nMexican soup for the soul (Chicken, peppers, cilantro, tomato, avocado, and rice [on the side to pour in] in a slightly spicy red broth (pepper and tomato based?)\n\n4.5 stars, had the \"Texas sized\" portion, price was great for the portion size. soup was kind of odd. had the mixed flavor of sopa de tortilla, sopa caldillo, and posole. Large enough of a portion for the texas sized that I would recommend this as an entree way over our other entrees.\n\nOthers had Guac, did not like it as it was one dimensional (too much avocado) but I dislike avocado so others might give it more. Would give it a 2 but I won't add something to my score count that I know I would dislike.\n\nEntrees\n\nChicken Francese...I mean Pollo Borracho 14 or 16 bucks, I forget, not worth it for either price.\nBoneless chicken breast pan-seared in beer and chicken broth with olives, peppers and onions. choose any 2 sides. \n2 stars, reminded me of chicken francese in a kind of bad way, no beer or chicken in this broth, was lemony and peppery. Fried pickles were ok . Collard greens had a nice spicy kick. Large portion size but the sauce was bad and the chicken was rather gummy. Meh\n\nOther people had the catfish, the bbq chicken, and the vegetarian burrito, tried a bit of each. Each were ok and definitely better than mine.\n\nI would not recommend the spinach btw, was cold, entrees in general were also lukewarm.\n\nService: \n2.5 stars. Original woman was definitely surly. 2nd person was nice and helpful but was inexperienced. Took a long time to get our entrees but was really short to get our appetizers. Was not expecting good service but was worse than expected.\n\n3.5\n4.5\n2\n2.5\n\n13/20\n6.5/10\n3.25/5\n\nImprove your service and don't serve lukewarm food please.", "author": "Glenn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-02", "description": "When I first moved to the neighborhood over a year ago, Lobo was one of the first restaurants I visited. And I have gone back many times since. For starters, the ambiance is really fun. It's usually crowded, but never packed.\n\nThe food is also good. I usually get the veggie tacos, which are good. Last time I went, my friend got the Tex Mex Heart Attack (steak, veggies, beans, rice and a fried egg), and he couldn't stop raving all night. Their margs are also quite tasty. If you check in on Foursquare, you can get $2 off the margs on your first checkin.", "author": "Alex F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Such great food! I lived in Texas for 22 years and never had as good of TexMex as Lobo. Lots of vegetarian options and my favorite is the veggie chimichanga and queso for appetizer. Only down side is no frozen margeritas which is classic texmex and service isn't the best. Otherwise it's perfect. And reasonably priced for NYC standards with big portions. Will be back for sure!", "author": "Melanie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "I love the happy hour. I love the nachos. I love the service here. I've never been disappointed here in fact it is my go to spot with my friends after a hard day's work.", "author": "Ashlye M."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}