{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-11", "description": "It's been years since I've been to Lobo. No fault of theirs, just slipped my mind amidst a busy few years!\n\nWent back last night on a casual date night with my S.O. and can't believe I ever forgot it. \n\nTo start, the atmosphere is so pleasant. In the winter, you obv can't access the backyard seating, but it's still cozy and welcoming. \n\nSecondly, our waiter was the friendliest and funniest waiter. My boyfriend ordered the full rack of ribs. And he's a big guy, I have all the faith he'd finish it. Our waiter was hesitant to put in the order bc it's so big and my bf convinced him and our waiter said \"we'll you look like a Viking so let's give it a go\"  and I've never realized it but he actually does look like a Viking hahahaha \n\nFood is amazeballs- I ordered a fajita salad, we shared simple chips and queso, and my bf got the rack of ribs and fries. All the food is 1) quickly made, 2) tastes amazing both flavor-wise and quality-wise and 3) is so reasonably priced!! \n\nWe ordered the food mentioned above and 2 of their signature cocktails - the Texas tea and our total bill came to $60 - YOU CANT BEAT THAT!\n\nHighly, highly recommend. And be sure to bring cash - it's cash only!!", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-26", "description": "There is a lot to like about Lobo. The service is exceptional and nonintrusive. The prices are non offensive and you get a lot of food. The drinks are big and tasty. \n\nWe ordered the Diablo Sol Food to go with our huge basket of homemade tortilla chips. It's excellent with a surprising amount of chili instead of just a bit at the top. \n\nHowever, that's where most of the positives end. The main entrees-- I ordered the Pancho Villa Especial and my love ordered Molly's Chicken and Cheese. Again for $14 you get a huge plate with rice and actually tasty refried beans. But the tacos and enchiladas leave a lot to be desired. \n\nI found the meat bland and slightly chewy. The tacos were kind of loosely together. None of the tastes, spices or sauces were strong. It felt like something I could have made at home and that's not why we go out. \n\nI think with a big group ready to get their drink on, Lobo can be really fun. But if you're looking for great, memorable food, seek elsewhere.", "author": "Dan D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-25", "description": "Just left this place. First of all we walked in and immediately felt the vibe of a dying institution. A few people at the bar getting drinks. Sort of a hanging misery in the air. We should have turned around but were hungry and determined. Let me describe the walk back to the garden patio. As we passed the kitchen I made eyes with the kitchen staff. Those guys did not look happy to be there. Activity was at a bare minimum. I think the last guy stuck in the back part of the kitchen closest to the patio mouthed the words \"Help us.\" We made it outside and there were two or three other tables there. They made eyes at us too. It reminded me of when you're seated near the back of a plane next to the toilets and you and the other customers exchange a look of mutual doom. As if to underline this we were seated next to another table despite numerous other free tables. We asked to be moved and it seemed like a chore for the staff. Then it seemed like a chore to have to wipe this vacant table down for us. \n\nWe ordered loaded nachos and veggie fajitas. I can describe the food as such: I could envision a long plastic tray full of canned pickled jalapeños (Jesus is it that hard to chop some fresh jalapeños??they are dirt cheap and taste better!) chopped tomatoes also possibly out of a can, premade guacamole and cheese possibly out of jars and plastic bags. All these shoveled on top of microwaved tortilla chips with a side of prepackaged sour cream. The fajita tortillas were store bought, clearly, and stale.\n\nIt was gross. The atmosphere outside was oppressive despite a sunny day. No music, nothing to distract you from the food and sloppy presentation and sporadic service. We weren't checked up on often despite having a child with us. The  margarita with house made (shocked) tequila  was surprisingly good. That has to be the only reason this place can afford to keep its doors open. Also \"cash only\" is annoying, but not at all surprising considering the quality of enterprise this place appears to be. Avoid.", "author": "Edward S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-25", "description": "Guys, I don't know why your place is \"cash only\", maybe you hide your taxes or something else, whatever. It's 2019 and not so many people have more than $10 cash with them. Your stuff (bartenders, waiters, waitresses) should tell customers about it in advance so your clients don't have to run to ATM, pay fee and get a cash.", "author": "Julia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "Having spent plenty of time in Tejas (that's Texas in Spanish, you uncultured buffoon), I am now going to pretend I'm an expert on Tex-Mex cuisine. \n___________\n\nI really like Lobo. And when I say that, I mean that I really like a lot of things ABOUT Lobo (and even the things I didn't like initially have grown on me over the years). The first of which is the delicious margaritas (which actually have the effect of making everything else better as well) served by great bartenders, ideally during happy hour. \n\nOther great things about Lobo: \n\n-The awesome backyard. \n-The cute, cozy upstairs dining area that I didn't know existed, but now spend too much time in.\n-Free chips and salsa, which is always nice.  \n-Huge portions. Seriously, huge. How huge?\n\nTwo regular human beings could easily split the combo plates and be full. Believe me, you will remember The Alamo (one chicken enchilada, one beef burrito topped with tex-mex con carne and a bean and cheese chalupa) because it will still be sitting in your stomach three hours later. \n\nI once ate the Carnitas Extravaganza on the recommendation of the waitress (she said to get it if I liked \"huge, and pork, and egg,\" which are three of my favorite things), and it made me realize that if everyone in NYC ate like this all the time, they would start to look like everyone in Houston.\n\nThe wedge salad, a freaking SALAD, is more than a full meal for a normal human being. It's got more bacon than you'd ever expect, basically a full avocado, and if you add shrimp or chicken to it you're good. \n\nPlease understand that this is not the best Mexican food you can get in NYC. But it is an insane value that comes with good service and great margaritas, it's the best option before or after a film at Cobble Hill across the street, and it's an excellent foil for the numerous tiny-portioned, expensive options nearby.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "We went here for Cinco De Mayo and we sat in the backyard which was cool. We started with chips and guacamole, very fresh and flavorful! Then we ordered nachos with chicken and steak. The chips were big enough to hold all that amazing cheese, sour cream and meat! We also ordered Mac and cheese with bacon which was really really good. Last but not least we ordered chicken quesadillas. Excellent!\nFor drinks we ordered blood orange margaritas with cinnamon which was very good too. The only thing I didn't like they ran out of margarita glasses and we all had to drink out of solo cups! Other than that a great place for food and drinks!", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "Oh my gosh nothing beats $6 margs... and they were deliciously made. You can tell it's fresh lime juice and thats my favorite. Upon seating you get nachos and salsa, with cholula on the side. I wasn't that hungry, only came for happy hour. I did order fries and it was plentiful. I'm sure their food is great too but will try next time since I enjoy Mexican food. The bartender was a very friendly Colombian guy. Definitely will revisit.", "author": "Abeda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "Lobo is such a solid spot. We need to up this average to at least 4 stars. Casual date night? Lobo. Friends in town? Lobo. Hangover brunch? Lobo. Huge portions, authentic and good food, quirky yet cozy atmosphere, and solid prices. An added plus, I've not once felt rushed while dining here. Sat with girlfriends laughing and chatting for probably 30 minutes after we paid (nobody was waiting for a table, promise!) and our server kept refilling our waters with a smile. One of my favorite low-key spots in Brooklyn! \n\nBut, beware: you'll leave super full so I wouldn't plan a wild night out post-Lobo meal.", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "I had an amazing brunch dish that consisted of cheesy jalapeño corn grits with scallions and poached eggs. The bartender made delicious tequila drinks. The music was so much fun. A little Cure and other great eighties tunes.", "author": "Ab A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Nice Tex-Mex place in cobble hill \nServers/bartender are for the most part nice but can be a little snippy at times but no big deal \nThe place is huge they have the downstairs, upstairs and outside patio to enjoy.\nThe margaritas are tasty they get the job done. \nRestaurant is cash only so either bring cash or use their ATM upstairs. \nBuffalo chicken quesadillas are delish as well as the fries pickles Yum! \nPrices are affordable \nHappy hour specials are available during the week. \nI would recommend for drinks at the bar and snacks.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-17", "description": "I want to like this place....\n\nAt first glance, the menu is impressive and I wanted one of everything.... Sadly, our choices didn't live up to our expectations. \n\nWe had the lobo platter and the chimichangas. They both lacked in flavor but weren't a total fail. The seasoned taco meat was the highlight of both dishes and at least the pork was tender. That being said, I wish I had stuck to my gut and ordered the classic taco platter instead of the chimichangas.\n\nAll in all: The service was good with everyone being extremely friendly. I will definitely come back for drinks and possibly dinner but our first experience was underwhelming especially for such a grand menu and comfortable surroundings....", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "Always my go to place for margaritas in cobble hill. \nChill at the bar, have complimentary chips and salsa, You might find yourself imagining that the longhorn above the bar is charging at you. Infused tequilas ranging from blood orange to cinnamon can turn what would be a dull shot into something more yummy and cool. Cash only here folks so if you run out of it there is an ATM upstairs. Yes there is a happy hour and yes you can afford it.", "author": "Luis B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "I'm going to go out on a limb here and say that I get the feeling that some people who have reviewed this place haven't eaten a ton of actual Tex-Mex. Me and the hubs moved here recently from Austin and the dearth of Tex-Mex has been a sadness to us. Yes, Mexican food is thick on the ground, but Tex-Mex is a different thing. You use different spices and meats. It's just not the same thing. (Don't misunderstand. There's much about the NYC food life that we're super happy about. Just not this one tiny thing.)\n\nLobo has real queso. Maudie's recipe queso, if that means anything to anyone. What it means to me is that I don't have to make my own damn queso anymore. \n\nWe got enchilada plates, which should be the test of any new Tex-Mex place. I got shrimp with rachero sauce, he got chicken with verde. The ranchero sauce was bueno, the verde sauce was as well.\n\nThe ice tea was perfect, the chips and salsa were gratis - and yummy - as they should be. At first glance, the salsa was not as chunky as I like, but it had both a sweetness and enough heat to carry the day. The table also has red and green Cholula if you want more.\n\nYes it's a cash only establishment, but I really don't understand the complaints. It feels like more and more places are cash only these days. It's annoying, but it is what it is. \n\nThe place has ample and comfortable seating. Full bar. The waiters were super nice, even ran after us when someone - not me and there were only two of us so... - left their phone and glasses at the table. \n\nTotally going back.", "author": "Gabrielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "Finding a legit Tex-Mex place is hard. And all my southern friends yell when you don't bring them to a legit Tex-Mex spot. You gotta have those chips and salsa when you sit down, or it ain't Tex-Mex.\n\nLobo is a decent spot. I was deciding between 3 or 4 stars, but in the end their specials is what wins me over. Happy hour margaritas are hard to beat. \n\nThe food has never been amazing here, but recently it was a little better. I feel it depends on how crowded it is. So come, come early. Beat the crowds and enjoy their happy hour.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "I used to visit the Park Slope location all the time and miss it dearly, so I occasionally hop over here. The owner is the same, and some of the staff moved over when the other location closed. The service at both locations was always great. The bartenders were great at reading you; occasionally I would come alone and they were chatty if I felt chatty and would let me be if I just wanted to read (a lesson some bartenders need to learn).\n\nI love their margaritas (I get the blood orange with a tiny splash of raspberry). They'll give you as many chips as you can eat. My friends have always been happy with their food, and it's very reasonably priced. This applies to both brunch and dinner.\n\nIt is cash only with an ATM upstairs, so bring a little more than you think you'll need for that last margarita you shouldn't drink but will order anyway.", "author": "Jeff Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "This place is a solid 5 stars when you consider availability, location, cost, happy hour, friendly service, and variety of tasty options. I've been here probably about 12 times over the past 4 years. All but one experience was super. The queso is spot on, so that alone is worth the trip. The happy hour margaritas are a delight. The service has always been friendly and organized. The food itself is tasty (a solid 4 stars), and the options are just like a typical Tex-Mex place in Texas - this is a compliment! It's hard to find this here in NYC. It scratches the Tex-Mex itch but it's not the best Tex-Mex I've ever had in my life, but I have absurd standards :)", "author": "Sally T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "Eh, I'm a little disappointed that I was disappointed in this place.\n\nWas really craving queso and, after reading some decent reviews, queso was the first thing I saw on their menu. So, my boyfriend and I gave it a try. The queso was good, not mind-blowing good, but good enough. The salsa had a nice bite to it and the chips were fresh.\n\nBut, I ordered the carne guisada tacos. In a normal case, there's a ton of flavor in this dish, but it was majorly lacking. The meat was good and tender but there was just zero flavor. My boyfriend had the pulled pork burrito and said the same - it just needed more flavor and spice.\n\nWent to pay and found out they only accept cash... but they have an ATM upstairs. Of course they do. I get that some places do this, but for a sit down place I expect to see somewhere before ordering that it's cash only. Guess if they told you then they'd lose a lot of business soooo, it is what it is.\n\nAll in all, I'm not pressed to come back here but I'm glad I tried it, it was good service and decent queso.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "I don't understand the mediocre reviews. I've been here twice now, and love their margaritas. It's hard to find a decent margarita...especially in this neighborhood and theirs are awesome!!  They also have queso dip which is one of my all time favs and hard to find in NYC.  Definitely recommend this place!", "author": "Jen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-05", "description": "Had lunch here with a friend of mine... This is a cool spot where I would have to visit again when I am off my restricted eating plan.... lol lol... \n\nI had the steak fajita salad.... it was very fresh... the only thing that it was missing was some salt to make it perfect on the taste side.. \n\nMy friend enjoyed her grilled shrimp with mash and garlic spinach...\n\nI will definitely be back to try the fried chicken when my restrictions are over....\n\nHappy Eating!", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "We were so obsessed with this spot for brunch that we ate here for about 7 months straight. First, the house made salsa is probably one of, if not the best salsa I've ever had in my life. We've considered asking them to bottle it for us so we could take it home. My boyfriend gets the Texas breakfast and I go back and forth between the breakfast quesadilla and the migas. The brunch here is honestly great and the service is great, plus the owner is so kind and sweet!", "author": "Felicia P."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}