{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-01", "description": "Not the worst, but...\n\nMaybe my experience was a fluke but this place could have been better.\n\nFOOD - The quality is OK, the flavors are nothing special, but the disappointing part was the pricing was probably 20% more than what it should be for the quality and quantity.\n\nSERVICE - The wait staff seemed pretty inattentive, had to grab our own flatware from other tables and they got my beverage order wrong twice, then followed up with a less than accurate entree.\n\nMaybe I'm expecting too much, but I've often found that Brooklyn restaurants usually offer dollar for dollar better value, quality and authenticity than a lot of Manhattan comparables.  Lobo does not.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-17", "description": "First of all, the margarita. It's easily worth 4 or 5 stars. Really good. You can add in fancy flavors, or keep it basic. They had a lot of other tempting looking drinks as well, but there's a reason it was named best margarita in NYC.\n\nThe food is actually pretty good Mexican, which is surprising for NYC. However, being a veggie, I was left with a lot less choices. It's definitely a meat heavy menu. I went with the vegetarian plate, which was ok, but I wasn't necessarily a fan of a portabella mushroom burrito. So, I left a little disappointed. If you like your meat, you'll definitely be happy with this joint.", "author": "Natalie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "Update to my previous review...went here for dinner instead of lunch for the first time and the service was worlds better. So friendly. And happy hour until 7pm $6 margs", "author": "Erin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-08", "description": "Went here with a big group of people on a Friday night. There was no more room in the outdoor seating area but there was a ton of room upstairs. The appetizers were pretty decent. We got the loaded nachos (which were basically halves of tacos with dips on top), the guacamole (which although advertised as large was pretty small for a group of 8) and quesadillas (best meal there by far). I got the ground beef tacos which were very disappointing. There were hardly any toppings and the beef seemed under-cooked. Overall, it's a decent place but nothing special.", "author": "Elina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "I love this place. Tex-Mex rules. This place totally rocked it out. Right from walking in the door, the place is cheesy and totally comfortable. It screams inauthentic Mexican food (read flavorful) that will make you smile and want to come back for more. Plus, random (yet interesting) music playlist that will keep you questioning why they're playing this song all evening. \n\nLike all good places in Brooklyn, there is also a little garden seating area. I didn't sit out there on this particular visit, since it was a bit too humid outside to really enjoy the food and the seating. Upstairs, it was nice and cool, not too loud, not too crowded, pretty much just right. Again, totally all about the cheesy decor and wood paneling. Love the fake cow-hide bench covers. It was fun, and it fit the bill for your hometown Tex-Mex craving.\n\nThe portions were plentiful. I got the tacos with beans and rice. Compared to most beans and rice in the city, this was pretty decent. The tacos themselves were very flavorful, thanks to the nicely seasoned sirloin. I can't speak for any of the other meats, but if they compare to the sirloin, they must be worth a shot. \n\nAlso, the chips and salsa were a good solid staple. That simple, runny salsa that you just keep eating. The chips were decently crisp and tasted homemade and fresh. \n\nNow, if they just carried Red Hot hot sauce, I would be in heaven. Totally tacky, and I love it.", "author": "Justin B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-21", "description": "If your restaurant has the balls to claim itself as the \"best Tex Mex\" and then put on its menu cover a map that shows ... from Austin to Brooklyn ... you BETTER DAMN SERVE REAL TEX MEX. \n\nAs an Austinite that recently moved to Brooklyn, my taste buds have been dying for some serious Tex-Mex... so I can guarantee you that they have not forgotten what good Tex-Mex tastes like.\n\nFirst of all: \n\nTHE QUESO: Man, I've been dying for queso. Anyone I tell about queso here in NYC has no idea what it is. So when I came to Lobo and ordered queso, I expected to get... real queso. What our queso looked like to me was a huge pot of melted Velveeta and a huge chunk of ground beef. There was WAY too much beef in there, not to mention it was dry and flavorless. The cheese was way too cheesy, too thick, and once again ... flavorless. Maybe if you added some guacamole in there or SOMETHING. God, it was horrible.\n\nTHE NACHOS: Wow. Wow. I don't think I can even call these nachos. First of all, the chips in nachos should be CRISPY, not completely soggy. You couldn't even pick up a chip without it ripping. Second, all of the ingredients should be baked in the oven together on top of the chips so they all melt together. It looked like they just piled some ground beef on one corner, some sour cream and guac on another corner, some lettuce and tomato on another corner, and cheese and beans on another corner. No.\n\nTHE QUESADILLAS: Now, I don't know how you can mess these up. First of all, they were as flat as a pancake and TINY. They tasted okay but it's only because there are like... what, 2 ingredients in there?\n\n---\n\nFinally, the service was horrible. We told our waitress that we needed to hurry because we were trying to catch a movie. We sat at our table w/ our  empty basket  of chips and queso for 10 minutes before she came to refill it. Then, the table next to us received their food before us even though they sat down after us. They offered to give us our appetizer for free, but who gives a crap about that? It was pure shit anyway! \n\nI saw they offer breakfast tacos and migas on their breakfast menu. I give them kudos for putting those on there for \"authenticity\" purposes, but I sure am scared to try them.\n\nAll I have to say is... Don't mess with Texas. \nIf you're going to have a Tex-Mex restaurant, use real and fresh ingredients. Take your time in making the dishes. Don't have horrible service. Maybe hire someone who knows what the hell he's doing. And don't charge so much if you know your food is shit.", "author": "Frances L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "It's not perfect food, but it's still the best thing a home-sick Texan can find for Tex-Mex in this city.  For that, all the thanks in the world to the owner.\n\nThe run-down: real Tex-mex food (velveeta, proper chili gravy, and good hill country salsa), margaritas with juice that is fresh-squeezed every day (but no cointreau behind the bar last time I went), and solid Austin-nostalgic breakfasts with great bloody marias.", "author": "Carter P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Lobo's Mango Margaritas + Tacos = Heaven on Court Street!", "author": "Vicky Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "JALEPENO CHEESE GRITS! Get these for brunch, you will not be disappointed. So freakin good.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-09", "description": "Ordered nachos and they were really terrible and unappetizing... $12 got me a microwaved plate of soggy chips underneath a mess of mostly sour cream. Very little refried bean... Sauce...? Some chunks of tomato and worst of all velveeta cheese?! Come on. I wish I had the balls to say something in person and maybe not have had to pay for such a disappointing meal...", "author": "Y Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-31", "description": "Cash\nOnly,\nNice staff, and\nOutdoor seating.\nThe food is rather meh for what it costs.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-18", "description": "Didn't actually eat here, but I did have some magartitas and free chips and salsa. They were good and I liked sitting in the back garden watching the squirrels play on the fence. I'll try an actual meal next time.\n\n*UPDATE: ate here this past weekend...the veggie tacos were really good as were the chips and salsa,  and the bartender was very generous refilling my drink several times at no charge :)", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-30", "description": "With my continuing effort to leave my neighborhood, my companion and I ventured into downtown Brooklyn and walked forever on Court Street. By chance we wandered into Lobo for brunch. A kind of funky looking place tex/mex/brooklyn style. Great omelets with roasted garlic and roasted peppers, rice and beans and tortillas. Cute garden in the back sort of reminiscent of funky neighborhood places in towns in New Mexico.\nFriendly service and decent food.\nVery family friendly brunch time with lots of screaming kids and parents who just couldn't control them. That I don't quite get.\n\nA walk afterwards through Carroll Gardens uncovered one Italian Ice stand after another....what a treat!", "author": "Stuart W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-11", "description": "I came here with a large group of people on the day we all finished final exams, so we were ready for some drinks. We had reserved tables in the outdoor space, which is cute but small-ish, and nothing fancy. The waitress was pretty on top of our drinks, considering we were a large group of at least 20 - they took a while to come out, but she got the orders right. However, my friend and I ordered a large guacamole, which took almost an hour to get out - even though our friends had ordered entire meals that came out way before us. We had to ask three different people, including our waitress, to bring out the guac. But the margaritas were great (try the raspberry), and the outdoor space is perfect for a casual place when the weather's nice.", "author": "Tara J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "I'm a girl who can never quite learn her lesson.  Yes, blood orange margaritas are absolutely delish and addicting (and can be rationalized as a \"breakfast\" cocktail).  No, I shouldn't drink tequila.  No, I was a hawt sweaty mess.  Yes, I need counseling.", "author": "Kelly T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-21", "description": "This place is a hell hole. Ordered nachos to share with a friend, and was shocked by how pathetic they were. The nachos were a muted plate of GARBAGE. The cheese, tasted like how permanent  marker smells. I am incredibly concerned as to where this cheese came from. I am an avid cheese lover and the fact that one could tarnish the name of cheese so horrifically is beyond me. The GUAC on the nachos?? No where to be found. Or maybe it was just hidden by the pile of white lettuce that some how looked expired. The beans just held more disappointment, it looked as if someone had lightly smeared feces across the STALE chips. We took our food to go, and made sure to put it where it belonged, in the GARBAGE across the street.", "author": "Renan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-01", "description": "Just so so for dinner too. But have a nice outdoor back patio which is great in the summer time. We had 2 fajitas, 2 margaritas (tart), chips (avg) and guacamole (good). Total tab before tax/tip was $49\n\n12/22/09\nJust so so brunch. I had a two eggs over easy and side of pancakes and sausage. My friend had a vegetable burrito. The eggs were fine but the pancake tasted like it came out of a box and the syrup was  your basic grocery store variety. The buritto was pretty bad (no flavor). However, the atmosphere is nice - cozy and casual. We sat upstairs which has windows that look down on Court St. The bar on the first floor looks like a chill place to hang. I'd come back here again for a drink at the bar or to try dinner.", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-16", "description": "Definitely enjoyed myself this past Valentines Day. After a breakup earlier that day I went walking with a friend and we stumbled upon LOBO (thank goodness!!!) the food was AMAZING and the Passion Fruit Margarita hit the spot so well. THANK THANK YOU! and compliments to the Chef", "author": "Erin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-20", "description": "Good tex-mex food. Friendly staff. More of a bar with food than food with bar.", "author": "D Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "As a fellow Austin ex-pat, I have been on a never ending search to find authentic TexMex in NYC.  Lobo delivers!  Amazing salsa, spot on queso, and enchiladas that would be at home in any joint on South Lamar.  If you want real Austin TexMex, there is no other place to go in the city.  So, so good.", "author": "Eric B."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}