{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "Loving Lobo.  I lived in Austin, where I was a Maudie's denizen and with the pulled pork, tres leches, and the great salsa, I'm good in the hood!", "author": "Nick N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "Always super excited about the margaritas, chips, salsa and guac, but never remember that the rest of the menu is not quite as awesome until we're already seated. The juice for the margarita is freshly made, and it shows in the quality and taste.\n\nI've never had anything that was bad, but never have raved about one of their entrees. Definitely give it a shot though.\n\nThe staff has always been really great, and the outdoor seating in the back is great when the weather is right. \n\nCash only can be a pain in the neck, but they have an ATM upstairs to avoid the neighborhood ATM scavenger hunt while your partner stalls the waitress.", "author": "Matt T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-24", "description": "I live by myself in the neighborhood, and Lobo is the one spot I feel comfortable eating alone. It enhances my life, and my gut. \n\nAt least once every week, I sit at the bar and order a margarita on the rocks with salt and Edwin's Enchiladas with verde sauce. The friendly bartender gives me a huge amount of thick chips -- not the slight ones that crumble when exerted -- and medium heat, thin, tasty salsa. The margarita is good, the food is fine, and the atmosphere is oh-so-comfortable in an area with not-so-comfortable, self-conscious eateries. I read a magazine and chat with the bartender a bit. I leave satisfied.\n\nIt's a routine, and I like it.", "author": "Martin Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-22", "description": "Lobo is my 3 month cheat.  My boyfriend and I go there when we want to treat ourselves to a good heavy meal.  We always start with the diablo (chile con queso with meat).  We should probably stop there but like I said this is when we want to cheat so I either get the tex heart attack, the wolf, or the bama.  The portions are big.  I am in mid itis right now while my bf is passed out.  Highly recommend for a once in awhile treat!", "author": "Noam P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "Lobo is one of my favorite places especially for Sunday Brunch. My boyfriend and I are definitely regulars. The food is great, the drinks are really great (Bloody Mary's and Texas Tea are our favorites) and the staff is friendly and on point. The guacamole is delicious (and we are picky about guacamole). Plus my boyfriend is vegan and they can make many of their dishes work and still taste great.", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-02", "description": "I mainly go to Lobo for the atmosphere. The first floor is intimate enough that if there isn't much of a crowd you still feel like the place is comfortably busy. If it does get busier, the upstairs can seat a decent amount of people. The BEST part of the atmosphere is during the summer. I love the backyard of this place and who doesn't love a margarita on a beautiful summer night with strings of lights surrounding them?\n\nThe food is decent and fun. The bartender and servers all seem pretty genuine and nice. One time our meal order was lost so a server (who was actually off for the night) brought our table shots and took one with us.\n\nThe food takes long enough to come out that I fill up on chips and salsa almost every time. I don't mind this during the summer because I just like sitting in the yard, but during colder months it's less appealing.", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-18", "description": "Man I like this place, for the most part. (A few times it has been a miss)\n-The drinks are great.\n-The queso dip is the best I have had in NY.\n-I love the fish tacos.\nOh and there breakfast tacos on the weekends are pretty good.", "author": "M S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-06", "description": "Granted, I'm one of those people who likes the same thing again and again (and again), but I've been coming to Lobo for awhile, and I'm pretty sure it's for a reason. The salsa is great and the chips keep a'comin'. The guac is super-fresh, and comes in a little chip bowl, which is both adorable and delicious. I love the chicken fajitas and the burrito is pretty decent too. Prices are a little steep for what you're getting, but the staff has always been friendly and the garden is nice.\n\nSo, it ain't perfect (and realistically, only 3.5 stars), but where else are you going to get better Mexican in Cobble Hill?", "author": "Lesel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-12", "description": "The boyfriend and I go here all the time.  He loves the Lobo comobo meal and I always get the chicken fajita sandwich.  While it is WAY over priced and their cash only policy sucks, there are some positives:\n\n-Margaritas are the best in the area!  Two grandes and you are good\n-Free chips and salsa\n-Never have to wait for a table\n-service is consistently above average\n-been here with a larger party (about 20) and they were very accommodating", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-08", "description": "I think the food is pretty good, especially for Mexican in New York. Appropriately spicy and with a broad menu. The backyard/garden area is a great place to sit, low-key and reasonably comfortable and quiet, even with big groups around.\n\nThe problem, for me, is the service. There are one or two servers who seem really \"on it,\" but the vast majority of their servers/bussers/food runners seem pretty spacey or disinterested. I would be more inclined to go to hang out with a big group than to just go with one or two people, which is what I've done in the past.\n\nAlso, it's cash only. That's fine, but always a bit inconvenient.", "author": "Jenny H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-06", "description": "We frequent Lobo about once a week and we go specifically for the Georgia's Bean Dip. Refried beans, queso and a little bit of pico de gallo on top is a perfect combination. Most of the food seems a tad overpriced, but you receive a decent quantity of food and the quality is what you would expect. \n\nAs others have already stated, the service is a bit lacking especially if you sit outside or upstairs. They either forget that you are out there or they would just rather stay near the bar area and socialize.\n\nMy wife likes their ground beef soft tacos dish and she's rather picky about her tacos. Definitely pass on anything with Fajitas (salad, sandwich or platter) - all overpriced and the fajita seasoning lacks flavor. \n\nLove the bottomless chips/salsa and soda. Hamburger and Pulled Pork sandwich are solid choices and rather tasty.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-01", "description": "They sell fish tacos both HOT and COLD and lobo, and unfortunately, it's also describes their service and food quality. Like an earnest but bipolar cousin, poor Lobo just needs a little Lithium to keep your water glass full.\n\nBut even when the check won't come and the salsa is out, after a few blood orange margaritas you'll forget your impatience -- grooving to the Texas tempo and laid-back vibe.", "author": "Philip W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-11", "description": "Stay away from the shrimp, they make zero effort to clean them, When we sent it back \u0026 showed the waitress, she acted like this was the first time she ever heard this in her life, and She was no spring chicken. She said she doesn't eat shrimp and didn't know they were supposed to be cleaned, otherwise very bland food overall.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-01", "description": "I have never felt convinced to write a review of restaurant before, either good or bad, but feel pretty compelled to let folks know about my experience with Lobo. First the good, the restaurant is super cute, right off Court Street, we had a ideal seat right in the front bay window. Our waitress was very sweet and offered her recommendations for meals and chit-chatted with us. I ordered the bean chalupa and the mango margarita. \n\nThe food came out relatively quickly and the minute we began to eat, I felt immediately sick. I brushed it off and continued to eat and we wrapped up paid and left to an apartment viewing. I continued to feel really sick, like a load was sitting on my stomach. I began to feel very nauseous and it got worse as the day went on. I've eaten plenty of Mexican food, from the very authentic to the cookie-cutter Mexican food chains, with no problem. \n\nWhen I finally got home in a few hours, I took my dog out for a walk and felt extremely faint and feverish. It was chilly outside, but I had to stip off my sweater because I began to sweat. I hurried home with my dog and the nausea became unbearable. Two hours late I finally threw up the entire meal from the restaurant. And tossed and turned the entire night feeling feverish and getting up every hour to throw up. \n\nWhat became readily apparent was that I suffered from food poisoning. I would be happy to consider that it was something else I ate, but Lobo was the first and last thing I ate. \n\nI am writing this not to deter potential customers from eating at Lobo, but just a note to the staff at Lobo, that something that was prepared has serious bacteria on it. I am a vegetarian, so it was undercooked meat, but must have been something in the beans, lettuce and guacamole. I think it may have been the guacamole because it is the only thing I had that my dining partners didn't have. \n\nI myself will never eat at Lobo again, but wouldn't discourage others from going, if Lobo addresses the issue.", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "Good solid Tex-Mex.  The fried catfish with collards and mashed are awesome!  Then of course there's the Corallejo Anejo!  Cash only.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-18", "description": "My first time exploring the Cobble Hill/Caroll Gardens hood and we stumbled into Lobo for a quick lunch.  It was pretty empty when we were there, but I get the feeling it's pretty bustling during the eves, and there are two spacious floors.\n\nI ordered the chicken taco platter and my friend had the veggie taco platter.  Both were your typical tex-mex fare in taste and quality.  Actually, my chicken tacos were a bit bland but nothing a bit of hot sauce couldn't really fix.\n\nNot too special, but a pretty decent local spot if you need tex-mex and a margarita.", "author": "deb y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "Lobo's is one of the few genuine restaurants where you can just go by yourself and chill. The staff is really funny and laid back and dont bug you too much. The food is ok thus the 4 and not 5 stars. \n\nAsk Jett the bartender for their signature margarita. I was given a sip to taste and it was delicious. The crowd there are regulars who come by to hang out... not to pick up dates, not to look cool or anything else but just to hang out because it is a chill neighborhood bar where everyone wants to relax and have a drink. \n\nGo there on a day you are beat and just want to rest your tootsies over a nice cold drink and some hearty food :)", "author": "Soham K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-10", "description": "Classic 3-star restaurant food-wise.  I had the pork tacos and while juicy, were nothing special.  The \"Okie Caviar\" was OK, but I've made it myself with better ingredients.  \n\nI didn't get drinks, so that may change it, but otherwise - meh.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "If you come here, come with an appetite. CASH only, but the margaritas are yummy, the portions are BIG, and you get your money's worth. This is NOT a fine-dining establishment where the bartender or server will get down on their knees and do whatever you ask of them. It's a cool joint with awesome fried pickles, delicious wings, killer rice and beans, and really good Americanized Mexican food. Great place to start your Friday or Saturday night.", "author": "BK D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-28", "description": "The brunch is decent but the rest of the food here is HORRENDOUS. The ingredients are cheap and plates are thrown together without care. There are some nice servers here but for crying outloud, the big dude that is always singing on the top of his lungs is one of the rudest ever. I have friends who stopped going because of him. Why this guy even works here is beyond me.", "author": "Anastasia M."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}