{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "It has taken me forever to write a review. I've been coming to this place off and on. For about maybe five years. Anyway.... I love Lobo!!! I highly recommend the shrimp quesadilla and for the chicken lovers. My friend recommended the pulled chicken tacos. The drinks are amazing I had an Apple Cinnamon Margarita and became obsessed. I highly recommend this place. Upstairs, downstairs or the backyard. You'll enjoy it!!!!", "author": "Charley C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-02", "description": "\"This place is bougie.\" I told my friend, as I sat down at this new, clean and decorated cobble hill Tex Mex joint. \n\nCobble Hill is bougie for sure.  Living in Washington Heights, you just don't get suburban new and clean like this, rarely in Manhattan.\n\nI sort of felt like I could be somewhere in Houston.   \n\n\"The owner lived in Austin.\" My friend noted. \n\nThis place is surely gringo ized, but that isn't always a bad thing, and in this case it is done pretty well.   We shared some BBQ chicken quesadillas that were BBQ saucy and not too cheesy.  They had flavor, they weren't greasy. \n\nChips and salsa were good enough.  Salsa was white boy mild, and maybe even sweet. \n\nLobo might quench a Texans homesickness for Tex Mex , which is rare in NYC. \n\n\"Do you have mole?\" I inquired.\n\"Yeah, enchiladas or pollo con mole.\"\nI think I'll be back.", "author": "Scott L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "Pretty standard Mexican restaurant. Free chips and guac. Lots of cheap beers for not cheap. Come during happy hour. Cocktails are a good deal though.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-06", "description": "Based on dining in (disclaimer: it was cinco de mayo).\n\nLobo Margarita Grande:  I wouldn't recommend.  It was pricey considering the fact that it mostly tasted like sour mix and no real hint of liquor.\n\nFajita Steak Quesadilla:  I would give it a 4 out of 5.  Pretty tasty and the meat was tender.\n\nChips \u0026 Salsa:  the salsa is on point and has a bit of a kick to it.  The chips aren't salty which I like.\n\nThere was a bit of a wait to be seated and for the food but I'm assuming it was because it's Cinco de Mayo.", "author": "Rocio T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-27", "description": "Down the toilet bowl it goes. Literally.\n\nDecided to stop in again... food tasted good, nothing seemed off, however I left with a bit of a stomach ache and brushed it off. Hours later... BAM! Food poisoning and a night of hugging the toilet bowl. Future diner beware.\n\nI think it's safe to say I'm never going back, and nothing will change that.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "Wow, has Lobo's food improved over the past year or two. Had brunch here twice in 2017, out in the back yard, and it was a delight from start (greeting, seating, complimentary house-made chips \u0026 salsa) to finish (food, service, value). Good happy hour, too!", "author": "John T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "If you're looking for comforting Tex-Mex food at reasonable prices, Lobo is the place to go.  \nThe service is friendly and the food typically comes out quickly.  They start by bringing a complimentary basket of chips and salsa (and the salsa is delicious, has just the right amount of kick), but I try not to fill up on those so I can enjoy my go-to entree, Edwin's enchiladas with chicken and verde sauce.  My husband gets the same dish but with mole sauce.  \nTo sweeten the deal, they have Happy Hour margaritas on week nights until 7pm. \n\nNote:  While Lobo used to have two locations, one in Cobble Hill and one in Park Slope, the latter closed earlier this year.  The remaining location (which we always preferred atmosphere-wise) is two floors -- there's a full bar and small dining area (maybe 4 tables) on the first floor and a larger dining area on the second floor.  They also have outdoor seating in the back yard.", "author": "Kirsti H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "I love this place so much, the food is so good, but I don't go as often as I'd like since they are cash only. (Especially once you start adding booze, it adds up... No one has that kind of cash anymore). Please, please accept cards someday!\n\nI would give it five stars otherwise.", "author": "Molly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "I promised myself I'd write a review SO long ago but I totally forgot! Anyways, Lobo is SO great. They have really good prices, sooo much space, and SUCH good food. The brunch menu is enormous and just delicious all the way up and down. The bartenders are so, so nice and friendly. Right off Bergen St F/G stop. Definitely will be coming back!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-05", "description": "The tacos was really bad , I love \nMexican food but even the chips and salsa was horrible. Maybe I just picked the wrong thing in the menu ... service was good overall", "author": "Nadia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Being from San Antonio Texas, it is always great to enjoy some good Tex Mex when visiting the Big Apple. Great place!", "author": "Tom C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Will makes the best spicy marg on the planet. The chicken fried steak and fried okra make this Texas boy happy.", "author": "Jeffrey B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-01", "description": "Came here with a group of friends for dinner before a concert. The place has a fun, kitschy ambiance and drinks are ok but the food is bland--almost everything we ordered needed a lot more salt, spice or both. With so many great options around, I won't be returning to this spot.\n\nIf you're planning to go, be aware that Lobo is CASH ONLY.", "author": "Kate W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "OMG! My  'go to' fave place. I think everyone in my 'circle' of friends and family has been dragged there by me. I started in 1997 when I moved to Brooklyn, and have been going ever since...20 years. I even had a 'major' birthday there. Big kudos to them as restaurants in New York sprout (and wither!) all the time. The food is always great...and generous. The margaritas are rumored to be the best around. I'm the oddball Martini drinker---If my Martini is any indication of the overall drink scrumptious-ness, then the margaritas must be amazing!", "author": "Jack G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Love this place. I'm from Texas so it's so nice having a true Tex-Mex joint only a block away from me.\n\nThe upstairs area can get really loud on Friday nights, but usually, this place has a great vibe.\n\nSlight headache that they only take cash.", "author": "Abigail H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "Don't listen to haters, this place is awesome. If you're looking for classic Tex-Mex with a chill vibe then look no further.\n\nThe staff is awesome and friendly, the food is fast and consistent and they have a sweet backyard. The margaritas are solid and you HAVE to get the bean dip.\n\nNo this is not a fancy, upscale, Mexican-fusion, hip Brooklyn restaurant. Its a classic Tex-Mex joint which will not disappoint. Always a good choice for dinner.", "author": "Dan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "I can't believe this place only has 3 stars. It has free chips and salsa, the margaritas are great, and the food is *very* reasonably priced. Sure, its not 20$ gourmet tacos, so you should expect to get what you pay for. Pretty awesome tex-mex menu. I also miss and have fond memories of the Park Slope location :(", "author": "Maggie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Exactly the type of no-frills, simple Tex-Mex with plenty of cheese that a homesick Texan would want. Only enchiladas I've found in the city with a proper chili gravy.", "author": "M A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-27", "description": "I'm not quite sure if the bartender on august 27th at 9:30  is homophobic, racist, or just bad. It was a horrible experience. Texans be aware... btw the cheese is velveeta !!!!", "author": "Marcus B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "What a beautiful brunch experience. \n\nWe got there and weren't sure it was open. It was about 10:30am on a Saturday; no one downstairs seated or at the bar. They were super nice and said that they were. \n\nThe Pumpkin Pancakes sign got me, so we went inside for that. Well, I did. \n\nService was super nice. Pumpkin pancakes were money. Our margaritas were solid and well-made. $3 sides was super cheap. Bacon, chicken sausage, and pork sausage sides were ordered. They even had french fries, which we didn't see on the menu, for our baby boy.\n\n-1/2 star for CASH ONLY. So annoying. Hello Brooklyn... \n\n4.5 stars for brunch. GREAT MUSIC.", "author": "Cyrus P."}], "servesCuisine": "Tex-Mex", "priceRange": "$11-30", "name": "Lobo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "218 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/iaHi83QY08LwYgmc4v0Nvg/ls.jpg", "@type": "Restaurant", "telephone": "+17188587739"}