{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Delizioso! From my Aperol spritz to my espresso and everything in between. The pasta was perfect and the branzino was moist and flavorful. Alfredo was an incredible host and I thoroughly enjoyed my dinner solo at the bar. Grazie mille!", "author": "EG B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-24", "description": "Definitely worth the trip across the Brooklyn bridge!Located in quaint neighborhood that is easy to navigate with street parking. The ambiance,  service and food were just right!", "author": "Stacy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "The food here is so good! It is a little bizarre that such a nice restaurant is cash only, but I guess it works for them. AlMar has a rustic feel with heavy wood tables (both two-person and long cafeteria-style) and industrial lighting, and floor-to-ceiling windows so I'll bet a ton of light comes through during the day. I came here for dinner though, so it was more dim and mood lighting-y.\n\nI only got one dish here, the sauteed calf livers ($18) but it was sooo good. The texture was just right, the balsamic vinegar and onions complemented the richness of the liver, and the mashed potatoes were creamy and offset the liver very well. I'm definitely coming back to try their other dishes.", "author": "Jin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-30", "description": "My friends and I came here for Sunday brunch. We had made a reservation for 8 people at 11am. We were seated right away but half of our party was running late, so the staff got pretty annoyed at us. We didn't begin ordering until 11:45am but they kept insisting that next time, we shouldn't sit until our whole party was present because they had other reservations after us (which seemed a little unnecessary because there was plenty of other open tables besides ours).\n\nEveryone at our table got the Egg in a Cloud, except for one who ordered the Smoked Salmon Sandwich. The Egg in a Cloud looked gorgeous and was super fluffy. I devoured mine within minutes. It was filling enough, because I also ordered a drink and I wasn't particularly hungry to begin with. If you're looking for a filling meal after a night of going out, however, this isn't the place for you.\n\nI also got the homemade iced lemonade, which was very interesting. It wasn't terrible - it was just very lemony and more like slightly sweetened lemon juice than lemonade.\n\n3 stars because I liked trying the Egg in a Cloud but I wouldn't recommend my friends to go here. There are many other brunch places where you get the most bang for your buck.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "We had a little tea and chill here. Cash only, which is kind of annoying, but a nice place.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Great brunch! The ambience inside the restaurant has a very cozy feel to it. Limited menu, however, there is something for everyone! My table received the egg toast, egg in a cloud, and homemade pancakes, and I have to say it was all delicious! If you want a more traditional breakfast they even have an old fashioned breakfast with eggs, toast, and meat. Had a great latte and a great experience dining here at AlMar. Just don't forget that it is CASH ONLY! There are ATMs around if you forget.", "author": "Brigid K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Cute restaurant, Great menu choices , reasonable price for delicious food. I must come back :)", "author": "M T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "The food is so delicious and seasonal here. Rustic atmosphere. They only take cash and have an ATM machine. Tons of options for the meat eaters and the vegan/vegetarians alike. Salads are chock full of great stuff- love the string bean salad and the shrimp/corn/avocado salad. At our table, people loved the pork chop, the eggplant parm and a pasta. The food is so fresh! Perfect brunch spot as well. So happy this place is in the neighborhood. Love the black and white movie playing on the wall too ;)", "author": "Liz B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-24", "description": "Super disappointing!\n\nSome friends and I came here for lunch on Monday, and left very unsatisfied. Two of us had the wild shrimp salad, and found the dressing to lack any seasoning or flavor. The texture of the shrimp was also extremely chewy. My other friend got the soup (chestnut that day), and the salmon sandwich. She said the soup was watery, and the sandwich mediocre. \n\nIt's possible we went on an off-day, but would definitely not try it again. That being said, the restaurant is pretty and the service was fine.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "One of my favorite brunch places! I had their sandwich with avocado, egg, and spinach. Even though it was a pretty basic sandwich, it was extremely scrumptious! I also recommend their orange juice. It's very fresh!", "author": "Nini N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "This was absolutely one of the nicest restaurants I've been to in Brooklyn for a celebration dinner. The service was excellent, the appetizers prepared just perfect, cocktails and meal all done to perfection. Our waiter John was so attentive and we had a big group. Even the manager stopped by our table to make sure we had everything we needed. Desserts were all superb!", "author": "Lori D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-05", "description": "Great staff. The food is priced on the heavier side but it was flavorful. Very open floor plan and nice ambience.", "author": "Justin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "Came here for brunch this sun. Had the eggs purgatory (the dish on the right) ....YUM! That sauce was mighty good. The place is cute. I'd go back for sure. The only con is that they do not have any brunch drink specials.", "author": "Kathy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-06", "description": "Came here for a Saturday brunch and while we waited for our food we caught decent size roach crawled across the occupied bench seating along the wall.\n\nThree stars for decent food and service.", "author": "Mai J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-27", "description": "A comfortable place a few blocks from the Brooklyn Bridge Park area. Food was well prepared and decently portioned as well as fairly priced. Service while pleasant was off the mark as our salads did not show up until the entrees were served. As it doesnt take that long to prepare a salad that should be served prior to the main course, and the wait for the food was a bit long, either the server forgot to bring them out in a timely manner or the kitchen didnt prepare them until the entrees were ready. In either case not the right way to serve a meal. The place was not crowded at the time so no excuse for the bad timing.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Wonderful dining experience!  Reasonably priced and absolutely delicious dishes.  The menu has a huge variety of tempting options we everyone loved their food.  A must try and they take reservations too!", "author": "Matt B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "AlMar surprised me. I'm usually not a fan or skeptical of \"New American\" local rustic organic places. The dishes sound good, but come up short of anything very tasty, fresh, and overpriced. Coworkers rave about their coffee ($1.75 strong \u0026 fresh, I've decided) \u0026 food. \n\nAlMar's located in a block of hip DUMBO of shiny storefront corporate windows. But inside, it's filled with rustic furniture, a carefully curated antique so Brooklyn finds. Once you get past that potential pretensioness, you realize that the employees are incredibly nice, there's 2 giant communal tables (which always seem to be filled by families or local companies meeting over lunch), and Most importantly- the food is Excellent! \n\nThe price point is very good for the portions and quality of ingredients. During a brunch meeting, I got the Breakfast Sandwich ($12- eggs were fluffy, the bacon was generously sized, the avocado \u0026 cheese on it was super fresh, \u0026 the brioche bun soft). It came with some mixed greens. I only got through 3/4 of the sandwich.\n\nRecently, had a Literally, 2hr lunch there. I had the 2 Eggs over Polenta ($12). It was a 6\" block of finely milled corn flour (best I've had so far) layered with bits of cheddar, tomato, avocado, and eggs (requested over easy), \u0026 surrounded by a maot of sautéed spinach. Only got through 3/4 of this as well. Awesome, Fresh, Delicious. \n\nI've tried co-worker's Beet \u0026 Goat Cheese Salad, Artichoke Tart, \u0026 Farro Salad with mint. All were great. We ended the meal with a tiramisu (in a martini cup)  \u0026 blueberry panna cotta (in a cup, blue-infused \u0026 some berries on top). Both were def cream-heavy, but tasty \u0026 apparently made in-house as well. \n\nI wouldn't mind trying their panino \u0026 soup Lunch Combo \u0026 apparently they carry Blue Sky Bakery muffins (carrot with flakes coconut in the middle). Get their to-go coffee (although it's a bit if a wait) instead of that Starbucks down the street, please! \n\nGreat place in the neighborhood compared to Dumbo Kitchen, not sure about Superfine. Nice high ceilings, great staff \u0026 cook!", "author": "Joyce C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Yum! I use to work in Dumbo and would always walk past the restaurant. I finally decided to stop in and was not disappointed. Food was delicious. I would recommend and go back if I'm ever in the area", "author": "Laser S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "Excellent pasta and ambience. Love the warm decor and feel of this place. A little in the higher end as far as pricing goes but the food is fresh and delicious and the quantities are pretty generous. Will definitely go back especially for their pesto pasta.", "author": "Trips R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-18", "description": "Great food but unfortunately terrible service. The waiter is arrogant and disrespectful. He gave us a poker face when we just ordered a salad and a main course. (Come on, you don't set minimum charge and you have a menu for people to choose, why we cannot just order less?!) He showed gentle smile to others but not to us. In the end, he threw the dessert menu on our table and arrogantly said \"in case you guys need\". (FYI in case you can see this - no one will order if you throw the menu to them!) Chinese people may not challenge the service a lot b/c of our culture. But don't take people's kindness as granted. We travel and taste. Even we don't, that's not the reason we should be treated differently. \n\nThis kind of snob should never be qualified as a waiter. And any restaurant who tolerate racialist should never worth a try.", "author": "Renee Z."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}