{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-19", "description": "The food is passable/mediocre.  But the main reason this place is so tragic is the ridiculously bad service.  This afternoon I thought I would give them one more try after bad experiences EVERY other time I've gone in.  For lunch I ordered a soup to start and then a panini.  And just as I've come to expect at this place, the soup and sandwich and salad are all brought at once.  Then the waitress disappeared/hung out with the bartender and never came back to check on me once.  As usual I had to flag someone down to bring my check.  Every time I have been there they have either screwed up my order, had attitude, or forgotten about my table in some way.  One time the fire alarm started going off in the middle of dinner.  The waitress said, \"oh we are having trouble with the fire alarm but there is no fire so no need to leave.\" umm..but it is sorta annoying and loud.", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "Great spot for brunch and/or dinner. Fresh food \u0026 flavors. They understand quality meats, vegetables \u0026 herbs. Pastas can be authentic \u0026 innovative. The chef has a great palette. Friendly \u0026 inviting atmosphere -- as the managements \u0026 staff value customers.", "author": "Tina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "Came here for brunch on Labor day morning. I loved the atmosphere of the place, simple and stylish yet casual and down to earth. Love the long wooden table with benches in the middle. I had the egg cloud, which was light and airy and the yolk perfectly runny, and the spinach that it came with was cooked to perfection. Would love to return for dinner and drinks some time.", "author": "Aviva L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "This place has a very at home feel and the people here are so friendly. The breakfast here is good and filling. I definitely recommend if in the area or if looking for something other than a regular diner or chain breakfast place.", "author": "Vanessa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-02", "description": "I took my daughter and 3 of her friends there this week and we thoroughly enjoyed it.  We asked our server to bring a sampling of appetizers and that turned out to be splendid idea.  The star performer was the whipped ricotta, Mascarpone, Parmigiano, walnuts \u0026 honey Crostini although the meatballs were worthy of mention as well.  My daughter had the cavitelli which was wonderful.  Another dish that made a splash was the zucchine pesto lasagna.  I had the short ribs nestled in a bed of polenta.  Just wonderful.  All of the portions were very adequate.  We left with 2 to-go boxes.  Espresso and Tiramisu ended a feast worthy of Nero himself.  The prices were very reasonable (for a NYC restaurant).  I recommend this restaurant most highly.", "author": "Mario R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "The space has a very rustic, informal feel which blends in perfectly with the neighborhood. Everything we ordered from the shrimp cocktail, to the ribeye, to the chocolate mouse was very fresh and delicious. The portion sizes were a little on the small side but overall we really enjoyed it. The old movies projected on one of the far walls was a nice touch.", "author": "Phil G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-19", "description": "What a wonderful dining experience. The food is super. The service is great and the atmosphere is very cool. Don't  miss this restaurant. It's rustic and cozy, has a great bar and shows felini films in the background. You will be pleasantly surprised.", "author": "Rita M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "the food was great! the appetizer was amaaaazing!!! have the ricotta bruchetta. u will not regret. Creamy, fresh ricotta on crusty, Italian bread with a bit of honey on top, tons of shaved parmigiana and a drizzle of truffle oil to top it off. So delicious. Still craving it months later. For main course had the rabbit with the polenta and peas. the rabbit was perfect, moist, and not tough. the polenta was a tad lumpy and could have used a bit of pepper. My's friend ordered the salmon with a citrus salad. Yummy salmon just a bit undercooked. the drinks were spot on, balanced and not watered down. Great atmosphere and great staff. Just wished they accepted debit/credit cards. CASH ONLY so a little inconvenient. But really great place to share with friends, family, or a date. Went in the summer and def need to go back.", "author": "Ellyse S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-27", "description": "Very good food (chef from Noodle Pudding), but service is very spotty... House wine not good.", "author": "Peter H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "I am a very picky eater, but I can't say one negative thing about AlMar. It is the best local spot in Dumbo that I have been able to find. I seriously love it. I could eat their Kale salad for breakfast lunch and dinner, I'm not kidding. Even though they are cash only and it takes a few extra minutes to get certain things like Eggs In a Cloud, it is totally worth it. Every dish I have had at AlMar leaves me wanting to come back for more. There lunch menu is awesome, and its great that they have a totally different dinner menu because that means I can come back for seconds. Each server, bar tender, and hostess is so nice and helpful! I really love this place and would recommend it to every local! Just remember to bring cash, but if not they have an ATM in the back which is very convenient! I'm not sure why people complain about it being cash only, this is New York people everywhere is cash only! Thats what makes the city so different. Anyways, enjoy!!", "author": "Jazmine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "Went here for dinner with 3 couples.  Great crostini and apps and we all enjoyed our dinner.  Wine list not particularly good but great mixed drinks.  Will definitely go back.", "author": "Karen E."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}