{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Such a cute restaurant. I had the Mezzi Rigatoni - a tomato/cream based, sausage and peas dish. SO good. The menu is a bit small so check it before you go. However, the food did not disappoint! Be aware - not sure if it was a mistake or common practice - but I was charged for each of my soda refills. I would definitely recommend and return in the future.", "author": "Courtney M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-27", "description": "Went for lunch, menu is very limited as it is and the bruschetta was not available. Drink menu limited also.  I Am sorry but I couldn't get past the smell of the place, especially by the back area by the bathroom. I am into the industrial look but not the smell.", "author": "J M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "Found this place when looking for brunch in Dumbo! I had friends from outta town and we were looking for something a little less expensive to eat at. Luckily, I read ALMar's menu and they have super reasonable prices. We gave it a shot and the place was busy but not completely full so we were able to grab seats at the long communal table. My friend and I both got the Almar breakfast sandwich ($12) with a side of roasted potatoes ($5) and my other friend got a brunch special pork sandwich. I really wanted to try the Egg Cloud sandwich but was told it would take 20 minutes to make and I was too hungry and in rush to wait that long. Looks super yummy and will go back for that! Our meals arrived and we all really enjoyed them. We wish there were more condiment items for the food other than ketchup and hot sauce. I would've preferred a sriracha or spicy mayo for the potatoes and sandwich and my friend who ordered the pork sandwich really wanted some bbq sauce. Overall delicious meals and i'll definitely be back.\nThings to work on:\nService could be a little quicker - we had to wait awhile for the waitress to pickup the check. We also waited a fair bit before anyone brought us the bottle of water after we sat. \nTLDR:\nCome here for a great, filling meal in DUMBO that won't break the bank. Sit down, table service with a relaxing environment!", "author": "Julia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-17", "description": "Super cute atmoshpere and good food at a reasonable price (especially for Dumbo). It get's packed for a reason ..especially at brunch! Attentive server and efficient service. I would definetly go back.", "author": "Stephi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "**CASH ONLY**\n\nMe and my friend just got done eating a lobster roll near the water area and were walking back to our place when we stumbled upon the hole in the wall.\n\nWe were still hungry so we decided to stop in. When you come inside it is a rustic dark feel. They also had a old twilight show on the wall playing. Very unique!\n\nI started off with the italian lemondae cocktail (gin based). It was good, not too strong or sweet. ust enough to get a good buzz on. My friend had ordered the spritz. It was kind of too sweet for us since it is prosecco based. But the presentation was great!\n\nThey give you sourdough bread with olive oil to much on. I liked how our server even asked us if we wanted more haha.\n\nFor my main course I went with the tagliatelle bolognese with boar i believe. It was good. \n\nMy friend got a pesto pasta with shrimp. Hers was much better than mines. \n\nThe only reason why I am knocking off a star is because I felt like my server was not happy every time he came over to us. We got the feeling he either hated his job or he felt that we did not have money to give a good tip.", "author": "Erika M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "My group came in for a late lunch after a walking tour.  We were a group of 9. We were taken to a long table that seats 12.  There were 4 people already at the table. Just when we were seating ourselves down the floor manager told us he forgot there was a reservation for 15 people and they needed that table.  What didn't make sense was there was only 8 seats there.  \n\nAnyhow we ended up seating at that table because what the floor manager said didn't make sense.  And they didn't chase us away.  So fast forward and it's now about 10 minutes later, a waitress came with table settings for our group. We told her to hold off since we weren't sure and were awaiting the floor manager to let us know if we could sit there.   The waitress told us the party of 15 was most likely no show since they have passed the 15 minutes mark.  Doing math, I guess the reservation was at 2 and it was by then almost 2:25 pm. \n\nNow onto the dining experience.  The service was SUPER slow.  The food, when it arrived, was delicious.  We each ordered a different dish and everyone was happy.  I had ordered egg purgatory with someone Des of bacon.  When I didn't see the bacon come out with the dishes I asked the waiter who told me it would be coming out since we got our dishes. He never checked the kitchen (something I would have done as a server) about the order. When I was almost done with my dish, I flagged him down again and told him I want to cancel the bacon since I'm almost done with my meal. I wanted to eat the bacon with my eggs and toast. He seemed surprised they I did not get the bacon. He did t check for me or with me after my first inquiry. This time he just said he had put in the order.  A few minutes later he brought me my bacon. It was delicious but I had to eat it by itself since I've finished my eggs and toast. M\n\nThey need to work on organization and expedition of the food.   Minus one star.  \n\nThe other issue was they only have ONE bathroom. YES. A big place with Ine unisex bathroom. There is always a long line of 2-5 people waiting. Thank goodness the waiting area is huge. We all wonder why, with all the space (and there were 3 other \"rooms\" in the space, why only one bathroom. That's really a big planning.   Minus another star.", "author": "Stella A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "This is a very cool hip brunch spot in Dumbo. We went there with another couple and all of us enjoyed our dishes. The dishes vary from very basic to kind of fancy. Don't worry, you can order anything here and it will be good. The drinks are quite expensive but also good. We mostly had bloody Mary's and enjoyed them. Service is great, and atmosphere is very nice. This is a winner!", "author": "Lara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "After walking across the brooklyn bridge on a coldish grey day I wanted to warm up. So the thought of grabbing a bagel and eating on the run wouldn't do. We happened to be close to this spot and it had good reviews so I talked (griped) my husband into it.\n\nThe panini was good and the rigatoni was excellent. Exactly what I needed. \n\nOne toilet for the entire restaurant was a bit crazy however.", "author": "J. G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "My husband and I ate dinner at AlMar last night and enjoyed the ambience, the food and the gracious service immensely. We especially appreciated the friendliness and attention of our server, Lena, who was very attentive and accommodating. Thank you for the wonderful experience. Joan and Reg Lankford, Olympia, WA.", "author": "Joan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "Al Mar\nNY BK DUMBO\n9pm Tuesday 15th November 2016\nFour-ish Stars\n\nThey have the best chalkboard artist in town. We sat at the bar on this relatively quiet Tuesday evening. The dumbo cocktail had rye, Orange, and bitters. It was served in a taller rocks glass with three cold draft ice cubes. The drink was well balanced. For food: Tiff had scallops and mussels and I had the Rabbit Ragu. The food was solid but could have been better. The scallops were cooked perfectly with golden brown seat and layers of textural differences. The mussels were plentiful but had a bit of funk on them. The toasted version of their bread was infinitely better. The rabbit was a bit dry and the pasta was very al dents but I enjoyed it. The service was attentive but not suffocating. It is a bit pricey and it's CASH ONLY which they write on everything.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "This place has a great vibe and the food is good. I got a shrimp salad and my husband got pasta. I think he said it was good but not mindblowing. It's a great place for a coffee or a meet up with someone. I don't know if I'd go out of my way to go here but it's a great spot if you stumble upon it.", "author": "Kerry K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "Came here for brunch on a Saturday with a group of girls and we definitely enjoyed ourselves.\n\nNOTE: CASH ONLY!! There is an ATM inside but not sure what they charge.\n\nRESERVATIONS: Called 2 days in advance for a party of 10 for brunch on a Saturday and was able to make a reservation easily.  \n\nATMOSPHERE: The location couldn't be better, it's in DUMBO but located almost right in front of the famous Washington Street Manhattan bridge shot where two buildings frame the bridge and then through the bridge is the Empire State building.  Great for taking pictures beforehand or afterwards.\n\nThe inside is intimate, a bar to the left, lots of natural light and wooden tables with a movie being projected on the screen in the back.  It had a long table for the 10 of us and they also have a large table in the back that another group could fit at.  Definitely a cute place for brunch.  It has more of a dark/rustic vibe than a clean/minimalist/trendy vibe.\n\nFOOD: Their famous thing is the eggs in a cloud.  I felt that there were mixed reviews at the table, one the one hand it looks very cute and picture worthy but one girl said it was a little too \"light\" since the egg whites are whipped.  The portions here are not HUGE but not super small either and most dishes are under $13, which is good.\n\nKALE SALAD - trying to eat healthy I opted for a kale salad and added chicken.  Although there is no option to add meat you can if they have it on the menu (for example, they have a chicken panini so I was able to add it).  The salad was good because it had shavings of pecorino cheese which gave it a nice salty taste.  The dressing was light, but tasty and the chicken wasn't bad.  It's not the best kale salad but good to know they have options for those not eating carbs.\n\nOther dishes that looked good was the breakfast sandwich and the traditional old fashioned breakfast plate.\n\nOverall, a great pick for a Saturday brunch with a group of girls.", "author": "Brittany T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "I've dined here many times...this review is long overdue! I love everything on the menu and you will too... best Italian I've ever eaten. So yummy", "author": "Tamara E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "Attended a wedding reception here and found the location convenient to the boardwalk and shopping while the setting was intimate and comfortable. Staff was friendly and attentive. Food was alright, nothing special. Would recommend to others to give it a try. It's easy to get an Uber here. Not easy to get a taxi.", "author": "Blair M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "A nice choice for brunch in dumbo area! Love the slow feeling in this place with old movies, green plants and colorful food! Must try the egg cloud, very cute and specious texture!", "author": "Effie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-26", "description": "Like the other reviews, I must caution this is CASH ONLY. Not a criticism just know before you go. \n\nWe happened upon Almar at an odd time - 3ish on a Sunday. They were still serving brunch and were able to get a seat right away.  The menu is simple but interesting. Pete got a porketta panini with broccoli rabe and I got a kale salad. We each asked for mozzarella to be substituted for the cheese our dish came with. This request was accommodated by the waitress and kitchen without issue.\n\nThe food was tasty with clean, fresh flavors. The panini's bread was soft and chewy in the best way. The broccoli rabe was so perfect and complimented the pork. The kale was crunchy and cut into thin strips to make it palatable. \n\nLots to like here.", "author": "Gigi A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-16", "description": "Meh is about right. Same old menu. The only thing that has really changed over the past 5 years is the prices. Yes, they have gone up a lot. And yet, nothing has changed with the food quantity (about normal), and quality (so so on a good day). The good about Almar is found in the help. Extremely friendly and nice guys behind the bar and on the floor. They really seem to go out of their way especially if you are a regular. Food, particularly breakfast is kind of a scam. They advertise thick cut bacon but that's not true. Oscar Meyer at best. I will say the breakfast potatoes are really good. Lunch is nothing for nothing and dinner can be hit or miss. Dinner can be really disappointing. They advertise a rib eye steak for $55 but when it gets to your table it is pre-sliced and frequently a far cheaper cut. Pasta is uninspiring, wine list seems to promote their in house label (always a sign of gross overreach by the house and the Almar label goes out of its way to make you feel like a sucker for having been sold this thin tasteless fruit juice dressed up in a wine bottle with misleading label). Owners have their favorites and treat everyone else pretty poorly. Sloppily dressed and extremely unfriendly. Oh, and what is with the one smelly dark bathroom in the back right off the kitchen? Sewer flies galore in the summer, unmistakable odor of sewage all year round. As nice as the employees can be, and they are really nice people, I'd avoid this place as there are so many better Brooklyn eateries, especially Italian.", "author": "Murray R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-13", "description": "The service was great and very attentive. After we placed our dinner order bread was brought out. Atmosphere is nothing to rave about. I ordered the east coast codd and a side mixed green salad instead of the green beans. The fish was good, tasted fresh. The salad was placed on the same plate as the codd and was soaked with oil to the point that even the fish was swimming in oil.", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Updating my previous review for service and food quality during our (4 of us) second brunch trip.  15 minutes after placing the table's order our waitress came by the table to let us know that the kitchen was out of roast beef and that one of us would need to choose another option.  We did, but in the end the wait for the food was just not worth it.  Three of the dishes looked and tasted like they had been sitting under a heat lamp for the 15 min it took to make the new dish.\n\nThe staff does not seem to know the menu very well and provided incorrect information about menu items, of which we did not realize until our dishes were served and it was too late.  \n\nThis place is in a great spot which is why they will continue to be busy, but the service/quality and cash-only requirements are major hits to Almar as a whole.", "author": "Jen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "What a nice surprise !!!\n\nGreat recommendation and choice on wine\n\nHad a saffron rice risotto cake dusk with two sunny side eggs on top for lunch - very tasty \n\nNice vibe and helpful staff", "author": "Jon B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}