{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Alfredo and Marcello are great hosts, the place is really cool, the food (from the bruschettas, to the pastas, to the rabbit and the mussels... my god) and the wine selection is outstanding. \nThe portions are even too big and well priced.\nJUST GORGEOUS!", "author": "Italian D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "We've eaten here twice in 3 days.\nThe food was fresh, flavorful \u0026 well priced. The hostess \u0026 waiters are friendly\n\u0026 attentive.  The spinach ricotta lasagna,\npasta with veal \u0026 onion ragu, kale \u0026 potato soup as well as just the mixed green salad we're all very good. I'll definitely return.", "author": "Emme S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "Without a doubt my favorite restaurant in Brooklyn. Every time I go I try something new and I'm always impressed. The service is great and the restaurant has character, lovely ambiance. \nThey only accept cash but that's never been an inconvenience considering they have their own ATM in the restaurant (by the restrooms). \nSide note: It's also a short walk from the Fulton Ferry Landing Pier. Take a lovely walk through the cobblestone streets to the pier where you'll find a gorgeous  Manhattan skyline view. It's one of my favorite spots to visit when I come the city :)I", "author": "Karissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-27", "description": "A few years back, I had a great Americano at DUMBO General Store.  Fast forward to 2013 and Almar is in its place.  This isn't a complaint.  We had a delightful dinner there just a couple weeks ago before making our way to Galapagos Art Space.  It may be a warehouse-like open space much like the other restaurants, stores and event venues in the neighborhood but it embodies a certain warmth which the friendly servers exuded as well.\n\nWe had had a sumptuous brunch earlier in the day but were hungry enough to enjoy a proper dinner after a long walk.  I ordered a very satisfactory lasagna that had a creamy sauce and was chock full of ricotta and spinach.  \n\nI hadn't been to DUMBO in a few years but would definitely return to AlMar, if I'm in the area.  \n\nSIDE NOTE: I am still dying to try ReBar but given that they host four weddings each week on average (and have been in the middle of such every time I have ever attempted to go there), I'm not sure when that will happen.  I am determined though!", "author": "Caroline B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Definitely love their dinner menu with interesting desserts. Lunch options are decent but mostly are sandwiches. Their food is always so fresh and taste good. \n\nThe only complain is Cash Only. But if that brings down the price, I wouldn't complain.", "author": "Teddy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "The food was very good and the ambiance was there as well. Came here for a quiet dinner before a show in BK.", "author": "Victoria M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-16", "description": "IMPORTANT FIRST NOTE: they only take cash!!!\n\nFood was excellent and there wasn't anything not to love, I got the seafood cavatelli and it was out of the park. SOOO delicious. The Octopus appetizer was also delicious and has me skeptical but was out of this world. Can't believe I am saying it was delicious! Must get the tiramisu, and you will settle down in heaven.\n\nThey take reservations and accommodate big parties, though sometimes they may ask your party to order family style, depending on how busy the restaurant is.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "I love hyperboles, but it's no exaggeration when I say the food came out incredibly fast. Everyone in our party of 5. Hot and delish. And the waiter was a super cool dude. Only reason I don't give it five is because it's cash only, which is sort of lame.", "author": "Felina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "I came here for a coffee and for lunch on the same day. This place is a hot spot for those in need of a good simple and quick lunch. The place seems to most often be jammed for lunch. The barista/bartender was very friendly and I would not hesitate to come back. I had the mozzarella pannini.. Very tasty, fresh with great bread.", "author": "Israel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "The salad I had was quite tasty, and the veggie sandwich my friend got was fucking stellar. Amazing bread here, so I seriously recommend getting something that includes it. Their coffee was quite good too!", "author": "Mo K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "A nice place for a quick brunch or breakfast as well as a good place to relax, chill with friends/family. The menu was small,precise and that helped us order quickly as we were very hungry when we reached there. Our server was very cordial and gracious. The food quality and quantity was both very very good. Would definitely recommend.", "author": "Mrunmayee K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "I come here about once per week for lunch. The lunch menu has soups, salads, paninis, and other larger dishes. \n\nWith some items, you can get a full order or half. For instance, I usually go with two half paninis, which the also serve with a small side salad. \n\nI've tried their BLT panini and pork sandwich. Both are must-tries. The portion is just right and they taste great. \n\nThere is almost never a wait. The interior feels very large because it has large mirrors on the walls in addition to the glass wall entrance. \n\nThe thing I hate most about this place is that it doesn't accept credit cards -- CASH ONLY!!", "author": "Simon Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "Great food! It was a bit loud inside but not too terrible. Strolled in on a Sunday around 2/230 and there was a 10-15 minute wait. Not a fan of the coffee here but the omelette special of the day was good and the Panino Di Verdura was amazing. Super fresh ingredients--you can really taste the difference. Would definitely recommend the sandwiches here.", "author": "Tansy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-01", "description": "Almar is a quaint Italian restaurant amdist the cobble streets of Dumbo that I discovered with a few other Yelpers randomly one evening. \n\nEven though we showed up really late following a YEE (Yelp elite event for any newbs) they welcomed us in... Yaye they accepted our cult! \n\nWe got a bottle of red wine (why wouldn't we even though we had just had 10 free cocktails earlier) and in true Italian fashion, I had me some spaghetti with a marinara pepper sauce and lamb meatballs.\n\nSo good. If I can ever find my way back here (cause let's face it, I can get lost in Dumbo quite easily), I will definitely stop in for a bite and some vino!", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-15", "description": "Went there for lunch, ordered off their specials. Ordered a burger......was told there were no buns. Ok never mind.  Asked for the buffalo mozzarella bruschetta ......was told there's no buffalo mozzarella at the moment.....boyfriend ordered sandwich and asked for no pesto cause he's allergic. They brought it with pesto.", "author": "Alex F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "As I was conjuring up this review in my head, I immediately thought: \"How many more times can I write about mood-setting ambient lighting, comforting dark wood furniture, and a warm and inviting atmosphere?\"\n\nI need some new material, folks, or perhaps a new thesaurus.\n\nThose aforementioned describing terms? Yep. That's AlMar, plus a long communal table in the center and old movies been screened one blank wall. (Caprese salad and Cary Grant go hand and hand, after all.)\n\nFirst off, their ricotta, marscapone, walnut, Parmesan, and honey crostini is almost indescribable, but I'll try my damnedest: it was pillowy, tart, sweet, and salty all at once, with the perfectly toasted bread providing a final punch of toothsomeness. It was unbridled culinary perfection.\n\n(Hello, thesaurus.)\n\nMy friend had a vegetable lasagna plate, while I went for the large caprese salad. She enjoyed her meal, though the portion was a bit small for the $14 price tag. My salad was great, with perfect buffalo mozzarella chunks and tangy heirloom tomatoes. They went a little heavier on the lettuce than I would have preferred; the few strands of basil were too few in comparison. \n\nMy friend got the AlMar Margarita, and I bogarted what I could. She made a good decision. Tasty and refreshing. \n\nI would love to come back, if only for the crostini and a drink. Their brunch menu looks promising as well  I always forget how close in proximity DUMBO is to the A Train, my most convenient travel option from Upstate Manhattan. I have no excuses now. After all, where else will I find a place with mood-setting ambient lighting, comforting dark wood furniture, and a warm and inviting atmosphere? (Hmmmm...)", "author": "Allison C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-20", "description": "We went to AlMar for brunch, and were (sadly) disappointed in both the food and the pricing. Bloody Mary's were good - a nice kick, but not overpowering - but were about half the size of a traditional one and double the price. After seeing that the bartender used rail vodka for the drink, I'm really not impressed by the $12 per drink price tag. \n\nWe all had variations of egg/sauteed spinach/smoked salmon dishes. None were particularly inventive, and my friend's $16 special was literally 2 eggs over easy on top of sauteed spinach. \n\nFinally, they only accept cash, which I think is pretty ridiculous for a large, well-known restaurant in Dumbo.", "author": "Claire D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Went on a double date at around 2:30pm and got myself the Linguine with pesto ($14). It was wonderful, except maybe a little salty! All in all, the environment was very rustic, everyone enjoyed their food (one got brunch, another got grilled chicken and the last got a meatball sandwich).", "author": "A M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "As a Dumbo resident for the past 10 years, Almar has been my favorite restaurant in the area. They've always presented consistent well-seasoned food in a warm rustic environment.  Some of my favorite dishes include their steaks and fish. If you're craving some carbs, their pastas never disappoint.  Sadly, my family and I will be moving from the area soon. If we ever visit, I'll be sure to drop in to satisfy my dinner cravings and top off with an affogato!", "author": "Raymond C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-09", "description": "Phe-no-me-nal fresh pork sandwich and they don't do fries, but the fingerling potatoes side was super delicious. Decent service and breakfast is served all day. \n\nExcellent choice for lunch. Coming back soon for the pork sandwich...\n\nCash only.", "author": "Shu Jin S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}