{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-27", "description": "I've been here twice now, and it's a real stand out for lunch time in DUMBO. Today I got the pork sandwich. It's got slow roasted (10 hour) pork, which is very tender with a pleasant hint of fat. To add some zest to it, the sandwich has pepperoncinis, red pepper and capers. It's served on a crisp artisanal roll, with a side of salad (read: lettuce). The ambiance is rustic, hip and cozy. A nice combination. And at $11, it won't hurt your wallet.", "author": "Ian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "We were here for dinner a couple of days ago, and enjoyed the food very much.  We live in the area and AlMar is a nice staple.  The drinks are well made, and the dinner menu is solid.  We had the marinated anchovies crostini, tuna tartare crostini, grilled octopus, seared tuna steak and eggplant parmigiana.  The entire experience was pleasant, and we will be coming back.  While Josh (our server for the evening) was fantastic, as was everyone else (bartender, manager, etc.), we do have to note that one particular male server (white guy) for the night detracted from the experience.  The guy practically did an eye roll when we asked for water and it wasn't in his area of coverage, noting that Josh was our server.  Don't be in the service industry if you're going to eye roll customers who are simply asking for water.  This 4 star review does not take this guy into account, but if we were to keep getting served by this guy, this would not be a 4 star review.", "author": "Mika L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "I have watched this resto go from Mexican to American and now finally Italian. And boy did Dumbo need a good Italian restaurant. It came under new management in the spring and I've been there a few times since then and witnessed changes in decor and staff. There were a couple of times when the service was a bit on the slow side, but the last time I was there, not only was the food amazing, the service and staff were fantastic. It was like a 180. I also noticed a new new sign outside Almar changed from Dumbo General Store. The cheese and meat platter is always good, but this is the case in many good New York restaurants. What got me hooked were the crostinisor bruschettas. There was only with ricotta,mascarpone, honey, walnuts. It was to die for. There was a bean salad that was super refreshing and delicious, yet felt healthy. Finally the braised lamb shanks~they melted in my mouth like butter. I was never much a fan of lamb because of it's super strong meaty flavors, but this one was braised and marinated to perfection. Super tender, juicy with a mini-explosion of all the right complex flavors on my palate. My friend said she was having a \"food moment\" during the meal, the best one I've had to date at that location, better than the dry paninis at Dumbo General, and better than the too cheesy enchiladas when it was a Mexican joint. I think this place has finally found the right chef and management and I hope it stays as good as it was the last time I was there.", "author": "Jade P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "If you think Italian food in little Italy is amazing well guess again! It is at al mar! Marcello and Alfredo has made a new home for me! You must indulge yourself in the crostinis, the short ribs and I kid you not, even the regular pasta dish will blow your mind away! You must go there!", "author": "Zee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-29", "description": "Setting is nice, food is really good and fresh!!!", "author": "J R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-28", "description": "Nice place for brunch! Latte is so good", "author": "Tiantian X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-06", "description": "A welcome addition to the  DUMBO food scene. Have been three times, and this last time was the best so far -- they are really finding their way.\nThe space is very comfortable, the service was terrific and the food - surprisingly, actually - was top notch. We gobbled it up - yummy arugula salad with fennel and orange, unbelievable good grilled octopus, pasta with rabbit ragu and salmon. Really, really good.\nTonight was a Thursday, we went early, and the place was laid back, only about 1/3 or 1/2 full. They had old Fellini films silently projected on the wall - great vibe.\nThe wine is great if you know what to order. I almost don't want to write a good review because I don't want the place to get too crowded... but i do want the restaurant to succeed and become a solid local standby that thrives and keeps the bar high. So please, AL Mar, keep that bar high!! Your good efforts are much appreciated and we will continue to dine at your lovely restaurant.", "author": "Julie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "This was a nice little Italian place. The service was attentive and nice.  The ambience was casual and one conducive to conversation.  The food was tasty but not mind blowing. Really a 3.5 star place if yelp allowed it.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-30", "description": "Very surprised last night when my boyfriend and I tried to have dinner at Almar after Dumbo Arts Festival. We are an interracial couple and the hostess told us we would have to wait 2 hours before we could be seated. We were shocked as the place was half empty. She told us she had not been able to clean all the empty tables yet. Then two Asian girls asked to be seated and my boyfriend heard the hostess tell them it would be 20mins. I asked the Asian girls to confirm and yes they were only given a 20min wait time. I confronted the hostess who started to lose her words as she could not come up with a valid excuse, then I asked to see Mr. Almar himself who basically told us to deal with it. I guess the hostess was following his direction. Don't seat blacks! For the first time I now know what Josephine Baker felt like when she tried to eat in a NY restaurant that didn't serve blacks.", "author": "Nicoli S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-19", "description": "My husband and I are regulars at Noodle Pudding, a favorite neighborhood Italian joint, so we were excited to try Al Mar, which was opened by the old chef and manager at Noodle Pudding. We ate early on a Saturday night at the new copper bar. I can't comment on the table service but the bartender was super friendly and attentive. \n\nOn to the food. I can honestly say I was blown away. I was expecting it to be good, since I've had the chef's food before, but it surpassed my expectations. We started with an heirloom tomato salad and crostini with fresh ricotta and truffle honey. The crostini was creamy, earthy, slightly sweet from the honey and downright indulgent. \n\nFor entrees we had a squid ink pasta with shellfish and montauk bass with couscous and grape tomatoes. I was a little hesitant with ordering the pasta with shellfish because I usually find that when there are numerous kinds of shellfish in a dish, one or more of the seafoods are over cooked. This was not the case with this version. The shrimp, mussels, scallops, etc were all cooked perfectly. Successful dish. But my favorite was the bass. Super, super fresh and cooked absolutely beautifully. The couscous salad was a fresh and lovely accompaniment on a warm summer night. Really couldn't have been happier with it. \n\nThe space is a little 'raw' - it probably was originally a factory or warehouse- but the meal was so delicious and comforting that it's makes up for any lack of warmth that the space provides. \n\nCan't wait to go back!!", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "We went here for my birthday dinner based on the Yelp reviews and they definitely did not disappoint.  We made reservations for 7:30 and got there a little early so we decided to have a couple of drinks at the bar first instead of rushing to eat.  We were having such a nice time at the bar that we asked if we could just eat there instead of at a table and they said \"no problem at all enjoy\" so we did.  Very accommodating. Now on to the food.  The meat and cheese selection that we did was beyond delicious.  We savored every bite before moving on to the beet salad.  Let me tell you.  Those were some of the most delicious beets we've ever had.  Plump and full of flavor.  Our main dishes were really good too.  I had the cavatelli with the seafood.  OMG.  Defreakinglicious! And no shells to deal with which I was totally prepared to deal with when I ordered a dish with clams and mussels in it.  Did I mention the olive oil we got with our bread??  Yum!  Ok I'm done ranting go check it out, you'll be amazed.  Can't wait to go back.  Just don't forget it's cash only but not to worry there's a Chase Bank like 2 blocks away :-)", "author": "Stephen A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-11", "description": "This place is a BIG disappointment! After waiting for 45 minutes, and constantly checking if the food was coming, left before the food got served. I ordered \" egg on a cloud\" and Mozzarella caprice, thought it shouldn't take too long. I was wrong ! 30 minutes after waiting I cancelled my appetizer. The waiter acknowledged that it did take too long, but was not too concerned. 15 minutes later my food still didn't come, although everybody else who came after was served. I ended up canceling my whole order. The manager wasn't anywhere to be found or simply didn't know what was going on in his place. Skip the aggravation and go to a place with a better customer service, plenty of options around there.", "author": "Tran R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-12", "description": "This place looked very inviting while walking in DUMBO searching for a good place to eat. I liked the ambiance, very comfortable and not overwhelming. We were seated promptly and I noticed that the bottom of the menu says \"cash only.\" So there is a warning, but it's easy to miss. Also, since it isn't 1822, it is dumb to take only cash. I'll send then a letter via Pony Express complaining about it.\nFortunately they have modern cooking appliances despite not having basic monetary hardware. So we started with a salad with goat cheese, beets, orange and nuts. It was really excellent. Just some olive oil, citrus (orange perhaps) and salt, no goopy dressing to dominate the other flavors.\nThe pleasant waiter suggested a wine for me which was delicious and paired well with the cheese in the dish.\nNext we had the bruschette with buffalo cheese and honey. Another winner. The salty cheese was complemented by just a bit of honey sweetness. The bread was good and also soft, it made it easy to eat without everything falling off the bread. \nNow lets get to why it was just 3 stars...\nMy wife and I was splitting each dish and asked that the bruschette come first, then our next dish, which was quail wrapped in prosciutto. This took forever. Not the waiters fault I'm sure, but it was perhaps 25 or 30 minutes between finishing the bruschette entirely and the quail. They knew it was coming, not sure why it took so long.\nThe quail had about 1 inch thick or so of prosciutto around it. It was also stuffed with cheese. The first bite was pretty good, but the salt became overwhelming after the second bite. The prosciutto around the quail was bigger than the quail meat and was the only thing I could taste, might as well not even had quail inside. It was hard on the outside too, difficult to cut and once causing the quail meat to squirt out of the meat shell and onto the table. It should be like a piece or two of prosciutto, but this was like 20 pieces.\nConsidering how good the first to dishes were, I will try it again, but it was a bit disappointing the first time. In any case, avoid the quail", "author": "Jordan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-31", "description": "I can't speak to the brunch, as I've never been (saw some so-so reviews below), but we've gone here many times for dinner and it's always really really! good. This is hands down the best food in Dumbo. Whenever we have guests in town we take them here and it's always a hit. I've never had a problem with the service, but I guess I'm also used to the mellow-take-your-time-we-think-we're-in-France Brooklyn service (which, admittedly, does sometimes irk me) but it's what all the service here is like, frankly, so I wouldn't consider it a con for this restaurant in particular. And the (owners?) do tend to come around and check in, which is nice and adds a homey touch.", "author": "Nyc M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-11", "description": "FOOD POISONING!!!!!\n\nIt was my first time at AlMar. I ordered the lasagne bolognese while my two other friends ordered chicken. After 20 minutes of waiting for our food, our waiter apologized and assured us that our dinner would be out shortly. When I tasted my lasagne I noticed that it tasted a little \"different\", I figured it's probably because it's a three meat lasagne and I havent been here before so it's probably just me. I should stuck to my gut and realized that the food was not well prepared. The next day I woke up to horrible joint pains and abdominal cramps, a few hours into my saturday, I was puking and well you know the rest of what happens. It's now Monday, and I'm still sick with a migraine headache and pit stops to the toilet every 10-15 minutes. I decided to call the restaurant and speak to the manager who told me that at least 50 people ordered the lasagne and I received my meat from the same batch (ew? there's a batch of mixed meat laying in the back??) so I informed him that I didnt eat anything before hand or after visiting almar and of the funny taste from the lasagne. He apologized and offered me free dinner but I don't think I ever want to eat here again. \nAs for a review of the rest of the place: \nThe hostess was not pleasant at all - she had a serious attitude problem, this should have been my indication to run while I had the chance \nOur waiter was nice and attentive but not overly attentive \nThe place is Cash ONLY~ if I paid with my amex I definitely would've disputed this charge. \nThere is only one restroom- I went to use it and a man was peeing with the door ajar - disgusting** \nThe ambiance is nice- dimly lit, ok decor- seriously nothing special for its location \nThe rest of the menu was nothing special either. For dessert we ordered the Tiramisu which was served out of a martini glass, but it looked and tasted like it came out of a pre-made carton. \nSo all in all, the food poisioning was not worth it. I wouldnt give this place a second chance, even though they offered me a free meal to make up for the poisioning.", "author": "Liz N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-03", "description": "Walked from the Heights on a freezing , cold snowy Saturday night . Friends from NJ and our two children. Loved our waiter, very friendly , gave great recommendations and helped with our beer choices and food for picky seven year olds. Very generous portions, everything we had was delicious. The gnocchi with short rib ragut was perfect, calamari tender, lasagna so yummy . Only issue- we were seated near the door, asked if there were any other tables, hostess not very sympathetic, so my husband was freezing the whole meal, while the rest of us were just  \"cold!\" Love the atmosphere but I think a \"double door\" would be a great asset to this lovely restaurant .", "author": "Pamela D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-14", "description": "prosciutto panini was amazing.  had this and a half salad for lunch.  will definitely come back again when I'm in town.", "author": "Monique B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "This restaurant is situated In a Fantastic spot in the heart of dumbo on a thriving block. Nice atmosphere, open with loads of window light, and giant mirrors. There's also the communal table which I appreciate. The food was outstanding, delicious and fresh, and presented with great care. You can always tell when a chef takes pride in their food, and it shines through here. The lasagne is superb, and the pulled pork sandwich is to die for, oh and their gelato**. Family friendly, or a good spot for a date. I hear they also cater private events. I highly recommend this Brooklyn joint. It's a classic, and I believe it will be around for a very long time.", "author": "Susan E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-09", "description": "We came here one night and because the wait was an hour and we had a show to catch at Galapagos, we went to Grimaldi's instead (yes, the wait was shorter at Grimaldi's)...so finally we made reservations to eat here before another show at the Galapagos.  We got there a little late but even though our table was ready, the waitress told us to wait at the bar...and finally, after 5-10 minutes, we got seated.  Then, we waited forever to get our food...probably 20 minutes.  Because we only had an hour before the show, we only ordered an entree.  We got the duck and pork chops.  They tried too hard with the pork chop - gravy instead, breaded....everything was just overwhelming!  The duck did not have much taste.  Perhaps if we had the much-raved appetizers, we might have had a better experience...unfortunately the slow service forbade us from ordering more food....", "author": "Stan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-21", "description": "This place was amazing! Romantic, but also can be good for the family. Service was great, pasta was absolutely amazing. Have the pasta! I'd like to come for brunch.", "author": "Tai L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}