{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "Food is mediocrity and price, definitely I'm not recommend these place really bad service and racist.", "author": "Rosa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-21", "description": "I came here for convenience of being in DUMBO to satisfy some friends who were visiting (and had to walk the bridge). I did not come here for such a delightful brunch time.\n\nThis place is spectacular because of its:\n- sweet staff\n- glorious Bloody Mary, extra spicy \n- Egg Toast, which is not as well known as the Egg on a Cloud but it is equally heavenly with the truffle oil and golden egg yolks and fontina cheese. Amaze.\n- movie that plays on the wall to help you forget the previous week's stress along with rainymood worthy back ground noise that's the perfect amount of dish clinking and laughter \n\nSuch a sweet place for brunch on a sunny day with clear sky and possible non-voluntary walk on Brooklyn Bridge. Make sure to stay to your left and not get hit by the bicyclists.\n\n\n*shout out to the Egg Toast again because I recommend 10/10.", "author": "Joanne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-28", "description": "We had breakfast here at 1030 on a Friday. It was a nice atmosphere but it seemed like it took a long time for the food to come. But when it came it was excellent! I had the namesake sandwich, the Almar, and it was a great combination of flavors. I devoured it in minutes. My fiance enjoyed the Eggs on a Cloud dish, and it looked really cool. We will be back again soon!", "author": "Jonathan A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-18", "description": "Owner very rude and unprofessional. Did not care about the guests or his own staff. Will not go again.", "author": "Luke B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "Simply put, Almar is one of the best REAL Italian restaurants you're going to find in Brooklyn. It's not a \"red sauce\" Italian American spot, they actually have a creative menu that changes with the seasons. Excellent pasta, the stuffed pork chop is crazy, the rabbit is insane, the burrata is perfect and the service is great. If you're in Brooklyn and you want a meal that won't break the bank and exceptional food, this is a must.", "author": "Jeffrey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "After a morning workout in DUMBO, my family and I were in search for a good breakfast/brunch restaurant and we decided to eat at AlMar!! So glad we did because everything was so delicious and the service was great! We ordered...\n\n-Eggs on a cloud\n-The AlMar\n-Eggs purgatory\n-Pancakes\n\nEggs on cloud was hands down the best. Not only was the dish pleasing and beautiful to look at, the egg whites were light and fluffy and went well with the toast and cheese. \n\nThe AlMar was the group's favorite, as it is a breakfast sandwhich that is simple but packed with a lot of taste. \n\nEggs purgatory was the least favorite as there was only one piece of toast with lots of eggs and tomato sauce, but the dish itself was alright. \n\nThe pancake dish came with 3 pancakes and it was tasty and fresh!! \n\nWould definitely love to come back for dinner as the price is not outrageously expensive!", "author": "Patricia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Pretty, warm, and comfortable atmosphere! Came here for brunch with some friends and really enjoyed being in the space. We didn't want to leave! I had the omelet and a side of bacon which was definitely good but not mind-blowing. Will definitely be back to try other items on the menu.", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "Best happy hour in dumbo. Great cocktails. Good wine list. Excellent service! The attention to detail with the beverage program is worth the wait. I hear they are great for brunch as well. Can't wait to go back.", "author": "Soren P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "One of the best breakfast I have ever had, everytime i go back home to brooklyn that's always my first stop", "author": "Alejandro G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "My friend and I were in the area and decided to check this spot out based on all the positive yelp reviews. It's a super cute spot. Came here on a Saturday morning and it wasn't too busy. My friend and I both had the old fashioned breakfast and it was good. Definitely would come back here again.", "author": "Nhu H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "My friend and I came here for brunch at 10:30 on a sunday before we explored around dumbo. The location is really great! Just a few minutes from the subway and from the famous shot of the manhattan bridge. \n\nWe both got the eggs in a cloud (not going to post a picture since theres already so many). Overall the dish was really good, but the egg whites were a bit much. I could only eat half of it. I really liked that the spinach wasn't overly seasoned or too oily either. \n\nI also got the endless coffee, which is a really good deal if you drink 2 cups, but I do think the coffee could be a little stronger.", "author": "Claire Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-19", "description": "Lovely atmosphere. Accommodates kids. Good coffee. That's it. It's like they don't even care. Was there on 3/17/19 at about noon for brunch. Maybe they are more a bar and the food customers are an afterthought? That's how it felt. Too bad, because it's such a comfortable place in a nice location. A couple of years ago it was excellent.  Not sure what happened. A side of bacon now costs $4.50 for 2 slices. Not big slices or anything special. Quality slightly above a diner. Not so for the pancakes. 11 or 12 dollars gets you three paper thin, small, dry pancakes. My wife commented that they looked like McDonalds. It's not about the cost. I'd pay more for quality. The breakfast potato's tasted reheated. You know that once crispy but now kind of chewy texture that happens when you microwave stuff. Not pleasant. I wasn't even going to review, but the waitress was sneering at us as we were getting ready to leave. We weren't rude in the least. Not sure why she took it so personally.  Maybe because we asked that we not be charged for the pancakes? (only 2 small bites taken) is she charged for that? Sorry. Better service could have saved our breakfast. Not sure what can save this place. Not sure they care.", "author": "Vince C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-19", "description": "This place has such great vibes. Went yesterday and was really hoping for a great brunch. Was unfortunately very disappointed. The service was very slow (came to the table once) and our food was cold. Could never even complain because they never came back to check-in. Had the food been warm would have been great, but overall left very annoyed and disappointed.", "author": "Cassie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-02", "description": "Our server was wonderful. Pasta dishes were just okay, but our cheese plate and dessert were very good. \n\nNote- the restaurant charges a mandatory 4% service charge to every bill (separate from the tip you pay to your server). When we asked about it, we were told the charge was legal because of a \"new law\" and that it was meant to cover a credit card fee. NYC law (as of today) still prohibits these types of service charges, especially since we weren't told about them before the meal. I hope the management corrects this error.", "author": "B W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-28", "description": "Others reviewers of this overpriced dump are probably paid by the restaurant. In addition to the food being terrible, they charge 4% for the use of a credit card marketed as a \"technology fee.\" Gross misrepresentation. Skip, as there are many others restaurants in NYC", "author": "Todd R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-03", "description": "Easy breezy brunch! Really good service and cool decor!", "author": "Liz F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "Great food \u0026 service. Stopped by for lunch and luckily we were seated right away (tends to get very packed quickly aka 40 minute wait). Got a cute table under the window. I opted for their lunch special which consisted of half grilled chicken panini \u0026 a wild shrimp salad. Amazing quality, freshness \u0026 presentation.\nAlso had their rum runner after. Definitely recommend.", "author": "Natasha E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-18", "description": "Mediocre to low end. Not Italian culture at all. They would rather make the $10 than making sure you had a good experience. The food was not special. Would not recommend to groups bigger than 4. Really patronizing. When we complained about an establishment related problem, the owner proposed us not to pay the tip for the waiters. Then we told the owner that this shouldn't be taken out of staff's payment, the owner just didn't want to hear it. They don't even care about their staff, so disappointing.", "author": "D S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-10", "description": "just happened to walk into this place one morning as we were in dumbo and decided to stop for breakfast. i didn't know a thing about it but we were tired of walking around and were so hungry. it turned out to be a great choice! the menu is not vast but basically everything on it sounded good to me so i had a hard time deciding. the waitress finally convinced me to get the \"Egg in a cloud\" which was an egg with whipped egg whites, fontina cheese, and ham on toast surrounded by spinach. best choice i could've made as it was delicious. it's also so neat looking! i didn't love the bloody mary i had but overall it is a cute little spot in dumbo worth visiting!", "author": "Emily M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-18", "description": "The owner of this restaurant is misogynist and doesn't care about the experience of his patrons. The waiters are nice but the owner serves mediocre overpriced Italian food with an attitude. They are not accommodating.", "author": "M M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}