{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Best restaurant in dumbo by far.  Food is great and the staff is super friendly.  I'm there about once a week and always get the ricotta crostini and you can't go wrong with any of the pastas.", "author": "Sammie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-17", "description": "I came here immediately after work because I was dying to try it out and heard how good it was. I was anxious for good food, friendly service and such.\n\nUnfortunately, when I arrived, the Chicken Marsala was extremely undercooked, however the service was very accommodating in taking it off the bill and giving me tiramisu which was just okay.", "author": "S. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "AlMar is off-the-charts fantastic. Between the relaxed, inviting aptmosphere, wonderful service, delicious food, and well-stocked bar, you really can't go wrong. Not to mention, they offer brunch/breakfast until 4 pm, daily, along with their lunch menu. As for the dinner, Alberto, the chef (and one of my all-time favorite beings), whips up a new menu, everyday. \nConfession: I was actually the hostess at AlMar, for quite a while. However, instead causing bias, I feel that my experience and familiarity with AlMar only makes me more qualified to provide critique. After all, as a result, I happen to be very familiar with the staff (honest to god, some of the kindest people, who genuinely care about their customers), behind the scenes stuff (everything is super clean \u0026 well-maintained), and most importantly, the items on the menu that you NEED to try...\nBrunch: Egg Toast - - (two words: truffle. oil.) \u0026 BACON, + a Bloody Mary.\nLunch: (Alberto's) Meatball Parm Panino --THIS sandwich ruined me for all others--\nDinner: sorry, can't pick a favorite... just ask what Alberto reccomends, trust me, you won't be sorry. \nDesert: their Tiramisu, served in a martini glass, is fantastic... and I don't even like tiramisu.\nEspresso/Coffee: It's damn good, and the bartender/barista will make you just about whatever you'd like.... also, is it just me, or has it become increasingly difficult to get a decent, let alone GOOD, cup of coffee these days? \n\nTo be fair, I suppose I should mention the one thing most customers aren't thrilled about, which is that AlMar is a cash-only establishment.\n**HOWEVER, there is an ATM inside the restaurant!! (not to mention, a Chase bank, right across the street)**\nSo, I'm not entirely sure why that's an issue at all, but just thought I'd mention it.", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-25", "description": "Four Star attributes: Great decor and ambiance. Feels very hip and fitting of the new DUMBO. Went with my guy's family and they were all very pleased with how \"Brooklyn\" it looks - comfortable with good service and good drinks. \n\nThree Star attributes: the food was decent, but nothing that blew me away. The salads were tasty and the crostini were good, but the pasta dishes left me wanting more. The panne cotta was definitely lacking - way too sweet, don't recommend it. If they brought their food up to the look of the place they would be solid! But because it was just decent and still pricy, I'm going with a three over all. \n\nAlso, take advantage of their buy-one-get-one-free happy hour, if you arrive just before six (but beware, the kitchen doesn't open until 6).", "author": "Rita C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-04", "description": "My friends and I decided to check out the DUMBO area for lunch, and we had found this place on Yelp.  Granted, a few of their dishes were good (great presentation on the Egg in a Cloud), which is why I am giving it two stars.  However, my Old-Fashioned Breakfast was a huge disappointment, especially since I only requested the eggs sunny-side up and it was overcooked.  I've got to admit that I can probably cook better eggs myself.  \n\nWhat really threw me off was the service of the place.  I hate to say this, but my entire party felt like we were being discriminated against.  Our waiter came (and it looked like he'd rather be anywhere but at work) and took our order without even telling us there were specials or even showing a slight hint of a smile.  It took at least 10 minutes to get our cranberry juice and tea, and then perhaps another 30 minutes before we all received our dishes.  Our water bottle didn't get replaced until I literally had to get up and request it myself at the bar.  When the food came out, the waiter said \"the Egg in the Cloud\" takes longer because it needs to bake\", which of course, we understand that, but could you have told us that while taking our order and then ask us if we'd prefer to wait for all the dishes to come out together?  Holy guacamole, we were starving already, and I know for a fact that my friends wouldn't mind each other pigging out first and sharing dishes while we wait.\n\nThen, I see our waiter taking orders with other customers, and he definitely had the peachiest smile on his face and was chatting them up.  Sorry, dude, but if you're going to act all peachy and stuff, you better act like that to EVERYONE.  I might not be fair in taking this all out on the waiter, so let me add this, too - the hostess forgot about us and seated another party before us.  She seemed sweet and all, but learn to manage the wait list, please.  It's not exactly rocket science.\n\nOverall, would I go back?  Ehh, perhaps...if my friends wanted to go, but I better get a different waiter this time.  I will say that I did like the ambience (I love the floor to ceiling windows.)  I'll probably also order the Egg in a Cloud or some other salad dishes I saw from the Yelp photos.  But, if I'm just walking around DUMBO myself, I'll pass and check out a different restaurant.  My review might sound harsh, but then again, would you rather I lie or sugarcoat things just for ratings' sake?  Yeah, I thought not...", "author": "Lee Ann C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-09", "description": "I walk by this place every day on my commute to work, and there is always an aroma of fish outside. I know that sounds bad, but  hear me out: I'm not a fish person, but I always find myself craving fish when I walk by. I finally tried this place out, and it was awesome. The pasta dishes were amazing. As were the meatball, and bruschetta appetizers. I have yet to try the fish, but i hear it's also delicious. Definitely adds a little variety to the pretty limited selection of restaurants in Dumbo.\n\nJust beware, this place is a CASH ONLY spot.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "We dined here early on a Mon 15 June - had the swordfish and vegetarian lasagne. Great food and service. Highly recommend. Travelling from Melb Australia and this is a great spot to dine.", "author": "Robert G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-25", "description": "I've been here a few times and everything is always really great. Their meatballs and ricotta crostini are really yummy! I crave their shrimp cocktail with avocado.\n\nMost recently, we ordered ribs and pasta with clams. They were both simple and delicious. The ribs were really rich and tasted stew-like. \n\nEven though it is not a rowdy crowd, the place gets pretty noisy-so it's not the place to go if you're looking for a quiet dinner (on the weekend at least).", "author": "Bee C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-11", "description": "I met friends who liked what they had  mostly salads.  I ordered duck breast which I love.  It was fatty, too rare, a very meagre portion and a too sweet sauce.  I should have sent it back.  If you go, don't order duck.", "author": "carol s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-26", "description": "Excellent prosciutto panini. Very nice salad nicoise, too. Hip little cafe in the heart of Dumbo. Good spot, I will return.", "author": "Michael t."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-22", "description": "Lovely atmosphere.  So-so food, a little bland.  For the love of god - get a freaking credit card machine!!!  It's incredibly insulting to not have one this day and age and instead squeeze another $2 out of your customers by forcing them to use your ATM.    UNCOOL.", "author": "Meredith K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-23", "description": "I think I fell in love with this place!! It's seriously so good. The ingredients are so fresh and the food is literally mouth watering! I fell in love with the decor and the whole comfortable ambiance of this place. It seemed to be a really popular spot for the locals. \n\nFor lunch, my friends had the Smoked Salmon Sandwich and I had the Pork Sandwich. Everyone agreed the food was literally mouth watering. The pork was so hot and juicy and the bread was so soft, it was melting in my mouth.\n\nFor dessert we had the tiramisu and it was seriously the best tiramisu I've ever eaten. My friends even said it was the cherry on top of a fantastic meal. Sadly it was gone in two seconds. \n\nThe place is just too pretty and the food is just so amazing. I will definitely be coming back when I'm in Dumbo!!", "author": "N L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "Went here for brunch with my bf after walking across the Brooklyn bridge we were starving and got lucky with a spot for 2 Sunday brunch.  Most people waiting were in larger groups. We did not have a reservation and waited maybe 5 minutes.  Our waitress was nice and attentive. I ordered the spritz drink which was very good. It was strong! My bf got the lemonade drink and I think he was drunk off the one. We are light weights I guess. I ordered the meatball parm panini , he got the boar lasagna and we got the fritta appetizer. My favorite was the fritta surprisingly everything else was good but not awesome need to come back asap for. Cool chill atmosphere. Would recommend. \nCons- cash only and only one bathroom for the whole restaurant! Say what?!", "author": "Katherine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "Can't say enough good things about this place. Owners are just wonderful people who are absolutely welcoming. The food is really authentic and is has a unique southern italian fare that you don't often find in most italian establishments in NY. Highly recommend!", "author": "Charles C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "If you are looking for a comfortable and inviting restaurant to meet friends over brunch then look no further than AlMar. Space is composed of large windows, communal table in the center and a bar with stools on the left. The crowd was equally mixed with locals and tourists but everyone seems to have a good time.\n\nIt gets busy on the weekends so plan on getting there early to grab a table and make sure you have cash because they don't take credit cards. Brunch menu offered a good balance of egg dishes, salad and paninis. Besides the menu look over to the blackboard for the daily specials. Great coffee served in large mugs. If you prefer a cocktail there are also nice selection of drinks to go with your brunch. Portions are decent size so you won't leave hungry.\n\nServers were efficient and quick with the coffee refills and delivery of orders but don't think about reading a book or browsing the net when there are others waiting by the door for a table, you will be encouraged to ask for your check.\n\nLooking forward to returning for dinner, menu looked amazing.", "author": "Sebastian S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "Food was pretty good. I had a nice salad with tuna and my girlfriend had the lasagna.  She also had the tartufo for dessert which was very nice. The Tuscany red wine was also very nice. However, the menu didn't have that many options that appealed to me and they were out of several items. Overall, a nice experience on Memorial Day weekend though.", "author": "John R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "staple place to go in dumbo. the food is consistent and good!! we usually go during off times...otherwise they are quite busy.", "author": "Jules O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-28", "description": "After spending the day at the BBG and Bklyn Museum, we showed up hungry and unaware that it was still 30 min. before dinner service started. We snagged a table anyway and enjoyed 1/2 priced happy hour drinks until they started dinner service. We ordered crostini to share, my friend made a dinner out of the meatballs and the arugula and fennel salad while I had the pappardelle w/ duck ragu.\n\nCrostini w/ mascarpone and pecorino romano, topped w/ honey and walnut. At first sight, the two crostini look small. Then you pick them up and feel the heft and weight. Smooth mascarpone, tangy and tender pecorino and just enough honey to hint at sweetness w/o being intrusive. It was flavorful and balanced.\n\nMeatballs in sauce were tangy and bright. I still think Sora Lella's was the best, but these aren't bad. You get two decent sized meatballs to an order. \n\nFennel salad: argula, fennel, orange and pecorino romano. Peppery, buttery, bright and refreshing. The only misfire were the oddly flavorless green olives.\n\nPappardelle w/ braised duck and shiitake mushroom ragu. The pasta wasn't al dente, but the sauce was flavorful and the dish itself came w/ a generous portion of tender duck. The duck itself was just gamey enough to remind you it was duck. \n\nTiramisu: the lady fingers tasted of strong espresso and were still tender w/o being mushy. The mascarpone dusted w/ cocoa was slightly sweet, possibly from vin santo. Served chilled in a martini glass.\n\ntl;dr: Come in and enjoy the space and the food.\n\nNote: bring cash cuz they don't take credit cards.", "author": "Ed S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "Ambiance  was lovely and romantic,good service and the food was very good!!!..I thoroughly  enjoyed it. Id definitely go back!!", "author": "Fanta K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-06", "description": "Had breakfast here. It was ok with reasonable prices. They are cash only.", "author": "Yowza A."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}