{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "Food was delicious and service was friendly and attentive. -1 star for not accepting credit cards.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "It is nice, cozy and very welcoming walking in here.  You are taken care of by very polite staff.  Very homey.  They get you with the sign outside for the 2:1 happy hour.  I am glad they did.  It was a nice break.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "Tasty brunch panini . Fresh coffee . Looking forward to trying again for dinner .", "author": "Amit K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "This place is fabulous! Almar serves fantastic dishes that stay consistent in quality! I've become a regular and I'm always blown away by the friendliness of the staff and the owner! If you're in Dumbo, that's the place to go!", "author": "Ben H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "Home-y decor. LOVE the long old school wooden table. Friendly staff. Only had a latte w/ soy... But it was certainly delish. Would love to try their food.", "author": "Jenna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-13", "description": "We've been going to Almar for four years since it opened (we live across the street). It has only gotten better and better. Just had Alfredo's spaghetti and meatballs - to die for. I go often for breakfast and usually get the Old Fashioned which I love. The coffee remains out of this world. Truly great spot!", "author": "Little R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "Came for Sunday brunch. I had the Egg In A Cloud, fun to eat and very yummy. Staff was very efficient, hostess could've been a bit friendlier. Overall, great atmosphere and good experience.", "author": "M L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-20", "description": "Had brunch with friends April 19th. We arrived a bit early and were promptly seated, which was terrific. We had reservations.  The atmosphere is lively, but the noise level was off the charts. Not a positive when you are trying to visit with friends.  Our waitress was very nice but not very attentIve. We had to wait quite a while for our food and both the appetizer and brunch selections came out together. Not good. Had to chase her down a few times for needed utensils, coffee, milk etc.   The food was very good. The asparagus salad very fresh and not overdressed. The egg on a cloud was perfect, as was the Bellini and Capuccino. Service and noise level dropped my rating to only 3 stars.   Would do it again perhaps midweek. If noise is not an issue, by all means try this place.", "author": "Maggie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-14", "description": "Great atmosphere, good service. The food is enjoyable but not mind blowing. All stuff you could make at home pretty easily. I come here mostly because it's a comfortable environment, it's pretty quiet and it's a nice place to get away to for lunch and read.", "author": "Laura G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-22", "description": "we stumbled upon this place while we were in brooklyn one day and was looking for a brunch place. the decor is really cool. i like the look of hte place. spacious with kinda of a bare warehouse-ey feel. \nthe food was really good. i love the food presentation of every dish! i got the eggs in a cloud. it was super cool and interesting. the brioche was amazing! perfectly toasted. yummy! it had ham on top of it and cheese and then the egg cloud thing. idk how they made the egg puff up like a giant cloud but it was good! then it had spinach i assume cooked in olive oil all around the plate. it was soooo fresh and simple and amazing.\nthe veggie fritata i also tried. it was tasty. \ni love love this place. fresh ingredients, cool casual atmosphere and really cheap actually!!! definitely a great deal for brunch! you gotta check this place out!", "author": "Abby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "I really love the interior and menu is very interesting. I`m a strong believer that if you can spot within 10 seconds one or two items that you just MUST order then you 're already half way there. Good job!", "author": "Serge L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-05", "description": "The good...\nThe Food- I've eaten here many times and I think they execute their menu well.  I really enjoy their $10 lunch combo special and the few times I've had dinner here, it was not a disappointment.\n\nThe bad...\nService- Unfortunately this is where they get a lot of deductions. Sometimes it seems they are irritated by your very presence and have to actually do \"work\".  As far as attentiveness, they will take your drink order, eventually take your food order...never check on you again and then just give you the check with a dry and unappreciative \"thank you\" at best.\n\nThe ambiance could be better, but it isn't distracting and sets a decent tone for your meal. Not an addition or subtraction at this point.\n\nOverall- You'll probably have an \"OK\" experience here, which is pretty much consistent with any and all dinning experiences you'll find in DUMBO.", "author": "Amber C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "Came for dinner after hearing good things about the food, even though Al Mar took over my fave Dumbo spot: Dumbo General Store. Hubby and I split bruschetta, cauliflower soup, and a creamy pasta with sausage and peas. The food was delicious start-to-finish. Fresh, top-quality ingredients came together in just the right way in every dish. My only gripe was a slightly disinterested waitstaff that looked a bit put-upon by the eager diners around them. Go for the food, not to make friends.", "author": "Kara B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-21", "description": "I liked lunch menu better than dinner. Although food and ambience was good, my biggest complaint: there were no signs posted that restaurant accepts cash only, even menu didn't have warning, but when you get the bill it says \"cash only\".", "author": "Claudia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-24", "description": "It's our neighborhood hangout.  Food is slightly above average, but the atmosphere is good and relaxing.  Would not make a special trip if we lived far away, though......", "author": "Su S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-04", "description": "Food was great and fast but service, atmosphere and crowd (Friday night) was horrible. Wouldn't recommend.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "Loved this place.  Amazing grilled Octopus.  Fantastic Martinis and complimentary home-made lemon-cello at the end!\n\nFantastic Meal.  GO", "author": "Melanie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "Great neighborhood restaurant! Excellent food and staff. You won't be disapointed.", "author": "Jen D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-23", "description": "The food was fine but the staff was rude.  We were a party of 6 with a lunch reservation and stood by the door for a good 5 minutes before being acknowledged.  No apology was given.  Our table service was equally slow, and both hostess and waitress looked annoyed with us for even being there.  We won't be returning.", "author": "A P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-31", "description": "Delicious food and nice industrial but warm ambiance! Almar is a great new find. Fresh seafood and produce! Try the grilled octopus, mussels, and amazing crostinis. Don't forget about dessert either, youwon't be disappointed!", "author": "erika g."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}