{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-06", "description": "When a waiter puts the meal on the table, instead of dashing away can't they ask \"is there anything else I can get for you?\"  When a sandwich comes with a side-salad, please don't give plain brown edged wilted lettuce on the plate, and no dressing.  This is a bit ridiculous.", "author": "M D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-01", "description": "i was coming from manhattan to book a client lunch meeting here and would've been extremely helpful if the person who took my reso, informed me that it was a CASH ONLY establishment.  I would've come prepared, rather than handing in my credit card to the server, only to be told, \"sorry, cash only.\"  Hmm, so not only did anyone tell me when i made the reso the week before, nor when i sat down at the table 15 mins prior to my reso, nor when i ordered my arnold palmer.  Ok, enough about that. \n\nI ordered the chick pea soup.  Looks phenomenal and tasty, yet lacked seasoning.  A dash or 3 of salt and fresh ground pepper would've made it perfect.  \n\nI also ordered the Classico.  Proscuitto, mozz and tomoatoe in a pressed ciabbata sandwich was very good.\n\nService was fluffy, Decor rustic, pretty.  Great location and view of the Manhattan Bridge from outside the restaurant.", "author": "Ang F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-03", "description": "I come here every time I'm in DUMBO. This place is SO fantastic! I've had brunch and dinner there and the menus have a little something for everybody. If you're dining here for dinner you absolutely can not leave without ordering their ricotta, mascarpone, parmigiano, with walnuts and honey crostini. If I was ever on an episode of The Best Thing I Ever Ate - this would be my dish. It's so light and airy. Also try their meatballs and pumpkin ravioli. For dessert, go bananas with their nutella panino. \n\nWord to the wise: Cash only!", "author": "Francesca T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-04", "description": "Food is up and down. \nService ranges from the slow to the rude\nA lot better options in the area", "author": "Honest M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "The Brunch was excellent! The Egg Cloud and Tuna were great dishes! The service was lackadaisical, but improved later on.  Nice atmosphere as well.", "author": "Ali S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "Loved the Egg Cloud!  The \"soup-bowl sized\" coffee cup was fantastic and the rustic atmosphere and good service was perfect for a Sunday brunch.  Also have been there late afternoon but before 6:00 so they had the same brunch/lunch menu.  I feel like I have just scratched the surface and it has definitely piqued my interest for a return trip there for dinner.", "author": "Gold M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "The only decent and consistent place to eat in DUMBO, at a reasonable price.  I come here fairly often.  Relaxed vibe, nice space.  Food is completely unremarkable, except in the context of DUMBO's food desert.  At least they have vegetables!", "author": "George S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-09", "description": "2.5 Stars, but I will give you the benefit of the doubt... Their food is decent, I have had to send things back but they were corrected. The staff is nice, never had an issue there. The real reason this place aggravates me is they do no accept credit cards. Come on AlMar, you are a large, full service restaurant their is no excuse why you should not accept plastic, its RIDICULOUS!! It just seems arrogant.. Dumbo is in such need of restaurant competition, this is why these places are still pulling crap like this, because they know there are very limited options for sit down restaurants. Its a decent spot just make sure you have cash in hand..", "author": "Paul D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-09", "description": "I went with a friend to AlMar for Saturday brunch...I was expecting maybe one pasta dish at this Italian restaurant.  I really wanted some yummy pasta carbs.  But no, the menu was mostly a variety of paninos (not paninis...paninos), all of which sounded very good, but still I was underwhelmed.  Our waiter was almost pained to serve us...it was so odd.  We had one question about the specials and it was like we had asked him to jump off the Brooklyn Bridge.  He was very disinterested in us and in the restaurant.  But at least the food was really good...I opted for the Egg Toast and it was yummy and filing.  The brunch pricing is very reasonable, with most items costing $10.  I would absolutely go back, since the restaurant is near my home and very cute inside...plus I want to try a pasta dinner dish!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-18", "description": "We came for brunch.  My asparagus, shallot, Parmesan frittata was tiny and sounded better than it tasted.  The white bean soup featured mealy beans - either due to undercooking or underfreshness of said beans.  My spouse and child had an egg sandwich with on overcooked fried egg on ciabatta.  Service was friendly, if not particularly attentive.  My husband couldn't round up a refill for his coffee.  Although, it would have been free had he succeeded.  Cheap.  Cash only.", "author": "Kari T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-16", "description": "Apart from the initial negative experience of the host - not sure if she was having an off day, but she definitely had an attitude -we enjoyed it.The decor is nice and open and modern and we had the two popular dishes - eggs in a cloud and egg toast. I also had the white gazpacho, which i loved. Everything delish and waitress was great. HOWEVER - too many flies buzzing about us and I had to shoo them several times away from the rims of our dishes .... always a worry to me in a food establishment. We were by an open window, but still... Anyway, we didn't think too much of it until both of us felt less than 100% later on. Not sure if it was related, but the flies made us wonder and we had only gone for a coffee post brunch. Anyway, probably won't be back mainly because of the initial experience plus flies and then plus how we felt an hour or so after. Food was really good though.", "author": "Samantha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "This is as good as it gets for Italian food. Growing up in a big Italian family I am thoroughly impressed.  Great date spot, Like Arnie says \"I will be back\"", "author": "Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "The manager and chef left Noodle Pudding and took over Dumbo General Store's space. You can still get good coffee, those thin chocolate chip cookies or pastries. But then...\n\nBrunch. Mmmm. Egg on a cloud totally rocks.\n\nDinner: Wild boar lasagna. Oh my goodness.\n\nAnd seafood. I had the mussels the other night and steak last week. The steak was excellent. Perfectly cooked, juicy, naturally tasty.\n\nThe menu changes depending on what's fresh and good. Missed the all-natural lamb loin the other day, darn it.\n\nThey replaced a lot of the staff with attentive, outwardly-focused servers with experience. Nate formerly with DGS still bartends. He seems happy with the change.\n\nI hear in a month they'll have housemade limoncello. Can't wait.\n\nGave it 4 stars instead of 5 because of the air quality from the kitchen. But they just upgraded the A/C.", "author": "Kiai K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-22", "description": "Great food, but some of the worst service I've experienced in NY. \n\nWent on a Saturday night, called ahead and were told that we had missed the cutoff for reservations but that the wait was usually about 20 minutes on a busy night. We showed up, were asked to wait as they set up a table for three (the number of people in our party) and then told the table  for 3 was already reserved and were asked to return in 45 minutes. No problem. I offered my phone number to the hostess, as is typical of  small places with no room to wait, and was told that she \"would call if [she] remembers to, but it gets busy and [she] forgets\" so I wasn't too confident. We returned in 45 minutes on the dot and were ignored by both the manager and the hostess for a couple of minutes before we were told that we would have to wait an additional 5-10 minutes. All fine, we went to the (very small) bar, where menus were literally thrown at us by the bartender before we were told that we could not wait at the bar because the seats were all reserved. At this point, we were ready to leave, but our table was finally ready, so we sat. \n\nWe ordered the meatballs and the octopus salad, both of which were excellent. My dining companions both ordered fantastic pasta dishes and I ordered the braised lamb.  All of our meals were superb. The braised lamb was tender and the portion was huge. I was complete happy with the food itself. \n\nThe server was very short with us, and never greeted or checked on us during the meal, which is something I have come to expect at restaurants of this caliber.  \n\nI NEVER ask to see a manager, but I was so worked up by that point that I did. The manager came over and proceeded to blame us for not having a reservation. We paid (cash only) and left, unhappy with out choice of restaurant. \n\nThe food is excellent but this place needs a serious overhaul of management and service style. I wouldn't recommend this place to anyone without it.", "author": "Courtney R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-13", "description": "I went with a group on summer weeknight.  We went Easley enough that there wasn't a problem getting a table.  The wait staff was awesome, especially considering that we were not an easy crowd.  The creative cocktails were delicious.  The menu had creative choices the were were fabulous.  We all left very happy.", "author": "Lara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "We had fish, a lot of fresh delicious fish! Try the baby octopus \"barese\" style or the calamaretti! If you like cheese, you will fall on love with the bruschetta with buffalo ricotta: light in texture, strong and earthy in flavor. Spaghetti were very tasty and perfectly al dente. My wife's striped bass was really good too. Yes, we had too much food, and it was worthy! Full bar, nice wine selection, friendly staff. The perfect stop after a nice walk over the bridge or a stroll in Dumbo!", "author": "Luca A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-23", "description": "I was her because it was highly recommended. The food was ok nothing to write home about. Very Friendly staff though. One thing it was very dark in the restaurant and I was there and it was so sunny and bright outside. The special for apps was the stuffed sardines which was amazing!! The waiter forgot my cocktail I ordered. When I used the Ladies room after dinner it was all the way in the back past the kitchen and was very dark. There was also insulation on the pipes on the ceiling that were not covered. And a few flies that were on the big mirror behind me.  Its was ok but nothing to write home about.", "author": "SA L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-20", "description": "AlMar is a sudden favorite with the IP/IT tech-that-eats crowd and the design community clustering here in DUMBO, and for good reason; their food reflects the vision and attention to detail distinguishing these participants who believe that what they eat and where they eat it is in fact important. \n\nHandmade quality food in DUMBO - complete with care and attention to service - in a warm, well balanced design - a godsend. \n\nEat there.", "author": "robert e."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-06", "description": "Egg Toast is amazing! (I added a side of bacon which was a thick cut of deliciousness) \n\nThere is only one other place that has blown my mind for breakfast/brunch and AlMar was just added to the list... \n\nDefinitely coming back the next time im in Dumbo...", "author": "Sasha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "Hands down one of mine and the boy's favorite places to frequent. We actually accidentally stumbled upon this place and have just kept coming back. I've been here for lunch, dinner and drinks. The bruschette are really delicious (my favorite is the ricotta with honey and truffle oil) and they haven't missed with any of the pasta dishes I've had. The cocktails are also great, my favorite being the Italian Sour (a twist on a whiskey sour). I also love the decor: simple with wood and metal elements. On top of these positives, a huge reason we keep going back is the service! From the door to the table, it's professional, friendly and welcoming. We've usually opted for sitting at the bar. The bartender (Dani? We're both terrible with names and keep forgetting! Or maybe it's the delicious drinks haha) is awesome. She is super sweet, attentive and makes awesome drinks. We also came for NYE, which was fun in itself. There was a buffet of mouthwatering bites, unlimited drinks and was just a really fun crowd. Personally I feel like this is a place for dates or girls night out but I have seen families here as well. \n\nThe only gripe I have is that it is a cash only establishment. And also that it seems to have gotten more popular/crowded since I first started coming here (but now that's just me being selfish lol).", "author": "Kimberly L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}