{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "Wonderful experience at Almar this weekend!  I love the atmosphere with the communal tables, low lights and rustic warm space. The service was professional, quick and spot on and the food was very good. \nWe ordered a green bean and potato appetizer with capers and olives and grilled mussels; both delicious and nice size portions. \nI had a short rib entree which I asked to be served with sauteed spinach which was excellent and perfectly cooked. It was refreshing to have a restaurant experience with really no complaints. \nI am impressed with the prices, really what it should be to eat out; very reasonable.\nYay for Almar!", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "Didn't make it to our table. The host was such an arrogant diva, she didn't acknowledge anyone walking in, not a smile, not a \"hello\", nothing. Finally promised us a table after a 25 minutes wait, waited another 10 when she finally gave our table to someone with a reservation. Probably fair, but she shouldn't have promised us a table if she knew reservations were coming. No apologies either. The perfect b****. Never again", "author": "Antoine A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-22", "description": "Food is very good but if you are solo, be prepared to feel like a third wheel.  The wait staff doesn't know how or want to deal with single diners.  The manager as always is never in tune with what is going on on the floor so you have to be pushy to get attention which just magnifies the discomfort.  Thank goodness for the bus staff. They are attentive and responsive.  I live in the neighborhood and often dine here with my husband or guests because the food is always good.  Dumbo doesn't have a lot of options so was hoping I could come to a 'neighborhood joint' when I am 'solo', but after two attempts, this is not the place. Pity", "author": "Ben C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-16", "description": "Hip local Italian restaurant. Movie projector on back wall. Communal table. Minimalist menu. Nice selection of barebones salads and eclectic pasta. Affordable. Preparation needs works, seafood dish had gritty mussels, shell bits, and shrimp w/ remaining veins.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-18", "description": "This review is only for brunch\n\nTruly mediocre. We had the Egg Cloud which I have to admit is very unique but it needed a sauce - maybe hollandaise\n\nSame is true of the AlMar breakfast\nSandwich. It it had some type of sauce or butter or something to give it some moisture it would have made a world of a difference", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Excellent food and a friendly atmosphere. Four of us shared some appetizer plates of grilled octopus, fried stuffed zucchini flowers and a mixed cold antipasto platter. Everything was great although the zucchini flowers and the grilled octopus plates were small portions; not really meant for sharing more than 2 people. Pasta dishes were all delicious. My linguine with tomato sauce, grape tomatoes, mussels, clams, shrimp and squid was just like my mom would make. The spaghetti with arugula and avocado pesto \u0026 shrimp was very garlicky and tasty. We didn't have any main courses. The desserts (tiramisu', panna cotta and affogato gelato with espresso) were really good too. A bottle, actually two, of Prosecco wine completed a fine meal.\n\nThe atmosphere is fun and lively. The wood tables and benches are interesting as long as you're not sitting on those benches too long. They are a bit hard and uncomfortable to sit at for a long time. I would return here for dinner or possibly a nice weekend brunch to take in the nearby views on the water.", "author": "Sal L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "Great lunch spot in Dumbo.", "author": "Igor G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "Had lunch here after my BF's sisters wedding and it was super adorable, very quaint and the food was delicious! Everything was pretty great, no complaints here.", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-10", "description": "Came down all the way for brunch cos it was highly recommended by a friend. Ordered the traditional breakfast and the eggs in a cloud. \n\nOverall, the food was really REALLY good. The bacon was delicious, the potatoes were yummy, the spinach that came with the eggs in a cloud was AMAZING. \n\nOh of course the eggs in a cloud was very very pretty and very delicious. \n\nIt is, however, one of those places where the waiting staff look like someone just kicked their dog and the world owes them a bunch of money. While efficient and accommodating, they were however incredibly grumpy and unpleasant. Shudder.", "author": "Kenny N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "This place is incredible. Great neighborhood joint, nice casual vibe.  Reasonable prices (cash only). The Spinach fettuccini bolognese, bruschetta with burrata and honey, kale salad, and tiramisu are my favorites. They are so good that I rarely deviate from them. That being said, the other stuff I have tried is always amazing too.", "author": "K. B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "Huge fan here. My favorite neighborhood restaurant. Drinks and food are always amazingly good. Cash only, which I think makes it a bit more reasonably priced. Even the brunch fare is awesome. In the heart of trendy DUMBO with lots of great retail close by.", "author": "Jasper R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-25", "description": "I mean.. I came here right after my hour long power walk feeling pretty invincible. NOTHING was going to stop me.\n\nGot the adrenaline was pumping full force, sun was out  and I was with great company. The service here, however, really  managed to go above and beyond to make sure my happy moment wouldnt last ..\n\nFood:4\nAmbience: 4\nService: 2\n\nIts a nice space, and considering the weather was amazing this place didnt have a wait. I guess I know why now.\n\nThe food is decent, mostly sandwiches and egg dishes for brunch.\n\nDishes recommended include the Egg in a cloud toast, BLTs and Portobello Sandwich. Good but nothing you can't make at home if you tried.\n\nMaybe I'll come back for dinner to try their \" famed\" pasta cause they didn't have it for brunch but then again there are tonnes of amazing italian spots in brooklyn maybe i'll just move on to the next one", "author": "Isabel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "I wanted to start this my mentioning that they do not accept credit cards so make sure you bring cash when you eat here. This is a gem in DUMBO! I think anything you order here will be real good! The lagasna bolognese was a WOW as was the Whipped Ricotta with Mascarpone, Parmigiano, Honey \u0026 Walnuts. It was just awesome. The service was attentive and friendly as well with good tips. They were right about the whipped ricotta! We definitely will be back.", "author": "Mike K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "This place is great. Fresh sandwiches, pastas, and breakfast options. The menu is moderately sized, so it's a great place to go if everyone in your party wants something different! I love coming here, the service is great, the environment is lovely. Highly recommend! (Cash only joint, btw)", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-24", "description": "Never again. I had a totally forgettable brunch there last year but was told to give the place another go. So I made it a point to try again for dinner. I sat at the bar and the bartender did his very best to ignore me for a good seven minutes which is difficult with a bar that seats 10 and only 2 other seats are taken. Kudos, that takes commitment.\nWhen he finally deigns to come to me I ask for a dinner menu in addition to the drink menu, which come promptly but followed by another wait...\nSo when I finally get to order, YAY, he tells me, after I mulled over the menu, that the kitchen doesn't open until 6 and turns his back. It was 5:45.\nAt this point I'm floored and just leave, but it's for good. Al Mar is dead to me. Their food could taste like manna from heaven, but no one should have to put up with bad service served with attitude.\n--The one star is because Yelp forces the issue. This place doesn't deserve any. I wish I could give negative stars right now. Or black holes.", "author": "C.A Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-22", "description": "What does AlMar do really well? Simplicity \u0026 freshness in Italian food. \nThat was what we really wanted that night, and that was what we got. \n\nThe place feels laid back, and on the weeknight when we were there is wasn't too busy, we didn't have to wait for a table. On the back wall of the restaurant they silently play black \u0026 white films, and the space  is attractive and comfortable - sort of rustic-chic. The tables are fairly close together (we enjoyed a bit of table eavesdropping during the evening). \n\nCocktails to start: an Italian sour and a Camparini; both were excellent. Then there was the anchovy bruschetta, and for entrees, a special - a mini-meatballs pasta, and the pappardelle with delightful green things (asparagus, peas, fava beans). Normally we avoid ordering pasta when out, since it's so easy to do at home, but this time we were glad we did. The dishes were not too oily and tasted very fresh. The fava beans pasta gave us ideas for things we could cook at home. And the anchovies were AMAZING, big fat things, not like the skinny little salty anchovies we get at home.  \n\nIf we lived around here, we would be regulars at AlMar.", "author": "Jesse A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "the low down:\n*CASH ONLY (there is an atm --- head to the back of the rest.)  There is also a chase atm 2 blocks down.\n\nlots of room to roll out with your buddies or cuddle up in a corner with your significant other.  plenty of mood lighting to look pretty in... but, not so conducive to food picture taking.  \n\norder:  \nGrilled Baby Octopus with Potato, Celery, Capers \u0026 Green Olives\n\nWhipped Ricotta, Mascarpone, Parmigiano, Walnuts \u0026 Honey (only comes with 2... so if you have more in your group.. you know what to do).  this was freaking delicious.  i could eat this all day.\n\nI forget the name of this one... but, it was a black pasta with assorted seafood.  The sauce on this was delicioussss!\n\ndrinks:  the great saint!", "author": "Chrissy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-19", "description": "We read reviews on yelp and tried this place out on a Sunday afternoon. It was quite empty and we could easily get a table right away. The place has a rustic comfortable feel to it. Nothing fancy at all. I ordered 2 scrambled eggs, which came with toast and potatoes. Even though it was a very basic dish, something about the toast, butter, jam was very satisfying. I enjoyed the dish. The espresso was nothing to rave about. I would say the place is A-ok. I was not blown away by their food. I'll go there again if i am in the neighborhood but won't make a special effort otherwise. \n\nThey accept only cash, which i thought was a downside. Oh the other thing is, its still pending a rating.  I would be curious to see what rating they get.\n\nWhile dinner tonight was good, i would not recommend this place to friends due to the \"CASH ONLY\" restriction. You don't want to go to a restaurant, order nice wine, food etc only to be told later that you have to pay the meal with CASH only. They have no signs outside their restaurant or anywhere which warns you!\n\nBeing forced to pay large dinner bills in CASH only is very disappointing. Stay away or be prepared to carry enough cash. \n\nP.S. - they do have an ATM inside the restaurant :)", "author": "Shruti K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "Love the Baby Octopus. The Fava Bean and whole grain salad is also a favorite! Great atmosphere. Good beer.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "While the aesthetics are a bit lacking and the lighting dim, we were soooooo pleasantly surprised at how delicious the food was!!  We really just happened upon the restaurant and we would recommend you try it too.", "author": "Pam M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}