{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Our friends gathered here for a surprise engagement dinner. The team was so accommodating, even when the full party arrived in waves (and very late) and allowed us to order as we waited for the couple to get there. The whole team was very helpful and kept the place open as we took pictures and celebrated. Thank you for making the night so special for our friends. \n\nThe food was great too and the menu was filled with yummy vegetarian options.", "author": "Deanna P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Great neighborhood spot in DUMBO. Seafood here is fresh and so are the salads. The Branzino was my favorite! 4 stars", "author": "Lily N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "My family truly enjoys eating out. We love the experience...food, people, and memories. Let me tell you Al Mar will be one we will never forget bc of the arrogant, disrespectful, and condescending manager. We arrived on 4th of July, 3rd party to enter. They had happy hour going on since they don't serve dinner til after 6 pm.  We ordered a couple pints and waited for 6 pm. At 614 we ordered. Meatballs as a starter followed by short rib and shrimp linguine. \n\nPeople started to arrive and we realized they were getting their food before us.  In fact, the table next to us, party of three, arrived 15 mins after us, got the wrong order AND received their fixed food before we received ours. Numerous customers were getting their meals and after 54 mins waiting I couldn't take it anymore. I asked the waiter and the manager to check on the order. After 13 more mins we finally get the meal. 10 mins into it out baby gets fussy (bc we were waiting sooooo long) and we had to box it up and go. \n\nManager comes over to check on the table next to us and before he leaves catches a glance of me looking. I said it was unacceptable that we waited so long. He said it's the 4th of July. I said we were 3rd party here!  After I said listen it's bs you guys took so long he raises his voice at me and says, \"what, you want something for free!!\"  At that point I got extremely upset. That insult was it. Especially after we had left our cash on table paying for everything. This arrogant SOB insulted us and I gotta tell you he is the reason why that place is run so terribly. As I told him after his insult, it's his lack of leadership and respect that I will ensure all Yelp is aware of this incident. \n\nI'm sorry, I've waited for food on busy days many times. I don't mind that. What I mind is an a$$hole manager insulting my family when he clearly knows he's in the wrong. \n\nAl Mar, you failed. And it's you manager on duty who should never be allowed on duty again.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "This place is SO much fun for Sunday brunch! I've been here a few times with friends after walking the Brooklyn Bridge and we've always had an amazing time. The food and drinks are great and the staff are awesome. It has an open bright feel which I love. My only complaint is that it is a 'cash only' restaurant.  Other than that this place is nice, never too crowded, and you can even take a walk around the DUMBO area once you've finished. Highly recommended.", "author": "Lisnel V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Cocktails wee a great starting point- I had an Italian lemonade Vodka, basil and white wine- excellent!  For starters I had Caprese salad- brought new meaning to a Caprese- tomato was perfect and the mozzarella was so creamy/ olives to die for and all in a wonderful crisp green bed of lettuce.  My husband had the Octopus and said it was awesome.  For entree he chose the short ribs and declared it the best he ever had.  I had the gnocchi and it was so light- melted in my mouth.  For dessert we shared the dark/ white chocolate mousse which would be awesome on its own- unfortunately it was doused in a heavy syrup- would have been so much better naked or with a few raspberries.  Regardless, I would come back in a heartbeat. \n\nOh- pretty important- it is a cash only establishment.\n\nService was great.  We thought very reasonably priced for the quality of our meal.", "author": "Maura B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "Stumbled across this gem in Brooklyn after a walk over the bridge. The service was awesome, so many great food choices and a cozy environment to enjoy it all. A little pricey, especially for non alcoholic drinks but it is a great find. It is cash only.", "author": "Christina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "This place is a rare find amongst all the brand new flashy places that have popped up over the years in Dumbo and elsewhere in New York. Here you will find authentic Italian food created and made by Alfredo who brings his recipes from his native Puglia. We very impressed with the details and variety of the menu including great wines, Amaro's and even Grappa. Don't miss out on this place, it's unfortunately becoming a piece of old New York that's harder and harder to find.", "author": "Jack J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "I'm gonna keep this short and to the point because it's pretty basic - this is one of the only brunch spots in the area and I went there for the IMAX shift to spin studio so while walking around we popped in here and although it was crowded we got a seat pretty quickly. The service was not great. I don't know if they were shortstaffed or just because they were a little busy but they weren't slammed and we should've had a little better service.  \n\n first of all they were allowing children to actually sit at the bar and take up bar seats so we couldn't wait there for 10 minutes before table is ready which wasn't the end of the world but besides for allowing children to the bar and also hinder us from getting a drink which is not exactly smart on their part. And then once we were seated it took the waiter actually it took me asking for the waiter for him to actually come around. Once he did though I ordered a Frittata with I believe sausage and leaks, but I can't be positive and it was only $10 and more than worth the money. My friend had a shrimp salad and loved it and only ate half and took the other half home. Their body marys were really good as well, and overall for probably $20 apiece when a really nice relaxing brunch - it was a little warm inside, and a little loud with children running all over the place but that is to be expected and not something that would deter me from ever going back", "author": "Rebecca W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "I came across it while looking for a  restaurant in the Dumbo area on a Saturday night.  The wait period to be seated was very short, it's very low key and they have a great wine selection. I had the crab cocktail with avocado and oranges for appetizer and it was a great combo.  Service was also great.", "author": "Yuval L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-05", "description": "Get to the Chase:\n\nPros:\n1) Fantastic brunch food (especially the egg in a cloud)\n2) Serves alcohol too :)\n3) Good for friends and/or family\n4) Great location for post-meal Brooklyn flea market exploration or enjoying a walkabout\n\nCons:\n1) One unisex bathroom\n2) Can get busy and have a line\n3) Drinks are so-so", "author": "Sumito A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "My teenage son, and I wound up at this place after walking around DUMBO (unfortunately didn't check yelp first).  We enjoy eatting and trying new places, and we wanted to 'discover' a place that \"wowed\" us.  We were greeted by a young lady and promptly seated, and given our menus...today is Easter Sunday, so there was an Easter menu.  Very nice vibe, and the menu is pretty straight forward, no fuss...while looking the menu and trying to figure out what to eat, the young lady comes over with a bottle and asks us \"are you good with tap water? Or would you like something else?\" Then she went on to ask \"do you have any questions?\"\nTo be or not to be turned off...\nTo be or not to be irritated (because we literally sat down 2 minutes and just figured out there was a brunch menu and the regular menu) NOT to both....I wanted to enjoy my afternoon with my son, and decided to just order.\nMaybe the young lady picked up on the \"not clicking with you\" vibe I was inadvertently sending out, or maybe she was just busy, but a young man named Chris came over and took our order....\n1 Risotto cake\n1 Orichiette\nwe waited for our food....meanwhile, not a piece of bread, or a plate of their specialty olive oil to taste....or a solitary olive, or two to be seen....the two condiments that they specialize and sell seperately with the \"Al Mar\" label was not seen before, during, or after....(rack it up to poor marketing skills). \nThe risotto cake was not as we imagined or anticipated...it was palpable, but it was pan roasted risotto (plated like an over cooked pancake) with two sunny side fried eggs on top (wasnt quite sure if the eggs were the main attraction or if the pan toasted risotto was)...8 panfried snap peas at the 4 corners of the plate to decorate...ah also a 'swish' of fresh alfalfa sprouts on top.  \nThe Orichiette was also ok...but apparrently nothing impressive for all the rave the waiter had expressed as his favorite...that is for a baked pasta dish.\nThe bill came out to a bit less than 40 dollars (tip included) which is a lot IMO for the sparse fare and tap water.   \nI think that having walked in there expecting and wanting to be 'wowed', we were a bit disappointed, but if you are hungry, and want a 'rustic, Italian countryside, gathering' atmosphere, and maybe a  glass of wine with friends this seems like a decent place, to convene.\nThe food and service was not interesting or special enough to want to go back.", "author": "Rhani L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "Arrived during the week for lunch and was immediately seated. However, I feel like we got the worst seats in the house considering the restaurant was fairly empty - my boyfriend's chair was wobbly and it was an awkward spot. I wouldn't say the menu has many options but I'd compare to maybe Panera in the sense that they have soups, salads, paninis. I tried a half smoked salmon panini (definitely recommend) with a side of asparagus which enough to have me more than full.", "author": "Mikhaila M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Nice place, in the Dumbo area .food was fabulous , had the Milanese Chicken with salad Exellent 5stars:) loved it!!!\nEggplant Parmigiana was also good I had to try;)\n1other meal that looked good was the Old Fashion BreakfastThey have a Brunch \u0026 a  special menu. Serve alcohol drinks and make sure u have $ it's CASH ONLY . They do have a ATM in the back . My server Shakir was nice Guy.", "author": "Sandra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "I really liked the food here. We had the baby ribs the rotisserie chicken and the spinach meatball pasta all three dishes were amazing. My only complain would be that it's a cash only restaurant so it's a bit inconvenient. Other than that great place to eat highly recommended", "author": "Stefany M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-26", "description": "Mediocre and expensive. We were also overcharged and left hungry.\n\nWe were immediately seated on a weekday night. That was nice. Bread with olive oil came out right away. Boring white bread. Ok, fine, next, whatever. Ordered two cocktails at $11 each. They were fine.\n\nOrdered the Duck Prosciutto Crostini and was very disappointed by the portion size. Two crostinis with minuscule amounts of duck on top for $12 - or wait - I'm sorry, the bill came to $16 for those. I only noticed when we were walking home and I was remarking on how expensive the meal was. Can I have my $4 back?\n\nEntrees were boring. Raviolis were standard. The Linguine with Manila Clams \u0026 Broccoli Rabe for $18 was not worth the money. The clams were very tiny. They were Manilla clams so no big expectations, but the portion was also small. The portions needs to double for $18.\n\nAt the end we were both annoyed to have spent $100 on food and drink and be left hungry. \n\nThen to find we were overcharged on the appetizer sealed the deal. \n\nThe waiter might also learn to not interrupt conversations.\n\nEnough to complain in person about? What am I going to cause a scene about portion size in the restaurant? Of course not. But I will be telling others to go elsewhere as the food is overpriced and the restaurant experience does not make up for it.\n\nWe ended up eating somewhere else afterwards to actually eat. Also, reminder to check your bill to make sure you're not overcharged. Cash only, too, which was a pain. Go somewhere else.", "author": "John J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-26", "description": "Love the food , but old guy who served the food was very rude .dinner ; forget it , wont come back here. Water was over , he never asked how's the food ? Why do people work when they don't like their job .", "author": "Aman K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "The service was beyond excellent. Everyone from the hostess to our waiter were super friendly and super attentive. Our waiter (Josh, I believe) was perfectly attentive and always managed to check in on us at just the right time without being intrusive at all. \n\nWe ordered and shared the baby octopus appetizer which was simply amazing. It comes warm over slightly lower than room temperature potatoes and cold, ceviche like onions and olives right under that. The combination of all the textures and flavors was simply incredible. We loved this dish and wish there was more. It's easy enough for 1 person to eat it all, but since we both ordered pasta dishes for our main course we figured we could share it and it ended up being just right. \n\nI had the linguini special which included seafood and it was amazing. The chef took equal amounts of shrimp, mussels and some squid and distributed them evenly across the dish. The portions were just right. \n\nTo end, we ordered the Tiramisu and it was divine. It came in a martini glass which was a sexy touch, and it was rich, delicious and just enough for both of us to share. \n\nAll in all, it was a 4.5 star experience. I took .5 of a star off because the music was so random. We heard some salsa and merengue and although we like both, we feel that the music should reflect the cuisine as well as the dishes and inspiration of the overall restaurant. Apart from that, amazing time. \n\nThanks to the staff and the chef for a stellar evening.", "author": "Cyrus P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "The mozzarella was amazingly fresh. I also had hands-down the best tiramisu of my life. \n\nAnd I'm Italian, so trust me - I would know.", "author": "Francesca L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Great food with lots of healthy options and emerging looked and tasted super fresh. \n\nDownside:\nCASH ONLY\n\nNOISY between the loud music, the silverware being cleaned in the open kitchen and the gazillion toddlers screaming, I could barely hear myself", "author": "Qing X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Loved everything about this place! The atmosphere, the food, the waiter. The entire experience was top notch. We had the grilled octopus \u0026 meatball appetizers which were so good!! Then I had the rigatoni with sausage, cream \u0026 peas for dinner and it was perfect. Chocolate mousse for dessert was also excellent! The waiter shared his favorite dishes and we were so happy with them. The wine was phenomenal! Can't wait to come back here again :)", "author": "Terrie A."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}