{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-06", "description": "Came to AlMar because it looked so nice, the specials on the board outside turned out to be just items on the menu.  Waited about 35 minutes, which is okay for a Saturday night - but tables were open for 10 minutes, cleaned, before they would seat us or other waiting people- no sense of urgency or willingness to get people in tables, and the place isn't that big either.\n\nSo, the waiter doesn't introduce himself after 15 minutes, just says, \"So, you know what you want?\" We order.  They are out of octopus, tuna (our top two choices), and a few other things.  \n\nSoup was bland, candle wasn't lit, had to ask for pepper.  Maybe it just wasn't our night.  Main dishes were okay.\n\nWARNING: I guess it's on the bottom of the menu, but the place is CASH ONLY.  \n\nAll in all, disappointing.  The waiter laughed when we showed him we were charged $26 for a bottle of wine when it was listed as $25.  What's a dollar here or there?  Pretentious or nonchalant, I don't really care, service wasn't good.  Bathroom was a mess.  ugh!    \n\nGuess we'll trek back to Astoria next weekend when we have to be in this neighborhood and eat there.", "author": "Nicholas W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "Good restaurant, great food! Had a group of 10, so the service was a tad slow. Otherwise, great atmosphere! A great place for brunch :)", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "Found Almar by chance. Just walking along Front street.  It is a lovely place.  Simple decor, shabby chic, but really well tied up.  Sat at the bar.  Bartenders are very friendly and attentive.  I ordered the egg in a cloud. It is something like I have never tried before. Great twist on a french toast with ham and this cloud of egg white with the perfectly warmed up yolk in the middle.  A bit of spinach as a garnish. And voila... a perfect bite for a lunch or a brunch.  I am really looking forward to trying other dishes. Certainly coming back and recommending the place. Good for groups. Cash only, though. But there is an ATM in the restaurant and a branch of a mainstream financial institution across the street. Prices are reasonable.", "author": "P L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-29", "description": "Expensive food and small portions. Just okay to ask for these manhattan prices...", "author": "Wilson L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "I have never been to DUMBO before, but as a frequent eater at Brooklyn fineries, I was expecting some quality food and let it be known, I was not disappointed!\n\nI'm looking for classic, simple good cooking. Almar does that, and does it well. \n\nFirst and foremost, the service was impeccable. Our server Musa was delightful, charming, and very attentive. He made it a point to check in, chat, and give us insightful recommendations. Thumbs up for Musa!\n\nThe owner Marcello walked around as well with a smile and lovely conversation. I love to see an owner enjoying the fruits of his labor--10 points. \n\nThe crostini was tasty and simple--all the flavors of walnuts, ricotta, parmesan richly layered in an elegant three bite concoction. It wasn't overbearing and above all, wasn't too salty. I didn't feel the immediate need to reach for my drink. \n\nWhat really blew me away was my pasta dish, what I conceived to be an unusual mixture of thick homemade pasta, mushrooms and blueberries. What a rockstar combination. The sweetness of the blueberries totally balanced the earthiness of the mushrooms. This is a knockout dish: simple, understated, and filling in all the right ways.\n\nLove this place and will recommend to anyone who likes simply delicious food with excellent service.", "author": "Dana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-22", "description": "4 stars for DUMBO...3 if you compare to the rest of Brooklyn or Manhattan.", "author": "Navin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-03", "description": "I found AlMar through Chowhound, and booked a reservation for five for my friend's birthday dinner based on the good reviews and the menu.  We had an idea it would be good, but every so often, there's that rare, sensual restaurant experience that surpasses most everything you've enjoyed; it is THAT good.  This was our experience at AlMar.\n\nFour of us arrived at this beautiful, rustic, spacious restaurant, and started off with a plate of very fresh oysters, two different octopus appetizers, an eggplant ricotta bruschetta, and a delightful, reasonably priced bottle of red wine.\n\nThe octopus special had a tomato based sauce which was mostly just stewed tomatoes and not particularly exciting, however it had been cooked to soft, tender perfection.  The other, a grilled octopus appetizer which is a regular on the menu, was accompanied by onions, celery, capers, crisp green olives, and perfectly cooked white potatoes (*just* done, not too soft).  This was absolutely delicious in flavor, and had just the right touch of char in the grilling.  The octopus could have been just a touch softer, but was otherwise sublime.  I could not try the bruschetta (gluten intolerant), but when I asked my companion about it, his eyes rolled back in obvious delight.\n\nFor the mains, I resisted my initial urge to go with the roasted breast of duck with red wine cranberry reduction, and instead went with the red wine braised rabbit with polenta.  As luck would have it, a late-arriving friend sat next to me and ordered the duck, so I got to sample that, too.  I'm so glad I was convinced to go against my obvious first choice, but not because the duck was any less amazing.  Having tried rabbit on several occasions, I had nearly given up on it as a dish I prefer.  This version not only changed my mind, it put me into a state of pure, sensual bliss.  The chef absolutely mastered the preparation of this gamy meat and bent it to his will; the skin crisp and dark with the sugar from the wine it was braised in, the meat inside juicy and SO tasty.  The polenta  was creamy, buttery, wonderful.  As for the duck, the slices were buttery soft inside and crispy outside with the sugar from the red wine cranberry reduction, which added just the perfect sweetness to the velvety dark, rare meat.  It was accompanied by a lovely mashed squash dish.\n\nThe birthday girl and her boyfriend split a plate of pappardelle with porcini, cremini, shitake, oyster, royal trumpet and chiodini mushrooms with blueberries (!) and herbs that everyone at the table just raved about.  I was jealous that I couldn't taste it.  The friend to my left had Penne Alla Pizzaiola, which he said was wonderful.\n\nUnfortunately, we ran out of time before our show and didn't have time for desert, but it was a good thing, as we were quite full and warm with wine.  It was the perfect evening.\n\nI found out later that the chef and co-owner hails from the longstanding Brooklyn Heights outpost Noodle Pudding, which also receives very high accolades.\n\nBring plenty of dough.  This restaurant is *CASH ONLY*", "author": "Katie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-10", "description": "Very nice cozy atmosphere, the staff is very informative and friendly. Love what the chef cooks up in the kitchen! Great options for decent prices. Highly recommend.", "author": "Shaneace S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "Yum. Yum. Yum. If you go this this restaurant without trying their ribs you are crazy. It's sooo amazing. We also had the bean salad which was very good as well. I would definitely come back when I'm in Dumbo", "author": "Roger P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-08", "description": "When visiting AlMar, I was expecting the waiters and waitresses to be inattentive like I had read in some reviews here on Yelp, but I didn't experience any issues. The food was good. We had the whipped ricotta crostini with mascarpone, parmigiano, walnuts and honey. It was very tasty. For my dinner, I had the swordfish. It was a fairly large portion, so that was nice to see. It didn't particularly taste great, but it probably was about what I expected. My girlfriend had the black linguine and thoroughly enjoyed it, commenting a few times on how good it tasted. We were satisfied with all of the service and our bottle of wine, and will likely be coming back at some point in the future.", "author": "Jordan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "Almar is always great. Delicious food, changing menu with options for every palette. Excellent wine selection, very friendly \u0026 accommodating. I'm happy to see how busy \u0026 successful they've gotten - thank goodness Dumbo has this place!", "author": "Lisa K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "Cool ambiance.  Amazing bread - truly the highlight of the meal.  Loved the octopus salad and scallops.  Pasta dishes were just okay (and not just because one had blueberries in it) - interesting but lots of oil and butter and not enough taste.  Osso bucco with polenta average quality for a NYC restaurant.  Fantastic service.", "author": "Julie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "I went there with my bf for brunch on Sunday. Whenever I order for brunch, I always go with smoked salmon no matter what. This place, it was no exception and i ordered it. I never had such a mouthwatering smoked salmon plate ever in nyc!!! It was quite unique to have it with beets. I just loved it. Staffs were so nice and friendly. Also loved atmosphere. I will definitely go back!", "author": "Gina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-01", "description": "Went to dinner last friday before a performance at St Ann's. Dumbo is not my favorite place to go but Almar might make me change my mind.  The restaurant is warm with dark wood.  My mom and I shared a huge barley, fava bean salad with herbs and mint.  Had the whole fish special and a bottle of rose' with lots of character.  Food was thoughtfully prepared and our server very helpful and although we were stuffed, he brought us some refreshing lemon sorbetto.\nVery nice evening", "author": "Alicia V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-04", "description": "What a wonderful evening my husband and I had the other night at Almar! The food was just delicious!!!   We split the grilled octopus for an appetizer- grilled to perfection with just the right amount of seasoning.   My husband had the short ribs for his entrée and I had the roasted cod.  Everything was so FRESH, not too heavy and so good!!!  Even though we were so full, we had to try the dessert.  We had a chocolate mousse cake and the blueberry pancetta for dessert- YUM!  \n\nWe cannot wait to go back to Almar, as it is now one of our favorite restaurants in the area!  Great ambiance, reasonable prices and delicious food made only with the freshest ingredients!", "author": "K. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-01", "description": "We love this place.  We come here on a regular basis. The bresaola and arugula appetizer is delicious.  They always have really good specials.  The happy hour makes me very happy. :)", "author": "Megan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-14", "description": "Restaurants with entrees at $20+ really need to take credit cards.  This place has decent food, I just find the cash-only policy to be totally unacceptable in 2014, and a huge inconvenience to customers.", "author": "Julia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "Been living in Brooklyn 6 years and don't cook too much .. so we eat out a lot and this is the best all-around restaurant we've found in the boro.  It is the absolute \"go-to\" for brunch, lunch or dinner. Al-fredo and Mar-cello serve \"foodie\"-quality dishes without the \"foodie\" pretentiousness or the \"foodie\" over-pricedness.  The waitstaff is friendly, and they have have a great wine, beer and cocktail selection.\n\nIf you're there for brunch, the BLT is amazing -- and you can also ask them to add an egg.  The salads are delicious as well.  Lastly, don't miss the Tiramisu if it's on the dessert menu that night.  Cash only but this place won't break your piggy bank either.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-19", "description": "People - brunch isn't a tough meal to do badly. The service was atrocious but that didn't even matter when you account for the bugs flying in and crawling around the joint, lipstick on the water glass, and the most dried out over done egg dishes I've ever had. No apologies from staff or recognition that it took over an hour to bring out our food after three tables [who came in after us] were served. A real shame - DUMBO could use some new brunch spots. And whatever you do, don't walk by the kitchen before you eat because then you definitely won't stay for your meal.", "author": "S B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "Went for brunch. Great grilled cheese and egg style sandwiches, salads and coffee at good prices. Nice place and the waiters don't rush you to leave. But it's cash only.", "author": "Jonathan J."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}