{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-24", "description": "So i went here with two more people for a random weekday dinner. No reservations needed for the weekday but I have to admit, place was quite packed for a weekday. Rustic and innovative yet casual. I was pretty impressed with their idea of projecting a classic movie on one of the blank white wall( obviously noone was watching it).\nSo we ordered 3 Antipasti between 3 of us. Their portions are pretty small for an italian place actually. We had stuffed zucchini flowers- totally bland, no flavour. Then we had the roasted pepper bruschetta and the ricotta crostini. Loved the bruschetta. So flavorful. Crostinis were ok. As i said portions were small, we got only 3 zucchini flowers, 2 small crostinis and 2 avg sized bruschetta. Then we ordered eggplant parm and fusilli in ricotta sauce pasta to share between 3 of us since we werent that hungry. Eggplant was absolute delish. Lots of basil and herbs. Pasta was just ok too. For dessert tiramisu was the obv choice and let's say it was finished within the min, that's how good it was. In all the whole meal wasnt anything special but it can a good place for an average weekday dinner. \nP.S hostess was really nice and enthusiastic but server/waiter had kinda like \"i hate working here\" attitude.", "author": "Sakshi G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-26", "description": "Mediocre food. Poor service. No credit cards. \n\nWe had the fig bruschetta, the cod and short ribs. The short ribs were the only dish that had flavor. \n\nThe server, Danny, was so poor, he barely spoke to us and treated us like we were a burden. \n\nThe fact that this place doesn't accept credit card for their price point is very short sighted. They're saving a 2% fee and forgoing multiple drinks, appetizer and dessert courses because no one carries hundreds of dollars in cash these days. \n\nNo need to come back to this forgettable place", "author": "Steven L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Dinning at Almar was a delectable surprise! Located in the Dumbo area of Brooklyn, it has a chic and cozy atmosphere. The food was just down right amazing, the drinks were perfect every time, and the staff was so nice. I went with my friend and we each ordered two dishes so we could have more of a variety, let me say our palate's were so pleased!!!! \n\nYou will enjoy it. \n\nLisa M. Brooklyn", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "Egg in the cloud was great, I had it without the ham. I could have eating two of them. Seems like more of a family joint for Sunday brunch. Not a lot a drinking going on. And don't forget, cash only?", "author": "J K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-29", "description": "You know what I hate about eating out in NYC? The fact that you have to establish your street cred as a local in order to get good service. It happens everywhere here, unless you are a regular (and even then some places - talking to you Lupa - are too cool for school to acknowledge you regardless). But it's especially true in the really touristy areas. Listen, I get it. I was a bartender on a tiny tourist island for years. I was a bartender in New York. I think tourists often forget that locals actually have to pay to live in these ridiculously overpriced spots. On tips.\n\nThat said, I have never auto grated anyone. It is illegal unless noted and usually reserved for large parties. So when you decide to take your meal in the middle of mine without passing my table off to someone else, and I have to go to the bar to order my own drinks, and you grat me 20%, you will not get 20%. You will be lucky to get anything.  Hell, we could have walked out on the check, given you sat with your back to us for over 30 minutes.  This was the worst service I have ever had the displeasure of experiencing. I have no idea what we did to make you treat us so badly and I don't f'ing care. This the reason why people hate on Brooklyn so much.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "Stopped in for lunch after walking over the Brooklyn Bridge. Excellent atmosphere and service. Very unique menu. We all shared the caprese salad. Cheese was so fresh and creamy and tomatoes were so sweet you would have thought they were jersey tomatoes in July! My husband had the pork sandwich which I tasted and we both LOVED! Had pickles and caperberries on it! The only reason I can't give it 5 stars is because I didn't love my meal. I got the smoked salmon sandwich. Wasn't enough salmon in my book. All you tasted were the accompaniments. I would definitely go back and try something else!", "author": "Colleen N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-25", "description": "Service and food was decent enough, but portions are super small and expensive. The CASH ONLY policy is a big inconvenience. We live a block away but will probably never go back.", "author": "Pei Ying Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-06", "description": "Waited forever for my egg In a cloud to come and it was brought to me ice cold. The server was awful about it and after waiting 20 more minutes for it to come my party was finished eating so I told her to forget it and I left to get a bagel. Worst experience, highly discourage others from going here if the service is going to continue like this.", "author": "Anna M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-18", "description": "Rude, dirty and basically don't want kids on their premise. AVOID! Lots of other nice and welcoming options nearby...", "author": "Jo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "Another neighborhood gem! The lunch combos- soup and a sandwich are always my favorite. All the food is fresh and tasty!  The staff is always happy and friendly.", "author": "Maria S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-25", "description": "This is one of the only sit down restaurants in DUMBO. That being said, because there isn't any competition, they don't really feel the need to try. I live in the neighborhood and have been here a handful of times. Mostly for brunch, which is nothing to rave about. \n\nThe food is hit or miss, oftentimes, most of the stuff that comes out of the kitchen isn't particularly hot, and lacking flavor. The service is really what makes this place awful. The servers are lazy and don't pay attention to what you order, service is not consistent throughout the meal. They give you the wrong order, or they bring out the entree's before the appetizers. For now, this place will have to do as a mediocre brunch spot.", "author": "Alisa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "Almar is an affordable, delicious brunch option in DUMBO. Casual walk in, cute space with an assortment of small and large communal tables. Service is friendly and attentive, at least at this hour of the day. There will be people with babies most likely. So if you have an allergic reaction to strollers you may want to steer clear. \n\nThe Egg in a Cloud is awesome. They make a light as air, fluffy egg white supporting a baked yolk while pairing it with smokey ham and fontina. \n\nThe Almar Breakfast Sandwich isn't breaking any new ground, but it's far superior to most Egg/Meat/Cheese breakfast sandwiches you will encounter due to the ingredients used. \n\nIf you veer towards the sweeter side in the morning (or just want dessert), they also have a Nutella Panini which should not be missed. \n\nSolid Brunch Cocktails that extend beyond the usual Bloody Mary also round out a good morning selection. \n\nWill return and plan to check out for dinner.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "Came here for brunch. The Egg in a Cloud was amazing!  The egg whites are like meringue, they practically melt in your mouth; truly heavenly. The only reason it gets a 4 instead of 5 is the service is a little cold, not bad, just not very friendly or warm.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "I was introduced to AlMar a little over a year ago by a friend who lives in the building across the street and have been going about once a month ever since. I have never had a bad food or service experience. Sometimes there could be a wait but that's only because the atmosphere that AlMar offers is hard to come by in Dumbo, the rustic italian kitchen with old black and white movies projected onto the wall. The service is always prompt and my order is always put in correctly. The menu changes every so often to offer fresh food and variety. The egg in a cloud for brunch is my go-to and I either have one of their many delicious pastas or fish for dinner - both really flavorful! I do not know if the place is still Cash Only but last time I went it was.", "author": "Riki K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "I saw Anne Hathaway in here.  She was dining a few tables away.  \n\nOther than that, I thought the brunch food was very good, although it took forever.  I ordered the ham, egg, and cheese sandwich on ciabatta bread, but I couldn't concentrate on my food with Anne so close by!  I thought the farmer's market cheese was the best because it had  a very nice combination of flavors.  I did not particularly like the Bloody Mary because I thought they put too much horseradish in it.  \n\nCash only.  They have large communal tables with very rustic furniture. Wait time can vary depending on the time of the day/week.", "author": "Kiki R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "Food is a little bit pricey but interesting. You won't regret eating here!", "author": "Kalyani S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-27", "description": "I fell in love with this place!! Myself and great friends came here for dinner thursday night. once you enter you instantaneously feel the earthiness and coziness of italy, I felt like I was in the dining room of a Rustic bed and breakfast tucked away somewhere in a little village in Italy. I sort of had an idea of what to expect from the food simplicity and freshness and I wasn't one bit wrong. \nWe had\n\nthe ricotta crostini\nbeet salad\noysters with cucumber relish\nmeatballs in marinara sauce all were so delicious\nthen we had pasta dishes, the best thing about the pasta dishes was that SAUCE it was fresh and light, it reminded me of friend's nonas cooking \nand braised short ribs yum!\nfor dessert I really liked the chocolate hazelnut gelato or ice cream not sure\n\nooooo ooo I almost forgot the Sidecar cocktail so so belisimo!", "author": "Kathy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "This is the type of place I truly enjoy coming to for brunch. The food is fresh and tasty and the atmosphere is friendly and casual. I stopped for brunch with friends. We each had a cocktail--strong but good. \n\nI ordered a BLT which was perfect. The ingredients were fresh and the bacon was thick cut and delicious (nothing worse than thin, nasty bacon).  I don't live in the DUMBO area but if I'm in the neighborhood I could see myself coming back for another meal. The place certainly isn't serving fancy fare but the food is good and fairly priced.\n\nOur waiter was also friendly. He even noticed that my friend had only sipped her drink and asked if she did not like it and offered to bring her a replacement. Gotta love that.", "author": "Bethany P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-18", "description": "Not a terrible or traumatic meal, but all around not impressive either.  \n\nLOTS of kids running around playing.  I found the movie projector playing old movies a bit cheesy and a distraction, not quite hip or chic.  Tables were cramped...\n\nWe started with the caprese and olives salad (pre-split across two plates, nice!), and for entrees did a stuffed chicken dish and a pasta dish.  Both were just okay.\n\nAgain, not terrible, but I wouldn't go out of my way to come back...", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "Accommodating.  Mood lighting.  And delicious olive oil. Well those aren't the only things that stood out, but they certainly stood out. \n\nThey did not have place for my party of five  so they made a table (even though it was uneven) so we didn't have to wait. It is refreshing to have great service even in the middle of dinner service on a busy Saturday night.\n\nDim lighting: great for date night, not so much for my grandparents. \n\nFood: freaking delicious. Even my dad liked the cuttlefish with pesto sauce (I couldn't even get him to eat calamari before). And I found a new appreciation for olive oil. I don't know, it is just so good.", "author": "Adi S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}