{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "AlMar is one of my favorite Italian restaurants. The environment of the restaurant is very inviting, the lighting is fairly low, the ceilings are high creating an open atmosphere and the decor is homey with a touch of rustic. During dinner they projected the 1920 silent film \"Zorro\" on the back wall. It seemed like a nice little touch to make the place unique.\n\nBut what really stands out is the phenomenal food. To start with they bring out bread for the table with a high quality olive oil. We opted to also start with a bottle of wine. We went with the Bardolino, which came in a one liter bottle for 25 dollars. It was an enjoyable wine, and at 25 dollars it was a tremendous value.\n\nThe menus change daily, which is a perk and shows the creativity of the chefs as well as the use of seasonal ingredients. If the cured salmon crostini is on the menu when you are there, make sure to get it. It is only two little bites for 12 dollars, but those two bites are tremendous. The crostini is \"Vodka \u0026 Beets House Cured Salmon with Avocado \u0026 Crème Fraîche.\" The beets give the salmon a beautiful color like that of raw beef, and the texture of the fish melts in your mouth. Combined with the chewiness of the bread, the creamy fat of the avocado and the tang of the crème fraîche it all came together perfectly, with the flavors all melding together.\n\nFor my entree I ordered the pappardelle. The noodles were some of the best I've had in some time, and the combination of mushrooms that came with the dish were great. The sauce had truffle oil in it, and was subtle but very nice.\n\nI also thought the service was quite good. They don't rush you through the meal, letting you take your time and enjoy yourself even though the restaurant is quite busy. I will definitely be back here.", "author": "Casey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "My husband and I stopped in for a quick dinner earlier tonight. We ordered the Italian Lemonade and the South African beer. The lemonade was ok--nothing special, but the beer was quite good. For an appetizer we ordered the Caprese salad, and followed it up with a shrimp salad main. Despite the unconventional ingredients in the Caprese (it had olives and was served on a bed of lettuce), it was absolutely delicious. The ingredients were very obviously fresh. The shrimp salad was even better. The best shrimp I have had in a very long time, and the combination of the corn, tomatoes, shrimp, avocado, onion, and greens was perfect! \n\nThe service was great, they smiled all throughout and were the perfect combination of attentive and non-invasive. Considering I came in hangry, this was a feat of willpower and patience.", "author": "Asvy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "For the first time coming here, the overall experience was great. The venue itself is nice, the staff is friendly, \u0026 the food (the most important part of a restaurant) was delicious! Also, when you're w/ an Italian \u0026 they too approve of the Italian food you both eat- Well... That's a pretty good thing- Lol.", "author": "Franz F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "In DUMBO with friends.   Needed a place to eat so found this place on yelp.  What a find!  Awesome food great prices and great service.  Will be back.  Check them out and you won't regret it! Great drinks too!!!!", "author": "James R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "I had heard that I might have a hard time finding a good restaurant in the part of Dumbo where we were attending a production of \"Golden Boy\" at Gleason's Gym.  I looked at the choices posted on Yelp and read the comments.  AlMar stood out in the reviews having the greatest number of positive ratings so I made a reservation.  Last night four of my friends and I had an early dinner there and were very pleasantly surprised with the atmosphere, the warm, friendly staff, and the food.  The space might best be described as loft-like with pleasantly dim lighting and lots of space around tables with a long well-stocked bar on one wall that I imagine gets quite buzzy later in the evening.\n\nWe ordered wine and cocktails, all of which were fine and reasonably priced.  We started with the meatball appetizer, the beet salad, and the green salad-all excellent and large enough to share.  We enjoyed mopping up the delicious tomato sauce that covered the meatballs with the chewy, crusty bread.  Mains were rigatoni with sausage, risotto with a variety of mushrooms, spaghetti with manilla clams and grape tomatoes, orecchiette with roasted cauliflower and pork ribs with mashed potatoes.  We tasted each other's dinner and agreed that each and every one of them was delicious.  \n\nI highly recommend this most pleasant restaurant.  Oh, and let me not forget the music, which was unbelievably pleasant and at a decible that never intruded.  This alone would be cause for me to recommend AlMar as too many restaurants forget that people still do like to have conversation while dining.  I noticed two couples enjoying intimate conversation, something that would be impossible in many other restaurants.  \n\nIf management is reading this, I hope that you will not change a thing.  My friends and I had one of the most enjoyable dining experiences we can remember at AlMar and will definitely return whenever we're in the neighborhood.", "author": "Beverly K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "This is my 3rd visit for brunch and has not disappointed. They accommodated our large group of 13 easily with reservations made ahead of time. Their brunch menu uses fresh and seasonal ingredients, both adults and kids enjoy. I love coming here, it is now a go to for us Queens folk.", "author": "Juanita D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "Overall cool atmosphere. But the food was not great and it took us 15 minutes to even get menus and water. Definitely would not go back", "author": "Taylor S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-11", "description": "Came here for brunch on a weekday.  The service is slow, but staff is nice enough.  Cute place for a group breakfast and gatherings.\n\nHad the egg in a cloud.  I don't know why this dish is popular.  The whipped egg whites are kinda gross.  I personally don't like to eat foam and the egg whites have the raw eggy taste that can make u a little nauseous.\n\nThe brioche is tasty though and the spinach on the side are a nice addition.\n\nDefinitely ordering something different next time.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-08", "description": "Good food (we had short rib with polenta - yummmm \u0026 butternut squash risotto) good service (our waiter was helpful and nice), kind of romantic (dark With lots of candles) and CASH ONLY. Ugh. Hate cash only places. The other thing I didn't like were the drinks! Ughhhh.... Rubbish! I would never have another drink there. I would only go back if I'm in Dumbo and really hungry. I wouldn't go out of my way to visit again.", "author": "Joannitte R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Lovely brunch of savory eggs. Waitstaff friendly and flexible.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "Former talents from Brooklyn Heights' Noodle Pudding, another one of my favorites and definitely worthy of a visit, bring their genuine sense of hospitality and passion for honest Italian fare to Dumbo. \n\nThere's something for everyone, and while the menu doesn't change a whole lot from day to day, I've still been coming here 3-4 times per month for the last 3 years. It's that good. Start with a rotating selection of cheeses and cured meats, then move on to Alfredo's Meatballs. For your main dish, you can't go wrong with any of the handmade pastas, and definitely try the prociutto-stuffed pork chop or whole Bronzino if they're on the menu. Vegetarians out there will be impressed by the Kale salad, which completely blew this die-hard carnivore away. The dessert menu doesn't contain anything you haven't had before, but the Tiramisu and Tartufo are among the best in the city (in my humble opinion). \n\nEveryone should have a go-to restaurant in NYC, don't you think? I'm super happy to call AlMar mine.", "author": "Edward K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "The white sangria was not good and cost $11 each.  The sandwiches are usually good.", "author": "Corey B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-28", "description": "What's it like to eat at Al Mar?\nIt's like waiting 15 minutes for the host to sit you while 4 tables remain empty. Then when asked if we could sit, the host shrugging and mumbling \"I guess wherever you want.\" \nThey're basically the only real brunch spot in Dumbo, and their host acts like it.\nThen the wait for the waiter begins...bring a good book.\nDisappointing.", "author": "Hunter V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "I have mixed feelings about my experience here. We went in right at opening on a Sunday for brunch. We were most interested in trying the famous egg in a cloud. But the oven wasn't hot enough for the chef to make it. So we ordered other meals. I could tell that my meal should have been good but it was cold. Everyone else's was hot so idk why mine wasn't. I was ready to give a lower review but just as we finished, they brought us out a free egg in a cloud. The incredibly niceness of the staff, the delicious coffee, and the unique menu earned this place a better review. I would go again in the hopes of a warmer meal.", "author": "Maria C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "Noted: \n- delicious smell of seafood upon entering \n- attractive decor\n- crowd was mostly AARP, but that could have been the pre-theater hour\n\nAte: \n- salad of arugula with beets, orange, pistachios - fresh, crisp, delicious\n- appetizer of mussels in white wine sauce - plump, juicy, also delicious\n\nI did not get to try the linguine with seafood, which I attempted to order; my friend Tardy McTarderson was 15 minutes late, and the waiter was told by the chef that putting in an entree order at 7:05 would put into jeopardy our 8pm curtain a few blocks away. I realize this isn't fast food, but we were surprised that all but two of their entrees (short rib and lasagna) can't be produced and consumed within the confines of an hour. We were thus limited to those two entrees or apps, salads, or crostini. In the end, I really liked my salad and mussels, and I left with a favorable impression in spite of myself.\n\nCASH ONLY!", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Came for drinks and food while visiting a friend and had a great time. The bartender suggested some delicious wine and everything we ate, from the fresh oysters to the salad to the two different crostini apps were amazing. Wonderful food and service from a restaurant that clearly cares about serving quality ingredients.", "author": "Athena L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "You can never go wrong at Almar. The food is always good, never had a bad meal here. The staff is friendly and the hostess very pleasant. Probably the best place to eat in Dumbo. The only criticism I can think of is they only take cash. If they took credit I'd give them 5 stars.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-16", "description": "Great italian food and delicious drinks. The greenest olive oil I've ever seen accompanied the bread. Order the lasagna or the red snapper. Cozy atmosphere. I need to come back here to try more items on the menu.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-16", "description": "This place has all the worst things about NYC restaurants. Over-priced and mediocre food. We had high hopes based on the Yelp reviews but seriously what was everyone else thinking? The egg in a cloud dish was bland. The panini bread was just okay. Honestly I feel like I've had the same kind of food from a convenience store. The only saving grace was the cappuccino which is what the second star is for. Really wish we had spent that 60$ on something worthwhile.", "author": "Mariam D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-10", "description": "Nothing is made fresh. \n\nPasta was from the box. All 4 in my party had over cooked pasta. Appetizers were 2 bites and poor quality. The bruschetta was one piece of bread cut in half, the cheese plate was four slices of deli thin salami and cheese improperly carved so it was really crumbled half slices. \n\nAfter $200 and only 1.5 hours of drinks, appetizers and entrées the waiters (plural) and the next patron stood around our table to forces out after. Never again.", "author": "Kay Z."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}