{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "Love the atmosphere and the food is incredible. Get the Egg on a Cloud!!! They also project shows on the back wall which was great for the three kids we had with us (ages 3,4, and 9).", "author": "Brandi H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "I ordered the egg sandwich and didn't expect it to be as good as it was! Excellent Italian fare with good group behind the bar.", "author": "Janessa D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-18", "description": "Great location but HORRIBLE environment, food, staff, and hygiene. \n\nDon't waste your cash.", "author": "Jess G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Walked across the Brooklyn Bridge as a tourist,  came across this place. Great brunch this Saturday morning. Very creative menu items, on a whim tried the Eggs in a Cloud which sounded strange on the menu but turned out to be delicious.", "author": "Marc F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-27", "description": "When I first saw this restaurant on yelp, My initial thoughts were that I must try it due to the amazing reviews. I came into this restaurant as a group of 3. We were sat down and offered water. We ordered our appetizers shortly after. (Calamari was amazing, Great aioli sauce). Our waitress was not attentive at all and left LITERALLY LEFT and other people were taking our order and bringing out our food. We then receive our bill and it is time to pay. Now usually my friends and I always tip amazing, but due to the service we received we chose not to leave a great tip. ( we left him 10$ as a curtesy). Now we leave the restaurant and literally are chased down the block by the waitress WHO LEFT OUR TABLE stating that the tip isn't enough etc. I find that to be very rude and unprofessional. I have never experienced anything like that. He had the nerve to hand back the check and ask for a better tip. If you want to be tipped well 1. Treat your guest with respect \u0026 be attentive! 2. Don't leave the table! Food was amazing, but customer service is a -10. Hopefully IF I choose to return that pendejo is no longer there. Such an embarrassment.", "author": "Antonia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "After recently moving to Brooklyn Heights, my boyfriend and I were on the hunt for the perfect brunch spot. We came across AlMar and I have to say, it's now one of our go-to's. I had family in for a short visit and I made reservations for 6, they had a huge table set up for us and the time we spent there was great. \n\nThe food is scrumptious! -- they have a simple breakfast that's really tasty if you're an eggs and toast kind of gal or they have pancakes and French toast for more of a sweet tooth. I can't forget to mention their kale salad - !!! \n\nAll around good selection of food and also a full bar.", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-14", "description": "Really nice place for brunch/lunch in Dumbo after walking across the bridge!  My sister had the BLT, which she said was hands-down the best BLT she has ever had.  I had a lovely lentil soup and half-salad portion as part of the lunch special.  It was very tasty, but I wished the portions were a bit bigger.\n\nWe sat at big communal tables perfect for people watching and enjoying the nice atmosphere.\n\nService was a bit hit-or-miss; the waiter seemed to be quite overwhelmed serving multiple tables, and I had to keep asking for coffee refills -- I need like several barrels of coffee to get going, so maybe this is on me.", "author": "Erin E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "I'm not a big Brooklyn fan because it just seems so far from everything to this die hard Queens/Manhattan chick. But still, certain parts of this boro holds a special place in my heart, thus Dumbo area being one of them.\nHad a lovely time at AlMar! Host was very sweet and so accommodating when our 3rd dinner partner showed up a tad bit late and we had to move to the table right next to us that could accommodate all of us. Food was very good, presentation for our first course was nice but for the pasta entrees a bit lack luster but still delicious. We started with a few specials of the night, a fresh burrata with heirloom tomato quarters and a few sprigs of romaine, lightly dressed veggies with the creamy burrata was delicious; the chilled asparagus salad with orange segments, pecorino cheese and a sprinkling of toasted almonds was very very refreshing; also had the grilled octopus serving with fingerling potatoes and olives...the octopus was unfortunately very tough but the accompanying potatoes and olives simply dressed in olive oil and were delicious. For our entrees we ordered a mezzi rigatoni in a delicious sausage tomato ragu and also a potato gnocchi dressed in a braised short rib sauce. The gnocchi were melt in your mouth amazing and the sauce was not as heavy as I had expected and accompanied these yummy little puffs of potato goodness perfectly. For dessert we had a flourless chocolate mousse cake that was pure heaven. Our server was super easy to work with and really easy going and not hovering. The decor is very rustic and simple, but at times the noise level was ear piercingly loud so it was hard to talk amongst my group of 3.  Still a solid place for a group or a date night.\n\nWould have given 5 stars but one got knocked off because it's CASH ONLY!!!!", "author": "Jenn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-13", "description": "Stopped here for lunch ... decor is cool.... good service ... food was good... I ordered the turkey burger .. it came with small potatoes.. before my order was brought out , the waitress came to me to say they ran out of the bread for the turkey burger, I thought this was odd being that it was 1 in the afternoon... but she offered to give Me pumpernickel bread instead... I took it .. burger was good .. nice little place to grab a bite", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "the eggs on a cloud are to die for. by far the best dish on the menu. service was very good", "author": "Manuel N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "This place was a cute an unexpected find in our walk across the Brooklyn Bridge on a beautiful Saturday morning. I didn't think we would be able to get in any place decent without a reservation, but lucked out. Adorable little neighborhood cafe. Decor was industrial chic/cozy. I ordered eggs in a cloud which was eggs whites whipped up and yolk in the middle. Underneath was a nice slice of grilled ham on top of sourdough bread and grilled spinach on the side. My daughter had the egg on toast and my husband had traditional eggs, bacon breakfast. Everything was great. Food presentation nice, cooked to perfection. Staff was super friendly. Note that this is cash only establishment. Definitely recommend if you're in Dumbo.", "author": "Beth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Atmosphere and service was very good. Food didn't disappoint. I would appreciate a better beer selection with more local brewery beers. With that said I will return and recommend this eatery.", "author": "Ricard M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "Went there for lunch on a weekday with three visitors from overseas. We ordered 2 different pastas, one panini, and one bruschetta. All underwhelming. Maybe weekend brunch is better.", "author": "Anita F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "AlMar is a great local Restaurant, whenever I have friends from all over the world over I come here, the location is perfect to see the manhattan skyline and then go to this small boutique restaurant and enjoy your cocktail (really good) and the food outstanding... I highly recommend this place, the service is super nice and very friendly to talk to...", "author": "Yusuf O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "This was my first time here, but my sister comes here often (as she works in Dumbo). We arrived in the middle of the day on a Saturday, and it was pretty packed. We were told the wait would be 20 minutes or more but it was only about 5 minutes before we were seated. I was told everything on the menu is absolutely amazing, and although I can only speak about the turkey avocado sandwich, everything looked great. The food is so fresh, flavorful, and at a really great price. I will definitely be coming back to try more of the menu!", "author": "Emily M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "I honestly can't believe there aren't more 5 star reviews. This is a great little spot. This is not the usual Italian spaghetti and meatballs joint, it's a modern take on rustic Italian cuisine with excellent ingredients and great prep. I work in the neighborhood and have stopped in many times for brunch and dinner and have never had a bad meal--and the prices are totally reasonable. Marcelo and Alfredo, the owners, are lovely guys. If you're in the hood, stop in.", "author": "James U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-08", "description": "Stopped here for a quick lunch. Got a cup of soup to go for over $5. Umm... I think they forgot to fill the container.  This is not a glass of wine where you use a huge glass for four ounces. If you are going to charge that much for soup splurge for the correct size container so we don't feel cheated. Had I known, I would have gone a few doors down and got organic soup for $3.95- filled to the brim. What a disappointment!! Perhaps dinner is better. But I'm scared to try. \nI will try to include a picture to show that I am not exaggerating.", "author": "Q G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "Uncomfortable seating, but very soft service.  Three of us had dinner mid-week, and had no pressure to leave our 4-top, even after having finished our meal.  We were sitting and talking for about 45min after we  had stopped eating and ordering.  Water was re-filled, and no pressure.\n\nThe food was mehhh.  I had a salad to begin, and the half-chicken as my main course.  The salad was fine, and the chicken was not moist but pretty dry I felt; also, I thought it could do with some more seasoning.  The side-potatoes were tasty.\n\nWe had wine, and tap-water.\nNot bad, but not something which stands out for me.  In this neighborhood though, there are limited choices and this might be a nicer option.\n\nI didn't pay for this meal (I paid for wines), and note it is cash-only.", "author": "Liam R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "CASH ONLY\n\nWent here for dinner with a few friends .  If you are looking for high quality food at a decent price in the heart of dumbo then you will want to hit this place up.\n\nThis restaurant has a really nice decor and atmosphere.  The way they have it arranged makes the seating feel intimate without feeling overly crowded.  They always have a cool old move playing in the back on a projected on the way. Even though there is no audio it adds to the experience.  The restaurant is fairly dimly lit.\n\nThey have a decent draft selection and make above average cocktails.  Pasta dishes will run you around ~$18 and full entrees somewhere in the mid To upper 20's.  The portion size are medium to small but dishes are full of flavor and well plated.  Meals are served with fresh sliced bread and olive oil.\n\nOverall I think you can't go wrong if you are looking for a good place to entertain but you can find better restaurants in the area.", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-04", "description": "My Girlfriend and I stopped by for lunch yesterday, we can't fault the taste of the food, I had the old English breakfast it was good, however a little on the small side and my missus had the breakfast sandwich with avocado, (I should have got that!) and like I said food was great. The whole experience was ruined by a member of staff though. As I went to the rest room my girlfriend asked for the bill and she put a little money on the tray, when we dine we take it in turns one pays the bill and one sorts the tip, as I returned to my table obnoxious waiter had already visited the table and noticed there was no tip, and as I passed him he bluntly said \"TWENTY\" I assume he meant % for the tip... as I sat my girlfriend said he came to take it but when he saw there was no tip said I'll come back, that in itself should have been enough I did not need prompting, it sounds like I'm being petty but the whole interaction made me feel very awkward and ruined the pleasant experience we had. I begrudgingly left 20% as the other staff were lovely but he was a dick!", "author": "Matthew L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}