{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-20", "description": "The dishes here seem to be combinations of hit and miss choices for me. I got the mackerel, which was a much larger portion than I expected which came with sautéed spinach which was more delicious than I expected but which came with olives that felt random and intrusive. \n\nI was thinking recently about how most red meats sort of have similar textures and flavor profiles but their rabbit ragu was still quite a standout. Sooo tender.\n\nFor some reason I felt a little stressed by the ambiance, even though it was filled with charming rustic furnishings and had lots of space. Perhaps simply because it was a crowded night and waiting for service felt like being on hold on the phone. \n\nAltogether, the quality and tenderness of the food definitely matches the more upscale price point but everything feels a little safe. Seems to check all the boxes for a conventional first date spot.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "Largely a hit or miss spot. Good kale salad, barley salad, and some good sandwiches. Eggs are over cooked and prices are typical of Dumbo: overpriced for what they offer. \n\nArugula is dry, sometimes the barley is over cooked. Sometimes the greens feel like they've been sitting out for a while. As I said, hit or miss. \n\nService is always on point even when it gets busier, which is awesome. \n\nIt's cash only which is ridiculous. I guess taxes are too burdensome for them. \n\nUPDATE: They take cards now and their quality is a lot more reliable!", "author": "Yurn T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-29", "description": "I went here with friends for lunch over the weekend, and the interior decor of the restaurant was cosy and well-thought out. The food is okay... nothing special and not bad. It just didn't stand out to us.\n\nHowever, beware. This establishment charges an extra 4% for you to use credit card to pay your bill. I don't think that this is right. 4%! I mean c'mon. I most likely will not be coming back because of this new extra surcharge.", "author": "Etienne L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-17", "description": "Bland food and mediocre service. Not a place I would bring visiting friends. The restaurant is large and food is reasonably priced but I was extremely disappointed by the quality.\n\nCame for Sunday brunch and was told they couldn't seat three of us at a four person table for fear of \"messing up the flow\" even though there were many tables available. \n\nEgg in a Cloud: We came to try (and take photos of) this. I was impressed by how fluffy they made the egg white. It really looked like a cloud. It didn't have much taste but the bread, ham and cheese below were good. The spinach on the side was also super bland and watery.\n\nBurrata Salad: Lots of olives, super bland, salad had no flavor but burrata was okay.\n\nCrispy Risotto Cake: The risotto was super tasteless and extremely under salted. The presentation was unimpressive - a risotto pancake blanketed by two sunny side up eggs. We couldn't taste the butternut squash at all.\n\nBellini: The bellini was decent for $8, a little strong but manageable.\n\nAll the dishes had very basic taste profiles so they shouldn't haven't have been hard to get right but every single one was disappointingly bland in its own way.\n\nBesides the food, the waitress also didn't tell us that there was a 4% processing fee for credit cards. We didn't find out until they'd already processed our cards.", "author": "Elizabeth L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-28", "description": "Had an early dinner last Tuesday. What a cute joint. We had a cocktail each, both super yummy and well made. Then the bruschetta with ricotta, honey and truffle parmesan. Not your traditional bruschetta but very delicious. I liked that it was on a country style soft crusty bread. Then I had the risotto cake and my fiance the barley salad. The risotto cake was so inventive and delicious. I will definitely try to make this at home. The barley salad was delicious too, I do wish it was warm, but very nice. I found them both a little under seasoned, but still delicious. Then we had dessert, lemon sorbet and the hazel chocolate torte. They were a great combination. The torte so rich and the sorbet tart and refreshing. We will definitely go again.", "author": "Sunita S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-01", "description": "We were brought here to try some awesome New York, New York food. The place is really nice inside, and although it was starting to get dark, but not quite dark. The place itself was barely lit, probably to give it a more intimate feel, cute. That is if I had glasses on, but silly me I am still replacing those. Luckily I had a friend read the menu for me. We got our wine and pork ribs for me. While we waited for the entrées to be made, we were given bread and as much water as we could drink. It would've been pop or something, but refills are not free, total pity. Not that we needed any refills, because I had to use the bathroom, that's when I found out, only one toilet. So then I had to wait for a few people to use it. Bathroom is really small, please use at home if you can, if it's an emergency and you're already here, you'll see what I mean. So now back to the food which has finally come. I just didn't like the way the pork ribs were cooked, they tasted like they needed more time cooking, but then again it's pork, so it could've just been the meat. There was this interesting condiment which tasted like ground mint, I only used it twice, and just couldn't have anymore. The mash was excellent, you have to try really hard to mess up potatoes. My friends enjoyed their dishes, but thought the pasta dish had too many greens and not enough of everything else.", "author": "Tai P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Wow, so happy we tried this spot for brunch today. I remember when it first opened years ago in Dumbo, when I lived down the block. I've never been for brunch, and finally did today.\n\nGet the egg in a cloud and the crispy egg risotto with squash and Parmesan. Also, get the latte, which comes in this day-fueling mega mug.\n\nThis spot is refreshing non-pretentious and surprisingly affordable in an area that's changed a ton, for better or worse. \n\nI'll be back, AlMar! \n\n5 Stars!!!!!!", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-22", "description": "Came here for a quick lunch spot since we were around the area. Cute little spot! Loved their food and vibe there. Their service was good as well. Brought my best friend there to grab lunch before she was proposed to.  There was a little corner spot there that looked like a dining table of someone's house and gave off the 80s vibe for some reason. Should try! Look at what we ordered", "author": "Helen Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "First date spot and first anniversary here with my girlfriend. \n\nGreat cocktails. Great atmosphere. Cozy, sexy, comfortable and well lowly lit to set the moods. \nFood is always good here. The lasagna and the papardelle dishes are musts. Almar never disappoints and i hope its here for years to come so I can come with girlfriend every year.", "author": "Pete A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "I arrived at 1PM and had a short wait. I put down my phone number and walked around the block. The receptionist called me just when I walked up to their entrance again. I really liked the phone call system as some places require you to stick around in the blazing sun until they're ready. \n\nAdmittedly, I came here for their egg in a cloud because it was enticing and a beauty. However, I ended up getting their smoked salmon panini while my boyfriend ordered their egg in a cloud. We also shared roasted potatoes ($5), which was pretty hard and pricy for simply potatoes!\n\nI was not surprised to find that I liked my smoked salmon panini much better than the egg in a cloud, even though it's more of a sandwich than panini. I wasn't fond of the bread, but overall my \"panini\" was filling and delicious, while the egg in a cloud is a novel idea but not excellent. I'd say the taste is a more airy version of an egg, ham, and cheese croissant.", "author": "Ruby D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "Egg in a Cloud put me on cloud nine! If you see a photo of this beautiful brunch creation and are not exactly sure what it is, here's the description straight off the menu: \"Baked Egg Yolks in Whipped Egg Whites on top of Toasted Brioche with Smoked Ham \u0026 Fontina Cheese, Served with Sauteed Spinach\". If that doesn't sound delicious to you, we need to talk. The egg whites are so fluffy and all the textures complement each other nicely. The price is a reasonable $14 for a very filling brunch, which is basically two meals already! \n\nI called for a reservation for Saturday 11:30 brunch, but the restaurant was not that busy before noon. So when we arrived, there were still several unoccupied tables. This was not the case by the time we finished our meal - there seemed to be a long wait. I would still recommend just making a reservation. Location is super convenient if you're exploring the Brooklyn Bridge and Dumbo. \n\nMy reasons for four stars instead of five: an annoying fly buzzing around us during our meal (restaurant is open air) and the somewhat pricey avocado side ($4). \n\nThey are not cash only anymore and do take credit card!", "author": "Melody L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-29", "description": "Food was fine. Nothing special. Service was friendly enough. I suppose I would have given it three stars, but then there was that extra 4% For what you ask? Well, for using a credit card. No mention of this ahead of time. No mention from the server as I handed over my card.  I wouldn't have gone back anyway, but that 4% is reason I'm writing about AlMar here.", "author": "Steve X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-27", "description": "4% processing fees for using your credit cards.... it seems like this is not a good idea....", "author": "L J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-13", "description": "Just had such an amazing lunch at this restaurant. The food was very tasty the portion were very good.  The Manager Alfredo  stopped by to ask how our meal was and of course I thought that was so awesome.  Will definitely be back.", "author": "Teresa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-29", "description": "We had two sandwich and coffee for brunch, it was very good. However 4% surcharge if we use credit card is ridiculous, good thing we had cash", "author": "Tina F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-20", "description": "Panini was good but small and pricey. But the waitress was absolutely horrible. Felt like she was doing us a favor by taking an order. Had no manners. Was closing daily tickets by doing the work on some noisy electronic device 10 inches from my head. When asked for a box and the check she continued to do her noisy work as if we didn't ask. Asked to get change back on my bill and she never returned ... A shame to have a worker like that working in otherwise a nice place. \nI will never return.", "author": "Ronit C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-06", "description": "We arrived in Brooklyn on a Friday afternoon after visiting Ellis Island and, based on Yelp reviews, we decided to eat here for a late lunch.\n\nThe restaurant is not large, and had been crowded at lunch time because we got there late and most tables were still taken.  It's a fairly noisy room given the high ceiling and lack of anything that resists noise.\n\nWe had the caprese panino, the farm salad and the chicken marsala.  The panini lacked much flavor - it needed fresh basil (a tiny piece there), which the restaurant could have grown by the barrel given their huge sunny windows in front.  The rest was good, not great. My glass of wine (Donnaluna) was expensive. \n\nOverall, an ok stop but nothing really special.", "author": "Karne N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-19", "description": "I almost wonder if I ate somewhere different than all these other reviewers. I liked the size of the menu and the restaurant is a nice location and size. Unfortunately that is where the likes ended, the host was kind, the server although a busy Saturday was distracted and didn't come to check on us at all. Grossly underseasoned, underwhelming and overpriced. I picked around the sandwich, left the salad untouched and yet that raised no concerns when the plate was collected.", "author": "Cibi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "Wow an amazing place for southern Italian food! So fresh and delicious!!! I had so much food bc I couldn't decide what to get!!! Ricotta with honey and walnuts, burrata with prosciutto and pomegranates, grilled octopus, pasta with clams, bresaola with arugula and artichokes, a whole branzino--so moist and delicious---lemon sorbet!!! Such an amazing and warm place with food done with care! I can't wait to go back!", "author": "Anne L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-26", "description": "Not sure how this place has 4 stars. Deserves no stars at all. The 4% credit card surcharge is outrageous, credit card companies, on average,charge 1.5% and only Amex charges 3.5%; these people are definitely pocketing the difference. The food is bland, the staff is rude, and menu is not for an \"Italian restaurant\". I do not recommend this place to anyone.", "author": "Chris M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}