{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "We were staying in DUNBO for the week and luckily came across this gem for lunch one day. It was so good we retuned for dinner, then breakfast!\n\nLunch: We stuck to the specials and had a beautiful simple white bean soup, a luscious salmon /avo/beet sandwich on pumpernickel, and a fresh and delicious nicoise type salad. Loved it! Great attentive service and plenty of room for our baby stroller, too.\n\nDinner with friends: everything was stellar!! Seafood linguini with orange, fresh pasta with bolognese (amazing), crostini with ricotta with walnuts and honey, and a light wonderful tierramisu.\n\nBreakfast: try the floating egg island dish- lovely with sauteed spinach. Very good coffee. Yogurt and granola dish was light on the yogurt so we had to ask for more but it was yummy. The owner remembered us every time and was a sweetheart. We wish we lived in Brooklyn so we could come back all the time!!", "author": "Patsy D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-31", "description": "I am local so I really want this place to be good, but it's just not. Below average food, abrupt service and a shabby interior, for above average prices - and you leave smelling of either grease or garlic. Not cool.", "author": "Sheena M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "Showed up at 5:30 on a Wednesday and was happy to learn that it was happy hour. Bought one cocktail, got one free! The kitchen didn't open until 6 but we were kept entertained by the World Cup game that was being projected onto the wall of the restaurant. Loved the ricotta bruschetta, our appetizer, and the spinach fettuccini alla bolognese. My boyfriend really enjoyed the ziti with veal and onion.", "author": "Jamie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "Any place this busy on a Monday is worth a try. I had the Caprese salad with tasty olives, tender lettuces and delicious kumato tomato; accompanied by a nice fruity white wine. The servers were attentive without hovering. This is just over the Brooklyn Bridge so it's a great place to take my visiting friends when they fear to leave Manhattan for the wilds of Brooklyn.", "author": "Debra P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-02", "description": "The staff is friendly. The atmosphere is cozy. The bread is delicious. But the sandwhiches we had were a little bland. Not bad, just nothing special.", "author": "Nicole G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "This place is amazing! There were five of us, and all we had was really tasty and felt very healthy. The pork sandwich, the salmon sandwich and the soup of the day were our favorites. We will definitely come back!", "author": "Anna E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-25", "description": "We stumbled upon AlMar on a trip from Texas this December.  It was EXCELLENT.  We initially only stopped in for a drink, but when the staff were so outstanding, the menu so tempting, and the Christmas decor so inviting, we ended up getting a whole meal.  Several staff members went above and beyond to give us advice about what to do in Brooklyn (even giving us a guide book and staring key pages) and the locals we  met were extremely friendly and helpful as well.  It was the highlight of our trip to New York.  Highly recommend !", "author": "Claire G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "Came here for brunch. Ordered the egg on a cloud and a smoked salmon panino. All very good; my one complaint is that although quality over quantity may be a good argument for any other meal, those expecting a very filling brunch might find their stomachs still somewhat empty. The menu would be more befitting for a light breakfast. Coffee is very good, although the Decaf loses so much of the darkness I think it may be a different blend entirely.", "author": "Dylan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-15", "description": "It's a brunch place in downtown Brooklyn that actually lets you make reservations.  If that didn't sell you then I will also add that the food is very good.  It's cozy, its comfortable, it's inviting and did I mention they take reservations?  If you want to go to brunch with a big group, this is the place to do it.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-07", "description": "The lasagna here is fantastic. You can definitely tell that it was made with fresh pasta. The meatball dish was bland other than an overpowering basil taste. The staff was attentive and above average. The bar menu was definitely made by an amateur. A few of the single malts were listed incorrectly in relationship to what they actually had (which wasn't much) the wine selection was also below average. Three stars because the lasagne dish was that good.", "author": "Robert H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "My raucous running club rolled in here to carb-load for an upcoming BK half. Despite some confusion over our party size (we went from 8 to 12 to 10 in a matter of hours) they were accommodating (although for the party of 12 they wanted us to do family-style prix-fixe).  We ended up with a smattering of appetizers, amazing crostinis and bruscetta, meatballs and beet salad.  All were delicious although I never got my hands on the ricotta salata bruscetta which made me a little sad!  I went for a pasta special: baked orechiette with tiny meatballs and tomato sauce and mozzarella (basically a fancy version of baked ziti), which I enjoyed thoroughly.", "author": "Kristina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-23", "description": "We live in DUMBO so AlMar is one of our few options for dinner or brunch within a short walk. We like the ambiance and the food is good--we also appreciate that they usually have some decent, interesting options for vegetarians. We particularly like their brunch.\n\nThe two drawbacks to this place are 1) that they only accept cash and 2) that their service leaves a bit to be desired (both waitstaff as well as bartenders--the female bartender in particular seems cranky). Everyone always just seems slightly bored and as though you're putting them out if you ask for anything. And cash only? I know there are drawbacks for businesses with credit cards, but it's a bit ridiculous that a place like this, with prices like this, doesn't take credit cards.", "author": "Taren W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "I made the mistake of ordering a corned beef sandwich from an Italian restaurant on St. Patrick's Day.  I was walking by, saw the chalkboard sign advertising the sandwich, went in, and ordered from the hostess.  No price was clearly posted, but I wanted one regardless, thinking it was a decent restaurant and could at least make an average sandwich.  You know where this is going.  I basically got back a bad, deli-style corned beef PANINI - no heaping c-beef on soggy rye. Not even a pickle to go with it. I work in the neighborhood and have been forced to go here before due to the lack of good options in DUMBO.  I'd typically give it 2 stars, or maaaaybe 3 with excellent service.  Before I could see the sandwich I was dealing with I had already paid the $14 - thinking I was getting some fancy heaping CB.  I couldn't believe what they gave me. When I complained, the guy said 'sorry brah\" with a smirk.  Made me want to Trump him in the face.  Any restaurateurs reading this, please open up shop here.  I've now got one less place to go in the culinary desert that is DUMBO.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "This place is a true gem! We loved the atmosphere and service. Our waitress was friendly and attentive. When she found out we were new residents of Brooklyn, she provided us with complementary desserts as a welcome token. We plan to come back on a regular basis as the food is delicious and the environment is warm and cozy.", "author": "Cris G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "My wife and I live in Dumbo.  This is our favorite restaurant.  The food is fantastic and plenty of options.  I almost always order the branzino and one of the bruschette.  Marcello and Alfredo are the owners -- super nice and accommodating.  If you are looking for a comfortable scene and delicious food without any pretense, I suggest you hit up Al Mar.", "author": "Carter W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "bitches' be trippin'.\n\nthe food + service + over-all feel of Almar is the jam.", "author": "Kathleen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-23", "description": "Owners and the food are the BEST...simple as that.  Spend the whole day there...I have on several occasions.", "author": "Patrick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-23", "description": "Truly amazing food. I could eat here every day! The daytime specials don't change as often as the evening ones do but that doesn't mean there's no variety. All of the food is very fresh without any additives. You can't go wrong with the egg toast or any of the panini, best of all, They TAKE CREDIT CARDS now!! Not to mention, Everything is very well priced for a restaurant in Brooklyn.", "author": "Chris T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "I ordered tuna salad and it was delicious, light and tasty. Ingredients were so fresh. They have good lunch menu deals, so it's a good place to go if you work in the area. Service is very nice and the place itself is warm and cozy.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "Great Lattes and brunch. The asparagus bfast egg thing is really delicious.  Also I love their crostini and bruchetta.  Just always a good meal.", "author": "Siobhan G."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}