{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "The manager said we cannot eat here. We were very offended as we had bought lots of drinks and the other waiter gave us the food menu and we already decided on our food, we found it very rude that we couldn't eat in here, just because someone had a reservation in half an hour. Very disappointing", "author": "Sarah E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "Just dined here tonight.  The restaurant is Cash Only, but they have an ATM near the restroom.  The ambience was rustic and nice.  The space was used nicely, I didn't feel cluttered.  \n\nWe ordered two cocktails, one app, one salad, and two entrees.  We ordered two special dishes, the Orecchiette with Pork Ribs and the Papardelle with a Ground Lamb and Olive Ragu.  The Orecchiette was amazing and the ribs were soft and delicious, the best dish of the night.  The pasta of the Papardelle was great, but the dish was in need of something extra.  All the dishes were tasty and fresh and we would gladly come back here.\n\nSuggested dishes:\nItalian Lemonade\nMeatballs\nBeet \u0026 Arugula Salad\nOrecchiette", "author": "Christine D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "I just popped by after walking over the Brooklyn Bridge. Nice cosy place. I asked for recommendation on the pasta and I got a terrific penne.", "author": "Jens W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "We come here quite regularly.\nIt's our favorite casual dining inDumbo neighborhood.  Fava been salad is my favorite, all pasta dishes are good, many selection of draft beers and wines.\nThe owner Marcelo is very friendly as well.", "author": "Wataru I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "I was in DUMBO to pick up some chocolate for Valentine's Day. I decided to stop at Bo Concepts and stumbled upon AlMar Restaurant. \n\nI enjoyed the ambiance, energy, and the space. I love when I am able to have 1/2 sandwich and either salad or soup for lunch. I ordered an asparagus salad and a panini consisting of bell peppers, goat cheese, and sundried tomatoes. I think the sandwich could have used some salt. The salad was good and the asparagus was thinly sliced and filling.\n\nI'll come here for brunch to see more of the menu. I like the options starting to appear in DUMBO.", "author": "Greg O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Amazing food and great people! A buddy of mine and I rode citi bikes to the restaurant and unfortunately improperly docked our bike and one of the employees Alex helped us out and pushed it in for us to save us a trip and $1200 bucks!", "author": "Keaton K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "Loved the atmosphere and where our reserved table was when we walked in. Definitely a great little place to have brunch in Dumbo. The staff was super friendly and quick to serve.", "author": "Genny S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-30", "description": "Came here on a Sunday for late lunch at 1:45pm. Food is just ok, limited menu selection. Service is extremely SLOW, most people waited 20-30 minutes for their food.", "author": "Anna W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-19", "description": "This restaurant HAS THE MOST RUDE, INCOMPETENT AND DOWNRIGHT SMARMY MANAGEMENT AND EMPLOYEES EVER.\n\nIn particular, a gentleman who may be a manger or the owner, perhaps 30's-40's and dark hair, medium height, caucasian. \n\nWe attempted to eat dinner there, and politely asked to be seated at one of the tables which chairs with backs, and also wanted to be seated away from the crazy party which get taking photos repeatedly which FLASHED directly in my line of vision.\n\nThe menu looked savory enough and the restaurant decor and layout were ample and nice. However, this gentleman addressed us with  scoff, massive smirk and informed us that the only option was to be seated at the benches. He was such a jerk that I have no words to describe his countenance and manner. He told me that he \"WAS SURE THE PARTY WOULD STOP TAKING PHOTOS AS THEY WERE JUST EXCITED TO GET THEIR FOOD.\" This isn't the worst response, but when coated with sarcasm and a side of major attitude, it may me lost my appetite. The poorly managed staff, majorly chauvinistic manager and lack of finesse in dealing with a simple request LEAVE ME TELLING PEOPLE TO RUN, NOT WALK, AWAY FROM THIS RESTAURANT.", "author": "Munmun O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Came to DUMBO for a light show and got recs from a DUMBO native about this cute eatery.  Decor is warm interior wood tables with industrial lofted space.  The menu is mostly Italian with apps, pastas and main entrees. Our table got tons of apps to share: namely the honey and whipped ricotta crostini, the roasted red pepper and capers bruschetta, and the meatballs. The winner was the grilled whole octopus and the roasted red pepper bruschetta.  The whole octopus was fresh, perfectly grilled and totally tasty. The roasted red pepper bruschetta surprised us all as being flavorful and delicious.  The other dishes were nothing special or amazing.   For my main, I got the special with the pork shank cooked down with a white wine and fennel reduction sauce and it was AMAZING. Tender succulent bits of pork falling off the bone while bathed with the rice fennel sauce was delicious. I also tried the Tagliatelle with duck and olives but it was average. I would come back to DUMBO just to have the amazing pork shank again.  yummy!", "author": "Vivian T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-21", "description": "Love it.\n\nAlways friendly.\n\nNice atmosphere.\n\nGreat food (have the meatballs appetizer.)\n\nPlenty of neighbors turning up inn this real 'neighborhood' place.\n\nEnjoy!", "author": "PJ S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "My 2nd time here and still excited to try a few things. Had the beet salad, a fish special \u0026 Gelato for dessert. Don't forget to pick up a fresh cup of coffee after your meal, SO good", "author": "EJ S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-27", "description": "despite growing up in Brooklyn - lived there for 20-someodd years - I could probably count the number of times I went to DUMBO with one hand. thus, I was eager to do some exploration in my (former) home borough.\n\nAlMar is an affordable, warm, inviting restaurant in a post-industrial space, like much of the neighborhood is. yup, the requisite \"high ceilings, big windows\" look and all.\n\nthere were old movies playing on a big wall in the back, which was pretty sweet!\n\nbrowsing the menu, the offering of braised rabbit in wine sauce with polenta caught my eye. the polenta tasted much better than the last time I had it (at a subpar red sauce joint in Manhattan); the rabbit was tender and flavorful. portion size was great; we had had a big brunch earlier so I wasn't too ravenous.\n\nservice is friendly and the prices are affordable. know that it's cash only.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "Good seafood with great atmosphere.  The salad was excellent as well. Sorbet of the day was coconut, my favorite. Went well with an after dinner coffee. \n\nHighly recommended. No typical hustle bustle of the city.", "author": "Shaq Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "For everyone who only visits this place for Brunch only, you are really missing out on the dinner. The brunch is solid: reasonable prices and portions (especially for this neighborhood), the vibe is chill.\n\nBack to dinner food: amazing seafood -- the fluke crudo is to die for, the house cured salmon crostini is insane, basically every seafood dish I've eaten here is outstanding. The fish is super high quality -- the whole Branzino or Orata whole and baked are bone licking delicious. The pasta tossed with a pepper puree sauce and mixed seafood was phenomenal. \n\nIt's not your usual comfort Italian spaghetti and meatballs, (although they do have MEATBALLS and LASAGNA that are good too.) Mostly it's lighter, the chef's from Puglia -- think olive oil not often butter. It's the spot where I bring friends from out of town and sometimes when I'm solo and want a chill bar scene with great food.", "author": "Shelley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "This is solid Italian food. Great DUMBO atmosphere. Our eyes were bigger than our stomachs and we had to take some of our meal home.", "author": "Laura S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "Food: excellent, almost as good as DGS was.  A couple of the items I've had over the past couple months (including the time when it was still called DGS, but the dinner menu was almost completely transitioned to Al Mar Italian) have been awesome:  lasagna (one of the best I've had), tagliatelle with duck ragu (awesome), braised short rib (I thought it was good on one occasion, but a friend had it when it was somehow dried out).  So hey, the food is good.\n\nBut let's talk about atmosphere: I showed up one night with a couple friends, and it's now called Al Mar.  Walk in, and things are a bit different.  An older guy shows us to a table, and starts volunteering information about how they \"canned\" all the \"kids\" who used to work there, because they didn't know anything and were unprofessional.\n\nOK, fair enough.  Cut to ten minutes later--the people next to us are served the wrong food.  No big deal, they go back and bring out what was ordered.  Twenty minutes later--(young) waiter brings us plates.  \"Who had the lamb?\"  Well, nobody had the lamb.   \"Oh.  Maybe this is the beef.\" I don't know, is it?--you work here and you can't tell dishes apart?  Manager comes over, asks if there is a problem.  Waiter looks at us expectantly, forcing us to ask if the dish is lamb or beef, and generally looking like morons.  This happens to the table on the other side of us.\n\nLesson:  Don't fire the staff unless you can hire competent replacements.  I'm willing to allow for a learning curve, but I've been back since and there's been no improvement--staff still can't tell dishes apart, very slow service.  Moreover, DGS was nice because it was exceedingly unpretentious...not so much anymore.\n\nPlus...why change the name?  Al Mar I can have anywhere.  DUMBO General Store...there can be only one.", "author": "David M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "I stopped by here for a light lunch on a visit from DC and ate at the bar, so I can only speak to that one meal, but I just adored this place. The menu looked very tasty and the vibe was chill and friendly. Outstanding service, like the bar tender asking me if I wanted my muffin toasted (made all the difference!) and bringing me butter floating in a dish of hot water so it would be melty enough for my muffin. Both bar tenders were friendly and helpful with tips about local sights and music. There is really nothing in DC that has impressed me in quite the same way. And my whole bill for the muffin, a deelish barley salad with fava beans and mint (again, impressed the waiter offered the option of a half portion, which was the perfect amount), and bottomless coffee was $10.", "author": "Elizabeth K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-26", "description": "I went here with my friend for lunch I was impressed that it was a Saturday afternoon for brunch and we didn't have to wait. \n\nThe food was ok. I wish that they had more of a lunch selected considering it was very limited. \n\nThe service was great, the waitress was very attentive. It's a cash only place. I wouldn't go back out of my way though go come here again considering the thousands of restaurant options in Brooklyn. Meh!", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-28", "description": "Had the Almar Breakfast Sandwich for brunch. Very well made and presented. The restaurant ambience is quite lively. The service is quite slow. We had a hard time getting the waiter attention. All in all, an ok experience.", "author": "Tim And Joy T."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}