{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Love this place. Have been here multiple times with friends and always have a good time. Ambiance in the evening is charming, it's quiet enough to carry on a conversation without shouting, and the food is delicious. \n\nThe service is also great. There was a minor glitch with my order that was probably as much my fault as the waiter's. He fixed it immediately and comped me a glass of wine as an apology, which was not necessary but was appreciated. The owner also sent over a round of limoncellos to end the evening. \n\nMany of the negative reviews seem to be tourists who are upset with the prices. Listen,  I wouldn't complain if everything were somehow $10 cheaper but hey, it's New York. The prices here are completely in line with nice restaurants in Brooklyn heights/ cobble hill/ park slope.", "author": "Molly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "I was so happy with my experience at Almar! My group of three went on a Wednesday evening with no reservation and didn't have to wait at all. The aesthetic and atmosphere of the restaurant were  so cool and cute and they had old movies playing on a projector up against the wall. The service was great! All three of us cleaned our plates (we each got a different pasta dish and they were all delicious). The meals were reasonably priced. Great dinner!", "author": "Jess D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Went for a friday night dinner with my girl, and it was a really fantastic meal. This place has an adorable, cozy yet chic ambiance. Didn't have to wait for a table, and the noise level was the perfect level of low conversational buzz and music. \n\nWe had a cocktail each to start (the something something saint, essentially a dolled up margarita, and the italian sour). Both were very good, high marks.\n\nThen we shared the string bean salad, the mushroom tagliatelle, and the 1/2 roast chicken, and we both had a glass of wine with dinner. Service was fantastic, and dishes came out in traditional leisurely timing, instead of being rushed or the dishes piled on our table all at once. \n\nReally one of the best meals I've had since moving to vinegar hill -- this place easily outclasses Superfine, and beats Vinegar Hill House at it's game. There was also a movie playing on the back wall, which was fun to drop into every now and then.  \n\nService is totally perfect, swift, low pressure, charming and attentive. \n\nI can't honestly think what this place could do better. Even the bill with two cocktails, three glasses of wine, a salad, a pasta, and a main, plus one shared desert was very reasonable. \n\nWe are destined to become regulars.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Great brunch spot. Friend and I loved the egg cloud and the AlMar. Great service chill vibe. Go early.", "author": "Sandra C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "Went for brunch, it was quiet. Had the eggs in a cloud, it was really good. The egg dissolves in your mouth. The potatoes were on point, evenly crispy. Pancakes were fluffy and soft. The eggs purgatory was alright, it needed more bread for the suace. The Almar was good. The waiter was nice and helpful.", "author": "Andy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Got the Al Mar at the Al Mar and it was perfect. The service was also GREAT, very friendly staff. Will be back for another brunch.", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Have been here a couple times just to stop and get a drink / iced tea at the bar but I love it there! The bartenders / waiters are always super nice, the place is really cute and it's a great location for wandering around Dumbo.", "author": "Victoria L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "the aesthetic of this restaurant was adorable. waiters waitresses and especially the host seemed to be very bored on the job. otherwise, food was just mediocre, for we just grabbed a quick bite for lunch. i got the chicken mozzarella which was great and the boyfriend got the meatball sandwich. they like their bread very toasted and hard tho so beware! comes with a mini salad on the side. enjoyed the vibes here", "author": "Amanda T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Lively and bustling at 2:16PM on a Tuesday. Seems like a popular spot for brunch/lunch, as the place was still busy when I walked in. The staff is prompt and pretty friendly. They leave a wine bottle of water at your table so you can refill yourself as needed.\n\nMusic is at a manageable decibel but on the louder side. The tables are a bit rickety and chairs are worn, lots of wood and very boho. It's run-down, not dirty, but worn and def no frills. The front side of the restaurant is paned, floor to ceiling windows with a direct street view so it's nice to people watch while you dine. Bathroom is fairly clean and in the smaller side, but definitely decent compared to a lot of others I've seen.\n\nI ordered the egg toast ($12), though a couple other options off of the lunch menu looked tasty as well.  They offer half portions of items so that you can mix and match if you like and get half salad, half soup, or half sandwich (The half portions range in price from about $5-$9).\n\nEgg toast: Presentation could use some work but it was surprisingly tasty. There's a healthy helping of truffle oil, which I appreciate because a lot places skimp on this. Brioche was lightly toasted and the dish wasn't too salty. The asparagus provided a nice contrasting complement in taste and texture to the toast/eggs/fontina cheese. Perfect light lunch before heading out into the cold again. It was surprisingly filling. \n\nNote! This place is CASH ONLY!", "author": "Sandra Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-30", "description": "My son and I had a nice breakfast this morning. We arrived at 11am and were sat right away. We did have to wait a bit for our breakfast but there was a very large party of about 20 that was there before us.  We were not in a hurry so we didn't mind. My son had the homemade pancakes which he enjoyed  quote \" they were mad good\"and I had the basic breakfast with a side of asparagus which I enjoyed. The atmosphere is nice and the staff was pleasant. I would eat here again on my next visit to NY", "author": "Ann Marie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-29", "description": "I don't usually review places on yelp, however I felt compelled to write a poor review on this restaurant. I'm a very easy to please individual when it comes to food however I was extremely disappointed by the swordfish I ordered at this restaurant. The food was extremely bland, tasteless and definitely overpriced. Brooklyn has much better food options to offer!!!", "author": "Imran A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "We stopped at Almar for brunch on a Saturday while looking for an alternative spot to Atrium, due to the really long wait. I like the layout and decor of Almar. It's very inviting. We started at the bar, grabbing a cocktail while we waited. The menu is quite interesting and the cocktails we tried were all tasty. I especially like the New Fashioned, different take on a classic.\n\nAfter a short wait, we were seated and ordered. For brunch we had the Burger and the Eggs in a Cloud. Both were good, tasty and the presentation were very nice, especially the Eggs in a Cloud, which prepred egg whites in a way I have never seen before. You may be asking why I didn't score this higher? Well, while everything looked nice, nothing blew us away flavor wise. It was all very tasty, but I think we were expecting more in terms of flavors. Nothing was bad, just nothing was amazing. Since they are Italian themed, we may come back here for dinner to try out their proper faire. When I do, I will update this review then.\n\nOther things of note, Almar is actually rather reasonable price wise and the staff are great. If you happen to be in DUMBO and looking for a chill spot to have a bit, Almar is a good place to check out.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "The decor is adorable and the food is fantastic. We had like 4 apps and each ordered a pasta (along with a bunch of cocktails and a couple of bottles of wine). It was plenty of food for four people and they threw in a tiramisu which was nice. It was affordable as well, like $90 each. They are cash only but there is an atm right inside.\n\nMore importantly (or equally important as the food), the waitstaff was wonderful. We ended up drinking and eating until a bit after 11 and we realized the time and apologized for overstaying, and they were just like take your time, you're all good. Go here!", "author": "Kimberly R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-09", "description": "I thought this spot was good - I had the lasagna and burger.  The lasagna was good with some good flavor from the tomato/marinara sauce...it was topped with a  good amount of cheese that made it even better.  The burger was solid - a nice, juicy burger that was cooked as requested at medium.\n\nThe service here was attentive...I think the staff did a good job of taking care of everyone despite the busy lunch atmosphere.", "author": "Ken G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "Wow ... simply wonderful \n\nWas here last night and enjoyed everything. \nAll the food was top notch fresh and delicious. \n\nApps - had meatballs, crostini's, brishetta and some cheese all perfect \n\nDiner had pasta and ribs also perfectly prepared and yummy...\n\nService was great, cant wait to go back...\n\nMy only complaint was the seating, I am not a fan of sitting on a bench with no back ... especially while enjoying such a fabulous meal", "author": "Ran B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "This place is great for breakfast!\n\nMe and a friend were wandering around Brooklyn looking for a good breakfast joint, after finding this place on Yelp we decided it was worth a go. \n\nI grabbed a soy latte with an extra shot and was really pleased with how smooth and flavoursome it was. I also ordered a fresh made lemonade (unfortunately the orange juice is generic and out of the box) and it was delightfully light and had a good balance between tangy and sweet. \n\nAs for the food, I ordered the Egg in a Cloud. When it came out my eyes widened and my mouth started to drool - it looked delicious! It tasted it too!! The egg whites were light and a bit sticky from what I presume to be a tad of cheese mixed in and the brioche wasn't heavy or oily at all. Together with the ham and spinach this breakfast has really impressed!", "author": "Josh A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-15", "description": "Wandered in here post outdoor rock climbing at dumbo boulders for dinner. Between myself and M.Y. we ordered the beet salad, octopus appetizer, and the cavetelli wild boar pasta. The beet salad had the potential to be good, even awesome. The thought of a combo of well cooked beets, pistachios for texture, orange slices for acid and brightness, goat cheese to smooth the flavors out, and finally red onions for a bit of kick. Unfortunately, these were all very mediocre and didn't shine as a particularly good dish.\n\nThe octopus was cooked well and accompanied by a light potato salad and had a decent smoky flavor to it. A decent appetizer but nothing special.\n\nThe entree we shared was the cavetelli pasta with wild boar which was very similar to a bolongese that fell a bit flat. The pasta itself was great but the flavor convo isn't something I'll dream of and come back for. It's a shame because wild boar actually sounded like it would give an interesting background flavor.\n\nAll in all, the food was decent and came out very quickly but I don't think I'll come back soon.", "author": "Caroline L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-21", "description": "i ordered two dishes of grilled octopus togo, they only give me one dish and charged me twice. bad experience", "author": "Miu G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "Decor and Interior true to the Brooklyn vibe.  Baby and kid friendly; great for large groups (with a reservation).  Brunch menu options are loaded with seemingly fresh ingredients.  \n\nWhat we ordered: \n- Smoked salmon panino - so flavorful and fresh! Loved the combination of the smoked salmon with the beets and the avocado.  Loved it on the pumpernickel bread as well. \n\n- Egg in a cloud - neat presentation, however if you're hungry opt for something a bit more filling (like the egg toast)\n\n- Egg Toast - a definite stand out! This dish was absolute perfection. Cooked with truffle oil however wasn't too overwhelming.  The asparagus was a perfect complement.  Having something green on your plate after eating essentially cheese baked on top of an amazing brioche makes you feel better ;)\n\nPolenta with sausage - This dish was average.  Polenta by itself was flavorless but was better eating it with the sausage. \n\nOverall you won't feel gross and heavy after brunching here.  I will be back to try their dinner!", "author": "Anu K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "Came here for our wedding anniversary.  Food is clearly solid. Great salad, fantastic pasta and the fish was perfectly done. \n\nThere was however a wedding party that was (and of course for good reason) very boisterous. They crowded around our table for the first part of our dinner.\n\nI went and spoke to one of the staff, who turned out to be the owner, and asked to be moved to a quieter table when one opened up.\n\nThey kindly obliged. And at the end they comped our meal. This was in my mind overly generous, but extremely kind. Good food, kind service, wonderful setting...in an area generally starving for good food (dumbo)...can't go wrong with that!  Will be back for sure.", "author": "Ming L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}