{"aggregateRating": {"reviewCount": 392, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Came here for Saturday brunch. The atmosphere is relaxing and chill and the food was pretty good. We started with the ricotta bruschette and the portion was really small for the price ($12.50 for two small pieces of bread). The Almar was the best dish that we got; the bread is soft and the eggs are fluffy and delicious. The Mezzi Rigatoni was okay, but didn't taste much better than a pasta dish that I could have made at home. I did enjoy the sausage bits in it though. On the plus side, the drinks were not too bad price-wise for a New York brunch place. The bellini was $8 and refreshing, and the happycino was good as well (alcohol + coffee is always an interesting combination) and about the same price.", "author": "Carly L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-17", "description": "Super cool bar with great service. We sat at the bar and had cocktails. Very laid back spot with THE BEST  soundtrack to vibe to while having a low key late afternoon drink with the squad. Our bartender was attentive and made some awesome recommendations.", "author": "Latarsha C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-18", "description": "In the era of MeToo, I was stunned by the cavalier and cruel attitude of the owner toward a female friend of mine who complained about being harassed by someone at the restaurant. He was utterly dismissive of a legitimate complaint by a regular patron.", "author": "Mark W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "It was quite an accidental find and a surprising one too! My friends tried the happichino - a liquor twist on the Cappuccino. The drink offers a good buzz without the hangover from day drinking. \n\nI tried the Panna cotta which was creamy and satisfying for a mild sweet tooth. Definitely check it out if in the area.", "author": "Akshata T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-06", "description": "Great food super fluffy and tasty egg and great paninis.\n\nStaff is very unpleasant and unwilling to check on you long wait while there is open seating automatic 20% gratuity for bellow norm service!", "author": "Ondrej C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "We had mixed experience here. It was an unplanned visit and this was the only decent Italian restaurant that we could find in the neighborhood so we decided to take our changes. \n\nWe were there on a Saturday evening and the host informed that there is about 20 mins wait for a party of 4 so we decided to wait. Our table was ready in preciously 20 mins but while we were entering the restaurant one of the guest had heated argument with the owner/manager not sure what it was but surely they were bing kicked out. After we sat down the disgruntled customer again came in and threaten the owner/manager and we found out that now we are sitting on the table that they had occupied. (not sure how i feed about that!)\n\nWe placed our order of pasta and a bottle of wine to share.  Food was decent. two out of 4 dishes were 4/5 where as other two were 2/5 so averaging them at 3/5. The wine was quite small for the price but still it was fine. It was one of my friend's birthday and they did give us a complementary Tiramisu which was quite nice of them.\n\nNow when it came to billing, they gave us a bill with the food ordered by people whom they had kicked out( remember they were still on the same table that we had occupied now) added to it. Things go resolved quickly. Another thing which bugged me is that it was a cash only place. A place where 4 person meal cost about $120, it's odd to keep it cash only. They have ATM on premise but not a fan of paying $2.5 for the ATM changes and extra what the bank will change. Might now go back.", "author": "Saurin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-19", "description": "Brunch review:\n\n$$ for your brunch options. Beware, your panini will not show up toasted?! Coffee is good, mimosas are better. The Sunday morning we came, they were out of portobello mushrooms, prosciutto and goat cheese. In addition to our options being limited because of this, our waitress was very new and did not seem to know the menu well yet, which made explaining what items were available a bit more tasking. Decor is casual chic and oh so cute. Bathrooms are clean and the food comes fairly fast. Also within short walking distance (2 blocks) to the carousel and Brooklyn Bridge footpath.", "author": "T P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-12", "description": "They have mice. My daughter saw it in the back near the restroom. She ran and I had to pay for eating in a restaurant that has RODENTS. Fml.", "author": "Nicole O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "So in love with this place. Beautiful airy and chill atmosphere, located right by the Brooklyn bridge. Came here for brunch because I heard about the egg in the cloud dish. Okay it was literally one of the coolest dishes I've ever had...I could not stop aweing over it. Major yolk porn, fluffy eggs - \u0026 yes it felt like I was eating a cloud, soft/crunchy brioche toast. Mmm.", "author": "Betty F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "Where do I begin? I've been coming for years, but not after tonight! The pasta I ordered without cheese arrived WITH cheese. After politely reminding our server that I asked for it without cheese, it was brought out a second time with the cheese half heartedly scraped off. \nThen the bill arrived..Three items were mid priced- in their favor. When I complained to the waitress she was so rude! Me: \"I don't understand why there is a charge to plate the pasta that was incorrectly served to us?\" Server: \"I don't understand why you are angry about this?!\" While I don't blame the server for my cheese incident, I do blame her for over charging us. She could have been apologetic, but instead she was extremely argumentative. \nVery disappointing.", "author": "Lulu B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "I'm a bit hesitant to review Al Mar as it is pretty much the best neighborhood place in Dumbo. ( I don't deem \"Atrium\" a \"neighborhood place). We have been coming here for a long time and I never thought of writing a review; don't ask me why. We were just there a few nights ago (Saturday 7:00pm)and could not understand why there was no one having dinner. All the appetizers and entrees are very good. The desserts are a bit pedestrian but fine. With all the hype of some of the places on Henry Street and the like it's kinda strange that Al Mar is not packed. \n\nI am just confused why the place was kinda empty. I guess our fellow Dumbians are kinda ......... ( you thought I was going to write dumb; right?)\nSo please keep waiting in line at Noodle Pudding , lemmings!", "author": "Tom Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-03", "description": "Food: 5/5. The buratta appetizer was fantastic as well as all of the pasta dishes we had. Additionally the branzino and the chicken was really good\n\nService: 1/5. We had a reservation at 7:30 and did not get seated until 8pm. The host was not good and the service was very slow. The waitress did not even ask us what to drink until 15-20 minutes after we were seated.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Visiting from the AZ and after 7 hours of walking and going over the Brooklyn bridge, we needed to get some drinks. Our waitress was super awesome and friendly and made the perfect suggestions!! My love ordered the Classico half sandwich with the caprese salad and I ordered the half salmon with the shrimp salad...OH. MY. GOODNESS. GRACIOUS! The prosecco and the great saint cocktail were ordered and both super delish as well. Super close off the Brooklyn bridge...don't miss it!", "author": "Marco J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-13", "description": "I've come here twice for Sunday brunch and had really positive experiences both times. I called a couple days before to make a reservation, and even at prime-brunch time in NYC, I had no trouble getting a seat. When I showed up, I was seated almost immediately.\n\nThe staff are very nice without being pushy, and the atmosphere is rustic and cute. It can feel a little cozy when it gets crowded, but never too terrible. \n\nThe coffee is great, and unlimited refills are a steal if you're planning on hanging for a while. The first time I came I ordered the Nutella panini (shared) and the Old Fashioned Breakfast. The panini was tasty, but more of a novelty than worth the money for some Nutella on warm bread. The breakfast itself was satisfying without being overfilling. Exactly what I wanted from Sunday brunch. \n\nThe second time I came (later in the day) the service was a bit more scarce. We had to flag down a waiter to order, but other than that things were fine. I tried the caprese panini. It was perfectly good, though nothing particularly memorable. \n\nUPDATE: I came here for brunch a third time and had a far less pleasant experience. The coffee was cold, the milk for my coffee had coffee grounds inside it (or at least what I assume to be coffee grounds...) and my Old Fashioned breakfast arrived cold with two skimpy slices of bread. The service was also lacking; the restaurant was empty at 10am and I still had to flag the waitress over multiple times for napkins and more coffee. \n\nWould definitely recommend for a good brunch that's not wildly expensive for the are", "author": "Laura B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-02", "description": "Didn't think this place was that great. Neither me nor my friend liked the food that much. I got the pasta dish with sausage and vodka sauce. It was very average, nothing special or ground breaking to it. My friend got the egg in a cloud, which was interesting for sure, and very cool to look at but it wasn't all that great either. Overall, flavors were very plain, atmosphere was ok.", "author": "Lindsey E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "One of our favorite spots in the neighborhood--this place has a great mix of pastas and seafood. The vibe is always chill, with old movies frequently being projected on the back wall. The brunch is surprisingly good as well, although we sometimes end up unable to resist ordering lunch food. We always end up leaving overstuffed!\n\nFormerly cash only, this place recently started taking credit cards as well. Given how frequently we go (and the size of our meals), this is much appreciated.", "author": "Eric F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-23", "description": "Solid if a touch over priced. Wish the waiter paid better attention to the order details, but overall a great coffee stop!", "author": "Jim H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "The food here was incredible and the service was too. The daily special w the different meats and red sauce was insanely good. Still jonesing for more. Some of the best food I've had in NY in years.", "author": "Rob B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "There are only a handful of affordable lunch options in DUMBO, but it's good to see that AlMar is there for when you want to treat yoself and spend just a *bit* more for an amazing sandwich. I would order their slow roasted pulled pork sandwich again in a heartbeat. The pork fell apart so easily, and there were all sorts of pickled veggies and onions mixed in.\n\nI ordered it to go, and was able to wait for it at the bar. The sandwich came out to a little over $12 with tax for a whole portion, but they actually pack you two halves, which is super convenient. I ended up saving half for the next day because it was pretty heavy (it was also delicious the next day). They also do a half sandwich and half soup or salad deal as well, so maybe that's the move. Or I guess just half a sandwich. Lots of options.\n\nCash only!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "So happy we stumbled upon this place while exploring Brooklyn. Chloe was our server and her genuine enthusiasm over the quality and taste of food was awesome to see from the wait staff. Ordered the shrimp salad and it was amazing! So fresh and clean tasting! Exactly what I wanted on the warm summer day.", "author": "Raquel A."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "AlMar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4825e4smnu5nDe8UnVveRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188555288"}