{"aggregateRating": {"reviewCount": 208, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-27", "description": "The interior was decorated nicely, background music needs to change (soundtrack of a bad karaoke), food isn't anything special. I ordered the Healthy Tofu Glass Noodle soup that was bland. My fiancés Tom Kha soup tasted better. If the meal was on point, a four star would be justified. Unfortunately, my Chinese takeout the night before was more memorable and tasty compared to my experience in this restaurant.", "author": "Maria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Best Thai restaurant I've been to! Great service and great food, just about as good as it gets. If you love spicy food, this place will challenge how well you can handle the heat. Got to try their Drunken Noodle, it is bangin'. I definitely will be coming back here, can't get enough of it!", "author": "Farid S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "Dumplings are great, calamari amazing flavor,drunken noodle chicken and shrimp is my favorite can't wait to eat it again,try all the desserts you won't regret", "author": "Henry F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Everything was delicious! The noodles, curry, meat and teas were great. Even the mod duck! Also ordered delivery and came in record time. :)", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Just ordered some Chicken Pad Thai \u0026 Pineapple Fried Rice \u0026 it was absolutely delicious!!", "author": "Emilia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "It's hard to find good authentic Thai food - so much of it is sweet and Americanized. So I was pleasantly surprised by this place. Good northern Thai food - very clean, not cloying, good flavors and ingredients. If you can't get to Pok Pok, this is a decent runner up - without the long waits! The ambience and decor is also a cut above the usual Thai restaurant - more like a charming cafe - and the staff is very nice. So far the pork larb is my favorite dish.", "author": "alli c."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-08", "description": "First and last time ordering from this place. Delivery arrived 20 minutes past the Seamless estimate, cold, and missing rice. I called and they said they would have the rice to me in 15-20 minutes. I called back 30 minutes later and it wasn't even out for delivery yet. Food was just OK, not good enough to make up for poor delivery service.", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-24", "description": "had some great reviews, so i stopped by a couple of weeks ago. a solid restaurant with the typical thai dishes. i was hoping for something a bit more unique and regional from the name, but honestly thought it was lacking originality. for example, the drunken noodles with a mix of protein and seafood just does not work and seems like a bizarre choice.", "author": "Wesley H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Good food, however not every different from all of the countless Thai restaurants in the neighborhood. I would recommend if you're looking for solid Thai food with lots of vegan and vegetarian options.", "author": "Mallory A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-01", "description": "Truly terrible. The Pad Thai was completely dried out - both noodle and chicken - and tasteless on top. Delivery however was quicker than expected.", "author": "George W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "I recently threw a large dinner party here for my husband's birthday and can't say enough great things about this place. The food is great and the menu is diverse with a ton of vegetarian options, the portions are large and filling, and the prices are really reasonable. The airy, dimly lit space is perfect for a casual date night out or a group gathering without breaking the bank. The staff here were also amazing - extremely accommodating, friendly and attentive. They made planning the birthday party so effortless and made sure we were well attended to all night. I'm so happy we chose this restaurant for our dinner party - we will definitely be back! Thank you Kor Tor Mor!", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "this newly opened restaurant truly nails it when it comes to serving thai dishes. with welcoming crews, the food taste much better than the other restaurants around the block.. the restaurant had a delightful ambiance. Crispy pork was one of my favorites there. I am surely coming back again.", "author": "Y W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-23", "description": "DON'T EAT THE MOCK DUCK --- they placed real duck in the roles and food.", "author": "Satori S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "I couldn't step away from my desk to take a real lunch break so I decided to order from Kor Tor Mor. I was really impressed. My spicy basil fried rice was flavorful, authentic and a real kick in the pants. The tomkha soup was rich and hearty as well. The lunch special was extremely cheap (under $9 not including tip) and it arrived incredibly fast - less than 15 minutes after I placed my order. If you're looking for something fresh, affordable and fast I'd definitely recommend this place. I plan on going back in person for lunch or dinner sometime soon.", "author": "Julian T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "Beautiful space excellent service and great food, good variety on the menu. We were a party of four and we all loved our main dishes as well as the appetizers and the desserts also. Thought it was a very good value and terrific spot for people watching in hipster Brooklyn neighborhood.", "author": "Howard B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "good food, good service. was disappointed with the amount of veggies in the curry dish but it had a ton of tofu which was good.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "The food is crazy flavorful, especially the spicy basil rice. The food comes quickly, the water on the table has mint and lemon in it, and the ambiance is very relaxing.", "author": "Malley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "This is a cool new Thai place on Smith street. I accidentally stopped by last week. I had a spicy basil noodle which is my favorite Thai dish. I didn't ask for anything special 'cause I wanted to have a taste of their own style of cooking. Nothing but awesome!!!! I would say. I am definitely going to go back there and try other things. By the way the service was great as well.", "author": "YoYo Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-02", "description": "I'm a little puzzled as to why people rave about their crispy catfish salad. I ordered it tonight and there was absolutely no catfish in it -- only crispy batter! I'd be willing to go back and try something else but my first visit was a disappointment.", "author": "Branfa B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-15", "description": "Just ordered from here for the first time. Decided to try the larb tofu salad after looking up what \"larb salad\" usually is. Looks like it is supposed to be a salad with about equal parts lettuce, rice and meat. I got a container of extremely spicy hot broth with about a pound of tofu and two wilted pieces of lettuce. The onions are in there as promised, but no sign of the \"grounded toasted jasmine rice.\" My fiance's order was correct but his was also extremely spicy, and neither of our dishes were marked with the \"careful, spicy!\" pepper on the menu. The dishes are too spicy for us to eat, and we both usually love medium to hot spicy dishes.", "author": "Kaitlin U."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Kor Tor Mor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "204 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/3nggILUMWgRAPhsYh1La_A/ls.jpg", "@type": "Restaurant", "telephone": "+17187975100"}