{"aggregateRating": {"reviewCount": 208, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-20", "description": "So disappointing. We were long time customers of Hop Hap and the food has gone completely downhill with the change. We ordered pad Thai which was completely dry and flavorless and massaman curry which didn't have the typical ingredients and tasted off. We couldn't even finish our food, eating maybe 1/3 of it. To top it off the rice came In a normal rice box but inside the box it was in a ball wrapped in Saran Wrap and partially cold... So it has clearly been frozen and warmed up before being sent out. Really bad dinner and sad that our favorite Thai place is gone.", "author": "Katie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-22", "description": "Service is nice and the food is tasty, but be warned: I'm almost certain they use MSG. This is evidenced by the fact that I've gotten splitting headaches -- my usual reaction to MSG -- each time I've eaten here. At first I thought it was a coincidence but it's happened on several different occasions and immediately after my meal. It's too bad, because they can achieve the same taste without using these chemicals!", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "!!!!!! What I've been waiting for in Brooklyn. \nVery hip ambiance \u0026 cool music.\nThe food was so fresh and came promptly.\nBest part was the drink menu, incredible.\nI ordered spring rolls (wish it was a peanut sauce instead) but the meat options \u0026 noodles were out of this world.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "The first time we ordered, our food was delivered well under the estimated time, it was warm and delish! Would definitely order from them again.", "author": "Yvette B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "Pretty good Thai. But you're not able to order lunch specials electronically, which is pretty frustrating. Plus, most of the many Thai places in the area offer and appetizer as well as a salad with lunch special. This place you have to pick between a salad or an app.", "author": "K Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Perfectly balanced Thai iced tea and served in a huge glass. I had the basil eggplant and the vegetables were cooked well but lacking in the dark sauce that I like, I like this dish to be saucy. The Tom kha was not greasy like other places and had 3 large shrimps in it (ordered shrimp as the protein). The two of us shared a small and it was plenty. I think the soup could use more coconut milk but my husband liked the amount of fish sauce in it. The staff was nice and I love the decor. Great spot to bring a party. Probably one of my favorite Thai spots around the area.", "author": "Susanna T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "Ordered delivery, took a little longer than I thought it would,but it still arrived within the estimated from seamless. Had the pad see yew, crispy ginger catfish, and the larb salad thing, which was a spicy ground pork. The noodles were pretty good, and the catfish was delicious. The pork was at turns fatty and over cooked, good flavor wise but bad texturally. All in all would order again, definitely a cut above the other Thai delivery places in my neighborhood.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "We have a lot of Thai places in the neighborhood. Kor Tor Mor is not only the best one in the hood, but my favorite in New York. \n\nIt is my go-to place for Thai. It is my go-to place, period. \n\nI've had most of the menu, and everything is great--the pad thai is amazing, the curries are delicious. Don't forget green tea ice cream for dessert. And reasonably priced to boot.", "author": "Peter M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-16", "description": "BYOB is always a great thing. I ordered the drunken noodles with pork which was good. Nothing mind-blowing, but I did appreciate that it was less greasy than most. Staff seemed a little confused but this place is new so hopefully they'll figure it out.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "Delicious, fairly priced and very fresh ingredients...and 100% vegan dishes on the menu!\n\nTheir Tom Yum soup is rich, but not too rich, and a bowl for $5 is enough for an appetizer soup for two. The Pad Thai noodles are cooked just right, and the flavor is subtle but also just right. The Pad Prik Mock Duck was also rich but not too rich...almost like a Thai Ragout. Oh and the Sangrias are also quite tasty.\n\nMost everything is \"soft\" flavored, but so delicious, and the prices are really not unreasonable at all.\n\nNot the most amazingest Thai food I've had ever, but really very very delicous, and also very very friendly staff.", "author": "Alex E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Delicious Thai restaurant with great service and chill vibe. They have the usual at any other Thai eatery plus yummy vegan options!", "author": "Vicky J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "One of the cutest Thai restaurants I have been to in NYC! The communal tables were perfect for my larger party, and we were able to enjoy all the food family style. The food was absolutely delicious, my favorite was the Crispy Catfish Salad. It was something that I had never tried before and was recommended by our server. Overall I would say this is the best Thai restaurant in Cobble Hill and I can't wait to bring the rest of my friends!", "author": "Matt S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "I been to Thailand once. I tried real Thai food. When I came back to NY and tried many Thai restaurants in New York. I couldn't find same taste I had when I was in Thailand because mostly are American Thai food. My friend recommended me this place. I ordered Red snapper mango salad, Grilled chicken sate and Steamed mussels. My favorite is steamed mussels. So Yummy! Finally I found real Thai food restaurant in NY. \nDefinitely going back again. Best Thai restaurant in NY!", "author": "Kyoko Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "The best Thai food!! Very authentic and a family run restaurant to boot!  Happy to support them and very happy to get to enjoy authentic Thai style cooking for such reasonable prices!!! Favorite Thai place in the city!", "author": "Diana H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Hands down best Pad Thai I've ever had. We order from or stop by here to eat pretty frequently: everything we've eaten is delicious and in general, it has a very comfortable atmosphere. But seriously - the Pad Thai is incredible.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "Catfish Salad: mmmmmmmm yum. :) I always get catfish salad @Thai restaurant. Kor Tor Mor is definitely my favorite now. \nDuck Curry: The duck was so tender and juicy.\nPad Thai : not just sweet, but it was good marriage of sweet and spicy. \nThat's all I need to say. \n\nI love the cute decor of this place. It kinda reminded me of the old spot from back home. The stuff were very welcoming and attentive. Also it was a great surprise to see good amount of vegan option. That made me want to bring back my vegan friends. That's always a plus for me. :)  great variety of menu. It was pretty busy and it surprised me to hear that this place just opened not so long ago. BYOB!! Yes, I will definitely be back for the Duck curry.", "author": "Yuko K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-07", "description": "for vegans and vegetarians: many of the dishes marked \"vegan\" are NOT vegan -- they have fish sauce. this is very discouraging that places are using language they do not understand. other than that, the food is excellent, but honestly, i have no idea which dishes i ordered were really vegan or not.  the Mango Avocado salad i ate for lunch had fish sauce in it.  i was thinking \"wow - they can make a great lime dressing without fish sauce!\" alas, i called them and it had fish sauce in it. they have \"vegan\" marked all over their menu but it is clear they do not understand what vegan means.\n\ni guess in the future i will try to explain what vegan means whenever ordering from here, but language could be a problem", "author": "kevin f."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Was in the neighborhood and saw the lunch special promo in the window. Was pleasantly surprised at the quality of the food for the price--$8! I had the Panang curry with chicken--delicious! And it came with my choice of Tom Kha soup which I preferred creamier, but it was still delicious with lots of flavor. Such a steal! Will definitely be coming back for lunch.", "author": "Ruella R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "I don't get why this place isn't packed every day. It's so good. And they're so sweet in here. Best Thai food I've ever had. I always buy the coconut soup with lemongrass and mushrooms and its soooo good. They have a nice lunch special too.", "author": "Barbara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "This is a great place.  I don't know anyone who has eaten the food at Kor Mor Tor, who doesn't come back.  We eat there and we order delivery.  Trust me. If you like Thai, this is the place and the prices are very reasonable with decent-sized portions.  The ginger sauces (as well as the others ones) are very taste and aromatic.", "author": "nina b."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Kor Tor Mor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "204 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/3nggILUMWgRAPhsYh1La_A/ls.jpg", "@type": "Restaurant", "telephone": "+17187975100"}