{"aggregateRating": {"reviewCount": 208, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-17", "description": "Pretty standard thai restaurant in Cobble Hill, BK. My boyfriend and I went there around 9 on Sunday and there wasn't anyone else at the restaurant. We ordered two hot house sakes, one large seafood soup, and an order of Pad Prik Khing with veggies and everything came out fairly promptly. The food was pretty average thai food (hence my rating), so I can't say I was blown away massively by anything. Seems like a decent neighbourhood restaurant to have, although I can't say that we'll be coming by again. It might be worth stopping by if you're in the area, but I can't say you'd be missing out if you don't go.", "author": "Carell H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-01", "description": "It's sad that they have quality food however their food preparation is seriously lacking. They do not clean their shrimp and put waste matter in their soup.", "author": "A R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "Very very good Thai food with bold flavors and quality ingredients. Sometimes a bit over-salted, but that seems like the norm for NY. Kor Tor Mor gets 5 stars for offering great value for the money if not quite the food and spice quality of Samui, which is literally double the cost.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-13", "description": "Ordered Seamless from them. Arrived early within the delivery window.\n\nThe drunken noodles were pretty standard.\n\nI also had the sauteed sa-tor bean dish, which seemed unique. Probably should've looked up what sa-tor beans are beforehand because they're also known as Thai stink beans. Can't say they were all that stinky, but they were a weird blend of bitter and sour. Definitely unique, but wasn't a fan.\n\nThe dish also came with a bunch of ground chicken. Portions were huge, but a bit too oily.\n\nMaybe I'll stop in next time since there are better Thai options near me to order from.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-18", "description": "This Thai delivery was not great. The drunken noodles are labeled as spicy but come out mild - when we called the restaurant back they said the dish isn't spicy. Not clear why it's labeled as spicy. The pad Thai, on the other hand, was on fire. I asked for medium spice (and I have a high tolerance for spice!) and I absolutely couldn't eat it. I threw the entire dish away but the restaurant wouldn't refund it. With so many Thai delivery options in Brooklyn we won't be using this one again!", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-10", "description": "Overall would not order from here again \nPhenomenal Tom Kha Gai\nPad Thai was flavorless and not at all spicy, even after requested \nGreen curry was ok\nSpring rolls also flavorless and greasy\nVery pricy for substandard food", "author": "Molly H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-24", "description": "Very disappointed.  Mainly a bowl of noodles, Little seasoning and 4 shrimp.  I know you can do better", "author": "Neka Wilson '."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "Really awesome vegetarian and vegan options. Overall the food is delicious and definitely my favorite Thai restaurant in Brooklyn.", "author": "Hannah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-25", "description": "Sunday evening, looking for a quality restaurant everyone could agree on in the area - Thai always being the safest choice. Easily able to accommodate 5 people, as we immediately got seated.\n\nRecently had eaten, so was looking for a lighter meal. Ordered the Mango Avocado Salad ($8) - a medium sized bowl of mostly mango, and some avocado, nuts, scallions, onions, and tomatoes. What really surprised here was the spice in the dressing; while it did say spicy, it had a way bigger kick than expected. Didn't really mesh well with the salad and felt like a milder dressing would have been appropriate. Tried one of my friend's chicken wings which was pretty good, so probably just ordered the wrong thing.\n\nService here is solid and they leave water jugs which are replaced quickly. Fine enough Thai spot if looking for an easy bite.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "I was excited about my food but I never got it. I was hung up on when I called an hour later asking for it!!!! I called back and the lady said she has no order and that she is too busy to talk about it. \n\nI have the receipt and my debit card was billed. Horrible customer service - disgusted. Doesn't deserve a star.", "author": "Catherine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "Was looking for a casual, affordable thai dinner after meeting some friends for drinks in the neighborhood and ended up eating here! We were one of 3 parties in the restaurant during prime time, but they have 2 long tables filled with take out orders which delivery men were going in and out with- so clearly there's more than just us eating here.\nThe inside was cool brooklyn feels- exposed brick wall, long couch of seating with trendy pillows, very open dining area which made the restaurant feel a lot bigger than it actually was.\nThey had all the staples, and did not disappoint! I'm a big fan of Tom Kah soup (the coconut one) which is my go to in the winter, when I'm sick, whenever Thai dinner is an option! Started with this and edamame, and continued with the classics, opting for chicken pad Thai as my main.\nIn general good portions, nice atmosphere, great food!", "author": "Sam K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-05", "description": "Had a surprising experience here.  I loved the food here early on and it became our go to.  (Wrote a great review of it, and I don't write very many.)\n\nAt some point some months ago the food definitely declined some and we started mixing in other places.  It was either flavor or texture or both.  But it was still on the list, and I kept chasing the original food. \n\nThen last Sunday happened.  We ordered and it took over an hour.  No biggie.  When it arrived the soup container was broken and it had leaked everywhere over other stuff.  It was all lukewarm.  Then we opened the chicken satay and gave it to the 4 year old.  He kept complaining it was mushy and would not eat it.  So we checked it out and we got what was in the photo below - mostly raw.  I got upset.  \n\nWe threw the rest of it out - cold, broken, wet and raw is where I tend to draw the line.  It all just made me queasy.  So we heated up leftovers.  \n\nI called the restaurant and complained and asked for a full refund.  They apologized and said they'd do that with seamless.  Then I called seamless / grubhub to confirm, and they contacted the restaurant and got the answer that they would only refund the chicken and the soup.  So I contacted the owner (Annie?) - who sounded genuinely apologetic, and said she'd refund the entire amount.  When I reconfirmed with seamless a few days after they said the restaurant still wasn't refunding it all.  Only $17 out of $74.   \n\nI still can't believe they're treating me this way.  They served me raw chicken that I gave to my four year old.  And then lied about refunding.  It's just wrong.  Safe to say I'm pretty upset - and here I am on Yelp, letting you know about our experience here.  I am not one to do things to harm a local business that's just trying to make it work.  But I won't order from here again, especially in a small neighborhood with literally six Thai places.\n\nThis whole thing still makes me nauseous.", "author": "David W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "Finished work, wanted thai and found this place. Small and cozy. Seating and good service. A good portion and reasonable pricing. Wanted to try something new, ordered the Prink Khing Beef (you can choose other meat/no meat options). On the spicy side with string beens and red peppers. Tried the Thai Tea Boost... Thai Iced Tea with liqueur... worth the try. Its a good date/hang out place.", "author": "Joanne N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-18", "description": "The food was ok. Less than $15 per dish. Had the drunken noodles which only a White person from Oklahoma would think is spicy. It was good but nothing special. My husband had the pad thai which was also good but not amazing. It's hard to mess up Thai good and they didn't but it wasn't stellar either. The waitress spoke no english so it was a little hard to get our orders across.", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "Let's say we had this conversation:\n\nMe: Hey [insert your name], what are you up to tonight?\nYou: Not much; why don't we grab dinner?\nMe: Sure, what time? \nYou: How about 7? Come by my apartment before that, and we'll leave from there.\n\nNow, let's say I show up at your apartment at 6:45 pm and we have this conversation:\n\nMe: So what should we eat?\nYou: Oh, I already ate. Why, are you hungry?\n\nI would want to murder you. But then I'd order some Thai food from Kor Tor Mor, and it'd arrive extremely quickly, and life would be OK. \n\nBecause Kor Tor Mor has the drunken noodles, the dumplings, and the fried apps that you need to soothe the anger you feel at SOMEONE being a moron. \n\nThe Only Things I Don't Like About Kor Tor Mor:\n\nFour dumplings is kind of a weak number for a full order.\nThey make us pay for extra peanut sauce. My wife needs the extra peanut sauce", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-07", "description": "I ordered vegan massaman curry and vegan sprit rolls for delivery. After placing order, the restaurant calls me if I wanted chicken or meat in my curry. Things happen and I clarified. Then the delivery guy comes and had issues in understanding the elevator system and it's already 90 mins since I placed order. I am still not mad. \n\nFinally the food comes, I tip the delivery person and serve myself the meal. The curry tasted like someone has boiled a watered down version of coconut water and added salt, turmeric and bouked vegetables to it. Even, packed frozen food taste much better than this.\n\nNow I am kind of getting mad, but still not there. I shift my focus away from curry to the spring rolls -- my last hope. They are all white flour, not baked properly, soggy and lack any flavor.\n\nNow I am really mad my myself for my choice of restaurant.", "author": "Pooran P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Lunch specials $9\n\nOne main one appetizer (choice of soup or spring roll) that comes with a yummy peanut-sauced green salad on the side for both options.\n\nPad Thai with toufu for me hits the spot every time\nBeautiful deco and space! With the brick wall and lots of plants and sunlight during lunchtime is beautiful \nLovely- thank you!", "author": "Yun Chun C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "I am a HUGE FAN of the food here! The service is always amazing as well as the food. If you are in search of the perfect Tom Yum Soup, you have found the right place! \n\nDuck Rolls- Delicious and very filling for an appetizer. Tasted like a hybrid of a scallion pancake and peking duck wrap. \nTom Yum Soup- THE BEST Tom Yum Soup! You will not regret getting this. In fact, you will be back for more. \nCrispy Duck Salad- Very refreshing. The duck was cooked perfectly! I would have liked it if this was slightly more sour and spicy.\nCurry Puff- This was probably my least favorite dish here. The flavor itself was good, but the curry puff was too soft and not crispy at all.\nSteamed Dumpling- Delicious, tasted like a chinese 'sew mai'. The sauce was especially yummy. \nWings- Fried perfectly! \nTom Kha Soup- Perfectly balance without being too sour or coconuty. \nMassaman Curry- The curry was good, but the beef was a tad chewy.\nNam Fried Rice- Delicious and came in a huge portion! \n\nDessert:\nTaro Custard with Sticky Rice- The taro custard was delicious without being too heavy or sweet. I wish more sticky rice came with the order. \nMango with Sticky Rice- The mango I had was a bit under-ripe, but the sticky rice was perfect. It was the right amount of soft and sticky. I was absolutely addicted! \n\nThis is hands down one of my favorite Thai restaurants. I definitely look forward to trying more dishes on the menu.", "author": "Qi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "I ordered take out from here and was pleasantly surprised with the size of the portions ! I ordered the vegetable pad see ew, which was very good. I was disappointed by the amount of egg that came with it however. There was not very much in my dish or in my friend's pad Thai. \n\nIt is typical of other Thai places I have tried in the area and the people who worked there were all very nice ! A close walk from Downtown Brooklyn on Smith street.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "I've ordered from Kor Tor More 2x on Caviar now and each time it's fresh, delivered much quicker than the estimate and I'm given an actual restaurant-sized amount. I've had bad luck with delivery Thai from many other places (small portions, not fresh, lacking ingredients, not hot, etc...), but each time I've been pleasantly surprised and impressed with Kor Tor Mor. \n\nThe papaya salad was much spicier than I anticipated, wow! It packs some heat. So FYI if you have a sensitivity to spice, maybe ask for it to be mild? But it's crunchy from the papaya and peanuts, and has a mild fish flavor from the fish sauce. It could use a bit more lime, but that's probably more a personal preference on my end.\n\nThe drunken noodles are YESSSS. I have to actually blow on the noodles because they are still that hot, but nothing is overdone. And they were delivered, and I didn't even eat them until after the papaya salad - I'm seriously impressed. They are spicy too, and have a good amount of veggies, plus the chicken I ordered. It's not just all noodles (again, one of my complaints with other delivery places is that it's mostly rice or noodles depending on the dish you get).\n\nSo, now my goal is to come in person and have a meal in the restaurant, maybe try the fried rice or a curry dish!", "author": "Emily R."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Kor Tor Mor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "204 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/3nggILUMWgRAPhsYh1La_A/ls.jpg", "@type": "Restaurant", "telephone": "+17187975100"}