{"aggregateRating": {"reviewCount": 208, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-21", "description": "Came here w/ BF on a Saturday night and there was a good amount of people but not noisy/crowded and there was no wait.\n\nI ordered a ground beef salad that came w/ a chili lime vinaigrette and it tasted very heavy on the fish sauce. It was salty, tangy and spicy but very, very saucy. If you order this, ask for the vinaigrette on the side because it drowns the meat making it a little messy to eat as a salad.\n\nI also ordered the roti canai and it's different from the Malaysian roti canai. The \"pancake\" was very soggy and not crispy and melt-in-your-mouth like it's supposed to. Came w/ Massaman curry for dipping and the curry was delicious but it was way more than what was needed w/ the amount of roti it came with. It's also vegetarian so no chicken like I'm used to. A lot of potatoes, carrots in it though.\n\nBF got the spring rolls and they wrapper was a little under fried/cooked. So wasn't really crispy/golden. He was not impressed. He also ordered the basil fried rice. Generous portion but he claims it's your standard take-out fried rice and he wasn't wowed.\n\nOverall, will likely not come back because food was just mediocre but was to say the service was fantastic and they were very attentive.", "author": "Sophia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "Return? Yes\nAtmosphere (4) Low key, brick walls, long corridor w/ tables on either side. I got takeout. \nWait (5) Got it right away\nFood (4) chicken basil (4 - very spicy), brown rice (3 - $1.50 extra) \nDrinks (n/a) \nService (4) Friendly\nCost - $12.50 before tax and tip", "author": "Will S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "Gotta say, the service here was lackluster. My 5 friends and I all had both our drinks and food all come out at separate times and the staff wasn't the most attentive. The drinks were all pretty good, considering the price and the style. Food was good, too. If we had been able to eat together and have a better overall experience I would've ranked it at a 4. Adequately priced for servings that were on the smaller side. Probably won't go back to BK for a night out here", "author": "Ben S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-02", "description": "Food was really good. But low grades for service staff making me feel pressured to order and finish in a half empty restaurant", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "A really great menu with a ton of options for vegetarians and vegans! I was so curious to try the vegan shrimp, so I got the Pad Prik Khing with it, and it was amazing. I've never had vegan shrimp before, and I'm surprised that the consistency and taste was so accurate. The dish itself was delicious, perfect portion sizes, and a reasonable price for the neighborhood. \n\nMy friend got the massamam curry with (non-vegan) and she also loved it. \n\nThe staff is very pleasant and attentive. I'll definitely come back again.", "author": "E D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "I was in downtown Brooklyn for errands and craving Thai food- turns out I needed to look no further to satisfy my craving AND have plenty to eat for later. Kor Tor Mor is delicious, authentic fare served in a welcoming atmosphere. \n\nThe space is airy and hip with delightful natural details like the banana plants and bamboo family-style tables. The staff are super helpful and willing to answer questions/provide suggestions- no New York freeze here!\n\nThe lunch special is a fantastic deal at 8 bucks for a veggie tofu or meat entree AND appetizer. A full meal for under 10?! Yes, please. I had the drunken noodles- prefect texture, generous chicken and vegetables and I left feeling full but not heavy. The Coconut soup is aromatic, the lemongrass and tofu very well balanced and the salad indulgently peanut-y rich.\n\nI want to come back for dinner to try Thai specialties like Catfish salad and Kra Praw.\n\nVegan? They have a vegan friendly section of the menu with myriad options. \nOn a budget? Lunch specials to eat and still have left overs under 10 bucks.\nLooking for authentic? The food is so well spiced: tamarind, lemongrass and chili forward cooking, Thai regional specialties abound (read- crispy duck, red snapper, curry MMMM.)\n\nI highly recommend this place for a singleton on lunch break and big groups alike. They can accommodate anyone", "author": "Charlotte D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Kor Tor Mor is my favorite Thai place I have found since moving to NYC and has become a regular delivery dinner for myself. I usually order the pad thai which is delicious. One time I decided to try the drunken noodles and it was WAY too spicy for my taste, but my friend who loves spicy thoroughly enjoyed it. My regular order is the pad thai, crab rangoon, and two orders of the coconut sticky rice. My favorite items from this place, however, are the crab rangoon and the coconut stick rice. Every single time I order, I get two orders of the coconut sticky rice because I know I'll want one for later. The flavor is phenomenal and it is truly the best sticky rice I have ever had. The crab rangoons are popular in general, so I gave them a try and they don't disappoint. HIGHLY RECOMMEND!!!!!", "author": "Jasmine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "KTM has a much improved lunch service with specials since my last visit. For $9-11, you get an entree and an appetizer.  The appetizer can be a choice of 2 soups or spring rolls which comes with a small mixed greens pile with a peanut dressing.  That's a great deal but if you have an affinity to the Thai iced tea, that's going to set you back $3 each.  Luckily, I don't like the spiced, sweet creamy, orangey concoction but my bf does and had an extra one for me so it's a great deal, totaling $25 on the tab or $30 with gratuities.  The lunch specials are the hidden secrets on Smith Street so if your work schedule allows it, take advantage of the restaurants which are open for lunch and have specials.  As far as the food is concerned, I had the ubiquitous pad thai with shrimp which was very tasty, slathered in a tad too much sauce but still delicious.  (I like my noodles a little drier).  The rice noodles are the small size so they're thinner and perhaps sopped up too much of the sauce.  If they had the more traditional medium sized noodle with the sauce, the pad thai then would have been ideal! My bf's masaman was very good too.  The chicken pieces were tender and the red curry stew was brimming of peanuts.  (I like a lot of peanuts in my masaman and it was as if they knew we were going to share so they put in extra for me).  The other nice touch is that, in addition to the regular potato in the dish, they also have chunks of sweet potato. Not all masamans have both kinds of potato.  The sweet potato added a little, well, sweetness to the red curry sauce.  The service was quick and attentive so I am changing my initial 2 stars rating when the first opened,  to 4 stars for my better dining experience.  This can be potentially be a lunch spot for the local downtown Brooklyn employees.  The restaurant is conducive to dining singularly or with the whole office.  Their seating arrangements can accommodate almost any size group.  There is large communal picnic table in the back for larger parties. Glad we have a good Thai place now in Cobble Hill.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "One of my favorite things to hear in songs nowadays is \"Metro Boomin wan some more\". Strangely enough, I associate it with Kor Tor Mor. The food is good and it's a place that I keep coming back to. I think where Kor Tor Mor excels is its drunken noodle. It's the best I've had in Brooklyn. No need for peanut sauce or anything else on it. It has great flavor. Service is outstanding as well. Great place to get a chill meal.", "author": "One L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-02", "description": "Some plates are good, some are below average. Steer clear of pad thai noodles. Generally 3 stars since its hit or miss", "author": "Jared B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-14", "description": "I've been coming to this location for years - it's had 3 changes of ownership since. I'm not very impressed by the new ownership. The space is still great (though I really dislike the fake plants on each table, personal preference). The food is nothing to write home about. If you order tofu and vegetables in a dish, the tofu is not fried, it's just chunks of steamed tofu, pretty tasteless. The veggie dumplings are not good - there's something mushy and edamame which tasted a bit undercooked. The chive dumplings are good but too greasy. The roti app was good. Food is okay, nothing spectacular, but fine otherwise. Someone packaging the food was wearing a face mask and coughing so I am not running back there anytime soon.", "author": "Kay B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "Great restaurant. The service was fast and attentive. Nam Fried Rice was delicious.", "author": "M R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-25", "description": "Good food, but the delivery is extremely unreliable and has been getting much worse lately. It usually takes upward of an hour to get food delivered within carroll gardens.", "author": "Ben P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "Came here during lunchtime hours and surprisingly, it was not hard to get a table until the end of our meal, so it was great for us! \n\nThe prices lunch specials between 11am-4pm are a steal! Ordered the Thai Iced Tea and it was delicious and came in a cute glass. I ordered the Drunken noodles with spring rolls and it was amazing. Friend had ordered massaman curry and it was good. Sweet and a little spicy. \n\nService was good, probably helped that it wasn't really busy. \n\nWould come here again.", "author": "Jen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-02", "description": "Looking up some vegan options in the area, after a visit to the Brooklyn cat cafe.. and Kor Tor Mor popped up, with some reasonable vegan fare. Came in (the three of us), it was quite empty.. so we were seated right away. The restaurant was nice, I liked the layout and long bench chairs they had. Immediately greeted, and water was on our table within a matter of a minute. The waiter, was quite nice and responsive. On to the food, we enjoyed the scallion pancakes and the corn fritters (although a bit on the oily side). For our entrees, I had the Kee Mao with vegan shrimp, I requested no egg.. and fish sauce.. and the dish was brought out with egg.. No big deal, the waiter was more than apologetic and returned it back. My boyfriend had the Thai fried rice with mock duck.. and he enjoyed it (as well as I). All in all, solid Thai place.. I will visit again.", "author": "Shay D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "There seems to be a whole row of Thai restaurants on Smith and its neighboring Court street. I've tried many of them but found Kor Tor Mor to be the best. I can't say I've found super authentic Thai food in NYC (other than pok pok, which I definitely recommend a few blocks west), I think Kor Tor Mor stands out from the rest of the very Americanized Thai food. \n\nI've dined in and done delivery from this restaurant and their food is always consistent and delicious. I usually get the drunk man noodles or the pad see ewe. I've never once received old soggy noodles or noodles that were overlooked. They were also never too salty or sweet, just the perfect amount of everything. Their calamari is quite good and I also recommend their papaya salad (it comes with dried shrimp, something most places don't come with). The servers are very friendly and delivery is always quite punctual. Brownie points for them having lots of vegan and vegetarian options! \n\nIf you're ever unsure of which of the Thai restaurants to go to on Court/Smith St, I definitely recommend Kor Tor Mor!", "author": "Maria J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Definitely coming back here to try more stuff! Ordered over the phone Drunken Noddles. Price was right. Portions were right.$14.16 for drunken noodles w/ chicken + extra chicken. I've paid more and this was better. It was really good and fresh. Service great and employees very cordial. The place looks really nice. Nice atmosphere. Wanna come back and be able to sit down as I was just picking up.", "author": "Joel I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "This is the best Thai food on Smith Street. I really like their massaman curry. I haven't ever ordered takeout before, but the dining in experience is really very pleasant.", "author": "Ariane B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "I ordered a veg/tofu pad thai to take out.  I was really looking forward to taste the food since there were so many positive reviews.  Boy, I was so disappointed and felt sick after consuming it.  The pad thai they made was a soggy mess with a weird sour taste and not the usual lovely peanut flavor.  The vegetables in the dish was tough and not fresh.  The price is quite reasonable, but I am not sure if I want to try other food there if they can mess up a stable Thai dish like that.  The gentleman waiting the table seemed so cheerful and lovely, but the older woman at the register was quite unpleasant.  She didn't response to my hello, thank you so much, etc, as if I was not there.  Really strange...", "author": "Nyc F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "I gave this place a five stars because the food we ordered, Spicy Basil Sauce was very, very delicious! Quite spicy but the sauce, the veggies and the chicken were prefect! Will order from this place again in the future", "author": "Jhan B."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Kor Tor Mor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "204 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/3nggILUMWgRAPhsYh1La_A/ls.jpg", "@type": "Restaurant", "telephone": "+17187975100"}