{"aggregateRating": {"reviewCount": 208, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-03", "description": "I wanted to love this place. The restaurant is super cute with adorable faux plants on each table. Two banquet tables in the back had lovely faux flowers. Prices were low. Service was also excellent so I really wanted to love this place. \n\nThe food fell short of expectation. Chicken satay was so oily, there was a puddle of it on the plate. The oil completely masked the marinade on the chicken so all I could taste was oil. The yellow curry, I requested mild, but it was still spicy. The tofu was deep fried, but strangely dry and chewy. Thai iced tea was good though.", "author": "Mallory L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-20", "description": "I came here after my usual Thai place was not open until 5. I think my love for Thai stems deeper than just having the basic Thai as living in Thailand for a month made me appreciate true authentic flavor. I ordered the pad see ew and I was not impressed. I felt as if flavor was lacking in the broccoli and the dish itself. I ordered corn fritters as an appetizer and I really enjoyed it but it was a bit oily. \n\nThai tea was very good, as was the service. Decor is beautiful and everything had a very nice presentation. I think they need to raise the bar on there flavor profile. There are much better Thai restaurants in the area that are within a 5 min drive. \n\nInteresting appetizers. Cash and credit accepted.\n$10 pad see ew. \n$3 Thai tea. \nAppetizers start as low as $5", "author": "Marlena K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-18", "description": "BEWARE!!! \n\nDined at this restaurant a couple of days ago. Despite the food being good, the service was subpar and the waiter actually committed fraud and illegally changed the tip amount on the credit card receipt that I signed. \n\nI doubt that I'm the first patron that he's done this to. His name is Ko, he works the lunch shift on Sunday and it is now my mission to get him fired so that this doesn't happen again.", "author": "Eleonora F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Beautiful interior design, and a very kind waiter. The food (udon pad kee mao and Tom yum fried rice), and the drinks (Thai iced tea). Overall great experience!", "author": "Aditya S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-06", "description": "The presentation of the food was great and its flavors matched.  Their portions were big as well.  Skip the cocktails, they lacked alcohol, save your money for a near by bar such as Clove.", "author": "Beatriz O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "Great food great people great staff who can ask for more? Definitely recommend if you love Thai food this is the place to be.", "author": "Pathapong G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-24", "description": "The dumplings were frozen inside and the papaya salad was warm, not the freshness expected. I was really deceived and didn't find the authentic homemade recipes I was looking for.", "author": "Melanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Amazing authentic Thai food. Or at least what I think is authentic. The only thing that I didn't like was the pungent odor in the dining room, but food was great!", "author": "Shirin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "The food was great and the amount was great for the price we paid. The waiters were all so friendly and happy. I'm really happy I took my mother there for mothers day, she liked the fried rice and appetizers. I really recommend it, whether you go as a group or individual it's a great place.", "author": "Natalie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-06", "description": "Cute restaurant designed with a very coffee shop-esque feel\n\nPretty good Thai food and service", "author": "Janice G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "I have not been to this place before but I was hungry for some Thai food so I took my chances. I'm so glad I did. It said 45-60 min for delivery but it came in maybe 30 min a plus for me. I ordered the curry puffs (only comes with 3) which I've been eyeing for a while, a salad with peanut sauce and chicken basil fried rice. I split it with my boyfriend as it was enough to go around and boy was it delicious. Now I will say it was a bit spicy but very very good. I did spot some jalapenos but still a great dinner just make sure to have a soothing drink close by. Would definitely order from here again.", "author": "Sylenya P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "We ordered delivery (through Yelp) on Sunday night - Pad See Yuu with chicken and Drunken Noodles also with chicken. Delivery was about 30 min ahead of schedule! My wife and child really enjoyed the Yuu. My Drunken Noodles were quite tasty, although I would choose Medium spice instead of the default spicy. It was crazy spicy. Good flavor, but wowza! \n\nI think there is a good chance that this could become our local Thai delivery joint. Stay tuned...", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "First time there, immediately greeted given a table server very nice , given  a carafe of iced lemon water , very nice.\nI ordered a beer, muscles and larb salad. I didn't get the beer, no biggie i lived. Food came fairly quickly. The muscles came in a very light somewhat bland lemon grass broth. Once the six muscles were eaten only could eat so much if the bland broth\nThe lard was excellent very flavorful and a generous portion. \nWill go again but will pass on the muscles.", "author": "Guy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "I felt like I was back in Thailand for a holiday. Awesome food with Singha on the side. The fried catfish salad was a highlight.", "author": "Rajarshi C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "I stopped review for awhile especially those that i found not even worth my time. I will only yelp the worst and the best that i found the general public should be entitled to know. Ordered over $60 for delivery through yelp. Most of the dishes came cold except for two noodles. Had special instructions everything extra spicy except pad thai and grilled chicken. Well, only drunken noodle came in spicy. My two soups came in cold and not spicy at all. Tod man(fish cake) are dried, oily and really cold. Believed that it might be fozen or pre-fried again. The only dish that i found decent was papaya salad with salted egg which no chili at all. \n     Strangely, it did not provide any utensils and napkins. I also requested chilies on the side, not even half found. Well, I'm glad to tip them $6 instead of $10. It is not about the money at all. Did not expect authenticity from this place but cannot even deliver a decent standard thai meal. It just ruined my craving spicy meal! Should just stick to my original plan to try ugly baby and uncle boon. I miss larb and sripraphai....", "author": "Jasmine W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-12", "description": "The food might be ok, but I never found out because the delivery person delivered to the wrong address. When I called seamless to cancel my order, this restaurant lied about what happened and told seamless that they showed up to the right place and I wasn't there. Here's what actually happened:\n\n[I get call from the delivery guy]\nDelivery guy: Can you come down?\nMe: I guess so, but that's unusual. Where are you?\nDelivery guy: I'm here\nMe: Ok, I'll come down.\n\n[there's no one in the lobby]\n[delivery guy calls back]\n\nDelivery guy: Hey, can you come down?\nMe: I did, there was no on there.\nDelivery guy: you should come down.\nMe: Where are you?\nDelivery guy: I'm at the corner at Flatbush and Tillary\nMe: you want me to come outside? That's fine, but I don't live on either of those streets.\nDelivery guy: you live at 11 metrotech\nMe: I'm pretty sure I don't. I live at XYZ address\nDelivery guy: Yeah, got it, 11 metrotech\nMe: No, I live at XYZ address\nDelivery guy: Yeah, got it, 11 metrotech\nMe: No, XYZ address\nDelivery guy: Yeah, I'm the corner of Flatbush and Tillary\nMe: Nevermind, can I just cancel this order?\nDeliver guy: [curses under his breath, but loud enough for me to hear, hangs up]\n\nAccording to the seamless rep, the delivery person showed up at my actual address and not 11 metrotech and I wasn't home, which is untrue on both counts. I get that delivery screwups happen and I don't generally mark a restaurant down for a single accident because accidents can happen anywhere, but come on, lying about what happened was not an accident.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-15", "description": "Ordered take out from Kor Tor Mor yesterday through Yelp Eats and am glad I did.\n\nI was craving Pad Thai and this definitely suited my craving. I ordered medium and it was pretty spicy. Almost too spicy for me but just barely. If you're questioning it and aren't a big fan of super spiciness, I'd suggest going a level down from what you're thinking. (It's a five level range.) I also got dumplings but I wasn't a big fan... they were kind of (definitely) STUFFED with meat and I didn't really like that. I also got the glass noodle vegetable soup (there were two people for all of this as you might be wondering by now) and it was good. Not too much flavor but it was good. It hit the spot.\n\nYelp Eats said it would be between 45-60 minutes, but the delivery guy was to my place within 30 minutes which was great. Overall, my experience was good and easy and I'd definitely order take out from here again.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Soooo I was pretty surprised with this place . I thought it was going to be regular regular Thai place but it was decently good . I had the shrimp pad Thai and spring rolls . Both delicious and it was nice and empty which I liked lol I also loved the decor . The plants on the tables and the brick walls . The food was delicious and cheap by the way which was even better .i enjoyed myself thoroughly .", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-11", "description": "I NEVER leave reviews on here. But they deserve one. They made me the most incredible vegan pad thai -- sans fish sauce --  ever. Super fresh vegetables, great portion, tasted amazing. Dumplings rocked too. Best Thai food around park slope!", "author": "Hannah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Great place! Can't even find what I didn't like. Great service, food and ambience.\nWe went there right after the movie and were seated right away. Our server was very attentive, nice yet not intrusive at all. He even apologized in advance that my fish might take a little longer, so I was prepared to wait half hour, but it came out few minutes after. The menu is clearly labeled, staff actually knows the difference between 'vegan' and 'vegetarian' and ingredients of the dishes. You'd be surprised, but I've recently eaten in the place where waiter had no idea that mayo can contain eggs and oftentimes does. But that's on the separate note.\n\nWe got:\n- vegetarian appetizer sampler $11. My fav was chive dumplings and steamed veggie dumplings. Fresh and very thin dough, I barely stopped myself from ordering a separate appetizer. Fried tofu was kind of blunt, but tofu is tofu, and selection of sauces helped a lot (the best was the one with peanuts in it  yum!!!)\n- drunken noodles with beef $11 - amazing, we wanted spicy, and we got spicy. Large portion, fresh and not too sweet.\n- salmon in ginger sauce with side of jasmine rice $18. I loved it. The salmon was larger than my palm, such a generous portion. Not too sweet again, not oily, I enjoyed it immensely.\n- 2 hot jasmine teas - $3/each. My tip is to get one and share, it is served in a glass jar and you pour it in your cup. $3 is fine to share but for a cup is kind of pricey.\n\nDefinitely a keeper, definitely coming back to try other yummy options on the meals!", "author": "Diana .."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Kor Tor Mor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "204 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/3nggILUMWgRAPhsYh1La_A/ls.jpg", "@type": "Restaurant", "telephone": "+17187975100"}