{"aggregateRating": {"reviewCount": 208, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "One of our favorite spots, either for delivery/take out/dine in, the food always taste delicious. The place has a romantic feeling and people are really nice and refreshingly relaxed. Try out their roti canai!!", "author": "Laetitia D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-25", "description": "I had called to order delivery thinking it would save them some money by not going through seamless, but I'll probably never do that again. The lady on the phone was very dismissive and impatient. She also took down my unit number incorrectly a few times - I had to keep correcting her and she kept cutting me off saying she got it. I was quoted a 40 minute window, but the food arrived 1.5 hours later... to the wrong unit number. I called the restaurant and they said the delivery guy left a long time ago, but the food was still pretty warm when it arrived, so I'm going to guess the delivery guy came straight here. Not cool to try to blame it on the delivery guy. Food itself wasn't bad - I like that their pork option for any of their noodle isn't super dried out pork like most other takeout places tend to be. Curry puffs were greasy and soaked in oil though :(", "author": "Jenny J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "Spicy city! Had the fresh summer rolls to start which were paired with a very spicy plum dipping sauce, wowee!\n\nPanang curry (with perfectly fried tofu) was equally, if not more, spicy. The number of jalapeños far exceeded the peppers and green beans in the dish. But it was so tasty! \n\nPretty good prices and a great atmosphere, just roll back a tad on the heat factor lol.", "author": "Caroline D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "Very solid Thai food. Got the Shrimp pad thai and it was one of the better ones I've had in NYC. And very good thai iced teas!", "author": "Scott S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Came from Virginia where Thai food was aplenty. I missed the super spicy fried rice and I was let down by another restaurant's spicy fried rice being too sweet instead of actually spicy. This place hit the mark. Their normal fried rice with a request of spicy sauce was exactly the nostalgic taste I was craving. Their steamed dumpling was packed with yummy veggies and meat. I can't wait to have another craving to eat that awesome fried rice again.", "author": "Mimi F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "I decided to come here for lunch with a friend while passing by since their lunch special was available: an appetizer and an entree for $9. We were greeted promptly, but the restaurant seemed a bit short-staffed. After choosing a seat, we wound up waiting about 5 minutes for the server to finish ringing up another group's order before even receiving a menu even though there weren't that many people there at the time. However, the service was great once we received our menus. \n\nI ordered the spring rolls for my appetizer, and it came with a salad that had some sort of peanut-based dressing. The appetizer was pretty good! For the entree, I ordered the drunken noodles with pork. While it was tasty, I was a bit disappointed because it was not even slightly spicy, and it was extremely salty. Not my favorite drunken noodles dish when considering all of the other Thai food places in this neighborhood. However, my friend ordered the chicken basil fried rice which was very tasty! The portions look small, but they're pretty deceiving. I left feeling very full and was satisfied given how inexpensive the meal was. \n\nThis is a cute, casual place with large open windows and beautiful decor.  My only actual complaint is the bathroom -- it has VERY dim lighting and the lights may as well have been off. In sum, I had a solid dining experience here and would give it 3.5 stars. Again, I would probably consider one of the many other Thai food places in the neighborhood before coming here again, but Kor Tor Mor definitely fits the bill for tasty, affordable food.", "author": "Delta L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "Came across this place as a recommendation from my girlfriend. The place was well set up and spacious with lots of seating. We came pretty late so there were ample room and was able to order right away. The Thai Ice Tea was standard and a good way to start the evening while we wait for the appetizer and entrees.\n\nWe ordered:\n\nDuck Rolls: A classic take on Peking Duck wrap in a roti. The flavor was spot on and wrap in almost a crepe like consistency gives a good vehicle for the duck to come across not overwhelming the flavor but subtly complimenting each other. Would love to order this again next time I visit.\n\nWhole Red Snapper in Panang Curry: I had been to a lot of thai restaurants but never had I expected a whole red snapper as an option. The red snapper was fried and cooked in panang curry which is mixed with spices, coconut curry, bell peppers, lime leaves and string beans. Chef Fang and Chef Dyo has out done themselves with this. The fish was crispy on the outside and light but delicious on the inside. Furthermore, being surrounded by the panang curry adds another depth of flavor. This is a must have if not with panang curry as it might be too spicy then one to your liking then. However, be warn that this is a whole fish so prepare for some bones and be a little cautious while consuming.\n\nDrunken Noodle: Simple dish done right as it tasted like how I expected with all the complexity of sweet, salty, sour, and spicy wrap up into one. This is usually my go at every Thai restaurant as I am a sucker for Drunken Noodle. Nothing better than sautéed flat noodles with egg, onions, bell peppers, long hot peppers, broccoli, bok choy, carrots in spicy basil sauce.\n\nAll in all I would definitely come back to Kor Tor Mor as its simple with a bit of nuisance in terms of options. They do not try to remake what is already fantastic, however, simplicity and finesse goes a long way at Kor Tor Mor.\n\nRecommendation:\nDuck Rolls,\nWhole Red Snapper w/ Any Curry you prefer or try the Sweet Chili Sauce\nDrunken Noodle\nCatfish Mango Salad (Did not get to try but sounds amazing)", "author": "George L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "I love Thai food. Actually, that might be an understatement. I could live off of Tom Kha soup. The exotic flavor, the lemongrass, the lime juice, the coconut milk, just everything about it makes me so happy. $10 for a huge container of it? I order it every single time! It is the ultimate comfort food to me.\n\nI've ordered from here an embarrassing amount of times and have tried quite a few things. I love the Thai Salad. It is so fresh with tomatoes, onions. mixed greens, cucumbers and lettuce. The peanut sauce is addictive - sweet, tangy but also well rounded. The salad feels both healthy and indulgent, which isn't something I feel very often.\n\nI also cannot turn down a Thai Iced Tea. Their Edamame is great but pretty generic. Their Chicken Satay is fresh and juicy. Their Chicken Wings are crispy and absolutely delicious.\n\nI am a huge fan of KorTorMor and I intend to order from them a whole lot more! Thank you for existing.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Wow I love this place. I get it at least once a week and I'm never ever disappointed. This is a guarantee for an amazing meal. The servings are generous and the spring rolls are just the best. They are usually pretty fast at delivery and they are super kind. I highly recommend you try this place out.", "author": "Sterling E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Wow, great Thai delivery.\n\nI didn't really like Hop Hap, a previous incarnation in the same spot, but new owners and a new name and-- bam!-- transformation. Delivery came quickly, in maybe twenty minutes. \n\nEverything was tasty: Thai iced tea, tom yum soup, curry puffs, and drunken noodles. The tom yum soup with shrimp was spicy and flavorful. The drunken noodles with tofu was also spicy, with a good amount of assorted veggies. The leftovers held up well the next day. \n\nDefinitely recommend!", "author": "Jess P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Late night thai cravings led me here. My friends and I barely made it before the kitchen close which is at 10:30pm on weekdays. I ordered beef drunken noodle and it was delicious, flavorful and spicy! The curry puffs are good too. \n\nDefinitely would come back to the neighborhood when I'm craving Thai food and to try other items on the menu.", "author": "Julie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "My coworkers and our \"try every Thai place in the area\" continued today, as we walked all the way over to Kor Tor Mor. I almost always get pad ka prao as my go-to Thai lunch dish. It's a mainstay in Thai cooking, has some heat, and has a buttload of basil.\n\nBut not today. Today, I got drunken noodles (with chicken). For an $8 lunch special, you get quite a bit! We also got a choice of appetizer--I got tom yum--and a Thai salad.\n\nThe salad was interesting...I think they just put satay sauce on top. The tom yum was awesome, and was easily the best item of the day. Subtle heat, strong galangal and lemongrass flavoring...delicious! Drunken noodles came in a sizable portion and were pretty good. Not overly-greasy, not too much heat (but plenty of peppers)...although it was a lot of noodles. \n\nNext time, I'm trying pad ka prao. I thought service was sort of slow and they didn't have any of the typical Thai condiments, which was a shocker. Other than that, definitely another solid choice for the area!", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Quick delivery, delicious vegan options! Packaged nearly and well. I Will order again and again.", "author": "Alesha V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "Amazing food, crazy fast delivery!", "author": "Aneesa H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-17", "description": "Wouldn't recommend this place. Although the service was friendly and the ambiance ok, it was just 'Meh'. The food didn't have much flavor (Tofu Delight) and the veggies seemed to not have been washed properly as we were chewing on sand (?) every now and then. Started with an order of Spring Rolls but there was more fried dough than actual filling.\nYour experience might be different!", "author": "A. W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-31", "description": "The delivery time was faster than I expected. Food wise I'd give it a solid Average. Nothing negative to say it just didn't knock me out.", "author": "Phil W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "One of my favorite Thai places in the neighborhood. Their Tom yum soup and Tom kha soup have the perfect sour taste (most places have too much sour taste). Their chicken biryani with yellow rice and sausage fried rice was really yummy too. The sausage they use have little vermecilli pieces in it, which gives it an interesting taste. The duck rolls were also delicious wrapped in scallion pancake. It was like a mix of duck and bahn mi. Also their waiter was very kind to run after us after we left to give us our credit card cuz we forgot", "author": "Chengzhi W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-22", "description": "I've wanted to try this restaurant for a while now and finally talked hubby into Thai dinner.  I have a feeling he won't let me pick a place for at least a few weeks now ... To be fair, I'd give our experience at Kor Tor Mor the other day 2.5 stars .. they were quite apologetic. \n\nLet's start by saying that the atmosphere is pleasant and welcoming; clearly the place is popular as the staff kept quite busy with take out orders.  We ordered appetizer sampler - two spring rolls, two wings, two dumplings, and two chicken satay.  I did enjoy the satay and the sprint rolls; the chicken wings were ok but I didn't really care for the dumpling - which is sad, I love dumplings.  We also ordered the crispy duck salad.  It was interesting - a bit too overwhelming with ton of onions and vinegar, the duck part was tasty though.  \n\nSo here's why the 2.5 stars - hubby ordered whole red snapper in garlic sauce, making sure to ask questions about it as he is a picky one.  I wasn't ready to order yet and placed my order a few minutes later - seafood panang curry (not all too impressed).  Our appetizers came .. our salad came ... my curry dish came ... and while nibbling on it, I started to wonder - \"where is the fish?\" Hubby laughed it off - \"someone had to catch it\" .. well, after another 10 minutes of it not being caught, I inquired into its status and guess what, the order was never put in ... funny, considering how much attention it got when it was placed.  Well, one disappointed (to say the least, more on the pissed off side actually) husband later, we wrapped up my curry and asked for the check.  \n\nThe staff really were apologetic but unfortunately, the damage was done - ouch.", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-16", "description": "Solid thai fare; drunken man noodle was quite good and so was the house special rice bowl dish.  Coconut rice was lovely as well.  Nice decor and ambiance.", "author": "Max H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Lunch special is definitely a steal! I got the chicken pad thai combo with a small soup and salad for $8. Their thai iced tea is delightful as well. \n\nMy friend got the vegetarian Mock Duck. He said that it tasted pretty good, and it's pretty special for a restaurant to have options other than just tofu/veggies to cater to those who can't eat meat.", "author": "Mandy J."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Kor Tor Mor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "204 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/3nggILUMWgRAPhsYh1La_A/ls.jpg", "@type": "Restaurant", "telephone": "+17187975100"}