{"aggregateRating": {"reviewCount": 208, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "I came here to eat lunch by myself the other day. I usually go to Spice but they were closed for lunch hours, so I'm glad I found this place, which is also more affordable. Wonderful service.. my waitress was very friendly and kind. I ordered the lunch special: pad Thai and spring rolls. The pad Thai was different than I have had in other restaurants - the noodles were more thin which tasted really good! The spring rolls were hot and fresh. I also received a side salad, the sauce was sooo good.\n\nUpdate: I now order from here allll the time. Their delivery is fast. Probably because my job is a few blocks down. I always get the thai iced tea..my favorite!", "author": "Abigail G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Anytime I'm on Smith Street I seek this place out. The food is really tasty and clean. Nothing I've had tastes heavy. The chive dumplings are my favorite and all the curries are perfectly sweet, savory and spiced flavorful.  Aside from standard Thai dishes this place also has some unique items catering to vegetarians and vegans.", "author": "Maria A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-21", "description": "Very quick delivery. The app told me it'd take 45 minutes or more, but it took 20 minutes. I ordered the lunch special pad thai with shrimp and spring rolls on the side, fried rice thingy, and thai iced tea. Apologies for me forgetting the name of the menu. Everything was seasoned very well, the seafood was well done, and the thai iced tea--best I've ever had from any thai restaurants. Reasonably portioned. The delivery came in very good condition (no leakage, no greasy anything, even with the tiny sweet sauce for a couple of spring rolls).", "author": "Eli K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Great vegetarian options and portion sizes. This has become a go-to place to stop with a non-vegetarian friend where we can both enjoy dinner before a movie.", "author": "Mary W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Been here a few times. Never disappointed. Possibly drunken noodles in this part of Brooklyn.", "author": "Peter G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "I don't go into this part of Brooklyn much but I was visiting a friend in the area when I saw this restaurant. As I've had a good amount of Thai food before I was a little skeptical yet eager to try a new place. \n \nWalking in, it is really quite spacious with high ceilings, brick and concrete walls, and little flower decorations that  give off a nice eclectic New York vibe. \n\nThe service was great, being greeted and sat promptly. I had a Thai iced tea and ordered catfish mango salad, as well as drunken noodles. The server mentioned that their Pad Thai was actually really good, which I wasn't in the mood for. \n\nI loved the crunchy texture and savory/spicy/sweet/sour blend of the catfish mango salad. They say good Thai food has a mix of those four elements, and they did it well. Not too much heat (I'm a wuss when it comes to spicy foods), but just right. Drunken noodles hit the spot; I had it with the duck which was succulent and fried to a little pleasant crunchiness. Both were super flavorful, solid choices on the menu. \n\nI was surprised to see a good variety of vegan dishes on the menu; plenty of options for everyone. They don't have a liquor license yet but I suppose it's only a matter of time. BYOB for now! It's definitely worth a visit - best Thai I've had recently.  I'll be coming again soon to find out about that Pad Thai...", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-01", "description": "I used to LOVE this place but feel they've gone downhill. I gave it another shot today and was very disappointed. For a late lunch, Mu husband and I got drunken noodles and pad Thai and both were super greasy and fairly mediocre. Not a fan anymore :(", "author": "Amy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Excellent execution, friendly service, and flavorful interesting food keeps me coming back.", "author": "Malcha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "We usually go to Spice Thai and decidedbto take a chance on this spot. It was absolutely delicious! Also, try the mango Thai Iced tea!", "author": "C. H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-27", "description": "The delivery was a little slower than my old Brooklyn regular, but the food arrived within an hour of ordering via Yelp so still within the communicated time frame. The pad thai was okay and fulfilled the craving I was having that night. I would've preferred more shrimp and that the food came a little earlier (it was a bit cold upon receipt). However, after warming it up, I was generally satisfied with the meal. Not a MUST HAVE by any means, but also not bad --simply average. I might order again given the convenience of Yelp and knowing what to expect, but I don't see myself craving this dish from Kor Tor Mor the way I have at other Thai restaurants.", "author": "Valerie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Very attentive server, spacious restaurant, nice ambiance and good food.  My steamed chicken and shrimp dumplings and drunken noodles with chicken were tasty and cooked just right. But next time I'm going to try the ginger chicken or basil chicken as those are my go to choices normally.  I also like Spice and Thaism. I will return to all three.  The neighborhood has reliable good Thai (but why can't a single good Chinese place open up?)", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "Best Thai in this part of Brooklyn! Every time we order it is superb and just damn delicious. Their drunken man noodle is superb (we usually get it with duck), their pad Thai is delectable and the chive dumplings and curry puffs also very delicious. I appreciate that their Thai iced tea isn't excessively sweet and don't feel I'm at risk of developing a health condition when I drink it. All in all a very solid establishment and delivery times are extremely fast!", "author": "Amber E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Each item that was served to us is bursting with flavors! Free water is infused with lime and mint leaves. Thai Iced Coffee and Thai Iced Tea are both delicious.  The Mango Avocado Salad has a citrusy flavor and make sure that you mix the dressing and salad prior to  endulging this \"healthy\" meal. Another aperitif we devoured is the Chicken Tom Yum soup. They give you a very big portion so make sure you save room for your main meal. As our main course, we had Beef Drunken Noodle which is also good for two. Needless to say, this noodle exuded an authentic taste of Thai cooking.  The waiter who served us is polite and took our order with a friendly smile. We sat by the front window while gazing outside the restaurant, enjoying the hustle and bustle of Brooklyn's city life. The price we paid for the whole meal is reasonable and if i live nearby, this would be a venue that i would frequently visit.", "author": "Felipe A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-29", "description": "Dissapointed. Panang curry was tasteless. We also ordered drunken noodles with duck- the duck was not fresh. The only good thing was the coconut soup.", "author": "E M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "Some of the best and most authentic Thai in NYC. Yes... I said that. I've been to pok pok, the red hook spots, and most other Thai places u can name - lotus of Siam in Vegas.  This is how Thai should be.  Up there with anywhere else. Service is great and staff are very nice. I see good reviews but a place of this caliber should be packed-maybe it was the cold that night. I'd hate to see this place fly under the radar and not get the business it deserves. \nThese people are from Bangkok truly making fresh Thai style salads - our crispy duck salad was fantastic, our Thai sausage fried rice was great, and our catfish mango dish was awesome. And we brought a bottle of wine as it's currently BYOB. 1 block from F/G.  This place is a gem in the neighborhood and people need to support. I'll be back soon.", "author": "Kyle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Finally found my favorite Thai spot in NYC. Look no further! This is a spot you wanna pop in! Talk about their Crispy Pork with basil (That's what's up) and can't get over how f*cking good it is!! This spot is good for lunch, dinner, midnight snack, munchies, or drunchies! \nDefinitely a place I'd recommend to everyone I know! I'll be coming back here again.", "author": "Kinley T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Very delicious delivery! They really care about service and presentation. I got the shrimp and pineapple fried rice. It was most, flavorful, and the shrimp were large. It was only $1 to upgrade with shrimp! Wow! Will be our go-to delivery place.", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "4.8 stars.\n\nExcellent food for excellent price in Cobble hill.\nThere are few Thai restaueants in the area, but I wantted to try this newly open restaurant.\nI went with a group of 3 and we were seated right away.\n\nWe ordered a Krapow duck, Spicy beef salad, and Pad Sator. The beef salad was one of the best I have had in NYC and was quite authenthic and flavorful. this was spicy and sour and tasted as it should. I like the Krapow duck and Pad Sator as well. with just as much flavor. However, They were a bit too sweet for my liking. However still really good though! The service is also very fast and attentive. I would be back!", "author": "Chat S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Hands down best and most authentic Thai restaurant in Brooklyn. Keep up with the goo work guys !!\n\nps: the guy who wrote that most of this restaurant's reviews are fake, is an idiot", "author": "Alessandro P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "Ordered quick delivery service.  Very tasty peanut dressing with the salad, and a great spice to the Pad Thai!", "author": "Sarah O."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Kor Tor Mor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "204 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/3nggILUMWgRAPhsYh1La_A/ls.jpg", "@type": "Restaurant", "telephone": "+17187975100"}