{"aggregateRating": {"reviewCount": 208, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Great food and great value! Love that it's byob and that they take reservations. Had the massaman curry and it was excellent. Very friendly service.", "author": "Alison M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "food is good. one thing they need to change is the music. totally ruins the ambiance. why not try playing some thai music? if not, you should choose a more updated playlist.", "author": "Tim H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Really tasty new spot! Good mix of Americanized Thai dishes and (very) spicy traditional Thai dishes. For the time being, exceptionally generous BYOB policy (no corkage fee when we brought beer). Also, nonstop tea! Highly recommend for group meals.", "author": "Alex L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "Kor Tor Mor is hands down my favorite Thai place in NYC (yes, that even means Sripraphai).  Their pad thai is ridiculously amazing, from the choice of noodle to its flavor profile.  I love spice, and they are not afraid to make my food Thai-spicy.  Their crab rolls are also a show-stopper.  I order from here frequently and occasionally dine-in (service is always wonderful).", "author": "EZ P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "Definitely a notch above the rest of the Thai restaurants in Brooklyn. They have some really authentic dish like raw shrimps- hopefully they will have more like these (like Chang Mai). This is my second favorite Thai next to Chang Mai in Brooklyn. Very nice service staff - yes less professional but they make up for it by their kindness.", "author": "Nina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "I loved shrimp tomyankun soup!!!!!!!!! Nice spiciness and lots of flavor!!! Also beef steak was sooooooooooo yum with lots of cilantro. Deserts were also nice. My fav is coconuts ice cream.", "author": "Haruka U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "This place is great! It was recommended highly by a friend and decided to give it a try. Soooo good!! The atmosphere is cool, open, airy and relaxed. And they were very accommodating...for 7 of us, we didn't have a reservation. It's also BYOB, which is always nice...they brought us rocks glasses iced for our yuzu sake and wine glasses.  \nWe all shared apps and entrees, so we were all  able to taste a few things. I'll be back for more but for now....best drunken noodles I've ever had, crispy catfish dish was amazing (we ordered several rounds of each...too good),  duck roll, rolled with roti bread, which gave it an awesome warm and crispy chew. Papaya salad with blue crab...yes! they have it with shrimp too, but I like this much more.  And chicken larb salad. It was a great meal.  Next time I'll try some more unique dishes on the menu. But if you want some of your favorite Thai dishes or feel like going a little more adventurous, I definitely pass on the high recommendation I got. Oh and also full vegan and vegetarian options....so nice not to have your veggie friends feel like they have to piece a meal together with apps. Anyway. It's not my neighborhood but its super close to the train...so I'll be back.", "author": "E B."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Kor Tor Mor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "204 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/3nggILUMWgRAPhsYh1La_A/ls.jpg", "@type": "Restaurant", "telephone": "+17187975100"}