{"aggregateRating": {"reviewCount": 208, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Best thai food in the area. Pad See Ew and the roasted duck salad are two of my favorites. Delivery is always on time and fresh. My go to spot.", "author": "Oliver G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "The food was amazing! I came for lunch and they have a price fix menu that is awesome. My husband said he had the best pad Thai ever. I had seafood on cashew sauce that was incredible. Also not expensive at all.", "author": "Camila R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "A little later than we expected on the delivery, but delicious and very fairly priced.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "This place is ridiculously good!!! Gourmet top notch and reasonably priced?! This is the only place I'm going to order delivery from. I'm such a food snob and I ordered a ton and everything is so good! So delicious and fresh. And finally a place that knows how to make crab Rangoon.", "author": "Maria R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-15", "description": "Really really good Thai food.\nTheir drinks can stand to be stronger or stick with wine/sake.\nI see a lot of groups go there. The wait staff is attentive and knowledgable.", "author": "Rose K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-28", "description": "Update: They have a C rating\n\nTheir lunch special is a decent deal but my go-to noodle dishes were kind of dry and lacking flavor. Green curry was sweet and just overall typical Americanized Thai. Nice ambience to dine in, just ok food.", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Amazing Thai restaurant! Their food was delicious and authentic. I ordered Tom Kha Soup and Larb Salad. They reminded me how much I miss Thailand. I thought I wouldn't finish them bcos there were a lot, but I did. I also had Taro Custard for dessert which I finished it too!", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-23", "description": "Horrible! I just had K2 - ginger with chicken and it's the worst Thai food I've ever had.", "author": "L. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "I hardly ever write reviews, but somethings compelled me to give this place a go. Conveniently off the F/G train stop, Kor Tor Mor is a great [and fairly new] authentic Thai restaurant in the heart of this up and coming area of downtown Brooklyn. \n\nThe atmosphere was nice and calm, and the decor had quite a industrial-Esk and hip vibe with large family style wooden tables, large plant life and high brick and concrete walls. We were greeted warmly and were sat right away. Even though they looked pretty busy with Togo orders, the waitstaff and manager were very hospitable, calm and accommodating. \n\nWe started off our dinner with something I've never even heard of [and I'm a huge fan of taro] the Fried Taro {$7}. Delicately shaved taro lightly battered and fried topped with peanuts and served with sweet chili sauce. Now that I have been introduced to the existence of this item, it's definitely something I will be looking out for at other Thai restaurants. \nOur next appetizer course was the Pohtak {$10}, a light soup with mussels, shrimp with a lemongrass broth with a kick! I say 'with a kick' as it does contain some peppers that compliments the lemongrass and the seafood. \n\nAs we moved on to the Crispy Catfish Salad {$12}, I was delighted at the portion size and overall aesthetic of this dish. With sliced mangos, onions, cashews and crispy fish flakes it was a mountain of sweet and textures goodness. Definitely a must have for anyone looking for a great way to fill up and for when I return. \nSince I had read a review about the Drunken Noodles {$9} I just had give this one a go. Our wonderful server suggested to get it with the duck and I was happy I went with her recommendation.  With a heaping pile of flat noodles, veggies and duck, I just couldn't bring myself to chow down on the entire dish as I wanted to save room. And trust me, it took a lot of will power not to eat all of these noodles. \nFor dessert we ordered the Taro Custard {$7}, served with fried onion chips and sticky rice, which is somewhere between savory and sweet. Although different from the usual desserts I have which are typically just on the sweeter side, it's nice to have one that changes it up a bit. We also enjoyed the Coconut Pudding {$6}, warm soft and slightly sticky light pudding served in cute little ramekin bowls. I heard if you order it as take out you can keep the small ramekins, maybe I'll look into starting a collection ;). \n\nOverall this is a place that I will definitely come back to visit, and even take some friends and my roommates when we feel like having great Thai food without having to go to Manhattan.", "author": "Jan U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Consistently good, and consistently fast delivery. We only get vegetarian dishes which are always full of vegetables and taste like they were actually just made vs having been sitting around for a long time. Would love more eco friendly packaging (in all delivery, not just them), but they do listen when I ask for no utensils to be sent.", "author": "Zoe G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-17", "description": "Worst meal I've had in a long time.  Appetizers had clearly been pre-cooked and frozen, and then heated up in the microwave.  Dumplings were still cold when served to us (needed another minute in the microwave, I guess) and the beef appetizer was absolutely inedible.   We considered walking out before the entrees came...in retrospect, probably should have, those were almost as bad.\n\nI'm giving it two stars only because the staff was great and the decor inside is very nice. Otherwise,  the food is an absolute disaster.\n\nI have no idea where all of the good reviews came from, those can't possibly be real.  I don't think I've ever taken the time to write a negative review before, but this place seriously should be avoided at all costs.", "author": "David F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Coziness \u0026 authenticity\n\nI found myself at home with authentic taste of thai food and cozy atmosphere. The place recalled me hometown. Kor Tor Mor is one of the best Thai places in Brooklyn and in Town. Highly recommand Pad-Char and Crab Fried Rice. Huge platters with reasonable price. Great for party...luv it!!!!", "author": "Suchada B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "+ Incredibly tasty food.\n+ Lunch specials are a great value for money.\n+ Staff is polite.", "author": "Arihant S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "I was craving curry in Crown Heights so I yelped it. The reviews sounded good so I hopped on the 3 train to check it out. \n\nWhen I got here I casually asked the waitress what she recommends. She said paid Thai straight up. So I ditched the curry and went for the Pd Thai. It did not disappoint. The pad thai is like the best parts of Scarlett Johannsen. \n\nThe only hard part was getting hot stuff to go with it. I usually like my food spicy so I was pretty surprised they don't have those little jars with the spicy choices. \n\nI'm going to try the red curry next time. All in all, totally Worth taking the 3 train just to check it out.\n\nAlso, the fact that $10 will get you pretty much anything on the menu is solid. And $5 beer. Yay!", "author": "Ben P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-02", "description": "Very modern, relaxing and cool atmosphere inside. The fat that they provide you with unlimited complimentary jasmine tea and keep the refills flowing is a massive plus for me! The food was all yummy and the service was on point. I would highly recommend stopping in here if you are in the cobble hill neighborhood. Also, as a bonus bit of information the name means Bangkok", "author": "Vikash S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-01", "description": "Ordered takeout. A bit disappointing. The pad Thai had no veg. Just noodles and chicken. Kind of dry. The tofu salad was nothing but tofu chunks and red onions. A let down at $10. Probably won't be a return customer here.", "author": "Rick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Very good!  Tried this place the other day.   Great service, nice atmosphere and very tasty food!", "author": "Frida G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "So I was in the mood For some Thai food - I figured I'd give this place a shot since it is new .i liked everything except for the sticky rice which isn't a dealbreaker but when you look for Thai food you kind of expect the sticky rice. The sticky rice was like a gummy bear in texture it was horrible can't break it up or cut it or even chew it I'm not new to Thai food so that's that", "author": "Allen G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-06", "description": "I also had a poor experience with delivery from Kor Tor Mor.  After waiting for an hour I called the restaurant for an update, the staff said I should be getting the food soon.  Another 30 minutes later, the person who answered the phone gave me the impression that she had no idea where my food was.  By the time my food arrived, it was cold. The Pad Thai had congealed so it was basically an inedible glob.", "author": "Cassis S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-29", "description": "The food is delicious but the delivery is the worst. This is the third time we haven't gotten our food within the expected time - the first time it happened we didn't get our food at all - it went to the wrong address and 90 minutes later I told them to just cancel. \n\nSo go in - great service in - the worst delivery experience - by the way it's not the delivery guys fault it is always bc the desk has taken too many orders, sent guy to wrong address or just gives out the wrong time.", "author": "Rosie D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Kor Tor Mor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "204 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/3nggILUMWgRAPhsYh1La_A/ls.jpg", "@type": "Restaurant", "telephone": "+17187975100"}