{"aggregateRating": {"reviewCount": 208, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "I ordered from this place so many time, but they should hire someone that understands English a better, maybe? I ordered online and mentioned I wanted my ice Thai tea a little less sweet, which Thai tea is mixed with condensed milk already, so I asked for a little more plain tea inside to make it less sweet. When the order came, they gave me a plain Thai tea with water and ice, with no milk in it...I called them and told them that's not what I wanted. They didn't even apologize to me and when I asked if they can switch it back for me, they blame that it was my fault that I didn't mention it clearly..and said that they won't refund or exchange it back for me. I was so speechless..I mean, if they didn't Understand fully of the order, shouldn't they call the customer?..sigh. I'm not going to order from them again, until they do something about their staffs..\n\nUpdate on this review:\nToday, a guy from the restaurant came by and gave me two ice Thai tea and apologized to me about yesterday. I feel much better now that I know someone care about this issue. This restaurant have great food, that's why I always order from them. However, I really hope that staff know she was wrong for not even apologizing to their customer.", "author": "Jing Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-01", "description": "Dining room smelled a bit fishy.  It was very weird.  The service and food were above average.  I'd go back, but that smell is just a bit off putting.  Hopefully, they get that figure out.  The dining room was empty on a Saturday night, also odd.", "author": "Kevin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "My girlfriend and I were craving Thai for date night, and we decided to give this spot a go around 8:30 on a Friday night. The place wasn't crowded at all, maybe 3 other tables sat and our service was attentive throughout. I think the majority of their business comes from take out as there were many lined up to go orders in the back during our whole visit. I ordered a Thai White Russian which was deeeelicious. I'm vegan so I was pleased with the variety of menu items to choose from, but we had planned on that. I had the ginger mock duck and asked to make it spicy. My girlfriend had some noodle dish with udon noodles and in the spirit of non meat eating added mock duck. Both of us were happy with our dishes overall. The biggest highlight was definitely that our bill was around $40 which is unusually cheap! We'll keep it on our radar for return.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-09", "description": "Completely screwed up my delivery order. No chicken in the curry. No brown rice that I paid extra for. No cutlery. Food was just average. Very bad experience.", "author": "Rebekah M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-02", "description": "Not amazing.  The dumplings were decent and the peanut sauce on the salad was the best part of the meal. \nI had the spicy basil w veggies. It was more like dry sautéed veggies with some salt and diced jalapeños. Meaning there wasn't  any flavor in the sauce (beyond a lil heat and salt). I wouldn't come back. \n\nThe ambiance is nice. The lemon mint water was pleasant. That's it.\n\nI do question the authenticity of all these raving reviews", "author": "Kelei T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-02", "description": "We order from this place every once in a while and usually it's fine. The food is decent and it arrives without problems. However, tonight after waiting for an hour and a half (30 minutes past the scheduled delivery time) I called and asked for the status of my order. They clearly couldn't figure out where it was so just told me it was with the delivery person and that it would be delivered within ten minutes. 20 minutes later I called back and they told me they would call the delivery person to check. Ten minutes later, no call, so we called and said if it wasn't going to be there soon we would just cancel. The lady on the phone just said \"Okay, we cancelled it for you. Thanks, bye!\" And then she abruptly hung up. No apologies, no acknowledgement, nothing. We finally ate from somewhere else three hours after we had planned. Extremely unpleasant and rude customer service. Would not recommend this place.", "author": "Adrian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "This place was so good! The staff was very friendly and the food was delicious. I got the vegan Rotti appetizer and the ginger mock duck meal. Both were great and I saved the remaining Rotti sauce to flavors the rice, which was my friends recommendation. She got a soup and a rice dish, that she loved as well. \n\nI'm hoping to go back soon! Really great.", "author": "Brad S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-29", "description": "Maybe it's better if you eat in but we were really underwhelmed with our takeout. The main meals (fried rice and massaman curry) were average, the spring rolls were really greasy and tasted like cardboard, and the fish cakes were beyond words: weird, rubbery things with no flavor.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-25", "description": "The inside decor is really nice, but unfortunately the food doesn't live up to the expectations. We sent back our fried tofu appetizer and they were nice enough to take it off our bill. The spring rolls were pretty good and the Thai iced tea was refreshing. The pad Thai was too rich and the salad had way too much peanut dressing on it. Not sure we will go back.", "author": "Miriam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Wow what a wonderful gem!! I stopped inside this adorable place with my boyfriend and it was fairly empty around 5:30 p.m. That spooked us because it just looked SO lovely. Quickly we realized it's a very hot takeout restaurant! Even though they're slammed with orders, service was perfect. The flavored water was delicious and the fried rice was to die for. Entrees are easily below $20 -- very good prices. I can't wait to come back!", "author": "Kelsey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "We ordered the drunk noodles, mango stick rice, and tum yum soap. Everything is perfect.", "author": "Dakota C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "A great family run operation. Standard Thai fare but done really well. Always fresh. Killer lunch specials. It's my standby in the neighborhood. I always dine in so I don't know how delivery is.", "author": "Jeffrey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Delicious food. Fast and pleasant service. Nice ambiance. Great for vegans. Only small complain is the background music which was a bit loud.", "author": "Keld L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "I am a huge Thai fan so I'm always looking for the next Thai place to try. I stumbled into this place one day looking for where to eat lunch during my work hour. I ordered the drunken noodle lunch special.  Came with a salad and spring rolls. The spring rolls were amazing crispy and the noodles omg great flavor. I didn't really expect it because I had just tried lemongrass and their food kinda sucked very bland but this place the go to spot If you are in Brooklyn. Yummy affordable oh and the best thing I found out they deliver for free!", "author": "Natalia R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-14", "description": "I wish I had liked this place more but it really just wasn't very good at all. I had the green curry and the vegetables were not cooked enough at all and the tofu was in huge very tough pieces. The fried spring rolls were also below average and were packed in a bag instead of a plastic container. Since the dipping sauce was also thrown in the bag the little plastic cup started to melt and got sauce all over me when I went to pull it out. Pad Thai was definitely nothing special. Won't be back.", "author": "Samantha M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "The waitress seem very annoyed~ not sure if it was a bad day for her or a possible culture difference.. Regardless, the food was ok, tastes like thai food at any other place, the appetizers soups were good and the bill was super inexpensive as we were there at lunch special-- $23 dollars for 3 appetizers and 2 meals. The environment is cool except for the fake fern table holders, eh. I'd go back but not for a special occasion", "author": "Cee V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "I just ordered delivery from Kor Tor Mor and I'm so blown away by my experience that I have to write about it before I even sit down to eat. My boyfriend and I ordered the pad thai, noodle soup, and fried spring rolls from them. They delivered in a timely fashion and everything was delicious. My boyfriend tried the pad thai and said it was the tastiest he'd had in this neighborhood. We decided to transfer everything to plates and after I had plated his food, he went to pick it up and the plate broke in his hand! It was a total freak accident - everything, the noodles and the spring rolls, fell on the floor. He was pretty devastated, especially since he had tasted the food first and was excited to get into it. I calmed him down and explained that I would place another order of the pad thai and spring rolls for him and he could just play Assassin's Creed in the meantime.\n\nIn my second delivery order, I included a note apologizing for making them deliver to the same address again, briefly explaining our situation. I paid for the order in full and, once again, it arrived very quickly. After opening up the bag, I discovered a free salad and an extra order of spring rolls! Both had a handwritten message saying, \"On Us\" with a smiley face. This really made up for the frustrating experience we had with our last order, which wasn't even the restaurant's fault AT ALL! These sorts of extra kindnesses in service really make a difference and I don't want it to go unnoticed. So thank you, Kor Tor Mor, for your delicious food and your unnecessary but very gracious understanding. Cheers!", "author": "Ashley M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Decent Thai food in an area with a lot of Thai restaurants that are pretty blah.  \n\nWe got the Glass noodles and they were very good.  Got the chicken basil and cashew nut chicken both were good but tasted very similar.  Tried the vegetable spring rolls and they were mostly dough with little filling.", "author": "Jane D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "I ordered right off yelp, they delivered fast, the food was amazing (I got veggie steamed dumplings and chicken Pad Thai). great delivery option", "author": "Vlad V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-29", "description": "I ordered a tofu pad thai, chicken drunken noodle, and roti + curry from Seamless and it came within an hour (still hot and all!): \nTofu pad thai: the amount of noodles was generous. However, the tofu seemed old/ not fresh. The skin on the tofu was chewy. \nChicken drunken noodle: great amount of flavor and perfect amount of spice- there are bits of jalepeno peppers. Chicken was good- no complaints.  \nRoti with curry: the curry was good, but I thought I paid too much for so little. \n\n-1 star because of the chewy tofu and -1 roti+curry amount/cost. At least I know what to order next time-- the noodles were definitely good.", "author": "Yen N."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Kor Tor Mor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "204 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/3nggILUMWgRAPhsYh1La_A/ls.jpg", "@type": "Restaurant", "telephone": "+17187975100"}