{"aggregateRating": {"reviewCount": 29, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "Delicious small plates with fun and friendly service. Restaurant is small and owner \"is the wine list\" -- just describe what you like. \n\nLoved the oxtail ragú and tiramisu. High prices for the portions but worth it.", "author": "Alexandra L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "Nice little bistro, very European vibe. Had to give one star off because they were playing really bad 90's hits. \n\nThe portions are small but FULL of flavor. You could tell the pasta was made fresh- practically melts in your mouth! Worth the price but might not leave you full. Great wine list. A little light for dinner for me, but a great spot for lunch.", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "Tucked down a couple of steps on South Portland, Fradei is a cozy... (and cozy by bklyn standards), restaurant - maybe 30 seats in total? I definitely appreciate the intimacy of the space. \n\nService? Great.\nMusic? So-so.\nFlavors? Very good.\nPortion? Small.\nTiramisu? Awesome.\n\nTo give some perspective, (and this is totally my personal opinion)... in Fort Greene, this place rates 4.0-4.5 stars... a neighborhood like Williamsburg, I'm leaning more toward 3.5-4 stars. \n\nI'm all for smaller portions, but these portions were quite tiny. I left hungry and this was after 2 appetizers, 2 mains, glass of wine, dessert and espresso. There were 2 of us dining. \n\nAll in all, Fradei is a good spot - we enjoyed it. There are just a few things to beef up on that would make this a solid restaurant in the neighborhood.\n\nSome things to Note:\n- Menu changes every two weeks\n- Walk-In's only\n- Their Tiramisu is excellent\n- Very personable \u0026 small staff\n- Portions are small\n- Typical menu will have about 3 starters \u0026 about 5 or so mains. If you're into a glutinous menu, go elsewhere.", "author": "Tara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-31", "description": "I have never eaten here but wanted to try it  and I won't at this point. I have spent the better part of the past half hour trying to find a menu or phone numeber for this place. No dice and it shouldn't require college level research to find a menu or phone number anywhere online. Wondering how this restaurant  actually earns a profit with no information about the food they serve or a contact number online.", "author": "Amanda A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-15", "description": "There are too many places in Bklyn to go without attitude.  Stopped in after seeing that this place was opened only to be met with a micro-aggressive bartender and a preoccupied staff that were busy chatting up their buddies.  Food mediocre as well as the wine.  Won't be back.  I blame Trump ‍. It's the times we are living in unfortunately.", "author": "Yolande B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "My husband and I went here last night for date night and it was amazing! Everything was spot on and full of flavor . We ordered several dishes so we could try as much as possible . The service was great and everyone was super friendly and happy to answer all questions and give thorough descriptions of each dish . I highly recommend this place. Great vibe and music to accompany your meal.", "author": "Leah W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-03", "description": "Usually I don't write reviews of bad restaurants because everybody's got to live and it's a hard life in nyc. If it's not for me, I just move on, no need to waste everyone's time. \n\nUnfortunately, this was one of the worst restaurants I've ever eaten in. Basically steak covered in bbq sauce, and even though it was a skirt steak (perhaps the most modest of cuts above stew meat) there was not enough of it. \n\nWorst of all, they must have recently paid a visit to Trader Joe's wine shop because I didn't think wine ever got this bad. In the last 20 years of living in nyc I'm not sure I've ever left a bottle on the table, but I literally couldn't take any more of it. \n\nWhile the service was not my style, the waiter was attentive. \n\nIf your one of the losers who recently moved to Brooklyn and live in one of those over priced dorm rooms that pass for apartments now, this will be a new favorite of yours. They have orange wine!", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-17", "description": "Great wine, great atmosphere, great food and great service.  This place is run by the guys that actually own it and you can easily tell how much passion they have for what they do.  The menu is seasonal and constantly changing, and when it comes to the wine they REALLY know their stuff.\n\nI was there the other night when Yolande B came in and I watched her write that bogus review.  You can ignore it.  The only attitude was her own, as she sat at the bar with a sour look on her face and her headphones on.  Give us a break lady!\n\nAlso, anyone who claims the wine selection is anything other than top notch, clearly doesn't know anything about good wine.  Like the food, the wine selection is constantly changing and these guys are sommeliers, though I doubt that reviewers like Rachel S. or John S. even know what a sommelier is, hahaha...\n\nAs the other reviews say, Fradei is very cozy, so to all the haters out there- please don't go back so that there is more room for those of us that know and love a good thing when we experience it!", "author": "Bleecker W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "This meal was absolutely phenomenal, you should go. \n\nMy boyfriend passes this place every weekday and noticed that the atmosphere was lovely and everyone was having a good time, so we decided to check it out when we got hungry a little early on Saturday night. We showed up at 6:45 and luckily were seated right away because there was one open 2-top table left (it's a no-reservation place, and just a few tables). Several parties who arrived after us had to wait or sit at the bar before a table opened up; keep that in mind with planning, unless you're happy to wait a while.\n\nOur waiter was so great, and recommended a wine based on our tastes that was quite delicious. Because their menu changes often, I'm not going to go into the specific dishes but every dish we had was so unbelievably good. The pasta was lovely and delicate, everything came out perfectly seasoned. Each bite was absolutely worth savoring, and it was served in the perfect amount - I usually have leftovers when going out to eat, but here we returned all our plates completely clean.\n\nOur tiramisu was also delicious, the cream was fresh and rich, the espresso not too bitter, the whole dish not too sweet.\n\nBecause it was difficult to find prices online before coming to Fradei, I think it's helpful to know that with our two glasses of white wine, a shared appetizer, two reasonable entrees, and a shared dessert, our meal was ~$100 before tip.\n\nCheck this place out soon, I can imagine it becoming so popular that it's impossible to get a table!", "author": "Amy A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-28", "description": "Food is excellent, but very small portions. Service is snooty if you aren't a millennial.", "author": "Satah J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-19", "description": "After reading some of the reviews, I was so excited to try this bistro. I can't believe they can charge $26 for a small Octopus tentacle. this dish should cost $13 max. We couldn't get a wine list because the servers are the wine list. Cute but I still need to see my choices. My date and I were so hungry, we decided on dessert. Sorry 3 scoops of Mascarpone cheese sprinkled with Matcha powder does not make a Matcha cheesecake. I have eaten in some of the best restaurants in the city, Daniel, Le Bernadin and many more. Don't waste your time unless you prefer a tapas size meal.", "author": "Luc B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "Wonderful charming intimate place!\nGreat for couples, family and groups of people, but especially for who want to eat delicious, elevate and well presented food! \nAlso the wine selection is magnificent!!\nSUPER SUGGESTED!!!", "author": "Luana Panissidi F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-18", "description": "Food is good but minuscule portions   Trying to be high end in what is a cafe. Much smaller portions than jean George but same price. They need to add a protein course fish or beef so you don't leave hungry. Olmstead and Oxalis and Locanda Vini \u0026 oili make the grade in this area for this price range.. also they do this thing where there's no wine list and they say we're the wine list. It doesn't work. Consumer affairs wants prices of every item listed so they can't charge me one price and you another.", "author": "Kool M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "Amazing wine selection and food. Textures and flavors are so well balanced. This spot is the ideal blend of a casual space with superb food. Can't wait to come back. Simone and his team know what's up.", "author": "Gabby S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "We just happened to drive by this place on our way to smorgasburg and it looked so cute we stopped on our way back. It was sooooo good and the service was incredible. All of the pasta was homemade and the recommendations from the staff were impeccable. I cannot wait to come back as they told us the menu changes frequently.\n\nAlso, brunch menu looks YUMMY!", "author": "Amy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-03", "description": "Remarkably unresolved menu and wine list. The food was mediocre and confusing. The wine left much to be desired. The atmosphere was perhaps the worst. Listening to Nsync and the Hanson Brothers over an overpriced meal is near offensive.", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-14", "description": "My favorite neighborhood spot. The owners are goofballs and will make you feel like you're sitting down to dinner with your big Italian family. And the food is great and affordable!", "author": "Kate W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "What a pleasant surprise it was to randomly walk into FRADEI last night. The food, wine, and ambience was amazing.", "author": "Daniel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "Great neighborhood spot for delicious Italian food and great wine. Recommend ordering wine by the glass and letting the servers bring you something new based on your tastes. The portions are not so large that you leave stuffed (which is a nice change for Italian food), but an app and entree will leave you full. Cannot wait to make this a regular spot in our neighborhood.", "author": "Paul O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "LOVE this restaurant!  One of our favorite neighborhood spots.  The focaccia is amazing - they are always changing the flavors - and the pastas are so delicious!  The menu is small and changes frequently, and the waiters are super nice (and wine pours are generous)!", "author": "Kristen H."}], "servesCuisine": "Italian", "priceRange": null, "name": "Fradei Italian Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "99 South Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/HAM39ccBqCgFARH-eUYn0g/ls.jpg", "@type": "Restaurant", "telephone": ""}