{"aggregateRating": {"reviewCount": 29, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "Delicious food and good service. It's cool that the chef checks in. Every now and again.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-11", "description": "Fantastic. Beautiful food, and a very charming, welcoming atmosphere. Try everything on the menu (ordering everything and sharing among 3-4 people is perfect), and make sure to pick the guys' brains on wine....that's when the fun starts. It feels like a hidden gem and would be perfect to impress a date.", "author": "James P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "Amazing food, great selection of wines and wonderful hospitality. Atmosphere was cozy , the owners are very personal and attentive. Went to FRADEI with several friends last night and tried many things on the menu. \nMust try the oxtail cannelloni , baby squid dashi, ravioli filled with Amatriciana sauce and the whole lamb shank. The lamb fell right off the bone and was so tender. There is so much flavor in all the dishes we tried. They explained every plate in detail and many of the dishes were simmered for hours. We had two desserts- the tiramisu served in a glass and matcha cheesecake.  Actually three, we got another serving of tiramisu to share. Best tiramisu we've ever eaten.   We will definitely be back to try the rest of the menu!", "author": "Eunyung K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "Brand new small Italian place where everything made with love! Perfect to have a nice dinner before/after BAM.", "author": "Irina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-30", "description": "My wife and I met a couple friends here for dinner and it was hands down one of the best meals I've had in my life. The atmosphere was warm and inviting as was the hospitality. We started with some taglieri di salumi freshly cut right in front of us, then we all shared a few main courses from the menu. The beet salad was fantastic and I don't even usually like beets. The Amatriciana was the most flavorful dish I've ever experienced. The papardelle was light and fresh. The lamb shank was incredibly tender. I would definitely recommend sharing multiple dishes so you can sample as much as possible. Simone was very friendly and helpful in all of his wine suggestions, which was nice because there was a variety to choose from. He also went into great detail about all the menu items, definitely passionate about what he does. I'm very excited to go back and see how the rotating menu changes over time. This is definitely our new favorite spot!", "author": "Matt V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "What a cozy \"fetta\" of Italy. Small but very eclectic menu that changes bi-weekly. Very interesting, very different daily bread offerings. Charming hosts, great music offerings with a Euro flair.", "author": "R W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "This place is amazing! It's so charming and the perfect date spot, and the food is fantastic. It only seats about 24 so it's super intimate, and I'd recommend sitting at the bar. The cute owner, Simoné, bartends and recommends which wines to order (they say \"we are the wine list\" and all of the wines are organic and sulfite-free). He also occasionally offers shots of a delicious, aromatic spirit made by the guys from Noma in Copenhagen. The food was fantastic. All played beautifully and just delicious. It's impressive that the one chef cooks it all up in the small kitchen. They make the pasta fresh every day. We had the fettuccine with mushrooms and black garlic and the cannelone with oxtail - both unbelievably good, and perfect portion sizes. The deconstructed tiramisu for dessert is a must, too. I can't wait to go back. The perfect neighborhood spot, but even better than I was expecting.", "author": "Sybil P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-14", "description": "Excellent food, excellent service, warm, welcoming atmosphere. Great neighborhood restaurant.  Highly recommend!", "author": "Roseann P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-24", "description": "Ate at Fradei tonight and could not be more thrilled that this wonderful restaurant has opened in our neighborhood. It is evident that careful attention went into planning every detail. The atmosphere is inviting and warm, a very pretty space. The service was absolutely lovely - Simone, one of the owners, could not have been more welcoming or attentive. The pasta dish we had was honestly one of the best I have EVER eaten and I come from an Italian family that makes their own. The fish of the day was also incredible, an inspired mix of interesting flavors, without being the least bit fussy. And the light and infused tiramisu dessert rounded out a perfect meal. Fradei is my new favorite restaurant!", "author": "Elaine L."}], "servesCuisine": "Italian", "priceRange": null, "name": "Fradei Italian Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "99 South Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/HAM39ccBqCgFARH-eUYn0g/ls.jpg", "@type": "Restaurant", "telephone": ""}