{"aggregateRating": {"reviewCount": 5, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "I came here to buy lunch and I liked the prices. I got rice, pasta, and chicken for 8.50. \n\nIt was super filling since they serve big portions. It's a small place so I would find it comfortable to sit during rush hours but I would def come back.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-04", "description": "I'm still not entirely sure who Mr. Fulton is, but whatever he's serving is almost always a welcome sight whenever I'm in this part of downtown BK. Is it the healthiest fare ever? Not at all. But is it cheap, filling, and occasionally delicious? Definitely.\n\nMr. Fulton has the block's lunch crowd on lock. I've waited in line for a plate and the aroma of the food nearly permeates the entire block. The comfort food options are vast with nearly everything that could be considered heavy, food coma inducing, and just *a tad* too greasy. The prices will range by container from $3-9. \n\nThe mac and cheese is one of their mainstays, as is their fried chicken. Everything else seems like it simply depends on the day. One day there could be meat loaf and another day it's jerk chicken and vegetable rice. Everything is a random combo / hodgepodge at the end of the day and the guys working here really know how to stuff a bowl to the brim. Even $5 will get one a hearty meal here.\n\nI'm not sure if they take credit card but cash is always easier in places like this. The line moves quickly during peak times and for those who hate lines, come during their off hours (3-5pm especially!). They tend to close in the early evening or whenever the food runs out.", "author": "Jando S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "This is a pleasant local spot popular amongst local workers with a decent selection of good lunch options. You can choose 1 item for $5, 2 for $7, or 3 for $8.50. They have everything from macaroni and cheese to lo mein so it's hard to not find something quick and carb-jolly. If you're feeling healthy, there's also a salad bar. The food itself is average, and on par with the quality one might expect from a buffet.", "author": "Rob C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "The food in Mr. Fulton was really good. No heavily salted and seasoned. The fish was fresh as well", "author": "T G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "If Mr. Fulton is a real person, I'd like to shake his hand! This place serves a variety of hot food at very reasonable prices. The food itself is cooked well and there are enough different options to keep things interesting. I appreciate the vegetable options. Whereas a lot of the buffet or take-out style food joints just mail in the veggies by heating up a frozen bag of whatever and calling it a day, I can say with confidence that Mr. Fulton at least takes the time to season and flavor theirs. The guys behind the counter keep things moving and serve you quickly which counts for a lot. The only downside is that the whole place seats maybe 8 people and you're sitting on these itty-bitty stools at a counter that's maybe 10 inches deep. So it's really for take-out. I will really miss this place since my office is moving to Manhattan. Maybe Mr. Fulton will open up a new location near City Hall? I can only hope!", "author": "AP H."}], "servesCuisine": "Soul Food", "priceRange": null, "name": "Mr. Fulton", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Lawrence St\nSte A", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9V6dYu2fM6nw6VJssKC4gA/ls.jpg", "@type": "Restaurant", "telephone": ""}