{"aggregateRating": {"reviewCount": 58, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "This is one of my favorite spots after just two visits. People might say the pizza is nothing special but there's the rub: it is the epitome of a nice doughy no frills pizza. Not something with various spices or what not in the crust, no just the absolute perfection of the basic pie. Picasso would recognize the greatness therein were the master still with us.\n\nWill continue to come back, continue to have pizza, continue to love life. Really as good an option as Antika or Lucali just on a different axis.", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-23", "description": "This place really has gone downhill. I've been coming here for almost twenty years, basically everyday after High School we would come here for a slice before getting on the train. The sesame on the crust was the huge attraction, but all good things come to an end. I've came here a handful of times over the last five years, and each time I've been less and less impressed. \n\nThe pizza itself was very blah, the ambiance is definitely very blah, and the prices don't fit the quality. I had a slice, three garlic knots and a Stella-- $9 bucks. If the pizza was good, I wouldn't have had an issue, but it wasn't. The small space where you have to hug the counter so someone can get by is annoying as well. It's been a nice run since 98' but I think my Caruso days are over.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-26", "description": "Not bad but not great pizza either. Honestly I could do with a 2 Bros here instead if we are talking cheap, mediocre slices but who's to complain when this joint is like right above the subway?!\n\nSlices run $2.50/cheese or $3.50ish/special. They accept credit cards so that's awesome.", "author": "Connie H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-30", "description": "Ugh terrible cheese slice. What's with sesame seeds in the crust?! It throws off the whole flavor.", "author": "Rachel T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-03", "description": "$2.50 for an incredibly bland plain slice. Very unimpressive, especially for the area.", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "Pizza is a way of life in Brooklyn. So maybe that's why I sometimes find it borderline insulting that in the Smith/Court area, our options for slices are limited. Don't get me wrong, I love the Lucali's and Luzzo's of the world, but sometimes you just want one giant slice dripping with mozz. Off of Atlantic, there's only My Little Pizzeria, which sucks, and Caruso. I'm not even going to consider Dominoes legitimate pizza.\n\nCaruso is a no-frills joint that looks and feels like Brooklyn. There's some seating inside, but in the summer with the ovens running, it's much too hot. They have some interesting slice options, but probably best to stick with what you know.\n\nI got a mushroom slice and a Sicilian. I don't know how they did it, but the crust on the mushroom slice was really puffy, and absolutely delicious. They didn't skimp on the mushrooms either. The Sicilian was good too, with a nice crisp and heft to it. I paid $6.50 for two slices. Best deal you'll find in the area.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-18", "description": "it tasted like a gigantic bagel bite, hot from the microwave - not the oven. for $8 you can get two standard slices and a beer. at first i thought this was a good deal. taking 5 seconds to think about it, it's not, considering the quality of the pizza and how much a corona costs.", "author": "Myles C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Carusos has been a staple in the neighborhood for decades. They survived the worst of times in the neighborhood, before the \"reformatting\" of the neighborhood began. They stood toe to toe with Dominos Pizza when they opened shop on the adjacent corner in the early 90's. They have always delivered on time and their pizza is great by my standards. \n\nIt is pretty apparent that the low ranking newbies in the neighborhood that never had it so good, and do not understand the scope of what tradition in this neighborhood is. In this day and age where common necessities such as grocery stores and mom and pop restaurants try to thrive with the times and do not sell out to developers who just want to turn the neighborhood into an overpriced hostel, there are some gems that still remain in the neighborhood that give us variety while sticking to the strengths of community. Carusos is one of them\n\nJust recently they redid the facade to the store to place outdoor seating, it was different at first, but Carusos is not afraid to evolve. The staff has always been friendly. I can only recall one error that was made on an order within the 20 years i have been eating food in their establishment, and not only did they fix the order, but threw in a free pie as well. \n\nIMO its better to have real customer service from a founded establishment than overpriced meals with subtle empathy. Carusos has never failed me, for those that have had bad experiences, understand that hipsters and the allergic reaction squads love to complain about sesame seeds , this is why we cant have nice things like we used to. Rent has gone up for the establishments since the reformatting of the neighborhood began, so it comes to no surprise as to why you'll spend up to $9 on a single meal. Times change, the economy changes, and when people get bored of this neighborhood again like they did in the early 2000's and move back to the city, Carusos will still be here. \n\nAppreciate what you have, Appreciate what has been here before you, And appreciate those who will never give up on a community that loves their pizzerias. Its very safe to walk anywhere from the neighborhood to grab a slice from here, dont like the place, try walking to the other pizzerias further away without feeling scared, walking through \"uncharted unknown\".", "author": "Sean D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-30", "description": "All I ask for in life is for the companies that I do business with to ensure quality of their products, services or in this case: food.\n\nApparently that is too much to ask for in 2017.\n\nI was unaware that it was possible to screw up pizza. Yet, my preconceptions have fooled me. \n\nI ordered two slices. One pepperoni and one bacon. The guy that heated the slices up burnt the bottom of each to the point that I now had two crisp slices of pizza.\n\nI was still eager to give it a shot. \n\nNope. I was unable to fold the slices in half because the pizza was so burnt. What sort of New Yorker doesn't fold their pizza in half?\n\nWhen I asked if they had any pizzas that weren't burnt, the two guys looked at the bottom and responded, \"Oh. Nope,\" as they looked at the bottoms of each individual pie. \n\nThey asked if I wanted to try a different one. Yeah! That sounds like a good solution. Psh. Get out of here. Give me my money back so I can eat the paper. Would probably be better than pizza from this joint anyway.\n\nOh. Not to mention, these slices are overpriced.\n\n2 stars for the effort.", "author": "Brendan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "DELIVERY: I ordered delivery from the Seamless app. I just ordered a basic pepperoni pizza. Delivery was on time with what the app said. About 50 minutes. No issues with that. The delivery man did his job and left. The pizza was good...not great. I didn't eat the crust because it was hard. It definitely wasn't pizza I went crazy for. I'll probably try another place before coming back.", "author": "Chelsea D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-01", "description": "Rolling through the hood looking for a reasonably healthy grab-and-go post-workout meal, when I see the sandwich board out front advertising a \"new\" arugula salad.  I go in and order one with chicken.  After many minutes of waiting, I ask whether the salad's been started--mind you, no one else in the restaurant at the time--and am told yes.  A few minutes later, I see someone walk in with a new box of arugula.  What the heck?!  Don't advertise it if you're not prepared to make it. That's what I get for not ordering pizza I guess.", "author": "Natalie J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "When I was younger this place was ran a lot mother fucking better. I made an order they charged me 15$ for not only the wrong address but they gave me an attitude, hung up on me and then they gave me the wrong pizza. Oh and the pizza is practically upside down.", "author": "Melina E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-20", "description": "I found this place just walking to the subway from the Brooklyn Strategist. It's small, decent lighting and decent pizza. My problem with it is that it's $2.50 for a slice that is it is just like a slice from 2 Bros Pizza with less sauce. Don't get me wrong, it's not terrible pizza, it's just worth $2.50.", "author": "Victor D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-20", "description": "I use to avoid this place because for years they'd burn the bottom of the pizza to the point where you could brush the ash off it. For that I never understood why people would eat here. \n\nOnce they changed that I'd come occasionally. Until: \n\nI recently visited with my brother. We ordered a few slices and were on our way. When we opened the box a ROACH ran out off the hot pizza for dear life. We were VERY upset and went back. The manager spoken to absolutely refused to believe what was said was true and insisted that we lied. Asking to switch out for new pizza off the bat instead of a refund is a bit forgiving, don't you think? At least we still got our money back but ugh. Disgusting.", "author": "Dinah D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Yes, there is better brick oven pizza in the neighborhood.    But it can get pricey!   If you need a bunch of pies to feed the family, the kids, and their friends - this is the place to order from!    We live in area, so this review is for delivery only.   We used to always order from Sal's, but the quality of their pies has gone down.    I just pray that the rents don't get too high and they have to shut down.   Where else am I going to order a large pepperoni pizza with sesame seed crust for $18?????   It's solid, tasty, Brooklyn Pizza!", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "I just killed a cockroach in here while eating two very bland slices of pizza. Enough said...", "author": "Jonathan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-05", "description": "[For the purposes of this review, I'm going to claim that] There are two types of pizzerias.\n\n1. Gourmet. Be it thin crust, Neapolitan, whatever, these places are more expensive and usually only sell full pies. This is because their ingredients are fresh, and pies must be made to order (to sell by the slice would compromise the quality of the crust).\n\n2. Slice joints. They are everywhere in the city, and they range from godawful $1 slice spots to actually quality places that give NYC its reputation for pizza.\n\nCaruso is certainly not gourmet, and it falls somewhere in the middle of the spectrum for slice joints. I've never had anything other than a regular slice (or one where the pepperoni has been tossed on as an afterthought) and I probably never will. \n\nIn fact, I often tell myself that I shouldn't eat pizza unless it's from one of the nearby gems (Sottocasa, Lucali, hopefully Krescendo). But every thrice in a while I drink too much at one the bars on Smith St., and Caruso is right there. Waiting.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-17", "description": "Only reason I give them one star I HAD to give them something... otherwise it would be a zero for service a zero for food and a zero for customer service after the problems. Pizza soggy and smashed in the box when it was finally delivered an hour late. Cold and limp,watery...would not recommend for somewhere and get REAL NY PIZZA", "author": "Grammy B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-21", "description": "If you're looking for a quick, cheap, but mediorce quality bite of pizza, Caruso's for you.\n\nCaruso's is your ordinary NYC corner pizzeria. Absolutely nothing special. Their crust was pretty good, but no where near the best. Their sauce was disgusting, and their cheese was spread into thick chunks.Their service was fast, but they weren't that nice, nor did they come and ask us if our meal was ok. The  seating was absolutely disgusting. The underside of the chairs/booths and tables were oozing with gum. I suspect next time the health inspectors come around they won't be getting an A. The sole reason I've gone multiple times is because I live right next to it.", "author": "Ava R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Very good pizza,I especially like the sesame seeds on the crust. They also have different varieties a pizza and I love those zeppoles.", "author": "Joyce B."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Caruso Pizzeria \u0026  Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "150 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/11LtwHrWyBbQzCn19pqZYw/ls.jpg", "@type": "Restaurant", "telephone": "+17187972300"}