{"aggregateRating": {"reviewCount": 58, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "People are very picky about their pizza, and I am too actually so I get it. Is this my all time favorite, if I could have any pizza in the world before I die, pizza spot...no. \n\nBUT, it's good and they have a thick crust option with bacon which is just heaven when I'm starving and don't want to cook, to be honest! And what's better, in my opinion, is the guys that work here are great! They are always super friendly and quick and when I see them outside the shop around the neighborhood they couldn't be any nicer. So yes, part of me just wants to give them business because they remember customers and take the time to say hi, not just \"what'll it be\". \n\nSo that wins out for me!!", "author": "London J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "Before an Oscars party at a friend's house around the corner, I came in here and got a square margherita slice AND something else with a cream sauce base. It wasn't crowded, so I was annoyed at how long it took to reheat the stuff, and almost wanted to tell them to just give them to me at room temperature. There was nowhere really to wait, because the area by the counter was soon occupied by a woman with a wretched kid saying in Spanish, \"Da me.......\" Give me. Give me. I shuddered. I have nothing against the Spanish language or Spanish speakers, but there was something so horrible about just waiting and listening to the coarseness of her order while her brat twisted and whined at her side, obviously more desirous of a nutritious piece of fruit or a sandwich packed with fresh greens.\n\nI should speak for myself, though - both pieces of pizza had a sort of Pizza Huttish quality; crispy and oil-saturated at the same time. But actually, Pizza Hut is tastier. It was something my body didn't need anyway.\n\nOn my way out the door, because I couldn't stand the empty, depressing, narrow sitting area strewn with litter, a few skater inspired punks with graphic hoodies but no skateboards accosted me.\n\n\"Yo, yo, how much was that slice?\" \n\n\"Three fifty,\" I mumbled, as oily crumbs sprayed out from my mouth.\n\n\"What?! THREE fifty? FUUUCK. HELL no,\" they spat, and stalked off into the darkness. \n\nI was still eating the slices as I rang my friend's doorbell. She saw me on the video and said, \"How's the pizza, Jia???\" I didn't answer, but only gave puppy eyes to the monitor, then heard the buzzer.", "author": "Jia J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-21", "description": "Called to order a pizza and more than an hour later - no pizza.  When I called I was told it was not made yet and would be 20 minutes.   When I asked why I tersely was told it was busy and asked me if I still wanted to order.  The answer: NO", "author": "Erich B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "Stopped for a quick slice after visiting my friends before heading back to Manhattan. Good slice. Over priced 20 ounce soda. The variety available when entering is impressive. I will stop here again when around and in need of a bite to eat.", "author": "Brian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-30", "description": "Okay, I'll admit that their regular pies aren't anything special. And the garlic knots are...questionable. Like little buttery rocks. And the fries (yes, we ordered fries) are oversalted and totally forgettable.\n\nBut the stuffed pizza is awesome. Tasty and filling and a ton of food for not much money. Even my pizza snob friend was impressed, which pretty much never happens.\n\nDelivery is fast and the guys are really friendly. It's not the be-all, end-all of pizza but it's really satisfying when you're really hungry.", "author": "Abigail S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-07", "description": "One of the worst pies I've ever had. I picked it up, shelled out $13, and gave the rest to my guy's roommates. Doughy, lumpy crust, poor cheese distribution, and the sauce lacked any tang.  Anyway, we've since broken up. Bad pizza has a way of souring a budding romance. \n\nOn a side note, my walk down Smith was uneventful. My walk back up with pizza in hand was replete with whistles and cat calls. Holla at your pizza girl!", "author": "Lindsay K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-09", "description": "Great neighborhood pizza-- I almost always opt for a white slice, but the sicilian and veggie slices are pretty good as well. My ideal cheap, greasy, fat-laden lunch would be a slice of white and two pepperoni knots. Mm. \n\nThe counterstaff kind of rules too; whenever I see any of them on the street they wave and nod. Even when I went through my three month stint of, \"OMG eating pizza twice a week is giving me zits\" and I avoided them, they'd still say hi to me, should I pass them on my way to Starbucks or Rite Aid. \n\nPS I'm over the zit thing.\n\nPPS OMG eating pizza twice a week is gonna make me fat.", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-09", "description": "Everyone complains about the pizza not being good. It's Pizza! When has pizza ever floored you? This pizza isn't bad. The thing that keeps me coming back is the consistency of it. I've been to a lot of different places and the pizza here is better than others and the taste is always the same.\n\nI would say the only downfall to this place is it doesn't stay open late enough on the weekends. Nothing like grabbing a slice after a couple of drinks at the boat.", "author": "Zoran Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-27", "description": "My thin-crust slice had a nice, slightly cracklÿ sesame crust, but an uninspired tomato sauce and barely detectable pesto. Also, it was the single smallest slice I've ever had in this city or its boroughs. The stuffed pizza looked good, but I'll never know how it tastes, because I won't be going back.", "author": "Karen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-03", "description": "Ehh. Not my favorite, but a solid local joint in Cobble Hill, Brooklyn. They don't seem to be very responsive to the customers and their food is not as good as others have mentioned. I'll go back for a slice if I'm desperate but it ain't nearly the best in the neighborhood.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-03", "description": "This is 2.5 stars. Not great. But not bad either. I live a block away but will walk to places on Court St. If I really want pizza. This is more of a default spot since it's so close. It only wins by proximity. Its expensive for what it is.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-18", "description": "This pizza has no taste at all and very greasy! The rolls are horrible as well and the workers are not friendly!  I can't believe some of you wrote that this place is good! This is what Brooklyn pizza is becoming and that's sad!!!", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "I'm get a little depressed living in brooklyn and having zero go-to pizza joints near the apartment, but for a slice, I kind of like this place.  There's nothing remarkable about the pizza here but their square slices - which are more reminiscent of the slices in Italy than NYC pizza - are really pretty good.  Not talking about the \"Sicilian\" slices - but the thinner square slices, some of which have good toppings.  There are some good full pie places in the neighborhood now that are a little more gourmet and generally pretty good, but for a few slices, I might prefer this place to nearby Pronto and I definitely prefer it over My Little.", "author": "David W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-04", "description": "Average pizza. Small slices for the price. Friendly and quick service.  Am looking forward to the new pizza place that is slated to open a few blocks down on Smith St.", "author": "Mary W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-06", "description": "Came here with my 4 year old daughter for a quick slice after a movie and boy was it loud in there a group of tweens with no food on theyre plates were singing and rapping so loud that my daughter told me she wanted to leave cause she was scared.\nThis went on for 15mins before we decided to leave.\nWho knows how much longer that went on for after.\nThe food and prices are decent but customer care was lacking on a large scale.", "author": "Clay W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-29", "description": "Skip it. How hard is it to mess up a cheese slice? I don't know, it's dough, sauce and mozarella, but Carusos is horrible. $2.5 for a slice of cheese and while the sesame seeds are a nice touch the pizza tastes like gasoline. I don't know about you but I am not a fan of the flavor. Instead of this place, go one block east and south to Mario's, it's the best $1 slice I've had. If you are going to eat cheap pizza, it may as well taste ok.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-12", "description": "Good neighborhood pizza. I pass up a slightly closer My Little Pizzeria to come to Caruso's. They have good meatball parm sandwiches, too.", "author": "Albie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-27", "description": "Good pizza, service is a bit cold.  the Sicilian slice is good.  The pizza tastes good, an OK place in my book.", "author": "Carlos C."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Caruso Pizzeria \u0026  Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "150 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/11LtwHrWyBbQzCn19pqZYw/ls.jpg", "@type": "Restaurant", "telephone": "+17187972300"}