{"aggregateRating": {"reviewCount": 58, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "Honestly, I stopped by for a place to sit and to use the restroom.  But I ended up having one of the best pizza I've ever had.  I got a Sicilian slice, and it was simply delicious.  The pesto(?) on top was great, I even licked my plate clean of the tomato sauce...", "author": "Kelly S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-26", "description": "Stay away from this place. While eating pizza I saw one cockroach running across the floor and another one crawling on a table next to me.\nNo way this place could've gotten \"A\" on their last health inspection.\nPizza was very average.", "author": "M R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "Loved their pizza with fresh mozzarella and basil oil. Tasted like it was made with lots of care and love.  Perfect quick and cheap bite after walking up and down Smith St.", "author": "Luna G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-23", "description": "You are passing by on Smith St.? Yes!\nYou live in the delivery vicinity? Yes!\nYou're looking for a destination sit down establishment that sells pizza? No! \n\nNeighborhood pizza shop. The pizza won't blow you away, but you'll be happy if craving a slice and they serve a few basic pasta dishes for inexpensive prices.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "I find myself in this neighborhood a lot because there are a lot of shops I frequent as well as a coffee place that I enjoy doing work at. \nOne day after a long session of grading papers and a numb mind and empty stomach I found myself longing for a slice of pizza. Luckily I was only a few doors down from Carusos. I walked in to what looked like a typical pizza place. All of the pizza looked appealing enough. What caught my eye was the grandma slice with a touch of pesto. I cant say no to pesto. Overall, I really enjoyed this slice of pizza especially because of the pesto. The sauce on the pizza is OK but the crust and the pesto elevate it to another level. I have been back several times since and always order the grandma slice. I cannot speak on behalf of any of the other slices because I am pretty smitten with this one.", "author": "Nicolle B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-23", "description": "Be weary of their cleaniness.....same guy handles your food and money without washing/cleaning his hands. \n\nNot to sure but last time I heard, money is one of the most dirtiest objects.", "author": "Ken L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-16", "description": "My neighborhood pizza joint.\nI think their basic slice is the way to go. What makes them unique is the sesame seeds they roll the dough in - nice touch.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "Love this place. Classic New York slices. Their grandma pie is the closest I've found to my own grandma's. Doughy but with a nice crispy crust. Crushed tomatos. Small amount of fresh mozzarella. Drizzled with a some pesto oil. I add a little parmesan, which is also fresh and kept in the fridge. So good! I also like their Sicilian and regular slices, but their \"grandma\" is just perfect.\n\nLots of clueless reviews here, unfortunately. I'm Italian, and I grew up on homemade pizza. I also lived for years on Wooster Street in New Haven, between Pepe's and Sally's, so I think I know my pizza. I certainly wouldn't compare Caruso's to those establishments, but it's great for what it is. Definitely the best around.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-02", "description": "I Just ordered my food from them today and it was terrible. I first ordered my food on the phone so i can pick it up and head back to work.  They told me over the phone my food was $10.00 bucks when online its 8 dollars. Anyways, i went there to pick up my broccoli, oil, garlic and penne and there was barely any food! Literally No broccoli and no penne just a whole lot of oil and some bread. I told them I am not paying for this and the Spanish men looked confused and didn't know what to do.I don't think they understand English very well, but  I told them there isn't anything in here especially for $10.00. Then the owner told me he over charged my credit card and gave me $2.00 backs since I complained .  Honestly it was not the money I wanted it was better customer service and better food. The food was disgusting and had no taste. Usually it would have a lot of flavor and taste but it was gross.  I paid my 8 bucks  and left because I did not want to argue over $8 bucks. They also made me wait a while to get my food ( I assume because they had to put all those seasoning inside my food to make it more bland)... I am mortified at their customer service and lack of care and the taste of food. The place is disgusting and and whole in the wall that has a roach problems.", "author": "Dana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-03", "description": "Ahhh caruso's what can I say? Get your pizza here(yea skip domino's which is 2 stores away) lol love the sesame crust pizza a little something you don't see often anymore. The pizza is good and consistent. And a nice touch is the \"real\" Italian owner that occasionally has his son learning the ropes behind the counter. Too many kids these days have no appreciation for what there parents have done to raise them. Nice to see teachings from one generation to the next", "author": "Evan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "I am really surprised that this place doesn't have a higher rating.  Frankly I'd expected to see a 4 or 4.5  Best neighborhood pizza place within at least a mile.  Really good plain, fresh mozzarella, and grandma slices (and the sesame seed crust is great).  Definitely the place to go if you are thinking pizza.", "author": "Benjamin D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-19", "description": "A very small pizzeria that can hold around 30 people max.  \n\nFood\n1) Pizza - It isn't the best, but it's also not the worst. \n2) Garlic Bread - Overly crispy/baked and a little bland.\n\nService:\nI came here with 20+ people and the staff were very accommodating and friendly.\n\nOverall:\nIt's a good pizzeria if you're in the area, but not worth going out of the way for.  The service here is excellent.", "author": "James B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-23", "description": "It's a typical corner pizza joint, serving slices from pre-made pies as well as custom delivery/takeout.  Two things I thought were different from many other typical places:\n\n1.  More meat topped options... my choice was generously smothered in chopped bacon.  There were several other protein-topped offerings in the pre-made racks.\n\n2.  They have a variety of crusts, but their signature pies are pretty thick.  That said, they were only thick in volume.  The dough is firm on the bottom but the rest is pillowly/light.  \n\nOverall, pretty good for a quick bite.  Not a pizza mecca or worth a pilgrimage, but also a bit different than many average places.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-01", "description": "Smith\nDeserves\nBetter slice\nJoints but few and\nFar between. Eat here when broke and hangry.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "A good basic slice.\n\nThe seeds on the crust are really nice.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-01", "description": "Last night was the first time I ever ate from Caruso.  I'm glad I made the choice - I ordered their spaghetti carbonara.  My food was delivered under the estimated time, and the meal was wonderful - tasty and enough so that I can eat the rest for today's lunch.  \n\nSurprisingly, the standout was the bread (you know the little chunk they throw in with your order when you get pasta?).  Crispy on the outside, velvety on the inside - I was shocked a sidenote would be so good.  I had to stop myself from finishing the half loaf so my boyfriend (a cook) could taste it too.\n\nI can't speak to the pizza, but I recommend their pasta.  I will definitely be ordering from Caruso again.", "author": "Marcie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "I live right  across the street for this place and I am so happy I do!  I order the Grandma Pizza or a Pepperoni with mushroom, onion and extra cheese. I always tell them that I want the sesame crust. If you don't tell them, then they won't do it.  The sesame on the crust kind of makes the pizza too.", "author": "M K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "I have been here a couple of times and it has been great. i usually come here with friends and family to get the pie, and i wait a bit while me and my friends are waiting at the tables and there food are really good i have to admit but the prices are high only if they nerf the prices then i would've gave it a 5 stars.", "author": "John F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "Caruso's is the best neighborhood pizza joint in cobble hill!  It's been around for as long as I've lived here and has never gone without satisfying.  The old timer staff is super friendly and love chatting.\n\nSimple, cheap pizza.", "author": "George S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "Good pizza. The sesame seed crust is nice, but it's definitely terrible for delivery. Don't order unless you're okay with waiting 1hr+.", "author": "Sven T."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Caruso Pizzeria \u0026  Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "150 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/11LtwHrWyBbQzCn19pqZYw/ls.jpg", "@type": "Restaurant", "telephone": "+17187972300"}