{"aggregateRating": {"reviewCount": 186, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "This place is consistently good. Well priced, the portions are big, the food is really good. The service isn't always perfect, but nothing's perfect when you're dining in BK Heights. This place would probably get a 4 star from me anywhere else, but I gotta support one of the few really solid places in the hood.", "author": "Chris K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "This place is great. Many times they get rare and delicious bottles of wine.  Definitely go here for a nice glass (or 3) of wine and the meat and cheese plate.  The bartenders are knowledgable about pairings and have no problem helping you choose. And if you love dessert, the Mr. Mud Pie is so good.", "author": "Elle C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-06", "description": "I am dining now. Ordered the lamb sirloin which took forever to arrive and when it did it was cold. When I told the waitress she was utterly disinterested and rude. Never again.", "author": "Leftie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "i just moved to Brooklyn Heights and went to the BHWB with some friends for a light dinner and some wine.  I was prepared for the small wine list, based on some Yelpers' reviews.  For a wine bar, they really don't have many options, either by the glass or the bottle.  But the atmosphere is very relaxed, with nice lighting, well-spaced tables, good service, and pretty good food.  I opted for the Calamari Pearl Pasta ($8 for the small plate, which was a good portion) and a glass of the house Sauvignon Blanc ($7).  It's a cute little neighborhood restaurant, and I would definitely go back.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-13", "description": "Beware the $10 well drinks! A good selection of wines from $7 and up, standard wine bar fare that smelled good, but I didn't try, and some fairly slow/snarky service.", "author": "Maddie O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-01", "description": "Awesome outdoor seating. Great selection of wines - that are reasonably priced. Really attentive service. Even though you sit outside, they check on you frequently.", "author": "Varun V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-27", "description": "I've never dined here, but Brooklyn Heights Wine Bar fits the bill for a low-key spot to imbibe in one of my favorite NYC neighborhoods.  They have a bit of outdoor seating, which is a nice option if you have a dog.", "author": "Micaela L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-24", "description": "I live in the neighborhood and have been here quite a few times and up til yesterday I would have given 4 stars. \n\nI arrived in between lunch and dinner when I know they shut down the kitchen for an hour or so and that was fine because I hadn't really planned on eating. I was just waiting for a friend for a drink. When I got there, there was a table of 6, two people at the bar and maybe 2 tables of 2 sitting outside. The 2 people inside w/ me left at the same time leaving just me and the table of 6. After about 10 minutes of sitting there I was finally able to order my drink. After another 10 - 15 minutes, I got my drink. A little bit after that my friend called to say she couldn't make it. I decided I was a little hungry and asked to see a menu as it was getting somewhat close to when the kitchen would open for dinner so I asked for a menu. I was reminded that the kitchen was closed but a cheese plate was available and then the waitress walked away. OK fine, I decided I would order the cheese plate and despite the fact that I had closed the menu, kept my hand on it to hopefully signify I wanted to order AND tried to get the waitress's attention, it simply never happened. It was almost as if I had a neon sign over my head saying IGNORE ME, I REALLY JUST CAME IN TO SIT ON YOUR BAR STOOL. \n\nAnyway, now I'm just annoyed and want to leave so I take out my wallet and managed to signify to the waitress I wanted my bill. After an eternity she brings it to me. Fortunately it took another eternity for her to come back to me because as it turned out, she charged me for the wrong glass of wine. By this time maybe 2 tables of 2 had come in BUT COME ON! \n\nIf the place was packed AND there weren't other people working there with her I might cut the place some slack but their complete and utter disdain for some of their patrons was sad and i can honestly say I'm not sure I'd go back after that.", "author": "Beth W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-06", "description": "Boyfriend and I wandered in here the other night.\nWe were starving and certain other places with delicious Italian food were too busy (and don't take reservations! urg!).\nAnyway, this was nearby and had food.\n\nEnded up being a nice surprise.\nThe wine selection was good (at least for us) and the food was a little all over the place, but really reasonably priced and interesting looking.\nTried a charcuterie plate which was good but nothing special.\nThe burger that the boyfriend tried, however, was delicious.\nI also tried the calamari with capers, pearl pasta and cranberries.\nSO GOOD!\nI ordered the small size, and it was the perfect amount.\nA few too many caper perhaps, but really good.\nThe only 'eh' part of the meal was dessert.\n\nWe ordered the trio of pot de creme.\nFlavor was great..texture..not so much.\n\n2 of 3 hadn't set correctly and they were more like soup.\nWasn't worth complaining about because they were rather small and still tasty. Next time, however, we'll be trying something else for dessert. Or asking for proper pot de creme if tasty soup arrives at our table!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-04", "description": "Awful 'service'. They're slow as hell, our drink definitely did not justify the prices and I had to ask ten times until I got my check. Wouldn't come here again!", "author": "Yannick F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-19", "description": "Can you say FOOOOOOD POISONING!  Say it with me!  FOOOOOOOD POISON-ING.  Yes, this place managed to poison myself and a friend.  I should have known better, oh why does hindsight have to be 20/20.  Came to this place after being told of a two hour wait at Jack the Horse Tavern.  Walking around we smelled this place, looked nice inside, and a decent crowd inside.  So in we walked.  I ordered a burger and a friend who was also poisoned ordered the pulled pork sandwich.  When I ordered the burger, the waitress didn't ask how I wanted my burger cooked (WARNING SIGN) and I also specially requested manchego cheese on my burger rather than the options they had.  As she walked away, realizing that I didn't get to request the doneness of my burger, I asked for it to be medium rare.  When I got home, I suddenly felt ill.  Five hours later watching the sun rise on the porcelain throne I was thorough dead inside.  I've never had that bad of a food poisoning incident since visiting China, this most definitely takes the number two spot of horrible dining experiences.\n\nAvoid this place at all costs if you value regular bowel movements.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "Walked in here with friends looking for a place to eat lunch. This one just so happens to have brunch. I ordered the Poached Eggs w/ Lobster which was AMAZING. Eggs were perfectly cooked and the lobster meat was nicely seasoned. My friend ordered the Country Quiche which tasted fantastic as well. The only dish that caught me a little off-guard was the Roast Chicken Panini which had a bitter taste like a Foie Gras. But overall, the food here is delicious and the rest of their menu looks to be as well. I will definitely be going back.", "author": "Henry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-07", "description": "My friend and I wandered in on a Sunday afternoon - we were looking to eat, but told the kitchen was closed. We sat at the bar and each had 2 glasses of wine, and olives, that were very tasty - ordering was a bit of a challenge though. The bartender was not friendly, or inviting, or informative.", "author": "alicia g."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-24", "description": "I hesitate to even give this less-than-positive review considering how few options there are in BkH to dine and drink out but....\n\nAlthough not crowded for a week night, the service was painfully slow. I was also surprised that, for a wine bar, how few wines were offered. Though the ambiance is cozy, the decor [tables, chairs etc] were cheap and seemed out of place as if stolen from a 24 hour diner in midtown. Don't go here to eat an entree dinner. No real stove in the kitchen means that your food gets cooked in a toaster with limited ingredients for an end result of nothing special. This holds particularly true for the salmon. The small plates are too small to justify the price tags.\n\nI realize that I'm following a lot of very positive reviews - so take this all with a grain of salt but my idea of awesome wine bars include Lela Bar and 'Ino [W Vill]. Maybe they should just change the name of the establishment.", "author": "S B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-01", "description": "Enjoyed the wine and atmosphere.  If you're hungry try the asian shrimp appetizer.", "author": "Candis G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-11", "description": "Popped in here for a few cocktails with a friend.  We didn't eat so can't comment on the food.  Nice bar and good high-tables to grab drinks.  Bartender was very attentive - though the place wasn't very crowded.  Cocktails range from $10-12 - just OK.  I sampled a few and wasn't really blown away by any.  Very nice wine selection (obviously) and although it's a wine bar they do have a beer menu which is a plus.  I might go back if I'm craving a nice glass of wine.  But I'm not running back....  Oh, one peeve - bartender asked if I wanted another drink and I said \"no thanks...\" - he immediately cashed us out.  My friend definitely wanted another drink and we probably would have stayed for something to eat had he not gotten us the check.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-22", "description": "I am confused about some of the reviews stating the food is great but the service isn't. I think they are both lacking! But although the service was slow, our server was very friendly.  But why we needed to wait so long when we were two of five people in the entire restaurant, I couldn't say. As for the person who thinks they serve the best burger, you really need to get our more. And I am discounting steakhouses, etc. Some of the best burgers I have eaten in NY have been at bars, and this particular burger was overcooked, dry, and looked a little like processed, pressed meat. I think if you just want a bar in a good location for a drink or two, it is fine, otherwise, you can skip this place.", "author": "Rosetta S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-20", "description": "The food and wine are fabulous, but the table service is truly abysmal. On a Monday night at 8:15, I had to wait for 15 minutes to get my first glass of wine, and we didn't get our food until 9:15--despite the restaurant being only half full (and practically empty when we came in). The waiter, who was rude, neglected to give me an itemized receipt at the end of the meal, and then coped an attitude when I asked him for it. \n\nI'm never going back there again.", "author": "Emily T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-02", "description": "Had a really unpleasant experience here. I was meeting up with some friends visiting from out of town and made the mistake of picking this cute wine bar for us to have dinner and drinks. The wine selection is good, a lil pricely,  but the cocktails (Airmail \u0026 some fig concoction) were not so good and took forever. Also they brought the wrong food for us twice. All of which is kinda forgivable. It's human. No big deal. But, they were like worst cliche of unwelcoming, impatient, condescending staff. And we were all ordering entrees and multiple drinks but it's like they resented that we were there. One example: I was mortified when my friend (all of 5'1 and from Virginia) approached the bar to ask about a drink and the pissy bartender made an elaborate effort to snap at her, while other patrons watched in horror. C'mon man! She's so little! It was like straight our of Oliver Twist.  Kinda ruined our night to be treated with such passive aggressive hostility. in the end, our waitress tried to redeem BHWB by being super sweet ...I think she felt bad at how poorly our group was treated, or she was trying to salvage her tip. Maybe if you're flying solo and want a nice glass of wine...but if they put crushed glass in it because they not-so-secretly hate their customers, don't say I didn't warn you.", "author": "Jacqueline s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "Awesome cubano sandwich and fries. Mmm..", "author": "Maria H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Brooklyn Heights Wine Bar \u0026 Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "50 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/1SEX9lzOMyH5qMKWJ-1kUg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555595"}