{"aggregateRating": {"reviewCount": 186, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "Sadly disappointed in this place! We went for a drink after walking across the bridge and felt a lack of respect for our time from the server who served only 3 of 4 drinks fairly quickly but took 20 mins to inform us that the 4th drink (a margarita) would be a while longer as they were short staffed. After 30 my friends finished their drinks and mine had still not arrived (had not even been started) so we cancelled the order, paid and I left disappointed and still thirsty.", "author": "Melissa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Great wine and food pairings! All of Mark's restaurants are delicious and I love coming here! Will be back again and again.", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-21", "description": "I came here on Thursday night with my running friends to pick up our Brooklyn Half Bib.  The exterior and interior of the restaurant looked nice so we gave it a shot.  The menu seemed fine but the service and the quality of the food was lacking.  \n\nService - it took a long time for the food to arrive. A couple that ordered AFTER our group had placed the ordered got their food first.  I think the reason for that is THERE'S ONLY ONE CHEF doing everything in the restaurant.  \n\nQuality of the Food - I ordered the pork tacos.  It wasn't that impressive but it wasn't bad either.  It's quite simply just not memorable.  \n\nThere's many other great restaurants in the Brooklyn Heights area - I'd go check those spots out versus this one.", "author": "Eric N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-06", "description": "How the mighty have fallen... This review is specific to the brunch service.  In general, avoid this place for brunch.  A brunch shift which was previously managed by one server adequately is not horribly mismanaged by 4 people.  After ordering drinks and being ignored, My party and I ended up going elsewhere for food.\n\nThis is so sad because this is a beloved neighborhood place.  Evening \u0026 weekday service is still strong, but if you're thinking brunch... Think again.  Try this bar out on a Friday night instead.", "author": "Eric H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "How is this place only 3.5 stars?  The wine selection is fantastic, great older wine by the glass, and the reserve bottles are really great values as well.  The food is solid and reasonably priced, but the wine is what really shines.", "author": "Craig G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "Food was ok service was exceptional. I came in for lunch, Rocco was my server and hospitality is his niche. Very communicative and knowledgeable of the menu, also a very nice guy.", "author": "Filmon B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-08", "description": "I will start with the conclusion: never going back. \n\nParty of 3. 2 of us had eggs ( poached and scrambled) with potatoes. One had burger ( asked for well done). The burger came out rare ... And we didn't want to wait for another .. That maybe the second time was okay..or maybe not. Eggs were ok but the potatoes were extremely greasy couldn't eat them. \nAsked for the check ( the burger was not charged) and it had 20% included gratuity. Really??? They don't deliver and have 20% gratuity. Really ??? I asked for the check without gratuity and the girl was very pissed off and said 'what seems to be the problem ' . I forgot to mention we had on us a dslr camera ...and I felt we were taken as stupid tourists ... Bad experience.. I can't understand how some businesses are this rude .", "author": "Simo I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "I hit this place on accident. We went to a show near this spot and I was hangry! The ambience is upscale casual. the wine selection was  good  we had a lot of options to choice from. The bartenders were extremely helpful and knowledgeable about the menu and the wines. If I am ever back in the area I would definitely go back. I recommend the angus burger!", "author": "Adrian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "Giving this place 5 stars because it has been consistently amazing over the 10 months I've been eating here. The cheese and wine selections are fantastic - make it a point to get a cheese plate with at least two cheeses! If you don't know cheese that well, just describe to them what you're in the mood for and they'll make the magic happen.\n\nAlso have to say that this wild board ragu gnocchi is INSANE. Wild boar doesn't sound particularly delicious to me, but it IS and this dish is perfectly cooked. So, so, so good. The mac and cheese is also a winner, as are the burgers.\n\nI do not love the brussels sprout salad, but it is not bad either. The brussels sprouts are raw and shredded and overall the dish is very bitter (not really my thing). If you're a big fan of roasted brussels sprouts and get excited when you see this on the menu, realize it will taste nothing like roasted brussels sprouts.\n\nLikewise, don't love the chocolate/walnut bread pudding. The actual bread pudding is a perfect consistency and taste, but think the chocolate kind of is too much. Creme brulee is where it's at.\n\nATMOSPHERE is on point and the service is amazing/very friendly. If you get there before 7 on a weekday, you can get a ridiculously good deal on house wines and select beers ($5).", "author": "Tara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-09", "description": "Went to the bar on a Saturday while walking around in Brooklyn. Found the location because it was near the Brooklyn Bridge. The place had a nice cocktail menu and our drinks were good, however, I would say for the location and space its not reaching their potential. I don't want to talk poorly about one of the staff there, but this one older gentleman made me feel a little uncomfortable. He didn't talk and was just kind of working there, but would just clear around your and serve around you without smiling or looking at you. I kind of just chalked it up to him being older. We only had one snack. The hot pretzel and mustard. It was pretty good, but it was 100% from frozen. I will say they bought good pretzels though. Overall value, I would say medium.", "author": "Andrew J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "We were walking around the area and saw this place. We were starving so we decided to stop in. The food was extremely good! It was our first time in the Brooklyn Heights area - which has a great vibe. Slowed down in comparison to Manhattan. \n\nWe ordered the Mac n Cheese, tomato salad, prosciutto wrapped dates, cheese, and pulled pork sandwich (without slaw). All of it was fantastic! We didn't order wine, but they seemed to have a good list. \n\nMy friends felt a 4 star rating is due because the bar tender/waitress/maybe owner(?) was on the phone a lot and seemed to be yelling at someone. Probably should be a 4.5. If I lived there, I'd go all the time.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-14", "description": "Yesterday's brunch (Saturday, August 13th) was 5 stars for food and service. Today's brunch (Sunday, August 14th) was 1 star for food and service.\n\nSaturday's food was delicious and the presentation was gourmet. The little bubbly dark-haired server went above and beyond to accommodate our party of 3, plus one small dog. Sitting outside, she moved us and the umbrella out of the sun and in to the shaded area under a large tree. We had such an incredible first experience at this restaurant, tipped our server 25%, and decided to go back for Sunday brunch. Wish we hadn't.\n\nSunday's food (though we all ordered the very same dishes) came out over-cooked, greasy, and one of the dishes contained a small dark hair wrapped around the homefries. The service was incredibly poor. The blond woman acted annoyed at our attempt to recreate the seating area with umbrella so we could again be out of the hot sun. Throughout our dining stay she was a borderline acceptable level of \"friendly.\" She did not come out to pour our water after the initial pour, and only twice peeked her head out after another gentleman dropped off our brunch selections. She never questioned why 2 of my parties meals were barely touched. I believe, she could have cared less. When it came time to pay we all gave between 12-18%, though felt that this was even too generous for the quality of food and level of service, and lack of attention received. After paying, the blond woman quickly flew out of the door and began to question angrily why we didn't leave a larger tip.\nI have never in my life been questioned in such a harassing manner from leaving an acceptable tip amount. At her age, she should know better than to use intimidating behavior on the clients she is serving.\n\nSuch a shame because we really loved this neighborhood spot.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Stopped in for a glass of wine and Rocco hooked us up!  Such a great atmosphere and amazing service.  Made us feel right at home and had great conversation!  Highly recommend stopping in on your vacation or if you live in the area, make it a place you visit often.", "author": "T S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "In desperation for wine a group of us found this little spot.\n\nEverything was fantastic. The Torre Rosazza Pinot was one of the best white wines any of has ever had. Amazing. \n\nAll the food was great too, perfect for a light lunch. The heirloom tomato salad is unbelievable. Brussels sprouts were different but fabulous. We all loved everything about this place... Will come back again!", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Great place to chill. The wines are a great value, atmosphere is perfect with all the big windows. The samples of toasts and the pates are great options for complimenting your wine buzz. \n\nI have some great memories of spending hours and hours here. \n\nNever had the brunch, but sounds like it's not so great from other reviews. This place is meant for long evenings with wine. The food is simple and good but not the main show.", "author": "B C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "Arrived with family (5 members total) on July 4th. The food was overall ok. The lobster brisket was the best, the shrimp pasta was good, panini sandwiches and burgers were dry and flavorless. The service was horrible. The server could not wait for my order  4/5 and had to leave and come back to take my order. Food took over 40 mins to get ready. They served the soup after almost finishing the burgers. The worst part of it is that the tip was included 20%. So in return, here goes my bad review for your place as an extra personal tip!", "author": "Abe A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "Great cocktails for a wine bar! Absinthe makes the heart grow fonder is terrific. Food was a little less perfect than that. Pork sandwich should have come with slaw and instead came with a salad and stale potato chips. Nice atmosphere and friendly staff. Again, great cocktails.", "author": "Carey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "After a wonderful day strolling the Brooklyn Heights promenade, I stumbled upon this hidden gem on Henry Street. As I walked in I was promptly greeted and sat at a lovely window table. After a few moments perusing the menu, (which had unique dishes like ricotta cheese and fig Cristini, wild gulf shrimp, boar gnocchi And an assortment of cheeses that  blew my mind). \n\nAfter an agonizing decision making process, I settled for the special Peppered beef stew w/ egg noodles and a glass of heaven(malbec)!! The stew was mind blowing, dare I say better than my mom's. The pairing of the deeply flavorful Peppered beef and the egg noodles is genius! The service experienced was great and the food was exceptional. I will definitely be back. Thanks!", "author": "Ara A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-09", "description": "What looks like a nice, cozy restaurant with a friendly waitress turns out to be a complete mess when it comes to the kitchen.  My wife and I ordered two of the more simple items on the menu and the food was never served.  This was 2 in the afternoon when the restaurant was just not busy. We left after a 45 minutes.  We did order a very good rose that we paid for before leaving - but unless all you want is wine, beer, cocktails- just do not bother with this place.  There are so many better places in Brooklyn.", "author": "Al S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "Food, wine and atmosphere is amazing! Love this place and gone multiple times.", "author": "Jessi B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Brooklyn Heights Wine Bar \u0026 Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "50 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/1SEX9lzOMyH5qMKWJ-1kUg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555595"}