{"aggregateRating": {"reviewCount": 186, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "I went here with a couple of friends, and we split some wine and cheese. We went in the middle to late afternoon, so the weren't many other people there and it was quiet. We split a bottle of rose, and it really hit the spot with it being nearly 90° outside. We also split the three cheese tray, with the baguette, walnuts, and honey. It was all delightful. My friends I sat around and chatted for nearly 2 hours. The woman who seemed to be running the serving show was very pleasant and attentive. Even after we had finished up and taken care of the check, we sat around and talked for a bit more, and she came back and gave us more water. She didn't have to, but she did, and it was a very nice gesture.", "author": "El L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-09", "description": "Friendly staff but less than mediocre food.  Had a \"grass fed burger\" that was flattened and dry like a fast food quarter pounder... Not worth the price with so many other options here in Brooklyn Heights...", "author": "James H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-04", "description": "I hope the slew of recent bad reviews isn't indicative of a downward trend...\n\nI lived in the neighborhood until last November and this was one of my go-to places.  Their wine selection is fabulous and reasonably priced.  I am very very picky about my wines (to the point where I usually will not order wine except at the best places and settle for beer).  I've never had a wine here that I didn't like.\n\nTheir burgers are just great.  Probably the best burger I've had at a place that humbly offers burgers and isn't a steak house or gourmet restaurant that prides itself on its burgers.  The bun is just the right amount of tough/crispy while being soft enough you can bite through it easily and the burger is always cooked perfectly with just the right amount of salt for my tastes.  \n\nTheir white bean crostini is also super tasty and I've never had a small plate there that I was disappointed in.  \n\nIf someone offers me a free meal at a \"fancy\" place nearby or this, I'll take the fancy place, but if it's this or a nearby ale house or other pubs, I'll take the BH Wine Bar hands down.", "author": "Dave M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "I'm in the neighborhood and went in. The food is good but the service seriously needs improvement. I had to ask for service when I came in, and I had to ask twice for what I ordered. The place was Soso packed but it's not an excuse I don't recommend this place.", "author": "Edward R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "I just moved to Brooklyn Heights and was attracted tot his place from when I first drove by. The place is very relaxed inside. It was pretty empty when we arrived, around 7, but then as the night got going it did get crowded and a bit loud. Nothing horrible though.  \n\nWe had a bottle of wine and the cheese plate and both were amazing. I will be coming back for sure.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "I came here with friends for a few glasses of wine to warm up before trekking further on to get dinner. The wine list was well-organized, and I thought they had reasonable prices and selection. Our waiter gave fair suggestions when asked, and the wines were good across the board.\n\nIt took a little while for our drinks to come, and our waiter was by no means overly attentive, but we enjoyed sitting in the front window and absorbing the atmosphere.\n\nI would definitely stop by here again if I'm in the area, and maybe give the food a try.", "author": "Kerry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-07", "description": "(Preface:  This place is on my \"Two-Week List,\" in which I list the top twenty restaurants and bars that I'd go to if some soothsayer came up to me and told me that I only had two weeks to live.  Check out the full list on my profile!)\n\nI used to live two blocks away, and I kid you not, being close to the BK Heights Wine Bar was something that helped make my decision to move there.  (I thought, \"It will be my new Ost!\")  And to this day, it's what I miss the most about living in Brooklyn Heights.  \n\nThe place is just so freaking adorable.  Corner windows, quaint sign, candles on the table.... such a good place to bring someone OR to just bring yourself and your New Yorker.  The wine list is HUGE, and Brian the bartender (LOVE HIM) knows so much about all of them.  Dinner is great, too, but whenever I come here I want to get all kinds of little things. I also love having my wine paired with the various meats, cheese, and pates on their menu.  \n\nThe place feels classy, and it is.  But that doesn't mean that you'd feel out of place in jeans and Chucks.  So it's classy but comfortable.  When people say that there's nothing to do in Brooklyn Heights (or even DUMBO, given its proximity), I always direct them here.  Really worth it.", "author": "J. K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "Love this place. Great food, great service. The cheese menu is amazing. Brussels sprouts salad is ridiculously good. A bit on the pricier side but it makes sense. Classy, first date vibe.", "author": "Finchy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "Made an evening of it, while meeting up with some friends. Ordered the mixed cheese plate, followed by a bottle of Pino Noir. My bleu cheese/baccon burger was up next and was probably the best med-rare I've had in a long time. Everyone else enjoyed their meals. \n\nI know at some point there was another bottle of red, did we order dessert? I know the arcade fire album was on repeat, it played at least 2 times. Would go back again, brunch sounds like it's good - but another evening kicking back and attacking the wine list... tempting as well.", "author": "Erik C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-15", "description": "Terrific neighborhood wine bar but a destination place as well for those visiting the heights.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-23", "description": "I absolutely love this bar! The vibe is great and has a classy but casual feel.  The staff was really inviting when we came in and Graham the bartender was knowledgable and incredibly personable.  I would definately reccomend trying the Brussle sprout salad it was amazing. This is going to be a new regular spot for my friends and I.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-01", "description": "I think this place is decent. I sat at the bar and had good service, and a good view of the activity on Henry Street. \n\nI had a caipirinha which was made with care and tasted like it too! I got the cubano sandwich, although I think it was slider style, but I ate it all myself :) \n\nOverall, can't rave about the place, but can't complain, either.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-25", "description": "I'd def go back.  Small wine bar, but had this cozy atmosphere.  We were given a fantastic table in the front of the restaurant with all the windows.  The inside was paneled with old dark wood.  Not a huge spot, but very cozy and cute. \n\nWe ordered a three-cheese plate, Butternut Squash with crème fraiche (rich), Firecracker Shrimp (small portion but yummy), mushroom ravoli with a pesto cream (yum) and a veggie plate which included goat cheese polenta and a variety of veggies (beets, portabellas, butternut squash, artichokes and some root veggies).  Waitress was great, wine list was good and lots of choices for foodies.", "author": "Jaimie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "This place is was a great find! The waitress was more than willing to cater to my needs especially the on going bread request and by giving my puppy Cassie a bowl of water. They carried great conversation and couldn't stop smiling. Very friendly vibe coming from the place. And the food! AMAZING! The burger was mouth water with bacon to die for! Great place!", "author": "Nickoles P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-16", "description": "So maybe coming from San Francisco, my wine bar standards are quite high.  I was so disappointed with BH wine bar.  Despite the lovely location and quaint ambience on Henry Street, the service was beyond poor.  I had to wait for over fifteen minutes to get my check as the wait staff mysteriously disappeared in the back.  I don't think the staff smiled once which was oh so rude..especially for a single woman eating alone.  Where's the love? \n\nThe corn chowder was thin and the cheese plate was sub-par.  One would do much better going to the recently opened wine store on Montague, getting a slice of pizza from Fascati's (can you say hmmm, mmmm good?) and enjoying the view down on the promenade without the hassle of this joint.  \n\np.s. If I wasn't still tipsy from the Prosecco, I'd have given this place 1 star but I'm feeling friendly.", "author": "Julie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-24", "description": "Came here to try out the different wines. They were great but the food we ordered, eh. First of all it took them so long to get us our food, we thought they forgot. I ordered the Orecchiette, the pasta was overcooked, half the shrimp had shells on them, the sauce was off. Don't think I'd come back here.", "author": "Ani A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-23", "description": "I came here for brunch and had a thoroughly enjoyable time. We had a short wait for a table to open up and had a nice seat in the window so we could engage in a little people watching while we dined.\n\nI shared the lemon poppy waffles with my wife and had the eggs with spinach and hollandaise on an english muffin. Both were solid offerings. I had a nice chenin blanc along with while my wife had a mimosa. \n\nI'd return here easily, its a good value and a pleasant experience. Also our server/hostess kept throwing in small phrases in french which was quite charming.", "author": "dave m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-01", "description": "After my bad review I received an e-mail from the manager of the wine bar offering us complimentary drinks and a chance to improve on our experience. We did return and found the service to be better. We have been back a few times and over all enjoyed ourselves.", "author": "Rich M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-20", "description": "I adore this place.  For those in Bklyn, it's another fabulous addition.  For those in Manhattan, it's just a quick jaunt across the bridge -- def worth it.\n\nFavorite options: the quiche, the Roasted Chicken sandwich and the *ultimate* lobster roll (the owner says they surveyed all the best lobster rolls in the city to create it.  I believe that -- it rocks!!!).\n\nThe wine list is fantastic.  The staff is lovely.  Overall - fabulous!", "author": "Meryl C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-18", "description": "new years eve we stopped here for a quick drink before walking over to the brklyn bridge to watch the fireworks.  the staff were super friendly. the restaurant wasn't packed and noisy like other places in manhattan.  it was mostly the locals and us.  we had the gnochi in beef sauce.  it hit the spot. my friend had a pisco sour which she was was delicious. it looked delicious to me.\n\ni'd go here again for a full  meal. it feels very homey and friendly :-)", "author": "Nel A."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Brooklyn Heights Wine Bar \u0026 Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "50 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/1SEX9lzOMyH5qMKWJ-1kUg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555595"}