{"aggregateRating": {"reviewCount": 186, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "Cozy little wine bar that seems to match its neighborhood--low-key, cute, and, for lack of a better word, nice.\n\nMy first visit--for drinks only--was undeniably enjoyable. Our server was attentive and helpful, and my drink was excellent. I had the Brooklyn Beauty, which was a concoction of gin, prosecco, lemon, and St. Germain. Utterly delicious and refreshing, and it had my friend wishing he had gotten the same. \n\nMy second visit, however, was subpar. I had another round of the Brooklyn Beauty, but this time it was decidedly not what I expected. It was still decent, but tasted like it came from Airborne powder. Or Emergen-C. The aftertaste was very, very strange. \n\nI also had food the second time around. The burger that I ordered was decent. Grass-fed, which was a nice touch. I do wish, however, that they added a tad more seasoning. My friend had the pulled pork sandwich. This, too, was decent, but forgettable. \n\nIn sum: Come for the cocktails and wine--skip the food.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-11", "description": "Don't hit this place close to the end of the night. \"We're out of  the  Continental\" ? Crowded with Wall Street types,  but fun time.", "author": "Thad H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-25", "description": "I would echo other reviewers on the bad service...but our service was non-existent. We initially had stopped in for drinks and food but were unsuccessful in ordering anything besides one drink. An hour later we finally flagged down a bus boy to get the check.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-10", "description": "Let me preface by saying I have been here several times and typically enjoyed it -- but this experience left a bad taste.\n\nI was meeting a good friend for happy hour. We both arrived at 6:30 and were given happy hour menus that said \"5:00-7:00\" we both ordered a glass of happy hour wine, sat, and got caught up on weddings, new jobs, new places, all of that good stuff. Suddenly, our waitress breezes by at 6:40. \"Last call for happy hour,\" she says. \"But doesn't it end at 7?\" I ask. Nope. Apparently all drink orders have to be in 20 minutes before, despite it being a small place and not super busy. when we try to order  another at 6:50, we are charged full price and given a smirk. We stay another two hours, during which the restaurant all but empties, and our waitress ignores us completely. We have to flag her down for the bill, and she's surly. \n\nI love the location, the menu and the potential -- but the service? Not so much.", "author": "MtPleasantChica .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "THIS PLACE IS INCREDIBLE. The amazing waitress Hallie recommended the fresh ricotta and fig jam, chorizo, and the fromage d'affinois with olives and with a pairing of a light Syrah from Morocco! Delicious, will DEFINITELY be back!", "author": "Cole H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-09", "description": "IN SHORT: A low-key, quiet space with a wine list made for purchasing a bottle or two.\n\nTHE STORY: Brooklyn Heights Wine Bar is the type of cozy neighborhood corner perfect for long conversations over a rich bottle of wine and a few small plates ideal for sharing. The music is so hushed and mellow that you'll only notice it after a lull in conversation highlights Elton John's \"Tiny Dancer\" playing happily in the background.\n\nService is efficient and occasionally helicopter-ish on a slower night, but still knowledgeable on the menu and able to give strong recommendations. At my past visit, we asked for a dry, full-bodied bottle of wine, and were quite pleased with the selection, one of many under $40.\n\nFor our accompanying small bites, we split the Shaved Brussel Sprout Salad with pecorino and small morsels of crispy proscuitto tossed throughout. While the lemon dressing suffered from a heavy hand of vinegar that overpowered the meaty bits of ham, the creaminess of the pecorino with the airy green shavings redeemed the dish and made it worthwhile. The Hummus with grilled pita was even fresher, and although the cheese selections weren't particularly inspiring and missed a bit on temperature, it was one of the largest plates I've seen, with 5-6 servings of each cheese, and a choice of 3 available for $15.\n\nFor a local, casual dinner where wine and conversation are to be the stars, Brooklyn Heights Wine Bar should not be overlooked.", "author": "Ali M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "On a Thursday night, around 7pm, We came across this place searching for quiet place for a quick bite.  Quiet - yes.  Quick bite - not so much.\n\nDrinks: Extensive menu of drinks but we decided to get red Sangria.  Nothing special - comparable to premixed stuff that comes out of a bottle/box. \n\nApp: Chicken liver mousse - decent portion, a little too sweet but a nice starter.\n\nEntrees: I went with the pull pork sandwich, my friends had the burger and the pork tacos (where you put it together yourself).  The general verdict - perfectly edible, but not particularly memorable, and definitely not worth the wait.\n\nThe server/waitress was pleasant but the food took a really long time.  Yes, it is a wine bar.  But it has a kitchen.  Even with one chef, over an hr to wait for an app and three entrees is just way too long.  If you are hangry, avoid the entrees and stick with the smaller plates.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Nice quite little bar with good music. Stopped in and had a beer with my nephew who lives in Brooklyn. Food is also served.", "author": "Bill U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-21", "description": "Cute little wine bar in Brooklyn near dumbo. The wine is well priced and so are the food selections. The menu is nothing special. They have the usual brunch items like eggs and burgers. I would come back again, but mostly for drinks.", "author": "Wilson L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "We love this cozy neighborhood spot. Whether you want a cup of tea or a glass of something stronger, you will feel welcome. There is a Happy Hour Menu and a very  good snack menu for noshing while you drink. We particularly enjoy the cheese plates served with bread, honey and nuts. A genius combination! The entrees are always delicious and attractively served at lunch and dinner. Recently a breakfast service was added.", "author": "Martha F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "We were walking down the street and got stopped in our tracks by the most amazing aroma.  Had to stop and eat.  We ordered a bowl of delicious chicken gumbo as well as a delicious sandwich of chicken with goat cheese.  Absolutely delicious.  The service was fantastic as well.  The pricing was very reasonable as well.   The restaurant is so quaint and cute in decor and the bathroom was pristine!!", "author": "Tamara K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-10", "description": "I can't say I'm a fan of this place, although the service is attentive and friendly. The wine selection is fair, but if you were to opt for a cocktail you may be disappointed with the craftsmanship.\n\nNonetheless, what left a bad taste in my mouth was that we had walked in around 4PM looking for drinks and some bites. They said their kitchen was closed, which is reasonable given the time, and that they would simply give us some almonds and olives on which to nibble.\n\nThe almonds and olives came and tasted rather stale and plain. Upon receiving the bill, the almonds cost $7 and the olives another $5. We felt that they misrepresented themselves and gave us the impression that the small bowls of nuts and olives would be complimentary given that we ordered several drinks. The dollar amount isn't of any concern, as we were in the neighborhood prior to a $400 dinner anyway, but it's the approach and the possible intentional misinformation that rubbed me the wrong way.", "author": "Pat P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-18", "description": "We were looking for a spot to grab a quick drink and a snack near the Clark St subway station. We picked this place because it was full of people.  Any place that has a good crowd on a Monday night has to be doing something right, yeah?\n\nAnd we weren't disappointed.  This place isn't fancy but it's a solid neighborhood hangout.  This has to be one of the only spots in Brooklyn Heights where you can get a glass of wine for $6.50--and a decent one, at that.  There were higher-quality wine options too, and they also happened to have my date's favorite kind of beer, plus an intriguing-looking cocktail menu.\n\nI can't speak for the rest of the food but the lemon-white bean crostini (which we ordered on the recommendation of the bartender) was fantastic.  The bread was perfectly crispy, the bean dip light and flavorful.\n\nI wouldn't make this place a destination, but if I'm in the neighborhood again I'd definitely go back.", "author": "Lindsey R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "Nice quick quaint spot to stop.. Bar chick was from the Bay!  Extra star for that.. Decent wine.", "author": "Kena M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "My on-the-picky-side grandmother absolutely loved her spinach eggs benedict.  Now I know where to take her every time she visits. :)  As usual, the shaved brussels sprout salad was delicious, and the cocktails were very good.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "Great little wine bar not far from the base of the Brooklyn Bridge. We showed up with a party of six on a Saturday night without a reservation. Thought we'd have an hour wait, but the host was creative and found us a table  - a bit crowded, but totally doable - in a matter of minutes. Nice selection of small plates, and other foodie delights like cheeses and salmon, but I opted for the burger, which was very good. Tricky thing on the wine list that gives prices for a 1/2 carafe (2/3s of a bottle) between the price for a glass and a bottle. Easy to get confused and think you're getting a better bargain than you actually are. Nice to have the 1/2 carafe option; you just have to pay attention.\n\nGreat place though. Would go back in a heartbeat.", "author": "Paul H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-16", "description": "I somehow got really inebriated on girly cocktails and spent a lot of money here (but don't tell too many people, for it will severely ruin my reputation). I'm usually quite good with holding my liquor, but there were just so many that I wanted to try. For some reason, the cocktail names really intrigued me to have 3 or 4. Warning: they're strong. The manager of the place saw how happy I was and decided to give me a few more on the house. Oh fun.\n\nI came here for dinner a few times, but I think I would rather just come here for a quick appetizer (meat and cheese platter is good) and the mixed drinks. It's not that I have anything against the entrees, I think I just like the appetizers more.  It's right off the first stop (High St) on the A in Brooklyn Heights, so if you're in the area, I would definitely recommend trying it out.", "author": "Clemens W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Great, relaxed place after a trek over the Brooklyn Bridge.  The tomato salad, amazing.", "author": "Kathy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "Love this place SO MUCH! When my roommate and I moved in a couple of blocks away last month, we were famished and needed a place to chill and enjoy some good food. Luckily, we stumbled upon the Brooklyn Heights Wine Bar!\n\nWe first went here for brunch with a couple of friends and were seen immediately. I am embarrassed to say that I forgot my waitress's name, but she was absolutely lovely and catered to all of our needs. When I could not decide between the gumbo (I love gumbo) and Eggs Benedict, she surprised me with a small portion of gumbo so that I could experience the best of both worlds! In case you're wondering, both the gumbo and Eggs Benedict were outstanding! I have never had a waitress do anything for me like this before...especially not in New York City! Anyway, this just shows how impeccable the service is at Brooklyn Heights Wine Bar.\n\nThe next time I went here was for dinner a week ago, and again I experienced fantastic service with a different waitress and bartender. They are very personable and check in on you enough, but not too much, like when you're taking a messy bite out of your burger with guacamole. The drinks here are very tasty too and reasonably priced. My friend and I had a great time that evening thanks to the food, drinks, and especially the impeccable service by the staff. I see that there have been complaints about the service in the past, but I can attest that both times I've been, we were treated like royalty. This has quickly become one of my favorite restaurants in my new neighborhood! My only wish is that they would start implementing endless brunch on the weekends so we don't have to travel into Manhattan!", "author": "Samuel T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "Just had the worst pasta dish in recent memory. Orecchiette was stuck together and overcooked. The sauce strangely tangy and not in a good way. The shrimp luckily were edible but i left the rest in the bowl. Guessing it was an off night because I've had stuff here previously that was very good but this was inexcusably bad.", "author": "Paul D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Brooklyn Heights Wine Bar \u0026 Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "50 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/1SEX9lzOMyH5qMKWJ-1kUg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555595"}