{"aggregateRating": {"reviewCount": 186, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Fun and Fabulous!!!  Great service thanks to Rocco!!!  The wine list is extensive and we enjoyed tasting never before heard of wines!!  Wonderful experience!", "author": "Gigi H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Don't miss this amazing wine bar and eatery. Quick hop off the A train first stop in Brooklyn. The value for dollar at this place puts most Manhattan wine bars to shame. And the food is top notch from salads to bone marrow. Also one of the best scotch lists around. Great vibe and close to St Ann's Watehouse!", "author": "Mikel R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-01", "description": "Brunch was bad. Came here with my family, never been to the place before. While the menu looked appetizing, the actual delivery was poor. Eggs came cold, kale was tasteless and watery. The only edible thing on a plate was toasted sourdough. I won't come back and not recommending to anyone.", "author": "Mara T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "Stopped for a quick brunch and two for one mimosas on a Sunday morning. Delightful staff wonderful bartender great food and awesome Christmas music totally completed the atmosphere", "author": "Tami L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-14", "description": "Overpriced and poor service. When we came in, the place was not particularly crowded but as soon as it was about halfway filled, the servers were frantic. \n\nThe waitress was fine but never checked on us. She  too appeared frantic and disengaged. \n\nWhat's more, the main server continued to turn parties of 2 away (refusing to split tables to do so) in favor of bigger parties (presumably?). In fact, a couple who already ordered and had to come inside because it was chilly, were forced to wait for a table for 2 with others who hadn't ordered. How strange. \n \nThe food was *fine*. Nothing to write home about, so I won't. \n\nWe waited a good 25-30 minutes after we finished to get our check. I had the feeling we could have left and they wouldn't have noticed. But not to worry, we paid over $100 for 3 drinks, an app, and two sub-par entrees. Not worth a return trip.", "author": "Alessandra S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-28", "description": "Who: my boyfriend and I\nWhen: may 28,2017 after the corgi Meetup on the hillside dog park, brunch time\nWhy: hungry after petting all the dogs\n\nThis place takes FOREVER at everything. Service was unbearably slow, it took 10 minutes after sitting down for someone to take out order (2 paninis). Then, it took over 45 minutes for our food to come out (during which time our water was not refilled). The food itself was fine but really something I could have gotten from any deli. Overall unimpressed.\nWouldn't come back.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Nice small restaurant  with wide selection of wine and whiskey. I had a really tasty and well cooked lunch for $15 half chicken panini and hot peas cream soup.  The other choice was portobello panini and cold cucumber soup.  \nClean, nice, fare prices, well served and the most important - tasty food! \nAlso need to admit a very convenient location close to the A train subway station. Good alternative to the Italian pizzerias at Old Fulton district just 5-7 minutes walk away.", "author": "Anastasia G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-20", "description": "The biggest RIPOFF ... Customers Beware \nWe were walking around my girlfriend and I , thought a cup of espresso and a glass of wine would be nice.\nShe asked for a glass of Cab and I ordered an espresso. Sitting and talking, beautiful day she ordered another glass of Cab. Nothing Fancy.Just asked for a glass of Cab.\nSit down for this one ... Two glasses of House Cab and an espresso.... Drum roll please 45 dollars!!!!\nI had to look around to make sure it wasn't The Plaza or Bora Bora or St Bart's in peak season.\n45 dollars,Really???????\nIt thought me a lesson, to always ask the price from now on. 18 dollars for a glass of House wine?\nGTFOH.... total robbery. NEVER AGAIN \nPs my girlfriend said the wine sucked , nothing great....", "author": "John A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Great service and selection. We had desserts here and the best *original style* latte ever. Lattes are supposed to be small, folks. And great dessert wine selection as well. Attentive service, too.", "author": "Sofie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "After a chilly walk over the Brooklyn Bridge on a Saturday afternoon, needed a quiet place to warm up and have a light snack. This spot is relatively closeby and a bit more inviting than the usual dimly lit wine bars.\n\nGot a half-carafe of Montepulciano ($27) and a side of Home Fries ($4). The dark red was perfect after freezing our asses off outside, especially sitting next to the window and seeing others trying to brave the cold while we got warm. Home fries were nicely seasoned, going well with the red.\n\nService here is solid. They didn't try to rush us out despite just having a side and a drink. Although I don't come around this area often, I'll make a note if needing a spot to relax.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Love this place! Great place to have dinner on a random week night, where you won't feel guilty for spending a fortune. This place is neighborhood, and cozy and delicious! My favorite meal is by far the boar ragu! It's amazing,really! The gnocchi tastes like delicious little pillows that are perfect to absorb the deliciously slow cooked sauce while the boar simply melts in your mouth. Their wine selection is respectable, and a good value. The service has always been great as well. \nDefinitely a place you want to put on your regular rotation!", "author": "Siánneth S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Amazing wine selection at reasonable prices!  Great atmosphere too!  Staff was nice and the restrooms were super clean!", "author": "Whitney S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Yes, it's a wine bar.  But it has the largest selection of great whiskeys I've ever seen.  And the wines by the glass are the opposite of plonk.  I mean, amazing gems from a private cellar.  The food is great - who knew?  Well, those in the know, know that one of the owners is the owner of the nearby Henry's End, which is a food mecca in Brooklyn.  It'd be a crime to miss their sangria!", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "Good selection of wine and great outdoor seating when the weather is nice. Happy hour deals are pretty good and the outdoor area has always been welcoming of our pups.", "author": "Dan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Great service, relaxed atmosphere, crisp beer.\nPulled pork tacos are SMOKING delicious.", "author": "Yohvanni K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-18", "description": "Okay, so I keep coming back because of the wine and food. Recently, I have found a glorious bartender here on Saturday nights. Attentive and perfect. Tonight I came in, and the dude who was here who didn't even notice me for over 30 minutes!!! The lovely waitress took my drink order, even though I was at the bar. She seemed upset that I was not then care of. I still left 25% tip for her sake, but this guy sucks. I just wanted eye contact and a drink.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Exceptional food! I ordered the roasted chicken panini. The panini came on a house made baguette with a chipotle goat cheese, arugula, and prosciutto. It was exactly what I hoped it would be. It came with a mixed green salad that was perfectly dressed and seasoned and house made potato chips. I'm giving it 5 stars cause the food is worth the price. The service is very friendly and inviting but it's slow. Maybe it's just today. There was one server on the floor who is also the bartender. There was another person who was bussing/hosting. I'm not knocking the place at all for this but just trying to leave a clear review. Over all I say go here and eat great food!!!", "author": "Ben M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-23", "description": "Let's face it. You're only going here for the location and convenience. The coffee was not good. The bar service was dreadful. My salad was very oily for a shaved Brussels sprout salad. The bathroom did not have a working light. This place is understaffed by 1 or 2 people. At least I got to use the bathroom.", "author": "Anshul K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-19", "description": "We stopped in on a Saturday afternoon and I enjoyed a solid 3 star chicken panini, recommended by the bartender, with goat cheese and chipotle mayo.\n\nService was good for us, sitting at the bar. \n\nI would definitely be interested in coming here again and trying some of their other items, as the brunch menu looks great and the prices are fair for Brooklyn Heights. \n\nCoffee was good too.", "author": "Fred B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "Decent food but not friendly.\n\nI stopped in for lunch with a friend.\n\nI had a prawn taco dish and was starving after.  Really scabby portion. It was tasty but not nearly enough food for a man.\n\nMy friend had a kale salad which she enjoyed. \n\nThe food was extremely expensive for what you got. That being said it was alright. \n\nThe problem was the lady who was working on the day.  Does she realise she works in the hospitality industry?\n\nShe really kept pestering people to leave when they were finished.  Even though the place was mostly empty, as soon as people took their last bite she stood over them and slapped a bill down.\n\nI left 10% because I didn't want an argument. But she didn't deserve it. The worst was the poor guy that came in and begged for a glass of water (it was baking outside) and she said no...\n\nIf I owned the restaurant and saw how she was acting I would freak out.", "author": "John D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Brooklyn Heights Wine Bar \u0026 Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "50 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/1SEX9lzOMyH5qMKWJ-1kUg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555595"}