{"aggregateRating": {"reviewCount": 186, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-17", "description": "Rule #1 for waitresses\n\nWhen customers come into your near empty restaurant and pleasantly explains they are in a hurry, you should do one of two things: (a) smile and say no worries I'll take care of you or (b) smile and say you are sorry but your restauarant cannot accomodate a rushed meal.\n\nWhat you should not do is get defensive and explain how you would never hold up a meal and point out the restaurant is near empty so nothing should take that long.\n\nWhat the customer is really asking you to do is to tell the chef so he knows ... this table is (unfortunately) in a hurry.\n\nFurthmore, when an unusual amount of time later the appetizer comes out and you are reminded to bring the cold soup and panini sandwich without waiting for the appetizer to be finished, don't point out they are taking longer because the appetizer is a cold enteree (so is the gazpacho).\n\nFinally, when the customer inquires after 15 minutes where their cold soup and sandwich might be, don't begin an arguement with the customer that ends with you telling them they have attitude!? And then continue to badger the customer on said topic, pointing out all things you think you did right.\n\nThat said, the food here is fresh and delicious and under very specific circumstances I wouldn't be surprised to find myself eating here again, obviously, never if I'm pressed for time.\n\nFinal note: I'm giving this place a 3, a part of me wants to give it a 2 and if the waitress had been delightful, I would have given this place a 4. One final note on the waitress, I don't think she was intentionally being a jerk, I think that perhaps, she isn't well-suited to customer service of this kind, she takes things too personally and reacts to them too defensively.", "author": "Frances G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "A great place where you can talk, good for dates. They have a large variety of wines and the good was very good. I had a special that was a grilled octopus and white bean salad, very tasty, the octopus was amazing! I would definitely go back! One entrée and a glass of wine plus tax and tip were $30 USD, so not a cheap place but worth its value. They could have more Chilean wines on their menu, which are good value and high quality.", "author": "Maria H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "Great service. Delicious snacks. Good wine. Bright spot by the window. This place is all I could hope for in an awesome neighborhood spot.", "author": "Michaela D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-26", "description": "As everything is relative, if you're in the North Heights, this is not a bad option.  But when taken as a whole with everything else Brooklyn, or NYC has to offer, don't coming running here. The food is just average.  The noise level is quite high.  Good beer and wine selection.  Good sliced meat plate.  Burger could have been much better and served with slightly stale and damp Ruffles potato chips.  Chicken gumbo was good.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "3.5 Stars.\n\nCame here for a glass of wine on a Sunday night.  Went with a glass of Chard, seeing the weather will soon be cool enough for me to start craving a big glass of red.\n\nThe ambiance is somewhere between casual and romantic, and is a bit more spacious than most wine bars I've been to having a bar as well as several tables.  It was a bit quiet on Sunday night, but I was happy since I was looking for a quiet and relaxing evening.  \nThis place is a solid bet if your in the mood for a relaxing night of wine with a friend. Nothing out of this world, nothing negative to say.", "author": "Todd A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "i stumbled into this wine bar today while searching for a pub and it turned out to be an awesome mistake. it was cozy and homey and had an overall soothing vibe. i didn't have any food because i had just finished up at smorgasburg but several patrons were enjoying brunch at around 3pm which smelled and looked great. \n\nwe had a few of their specialty cocktails (sour cherry caipirinha was my fav) and they were strong and really well made. if I'm ever in the area I'll definitely be returning to try their brunch with some girlfriends.", "author": "Krystal M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-16", "description": "Very relaxed atmosphere with great location on Cranberry/Henry St. We only had wine here but it was very good- Loved the 'Klee' Pinot Noir. \nThe waitress was attentive and it has a nice intimate atmosphere. I walk by this every day going home and it seems to be busier on Weekdays, as an after work drink spot  than any other time.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-15", "description": "Ok so I feel like we stiffed the waitress tonight b/c we only left 15%. Forget that we had burgers and she made us sit there and wait for 10 minutes for condiments, then came over and mumbled \"how is everything\", then we told her and we waited another full 5 minutes til the burger was cold. It didn't matter that much. Really. Everyone makes mistakes and I've done it myself. What mattered is that we were there for a full 2 hours tonight and she never smiled. She was so clearly miserable and so full of disdain (for us?) that it was awkward. She was waiting on a table full of restaurant people (20 plus years in NYC) and we were all baffled by her inability to be pleasant (she was cordial at best, but hardly). Our friend who got their first said the bartender was no better (uppity is how she put it). Personally I have opened some of the most expensive restaurants in NY (hired and trained the staff) and the one thing I can't tolerate is a staff that treats their guests like they are not cool enough or worthy enough to be there. In that regard, this place gets 2 stars. \n\nTo be fair, the food was lovely (4 stars). The dates with blue cheese and prosciutto was rich and luscious as an app. The octopus was tender and plush and perfectly paired with white beans (and that is really hard to accomplish!) The burgers were good (if a little over cooked and cold by the time we got some mayo) but the wine list was nice and affordable.\n\nOver all the place is cute. Nice ambiance, tasteful little space, bright and airy but there are just too many places that make you feel welcome, or at the very least appreciate your business to put up with the flat out ambivalence  we experienced (that said, the busser was super nice! and very gracious!).\n\nI'm gonna say maybe our waitress was having a bad day and leave it at that, but come on people, this is called THE SERVICE INDUSTRY.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-17", "description": "Bartender was lovely, it was cozy inside and wine was okay.  Happy hour prices are fantastic although I ordered the cheese plate which was meh.  Regardless, I'd go back.", "author": "Jenny W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "Food was ok nothing special scrambled eggs and toast with homefries. Really small restaurant. Excellent service.", "author": "Tee B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-01", "description": "A friend and I decided it was finally time to walk across the Brooklyn Bridge in true tourist fashion.  Though a frequent traveler to Brooklyn, I had never been to Brooklyn Heights and stumbled across this place (thanks to a quick Yelp search after de-bridging).  It's great!  A cute little place with a nice outdoor seating area and fun ambience -- feels very vintage.  \n\nWe enjoyed a meat and cheese plate - soppressata with a cheese pairing recommended by the waitress, and phenomenal.  It's a great place to stop in for the wine and cheese, and I will definitely be coming back when I'm hungry to dive into the fairly large menu.", "author": "Anna T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "This place is lovely! They have a great selection of wine and food. I've had their Cuban Sandwich and Lamb special and they were both spectacular.\n\nThis is a really nice place to go after visiting the Brooklyn Bridge Park or are just looking for a nice relaxing evening.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-22", "description": "Fraud, fraud fraud.  Watch out for bartender 1004 Graham.  I recently went in for a glass of wine during happy hour and left a 20% tip on my $5 glass of wine.  Imagine my surprise when I saw on my credit card bill a tip for $11?!!?", "author": "Pamela K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "Big fans. Cheese selection is a win, mains can't go wrong, very friendly service as well.", "author": "Geoff A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Same owners as Henry's End- just a few steps down the street. A little bit expensive drink prices. Not as busy as Henry's End.", "author": "Lucy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "Amazing place for a beer or cocktail and great food for lunch. The bratwurst is a must try.", "author": "Andy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "Five stars if you're coming here for drinks, 3 if you're wanting food. I love the simple ambiance and the fact that they have outdoor seating and large wall to wall windows in the front. I hate the dark dingy feeling of most bars in the city, so it's quite relaxing to sip on a glass of wine in one of the high bar tables up in front. They have a decent selection of wines from around the world and the prices are very reasonable for the quality ($7.5 for a glass of delicious french rose!) They have great happy hour specials too.\nDon't come here for the food because you probably will be disappointed. However, if you're wanting a quiet laid back place to have drinks with an old friend? It's perfection.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-19", "description": "ordered wine and glass was not even half full. Way below the mark. And we paid a lot. I would not go here again because of that issue. Very dishonest and sneaky.", "author": "Anthony A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-18", "description": "Run !! \nWhen we arrive, it was long, and when we order, we almost waited 45min without even a piece of bread, and there were almost nobody in the restaurant. It was expensive for what you will eat ($15 for a burger with just LAYS chips !!!!!), and the waitress didn't understand to divide the bill in 4 and did crazzy stuff... Just crazy, even in MacDonald's they understand what you want...\nDON'T STOP HERE !!", "author": "Bob A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "this does not seem like the average college student establishment, however it doesn't take away from the intimate and relaxing vibe it gives off. The wine list is quite extensive, providing options beyond my limited wine knowledge. I ordered the prosciutto and chorizo, which came on a platter with bread, olives, mustard, olive oil, and pickles. It was good. The music was a tad loud at some points and the lights very dim. All in all, I enjoyed my time here. It's refreshing to see a restaurant stay open on this stretch of sidewalk. It seems like something new is always coming and going.", "author": "Eric L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Brooklyn Heights Wine Bar \u0026 Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "50 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/1SEX9lzOMyH5qMKWJ-1kUg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555595"}