{"aggregateRating": {"reviewCount": 186, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-06", "description": "we went in looking for small plates and a good glass of wine.  food was very good, waitress was very nice and pleasant, but we ordered an expensive glass of wine that was obviously past its prime.  shame on me for not pointing this out, but the nice waitress, seeing our unhappiness, brought us some wine that \"she liked\", so my guess is that everybody knew that the first wine was from a bottle that had been opened awhile ago.  if you're going to have a 'wine bar\", make sure that what you serve is fresh.  the wine culture is ludicrous, but if you're going to pay $18 for a glass of wine, serve what people pay for.", "author": "Henry S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-25", "description": "I was not impressed with the food at all. The ambiance was okay... nothing spectacular. I ordered the lobster roll, which lacked flavor. The portions are also pretty small. The wine was decently priced, but I am no super picky when it comes to wine. The dessert was atrocious. I ordered the creme brulee... it had the taste and consistency of instant pudding. I actually sent the dessert back because it taste so bad. The crepe with fresh fruit was not any better. The crepe did not taste fresh and was tasteless. A friend of mines had he Mrs Mud pie dessert and that was pretty good. I later realized that there is no real kitchen at this wine bar. The lack of a real kitchen explains the poor quality of the food. The cook... if you want to call him that... pretty much reheated food that was previously prepared. Terrible food experience and unfortunately I will not be returning. There are so many restaurants nearby that are a million times better.", "author": "Shaquah W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-18", "description": "i'd give this place 5 stars if it weren't for the epically slow service.\n\nbrunch menu - crepes, portabella panini are awesome\ndinner - i've never had a bad app there", "author": "Chris J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-18", "description": "I really like the cocktails here although they can be a bit pricey!   However, on my second visit there,  I ordered a Charcuterie plate, chef's selection.  It was terribly bad! First of all, it arrived about 2 minutes after I ordered, meaning it was already prepared.  Second, it was cold-cold, meaning it was sitting inside a refrigerator somewhere and third, the selection was not good.  I should have returned it but I didn't want to be rude.   I deeply regretted having paid for this!", "author": "Princess L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "Held a private party/lunch/brunch there last weekend. Wonderful location, atmosphere and food. Mark and the staff were terrific and the pricing for our event was good. I'm so glad that we could hold our special event there and apologize to all the folks not in our party who desperately tried to get into the place for lunch!", "author": "Amy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-29", "description": "This is a really welcome addition to the neighborhood. A relaxed place to go to get wine and dessert, and it's not half bad for brunch either. I had dinner there the other night and the grilled vegetables with goat cheese sauce (it was definitely called something much more elegant than that) was delicious. I hope this place sticks it out at this ill-fated address.", "author": "Anna Z."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Brooklyn Heights Wine Bar \u0026 Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "50 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/1SEX9lzOMyH5qMKWJ-1kUg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555595"}