{"aggregateRating": {"reviewCount": 186, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "I went there with my girlfriend. We had an appetizer to share and one entrée each. Prices were very reasonable and the food was great. However, we noticed that they used Lay's original chips instead of French fries. Well worth a visit if you are in the neighborhood but nothing more than that.", "author": "Søren K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "Went there on Valentines day after seeing a local off Broadway play \"Candide\".  I thoroughly enjoyed the wine and my friend did not waste any of his Dewars and Water.  Quiet relaxing atmosphere with well selected background music.  Definitely my Brooklyn Heights go to place.  Reasonable priced, good pour and a good wine selection that has descriptions for both bottles and glasses.  Erica was a true \nvictualler / barkeep / oenophile.  Everything is done from scratch with some old school touches.  Nice crowd and  had a nice conversation with two good guys Bill and Bob.\n\nNote the lady behind the bar was Erica.  Nice to go some place where they know what they are doing....", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "What a great place! The food was fantastic and the waiter (Woo) was awesome. Definitely will go back.", "author": "Barb R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "EXCELLENT FOOD. Delightful atmosphere. Genuinely kind staff. \nFun brunch and dinner spot! \nA gem of Brooklyn Heights.", "author": "Elizabeth D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "The service and food are excellent. Great choices of white and red wines to go with a good selection of small plates and entrees.", "author": "Francisco V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-01", "description": "Admittedly, I am quite a wino so the fact that our buds uncharacteristically chose a wine bar had me looking forward to the evening...that is until we were served a regrettably untasty meat platter, washed it down with mediocre Malbec, and struggled to find a suitable entree. Uggh... \n\nAh, to elaborate: how does one mess up slicing a bunch of salami and prosciutto anyway? Leave it to this dining establishment to perfect this trick: for the salami, the pieces (all 3 of them) were too huge to eat uncut. The prosciutto was on the fatty side and anemically pale. \n\nOur mains came out in a timely manner yet this was the one silver lining. The burgers were okay but nothing to write home about and more cooked than requested. The pasta with shrimp was mostly the latter. Comparatively, I lucked out by asking for my pulled pork to have sauce on the side and somewhat enjoyed this crispy but quite salty dish.\n\nSomeone--seemingly the owner--stopped by to check on us but how does a customer relay that the whole menu needs to be scrapped? Kiddos for trying but...sigh... such disappointment from a wine bar. Who would have thought?", "author": "Kristina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-22", "description": "We almost passed by this place because it looked legit closed when we were walking by trying to find a brunch spot! \n\nThe food was a great price point for the area, and I loved what I got which was the burger with gruyere and fried onions. I will admit, the SMELL of the melty gruyere was a bit pugnent (I mean, I was a little taken aback when it first got to the table because DAMN that cheese smelled RANK), but after I started eating it my olfactory senses were beginning to get used to it. The salad that came with it was appreciated as I need more green in my diet usually. I tried a new Ommegang brew that I hadn't tried yet (Rare Vos, a little too syrupy for my taste but I think would be better if I drank it faster/while it was cold). \n\nMy friend was a little disappointed with the warm shaved brussel sprouts salad with pancetta, Parmesan and lemon - it was kind of lacking in some flavors, and instead of being full or bits of brussel sprouts it looked simply like alfafa sprouts with a few measly pieces of pancetta. Other friend loved the bloody maria she got though, and our waitress was super accommodating in that she was willing to let me try samples of beers before I made my decision!\n\nIf I lived in the area I would definitely come back! :)", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "This place is a great find, big selection of wines by the glass and a nice and welcoming atmosphere. The staff and service are always great, and I've always been able to have my questions about the wines answered. \n\nThe warm pretzel bites are great, probably my favorite thing that I've had there. \n\nI've ordered the cheese plate on two separate occasions and thought that it was much smaller the second time. The prices of the cheeses may have changed, which could account for the smaller portions, but I still think the cost was a little steep for the quantity.\n\nIt's a small place, so sometimes it can get a little loud inside, but overall, it's a great and cozy place to grab drinks and food with friends.", "author": "Emily J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "I am not an avid reviewer however the customer service was terrible enough for me to feel the need to write one. I went with a friend and we were going to ask the host a question but we were so abruptly greeted with \"can't you see I am running a restaurant\" in a terrible manner... We both looked at each other and walked away there is no need to treat any human being like that. We left upset and never want to come back. Do not recommend this place AVOID IT!", "author": "Priscilla O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "Great service. Well prepared, well priced food. Been here twice for lunch, and positive experiences each time. Wine is a bit pricy, but on par with most wine bars. If you find yourself in the neighborhood, it's worth checking out.", "author": "Howard I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "The service is really good here and the selection is quite nice. The happy hour is 5 dollar beer and 5 dollar wine! You can't beat that! 4-630! The Cabernet is surprisingly very smooth and even a little sweet! The pulled pork is delicious it comes with chips and mixed greens for a balanced meal. I will for sure be coming back", "author": "Renzo T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "Wine bars to me usually say dress a little classy but this place had a very casual vibe to it, which made me instantly feel comfortable given that I was in a t-shirt and jeans with flip flops. \n\nTo start, we had the Marinated Artichoke to share and it was a tasty refreshing dish. My date of the evening had the burger, which he said was delicious, and I had the salt cod fish pie. What I loved about my dish was that it also came with plenty of crusty buttery slices of bread.\n\nThe service here is friendly and quick. Our waitress was there for me when my wine glass was nearly empty, ready to refill it. \n\nI'm glad I finally checked out this place after walking by it a million times, given that I work in the area and there's nothing like a good glass of red wine after a hard day of work!", "author": "Julia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-11", "description": "Casual, inviting wine bar with a reliable drink menu: several wines, great cocktails, + a variety of beers. Come here for the convenient location (close to Brooklyn Bridge and the A/C subway), cozy atmosphere, and delicious drinks.\n\nI live close by and have dined here often. The standard food options (salads, burger, brunch eggs) are prepared well but have never impressed me. And service lacks warmth. But the general good vibes of the place outshine any complaints and make it one of the best spots in the neighborhood to grab a drink or a bite to eat.", "author": "Kara B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-17", "description": "If you like paying $11 for 4 small pieces of cheese and a bunch of toasted bread then go ahead.", "author": "Em M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-01", "description": "Nice vibe to this place. Great selection of wines and friendly staff. Walk across the bridge and check them out.  Excellent cheese selection too.", "author": "Donald M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-23", "description": "Kickin' rad! Really cozy place with decent food. I did not, however, enjoy overhearing the chef stress the really nice bartender. One star deducted for that only.", "author": "Olga F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-20", "description": "Not really that great. We were ordering wine and were waiting for outside seating and were promised a table when it was available. However, several tables opened up, and they conveniently skipped us to people who arrived after us if they had larger orders. Really rude.", "author": "Kelsey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Perfect wine, or perfect meal, perfect service.   A total 10.   This is a great stop after walking across the Brooklyn Bridge.   It is a short distance from the foot of the bridge and then a short distance to the water, where you can hop in the Waterway Taxi for a gorgeous trip.", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "Loved this place! Great atmosphere  and excellent food. Especially loved our server, Woo.   Thank you for an enjoyable evening!", "author": "Deb M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "I love! If I lived in the area, this would be my Cheers. It was the perfect setting for a ladies night.\n\nThe place is small, intimate. The glass window-fronts give you a perfect perch for people-watching. The wine list is quite decent (as you'd suspect at a wine bar) and service was quick. Fresh glasses of Shiraz made it to my table as quickly as I could drink them (... perhaps too quickly, but that's my fault).\n\nThe food menu consists of lighter bites. The beet ravioli was fantastic, but the portion was moderate. I assume you could get more than one dish to satisfy a larger appetite, but I wouldn't come here looking to leave completely full.", "author": "Helena S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Brooklyn Heights Wine Bar \u0026 Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "50 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/1SEX9lzOMyH5qMKWJ-1kUg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555595"}