{"aggregateRating": {"reviewCount": 186, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "Loved this place! Small but cozy. Service was great considering the place was packed and there were only 2 servers. All the food was delicious. I have he frittata, others had the burger, croque monsieur, salmon avocado blt and their biscuits.\n\nThe prices were very reasonable and the quality of food was excellent. We were a large party and they served all our food at the same time, hot and delicious.\n\nYou will not be disappointed if you find yourself wanted to visit this establishment.\n\nWe hope to be back.", "author": "Cristina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Lunch for my wife was an outstanding beet salad and, for me, a very simple salad, just bibb lettuce and their homemade dressing consisting of olive oil and champagne vinegar plus we shared a baked brie appetizer .... everything was delicious !! Their wine list is huge with a number of very reasonable priced wines by the glass but they have only 2 beers tap. We will definitely return.", "author": "Rick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "Stopped by as a tourist on a Monday afternoon for a glass of wine (or two) and loved it! The wait staff was very friendly and attentive. We got a seat at the bar right away and the rest of the restaurant wasn't too crowded. I had a delicious glass of Matthew Fritz Chardonnay - bright but smooth and not too buttery and healthy pours!! The menu items looked great - will be back to try the curry chicken salad sandwich or baked Brie!", "author": "Krystal I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "The $10 beer and burger happy hour deal has got to be the best in the neighborhood.\n\nPlus, they have a bunch of beer/wine/cocktail options at $6 (HH is M-Th 4:30 to 7).\n\nBartenders are super nice. Space is cozy but not cramped.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "It was a germ that we random bumped into. We were planning to walk on the Brooklyn bridge on Saturday and it was really gloomy and cold that day, so we decided to go into this lovely bistro to warm up.\n\nWe ordered a duck oil fried fries and an espresso. The fries were delicious. \n\nWe love the atmosphere of the bistro, warm and cozy. Highly recommended:)", "author": "HanDan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "A little gem off the beaten track from the Brooklyn Bridge tourists \nExcellent food regardless of the limited menu \nCheck the special board for excellent additions i.e. lobster packed Mac n Cheese\nTwo for one Bloody Mary's are recommended", "author": "Stephen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "Came in here for coffee and desserts. Warm wonderful service and delicious drip coffee. Recommend the lemon tart and chocolate mousse. Relaxing and cozy ambiance and upscale drinks and dishes.", "author": "Kyla D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "What a jewel of a find. Wanted to walk the Brooklyn Bridge and needed to grab a quick lunch. \nThe salad was great I was told and I had the smoked bacon Mac and Cheese. One of the best Mac and cheese dishes I have had. Small place but worth it.", "author": "Chip F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Afternoon at the Brooklyn flea market. BHWB is like the shirpas at base camp. Climb the hill a little to get to the Brooklyn Bridge walking path. The find this place to get you ready for the walk back to Manhattan. Or laugh at the people who need less blood in the alcohol stream after the crossing. \n\nCheck the specials for some good options.", "author": "Bill L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-06", "description": "A nice small wine bar serving brunch, wine and cocktails in Brooklyn Heights.  With time in my favor I rejoiced life with some wine.  Quality wine with knowledgeable bar tender and friendly service.  Happy Hour is only from Monday to Fridays-- no weekends.  The location is very convenient to the A, C train High Street.  A business card is available for grabs.  When scanning their brunch menu the cheese plates and select entrees were appealing for a return.  I was actually carded as my face does not match my age:\n\nCan I See Some Identification?\nErgo all bouncers scrutinize to the tee\nTo exam my photo, memorize my mailing address\nAll the while doubting the authenticity of my DOB to match my face\nHow my luck reeks to be carded\nHere, there wherever I go\nStop glaring at me\nYes, we Asians hide our age gracefully\n\nI opt for one glass of red wine with bar tender Pam's suggestion.\nSyrah, Thalvin Syrah (Morocco) 2011 $11.00-  very subtle red wine of a gentle finish with oak and cherry.  I actually did tasted the oak and the sniffed bottom of the oak barrel.  It was fruity.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-19", "description": "Good menu and drinks selection. \n\nNot accommodating to birthdays--it was very offensive to the person who's birthday we were celebrating that we couldn't light a candle for their birthday. We even called the restaurant ahead of time. \n\nService is also slow.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "This place was a complete gem! We got a table around 6pm and had two bottles of wine, some cheese, and wine. The waitress was fantastic, super helpful and friendly. The atmosphere is perfect for a date night. Highly recommend.", "author": "Steven U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "Wow what a great place for our family gathering after show at St. Ann's Warehouse.  Food was wonderful, Mark and his entire staff were so friendly and helpful.  Thanks for making our Christmas gathering special.", "author": "Paul H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "I visited this small resto bar on New Years Eve and it was quite crowded by the time I arrived. I was really surprised by how small the place is.. although the ambience and vibe was really good. The menu had way less options to choose from. I ordered a garden vegetarian lasagna which was on the menu for that day. The quantity was way too less for the price.. but it was absolutely delicious. I give special appreciation to the chef. Overall, although the place is pricey and small, I would definitely visit again only for the food and service.", "author": "Shakthi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Cute place\n\nOn a search for some downtown Brooklyn brunch eats, we tried two other places in the area for brunch but they were too packed, so we decided to hit up this place. *I do not care how nice/well reviewed  a place is; waiting more than 20 minutes for a table is way too long in a place like NYC.*\n\nThis is a nice, small wine bar that has an adequate brunch menu and an above adequate wine and cocktail menu. The day that we visited, the place was not crowded at all and we obtained a table right away. The service was pretty fast and the food was in the mediocre to good range. I take it that the wine and spirits are this place's claim to fame. As the name of the place would suggest, it has an great list of wines and cocktails. Be aware that the majority of the wines are Italian, but the wine bar even has a couple of reds from Morocco, which I have never seen before. Maybe next time, I will try one of the Moroccan blends. \n\nMost of the brunch dishes range in the 11-16 dollar range. I tried the Country Quiche, which I was a little disappointing, because it did not have too much of a taste of anything. It seems as if the smoked bacon was left out of the quiche. I had to add a lot of salt and pepper to the dish, because it tasted like air. Aside from the dish, I really enjoyed my Brooklyn Beauty cocktail, which contains my two loves, gin and \"bubbles\" (prosecco). \n\nBased on some of the previous reviews, I did not have an issue with the service at Brooklyn Heights Wine Bar \u0026 Kitchen.\n\nI would give this place another shot, because of its extensive cocktail menu, which has mostly gin- and whiskey-based beverages. Hell, I may even through another glass (or three) of wine to that mix.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "SO happy I stumbled upon this place. \nHappy hour beer and wine priced at $6!\nSmall plates were great.\nOne of the best burgers I've ever had- didn't even have to add ketchup or anything. Seasoned and cooked to perfection. \nDishes came out in a timely fashion \u0026 the waitress was so kind!", "author": "Angela Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-22", "description": "I'm sad to leave this review since the first time my boyfriend and I really loved it. A few months ago we stopped in, sat at the bar and had a drink and the lamb meatballs and they were great. Tonight we decided to go back and split the meatballs, the flank steak crudo, and Bibb lettuce salad. The steak crudo was tasty. The salad had very little flavor and minimal ingredients for the price but was fresh. The meatballs were... bad. They were tough and dry and over cooked and the sauce we enjoyed so much the first time was bitter and needed about half the salt shaker. We were both very disappointed this time around and are unsure we'll return for a third try.", "author": "Rebecca B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-12", "description": "This was our saving grace for a wine \u0026 dessert on a Friday night date night. Wonderful wine list with a variety of varietals and price points. Dessert choices were just the right amount of options and all sounded delicious. We had a Shiraz and the heath bar ice cream cake, yummy", "author": "Katie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "I have had some excellent food here and some mediocre food here.  I give four stars because even the mediocre meal was an extremely pleasant and unpretentious.  The pozole, devils on horseback, French fries, Cobb salad, and chicken walnut salad were all excellent.  The charcuterie was not.", "author": "nina r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Awesome place with great atmosphere, but the bartender is the main reason for the high grade. Helped us with tips for what to do in Brooklyn and even googled the ferry route in Brooklyn for us!", "author": "Niina T."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Brooklyn Heights Wine Bar \u0026 Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "50 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/1SEX9lzOMyH5qMKWJ-1kUg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555595"}