{"aggregateRating": {"reviewCount": 186, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-06", "description": "a very cute corner restaurant in BK heights - a great place to sit outside and enjoy the air! we had some drinks and was seduced by this amazing smelling dish the ladies behind us were having (it was a baked fish dish that came out bubbling) the smell was so intoxicating, but sadly the dish itself was flavorless and dry. still, their drinks were good and the service was alright. i'd like to come back and try another dish, but i'd be ok to just sit down and drink here too.", "author": "Dianne R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-13", "description": "My goat cheese salad and entre were great. Low stars for preparation time esp here where the menu is not complicated.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "My friend and I were wandering around looking for a place to eat and the menu for this place seemed both interesting and inexpensive. I ordered the Shaved Brussels Sprouts and the Bacon Almonds. She ordered a dates and a stew. We both enjoyed our dishes immensely. I have some friends visiting from out of town soon and I will definitely be bringing them to the wine bar.", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-10", "description": "Lunch was great, but the barman was handling ALL the tables so don't go if you expect to be in and out quick.  Sandwich and gazpacho were superb!", "author": "Jon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Waitress was excellent. She handled our large party superbly and in good spirits, including splitting our checks and knowing when to bring us more food and drinks.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-11", "description": "This is the closest wine bar within walking distance to downtown Brooklyn.  The bar tender is fantastic and the food is pretty good.  The burger is the best thing I've tried so far.  The wines are okay, but if you're looking for a cocktail, have Brad fix you up something nice...he has a great selection of spirits.  Haven't sat at a table yet, but based on the other reviews, don't think I want to as my experience at the bar has been flawless.  Like this place a lot.", "author": "Patrick D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-20", "description": "My biggest complaint about this place is the price vs. the quality.  This is the main reason for the two stars; had the price been comparable to the quality of the food I would have given it 3 stars.  \n\nThe place is cute and they have nice outdoor space on lovely Henry street.  The waiter we had was very friendly and knew how to sell us food--which is a good thing.\n\nWe ordered the cheese plate (3) cheeses, a white bean and lemon crostini and an olive tapanade crostini.  Also the country pate, a black bean soup, and a chicken crepe.  \n\nThe cheese plate was so small for 15 dollars.  It was on a huge platter with a very small portion of cheese.  Taste was good; The country pate was also good-- The crostini was not very tasty.  Tasted like it came from a can. \n\nAll and all, the food was pretty average, but we ended up spending almost 90 dollars for all of that and 1 glass of wine.", "author": "emily m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-04", "description": "A friend and I stopped in on a Sunday afternoon to have a glass of wine.  The bartender could not be bothered.  He was the only wait-person working, covering a couple of tables on the sidewalk and inside and he made it clear that we were just another VERY TIRESOME inconvenience.  \n\nMr. Bartender if you are reading this, I work at an investment bank in midtown and we are hiring for data entry.  Please send me your resume.  You'd be a great for the job, and you would live a more peaceful and satisfying life.", "author": "Collen M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-18", "description": "So, does success make you snooty?  The bar tender was aloof and acted like he was in some hotsy totsy manhattan joint when, in fact, he was in the nicest zip in NYC.  First he poured (a little bit) of water on me and then he acted like I was a total rube when I mistakenly ordered the Reisling thinking it was a DRY Reisling and not that syrupy stuff that tastes like cough medicine.  The wait staff looked anxious.  Maybe it was an off day??", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-24", "description": "The food here is o.k. but the wine is great. Lots of varieties and carafe and bottle options also available. I wasn't a huge fan of the brunch as it was overly buttery/greasy but every time I've had dinner here it has been fine. Nice atmosphere for a date or for a smaller group get together.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "I didn't eat here yet but the menu looks good. I stopped in on a spring afternoon to have a glass of wine while I was waiting for someone in the neighborhood.  Salama was the server/bartender and she was AMAZING!!  The wine she recommended was exactly what I had described that I was in the mood for, service couldn't have been more friendly and the ambience was great!  I will definitely be back to try the food.", "author": "Spencer S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-27", "description": "So underwhelming. Came when JTH couldn't accommodate us and totally wish we had just waited the 1 1/2 hours. Terrible service, airplane quality food, and they added 20% gratuity for our 5 top for the privilege.", "author": "Chelsea G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "love this place, great add to the neighborhood!\n\nit is a very friendly staff and they have a nice selection of wines. there is also a very nice veggie appetizer... however, while the presentation of the vegetables on this dish are lovely, but the cheese sauce over it would look better imho if it didn't look like it came out of a squeeze bottle. maybe more of an organic drizzle?\n\nand plus i love gabriel bryne, who i saw with my bf the last time i was there. beyond handsome!", "author": "Kenna T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-08", "description": "i came here for drinks with some friends. they have a fairly good list of wines, but nothing spectacular. the prices are ridiculously inflated, but hey - it's a wine bar. i only know this because you can find quite a few of their bottles in a liquor store for way cheaper. it wasn't terrible, but it's nothing special.", "author": "Jen C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-23", "description": "I live in this area and love this little place BUT the bartender is, simply put, a jerk. The last two times I have been in there he has really put me off the place. This kind of a restaurant isn't a good fit for his personalty. The last time I was there ( and it will also be the last time I go in if he is there) it was quite crowded- a large group of about 20 people came in and the place was jumping and lively. He asked my friend and I to stop talking as loudly as we were- and we were not speaking any louder than anyone else in the place.  Truly. And if we were yelling at the top of our lungs and should have been asked to keep it down, there is a way to speak to customers/people- and he doesnt' know how to do that.", "author": "Derval W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-19", "description": "I wandered in here with a friend on a Saturday evening. We were very impressed with the wine list and the cocktail menu. We shared a half a carafe of wine and enjoyed the atmosphere. We sat at the bar and shared some great conversation while interesting music played. The bartender was friendly and attentive. My friend and I both agreed that this would be a great date spot. It's easy to feel relaxed here and there is an intimate vibe.  I definitely plan on coming back and trying one of the cocktails. Brooklyn Heights Wine Bar is a nice addition to the area.", "author": "Becca C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-11", "description": "Have been there a few times despite mediocre experiences. Guess I feel committed to supporting this place as BK Heights has such a dearth of options. Was disappointed that they don't stock even one type of Moscato and that that a pasta dish I had was mediocre frozen food at best.\n\nToday, however, really just put a pin in my desire to ever go there again. Came in for brunch. There were about 6 people there when I arrived and 2 waitresses. It took over 7 minutes just to get a cup of coffee. 30 or so minutes later my eggs and bacon were still just a figment of my imagination while the couple next to me who arrived after me had managed to scarf down appetizers and receive their london broil and burgers (and we all know it takes longer to make a burger than some eggs). Most disturbingly, my waitress didn't seem to notice or care that I was the only one sitting there without food. When I asked her for status she said it was \"coming right out\" very dismissively as she proceeded to chit-chat with a table of 6 or so men who had just come in. When she finally did inquire about status from the kitchen, she and I both learned that my food was far from \"coming right out\" because my order somehow never made it into the computer. She then argued with me that the wait was only 15 minutes rather than 35 (trust the hungry person on this one, folks it was 35). She said the food would be made right away (clearly that statement held little credibility at this point). Didn't even offer a piece of bread to soothe the trash compactor that was my stomach rumbling and encourage me to stay. I got up and left hungry after 40 minutes of nothing. She did comp my cup of coffee.   \n\nNever again. Note to restaurant owners. Service will make or break you. Get it together. We can't care about establishments that don't care about us.", "author": "Milly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-11", "description": "Amazing service. Brought kids during prime business hours and she accommodated our many requests with a smile. The food was great and the wine was pretty good. Nice atmosphere. Tough to find experiences like that in Brooklyn.", "author": "Jamin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-23", "description": "New to Brooklyn, but not to wine bars...this is a great place with some very cool \"hand crafted\" cocktails. Mac the bartender was great and created something specail after talking. Ask for the \"La Strada\" if you are a bourbon fan. Cool place in a great little part of Brooklyn.", "author": "M T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-08", "description": "Stopped in after a long walk on the waterfront.  It's charming enough, and unpretentious, but the food is mediocre, and a few of the (mostly tapas) dishes were poor. The waitstaff is friendly but amateurish. The woman serving our table splashed my drink all over the patatas bravas and the table--she clearly noticed, but let me clean it up, and never brought out a new dish of food. \n\nStill, it was a sunny day, the place was full of smiling people, and I couldn't find it in me to be upset. If you just want a drink and a good vibe, it'll suffice. If you're looking for anything more, keep walking...", "author": "Stephen M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Brooklyn Heights Wine Bar \u0026 Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "50 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/1SEX9lzOMyH5qMKWJ-1kUg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555595"}