{"aggregateRating": {"reviewCount": 5, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-26", "description": "The pizza's not as good as I remember anymore. :(\n\nThe crust is still crispy, but the cheese and grease have transformed into a goopy, dripping mess. So much in fact that it masks what I remember being a distinctive and tasty sauce. This is now a mediocre slice of pizza at best; it basically gets the job done and that's about it.\n\nStill, it's only $4 for two cheese slices and a fountain drink, and unlike the $5 for 2 slice + free drink deal all over midtown, it *actually* is $4. The midtown joints tack on \"sales tax\" (though I've ordered one slice for $2.50 many times and I've never run into this tax), which jump it up to $5.44. $4 for 2 decently sized slices and a fountain soda is fine for a cheap lunch option in this area.", "author": "Shea D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-15", "description": "They now use biscuits to go along with their fried chicken.  In addition, with Popeyes now shut down, they are the only game in town.....on Willoughby.\n\nThey won the game.", "author": "Ken Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-17", "description": "This place really should be a one star. It's really not that great. We're talking the lowest common denominator in terms of food, even big fast food chains take more care with their cooking. Their fries are especially awful. But, it's a hard working business that in this area, it's good that is very close to home and one of the few businesses (especially food) that's open 7 days a week around here, so at least the two stars going for it is fair.\n\nThe reason why this place gets 3 stars is simply because of a couple items on the menu: the \"spicy chicken sandwich\", the \"chicken strips\", and the shrimp fritters.\n\nThere's a better cheap fish and chips place on the next block; these guys used the frozen processed kind, they weren't shy about it. \n\nBut first, let's take a look at the look of the joint. It's really a joint is what it is; dirty tables, one long counter with some of the worst looking pizza ever, and a back kitchen that begs you to lean in and see if there's something shady going on. Sometimes, the grill man doesn't know how to cook something, so the cashier guy/manager will tell him how.\n\nThere's neon lights, and lots of \"specials\" strewn up on the somewhat confusing menu. \n\nThe spicy chicken sandwich is interesting; it's basically a Jr. Whopper from BK, there's pickles, mayo, ketchup, and a fairly tasty but not that spicy chicken piece. \n\nThe chicken strips are probably the safest bet if they don't overcook it, just like any other chicken strips: good.\n\nThe shrimp fritters aren't even that good, but they give you what seems to be a whole pound of these baby shrimp in  really stale fried/breaded cocoons. So take a particular sauce, whether tartar or hot sauce, or a little soy sauce (I put that in everything) and eat away. You'll feel like crap the next few hours, but hey it's only about 6 bucks.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-13", "description": "I had the $4 special, two slices and a medium fountain drink.  Not bad at first glance.\n\nOverall, a very very poor slice of Pizza.  The sauce and cheese ranked from palatable to good.  The Pizza itself was undercooked; the dough wasn't cooked all the way through.  The level of grease was overwhelming as well.  There may have been more grease than sauce.  I highly recommend skipping the pizza.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-27", "description": "First you would have to ignore the army of rats that run around outside at night in front of this place.  I am not exaggerating - I walk by here all the time and usually see at least two rats.  Second the service is whack - unless you speak spanish.  Third the food - the best I can say is that I have had worse pizza in St. Louis.  Pizza is fine if you are desperate.  I have to admit I have not ventured out to try the other things - like the headliner fried chicken - but I don't think I am missing anything.  Lastly - a place like this needs to stay open late - but it closes before midnight maybe even 11pm on a weekend.  Booo.", "author": "David C."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Texas Fried Chicken", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "136 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/6t_eTfrtDz51uMuhLGS7iQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188751960"}