{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "Their pizza tastes good.  They have a good selection of pizzas as well as other dishes that are reasonably priced.  They also get dibs for having access to a restroom which could be a search when you're in NYC.  \n\nA funny thing that happened there once.  So I'm paying for a slice of pizza, and the guy (not from the U.S.) who's taking my money did not think the quarter I gave him was acceptable.  He probably was used to the old eagle-backed quarters, and the newest quarter has a state shown the back.  So I tell him what state is on the back and then ask him to tell me the 2 non-contiguous U.S. states.  Embarrassed by this, his colleague apologized to me.  I was not offended, but I did want to bust that guy's bubble for the heck of it.  \n\nAnd I still get pizza there when I'm in the area.", "author": "Daryl H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "Love this pizza,  this sauce is the real deal.  It's kinda gassy definitely not gluten free!", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-22", "description": "I'm going to keep this short. \n\nThe pizza is really good and they know it - $2.75 for a plain slice. Everything else is a bit more. \n\nThere isn't a ton of seating but just enough if you really want to stay. The guys here are friendly enough. \n\nMaybe I've just been eating average pizza in Brooklyn...or maybe Not Ray's is not bad.", "author": "Morgen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-19", "description": "I wasn't hungry until I saw a woman exiting Not Ray's Pizza with a \"fresh mozzarella\" slice. My eyes triggered my brain to bypass my already-full stomach, and eat.\n\nAfter paying $3.50 plus $1 for water, I waited for my slice to exit the oven. While I sat I watched the employees at Not Ray's attend to the pies behind the glass with an extreme attention to detail - Constantly repositioning them to be closest to the customer, wiping the excess cheese and crumbs off the counter, and addressing customers as soon as they walked through the door which, all looked promising for a quality slice.\n\nAfter I snapped my obligatory pics, I took my first bite, and immediately noticed the lack of a \"crunch\". The crust had properties similar to a regular slice of bread, rather than a toasted one. Maybe that's a poor example, but it really didn't have the pop I was looking for.\n\nWith that said, there was great flavor coming from the specks of oregano scattered throughout the sauce, and a not-too-oily sheen from the melted mozzarella cheese. The slice had great flavor, especially when I came across the pieces of fresh basil.\n\nAfter I finished eating, I cleaned up my table and heard my favorite sound - A fresh pie landed onto the aluminum discs. Now, I had to get another.\n\nThe plain slice shared many of the same properties as the fresh mozz slice, including the lack-luster crust. The plain though, somehow, tasted better. Not because of how fresh it was (though it always helps), but perhaps the combination of the oregano and whatever mozzarella cheese they used. I enjoyed it very much.\n\nNot Ray's is clearly trying to set themselves apart within their name, but unfortunately, the only distinction I could make was the attention to detail in the restaurant itself, and not the pizza.", "author": "Mike R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-08", "description": "\"I want some salt for my pizza.\" \n\nA phrase I've never said before eating a pie delivered from Not Ray's. The slice in question was the pesto white. Not a trace of pesto to be tasted and shockingly bland ricotta and mozzarella cheese made for a lackluster pizza at best. Add some blah dough into the mix and you've got an appetite wanting for more.\n\nThe lasagna slice was definitely better. A smattering of meat sauce, cheese, and fresh basil sloppily cover well-cooked (but still taste-less) pizza dough. \n\nSausage calzone? A solid 6 out of 10 -- which doesn't say much. Mildly flavorful sausage and not nearly enough cheese is stuffed into mediocre bread. At least it was better than the pesto white disappointment. \n\nI'd go to Not Ray's only if you're close by and too lazy to walk to a different pizzeria or if you want a reasonably priced pie and don't care much about taste.", "author": "Samantha B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-05", "description": "On a lazy Monday afternoon, a curious gentleman with an unhealthily large appetite wandered along Fulton Street. \n\nHe stepped into Not Ray's Pizza, and carefully perused the available items, selecting the buffalo chicken slice since it looked the freshest out of the pizza sitting in the display case. He quietly paid the $4.75 that was asked of him for the slice and a bottle of Poland Spring. He sat down in the window, took a bite of his pizza, and deemed it passable.\n\nSoon after, a girl in her late teens walked in with a friend. She pointed at our hero's slice and said, \"I want that, but I only have $3.75. And I want a lemonade too.\" \n\nIn a thick Russian accent, the guy behind the counter agreed he would give her a special price. \n\nOur hero shook his head sadly and thought, \"Is it possible I'm not as cute as I think I am?\"", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "This is what NY pizza should taste like. \nUsed to be on the corner before they sold their soul to Habana Outpost.......nonetheless it's a perfect combination of cheese and sauce.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-14", "description": "The portions are huge. One slice is definitely filling unless you are a ravenous animal. I tried the meat stuffed pizza...but honestly, I thought the taste was average. It wasn't bad, but definitely not memorable.", "author": "Joy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "My pizza was amazing! I had the buffalo chicken pizza. The fruit punch is just like mom used to make. The service was great and fast. The restaurant is small, but it was clean and had a good vibe.", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "I've been eating their pizza for about 1 year now. I love it. Anytime I'm in Brooklyn and I'm craving pizza I always spot by and grab at least 3 slices. \n\nTheir service is dope. \n\nWhat is a must is their Sicilian slices!", "author": "Steve M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "I like this place a lot. Really great pizza you can get by the slice or a whole pie. Friendly staff and good slices with a lot of topping options. Highly recommended.", "author": "Paul F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "Best pizza hands down. I have been coming here for years ; rather all my life and I have never been disappointed. Incredible staff and excellent service.", "author": "Jane D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-26", "description": "Veggie slice is what calls me to this place! Been coming here over 15 years and used to get a regular slice with large fruit punch! Fast forward a few years and Not Rays started offering veggie slices. Okay I said to myself let me try this out.  For starters it just looks appetizing! Not like some pizzerias who put the whole brocolli stalk, half shaped onions and sliced tomatoes to the top of the pizza.  Oh no!, this pizza  has finely chopped broccoli, onion and tomatoes on top of cheese slice! With every bite you get a perfect balance of vegetables.  It's so healthy and sooooooooo good! Try this slice and I am sure you will want more than one! \nNow I just order a whole pie and all that is not eaten gets wrapped and put in the freezer! These veggie slices freeze well too! If in the area, check out the veggie slice at Not Rays, I am telling you that you will not be disappointed!  *~*", "author": "Amy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "As a lifelong Brooklynite I've had my share of pizza and have also had what I can easily declare as a perfect \"Brooklyn Slice.\"\n\nNow, Not Ray's does not make a perfect \"Brooklyn Slice\", however, what they do specialize in is just as important to me:  great taste and cleanliness!\n\nTheir pizza is consistently on-point with taste.  The specialty slices to me are even better than shops that charge two times as much. The (I don't remember the name) square one with diced tomatoes and onions is one of the best tasting pieces of pizza I've ever had.  Hands down. And the regular slice is really satisfying.  The staff is also genial and they work quickly and pretty in synch, which is cool to see. The guy serving you doesn't take your money (see: clean) and even the occasional time he does, he's very cognizant of not laying a finger on your slice(s). Thank you.  \n\nBut the best part about Not Ray's is how they make you smell it inside the C Train station.  \"I was thinking of going to Subway, but....\"  You end up following the scent of tasty pizza and flying on air toward it like you're in a Looney Tunes cartoon So dope.  How do they do that?!?!?", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-05", "description": "Ordered two pies for delivery. It came promptly but the pizza was fairly average. I've lived in NYC most of my life and don't come across bad pizza spots open. The pies reminded me of pizza you'd find out of state. The pictures from the pizza you find at the actually restaurant looks really different then what we ordered.", "author": "Samantha K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "Decent pizza...par for NYC in my opinion.  Not much seating but most patrons seem to get their food to go.  If you want a slice and you are nearby don't think this would be a bad option.  Stuffed meat is my favorite slice.", "author": "Curtiss M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "Stopped in for a snack while out shopping. Grabbed a slice of the stuffed meat pizza to go. Couple things I loved about it was the quality of the ingredients and also the crispiness of the crust. I love it when it's nice and crunchy, but not to point where it's hard, so plus for that one. \n\nThe only downside really was that it was an average sized slice of pizza but $4. Given it's a meat pizza, but still, a little more than I would like to pay. If your in neighborhood, definitely check it out, but not worth making a trip out of it.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "13 years ago  I started my HS career (man I feel so old saying that). And Not Ray's was the place to go to afterschool. It was the hang out spot. Awesome slices and hanging out with your friends.\n\nFast forward to present day, a not so young yet nostalgic man steps foot through the doors (which by the way have moved a few doors down). That stuffed meat slice looking as meaty and powerful as ever, but this time...this time my eyes were attracted to the spicy buffalo chicken pizza. It looked so good, I could barely even contain myself. But wait, there's more....the hungry brother that I am decided to add pepperoni to that bad boy.On the side, I ordered up a large mix like the good ol' days. That's a mix of lemonade and fruit punch from the juice machine.\n\nWhen my food was ready and I took that first bite, it took every bit of energy within my body to hold back the tears. Best pizza in Brooklyn to this day. Too good to be true. The crust was perfect, the cheese to sauce ratio was perfect, the chicken was perfect and there was the right blend of buffalo sauce and cheese sauce on it to make any man bow. Coupled with the refreshing flavor of that mix....orgasmic.\n\nIf you want a true foodie experience, go here. Maybe around 1pm or so when there should be some fresh pies, hot and ready", "author": "Clyde N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "This pizza is super awesome! I remember first moving here and this being one of the first places I tried... It's still a top contender 4 years later!", "author": "George B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-05", "description": "Not Ray's has a great selection of pizza. They always have a dangerously loaded meat lovers pizza that hits the spot and some fresh parm to top it off. Very relaxed vibe and good for a quick slice.", "author": "Michael F."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Not Ray’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wcqsf8nGMdK1W6nQDqM0Mw/ls.jpg", "@type": "Restaurant", "telephone": "+17183302400"}