{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "I was raised on Not Ray's, so clearly I'm biased.  Def not best in the city... not even BK, but still authentic NYC pizza that makes me miss the quitessential NY cuisine.\n \nI've been living out of NY for a while, so I haven't been to Ray's in a while, and I'm sure it's filled w/ yuppies that have been invading Brooklyn... but still, 5 star worthy pizza.", "author": "Jus A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-18", "description": "I used to love you.  Then you went cheaper on your ingredients. Now I just like you.", "author": "Senor D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "5 out of the 6 of us liked it, I was in the group of likes.  Not your typical NY slice, but it was very good pizza.  Thin with a crispy crust that made it a lil hard to fold over and eat.  A slice of pep, sausage, and shrooms did it for me.  Plenty to choose from in the case.", "author": "Tawheed H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "look, i live down the street from di fara's. i know about the ultimate pizza experience. but you don't always need \"the ultimate experience\", nor do you have time in your goddamn day for it. not ray's is classic new york pizza done right. the meat slice is too much for me, even though i keep forgetting and ordering it anyway (twice now), but a regular slice at 2.75 in 2015 brooklyn is a fine lunch. the days of 50 cent dogs and dollar slices are gone, people, and pizzerias gotta pay rent too.", "author": "Carla B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "This is by far the bet pizza place I've ever had. Someone please let me know if you know somewhere else that can top this.\nMy boyfriend, my cousin, and I were walking from the Brooklyn Flea Market in Fort Greene to the Brooklyn Museum to see the Keith Haring Exhibit (which the museum itself is five stars) but that's a different review. \nWe came across a pizza place where the line was out the door. And people were piling in, coming out, all with a box or at least one paper plate drenched with an oversized slice of pizza. That was the cheesiest, best mushroom pizza, with the best dough and best crust I have ever tasted. Hands down. \nEven when we were passing though, people would say, hey you got Not Ray's Pizza. And you could see that the place was popular because there were pizza traces of cheese and paper plates in garbage bags on sticking out of trash cans. The pizza is amazing. Must be a neighborhood delight and not a secret at all from that line!", "author": "Jacqueline L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "1) On the name (for out of towners): every other block in Manhattan has a pizza joint called \"Original famous Ray's pizza\" or \"Famous original Ray's pizza\" or \"The real Ray's pizza.\" So, the Russian flavor-mobsters who run this place called it \"Not Ray's Pizza.\" You have to appreciate this bit of manufactured irony.\n\n2) On the decor: the wall is covered with pictures of actual famous Rays. Ray Charles, Sugar Ray Leonard, Ray Liotta...they're all there. Those are the only famous Rays you'll find here, watching you from the walls rather than coming from the oven. If you don't appreciate this bit of manufactured irony, then you're not invited to my parties. Any of them.\n\n3) On the pizza: delicious and satisfying. Nothing ironic about it at all. I like it a lot. I heartily recommend it to any person in any circumstance. Except maybe Obama when planning a state dinner. But everyone else, go getcha sum Not Ray's.\n\n4) On the stars: Pizza is one of those foods that is easy to make poorly, harder to make well, and nearly impossible to make spectacular. Witness the proliferation of Dominos' and Pizza Hut; REAL Pizza places should be able to sue for what they've done to the average American's concept of Pizza. In Santa Barbara where I lived for a few years, locals buy a round baked disc called Rusty's pizza, slurp off the sugary tomato paste and bland cheese, and then dip the crust edges into ranch dressing; this they call \"pizza.\" Gives me the jibblies just remembering it.\n\nOn the other hand, a few places like Not Ray's make flavorful, satisfying, damn solid pizza. I give them four stars because although I've never had five-star pizza, I have to believe that it exists out there, somewhere. I think I may have had it in Bay Ridge once; but that was a long, long time ago, in a galaxy far, far away.", "author": "Bo B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-09", "description": "I haven't had any of their specialty pizzas (yet), although mozzarella has tempted me quite a few times.\n\nVery fast delivery, pizza still piping hot. I agree with Allison N. This is what NYC pizza is about. No frills, decent prices, solid all around. Definitely a \"go-to\" pizza joint in the area.", "author": "Juliet C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-08", "description": "The basics are pretty mediocre, the cheese slice and the pepperoni slice are okay if you need pizza and there's nothing else around. \n\nThe specialty pizzas are pretty good, though. The loaded meat pizza, and the chicken pizzas were both pretty fantastic. \n\nbut not getting the basics right really drags the place down, unfortunately. Still, go with the specialty pies and it's all good.", "author": "Bryon B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-31", "description": "Not impressed by the stuffed meat slice, but the buffalo chicken and plain cheese are both the best in the neighborhood. Slightly too pricey per slice though.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "This is a recent discovery for me but soo good! The pizza is thin and crispy. Best I've ever had, seriously go there asap!", "author": "Yinette T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-04", "description": "Decent pizza... Nothing special... Small place... $2.75 for a plain slice...", "author": "Mr F G And Mrs M S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-15", "description": "This has been my spot for years.. Back in my Bishop Loughlin days.... every other day me and my crew would come in for a bite for two. Not Ray's..... I enjoy their food. not over the top just simple delicious Pizza.. Rolls.. Whatever.. I'd definitely recommend them to you and yours.", "author": "Dre D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "Been going here for years and what amazes me is how that the  taste of the food  has stayed the same. While many business lose their taste after like a couple of months, not rays. Been going to Rays when their slices of pizza where a dollar which was like in the 90s and now their close to 3.00 but worth it though. The place is always in pretty neat shape, never any notice of bugs or dirt and grim around. The food like I already mentioned is good and the service is great to. This Not Ray's here on 690 Fulton St. get 4 Stars from me. I am right around the corner from them and as I am writing this, may just stop by for a slice later.", "author": "Curtis E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-25", "description": "Vinnies Pizza (bedford and N9th) is my favorite pizza place in the world, But \"Not Rays\" Crowns my favorite slice in the world: The \"Veggie Slice.\" A perfect combination of cheese, crust, broccoli, olives, and everything else that I can't remember right now. Every slice this place makes is Great. Excellent Sauce and Dough, this place has it Down!\nAnd Seriously... how awesome is it that their place is called \"Not Rays.\"\nInteresting fact: That Ethnic looking White dude that serves you pizza at any pizzeria in New York City.... Most likely they're not Italian, but in fact Albanian.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-15", "description": "Great place to grab a slice if you live nearby or are just passing by. For pizza in this area, you really couldn't do any better. However, I once heard someone saying that they come to this neighborhood just to go to Not Ray's, and that is the craziest F-ing thing I have ever heard. \n\nDon't get me wrong though, this is delicious pizza, if a bit greasy.  I do have to do my useless moaning that I remember the day when a plain slice cost like a buck twenty-five here, and now it's like twice that, but they're hardly alone in raising their prices. In light of that though, the stuffed meat slice is my choice more often than ever. You can get a couple small meals out of that monster and now it barely costs more than a slice of plain. The square pizza and the garlic knots are good as well.\n\nThe employees are all definitely guys you can easily picture saying things like \"hey\" and \"yo\" but they're really all pretty nice.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-21", "description": "My go-to place in Fort Greene.  It's not the greatest but definitely does the job.", "author": "John R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-18", "description": "I called the restaurant to ask about their gluten free crust. I have food allergies, for instance to soy and rice, which are common ingredients in gluten free bread products. I needed know what was in the crust. When I asked the guy who picked up the phone what was in the gluten free pizza, he said \"sauce and cheese.\" When I clarified that I meant the crust, he said, \"Oh. I don't know. We buy it.\" I asked if there was a box with the ingredients listed and he said \"I don't know. No. We only do one size.\" Then he started asking me about a different kind of pizza. Asked if I wanted one. I said \"I have a gluten allergy--\" and he cut me off saying, \"oh we have gluten free pizza.\" It was like he was stoned. \"And you can't tell me the ingredients?\" \"No. Do you want one?\" It sucks that a restaurant that accommodates its customers' dietary restrictions can't tell those customers if they are about to consume allergens. I bet I missed out on a good pizza, but I guess I'll never know.", "author": "Courtney M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-17", "description": "I was excited not only by the reviews on Yelp but also by the AMAZING smell that lures you to this pizzeria as soon as you step in (or out into) the Lafayette C-train station. \nI had a cheese slice and was unimpressed.", "author": "Mauricio A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-18", "description": "There tag line is...\n\nA Crust you can Trust...\n     A Cheese that will Please...\n\nFor years I have listened to folks go on and on about how much NYC slice is better than basically anyplace else in these here United States...and after my most recent visit I guess I have to agree. Not rays seems to be on the low end of the spectrum as far as the NYC slice goes but it's still pretty impressive as compared to anything I've had in SF or any place else for that matter. Simple is almost always better and a cheese slice always the true test.  Not Ray's was the perfect combination of just enough mozzarella covering a super savory tomato sauce. Unfortunately it was missing that particular level of grease that should always be a part of the experience. If you're ever around the way you should stop in. \n\n\nDOSE", "author": "Mingus R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-14", "description": "Its a hole in the way place with no atmosphere to speak of but its the best pizza you will find iin this area.  I had the whole wheat veggie, a healthy but yummy option for this gal watching her figure.  It doesn't have cheese though so pile on the hot pepper for taste!  At $3.50 a slice I'd say its a little overpriced.   My bf got the stuffed meat slice, which at $4 and change is a real bang for your Buck.  I had a bit and it was amazing, piled high with meat and cheese melted together...it suffices as a meal for sure.  If you're in the neighborhood def worth a try!", "author": "Kristin G."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Not Ray’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wcqsf8nGMdK1W6nQDqM0Mw/ls.jpg", "@type": "Restaurant", "telephone": "+17183302400"}