{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "I love a white slice and this slice was yummy. I like my slices really hot I should have told them to make it well done but it was a nice yummy slice", "author": "Untouchable B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-13", "description": "Not the best slice, but definitely worth checking out if nothing else is open (though that's hard to believe). Gino's on Flatbush is better. Luigi's by the park is way better. Pizza Town on 5th is slightly better. And of course, Artichoke is Artichoke.\n\nThey really need to keep their slices in the oven much longer though. Nothing like getting a slice loaded with toppings and having it come out lukewarm.\n\nGrandma slice is fine. Veggie slice is meh.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Rays is a good pizza joint. If your looking for a cheap place to grab a slice or some garlic knots near Atlantic Barclays Center this is your place.", "author": "Vicki G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-02", "description": "The pizza is great,  but they constantly forget parts of our order. Sometimes they come back and bring the rest, sometimes they don't and we have to hunt down a refund. The rating would be higher if they could maintain any sort of consistency.", "author": "Adam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "I was hosting a Meeting of 20 managers and needed to feed them. I went to Yelp and found \"Not Rays\" not to far from the office. When I went in it was small but the employees were nice. They took our order of six pies and said it would be there at 12pm. The price was also great because it was cheaper then I expected. Back at the office, sure enough the pies came two minutes before 12pm. I was truly impressed with that. When the managers came down the pizza was gone quick. Everyone asked where we got it because it was really good. I loved the lasagna slice very much. I will go back from time to time during lunch breaks. I feel it was good enough and the staff was amazing enough to get more of my business.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "Small place but with really good slides. Their grandma slide has a fantastic crust and super flavorful, while their lasagna slide was delicious. The place oozes of personality and I recommend stopping in an enjoy their pies", "author": "Javier M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Excellent pizza! We tried many slices because they all looked so good. In order 1. Veggie 2. Mozzarella 3. White 4. Stuffed meat 5. Pepperoni the garlic knots were excellent. We had our pizza delivered by grub hub to our hotel in Brooklyn. It was super fast and fresh!", "author": "Trish L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "Not Rays Pizza\nNY BK Fort Greene\n6pm Thursday 17th November 2016\nFour Stars\n\nI love the hate in the name. This pizza place was busy with limited seating and good pizza.  I had the lasagna slice ($3.75). It had crispy bottom, salty sausage, ricotta, sweet \u0026 fresh tomato sauce and lot of herbs.  It was delicious.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-08", "description": "The stuffed meat pizza looked impressively large in the box, but unfortunately there wasn't much there! The veneer of a carnivore's dream was dashed midst 2 slices of quite sub-ordinary bread that was quite honestly empty. Most definitely not worth the calories...  a few bits hidden here and there in the middle but nothing to write home about... I'm throwing out 3/4 of the pie... Need I say more? Quite disappointed...", "author": "Edward E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "This is one of Brooklyn's best pizza spots. The reg slices are the best. The whole wheat veggie pizza is really good. Try both with extra cheese. Service was nice and fast as well.", "author": "New Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-04", "description": "Decent pizza. Ordered a large \"Not Ray's\" pizza and the crust was burnt and inedible around most of the pizza. The cheese was good, and while the meat toppings were okay, the vegetables seemed to have been dropped onto the pizza in large, overpowering clumps. Not cheap, I will probably not return.", "author": "Ian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Ordered some Pizza from here recently and i can consider myself a fan. Got some fresh mozzarella and it was really really good. I can see myself ordering from here whenever I'm in the neighborhood.", "author": "Nic P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "My favorite slices are the lasagna slice and the white (blanco) slice. It's like eating a open faced grilled cheese, only more indulgent with the fluffy ricotta and crispy crust", "author": "Raine O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-11", "description": "Of course it's a hilarious name, but Not Ray's is nothing more than an average place for a slice of pizza. But as the old saying goes, like sex... even bad pizza isn't all that terrible.\n\nThey have all the classic slices you expect to find; white stone, pepperoni, square Sicilian, etc... I think they're a bit on the steep side at $3.50/slice, but maybe I'm crazy and have no idea what I'm talking about. But for a quick, cheap meal, it's just fine. \n\nRay's or Not Ray's, I'd still take any of it over Papa John's. Eff off, Peyton Manning!", "author": "Ruggy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Most New York slice pizza is growing on me. \nOn this occasion it was a tad too salty but I'm guessing it was more the pepperoni to blame than the ingredients in the dough. \n\nTheir shop is clean, service is awesome and their yelp sticker says we love them. What more can you ask for?\n\nThe End", "author": "Freeyah-Knycky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "This Gem located in downtown Brooklyn is a must-go. \nWhat I love about Not Rays Pizza: Right balance of oil (not so much, but still enough to call it a New York slice), different authentic toppings (almost every pre-prep pizza I've tasted had a burst of spices, flavors you can't find everywhere), STUFFED MEAT SLICE IS #1 for any carnivore lover. It's convient to get to, it's about a 5 min walk from Atlantic terminal/ Barclay Center 2,3,4,5,B,Q,N,R,D \u0026 LIRR and Layafette on the C train. Other slices I've tried plain, lasagna slice, STUFFED MEAT SLICE IS #1, mozzarella slice and I've enjoyed them all. Try them out whenever your around the area. Can't beat the prices for these miracle slices!", "author": "Keona D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Decent NYC pizza \nI've ordered in from here a few times and the pizza has been consistently good\nDelivery is quick food is hot", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "~ This pizza parlor has exceptional pizza. Honestly, this pizza was the best pizza I have ever tasted. The crust was extraordinary with a variety of pizza types to choose from. Anyone In the area should visit this pizza place.", "author": "Hayes C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-19", "description": "I would advise anyone not to go to this pizzeria. Met the owner and he was very condescending and harsh. He was not attentive when ordering and made fun of my ethnicity.\n\nIn regards to the pizza, it was average at best. All I got was a plain slice and it was too greasy for my taste.\n\nI would never go back there and will tell everyone in Brooklyn to stay away from this pizzeria. Owners shouldn't be acting this way to their customers.", "author": "Roberto J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Awesome local spot. I make a point to visit every time I'm close by. I always order a green slice and a cheese. I appreciate the cleanliness and the staff is really friendly. If I had one suggestion it would be to add a little salt to the sauce on the green slice. Other than that, fantastic Brooklyn style pizza to have. Keep up the consistency guys!", "author": "Jason H."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Not Ray’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wcqsf8nGMdK1W6nQDqM0Mw/ls.jpg", "@type": "Restaurant", "telephone": "+17183302400"}