{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "I'm a pizza snob and judge a slice based on texture, balance, crunch, sauce-cheese ratio, aroma, and price.  I have to say, Not Ray's does a pretty nice job on all fronts.  They served me a nice hot slice for under $3 bucks and I thoroughly enjoyed it.", "author": "Marcos R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-10", "description": "Not Ray's is Not Good.  The Pizza was too doughy..kind of like something you'd order out in California.", "author": "RJ S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-12", "description": "Not Ray's has really distorted my perspective on what to expect of a pizza slice.  I find their crust to cheese to sauce ratio to be spot on and I am hard-pressed to identify one topping I wasn't happy with.  Usually, the boyf and I get a whole pie -  I recommend eating it with someone you love in front of an old episode of 90210.\n\nA really off-beat but yumming topping combo is the broccoli and meatball pie/slice - absolutely delicious.", "author": "Ryan Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-26", "description": "Pretty mediocre pizza. There's really no excuse for serving up bland pizza in NYC, especially when there's so many good pizza places to choose from. It tastes a lot like pizza I used to get from a pizza shop back in Florida. Not a good thing.", "author": "Iris D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-22", "description": "Every neighborhood should, and pretty much does, have a place of this caliber. The guys behind the counter are friendly enough and very efficient. Slices are reasonably priced. The pizza here isn't destined to be photographed or to inspire debates between connoisseurs on pizza blogs. They're just simple, solid slices with good enough ingredients, in a charmingly charm-less setting with a couple of counters and corny framed pictures. Seems unremarkable enough, but this is the kind of place people miss when they're not in New York.", "author": "Allison N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-21", "description": "pizza in ft greene pretty much sucks, but this may be the best slice there is.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-18", "description": "It's probably the second best pizza in Fort Greene after Graziella's.  Not Rays has a more traditional pizza style though and you get more pizza for your money, so we still order there regularly.  Almost every other pizzeria in the area has tasted more like a chain to me.\n\nDelivery times are good.  Pizza quality varies depending on who is cooking and time of day like any other pizzeria.  I'd say 75% of the time the pizza is really good and the rest of the time the crust is either really dry or doughie.  To better your odds, don't order late night.", "author": "Franco G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-06", "description": "We picked up 3 large pies (the perfect amount for 7 hungry adults) inbetween a break at rehearsal this evening.  I learned some new things about Not Ray's..  A) They don't take credit cards  B) The larges are HUGE  C) Pepperoni slices are reeeally greasy, but reeeally yummy.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-13", "description": "Great inexpensive pizza.  Love the thin slices, cheese, and sauce yum.  I did have to pat my slice down b/c of the grease factor!  This goes to show how much pizza I don't eat though. ;)  Usually that's what you pie connoisseurs love about it. :)", "author": "Koku K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "Solid, fresh pizza with friendly service.  We eat here about once a week.", "author": "Alexis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-03", "description": "Very good pizza and always very hot.  Fresh cheese and nice thin crust.  Besides the tons of annoying teenagers there, its a pretty legit pizza joint, better than most i've been to in BK.", "author": "Roy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-10", "description": "Now this is New York pizza at its best! I love it soo much. I really hate that this place isn't bigger. I don't really care for eating inside the place, but you gotta do what you gotta do when it comes to delicious pizza. I can't wait to come back here again.", "author": "Foodierudie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-24", "description": "An average rating for average pizza.  As some of the other reviewers have noted, it's about the best we have here in Fort Greene.  It would get one star if compared to the amazing pizza elsewhere in NYC.", "author": "J. N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-06", "description": "Real, Real Pizza! I was looking for peperoni and cheese- and thats exactly what I got! (I could have eaten a whole pie all by myself!)", "author": "Sara P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-14", "description": "A classic NY slice.  \n\nSure the Lucali's and Grimaldi's of the world beats Not Ray's to the top ten lists, but Not Ray's is the perfect everyday slice.  \n\nConsistently excellent and delicious, Not Ray's IS the heart of Ft. Greene.", "author": "gregor e p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-25", "description": "In the genre of neighborhood-pizza-joints-in-Brooklyn-- think Anna Maria In Williamsburg or Russ's Pizza in Greenpoint --Not Ray's is one step above. The stuffed meat slice is pretty unreal.", "author": "Paul J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-11", "description": "I love the pizza here. This is my first stop when I come to visit NY. The crust is thin like I like it, the sauce is good and the cheese oh, the cheese. Just tell them to make it not so hot... I miss Brooklyn...", "author": "Denita W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "As a former Chicago-based naif, I've spent fewer calories and lunch hours searching for my own favorite NYC pizza than maybe I should have.  But each time I wander Soho for the answer, I come back to my own back yard (or near it, anyway)  Perhaps it's the aroma of the yeasty crust wafting down the subway stairs more than anything, but Not Ray's Nick's always satisfies my craving for NY style, fold the piece, one is a meal pizza.  Crust is just right (not too thick, not too thin) sauce is flavorful, cheese isn't too horribly greasy, and toppings are fresh and generous.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "Im of fan of Not Ray's pizza.  I always come here when I am getting my hair done.  The pizza crust is thin and crunchy with good cheese and a nice amount of sauce.  However, I am never full off of one slice so, I have to either get another slice or get something on the else on the side.", "author": "Ash .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-30", "description": "For my single foray in NYC pizza, I was slightly but not overwhelmingly disappointed.  I expected a thinner, crisper crust with gooier cheese.  But maybe that's my uninformed Californian expectations.  I still, though, enjoyed sitting on my stool, folding up a slice, and peering onto the sunny Fort Greene Sunday.", "author": "Paul K."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Not Ray’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wcqsf8nGMdK1W6nQDqM0Mw/ls.jpg", "@type": "Restaurant", "telephone": "+17183302400"}