{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-05", "description": "I got two slices of fresh mozzarella and tomato and it tasted like frozen pizza in the cafeteria of my high school. The texture of the crust wasn't that of regular Brooklyn-style pizza. It wasn't what I thought it should be. I wasn't impressed, but after all it is only a pizzeria. Oh, and it was $8.00 for two slices and a coke.\n\nBOTTOM LINE: it is sustenance, but I think Ray would be happy that it isn't his pizzeria.", "author": "Chris Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "I drive from VA to visit my inlaws 4 times a year and have 2 grandma slices from Not Ray's Pizza. The best pizza I've had anywhere in the city. Always fast and friendly service.", "author": "Perla F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "This has to be one of the best pizza shops in Brooklyn, and perhaps the best of the small mostly take-out mom and pop type joints. The slice is hot and gooey and soft (I know that pizza purists do not like it that way, but I do). There is plenty of sauce and cheese on the slice. Those complaining about the $2.75 price could always go get the cardboard, flavorless, and naked $1 slice from the spot near McDonalds. THAT is not pizza, but bread smeared with ketchup.\n\nThe best thing about Not Ray's is its Stuffed Meat Slice - someone complianed about the $4 cost - hey, it is STUFFED with Sausage, Ground Beef, Pepperoni and cheese in a deep dish type of crust! See how much that would cost in Manhattan. The slice is a meal itself. For all of the detractors, please tell me a place o get a better slice at a comparable or better price.", "author": "Leonard P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Not the best pizza I've ever had (especially for $3.50 for a speciality slice) but good overall. Regular slice is $2.75 and most all other specialty slices are $3.50 each which is a little steep considering not all have meat or anything fancy. Would probably grab lunch here again though if I craving nearby pizza.", "author": "Christine C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-30", "description": "They were dicks. Granted, it was late. But they tried to hand me a piece of cold cardboard and charge me for a slice. My reaction: No.", "author": "kim b."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-10", "description": "The price/quality ratio at not rays doesn't quantify. The ingredients are pretty cheap in my opinion, especially for the cost. \n\nThere are MUCH better pizza spots in Brooklyn.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-24", "description": "I ordered a slice of white pizza with basil to go. I named the type of pizza that I wanted, and to reinforce my choice, I pointed to the slice. The person behind the counter repeated \"basil?\" and I said \"yes.\" When I got home, I had the white pizza without the basil. I was disappointed.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-24", "description": "Being that I'm from Chicago it's hard to impress me when it comes to New York pizza. This place has decent slices, not the best but not bad either.", "author": "Michelle J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-22", "description": "The pizza is OK, not gourmet but just a nice basic New York pizza. They deliver quickly and always get the order right even when we order 1/2 of something and the other half of something else. A solid neighborhood spot.", "author": "Ellis S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-09", "description": "STAY AWAY!!!!! I placed an order through seamless. I went to track the order and it didn't show up on seamless so I called. The woman kept telling me she had the order and when I asked her to verify the order she just kept hanging up on my. She actually told me the order would be delivered in 30 minutes. I asked her to verify the address and she hung up on me. Totally sh*t show and horrible service. STAY AWAY!!!!", "author": "A B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "Stopped here late one night after a long day and grabbed a square slice. It really was terrific and I'm excited that this place is just around the corner. I had been meaning to give it a try since moving to the area... love the name \"Not Ray's Pizza\"! The staff seems pretty courteous and the free delivery is great too.", "author": "Amanda G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "I love Not Ray's!  It's my favorite type of pizza, really classic New York style (not this crazy thin-crust trend that taken over as of late.)  I usually get their plain slice but the sausage and pepporoni version is also great if you want some protein.  Also love how their decor is all these photographs of places claiming to be \"Ray's Famous Pizza.\"  My two gripes are the crust could be a bit more flavorful, and they need to stay open later on Friday/Saturdays--I was crazing pizza at 3:30 once (granted I've stayed up past 3 am maybe 5 times in the last year, so this isn't a realy problem) and only Not Ray's would do, but they were closed.  I had to have a roast beef sandwich from a deli and it was just not the same.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-27", "description": "What can I say? It's not Ray's that's for sure. In all fairness, I've only been here late at night before they close or during the non-peak hours. It's on the corner in a really small space, there are a few chairs there but I wouldn't plan to eat here by any stretch of the imagination.\nThe guys who work here are really nice. The garlic knots are good and the pizza with the real mozzarella cheese is really nice too. Other than that it's not much better than any other take away pizza place. I would be willing to try ordering a full pie though based on other reviews.", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-07", "description": "It's not Ray's and it's not that special either.\n\nTo be fair, some of the offerings looked decent - particularly the small, simple slices.  However I was starved and also craving protein, so I went with an extra meaty slice that was twice the thickness and had pepperoni, sausage and other toppings.\n\nWhile hefty, it was also kinda blah.  The toppings on top were good but the sauce, cheese and underlying flavors were not very interesting, so I ended up picking away at it.  And the crust tasted like... undercooked dough.  It was cooked, but simply lacked finishing. There are places, even corner slice joints, who aspire to make great pizza.  \nI got the sense this place is simply content to get by.  Not that great.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-26", "description": "A decent neighborhood slices joint.  This place has a good veggie slice and a few other slices are good; some slices are just ok.   The Pizza guys here are a bit remote, but mostly efficient.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-05", "description": "I have been eating pizza from this Pizzeria for almost a decade.\n\nI don't know what it is about this place, but they put just the right about of marinara sauce, cheese, and dough. Heat it up perfect- steaming hot. MMMM delicious.\n\nAlso they make a kick ass brew of fruit punch- not too thick and not to sweet.\n\nI usually eat-in, enjoying the delicious morsels of this amazing pizza. The best I've had in Brooklyn, and I've had a ton of pizza...", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-02", "description": "Not Ray's, you get 2 stars because:\n1) you make pizza and I would like to have pizza before I take my last breathe. \n2) you are close enough to my house that you deliver. \n3) the smell of you pizza as I get off the C train tricks me into thinking that you make a delicious pie. \n\nThis pizza could be a great one, but the crust needs some major work. It tastes too sweet and te cheese is a low quality. Overall, the staff is nice and the prices are great, but I would opt for Mario's on Waverly. \n\nSorry", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-13", "description": "The pizza is good but this is BK, $2.75 for just a plain slice is no habbit I'm rushing to develop. Considering all the more extravegant toppings are gonna run you upwards of 4 something a slice. Nah, I'm good with Two Bros or Grays. In terms of food, pizza is becoming my last resort. Rather pay 4 something, eat lox and a bagel and be FULL.\n\nTakeaway: It's decent pizza.", "author": "Sonika H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-01", "description": "Only pizza in walking distance in this area. I believe they are too pricey for what is offered at $3 for a slice of pepperoni pizza. There are a lot of options for slices, and they are good. They are wheelchair accessible from what I remember and may even have a ramp to get into the location. Door opens inwards to enter. The class is high and if you are in a wheelchair it will be very difficult to 1. make an order, 2. see what options are available, 3. speak to the folks working behind the case.", "author": "La B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "The best pizza in NY, period!!! I was a bit scared when I saw the doors closed and the windows blocked off with paper. Luckily, there was a sign with an arrow pointing that they only moved a few doors down. The pizza is so damn amazing. Everyone I've ever taken here can't debate me on it being the best pizza they've ever eaten in NY. I'm still waiting for someone to show me otherwise... Nothing but good things are to be said about the promptness, taste, staff and cleanliness of the location. I freaking love it!", "author": "Troy S."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Not Ray’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wcqsf8nGMdK1W6nQDqM0Mw/ls.jpg", "@type": "Restaurant", "telephone": "+17183302400"}