{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "My favorite delivery pizza place in Brooklyn! Their delivery is always consistently great and their lasagna pizza is too die for! Would highly recommend!", "author": "Teagan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-20", "description": "I ordered delivery for a party. It was super speedy (arrived earlier than predicted on the app) and was super tasty. We did pepperoni with pineapple and the lasagna pizza. Only downside is that no red pepper or Parmesan was included. It was a bit of a downer since we all like those! I would've been willing to pay extra for those if that was the case, if that had been an option on the ordering app.", "author": "Casandra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "They have an excellent slice.   It's always done just right and the taste is delicious.   As New York pizzerias go this one is excellent.  There are No-frills just delicious New York style Pie. It's great for parties plus they'll deliver to the park.", "author": "Sam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "By far the best pizza we have ever had, we hit this spot every time we are in New York. Missed just once and was mad the whole way home.  I told the guys that thier pizza is the standard by which we measure quality of pizza against. Only 2 have come close, one in DC and one in Queens. That is it, Not Rays Pizza is the cream of the crop, after this review getting ready to eat a couple slices we brought back to VA .  We always get a large pie with extra cheese , one 1/2 Pepperoni- and we have never been let down.  The crust is superb, not too thick, not too thin, just right and done to perfection. The cheese is the best, cannot get the taste anywhere else, mixed with the sauce is a Homerun. Just cannot say enough about that first bite, always burn the roof of my mouth because I cannot wait for it to cool. The Garlic Knots are the best, loaded with Garlic and explode in your mouth with not to be found elsewhere flavor. The crew are always friendly, really make u feel like a regular even if not. The place has plenty of seating for a NY Pizzeria and very clean \u0026 updated restroom. The best place to get an authentic slice of NY.", "author": "James M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "For a classic pizza joint their crust is delicious! No cardboard here. Good price and their garlic knots really deliver. Toppings are also plenty!", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-03", "description": "Best pizza in the neighborhood! Something about the crust! The toppings are always plenty. Besides the best slice in the area it's also the cheapest, $3!", "author": "jesica s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Ive been going to not rays since a early teen and its one of the very few pizzerias i go to. The staff has always been nice, courteous, fast, and efficient. \n\nNice variety of slices, you want something light \nget a regular slice, sicilian they even have a veggie slice which i swear by, and if your trying to leave out of there wobbling go for the stuffed meat slice  \n\nThe place is very clean, always has been as long as ive been going there and they have about 5 tables seating 3 people. \n\nIf you're in the neighborhood or passing by and hungry definitely check this place out.", "author": "Desire W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "Nice local pizza joint in brooklyn, pizza was fresh and tasty. Staff was friendly with good customer service. However there is not that much seating in this shop, but it would work for a quick bite.", "author": "Duvesh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "This pizza spot is very clean and food is so fresh . The venue layout is similar to any pizza spot , only difference is the clean and catering to customers. It's not suitable for big groups but they have seating for small groups. It's right near the train that is very good to transport to. They do take credit cards which is a plus for me but the min is $10 .", "author": "Chastity M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "As good a pizza as  you can find anywhere in NYC. $3 for a cheese slice that is mouthwatering and a really friendly staff. The restaurant is clean and even has a bathroom in the back. Really really excellent place.", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-26", "description": "I remember when Not Ray's was at their other location and old management. The regular slices in my opinion was better and fresher but change is change. I must say I really like the bruschetta sicilian but they are sometimes sold out when I go so I opt for regular if I'm in a hurry. Overall decent pizza though.", "author": "Serina J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "My favorite go to spot for pizza in Fort Greene. The pizza is always loaded with a great amount of toppings and full of so much flavor. It's never overly greasy which is the best part. Even the crust is absolutely delicious! The pizza is always fresh and so warm upon arrival with delivery. If you want delicious filling pizza, eat here!", "author": "Renuka J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "This pizza joint is going the other way on the Ray's branding. The pizza is pretty average but I kicked it up to 4 stars for the variety and the staff was friendly. The toppings were great and flavor was there. Where they lost me was the crust. I like a more \"chewy\" crust. Theirs was of average thickness and came out crispy. It's middle of the road crust. Not choosing any sides crust. Some people I'm sure are into this. For some great toppings combinations stop in.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-10", "description": "Good pizza. Fast service. Nice guys. Every time I'm in Brooklyn I make a stop here and grab some slices.", "author": "C M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Classic NY tasting pizza \u0026 great specialty slices as well. Also the only clean fast food pizzeria I know of in the area. Super bright and inviting", "author": "Estela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Not Ray's is a local institution. Well before anyone artisanal'd pizza at ridiculous prices, Not Ray's has been busting out pies and slices for the people for years. \n\nOne Sunday a month I host a workmates dinner at my place. And because almost everyone is has some sort of allergy, I hedge my bets as best as I can with the menu. I am neither a nutritionist, nor a scientist, nor Gwynneth Paltrow, so I do my best and throw together a few vegan salads/veg sides, a respectable cheese board and some sort of charcuterie plate with vegan, dairy-free and gluten-free options and have some fancy pints of dairy-based and vegan ice cream for dessert. \n\nY'all. I try to be the thoughtful co-worker. And I think I'm doing ok as no one has yet to roll out of my place on a stretcher into an ambulance. \n\nMy go-to delivery main is the Not Ray's gluten-free cheese pizza. I order a few smalls, with cheese and without. Read more for the explanation why, re size and re cheese.\n\nThings to know: \n\n1) Not Ray's gluten-free pizza crust is pre-made. I've ordered all the sizes but the \"small\" works best as it crisps up like a cracker--this is a science-math moment that has to do with volume/mass/heat but I failed physics in high school. So. What I will say is this: think \"bar pizza\" for a reference point. Also, mitigate expectations: it's suuuuuuuuper important not to expect a Lucali-moment. Rather, ask for a well-done pie and you will will be happy. Who doesn't love a crunchy, tomato-y main, that can be held in one's hand as one freaks out re: work deliverables? (Folks allergic to nightshades. That's who. But one cannot win them all. As Game of Thrones so aptly demonstrates.)\n\n2) For the vegan guests, ask for no-cheese and fresh/dried herbs. The in-take order person will, I guarantee, be rolling her/his eyes BUT you be you! and do it. What you'll get is a crispy, tomato-y, herby loveliness, with dried oregano, marjoram or maybe even fresh basil, which you can then gussy up with your own good olive oil and fancy olives, arugula, nooch http://www.huffingtonpost.com/2014/08/05/nutritional-yeast-dont-be-afraid_n_5628501.html, etc.\n\n3) For everyone else, ask for your pies with light/little cheese. If you don't you will get A LOT OF CHEESE. It's true. Some folks like their cheese. As such, maybe just order one of the pies \"regular\" for those who like A LOT OF CHEESE. \n\nThe Not Ray's small gluten-free cheese pizza has six slices. For a party of two, I recommend one pizza, because you have a bunch of other stuff on the table, unless your dinner guest is a tri-athlete or you don't have a bunch of other stuff on the table. Then get two pizzas. \n\nFor a party of eight, get five pizzas. You know you have a co-worker or two or five that never cook and will be making sad-puppy-eyes at the end of the meeting and you'll send slices home. This will ensure your position in workplace dynamics. Srsly. Free pizza, even gluten-free pizza, is money. Bank it. And pull them favors in.", "author": "Pritha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "Crisp crust and super hot cheese, what else is there to nitpick about? Limited seating available but when the weather's nice you can just walk outside and enjoy the sunshine and your slice.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "Best Mozzarella pizza I've had in Brooklyn. I prefer my fresh mozzarella pizzas with thin crusts, less sauce and heavy cheese and they do just that. They don't charge outrageously for extra cheese/toppings. Order through Slice and it comes very quickly (less than 30 min), piping hot and the delivery guy is so nice!", "author": "Chris E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "Always a NYC standard slice that meets the iconic requirements. \nCrust:  Thin, crispy, chewy.  \nSauce: well balanced, between sweet and acidic. \nCheese: gooey but not slippery and sloppy.\n\nPlus you get friendly service when you are friendly.   If you are a bit of a d baggy in your approach they will be dry as toast with you.  Be nice to the people who handle your food.  Period. point blank.  Anyone who left less than 4 stars, I'm not sure what anyone else is looking for with these four \"musts\" being on point.  See you guys again when I'm in the area.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "A nice snappy crust that gives just enough flake on the edge with hot cheese, low oil and a tangy sauce.\n\nThe seating is extremely limited at Not Rays but the variety of slices is worth returning for. The fresh mozzarella and standard cheese were both tasty and the counter case had easily ten or more varieties of choices ready to go including a meat pie that The American Heart Association would warn you about!\n\nNot a bad munch if your just strolling by and got the hankerin' for a quick slice with some snap.", "author": "Doc M."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Not Ray’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wcqsf8nGMdK1W6nQDqM0Mw/ls.jpg", "@type": "Restaurant", "telephone": "+17183302400"}