{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-24", "description": "Great pizza!  I got a regular slice,  fiancé had the pepperoni.  Pizza was really fresh, I could actually taste the oregano on the slice.  Fast, simple and tasty.  I will be back!", "author": "Jenteel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "Located downtown Brookyn this is a serious go-to-must-spot on your bucket list. If you are a New Yorker you know we have given definition and nostalgia to the word \"slice\", it has the same familiarity as \"fuggedaboudit\" and is used just as often, however we refer to the word \"slice\" as we go about ordering our pizza.\n\nNew Yorkers take their pizza seriously.  We fold our slice as meticulously as as we fold a crisp white shirt from the dryer. \n\nThe variety of pizza here is crazy. There's something for everyone.... seriously. It's a little pricey however as you bite into a mouth watering slice you will understand why one slice is almost $5.00 a piece.\n\nJust go.\n\nDon't look back.\n\nYou'll thank me later.\n\nTrust me.", "author": "Letty C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "Just ate one of there  meat slices little did i know that the slice was a double slice.i pick the slice wondering  why it was so heavy thought it was just the topppings of ham sausage,ground beef,pepperoni,  when i bit into it i realize  it was a slice with toppings on top of another slice with toppings Delicious  and filling.", "author": "Manuel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "I've never been to Ray's, but I've been to Not Ray's aaaaand I like it. Definitely satisfies that late night craving for grease, cheese and dough. Delivery comes piping hot!", "author": "Denver M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "This gets a 5 star rating for: Best local pizza joint when I just want a quick slice. \n\nI always get 1-2 margherita slices (Read: Do NOT get the plain cheese or other options with plain cheese and toppings. The Fresh Mozzarella option is the ONLY slice I am talking about. Plain cheese = 2-3 stars). It's no DiFara - but it is definitely a great, quick, easily accessible fill-in.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "First of all, I'm a true Brooklynite. Good pizza, in my humble opinion, has a thin but hearty crust, a substantial amount of tomato sauce, and enough cheese on top to keep the sauce in its place. This means that there's often enough cheese that there's a thin film of oil on top of each slice. Basically, if you want healthy pizza, make your own or go to some vegetarian spot. GREAT pizza is NOT that healthy, but it's DAMN GOOD. I've been going to Not Rays since I was a youngin and I've always been beyond happy to bite into each hot slice and savor a bit of oil running down my chin, or onto my arm.  They may charge nearly $3 for a slice, but it's well worth it. \n\nWhat it is: a great pizza spot that satisfies your craving for comforting, tasty pizza EVERY TIME. \n\nWhat it ain't: a fancy schmancy pretentious joint, charging you $$ for blah pizza.\n\nStop in and if you see me licking up oil offa my forearm, just smile and do the same.", "author": "Nelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "I've been here on numerous occasions.\nThe pizza's always good. Especially their specialty pizzas! \nThe lasagna pizza is AMAZING.\nThe stuffed meat slice is aMaZiNg.\nThe grandma slice is great.\nThe grandma with pesto slice is great.\nTheir beef patties with cheese are delicious.\n\nOh, and they make zeppoles!", "author": "Rachel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "I've only eaten Not Ray's as delivery and it is awesome. The first time I ordered from here I picked it because I thought the name was hilarious and it had good reviews. I expected good pizza but what was delivered even more delicious. I usually make my own pizzas. Such great crust and topping options. You can even add different toppings to the right and left sides all within seamless to make it easy. I definitely recommend this spot.", "author": "Tara P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-27", "description": "Just tried this place for the first time, it was decent but not earth-shattering.  The plain slice was pretty good all around, could've been in the oven a little longer to crisp up. The gramma slice was very good, and the gramma with pesto was excellent, I found the crust on the square pizza to be better than the round.  Nice customer service, a good place for a quick slice but not much more.", "author": "Sean L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-26", "description": "If you want a no frills just straight up good slice of cheese pizza this is the spot.  The pizza taste exactly the same as when I was in HS and going to their spot when it was on the corner. I can't speak for all the other pizza types because I'm a traditionalist when it comes this pizza spot... bread, cheese, and sauce.\n\nWhen I'm in the area I will usually grab a slice happily!", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "The slices here are actually pretty good. I've had the pepperoni and the margharita slices. when you walk by it you would think it's just your average nyc pizza spot but I found the options to be better and the pizza to taste fresher. The staff are friendly and accommodating. I would highly recommend for a quick nyc slice.", "author": "Djerica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "Lol does anyone know who Ray is??? Do we think he's mad?\n\nAlways hitting up this spot with my girls when we need a pizza binge! Great slices", "author": "Casie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "You may think pizza is pizza but you haven't had pizza until you have had pizza from this place. Simple homemade hand tossed pizza BY THE SLICE the way it should be. I think the secret ingredient in this sauce is sugar, jus a tiny tiny bit more than other places.\n\nYes, yes that other brick oven pizza place is not far from here, yes i know that place has been all over every food chl but to be honest i thought the pizza there was sauce on cardboard.\n\nNext time in brooklyn grab a Sunkist and slice for me lol", "author": "Brooklyn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-24", "description": "Delicious pizza. Wonderful service. \n\nMy friend and I were in Fort Greene to pick up a birthday cake for another friend and we wanted a light meal to hold us over until dinner. We decided on a slice of pizza.\n\nI had the spinach and white sauce pizza. I LOVED it!\n\nNot only was the pizza great, but the staff made our visit enjoyable. They engaged in conversation as well as cracked jokes with us.", "author": "Ashlee S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "The place is very small and great for a quick in and out on the run slice. I had a white slice which was good and a slice of lasagna which I was told was the gospel and it was decent nothing g to flip your hat over.... the staff were like robots not rude just busy at work", "author": "Lamar J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Food is absolutely amazing. Fresh. The staff is very pleasant and give great customer service. Prices are a little high however the food is really great quality", "author": "Blesseth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "I came here after a hot day of drinking margaritas across the street. The slice I ordered was great; it had just the right amount of cheese and sauce, and the crust was soft, just the way I like it. I'll definitely come back here.", "author": "Florann E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "Well I happen to be in the neighborhood and I remembered how much I enjoyed the pizza. This time I decided to try the spicy buffalo chicken slice.....yum yum! It was very good, the spices were just right not overpowering. I was able to enjoy a good slice while watching boxing on the television....what a great combination. I'd definitely come back to eat here again.", "author": "Lina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Yummy veggie whole wheat crust quick service crust was crusty like I like.  Don't sit by door cold today", "author": "Grace m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "no need to repeat what the previous reviewer typed. I agree", "author": "Tiesha T."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Not Ray’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wcqsf8nGMdK1W6nQDqM0Mw/ls.jpg", "@type": "Restaurant", "telephone": "+17183302400"}