{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-31", "description": "I have a confession to make - I did the unconceivable.  I was selfish, inconsiderate and committed the vilest of take-away sins.  I ordered two slices of pizza during the middle of a freezing, sleeting, raining mess of a night.  \nAnd, just for the sake of honesty, I also ordered a can of orange soda.  Yes.  I like orange soda because it reminds me of my farm girl days.  \nNevertheless.  I committed a crime.  It was wretched of me but I was starving and, as I promised to myself, I tipped the deliveryman quite well (after reading that New York Mag article, I tip deliverymen exceptionally well).  \nLess than ten minutes later,  a cheerful and [slightly] wet deliveryman arrived with my can of orange soda and two slices of pepperoni.  Savory and sating, I stored my second slice in my tee-tiny fridge (Breakfast this morning was quite delicious).    \nWhile I prefer their buffalo chicken (talk about an arsenal of flavor), I must admit that the pepperoni was better than most. Yes, the pizza is a bit greasy - but that's the stuff of New York pizza legend [that - and the crust.  What makes NY crust so good?]. \nSo if you happen to chance upon Not Ray's, enjoy their irony and their authentic tastes.  And, if you're truly lazy and willing to commit the take-away sin, order in.  Just remember to tip exceptionally well.", "author": "Cannon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-17", "description": "As far as basic, cheap New York style pizza goes this place is great. The \"green pizza\" slice is awesome. And the people there are nice. The service is very fast. Overall this place is very solid.", "author": "Julian T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-26", "description": "This is like one of the best spots to go grab you a slice of new York pizza. Everytime that i go to new York. This is the very first spot I hit up. Love it.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-04", "description": "Eh.  2.5 stars.  The doughy is chewy in a glutinous way I find unpleasant.  Not that delicious crispy-chewy so delightful about good pizza, but dough sitting around to long or worked to long.  The cheese is greasier than usual and not as flavorful as it could be. The sauce is good though.  \n\nAncd yes, still better than a lot of pizza outside NY.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-12", "description": "If there's a better place to buy pizza. I have yet to find it. Not Rays Pizza is excellent. They knock Dominoes, Papa Johns and little Ceaser out the box. There pizza is always hot and always fresh, my only complaint is that the place is kinda small and it's hard to find parking...", "author": "Tracy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-12", "description": "A neighborhood standard and extra points for the name. Always reliable for a quick slice and they deliver a nice hot pie for all of your party needs. Don't be afraid to speak up over the random people standing and waiting , they've usually been served already. Oh and if you're getting a slice to go, I rarely seem to be given a bag, or tin foil, even if it's raining or -10 degrees out, so again, speak up!", "author": "Konstantin V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "Definately one of my fave places to go for a slice or two! You should get the sicilian, i like my slices thick. mmm just reading the reviews made me want to go to not ray's but its 9:50 pm...too close to closing time. Love the pizza sauce, I actually request extra sauce for dipping. Here's an extra tidbit: try the fruit punch! Its perfect and affordable. I havent found a place that serves a fruit punch that can compare, works as a great complement with my slices. One time I happened to be super hungry due to a long busy day and actually ate three slices!! I can usually barely finish one so thats a true testament to their skills. The staff is quick and friendly. Even though its not the most updated decor its nice to squeeze in front of the window and look at Habana Outpost and all the commotion/activity that goes on a busy Fulton Street. A lot of people place their orders to go, it is a small place for all the business it gets, but the people come and go pretty quickly. You should definately look into trying it at least once and let the Pizza talk for itself lol! Oh yeah, if you're taking the train its conveniently located at Lafayette on the C train if you exit the right exit you will be right there ;)", "author": "Gabriella D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-22", "description": "I love this place. Depending on what you order (I love the Grandma's slice), it can be some of the best pizza in Brooklyn. A real authentic New York pizzeria offering better slices than you're gonna find in Manhattan.", "author": "Zane B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-14", "description": "Awesome pizza and right across the street!  I'm hooked.", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-17", "description": "Great pizza!  Old school pizza love the crust.  Yummo!  Summer time, Italian ices.", "author": "Party Crasher Events P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-01", "description": "I'm not a big pizza fan to begin with, maybe because I spent one summer in college working in a pizzeria, but according to my manhattan/brooklyn raised boyfriend, this is good, traditional NY style pizza. Being from upstate maybe my pizza expectations are different, I prefer ordering buffalo wings with atomic sauce anyway. But if you like the kind of thin crusted slice where the grease slides off and stains your paper plate an unnaturally flourescent orange, then he's right, this is your pizza joint. \nFortunately for Fort Greeners a second pizza parlor just arrived about a block and a 1/2 away from Not Ray's.  I haven't tried it yet, but I'm hoping to find a less slick slice.", "author": "nara f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-18", "description": "Best pizza in the neighborhood!\nThe only place I'll go for a slice (in the hood, that is)!", "author": "Em P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-01", "description": "The blue cheese and buffalo chicken pizza is uhhhhmazing, nice thin crust, crispy on the bottom and soft in the middle. One of the better slices I've had in NYC.", "author": "Kelsey D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-11", "description": "Had a pie delivered, which isn't typically the best way to judge a pizzeria because a fresh slice out of the oven with a fountain coke in a wax cup is the gold standard.  With that being said I will not be ordering delivery from Not Rays Again.  The pie came very undercooked with the crust being very soft and doughy.  The sauce was ok, somewhat tasty.  The cheese wasn't fully melted and ended up sliding halfway off the pie during transit.  Granted that's not the pizzeria's fault but still a part of the experience.  Luigi's on Dekalb crushes this place.  Will stay true to my roots going forward.", "author": "Greg P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-13", "description": "Not the best pizza in the area (that distinction goes to Graziella's on Vanderbilt) but certainly the best slice in Fort Greene.\n\nTry the fresh mozzarella. Or the buffalo chicken. Damn, I love that buffalo chicken...", "author": "Ryan J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-08", "description": "I have been coming here for 4 years now.  I like to just come here and grab a slice when I am passing through. I really like the Buffalo chicken and the Baked Ziti style slices. It is decent but not the best. The staff is friendly and they have quick service. I come here all the time and probably keep coming here when I need a quick bite.", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-04", "description": "OK, not great but not bad... generic is the word that best describes it.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-04", "description": "I've been going there for years. Good stuff.", "author": "Arthur C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-08", "description": "Simple delicious pizza. Friendly and quick. Small and cozy. Good place to eat before heading over to the Barkley center.", "author": "Sean Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-01", "description": "Being a pizza snob theres not many places I order pizza from consistantly. Not Ray's happens to be one pizza shop I can depend on to get my fix for pizza. Amazingly Ive been eating here since the late 90's before I moved to brooklyn. The pizza slices are a little thick, kinda heavy on the dough. The marinara makes great pizza sauce.  Topings are good too, not to stingy. Highly recommended", "author": "Helmut D."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Not Ray’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wcqsf8nGMdK1W6nQDqM0Mw/ls.jpg", "@type": "Restaurant", "telephone": "+17183302400"}