{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-15", "description": "Let me explain.....this all depends on the time you go there and your mood. \n\nI went after a night of fun and I just thought ummm okay pizza. Did not give it any thought.  I went there when I was a bit hungry during lunch time and it hit the spot. My friend had the chicken pizza and said OH MY this is SOOOOO good! This is not ray pizza, this is a thousand times, better. So,  I think it is a place that will be a safety for me. \n\nIt was not the best pizza of my life but it was good pizza. I did not actually like the selection (I just felt like they could have more variety).  Maybe if I go there again, I will try something different.  I have a feeling I will be eating there at least one more time. \n\nStaff is nice and funny. Prices are cheap. I may even try delivery.....", "author": "Loli J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-06", "description": "My neighborhood pizza. As a designer, I thought the place didn't look very inviting and it took me a while to go in there. But when I finally did - no regrets. I usually only have the cheese slice, and it is a bit on the greasy side, but I like it. Thin, simple and good. I also appreciate that the staff is super friendly and quick.", "author": "Edgygirl O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "ordered online. quick response. delicious, greasy food. i was in heaven.  but all in all its about what you'd expect from a decent new york pizzeria.", "author": "Ethan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-16", "description": "I was so excited to try Not Ray's after reading so many of the reviews on yelp and other sites.  Am I missing something? Not Ray's was not worth my time or money! Bland is a gross understatement! If I had not been so ravenous after a long day without much to eat I would have trashed the entire pie after the first bite.", "author": "Janeen W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-26", "description": "Not Ray's pizza is your typical Brooklyn pizza joint.  The crust is thin, the slices are large and the cheese was good.  \n\nIf you are in a rush and need to pick up a quick hot bite in Fort Greene stop on by!", "author": "spazzy p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-23", "description": "second only to Luigis on DeKalb next to Pratt", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-11", "description": "I thought the Pizza was Delicious. Crust was nice and crunchie, the pizza sauce was good, it was well balanced seasoning wise. Slices are a good sized portion, the workers seemed very friendly and attentive.", "author": "Joao M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-16", "description": "Not Ray's is Not Good, to me at least. I'm not a fan of their pizza. It's not inedible, but it's bad enough that I wouldn't ever eat it again. It's also the kind of pizza that's really awful leftover. Perhaps one day I'll go back in and try something else, but for now I'm staying away. They have one plus, the staff is friendly.", "author": "L S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-11", "description": "Ft Greene is underserved in pizza, and unfortunately this is as good as it gets. The slices here are better than average but nowhere close to being in the same league as the elite pizza shops across New York City. But, because this is all there is in the neighborhood, Not Ray's gets very busy on weekend afternoons. (It's fun to look at the pictures of Ray on the wall!)", "author": "Josh H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-23", "description": "not as good as vinnies pizzeria in wburg/gpoint but still this is good pizza. great crust, sauce and cheese.  i've only tried regular and pepperoni, but i like it enough to stop in everytime im in the neighborhood. solid pizza.", "author": "charles s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "good pizza, place is a little tight, prices are ok.  staff is pretty quick, to keep all the orders moving along, a plus.  the crust is very thin, which might pose a problem for fresh slices, cause they use a good amount of sauce, which is pretty good, a little salty, but a little acidic, and not too sweet.  the cheese will run on a fresh slice, but i think it's all good, cause i like to eat it as fast as possible before it falls off my slice.  i would say 2.25 a slice is manhattan prices.  i dunno where i was when a slice jumped from 1.50 to over 2 bux.  anywyas, that's really my only gripe, besides that the place is small, but at least they have seating.  good location in the middle of ft greene, just off the C train.  finally decor is a little confusing, esp with the name like \"not ray's\".  i guess it's a spoof, cause the place is decked out with old pictures of all these \"ray's pizzerias\" across NYC.  i guess they had to find a name that wasn't ray's...  and i guess they did.", "author": "Cyril T."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Not Ray’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wcqsf8nGMdK1W6nQDqM0Mw/ls.jpg", "@type": "Restaurant", "telephone": "+17183302400"}