{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "What a contender!  Yeah, screw Ray, whoever you are!\n\nThis is one of my favorite places for pizza.  Their cheese, sauce and dough are spot on for both their regular slices as well as their squares.  No need to over-analyze the pizza here.  This heavy-hitter in Brooklyn delivers good pizza.  It's so good that I always wonder who Ray is and why they want to distance themselves from him.  If you're in the area, and you don't come here for pizza, then you're not using Yelp, or don't like good pizza.  Yeah I said it.  Now go get a slice.", "author": "Jeong C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-18", "description": "I've been here numerous times.  I usually get a plain slice and some garlic knots.  The pizza is consistently delicious-- think stretchy cheese and a chewy, soft crust.  Plus it's cheap and the guys behind the counter are always very nice.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-14", "description": "Good pizza, steep price. I ordered 2 slices and it came out to $7!?!? At least it tasted good.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-27", "description": "As an out of town visitor all it took for me to go inside Not Ray's was I was passing it and I was hungry. Since I'm not a local I feel no matter where you go in NY you normally get great pizza. So not being a pizza connoisseur I really liked my $3 vegetarian pizza. The service was friendly and fast ( NY accent and all). Since my friend lives in the area if I ever visit again I definitely seeing myself grabbing a slice from here.", "author": "J P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "Mmmmmm. Pizza is excellent, but here's the trick: don't let them put your slice in their oven. It comes out too crunchy, and lacking all flavor. Tell them you want it \"not hot\", and I swear to you, it'll be some of the best pizzeria pizza you've had.\n\n$2.75 for a slice seems a little nuts indeed, but it's worth it if you can keep away from their oven.", "author": "Janson L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "Busy place... great sausage roll! The crust is really flavorful! I'll be back.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-11", "description": "the people are kinda unwarm but\ndear god. i haven't been here in 2 years but after eating this, nothing compares.. you will spend the rest of your life trying to find a pizza that is close but there is nothing... i dont even like cheese pizza but here its epic, any kind of pizza is epic here! this is my favorite pizza place of all time", "author": "Daniela J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-28", "description": "Not Ray's Pizzeria is absolutely my favorite pizzeria in Brooklyn. The staff is friendly, service is fast and the pizza is yummy. Not to mention its right above the C line on Lafayette. The sauce is delish and the crust is thin and crisp just the way I like it.", "author": "Rochelle P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-09", "description": "First time I have been so disappointed with an order from this place.  Ordered the stuff meat pizza, which usually is so good I over eat.  But today the bottom crust was burnt so bad it was unedible.  The rest of the pizza was tasteless.  How do you make sausage and pepperoni tasteless is beyond me.  I'll try them again, but it seems to be either hit or miss with them.", "author": "Barbara H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "One of the best places to go for pizza IMO.  Good and flavorful and some imaginative varieties also.  I love their pesto pizza slice...very very good.  Service is what it is...they are there to take your order and give you your order...nothing more and nothing less.  They might chat with you a little while you wait...but don't expect 5 star impeccable service here lol.  But do expect 5 star impeccable pizza.", "author": "Marie R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-27", "description": "I grew up with Not Ray's. It was my default pizza spot in the late 80s and early 90s and I never really ate pizza elsewhere. To me, whatever they made, that was how pizza was supposed to taste. I loved their mushroom and onion slice back then.\n\nI moved back to the neighborhood in the mid-2000s and was somewhat disappointed. Though the pizza was okay, it definitely wasn't the same. I'm not sure if ingredients have been modified or if it's just different people working there, lost a bit of its luster.\n\nI've given them a chance on several occasions and have been disappointed every time. I even ordered 12 pies once and picked them up for a Super Bowl party, I don't think anyone at the party complimented the pizza. And for a local pizzeria, it definitely wasn't cheap. I think it averaged out to almost $15 a pie.\n\nI'll stop by every now and then to grab a slice but it's definitely not something I look forward to all that much.", "author": "Darren C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "Classic NY style pizza and amazing calzones.", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "thin crust, a lot of vegetables. a lot of options. 3.5 dollars for a veg slice.", "author": "Lulu X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-05", "description": "This is a good place for a quick cheap slice of pizza.\n\nDon't expect anything special from this place....", "author": "Sera A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "Came here with my boyfriend to grab a quick dinner prior to heading over to watching a Nets game one night, and I was surprised by how satisfied I was with this place.  The staff was friendly, and the pizza was delicious.  Despite the fact that I had a fever that day and did not have much of an appetite, I was really satisfied by Not Ray's pizza slices - that day I had ordered a slice of Sicillian, and it was as cheesey and buttery and soft as I had wanted my pizza to be.  It might be a bit difficult to find seating here.", "author": "Kristy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-08", "description": "Pizza is one of my weaknesses. Extreme self-control is required to keep me from overindulging. Luckily, the closest pizza spot in the neighborhood happens to be just OK. For this, I am grateful. Any better, and I may need a prescription for one of those magic pills that makes you lose weight and reverse your cholesterol issues. \n\nBut, since this pizza is only 'passable', as Peter D. put it, those pharma companies can suck it!", "author": "Lans S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Square slice with fresh tomatoes, onions and garlic...MMM! Loved that they put a mountain of tomatoes on there, and they were super fresh. \n\nYummy garlic knots too !", "author": "Kassy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-24", "description": "I got two slices and some lemonade. The staff were receptive, but not necessarily friendly/not friendly. The food was good. I can't say anything necessarily set it apart, but it was nice to find a drop in pizza place whose crust didn't taste like the cardboard box it traveled in. The pizza was filling and the ingredients didn't taste bad (or specifically fresh). All in all it's a good place to have to drop into for a good slice of Pizza on the go. If you're looking for some great pizza using fresh ingredients in unique ways, find somewhere else; but if you need a quick slice that's appetizing and quick drop by here.", "author": "Peyton H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-10", "description": "I went to Not Ray's with my mom and a friend today for the first time. I ordered a slice of mushroom and a pepperoni slice and my friend ordered a regular slice. He devoured it in 3 mins tops! It looked delicious. I didn't eat my slice until I got home so this review is not the fairest bc my pizza crust was tuff after preheating it in the oven. For pizza warmed up at home it was pretty good. They have a great selection and I love the tongue in cheek idea of the restaurant being the opposite of the Ray's Original Pizza chain. I look forward to a leftover pepperoni slice tomorrow. It was kind of pricey though. 2.75 for a plain slice....", "author": "Trudi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-15", "description": "Best slice of pizza in northern Brooklyn, place has good character and great red sauce. The little corner location is very unique, and the brisk yet kind staff takes care of you. The pies are made right by the counter, and you can watch as your slice warms up. They care about their craftsmenship and quality here.\n\nThe stuffed meat slice ($3.75) is my favorite, and qualifies as a meal and a half. They also do all the normal things that a good pizza parlor does.", "author": "Jared C."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Not Ray’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wcqsf8nGMdK1W6nQDqM0Mw/ls.jpg", "@type": "Restaurant", "telephone": "+17183302400"}