{"aggregateRating": {"reviewCount": 1, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-27", "description": "This is the restaurant inside the main building (Metcalfe) of Long Island University, Brooklyn Campus.\n\nI come here often, since I practically live at my school where I am a nursing student. Their prices are very fair - more fair than what one would otherwise expect in Ft Greene area. \n\nI'd like to break it down, and will expand on the important parts...\n\nPROs:\nPrices (more info later, but suffice it to say that it wont break the bank)\nLocation\nQuality(more info later)\nSeating (more info later)\n\nCONs:\nSometimes staff could use a lesson in etiquette and friendliness... But as I say \"What do you expect? This is Brooklyn.\"\nSelection of foods remains constant, particularly an issue at the grill (more info later) \n\nPricing: Their prices are very fair for what you're getting. Veggie burrito is about 5.50$ if memory serves and is quite large, with options included such as gauc (I sub for sour cream since I am allergic to avocado) lettuce, salsa, rice, black beans, olives, jalapenos, etc. Omelettes and home fries for 3.50, GREAT salads for about 6-7$.\n\nQuality: Their quality is always fresh in my experience. Their spinach is always green, olives always tasty and jalapenos always deliciously spicy!\n\nSeating: AWESOME seating area. It echo's quite a bit from all the students yattering away in there, but has a grand appearance with statues and art decor. There is also a nice piano where the music students sometimes come and lend background music to the chatter. A lovely experience, I wish more people paid more attention to them and offered tips (I am not sure if they'd accept them if you did, it would just be a nice gesture.)\n\nTheir food selection always stays the same... I have not seen it change. It's always Taco-Tuesday here! Which is not a bad thing per say, but sometimes I would love some lo mein or eggplant chili, some roti and curry... etc. Switch it up now and then!\n\nLike I said, it's a great place to come and eat or just hang out. There is also a Starbucks located inside of it making it a one-stop-shop for finals week or the individual in need of calories and caffeine!", "author": "Michael W."}], "servesCuisine": "American (Traditional)", "priceRange": "Under $10", "name": "Luntey Commons", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "213 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RlJvcjkNAESYtsqBAo8mXA/ls.jpg", "@type": "Restaurant", "telephone": ""}