{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "After walking past this place for many years, finally stopped in for a drink and a quick bite with my husband. Bear, the bartender, was wonderful! Drinks were perfect and  was a great conversationalist! Going back to try brunch on Bears say so!", "author": "Lisa I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-08", "description": "Its just a quiet local neighborhood restaurant but you will always get solid food, I don't think I've ever had anything there I didn't like.", "author": "Dean C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Yelp reviewers seem to be focusing a lot on the brunch at Jack the Horse, which I have never tried. Because I live in the Heights, I've come here for dinner many times with out-of-town visitors or when someone has a birthday or other special occasion. Really, it's a great place even if you don't have something special going on. The ambience is cozy, with friendly service and a slightly upscale but not pretentious vibe. The Promenade and Brooklyn Bridge Park are right down the street; in other words, it's tourist land. Therefore, dress is casual. If you're a tourist and have a few extra dollars to spend, I would recommend Jack the Horse, although you'll want to make a reservation. \n\nThere's a bar in front and you'll often find people hanging out and having a good cocktail. \n\nI've had only good experiences here with the food.  There's a nice choice of appetizers.  I like the beet salad. There's a yummy polenta and usually some type of ravioli. Mains are standard stuff like fish, chicken, steak, usually some kind of vegetarian risotto or pasta, and there's always a good hamburger. The food isn't experimental, but it's very tasty and satisfying.\n\nOne of my pet peeves is noise.  A nice thing about Jack the Horse is that you can hear yourself think in there. \n\nJack the Horse is a two-minute walk down Cranberry Street from the High St. stop on the \"A\" train. (Exit the subway via the staircases that say \"Cranberry St.\" or \"Henry St.\")  The 2 and 3 trains are a short walk away at Clark St.  Don't drive, because parking is pathetic.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Brunch was very tasty and luckily got seated on a busy Easter weekend before the rush.  Portions may be slightly smaller but well made.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "One of our very favorite brunch and happy hour spots in Brooklyn. Be sure to get reservations or be prepared to wait forever. Come here for brunch and enjoy! Happy hour is next door for oysters and drinks.", "author": "Anne M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Came here after walking across the Brooklyn Bridge for a snack and cocktail.  It was Saturday Happy Hour!\n\nMac and cheese was amazing\nSide fries\nBread and butter\nWhite wine\n\nThe cocktails on Happy Hour were all pretty strong, nothing fruity so I had the wine.\n\nThis place is so cute, great neighborhood and charming atmosphere.\n\nDefinitely would recommend.  I really wish I tried those seafood entrees.", "author": "Kimberly W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "Cool little place in Brooklyn we loved our food.  We waited for our seat and glad we did.  Freshly squeezed orange juice and our kids loved it!", "author": "Laurie-Anne B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "This review is for brunch. \n\nAfter 14 years of walking by this place but never being able to commit finally gave it a try for brunch today.  We had been lured in by their online menu which showed a steak hash but were disappointed to find out that menu is  outdated and has now been replaced by a duck hash.  Don't get me wrong, I love duck hash but Colonie down the street has a solid duck hash so if I am getting I am going to get there. Despite the menu change we decided to still give it a try. \n\nThe space is very welcoming and deceptively big (with 80% of tables filled) so we were feeling optimistic.  Upon getting seated it took quite a while for for someone to wait on us.  We were both going to go for the duck hash but decided to hedge our bets and go for the a duck hash and their egg sandwich with pork belly and potato salad. \n\nI started with the classic Bloody Mary (they offer 4 different styles) for $10. They get points for it being a really pint serving and flavor was very good (and not bitter). I then got the egg sandwich for $13. Sandwich looked a good but seemed to have almost no egg and the pork belly was too fatty for my preference. Would have just preferred bacon or sausage.  Potato salad packs a lot of flavor but have to say is kind of a weird thing to pair with egg sandwich.  It was fine but definitely not something I would go back for. \n\nThe wife went for the duck hash which seemed to be all potato cubes with barely any duck and two small and overcooked eggs. Was just a very dry dish. The toast was good but again very dry and cold. \n\nAs for service it took a long time to be able to place our order and then our server never came back to see how we were doing or refresh the $2.50 standard drip coffee.  \n\nI guess our mistake was not realizing that the glowing reviews for this are for the bar and burger aspect and not necessarily brunch. Won't be doing brunch again but could see coming back for the happy hour.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "Cozy neighborhood spot! We came here for happy hour on Friday night. They offer an old fashioned on the hh menu for $7 that was really great. We also tried delicious small plates like lamb meatballs, nice portion of brussels sprouts and super good mac and cheese. The happy hour oysters are $2 each but great quality. Pro tip: you have to sit at the bar for the happy hour menu.", "author": "Leah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "I love this cozy neighborhood place. Had dinner there for the first time last night and thoroughly enjoyed every minute. My party of two arrive a few minutes early for our 7pm reservation and the host happily sat us right away. We were greeted immediately and our cocktail order was taken and the drinks delivered very shortly after. Our server let us enjoy our drinks and came back to take dinner orders about 15 minutes later, perfect timing! \nThe menus is somewhat limited and possibly because of the small selection everything is perfectly executed. We started with the grilled octopus - divine. It was a great combination of texture and flavor. I followed with the cod, probably the best fish dish I have had in New York. Perfectly crisped and delicate fish served with a beautiful romesco sauce. My dining partner had the hangar steak and loved every morsel. Portions are perfectly sized to be filling without leaving one overstuffed. \nThe atmosphere is comfy, the food is outstanding and the service was very good - I will be back.", "author": "Lois G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-29", "description": "This was the second time I ate here,and the menu has some unique preparations of the food. The place is laidback and attractive.  However, THE SERVICE IS THE WORST.  We were seated promptly when we arrived and the waitress took our drink orders.  She brought the drinks and took our food order.  Then we waited about 30 minutes, but no appetizers.  Meanwhile, other parties arriving after us had gotten their mains.  I paid for the drinks and walked out.  I don't expect white glove service in this place, but make the pretense that you give a damn, and don't ignore me.I WONT BE BACK.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "Jack the Horse tavern is a fun, slightly intimate, cozy restaurant nestled in the middle of residential Brooklyn Heights which you may not visit unless you are in the area or live on Henry Street. We stopped in for brunch today and it was definitely a solid choice.\n\nToday's meal consisted of the bacon, egg and cheese sandwich, granola, and two sides, the sausage patties and the bacon. I'd like to start off by saying they give you a very generous portion of bacon. I personally like mine a hair crispier, but it was still bacon and very good. The sausage patties are interesting, with a nice ground beef style texture and a distinct sweetness I haven't noticed before in sausage patties. The granola was tasty with a nice mix of fresh fruits. The sandwich was great, good bioche bun and the pork is cooked perfectly (it's not really bacon). The mix of flavors all complement each other very well.\n\nFriendly, attentive staff here make your meal a breeze and the dining room has a nice mix of cozy/homey yet functional furniture. The corner sofa seats for some tables are a nice touch. \n\nI guess the question here is, why didn't I give it 4 stars? Jack the Horse is good and I recommend you have brunch there. It's just pretty standard, nothing blew me away. I was happy with my entire meal experience. I'm definitely a fan. I almost feel guilty only giving 3 stars. 3 stars for me means good. I've been here a few times and they are very consistent in terms of quality. Their ingredients seem fresh and the dishes are well put together. Is it enough to make you come here from outside Brooklyn Heights? Not sure about that, but if you are in the area, you will not be disappointed with your meal.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "Brunch on Sunday needs more servers. Very good pancakes. Would do better and much faster at Heights Café on Montague St", "author": "Dolores B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Intimate and unfussy spot, perfect for dates and small gatherings. \n\nThey have a great happy hour featuring a beer, some cocktails and bites. Their mac \u0026 cheese is $6 during happy hour and it is incredible. Normally, I don't order mac \u0026 cheese at restaurants but this is something to write home about. \n\nThe food is a little pricey, but quite delicious. I had the diver scallops, which were perfectly flakey and flavorful. I tasted the JT Burger, which was wonderful and a pretty fair price for the menu ($17).  I finished off the meal with a butterscotch creme brulee that was very sweet but absolutely scrumptious. \n\nThe service here is great. We arrived on time for our reservation, but they were flexible and allowed us to hang out at the bar for a drink first. The bartender is casual and friendly. He gave us cocktail recommendations when we came in. The server was detailed and answered all of my mom's nagging questions. \n\nI felt almost like I was at home away from home. Exposed brick walls, with pressed metal ceilings, dark wood bar and old hipster knick knacks carefully placed throughout.  It gives you a warm and inviting feeling.", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-27", "description": "I went here last night for my one year wedding anniversary. It's kind of a tradition. Because we got engaged on the Brooklyn Bridge. So we go back there to read our vows and then go to Jack the horse. Typically I get the burger or the pork chop or the chicken all of which are delicious. \n\nBut last night really disappointed. My spouse got a big bowl of mussels. It should have said bowl of big mussels. I have never seen mussels so huge. They were literally, the size of a baby foot. No one can chew that up. We tried to cut them up but that was disgusting and unappealing. Putting that whole thing in your mouth was just out of the question. \n\nI ordered the Halibut which was undercooked and so raw and slide me in the middle that you could not pull the flakes of fish apart with a fork. Yes, I could have sent it back. But by that time we were both kind of skeeved. Our waitress came and asked how everything was. We pointed out the mussels and told her they were just enormous, and not in a good way.  and she agreed and said that in the past when she had gotten huge oysters she could not eat them either. I advised her as someone who has been a server for many years that she probably should advise people when they order them that they are too huge to eat in one bite. \n\nShe also noted that I had it in my rice and vegetables but had barely touched my halibut. I told her that it was undercooked to an extent that I really didn't even want it cooked more and returned to me. She apologized and said I hope the rest of your night goes better when she delivered the check. Not in a mean way. But frankly, as a server, she should have circled around before it was time for the check. Maybe offered us something different.\nAs a server I would have taken at least one of those off the check, or offered a free dessert. Or I would have had the Chef or  manager come out to apologize profusely.\n\n frankly, I would have sent those mussels back and asked for my fish to be more cookies but it was very hard to find our server through the whole meal, even when Our water glasses remained empty.\n\nAnd the error here is really on the chef. They should not have sourced such huge mussels. I really think that's not what people expect. And the fish should have been cooked better. And the waitress should have checked. All in all however, this is a great and charming and beautiful location. Just don't order fish.", "author": "Alicia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-05", "description": "3.5 rounding down. Jack the Horse is a good tavern, but it's not great. Service was non-attentive for dinner after delaying our reserved table by 20 minutes. There was a single bartender and one waiter working with a packed restaurant, so a poor staffing choice for Friday night in New York City. Drinks tased good but pours were light. Portions were appropriate, food was well-prepared, but for the entree price, we could have gotten better service and food on Montague or Henry Street.", "author": "Jared W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "I came to this place based on a friend's recommendation and I have to say that she didn't disappoint!  I had heard they had an awesome happy hour, so I can't say much about their restaurant as a whole.  Their happy hour though is an easy five stars!\n\nI walked in with a friend and there was a small high top table near the bar where we were seated--happy hour is bar seating only.  The place was casual and queit; it's a great place to catch up with friends and not shout over loud background music.  \n\nBefore introducing himself, the waiter walked over and pointed to my friend and me and named two drinks.  Usually, I would find this a little annoying, but for some reason, it was endearing and I went with his recommendation.  Their happy hour cocktails are $6 and happy hour beers were $4.  Their drink list for happy hour wasn't huge (probably about 6 different drinks), but my friend and I were more than happy with what we had.   \n\nThe food menu for happy hour is also relatively small, but it includes the famed smoky gouda mac and cheese, which is...wait for it...so gouda.  It is definitely very smoky, but everything about it is perfect--bread crumbs, ample portion...perfect!  We also had the bacalao croquettes with sweet pickle aioli.  These were good, but they weren't as delicious as the mac and cheese.  Still, I was happy we ordered them.\n\nOverall, I can't think of anything that I'd change about my experience at Jack the Horse Tavern, and I would easily go back any day for happy hour or even try their full menu!", "author": "Logan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Eggs Orleans - yum. Trout salad - superb. Even the coffee was awesome. Our go to place for Sunday brunch.", "author": "Angela T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-09", "description": "The food was okay, not anything to rave about. The menu selection was rather slim. \n\nI went with two sides to create a meal. The mac n cheese was super delicious. The brussels sprouts, not so much. They were actually a bit scorched.\n\nThe service was subpar. Our waitress was attentive when taking our order, but once we got our food she did not come back. Our table was rocking and we were worried our food would fall. We had to ask another server to give us a hand with fixing it.\n\nI probably won't be dining here again, but grateful for the full stomach I had that night.", "author": "Ashlee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Wow so glad I found this place (didn't even know it is Michelin recommended).\nThe food was amazing! Also cool crafted cocktails.\nHad the shishito peppers and one of the cheeses to start. I had the steak special (NY strip with roasted carrots, celery root purée and a green peppercorn sauce) and my friend had the shrimp risotto both were amazingly plated and tasted awesome. We also got dessert - I had the banana bread pudding and she had gelato. The wines by the glass were decent also - I had the Cabernet Sauvignon and the Chianti. \nThe ambience was very cozy.\nWaitstaff was friendly and helpful my only qualm was regarding possible understaffing.. waters were not refilled without us requesting more water and we received our bread after our appetizers (it seemed as if every tables bread came out of the kitchen at the same time).\nRegardless food was awesome, I definitely recommend and would go back.", "author": "Kelsea Z."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}