{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-12", "description": "I give this 2 stars purely because of the service. A group of us were there on the weekend and our waiter came to our table twice during our entire seating. We had to ask for everything, including plates! We also ordered their \"scones\" only to receive scones and mini pastries. Please change that in your menu, that's misleading.", "author": "Sue R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "Great place, great food, but right seating. So be prepared to enjoy your dinner very close to people you don't know...nyc pricing to be sure!!", "author": "John M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-24", "description": "I was here on a Friday evening and it was packed. We had reservations so we didn't have to wait. It had a nice, comfy ambiance, great place to eat with a group of friends. I noticed there were a couple tables with kids so I'm assuming they're kid friendly.\n\nOur waiter was nice, but I'm assuming because it was busy, it was extremely difficult to track him down or even spot him. It took him forever to come to get our order. We shared a mac and cheese, which came really quickly. Honestly, it was what I came for due to all the reviews, but it was extremely underwhelming. It was cheesy and had a lot of bread crumbs, but I wouldn't call it the best around.\n\nFor the entree, we had a steak and the burger. The steak, even though medium rare, was a bit tough and dry. The burger, however, was really good. It was juicy and cooked to a perfect medium. At the end of our dinner, it again took us a ridiculously amount of time to get our waiter for our check. Throughout the whole dinner, aside from when our food came and there was a brief interaction, no one came to ask us how it was or offered to refill our water.", "author": "Carmen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "This is the true story (well, review) of a gal who went to Jack the Horse Tavern and had one of the best meals of her life (so far).  \n\nOur reservation was scheduled for 6:30 but due to the poor weather we arrived about 45 minutes earlier figuring we'd kick it at the bar.  And kick it we did.  Happy Hour goes from 5:30-7pm and alone is worth the trip to BK Heights.  The menu included a variety of cocktails for $6, the recommended white/red wine of the night for $5 a glass and a short list of food items.  The first item on the food list: Mac and Cheese.  Jack the Horse Tavern's famous Mac \u0026 Cheese.  On the regular ol' menu this dish is $9... during happy hour its $5.  I don't know about you guys- but that is a deal.  Plus, I was able to put the $4 I saved towards a 2nd round of cocktails.  Back to the Mac \u0026 Cheese.  It. Is. AHMAZING!  Truly one of the best I've had in the city, if not ever, anywhere.  Cavatappi pasta with its deep groves is the perfect pasta to hold onto all the cheesiness going on in this dish.  The Gouda with all its smoky goodness paired with Fontina and its rich creamy taste \u0026 texture is kind of mind blowing.  And if that isn't enough- they cover it completely with buttered and toasted panko crumbs.  It's actually a really small dish (maybe 5\"x5\") - but what it lacks in size it more than makes up for in quality.\n\nThe Nick Hollywood was my chosen drink of the night - Vodka + Canton + Lemon and Sugar - and it was perfect.  A little tart, a little sweet, and pink.  And aren't pink cocktails the best?  \n\nFor dinner I ordered a couple of the smaller plates.  First was the Green \u0026 Red Baby Lettuce salad with shaved manchego cheese, marinated plums, and rosemary croutons all tossed in a riesling vinaigrette ($9).  Everything about the salad was delicious, especially that vinaigrette dressing.  I do wish, however, that they gave me a couple more plum slices (there were only 2 pieces on the plate).\n\nNext up was the Ricotta \u0026 Butternut Squash Ravioli ($11).  Brown butter + capers + sage and grana padano cheese (kind of like parmigiano-reggiano) = melt in your mouth goodness.  Oh, and the dish isn't made with pasta, it's made from cornmeal, which has totally changed how I look at ravioli.  When I asked our waitress about how the ravioli was prepared (seriously, with cornmeal?) she excused herself to the kitchen, and popped back a couple minutes later with a breakdown of the chef's recipe.  The kitchen in JHT is so clever and the Ricotta Butternut Squash Ravioli are incredible. \n\nMy dinner mates opted for larger dishes and ordered the scallops and the skirt steak. The scallop entrée came with four really beefy sized scallops seasoned to perfection.  My mother said, and I quote, \"these are to die for.\"  She also ordered up a side of the garlic chive potato puree (aka mashed potatoes) and devoured it.  I was able to sneak a bite and they were so creamy and smooth.  Delicious!  The skirt steak was seasoned perfectly, cooked up as requested and according to my stepdad is \"one of best steaks\" he's ever had.   For $26 they also give you a huge portion of meat.  I'm surprised he had room for dessert...\n\nBut you can't pass on dessert when a 'gelato trio' is on the menu, right?   The gelato flavors of the night were maple walnut, dark chocolate \u0026 mango.  The mango was a-ok, little bit sweet and very refreshing.  But the dark chocolate?  Holy crap was it good.  I'm not a huge fan of dark chocolate when it's in bar form, but I could have easily eaten another couple scoops of the gelato.  So dark, so smooth, so rich, soooo yummy.\n\nEven when its really good, there's always that one thing that keeps it from being superb, right?  Here the only negative I can think of (and I may even be stretching) is the cost of the wine.  $5 at the bar during happy hour is just fine, but $12 a glass for the same thing during dinner is a bit of a jump.  In fact my mother noticed a bottle of wine she can usually find in her local wine shop for $12 was $52 on the JtH menu.  Wow, major upcharge.   If you do decide to save a few $ and pass on the wine you should be good, the staff is really great about filling water glasses.  They were also quick to clear away empty plates and bring out anything (like extra vinaigrette for my salad) we needed.\n\nWine prices aside, Jack the Horse Tavern is the epitome of a neighborhood joint. It's so comfortable and cozy with its dark wood fixtures, exposed brick and big picture windows highlighting Hicks St.  The staff was so friendly, from the hostess to our waitress, we never felt rushed or unwelcome.  We spent almost 3 hours at Jack's and I cannot wait to go back.", "author": "Alyssa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "We were wandering around Brooklyn after walking the Brooklyn Bridge and we landed on this place for some drinks and a snack. It ended up being happy hour, which as a nice surprise. They had pretty good, strong drinks on happy hour as well, which was really nice. They had a couple beers on happy too. We also had the mac and cheese and a side of fries which were both really good, like fancy bar food.\n\nWe aren't fans of oysters but everyone else seemed to be ordering them so they must have been good.", "author": "Alyxandra P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-14", "description": "Was pumped to try this place after all the mac and cheese and burger reviews. After a wait at the bar, snagged a table and placed my order only to have the waitress and chef/owner ask us to leave as we had an animal (who by the way is a service animal, 5 lbs and kept in an enclosed bag). They didn't even allow me to explain myself and completely humiliated me.\n\nShame on you! Will be following up to ensure the proper steps are taken as the chef/owner loudly mentioned it was a health code violation when it's an even bigger violation to not allow someone who has a service animal to eat at your establishment.", "author": "Tierra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Very welcoming staff, a place, quiet enough to relax or stop by after a long stressful day. Smoked trout salad was amazing!!! Will definitely come back! ))", "author": "Azat T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-04", "description": "Eggs Orleans: possibly the best eggs benedict in all of Brooklyn.  Two organic eggs, plump fried oysters and articoke hearts on home-made english muffins, all  smothered with the perfect silky and lemony hollandaise sauce.  My idea of brunch  heaven.  The baked pesto eggs were good too, if a bit on the petite side. A shame they do brunch only on Sundays.\n\nAmbience - cozy, noisy, casual, with stained tablecloths.  Seriously. black tablecloths stain quite easily, in the company of hollandaise and maple syrup laden brunches.   Both my table and the table next to us had major stains on ours. I fixated on them  during my meal, and it was pretty gross.  I didn't intend to devote more time and words reviewing this aspect of my brunch experience, than writing about the yummy food, but there you go.\n\n5 stars for food minus 1 star for dirty linens.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "A hidden gem in Brooklyn Heights. While the menu is on the expensive side, highly recommend the happy hour. Great mac n cheese.", "author": "Alannah H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-04", "description": "Great cocktails. Okay food. Hated our server. He was obnoxious and and unfriendly. We had Mac and cheese- too many bread crumbs. Steak- nice flavor but over done. Mussels- good flavor and enormous. Carrot cake was great. \nSeriously wouldn't go back JUST because our server bothered me so much.", "author": "Emily N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "This is our go-to weeknight dinner place. The food is always excellent, nice wine list and yummy cocktails. The ambience is relaxed and friendly - our most recent server, Yvette, was delightful.", "author": "Cynthia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "Based on the burger I had and the happy hour specials, this place is awesome. $5 for a decently sized and decently stiff Old Fashioned in Brooklyn Heights? Unheard of. The bartender Aaron is also a cool dude.\n\nThe burger was also quite the experience. Served on ciabatta bread with a nice deal of Asiago cheese melted on top. And the pickled red onions!! Oh, the pickled red onions.\n\nRecently, I heard someone say that if you take a bite out of a good burger, you won't be able to speak because of how it will require all of your faculties to chew and absorb the taste. This burger was that.\n\nThe fries were also quite good, albeit a bit salty. Crispy and they don't skimp.\n\nSadly didn't get to try the mac and cheese. Will definitely have to come back!\n\nThey also get cool points for using Patron bottles as soap dispensers in the bathroom.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Great food- especially the burger, Mac and cheese, chicken, and pork chop.  Have been here about 4 times and the service is hit or miss.", "author": "Sammie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-11", "description": "Very poor service and the meals for 6 on fri night took forever to serve.  My risotto was Uncle Benzy and watered down.   The calamari, shrimp and fish were very Tiny portions.  I will not be back.", "author": "Stan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Classic neighborhood charm with limited menu and lively bar scene. Food offerings are always fresh and updated regularly to keep it interesting. Great choice for experiencing Brooklyn Heights atmosphere.", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-10", "description": "Server was a jerk. Basically, after he took our order, he thought we didn't order enough and that would eat at his tips (we ordered 2 apps+wine per person). We said we would order more later (we usually do) but he said ordering doesn't work like that and the kitchen gets busy so he had to take our orders immediately.  The whole time we were there, the restaurant was only half full and the waiter never checked in again.  \n\nThe food wasn't great. Octopus and sausage was really dry, tasted like 3-day old leftovers. Waiter recommended it (it also happens to be one of the priciest appetizers) I usually eat everything because I hate wasting food and I only finished half. Never going back. I might have given them a second chance, but I don't pay $50/hour to get treated like crap.  The bad service really killed it.", "author": "April Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "For dinner I had a pretty random duo of dishes.  I must admit I had heard the mac n cheese was delicious so I knew I had to order it but was not ready for an entire entree as well so our waiter suggested the starter plate of grilled octopus with cranberry beans, chorizo and kale.  Sounds like a mish mosh of food but it was actually very good. \n\nThe mac n cheese was solid.  Not \"the best I've ever had\" but good.  Wine selection was nice and the prices were very reasonable.  \n\nI enjoyed the Brooklyn feeling of Jack the horse: tea candles, exposed brick, wood floors and a nice crowd!  I heard brunch is amazing so I will be trying that soon.", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "The roast chicken is amazing. I can't wait to go back and try it again. It's a very large portion with both a breast and a piece of dark meat. Definitely large enough to share or for a second meal. \n\nThis place has a nice, cozy atmosphere with a somewhat older crowd for dinner", "author": "Ann L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "Love the location (one block from my house), love the drinks (the bartenders are true mixologists and not correspondence-school trained), but the food is just meh! When Vinny and I moved in together in Brooklyn Heights, we were hoping this would be our \"regular\" restaurant--a place we could go each week where they knew what we wanted to order as soon as we got there. And, sure, we'll definitely return for delicious, fancy drinks. However, we will probably think twice before returning there just for food. Why? Well, on our last visit, Vinny got the mussels, which he described as just being \"okay.\" And, as for me, I ordered the burger, which was really just a slider...and, sure, it tasted great, but portion-wise, it was only big enough to fill up a child. Disappointing, indeed. \n\nThe atmosphere at JTH is quaint, relatively quiet, and romantic, which is a plus. And, as stated before, the drinks are great. But, the jury's still out regarding the food. We will definitely return to JTH because it's so near our house, but I'll only give the food one more chance. Look out for future reviews for additional thoughts.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-11", "description": "We (6 of us)  ordered drinks\nand gave our order for appetizers. After our appetizers we gave our orders for our entrees. About 5 minutes later our waitress came over to our table to apologize that she was sorry but she had to leave and another waitress would be serving us. (We asked if everything was okay and she said she was asked to leave because the restaurant was 'not that crowded'.) \nWe waited and waited for our food.  This new waitress came over with the dessert menus, I said, \"Dessert... we haven't even gotten our entrees\". We waited again. The owner never came out to apologize. The risotto was watery and tasteless. The busboys never came over to replenish our water glasses. \nAfter I approached the owner/chef about the lack of hospitality and service at the restaurant (I knew the waitress had already told him of our complaints) he looked at me and still didn't apologize", "author": "Sheila H."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}