{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "For the most part, Jack The Horse is a pretty good experience. As an upscale tavern in Brooklyn Heights, it offers a good un-pub like menu and a nice bar with a nice selection of wines and a few exotic beers. On a busy night, the bartender can put on a good show of mixing drinks. Yes, its a little small and a little loud but most can find this acceptable.", "author": "Michael A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-30", "description": "Best cocktails in brooklyn, feel free to just ask the bartenders to make whatever they want and you'll have an amazing night.  i havent tried their food but they're always packed for dinner.", "author": "Will H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-18", "description": "jack the horse is a quiet and serene space tucked away on a beautiful little street in brooklyn heights (well, arent they all actually?). its a very comfortable place with an incredibly friendly and professional staff. their food is very very good....the first time i was there i had the lamb and i really dont usually dig on lamb. it was one of the best things ive ever eaten in brooklyn. recently i had a summer soup of peas and mint and i wish i could invent pellets of the stuff to pop in my mouth all day long, it tasted that good. there are some really great wines, including a fantastic malbec (only 30 bucks a bottle) and their cocktail menu is intimidating in a 'how am i gonna try to drink all these tonight' kinda way. go now.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-22", "description": "Date Visited: April 18th\nPeople: Megan\nMy tab: ~$45.\n\nAnother of my neighborhood faves. It seems like every time I walk in this place, there's always the perfect number of people seated at tables and at the bar. The side door to the restaurant was opened to one of the most quintessential brooklyn street corners on a near perfect spring night. I was taking it easy that night and unfortunately skipped a cocktail at the bar, which is always prepared  to perfection, in such a precise and professional way, the bartender makes me think maybe i should be more exacting at my job (and I'm an anesthesiologist). Anyway, I had a sixpoints brownstone ale and ordered a warm savoy cabbage salad with blue cheese, apples, bacon, and what tasted like pure bacon juice as a dressing. awesome. I then had the monkfish, with some sort of mussels sauce and potatoes, while megan had the Pork Loin. Both were great. Once again we skipped dessert and headed to blue pig a block away, finally they cake batter ice cream is back for summer!", "author": "Peter N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "I envision a perfect meal somewhat like this: warm, ambient lighting as soon as you walk in. Upon sitting down at the cozy yet spacious table, delicious bread and wine mysteriously appear out of nowhere! Appetizers wow you, especially the savory cheesecake, Mac \u0026 cheese, and array of salads, and give you pause to wonder what the main course has in store. Entrees far from disappoint, but cause exclamations from all parts of the table at the creativity, flavor, and exquisiteness of the variety of dishes. Most notable is the pork chop - take my word on it. Although stuffed to the brim, dessert is a must, and the myriad warm, cool, fruity, and sweet delicacies tantalize your tastebuds.  After dinner, cocktails punctuate the gastronomical success of the evening. Their Aviation is an exceptional retro favorite, and the bartender knows just the right amount of maraschino to add. I've considered a move to Brooklyn Heights just to be closer to this place.", "author": "Emily R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-05", "description": "well appointed and warm.. with a feeling of history to it..  was it a carriage house perhaps?  not sure. . but it evoked a sense of history...and understated class...I dug that.. the bar was friendly.. the barkeep had a great knowledge of his craft..  me and my pal simply asked for something made from whiskey..  he went off. and returned with two excellent drinks..  my first was blood and sand..  well done..  the second and third. jeez I can't remember names...but alas, you'll be pleasantly rocked... give it a whirl... add in a table seat.. and a nice meal.. yes.. a great spot to take a date..  attentive wait staff...and good meal.. I had a simple personal pizza.. ok.  no rolling of the eyes..  but it was well done.  later a few friends arrived.. and back to the bar.. the tapped brews were interesting...not the samo.. samo...  the owner sat with us.. and met a few new folks... nice vibe... have a drink at the Jack Horse my friend.. and head home. a merry person....", "author": "greg j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-24", "description": "JTH is a great spot to relax and have a great meal in the Heights. Great for the locals since there are only a few decent dining spots like this one in the area. Great beers on tap, nice wine selection too. The octopus appetizer was a must. I've had better mussels in Manhattan, but the herb fries that come with the mussels are a hit. No room for the pear upside down cake, maybe next time!", "author": "P A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-07", "description": "I'm hesitant to write this review because somehow, this remarkable little restaurant on the corner of Hicks and Cranberry flies under the radar. It's right down the street from me, so my husband and I have eaten her innumerable times for dinner and for brunch. We have been really blown away by the quality of food that's served here. The dishes are complex, but not pretentious, and the quality is consistently high. On a recent autumn night, I had amazing meal of braised short ribs with brussel sprouts and mashed potatoes that was just superb. For an appetizer, we split the cabbage salad, which was terrific. I have to admit that It's taken this place a while to hit its stride service-wise, but the last few times I've been there, they've knocked it out of the park. Also, the brunch is fantastic. I always have trouble deciding between the oysters benedict, the pancakes and the smoked trout salad, but smoked trout usually wins out. It's such as unique and wonderful dish, a real treat that I never see on menus elsewhere. The bloody marys are excellent here too. Like everyone else, I give high marks to the bartender. The cocktail selection is really original, and very much reminiscent of Little Branch. We've thought about coming here for cocktails to close out the night - wish they stayed open later! 5 stars.", "author": "Jenn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-07", "description": "We had dinner here on July 3rd.  The food and the wait staff were phenomenal.  My husband and I shared the mac \u0026 cheese dish; it was outstanding!  For our entrees, I ordered duck and my husband ordered hanger steak.  Since I order duck quite often when we eat out, I can confidentially state this was hands down the best duck entrée I've probably eaten.  I prefer my duck medium rare, the dish was prepared exactly the way I wanted it and the portion was just right.  Interesting side note, my husband requested his steak be cooked medium and apparently the chef had overcooked the steak; as our waiter came out to apologize for our wait and indicated that our entrees would a few minutes longer.  Honestly, we hadn't noticed our wait to be very long for the entrees, but appreciated the updated and shared a good chuckle with the waiter about the situation.  The décor is warm and inviting and we felt very comfortable just sitting and relaxing.", "author": "Jean M."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}