{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-13", "description": "I may be the odd one out on this, however, I have had two expereinces at JTH and both were poor. The first was for dinner with friends. The waiter was pre-occupied and seemed concerned with every table but ours. This meant the service was slow and left much lacking. That said, it was not enough to make me not come back. So, on to my second try.\n\nMy sister and I stopped in on a Sunday for brunch. She ordered a sticky bun. Hair in it. Not on it, IN IT. Blonde to be specific. Ok, we thought maybe it was fate's way of telling us we didn't need to order the bun. On to our meals. Took a while to recieve them, but who minds? It's Sunday. We ordered an omelette and burger. The burger? Hair in it. AGAIN. Appetite lost.\n\nAbsolutely gross. Just for reference, neither of us have blonde hair. My sister happens to work in the service industry and so she didn't want to complain. I decided to leave a commment on the card that was included in the bill folder. That was a waste. Never heard back from anyone. \n\nGenerally, I have found the service to be lacking, rude, and frazzled. The food isn't that good to warrant such experiences. Good luck to all who decide to dine here. Just make sure you check your food.", "author": "Monica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "Really lovely place, in one of my favorite hoods.\n\nI came here for dinner, shared an appetizer, had an overpriced (albeit, delicious) cocktail, and had roasted duck with some fancy, whole-foods-shoppin-bikram-yoga-newagey kind of sides. All very good, though they did take quite a while to get to the table.\n\nDefinitely recommended, the atmosphere is very cozy and romantic, too.", "author": "Malarie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-02", "description": "This is a neighborhood spot that is always busy. The reason it's always busy, however, is because it's the only place in the neighborhood serving up tasty contemporary American cuisine.\n\nIt is, however, not great. I've even here many times and always vow to never come back. The reason I do come back is, again, lack of options. My two main complaints are that it takes far, far, far (did I say far) too long for the food to arrive. This happens on a consistent basis. \n\nAlso on a consistent basis is that the cooks don't know how to cook meat. The temperature is always far different than what I request (on either side, it can be too done or not done enough). Hire some competent line cooks!", "author": "John L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "We're pretty much regulars of the brunch menu, and have tried the dinner here a few times.  Consistent good solid food, and it's just down the street (bonus for those that live in Brooklyn Heights).  Cuisine is American.\n\nMy suggestions:\n* Eggs Benedict (and their speciality - the Orleans, which has fried oysters as the meat).\n* Cheesy grits (seriously good).\n\nCan't beat a place that's consistently good/solid food.", "author": "William S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "Jack the Horse is my favorite restaurant.  JTH is consistently packed with locals for a reason -- the place gets it right.  Tim and staff deliver an upscale product with a mood that feels like Cheers.  The food is unpretentious and dependably great, and the cocktails are just excellent.   Atmosphere is inviting and classy, and service is as friendly and professional as it gets.  I live around the corner, and have been a regular for years.  Some favorites are mac and cheese, smoked trout salad and the buffalo rifle, a strong bourbon drink.", "author": "Adam B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-14", "description": "This place is overly expensive for the quality that you get. This is the second time we have been here and both times one of our meals was bland and not enjoyable. The first time it was the pork chop and this time the scallops were just poorly prepared. The rest of our meal was decent but unexciting. The cocktails were probably the best part of the meal. It's a shame the food isn't better because it really is a nice restaurant.", "author": "Jesse L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Came for brunch a little after noon on a Sunday. Was surprised that, even though the place was packed, we didn't have to wait to be seated. Between the three of us, we ordered scones, a Bloody Mary, the breakfast burrito, a Monte Cristo, and baked eggs with pesto. Everything was so different but very tasty. I had the Monte Cristo and it was delicious! The french toast was so perfectly cooked and complemented the ham and Gruyere very well. The Bloody Mary was alright, but nothing to write home about. The crowd and ambiance was homey and relaxed. Definitely coming back for dinner and drinks! Such a cute place with quality food and good service.", "author": "Chelsea D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-12", "description": "I fail to understand the hype about this place, except for its location in a particular corner of Brownstone Brooklyn where is admittedly a dearth of fine dining options. \n\nI found the atmosphere at Jack the Horse pleasant and the food good enough, but with Noodle Pudding and Henry's End just around the corner, I'm not banging down the door to be seated here, especially given the rather steep pricing. \n\nService was a bit frosty as well. I hope Jack the Horse can elevate its game as it could be a wonderful addition to a beautiful neighborhood.", "author": "Kristen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-09", "description": "The brunch is killer!  There are so many delicious sounding dishes, I had a hard time settling on an omlette.  It ended up being just ok but, the scone plate was TO. DIE. FOR.  \n\nLoved the Bloody Maria (tequila bloody mary) and server had a great sparking rose recommendatio (Hillinger).  My boyfriend absolutely destroyed his Breakfast Burrito.  \n\nLots of couples and older families and it was pricey.  I would save this for special occasions.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "So, i'd have to say. This place lives up to the reputation. I went here with my husband about 3 weeks ago for dinner, and it was quite a pleasant experience. We were greeted seat in no time. The setting was pictures of comfortable, intimate,  yet pulsating with energy of what a city like NYC has to offer. We started with some drinks, I had a bramble and my husband had an old fashioned (which he swears is the best he's ever had... Delicious)!. Then for appetizers, we had the ravioli and the beet salad which were outstanding. I had the chicken for a main course and was cooked to perfection. My husband had the scallops which melted in his mouth. Our waitress was an instrumental part of the experience because she was sweet, attentive, yet not intrusive. All in all it was an excellent evening, one I will repeat.", "author": "Elena B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-01", "description": "Jack the Horse Tavern was featured in an article that reviewed the best plates of mac \u0026 cheese in NYC (link below).  I've traveled to farther places for worse reasons...\n\nI'm somewhat ashamed to say this, but when I first stepped through the door, I was surprised to find that Jack the Horse is an upscale (but casual) restaurant -- not the kind of tavern I was expecting (can't you yelpers aim the camera at something other than the food, for once? ha ha).  It was a packed house on a Thursday night, but my friend and I didn't have to wait long for a table to open up.  The atmosphere was lively, but not necessarily noisy.  Having to speak up in order for the person across the table to hear you actually helped drew attention away from the fact that the tables were arranged rather together.  \n\nThe mac \u0026 cheese definitely lived up to the hype.  It was cavatappi noodles in an incredibly rich and slightly smokey cheese sauce baked with breadcrumbs on top.  Absolutely delicious!  \n\nThe drinks were so-so.  I ordered a refreshing pisco sour, which was frothed up with an egg white.  My friend's \"Hemmingway\" daiquiri, however, was disappointing.  I find it difficult to believe that Hemmingway would so heavily obscure the flavor of the spirit with the amount of sugar added to that cocktail.  \n\nI give much credit to the wait staff for taking such good care of my friend and I even though we only ordered an appetizer and a drink each.  I'll be prepared to order a full meal next time I visit!\n\n----------------------------\n\"The Best Macaroni and Cheese in New York City\"\nhttp://newyork.seriouseats.com/2010/03/the-best-macaroni-mac-and-cheese-in-nyc-new-york-manhattan-brooklyn.html", "author": "BT F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "Solid 4 star joint.  Nice pub, friendly bartender, nice selection of wines, retro classic rock playing in the background.  Food was good, but menu options are limited, wish they had more choices.  Still, a great Brooklyn Heights place to know about for drinks and maybe brunch.  I will come back fo sho.", "author": "Calvin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "I randomly came here on a Saturday night with my boyfriend. I loved it! Food was delicious and decor and service was great as well. I had the duck and he had the muscles, both entrees were excellent.  Highly recommend.", "author": "Shelly L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-10", "description": "Beware all families with children in strollers! My husband and I arrived at Jack the Horse Tavern around 11:15am on a Sunday with our two friends and their 5 month old in a stroller. The waitress gave the baby a critical look and returned to us to say our only option would be to use a high chair (the baby isnt old enough to sit in a high chair). Very unaccomodating for families in the neighborhood. I will keep this in mind when I am looking to dine with my own child (due in October).", "author": "Sarah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "Ate here tonight on a whim - excellent food,  creative cocktail menu, and fantastic service. I had the duck breast over farro with dried cherries and a tasty coulis, which was beyond delicious. Nice layer of crispy skin/fat on the duck, and the farro complemented it very well. My wife had a scallops special over fresh corn and a curry/coconut sauce. The sauce was slight and not overpowering - went unbelievably well with the scallops and corn.  Great sear on the scallops.  Grilled octopus appetizer was interesting and tasty. Cooked well, with a nice char. A+ meal all around.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-12", "description": "Ate: Mussels, Porkchop, Brussel sprouts\nDrank: Peak Winter Ale\nLiked: The friendly service\nDisliked: Her porkchop was tough\nChicken: Yes\nWould mom like it?: No\nWait: none\nWould I go back: Possibly\nRecommend: Brunch instead of dinner", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "One of my favorite spots in Brooklyn Heights! Great place for a few apps and drinks or dinner! The macaroni and cheese and Brussels are amazing, a must try!", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "Quaint intimate restaurant that also has a sense of a bar feel up front. The mussels for an appetizer were delicious. The pork chop I had for dinner was even better. \nThe only bad thing is if you go in the winter the front door gives a chill every time it's opened.", "author": "Dani S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-05", "description": "Great cozy place in Brooklyn heights. We had a nice selection of apps including the smoked trout salad and the brussel sprouts. Definitely need a reservation on weekend nights as the place is small and fills up quickly. When we went on a random Monday night in October, it was packed with kids at about 8:00 p.m.  They were mostly fine, but a bit too boisterous and free-spirited for my taste. Seen and not heard...now those were the days:)", "author": "J M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-19", "description": "Me and my girlfriend dined at the tavern on two occasions during our stay in NY in August.\n\nWe were expecting a good experience based on the good reviews we read on Yelp but we were nonetheless surprised by the quality of the food.\n\nWe tried the polenta, the braised pork belly and the summer beans with pistachios as first courses and the pork loin, the half chicken and the hanger steak as main courses ad we really loved the meals. The IPAs were also really good and the service was friendly and caring.\n\nThe place is nice and quiet even with a full house.\nIt was nice being the only tourists among the other patrons.", "author": "Giulio M."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}