{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-17", "description": "While the food was just OK and the rose was subpar,  the service and attitude of the staff needs to be revamped.  We had to ask our server twice for drinks that were not delivered, and at one point, he spilled an entire glass of water on me and into my pocketbook.  I understand that accidents happen, and I received many \"I'm so sorry\", but they (I saw him talking to what appeared to be management about the mishap) didn't even offer to buy me a glass of wine. That shows a complete lack of regard for the patrons.  Needless to say,  we will never be returning to this establishment.", "author": "Marie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "I like this place.  I suppose if it was in the east village it wouldn't last very long, ie it's not the greatest food and a little inconsistent, but everyone is super friendly, the vibe is awesome, and the drinks are amazing, and there are a number of really good items on the menu.  Love the trout salad, the mac and cheese, the burger, the pork tenderloin and the halibut.  An overall solid go to place near our apartment.", "author": "Britt M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-08", "description": "My parents are visiting from KY and I wanted to take them to a great local joint and this is the place!  The cocktails and wine selections are delicious and amazing and cocktails made with great skill.  We had the app special of pork belly and shrimp to start with an old stand by of the pear salad.  The menu is well thought out and appeals to a wide variety of tastes and flavors.  I have gotten the perfectly cooked and seasoned hanger steak several times...maybe should branch out on the menu more, but it is soo yummy.  We each enjoyed our dish very much and after wandered down to the promenade to enjoy the view of the city.  It was a perfect way to spend the last night of their visit.", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-17", "description": "This place was delicious. Yes - the mac and cheese was amazing, but so were the other options on the menu. My group decided to sample everything, and I can definitely recommend the following:\n\nMac and Cheese\nFried Oysters\nOctapus\nSCALLOPS\nFree-Range Chicken\n\nDesserts:\n\nGinger/Peach cake - Delicious and not too heavy\nBlueberry and Goat Cheese cheesecake ***** awesome\n\nAlso, the wine selection is great. \n\nThe place is priced reasonably and is great for a date.\n\nI heard the brunch is amazing as well, so I'll be there in the next few Sundays.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-06", "description": "Great neighborhood setting, attractive restaurant, friendly service, decent prices, so-so food.  Tried a few times and only so-so.  However,  a decent spot for a local meal in a nice setting.  Good date place.", "author": "derek v."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-06", "description": "This place is a gem!  Went for dinner and had mussels and tried the mac \u0026 cheese. My friend raved about the mac \u0026 cheese and although I was skeptical at first, it really IS that good.  A charming place to have a glass of wine and great food...", "author": "Hannah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "This is certainly a gem to find almost at the end of a small, almost non-descript road in the Heights. I came across this place by accident while waking down this street to just get off the main drag. The decor is very intimate and warm. Their wine selection is out of sight and the bar is nice to sit with a friend and trade stories as the sun dips into the river. The food is really good, reminiscent of German fare (I think), but what has really made this place a favorite of mine is their mozzarella and tomato appetizer, served seasonally. They have four maybe five colors of tomato (mmmm) for this plate and it is the best I have ever had, hands down. I like this place for wither having dinner with an old friend or a date. Definitely find this little tucked away place.", "author": "Lani P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "First of all let me say the only reason why it gets 4 stars instead of 5 is because I only went once on Valentines Day so I didn't get to try their full menu.\n\nThe food I had was delicious.  The staff was amazingly sweet.  The only thing I have to say is that it was very expensive, granted it was Valentine's Day, but still I think it could be a little cheaper.", "author": "Laurie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-10", "description": "I'm in. great place. Great staff. Made me feel welcome the moment i walked in. Great beer. Like an old inn. Great food. Went in with an hour b4 my movie started around the corner and they got me out with time to spare--and brought the check without me having to ask. A romantic vibe to this place makes it feel like you're miles from the city. A cool little escape.", "author": "Adam F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-30", "description": "The best restaurant in Brooklyn Heights (although Colonie is definitely giving Jack a run for his money). The mac and cheese and burger are both so good, but everything else is as well.  If you want to try something different go with the trout salad (an app) - it's divine.  Great cocktails. Sits amongst the brownstones.  You won't be disappointed.  Great date spot or dinner with parents.", "author": "Brenna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-09", "description": "I've been here three times for brunch and it is always good.  The english muffins and scones to start are a must. The oyster egg benedict type dish is my favorite.  The crepe special is good, too.  French toast is perfect and the sausage is the best around.  I've also been twice for dinner and the beer list is impressive and the Aviator cocktail is delicious.  Mussels and french fries were great, smoked trout salad was delicious, hamburger was awesome and even the brussel sprouts were yummy.  Great restaurant, great atmosphere.", "author": "Vicki H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-07", "description": "We had Sunday Brunch and thoroughly enjoyed ourselves. The Bloody Mary hit the spot. I had the savory crepe for the day with prosciutto and it was quite tasty. It's in a cute neighborhood by the promenade, so great for a walk afterwards as well!", "author": "Jen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "I have been literally hundreds of times since they have been the last 5 yrs, the best solid good food in Brooklyn Heights. Very consistent good food, the service used to be bad but has greatly improved and now is actually great. The owner is nice. The atmosphere is nice too, the music is perfect, not to loud. The only draw back if I had to pick one the deserts take to long and are to cake'y. The ice cream is always creative though.", "author": "ashley f."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-18", "description": "As always its the little things that added up to a spectacular Valentine's Day Dinner.  Me an my lady went for the Prix Fixe Valentines Day Menu and I must say I was thouroughly impressed.  The service was as attentive as any FIne Dining experience should be.  The atmosphere was nice and romantic and where it really counts; The Food... Everything was great.\n\n-The Behind The Knee cocktail is as good as everyone says! albeit a bit girly for me.  I had the Tea Tippler which was fierce but nice.\n-The Foie Gras which was super rich.  My first time having it ever...\n-The two salads we had were crisp and perfectly balanced and dressed. And I Quote \"This is the best crouton I have ever had and I don't normally like croutons!\"\n-The steak for 2 was perfectly prepared and it rivaled many a steakhouse.\n-The desserts a Creme Fresh w/ crisp Blood Oranges was insane and the chocolate cake was great as well.\n\nI can't wait to go again and try their regular menu.", "author": "Jose V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "This place tends to escape my mind, but every time i go i leave so happy and satisfied.  Drinks and Food are both phenomenal and I have had at least two servers if not more that have actually added positive value to our experience with pleasant banter and knowledgeable recommendations.  After going there on Friday they have definitely been raised to \"go-to\" status in my book.", "author": "Jared P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-25", "description": "I live right around the corner, so I really want to like this place. I brought a friend from out of town here, so she could have one of their specialty drinks, the ones they light on fire. Sort of interesting. Kind of. But it was busy, and the bartender brought it over, unlit. When I mentioned that I thought it was supposed to be set on fire, so to speak, he actually LIED, and told me he had done that already -- on the other end of the bar. The food here may be fine, even good, but bald-faced lying? Not good customer service.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-19", "description": "This is the first review I have ever written online. My wife and I eat out all the time in NYC and I have never bothered to write anything about any of the places we have gone. Jack the Horse is worth the five minutes to sign up for yelp. The Mac \u0026 Cheese app. is one of the most delicious things I have ever tasted. The rest of the meal (Halibut, burger, watermelon soup) was excellent. A great meal in Brooklyn Heights! You must have the Mac \u0026 Cheese. I am serious. It is amazing.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "My boyfriend took me here for my birthday, and we had a really good meal.  I had the steak, which was super delicious!  The service was really professional, fast and friendly.  I like this place a lot; it's in a nook of Brooklyn Heights, and the atmosphere is really beautiful.  We felt like we were in another time.", "author": "Moriah R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-31", "description": "Eat the Mac and Cheese!  And the dressings on all the salads were great.  The Michelada was tasty too.", "author": "Jessica N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-27", "description": "We had dinner at 6, before the crowds came. Despite it being a bit off the beaten path, it truly was a great experience. We had a couple \"Big Lebowski\" level white russians, the oyster soup, braised short rib and seared scallop entrees. absolutely delicious. cozy atmosphere, surrounded by over-sized chalk sketchings made this a truly relaxing dining experience. staff was very attentive, without being obvious. definitely going again. i highly recommend it!", "author": "Danyak D."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}