{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "I LOVE coming here! It's a really authentic Brooklyn Heights type of place...a whole other level from the crappy eateries on Montague St. (what is up with those sketchy diners occupying the most expensive retail space in Brooklyn??)\n\nMy favorite dishes are the mac and cheese appetizer and the steak entree. I've had some good specials here, too. The bread is super-yum! Most of the dishes are a bit weird and random (as in created for sophisticated \"grown-ups\"), but I'm always able to find something. My two favorite things about this place are the ambiance and the cocktails. OMG the cocktails!! They are all very original and creative. (It's NOT a place that has a 2-page drink menu, but just has different types of martinis...apple martini, strawberry martini, etc.) The bartender is nice with an interesting personality. I've never had to wait for a table (but twice we've taken literally the last table in the place, so there might be a wait at peak hours).", "author": "Kelly A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-25", "description": "Considering the Henry Street Renaissance, with the three greats: Noodle Pudding, Henry's End, and the more recent Bevacco, JTH is an also-ran culinary establishment.  The drinks are excellent and the bar is fine, the service excellent, but the food tends to be of mediocre quality, alas, served up pretentiously but mediocre nonetheless..  It seems to be hugely popular with the well-off youth of the neighborhood who often drag their suburban parents along so the atmosphere is quite collegiate, if not jejune.  I guess they think it's a \"grown-up\" restaurant.  If you like your brunch served with plenty of noise (I don't), there's lots of screaming laughter emanating from JTH on Sunday morning and afternoon. Try Bevacco's for brunch--or for that matter dinner.  There's true culinary sophistication at the Henry Street venue.", "author": "Julian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-11", "description": "Hidden away in a great neighborhood is this rustic gem with one of the best burgers I've ever had.  Tonight was my second one there.  They also have a solid list of more upscale items which I can't seem to go for (yet).  \nAdditionally, their brunch is one I'd say is worth the trip from other zip codes.  \nIf I have a tiny complaint, it's that the tables are pretty close together and the room can get a little loud--this is not your spot for a romantic private meal.", "author": "Mat B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-07", "description": "Food was OK (Grilled Octopus, Crispy Oysters, Wild Alaskan King Salmon, Mussels), but the Brooklyn Heights cocktail is great", "author": "Stephan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-11", "description": "Really cozy local place! Sat at the bar while waiting for a table - nice bartenders! The mac and cheese was great and I really enjoyed my burger!", "author": "Bevin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-22", "description": "Fantastic local place. Food is great, especially the mussels, the hamburger and the mac n' cheese. The wine by the glass list is narrow, but pretty good (except the Castle Rock Pinot Noir. Not good.). Beer selection is good and admirably local. Personally, I think that the drink list is only ok. I know that \"old timey\" cocktails are big right now (or were big last year),  but I think that in the context of this restaurant they are out of place and leave a bit to be desired. Overall this is a great restaurant and I am thrilled that I found it (after living close to the neighborhood for two years!).", "author": "Jeffrey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-24", "description": "Had a great Valentines Day dinner with my wife. The drinks were really good with a great variety. Appetizers, meal and dessert were great.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-21", "description": "The bartender must part his hair with a ruler. He wore a white apron, a high collared shirt and vest... I kept expecting him to slip into sepia and shout \"Extra! Extra! Read all about it!\". He had an extraordinary sense of economy and showmanship and served my friend's Rye over a perfect 3x3 cube of ice. Beautiful.  waaay to swanky.  but good for one drink if only to watch the newsie behind the bar crush a mint leaf like he was delivering Shakespeare.", "author": "M B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-02", "description": "My husband and I had a lovely meal here. We made a reservation only an hour before coming and did not have to wait at all for our table even though they seemed quite busy. The food is rich, creative and our waitress was adorable and professional. Its a bit on the expensive side, but fine for an occasional splurge because the food is amazing. We were left feeling it was worth it for such a pleasant evening.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-09", "description": "If you live in the Heights this is a must go to restaurant.  If you dont its worth the trip.  The service is nice.  The chef really knows how to mix flavors.  Have the smoked trout with almond salad its fantastic.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "This is a great neighborhood restaurant that is also worth a trip if you want to check out beautiful Brooklyn Heights.  Though not huge, the menu has lots of great choices and the atmosphere is cozy and romantic.  I'm not much of a mixed-drinks person but everyone I know swears by the cocktail list.", "author": "Karen D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-19", "description": "In this category of food (higher end American) Jack the Horse is exactly what I'm looking for. The food is consistently good and there are always a number of enticing options. I also like that it stands on it's own in this area as it makes the experience a bit more quaint and romantic. Service is decent but could be better, especially at the front of house.", "author": "Adrienne P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-23", "description": "Jack the Horse is a great restaurant and has a very cool story behind it.  Tim Oltmans is a chef who made a  big move in his life to leave the traditional career life and jump into his true love.  Ask him when you are there, pretty cool story.  The service has matured well and Tim's menu evolves and changes in tune with seasonal ingredients and several mainstay signature dishes.  The macaroni and cheese I would ask for all three courses!!  Presentation is outstanding and overall a wonderful experience....you cannot go wrong here!!", "author": "Paul R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "I can't speak about the dinner experience but I frequent this local spot for drinks at the bar. They make extremely well crafted cocktails and watching the bartenders create these concoctions with a dash of bitters here and there is so fun. Get the mai-tai if nothing else for the giant block of ice down the middle. I love everything about the drinks here but with everyone being so friendly and the atmosphere being so cozy, it just makes it even more of a delightful experience.", "author": "S F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-23", "description": "Delicious food and classic brooklyn hts ambience.  Jack the Horse is a dressed up old world pub/tavern.  The food and presentations are top notch.  My table tonight ordered the cod, grouper, scallops and mussels - everyone was happy.  We also ordered a mac \u0026 cheese (which is phenomenal) and a side of brussel sprouts (also fantastic).  The Oregon pinot noir for $36 was great and our server was very helpful.\n\nI can't believe it's taken me 3.5 years to discover this place.  It's a real Brooklyn neighborhood gem and I'll definitely be back soon.", "author": "Josh G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-24", "description": "If you live in The Heights, you have to come here.  Great, simple food.  Have had some problems eating at the bar (some bartenders here dont seem to like it), but other than that, it's great.  Dark and cozy -- can be loud.  Not good for kids (thank God).", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-15", "description": "The food was quite good. I had the duck and it was very flavorful and fresh tasting. The drink list is extensive and interesting, and perhaps somewhat overpriced ($12 or more seems common).", "author": "Doug J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-10", "description": "I adore this place!!  Delicious salads, burgers, entrees. Great ambiance.  Very nice, friendly staff.  This is the best restaurant in Brooklyn Heights!  I highly recommend it!", "author": "Juliana G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-18", "description": "There's so much here to call diners to attention, and as we found last night, there's so much to recommend. I'll be short with it: spaciousness, graciousness, and an open disregard for the perils of being too prosaic or too precious with the menu. In other words, the place exudes a kind of category-defying confidence I don't see too often in Brooklyn, and far less so in Manhattan. Everything tasted and drank winningly.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "Came in right as the Nor'easter was blasting snow! What great timing! Happy Hour! Had the Brooklyn Heights and it sure warmed me up!Sat on the bar where the people were friendly and helpful. Ate the Mussels which were DELISH! My friend tried the Old Fashion which was wonderful as well. (Can't beat the Happy Hour prices) Loved this place. Atmosphere was charming and cozy. Will make it a regular spot for sure!", "author": "Michele W."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}