{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-17", "description": "Great drinks. Both the appetizer, a special crepe and butternut squash, and Risotto entree, were amazing. This is a place that is well worth the price.\n\nNice atmosphere, quaint and not too crowded.", "author": "Meagan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-21", "description": "I am giving JtH 5 stars for being nice enough to respond to my review, and reach out to me to apologize for what occurred.  The owners even offered me a free meal, which is totally unnecessary but a kind offer.  I'm just super impressed that they responded, were kind, and have done something to correct the customer service issue.  I will definitely be back.", "author": "M M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-19", "description": "The food was fine, but the service wasn't that great. The waiter was completely inattentive and was really slow with everything. I definitely won't be going back again.\nThey did have a nice cocktail menu, though.", "author": "Sachin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-18", "description": "I still dream of the French toast, and that was months ago that I ate there. Good lord.\n\nAnd now that I've been back, I can say that those were unbelievable blueberry pancakes and, while I didn't have a cocktail, I could see plainly that Aaron was a knowledgable and attentive bartender. I don't think that a Manhattan would have gone well with the pancakes, but I'll be back soon to see what he can do with one.\n\nHe also had a knack for knowing exactly when I was going to want more coffee. I was very impressed.", "author": "Brian D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-29", "description": "Located on an idyllic Brooklyn Heights street, this place is truly a gem. The cocktail menu features creatively named concoctions that and the food is excellent (many, many steps above tavern or pub food). The artichoke appetizer was delicious and the mac and cheese is a must-have. We love bringing people here to show off our beautiful neighborhood and this place is a stellar example of top Brooklyn eateries!", "author": "Jen O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-05", "description": "My review is based almost solely on their Mac n Cheese.  It was the 2nd stop on the Mac n Cheese crawl today and totally made up for a kinda \"eh\" mac n cheese at our first stop.  The staff were all great, they tolerated that our party had dwindled from the original estimate of c. 20 people to only 8, and didn't seem to mind that all we ordered was 4 servings of mac n cheese and some beers.  Our waiter even said he had the mac n cheese a few days ago and could still taste how good it was.  The chef came out to meet us since we were the only people in there at 3:30 in the afternoon.  If the mac n cheese is a good indicator of how delicious the rest of their menu is, this is without a doubt a place everyone needs to check out.  I think some of us will definitely have amazing dreams tonight about this mac n cheese.\n\nOh and the restaurant itself was beautiful.  A great place to take a date, or to sit at the bar, as other reviewers have mentioned.  I didn't have any of their cocktails, but they sounded great.\n\nSo make your way over to Brooklyn Heights and at the very least have some mac n cheese.  It is completely worth it and may even be life-altering.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "The location of the restaurant is a bit weird.  It's in a very residential area with lots of brownstones in the area.\n\nMy first thought when I went in was \"Man, it's bright in here.\"  Granted we were there around 4PM on a sunny spring Saturday, but the bright dining room made it feel very warm and comfortable.\n\nThe mac n cheese is awesome.  I almost never order mac n cheese at a restaurant because I figure I can make mac n cheese at home, so why should I order it at a restaurant.  Well, I might have to change my outlook on ordering mac n cheese.  \n\nThe portion was a bit small, but it was fantastic.  It had a nice crusty layer on top and the cheese was not greasy or runny.  Just creamy and cheesy and heavenly.\n\nI'd like to come back here with my GF one of these days and check out the rest of the menu.\n\nOh yeah - the owner seemed really nice and she was very warm and receptive when we walked in.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "The food is creative and consistently good. The service is solicitous. And who doesn't like eating while tucked away on a quiet Brooklyn Heights street. All that said, the clientele at this place looks like it showed up for a casting call for a PBS documentary about upper middle class Caucasians. In sweaters.", "author": "Eric D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "Went for Happy hour and really enjoyed it. Looking forward to the next visit.", "author": "J P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-13", "description": "Meh. Nice cozy interior.  Too bad the rest was pretty disappointing. I felt rushed from the beginning but in full disclosure we arrived roughly 25 minutes before the kitchen closed but we ordered right away.  I thought the food was extremely salty and very overpriced.  Even though people rave about their Mac and cheese, I found it too be very oily.  Oh and I paid $4 for an 8 oz bottle of Sprite.  Can't say ill rush back.", "author": "Kristin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-02", "description": "Brooklyn Heights is a beautiful, quaint neighborhood with breathtaking views of Manhattan. But it is not known for it's good restaurants. Jack the Horse is one of the only standouts in the area, a good spot for brunch.", "author": "Jackie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-14", "description": "I just can't jump on the bandwagon here. The food was OK but the service and the attitude just left us wanting to spend our money elsewhere...and we gave it two chances just to be sure. Two different servers both with unacceptable attitudes. But the last straw was the manager who could have cared less when we expressed some concern about the uncalled-for attitude. That's when we realized it was hopeless and  from where the attitude was originating. Thank goodness there are so many other great restaurants in the area that value customers. We feel no loss.", "author": "Jack H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-29", "description": "Have been there for brunch twice.  Really enjoyed the food both times. Service was excellent the first time, disappointing the second time.  BUT I'll definitely go back and chalk up the bad service to a bad day.  Besides, I'm probably willing to put up with somewhat crummy service to have more of those brunch offerings!\n\nI love the Red Flannel Hash (Poached eggs, corned beef, roasted beets, potatoes \u0026 toast) and ordered it both times.  \n\nBrioche French Toast is also very, very good.", "author": "Ori B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "This place is really cute and the food was really good. The ambiance is nice enough to bring your parents or out of town guests, and also great for a date. Its not pretentious at all though. I got the scallops and my husband got a fish that was on special. Also had the mac and cheese as an appetizer. Everything was really good. The staff was also very friendly. The only thing that was a bit off was the timing for our waitress. She took a while to take our order and wasn't really around when we needed her, but then would check in often when we didn't need her. It may have just been because it was the end of the night and she was wrapping up. Overall, this place is really good and I will definitely be back.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "That mac and cheese... UNF. Went back for happy hour and grabbed a couple of $6 old fashioned's which were quite stiff. Sure, they use well liquor during happy hour, but come on, what did you expect. But that $5 mac and cheese was probably the best $5 I've ever spent. I'm salivating just thinking about that smoked gouda and fontina laced cavatappi gut bomb. After we inhaled the first one we promptly ordered another one which soon met a similar demise. Suffice to say that following weekend I recreated that dish at home and although not quite as nirvana inducing it was definitely good enough to sate my now constant cravings. I'll definitely be back for more happy hour binging.", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-13", "description": "I went into Jack the Horse expecting nothing more than to have a couple of drinks after work and some \"tavern\" food to go with them. I was in for quite a nice surprise instead.\n\nWhile we didn't quite have a proper dinner, but rather stuck with appetizers and a burger, everything was really good and the menu promised a lot more goodness were we up for a full dinner. The appetizer macaroni and cheese was spectacular and so was the special ceviche. \n\nHowever, things only got better when my friend couldn't stay away from an intriguingly named cocktail: Man of Leisure. We discovered that Aaron, the bartender, is quite a mixologist and we thoroughly enjoyed a couple rounds of cocktails and a decadent goat-cheese blueberry cheesecake.\n\nA lot more over the top than my typical reviews, I know, but I love it when I am totally surprised by a place I had little knowledge of and no expectations.", "author": "Ciprian T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-13", "description": "The food and drinks here are great and they have an amazing happy hour. However the service is embarrassing, and this is not the first time. The last time me and a few friends were here the ( male bartender) was extremely unprofessional he dropped the F bomb about 4 times for very unnecessary reasons and was rude to us the whole evening. He treated us as if we were of lower class. We were not thrilled at all with our service so we did not tip over 20% we still tipped but not a large amount because the service was not good, we even filled out a survey card and explained our reasons. After we left we spent a few minutes outside talking  and when we were talking the bartender  came out and confronted us, and proceeded to give us an ultimatum but then did not allow us to respond to what he said. I've worked in customer service for many years and no matter what happens confronting the customers NO MATTER WHAT is not ok. It is completely unprofessional!! And we still tipped him, we were just not satisfied with our service so we tipped less. I really enjoy the drinks and food her but will by be returning because the service is never really good and this experience is the last straw. The owners need to figure out what to do with there employees.", "author": "Savanna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-20", "description": "I'M IN LOVE!  If ever there was a place that embodied the perfect little restaurant, I would argue this is it!  The atmosphere is warm and welcoming while still remaining special.  The service is refreshingly professional without being pretentious.  The cocktails are remarkable because they are truly unique, well-crafted with fresh ingredients and a sense of pride on behalf of the bartender.  The food...well the food is simply amazing and unexpected from such an unassuming little enclave.\n\nYOU MUST HAVE THE MAC \u0026 CHEESE!  I understand that everyone and their mother will say their mac \u0026 cheese is the best but I assure you it is not...Jack's is the best!  I have tried their burger, steak, pork chops and a veggie risotto special.  All of these were divine!  The menu at first sight seems simple but another look and you'll find that your meal will be just a touch unique.  I happen to like places where I recognize the dishes and their ingredients but also know my palate will experience a new twist on the tried-and-true.\n\nThe atmosphere is storybook. Brick walls, big windows, candle light all hidden away in a charming little corner of Brooklyn Heights. Might I also add that the owner's love for his place \u0026 his craft is incredibly apparent.  He was friendly with us and even bussed our table since he knew they were busy that night. You simple can't beat that kind of customer attention and appreciation.", "author": "Monica V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-04", "description": "A lovely upscale but still neighborhood-y restaurant.  The food is delicious,even if not particularly inventive.  The trout salad and mac and cheese are both standouts, but the burger is quite delicious as well.  Great for brunch, dinner or even just a drink and appetizer sort of drop-in.", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-08", "description": "Our new favorite neighborhood spot. Amazing for brunch especially. Get the scone plate!", "author": "Zach F."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}