{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "BEST mac \u0026 cheese in my life!  I credit the cheesees they use: smoked Gouda \u0026 Fontina.  With the tiny crust on top, this made mac \u0026 cheese a true gourmet experience.\n\nI had the mussels with toasts and fries, and I loved it.  My boyfriend had the special of the day: fish.  I can see how disappointed he was at the portion, but the fish was also cooked to perfection.  Why must good things come in tiny portions?  We are not Hollywood people nor runway models, we eat!\n\nOverall, it is a nice find...little cozy romantic upscale restaurant in a residential neighborhood would come back again!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "Walked in during happy hour. Bar area was crowded. Dining area completely empty. Hostess said the bar was full and to try the room next door (different space, same restaurant). I went elsewhere.\n\nUnsure why you'd turn down business while the dining area remained empty. \n\nAccommodate your customers.", "author": "John J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Came here for brunch - first time visit for both - while the food was fine, we were placed at a table for two and honestly when the tables were shoved over to let me in, I sat down and felt trapped - not only could I not get up during the meal which is not usually a problem but, at the conclusion of our meal, with two other filled tables on either side of us....AWKWARD trying to get out - good thing I am not a big person - AWKWARD...everyone is disturbed.\nI think they need to remove at least one of the two person tables along the back wall - TIGHT!!!\n\nI would come back and try dinner and drinks but, never again along that back wall.\n\nNote: I would not even attempt to bring a stroller or children in here.", "author": "Sue b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Had the spinach pesto omelette, cheddar grits (hard to find in the city) and side of bacon. The side of bacon was a heaping mound of good bacon, yes! The only was fluffy and flavorful and the cheddar grits wee very well seasoned. My omelette came with salad which needed more dressing, but not a big deal. Loved the drinks! Strong and you get you money worth. Was picked at opening, but it is a nice day weather wise.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "Brunch menu was inventive and oh so delicious. Had the shrimp sandwich and smoked trout salad. Uncommonly flavorful. Service and ambience was equally appealing.", "author": "Stephen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "My wife and I have moved away from Brooklyn Heights but still love to come here for brunch.\n\nWe had brunch here today with old friends and the food and service was excellent. My only personal \"negative\" was that they no longer offer regular Eggs Benedict. I'm sure I have eaten that at JTH previously. My wife, however, loves the version with oysters. \n\nThe French toast our friends had and the omelet I had were all delicious, as were the brunch cocktails and coffee. \n\nThe only reason for 4 stars instead of 5 is that the music is a little too loud and that, combined with the proximity of the tables, makes it difficult to have much conversation.", "author": "Rich M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-08", "description": "We were in town for business and used yelp to look for fine dinning. Decided to visit and we had the free range chicken  dish  and the pork rib chop. The food and the ambience were excellent, the service was average.", "author": "Millie A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-28", "description": "Came here for Sunday brunch. Bad waitress and that kills the entire experience...\n\nBloody Mary was not impressive either. No drink specials -- $9 for a mimosa and $10 for a classic bloody. \n\nOn a good note, they only use organic eggs. I was hoping to try an omelet but the only come \"standard\". So paying to add a protein was not an option. Wth? I'm PAYING. But anyway, no food for me and I will take my money and appetite elsewhere. Minus the $10 wasted on the Bloody Mary. \n\nSo -- 2 stars because the hostess was quite pleasant. Very pleased with her energy. She should pass some along to the slow, terrible waitress.", "author": "D. Michelle D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-16", "description": "Cozy and friendly restaurant tucked in a quaint neighborhood in Brooklyn. Good date spot, comfy décor, slightly dim for dinner but not too dark that you can't see your food. I like that it doesn't get too crowded or loud on a Friday night with single young things filling up the bar area, hitting on each other. \n\nFood was good, but not exciting. Slightly creative, but didn't hit the target. We ordered:\nMac n Cheese: one of the better one I've had. Not too thick with a nice crust.\nBurger: well seasoned and juicy. \nMixed Herb Polenta: nicely browned n crispy slab of polenta with a creamy mushroom sauce. It was good, but the high acidity of the mushroom keeps throwing me off. Just a tad too sour.\nScallops: simple caramelized scallops. I didn't care too much for the corn medley it came with- tasted more like canned corn instead of fresh corn from the cob, which was a bit disappointing.\n\nThis is not a must-return spot for me for dinner, but I would like to try the brunch here- heard it's quite delicious.", "author": "Huong V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-12", "description": "We have been to this place at least 8 times in 3 years (we live in the neighborhood), and used to like it a lot - but in our opinion it has gone downhill... the last two visits have been mediocre to low quality.  We don't understand why.  My wife ordered the short rib - whatever they served was not a short rib, we know what a short rib looks like and tastes like and this wasn't it- and it was burnt and tough.  We also got the hangar steak - which was overly-seasoned with something (soy sauce or teriyaki, don't know) and didn't taste fresh.  No refills on water and no bread basket brought to the table.  The other dish (roasted chicken) was good and my drink was good.  For these prices, this shouldn't happen.  We are considering not going back due to this.", "author": "Bernardo F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Loved the Nick Hollywood we ordered during Happy Hour. Also ordered the mac and cheese and the fries which were great.", "author": "Katie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Cozy atmosphere. Great service. And enjoyed $6 old fashions during happy hour on the weekend.", "author": "Kristina N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "Went here last night with my husband. Fortunately we arrived around 7, early for the dinner rush. \n\nOur waiter seemed enthusiastic but a little too much as he kept trying to sell us the higher priced meaty entrées, the steak and prime rib. \n\nWe ordered the mac n' cheese and brussel sprouts to start. Both were good. \n\nI had the burger with caramelized bourbon onions. It was great! Just the right amount of meat to bun. The bun itself was more like ciabatta than a soft burger bun. But it wasn't too big. The meat itself was a satisfying medium rare. It came with just the right amount of fries which were crisped to perfection. \n\nMy husband had the squash risotto. He was meh about it, not ecstatic, especially since it was $20+\n\nI had a sidecar cocktail which was yummy. Husband had the Buffalo Rifle. Also good. \n\nWe finished off with a trio of their gelato. Baby scoops of blueberry, hazelnut, dark chocolate. Again, a perfect portion to end the dinner on a sweet note.", "author": "Nancy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-13", "description": "Happy hour at Jack the Horse is a great deal, so I've been back several times.  The bartender is always attentive since it's a pretty small bar.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Now that I have been to JTH pretty regularly I can honestly say this place is fantastic. (I think I was a tad bit harsh in my initial review as my only qualm is the coffee here). The food is always good. The eggs Orleans are exceptional and the cocktails are reasonably priced. I've always had attentive service and reasonable wait times. Best brunch spot in the neighborhood. If you're not into brunch, definitely come here for a cocktail and some oysters and the delicious shisito peppers at the side room.", "author": "Daniela L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "The burger was miles better by a long way than Minetta Tavern, the mussels from Maine huge and delicious, Mac n cheese as good as the other reviews say and cocktails great. Totally recommended. Plus, great location and chilled out atmosphere. Background Music to boot. Perfect", "author": "Sally M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-29", "description": "The food at JtH was pretty good.  Started with Polenta, egg and tomato starter which was fantastic, highlight of the meal.  Then a rich mac-n-cheese with complex, pungent chesses, no velveeta there, tho a little over-salted.  Finally a salmon special with some mexican flavours, ok, but slightly dry and certainly not the medium-rare we asked for.  \n\nThe service was poor.  I asked for a corner table - and they confirmed they had it covered when they called to confirm the booking earlier in the day.  We arrived and were shown a table in the middle of the room with waiters brushing by.  The woman on the door half-apologized, then blamed the head waiter and said it was his fault for giving the table away, and he'd be over to apologize/explain.  He never came.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "Came on a rainy night, and was pleasantly surprised that we were able to get a table for four last minute.\n\nThe food is good, but don't be fooled by the word tavern, this place is not cheap. Although, I guess that's to be expected given the location in prime Brooklyn Heights. Very pretty space with a nice menu of standards (burger, steak, mussels). \n\nCocktail menu has some interesting options, which would also make this a nice spot to grab a drink on a rainy day!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-28", "description": "I created this account specifically to review Jack the Horse Tavern. On Tuesday, July 26, I ordered duck and by the time it arrived at my table, it was just room temperature. No big deal. I'm sure coordinating a busy kitchen isn't easy. To my surprise, however, I lost my appetite after eating just a third of my meal. (Apparently, room temperature duck tastes a little metallic.)\n\nI mentioned this to my waiter and he responded as you'd expect, with a genuine interest in making things right. That was totally sufficient to me. I didn't want anything.\n\nAs any good waiter would do, he went and reported the problem to his manager. I appreciated the gesture sincerely, but still, I didn't want anything. Surprisingly, this is where things went bad. The manager began gesturing in a way that it was clear she was dismissing my feedback and his effort to make things right! He turned bright red, clearly embarrassed by her response.\n\nThere are so many good options in Brooklyn Heights. I don't need or want to go back...ever.", "author": "Mischief M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "I officially bequeath the crown of phenomenal dining to Jack The Horse Tavern.\n\nIf you thought Manhattan was good, Brooklyn's got the real deal. Ok fine, snicker a little at the name (It's named after the family's old vacation spot in Minnesota, called Jack the Horse Lake), and be completely blown away by the food. Tucked away in a quiet Brooklyn Heights neighborhood, you'd never think there would be a pristine DIAMOND here. Absolutely loved it. I came here with a group of 8 and ordered almost everything on the menu. Here are the top choices:\n\nAppetizers:\nMacaroni \u0026 Cheese: a lovely mix of fontina and smoked gouda \nTomato Polenta with Slow Cooked Egg: Crispy, savory, and unforgettable\n\nEntrees:\nGrilled Pork Chop: pretty unfackingbelievable\nPan Roasted Diver Scallops: gulping down 6 scallops in less than 2 minutes seemed to go too fast\n\nPersonally, the only thing I didn't love was the short rib special. Slightly oversalted. But everything else TO DIE FOR! Service is beyond excellent and every single dish was consistently just as good as the next. Come here to give your stomach the royal treatment.", "author": "Emma C."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}