{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-13", "description": "Love the hangar steak still.  Great wine list.", "author": "Meryl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-02", "description": "Certainly the most compelling restaurant in brooklyn heights. The drinks and dessert are absurdly tasty, while I have found that entrees, while creative, are often too fruit-embellished for my taste, though maybe I've ordered wrong. Still, it's a very worthy neighborhood restaurant, especially considering the dearth of good food options in this neck of the woods.", "author": "Delilah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-24", "description": "The leafy streets of Brooklyn Heights quickly turn to post-autumnal strips of Radio Shacks and sundry merchants on crestfallen Montague Street. Off the beaten path, on quiet Hicks Street, Jack the Horse Tavern shares an intersection with stolid residences and a quaint veterinary clinic seemingly lifted from a bucolic English village. Passing through the red door and past the well-stocked bar, diners are quickly comforted by unpretentious paintings and spacious tables that echo a bustling Manhattan restaurant yet resonate with a Brooklynite's concern for ease and neighborliness.\n\nJack the Horse Tavern takes its name from the Minnesota lake where chef, Tim Oltmans, fished with his father as a child. But the food is neither Midwestern nor Scandinavian. Oltmans left a career in engineering, enrolled in the French Culinary Institute and then worked for some of the most successful chef in the New York of the 1990's. His menu features fresh vegetables and local meats and reads with cadence of Tom Colichio's Craft menu: \"Roasted Crescent farm Duck Breast, Farro, Braised Fennel \u0026 Sherry.\" No surprise considering Oltman's worked for Colichio during the renowned chef's tenure at Gramercy Tavern.\n\nJack the Horse Tavern's menu is simple, appetizers and entrees; the former run between $8 and $11 while entrees are priced between $14 and $29. The appetizers are a bit heavy for my tastes, but the flavors are fresh. And rich, a spinach and arugula salad is dotted with dried fruit that would benefit from fresh fruit instead--not just for texture but also for balance. In general, Oltmans' salads are a bit too rich, overdressed perhaps. The country pate was the best starter I have tried with the mac \u0026 cheese, with Cavatappi, smoked Gouda and Fontina, is wonderful (maybe the best I've tried of this overplayed dish).\n\nStart, however, with a drink. The bar is slow, tended by a single mixologist who is also providing dinner service to 6 to 8 regulars who could not wait for a table. Watching him work is pleasant and relaxing, though. With sleeves rolled up and pomaded hair, the bartender mixes 10 or so cocktails of his own concoction that are nice variations of classics. The Lucien Gaudin (Plymouth gin, Cointreau, Campari and Dry Vermouth) crisply expands the Negroni. His El Diablo adds muddled ginger, which he peels and cleans per order, to this superior take on the margarita. A round of drinks arrives like a course so order ahead, or come early and watch this gentleman ply his trade while sidling up to the small but always crowded bar.\n\nThe chef's hand is much more deft in the realm of entrees. There seems to be a steady rotation of specials (recently I enjoyed a quick-poached trio of salmon cuts) that are reasonably experimental. The diver scallops were a bit sandy on a recent trip but well matched with Brussels sprouts and a Mediterranean cous cous (cleaning the scallops thoroughly would seem to be the provenance of a porter or fish butcher and not the chef's fault). The pork chop served with a summer potato salad was full of Germanic flavor, apple-laden and satisfying. Every restaurant has become infatuated with mastering the hamburger, finding new buns and inventing pickle combinations; for whatever reason, Jack the Horse has followed this trend with little noteworthy success. (At $14 it is a bargain, however.) The Angus strip steak is wonderfully French and is worthy of mention though at $29 it seems a bit out of place on the menu.\n\nJack the Horse Tavern will not be confused with Peasant or BLT, but it offers Brooklyn a more friendly version places like the Spotted Pig. Oltmans can be seen navigating his kitchen through the storm of an evening with a smile on his face and the thinning ponytail of a man reliving something youthful and earnest.\n\nAnd this is what is so endearing about Jack the Horse Tavern--it does not stand out on the corner of Cranberry and Hicks; instead, it has defined and blended in to that cozy, quiet spot.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-14", "description": "Phenomonal. Food was awesome. Cocktails amazing, best bartender in the world.", "author": "Brian B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-19", "description": "I have to admit they did pick the perfect location to set up a restaurant. It's nicely tucked away in a very quiet and scenic corner of residential Brooklyn Heights surrounded only by brownstones and trees. There are no other businesses around on the same block to compete with, so this works to their advantage.\n\nIt tends to get crowded during the weekend brunch hours. It's better to sit at the bar than to wait an hour for a table. The interior is modern \u0026 cozy with brick walls and polished wood all over the place. The windows are wide and welcoming to the warmth of sunlight.\n\nThey do have a great beer selection on tap, but the prices are slightly higher here than Henry's Ale House around the corner. I prefer to get the same quality beer there than here. \n\nI had the \"Eggs Orleans\" consisting of 2 poached eggs (organic), fried oysters, artichokes with hollandaise sauce on a house made English muffin with mache and radish slices on the side. I was addicted to the fried oysters, but unfortunately it only came with a measly 4 pieces to a dish. I would have been satisfied if they added 2 more pieces. They are so awesomely tasty!\n\nThe English muffin was not toasty and had a fluffy dough center. It tasted more like a biscuit than an English muffin. The heavy layer of hollandaise sauce over the poached eggs was complete overkill. I'm not crazy about the taste \u0026 it didn't go well with the dish. I suggest they use melted brie as a better substitution. The artichoke was tasteless. I recommend they saute it or replace it completely with asparagus.  The mache \u0026 radish did not come with any dressing. I had to ask for it myself instead them offering it to me.\n\nThey are creative with their menu, but they don't use the right combination of ingredients to make their dishes exciting. They lose 1 star for the hollandaise sauce \u0026 another star for the Enlgish muffin that doesn't taste like one.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-05", "description": "Jack The Horse is simply the best.  I awaited the opening of this place some 5/6 years ago...I have been a devoted customer ever since.  The decor is simply lovely. The food consistently spectacular.  Whether you have the fried oysters, the soup of the day their steak or sokota burger, you can rest assured there are no bad choices on this menu. Whatever your proclivity, it will be met. Tim, the owner, remembers you and is very thoughtful with his devotees and   first time patrons alike, that  only adds to the experience. Like all restaurants they have had lousy servers but even that is remedied by your next visit.\n  Brooklyn heights has added quite a few eateries as of late and that's great, but this place will be an institution...\nI have to mention their Brunch, whether you need your egg poached to perfection or you rather the brioche French toast or pancakes with sausage this is also a worthy experience.. Full bar....", "author": "Tanya E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-25", "description": "i had been wanting to go here since january and i am glad i finally made it because i really liked this place! the wait staff was very friendly, we didn't feel rushed, and the waiter reco'd a great drink - a \"behind the knees\". it was delish.\n\ni can't really recall what i had but i do remember it being yummy and my bf loved his chicken. the wine was yummy and our next-door-diner was super funny and drunk and he sang us a song about sarah palin being a washed up has been politico (fingers crossed).  what a fun night!", "author": "Kenna T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-02", "description": "messed up our reservation, the chef/owner was rude and made no apologies for his mistake. Slow service. Pork chop overcooked and chewy. Bass portion was a joke 1 inch by 2 for 26 dollars. Go somewhere else", "author": "Lori S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-28", "description": "I'll be short - mac and cheese (gotta love the gouda), smoked trout salad, skirt steak!! Absolutely delicious in an amazing atmosphere. A new favorite haunt in Bklyn-", "author": "Joshua A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "I'm not saying that JtH single-handedly converted my father-in-law to Brooklyn, but I'm not saying that it didn't. Three of us lounged on the cushions. The cocktails we had to start the evening were fantastic: I had a Behind the Knees with possibly my favorite liqueur, elderflower. Other members of the party had a berry cocktail, the Old Fashioned, and the Brooklyn Heights. We all had to try each other's, they were that good. Great way to start the evening (birthday dinner for my husband), along with awesome crusty bread. Apps were delicious -- I LOVE beets so had the very fresh and tasty beet salad, but I was eyeing everyone else's too: smoked trout salad (smelled divine), green salad (gorgeous), mac and cheese (sounded EPIC!). Everyone cleaned up their dinners with gusto: the scallops I almost got, the salmon I also almost got (diner requested sauce on the side and they were happy to oblige), the halibut special I also almost got, and the mussels I DID get. Mussels were tender, country bread was toasted and crunchy, and the fries dipped in the flavorful broth were divine (everyone had some). Upon our server's advice, paired with a great Chenin Blanc. Finally dessert: both pairs ended up ordering the peach upside down cake, which was divine. The herbs in the peaches were a revelation, and the cake was fantastic -- crispy broiled outside, fluffy soft inside. They even wrote happy birthday on my husband's plate. Aww! I'd love to come back and try some of the cheeses on the dessert menu... and everything else, of course.\n\nThe food was very pretty and SO well executed.  I've had all these things before, but the care and precision with which they're prepared just shines through and made it all new. Service was friendly and helpful. The only flaw in our evening was that it was a bit noisy inside, and I think that was mainly because there was a large celebratory party nearby. Not a problem.\n\nWe've been instructed to find another place in Brooklyn as good as this for Father's Day. The gauntlet has been thrown.", "author": "Joanne A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-12", "description": "My husband and I live a few blocks away, and have come here since it first opened. We have seen Jack the Horse morph from a small neighborhood place into a local near-phenom -- with all the good and bad that that implies. Until the recession hit, we found we could no longer just walk in and eat, and had to make reservations as early as a day or two ahead, or else eat at 9pm. Even then, it would take us three hours to get in and out; the service, never very swift to begin with, really suffered from the overflow crowds (as much as you can get overflow crowds in Brooklyn Heights).\n\nNow, JtH seems  to have got back to a manageable level of fame. The food is still the best New American in Brooklyn Heights. I recently tried the pork loin with pickled beets and roasted brussels sprouts, all cooked to perfection. The portion was large enough that I took some home and had it for breakfast (!) the day after, and the loin was still moist and tasty. My husband loves the juicy burger on a ciabatta with Asiago, and I can't say I blame him. And when I revert back to semi-vegetarian mode, I always, always order the smoked trout salad. It has enough green in it to make me feel virtuous, but the hollandaise dressing, potatoes, and trout stop me feeling sorry for myself for ordering salad. And I am normally not a cold-green-salad kind of girl.\n\nThe atmosphere is usually nice and buzzy, and it's a lovely room. Service has now got efficient enough that we can be in and out in an hour and a half, even when we order three courses with wine (which we invariably do). It's also the one place in the neighborhood we can take friends from the city or elsewhere to, and know that everyone will find something to love. \n\nSunday brunch is packed, but strangely easier to get a table for if you get there by noon. The wine, beer and cocktail lists are deep and well-chosen. The fish specials are a bit inconsistent (the fish is sometimes overdone and too busily seasoned and plated), but on the whole, Jack the Horse is the perfect neighborhood bistro -- whether you actually live in the neighborhood or not.", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-27", "description": "It's always lovely to find something unexpected. Jack the Horse is a British gastropub on an old street...with great food.", "author": "Kimberly O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-22", "description": "We just had our second dinner here.  They forgot a few of things again and I noticed they were forgetting things at other tables, too. Is it that they're understaffed?  Whatever it is, they're appropriately apologetic.  I'm not particularly upset by it, but it happens far too frequently not to note.", "author": "Eric M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-25", "description": "We came here on a whim, since we were in Brooklyn and it had good reviews on yelp (we don't make it over the bridge very often so we're not familiar with much in Brooklyn). We sat at the bar but had a few appetizers. The bartender was very busy yet still attentive, and came up with great recommendations for drinks based on my very vague descriptions of what I was in the mood for. The drinks were fabulous! The food was good and well-executed, and I would return to eat there, but it wasn't anything groundbreaking - being a pub, I don't think it's really supposed to be. Overall, I was impressed, and will be back sometime soon.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-01", "description": "Great food.  Nice airy atmospher.  The smoked trout salad alone was worth the trip!   Mmm!   Will most definitely be back.", "author": "Tim O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-09", "description": "adore adore adore.  Located in such a cute place, ambience great, food delish, very romantic.  The PANNA COTTA supreme!  D did the prix fix and couldn't ask for more.   Will go soon again!", "author": "M F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-19", "description": "What an absolute treat! The food, ambiance and service were just perfect. I ordered an heirloom tomato salad with mozzarella and basil. There were about eight different beautiful varieties of tomato - light green, dark red, bright yellow - sliced thin with just the right amount of meyer lemon olive oil and course salt. It was a feast for the eyes as well as the belly. My entree, salmon with corn salsa and grilled peaches, was wonderfully flavorful. It tasted fresh and summery and the flavors of the food really shone; there was no need for a heavy sauce or too much oil. I can't wait to go back.", "author": "S G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-16", "description": "The food is great.  The service is like playing roulette.  Sometimes it's fine; sometimes awful and dismissive.  On a uncrowded night, it took 30 minutes from the time we were seated to get drinks, and even then only after flagging down the manager.  And that one round was all we ever got, never mind that we sat there with empty glasses for an hour.  The server was perfectly friendly, i guess,  for the 2 minutes we saw him at the beginning and end of the meal.  He just wasn't around and just didn't care and worked very hard to pretend not to see anyone trying to get his attention.  It's really the one thing holding this restaurant back, but it's hard to get past.", "author": "Peter V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "Nice quaint restaurant on a quiet block in brooklyn heights.  Food was delicious and served quickly.  Probably b/c we got there early.  Either way, I had the braised short ribs and my fiance had the free range chicken, both were delish!!", "author": "neil e."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-18", "description": "Went to dinner at this establishment last night and it was quite delicious. The mac and cheese is quite amazing! YUMMMMMMMMMMMMMMMM! I had the scallops as an entree and it was ok - nothing special...broccoli rabe was very bitter and the scalops were a bit bland. Overall I would def be back - very nice ambiance!", "author": "Olga T."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}