{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "This place is great! Here for dinner on a summer Saturday night w family and just so good. Service excellent and waitress (Maria) perfect. Beet salad and Angus hangar steak for me and a couple of glasses of Chardonnay. Standard operating procedure for me. This is just such a great spot in the Heights too, just a couple of blocks off the promenade, maybe come here after a little evening walk and view of the bridge and the city skyline.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "I came here for the Mac \u0026 Cheese after it made the Gothamist (and many others) list for best Mac \u0026 Cheese in the city.\nIt's definitely on the creamier, decadent side...In the best way possible. You can taste the hint of smokiness provided by the Gouda mixed with the additional richness of the fontina. Tiny bit overboard with the breadcrumbs. \nI have no complaints per se, but I've just had better. \n\nHappy hour was a great deal! \nWill definitely come back for a drink.", "author": "Gina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Good service without hovering. Great food, well developed flavors with subtle nuances. Even the simple heirloom tomato salad was subtly seasoned with sparsely sprinkled coarse-crystal salt. The hangar steak (potentially tough) was cut cross grained, to create tasty, firm medallions. A skilled bartender creates house-specialty cocktails. \nQuality of this sort does not come cheap. But it's worth it.", "author": "Paul J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "I have only ever been here for happy hour (and only ever in the back room around the corner), but this place has pretty delicious eats and very cheap cocktails for HH.  Oysters are their specialty, but they have the normal HH fare as well.\n\nThe only knock I have is the place can get slammed at happy hour, and the back room is usually woefully understaffed.  Not a huge area to eat in, so be prepared to rub elbows and knees with your neighbor, but it is worth it if you are in the neighborhood.", "author": "Robert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Came here on multiple occasions and it's one of my favorite restaurants in Brooklyn Heights. Everything I've ordered is amazing and the staff has always been very friendly. They have a great happy hour at the bar as well. I definitely recommend their Mac and cheese it's the best Mac and cheese I've ever had!", "author": "Alison S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-06", "description": "Had been wanting to try this place for a long time...well, I guess we went on an off night. Its a wonderful historic place but our food was below average. My husband had a burger (tough, plain, no garnish) and I had the ravioli starter which had no taste and a weird non-pasta texture. Really disappointing. Also noticed neighboring dinner guests looking noticeably dismayed. I'll go back for a drink at the bar but never for the food. Service was fine.", "author": "Erica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "Always very good. The menu may look boring but the cocktails, wine and food are all perfect.", "author": "Ruth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "One of the best happy hours in the Brooklyn Heights and always great service at the bar. Wasn't as impressed with dinner while seated in the main restaurant. Will continue to come for happy hour but not dinner service.", "author": "Dan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "Another update for the new year:  Jack the Horse's food and drink are still reliably very good.  But one star comes off because it feels like JtH is coasting.  Both the food and drink menu are, for the most part, exactly the same as when I first came here 4+ years ago.  On the one hand, when you've got great dishes like the trout salad and pork chop, why change?  (The risotto has changed from oxtail to rabbit, I guess.  Sorry Thumper.)  But on the other, unless we really feel like eating one of those things in advance, we don't really feel the need to come here, since it's not like we're going to be trying something new/different.  The decor is similarly frozen in time (the potted plants and the stopped clocks on the wall in the dining section are getting pretty tired-looking).  \n\nThe other star comes off because the service has declined significantly.  Occasionally we might get a waiter whose friendliness/efficiency matches what it was a few years ago, but more often it's brusque or supercilious.  And recently, I had the experience of making an OpenTable reservation at 7:00 for an upcoming weekend, only to be called the day before by a hostess who said \"we're overbooked for that time, how about 8:00?\"  Normally, I'd say fine.  But this \"request\" was made without any apology (in fact, the implication was that somehow this was my fault), and without explanation for the fact that I could still go on OpenTable and reserve the same table at the same time (or anytime around it).  When I said we had somewhere else to be later but we could do 7:30, she responded huffily \"fine, I guess I'll just move you there, and now I have to call someone else and ask them to move to 8:00.\"  Which prompted me to hang up and immediately cancel the reservation, and make a 7:00 reservation somewhere else.  Hopefully this lesson on the elasticity of the restaurant market will get through.  In the meantime, a solid 3 stars.", "author": "David M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "I came here for brunch on a humble. We were actually going to go to some place...  SOOOOOO glad we didn't go to the other spot.  First of all I loved the light, casual and airy atmosphere.  We came when brunch was almost over but we was insured if we got our order in quick they would have no problem filling it.  YAAASSSSSSS the servUS was great!!!!\n\nI loved every bite!!!! I got the French Toast with a side of bacon.  You know people take this simple breakfast choice for granted....STOP IT!!!!  This place makes wonderfully delicious frenched-up toast (i wanted to slap the chef!!!) but I digress.  The swine was real not some all paper thin slice the evaporates in your mouth. My phattazz went on about the bacon so hard they brought be an extra side (i dropped a tear) that I generously dipped into my warm syrup!!!!\n\nThis place was allll kinds of deliciousness....I WILL BE BACK!!!", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "With a friend who lives nearby, I have been dining at JtH for several years.  It's our go-to local place and we always enjoy it.  The food is always good, recently had a special olive oil poached halibut over lentils that was divine.  The decor is cozy and the service always super friendly and efficient.  Only annoying thing is the music is always so off.  It's a cozy neiborhood spot and the music is always too loud and often old school rock and roll or 80's tunes, just doesn't fit the vibe.  Classic jazz would seem so much more appropriate...Chet Baker or Billie Holiday like stuff would suit the room and the nice mixed local crowd.", "author": "B B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "It's a great Sunday brunch spot. The \"side\" of bacon is $5 and enough for a table of 4. The Monte Christo sandwich with french toast bread is a favorite of ours. Nice atmosphere, fair prices and unique menu items.", "author": "Haven B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Wonderful little spot. Looks a bit expensive at first, but when the food comes out, you will realize why! They also have an amazing happy hour and a small oyster place attached which also has an amazing hh. \n\nGreat for family dinner, date night, hh with friends.", "author": "B C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "A wonderful and lovely Brooklyn joint to spend a lazy Sunday afternoon brunch. Two thumbs up for the aptly named \"Krista's Excellent Scones, Biscuit \u0026 Jams ($7). While I have no clue who Krista is, she should be proud of these baked goods! Something very comforting about how delightfully buttery and crumbly the scones were. \n\nI took a long time to decide what to order as the menu contained so much that I love. I eventually settled for the Eggs Orleans. The juicy Barcat oysters were fried crisply and paired splendidly with the hollandaise, artichokes and poached eggs. It was a nice balance of tart and creamy. Bacon lovers have to order a side of crisp (very) \"Bacon, Bacon, Bacon!!\" \n\nThe Bloody Mary is quite tasty though you may want them to up the tabasco if you typically enjoy a spicier version of it.", "author": "Shulin T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "This is an adorable date spot. They have a great bar and oyster bar. The music is awesome in here too. A lot of Neil Young and Tom Petty. Our complaint was the food, but maybe we didn't order the right things. We started with the Mac and cheese which was excellent but our entrees were disappointing. I had the flat iron steak and it was awful. WAY too salty and mushy texture (not sure if another way to describe it)! I couldn't even finish it. My boyfriend ordered the burger and said it had very little flavor and the bun overpowered the burger in size. I'd try this place again but probably just for drinks and oysters.", "author": "Laura Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "This review is for dinner (can't wait to try brunch - stay tuned for an updated review):\n\nThis Michellin-star rated tiny gem feels like it's waiting to be discovered.  Nestled in the quieter hills of Brooklyn Heights, near the promenade but not on a main drag, JtH Tavern still feels like a find (even though they've been discovered and featured and celebrated).  The service is superb - waitstaff offer great recommendations based on your likes and yearnings.  And just when I was about to say, \"the food is taking a long time\", our dishes came to our table and were worth every single minute spent waiting.  Be patient, have some wine, and you will be thoroughly rewarded.  Prices are reasonable, $19-$25 for an entree.  And the ambiance is inviting - come with friends or bring a date, you will enjoy your experience.\n\nI ordered the pork chop (tender and flavorful) with broccoli rabe and bacon, my friend ordered the steak with roasted potatoes - we never even spoke to each other once the dishes arrived!  I kind of wish I had remembered to ask to try his dish.  Can't wait to come back for my favorite meal of day - Brunch...", "author": "Nic L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Really cool place.  Laid back.  Came for happy hour - stay away from the house wine, but definitely order the Mac and cheese!  I still think about the amazingly tasty cheeses in that thing!  Would definitely come back.", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "I have been to Jack the Horse twice in the last 3 months for dinner, the last time this past Saturday. Both times were pleasant experiences, the first time was an out of the park 5 star experience and my last experience was more of a 3 star, so I am giving them a 4 star average. \n\nThe first time I went with a group of friends and we shared a lot of sides and starters along with our mains and everything was delicious. The Brussels Sprouts and Cauliflower were both great. The Macaroni \u0026 Cheese, Beets and the Grilled Octopus were all great dishes! For my main I had a special of the day, which was Short Ribs and was AMAZING. I also tried a bit of my friends burger which was SLAMMING! \n\nThis past Saturday I had the Hanger Steak, which I just wanted to be better, the quality and flavor of the meat was just sub-par compared to my last experience and the amazing short ribs.\n\nThe environment is cozy and borders almost on enchanting, you really could image you are in a tavern from a bygone era, and its location on a charming corner of Brooklyn Heights really helps that feel.", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "This place is a great local neighborhood restaurant. Came here for dinner on a weds evening and it was reasonably busy.\n\nBurger came out top drawer, as did the diver scallops. There's a decent selection of beers too.\n\n\nAmbiance is nice, a bit like a gastro pub.\n\nBrooklyn heights is a beautiful neighborhood and of ur ever in the area, would really recommend dropping in.", "author": "Ken L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-11", "description": "EXTREMELY DISAPPOINTED. More like JACKASS the Horse.\nI've come to this restaurant for years and easily spent thousands of dollars here over time. I've stayed faithful through menu, chef and staff changes but the other night I had my last meal here. I have gotten politer service at the DMV! I have never been so personally offended by poor service in my entire life. Waiter aggressively interrupted an obviously personal moment (party member reading through birthday card), was incredibly hostile about a drink order (asked for vodka instead of gin due to an allergy), never came to check back in on the meal or ask if we wanted more drinks (usually the waiters here are very attentive). The waiter told us that it was \"policy\" to not make drink substitutions (mind you we have made this substitution EVERY TIME we've been here for years) and told us in a very aggressive and condescending tone that we wouldn't even know if it was gin instead of vodka...obviously we would if our party member has an allergy!       \nI'm NEVER one to cause a scene or be confrontational but I was so beyond bewildered by his deliberate and continuous hostility that as he was clearing the plates I had to politely bring it up. He was incredibly dismissive, unapologetic and condescending! The bartender (who was the de facto manager at that point, as the owner had left) even came over and told me that the waiter NEVER EVEN ASKED if he would make the drink substitution. Bartender informed us that he would happily make the substitution and offered us a round of drinks. At that point our dinner had been so uncomfortable that we just wanted to leave as soon as possible. It felt as though we had offended our waiter on some deeply personal level... I can't find any other justification for such rancor. \nWe are ALWAYS polite, continuously thank the hostesses, bus boys and waitstaff for their hard work which we recognize and appreciate. This was the worst dining experience I have had anywhere in my entire life. Within 5 minutes of sitting down it was an awkward and hostile environment. \nThere are MANY better restaurants in the neighborhood especially for this price point. I will now be giving all of my family's business to Henry's End and encourage all else to do the same. I enjoy my steak salty, not my service!", "author": "Phoebe P."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}