{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-28", "description": "I want to take a few minutes writing this review because I feel that this establishment thoroughly deserves it.  I visited this place on 6/19/11 had what I can describe as my favorite brunch experience there.\n\nI was visiting my brother who lives in the Greenpoint neighborhood for the weekend.  We scheduled a brunch at JTH so that I could meet his girlfriend.  We arrive and are told that the wait would be 45 minutes (father's day), so we decide to take it some of the sights at the nearby Brooklyn Bridge Park.  As soon as we get back our reservation is called.\n\nI ordered a \"behind the knees\" for starters.  If I remember correctly it consist of gin, cava (Spanish sparkling wine), fresh citrus (primarily orange), and elderflower (I'm guessing some sort of liqueur).  This was 100x better than a mimosa, but then again you can never go wrong with gin in a mixed drink. Am I right?  I have to say that this one snuck up on me.  A surprisingly stiff drink.\n\nI ordered a monte cristo, with the twist being that the bread was actually brioche French toast.  This was by far the greatest breakfast/brunch sandwich I ever had.  The gruyere cheese melted perfectly down the middle of the sandwich and the ham was perfectly heated.  I hate it when the slices are too wet and it soggies up the bread.  The French toast base was amazing.  There was a slight hint of gooeyness in the middle of the sandwich that paired very well with the cheese.  Topped with powdered sugar.\n\nThis was quite an experience and I cannot wait to visit this establishment again the next time I'm in Brooklyn.", "author": "Unyime E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-12", "description": "I like this place, it's cute and it's located in a quirky residential area. Being a Brooklyn girl, it's Brooklyn Heights and a part of Brooklyn that I adore. \n\nJtH has the potential of being romantic but each time I come here, it just misses the mark. From too noisy to being seated too close to the bar... it just doesn't do it for me.\n\nI'll be honest, this is the only place where I'd order mac and cheese. I actually tell people to come here just for the mac and cheese. Made with spiral noodles, a perfect beschmel cheese sauce and herb crusted crumbs baked on top.... yeah, I love their mac n' cheese. \n\nCame here for a nice, quiet dinner... I am never wowed by any of the appetizers but I adore the mac and cheese. Entrée wise, there wasn't much that I could eat, the whole vegetarian thing, throws off most of my meals in many places. I opted for the salmon special, as let's be honest, it's what I always order. I opted out of dessert, that was not much that I loved enough to order. \n\nAll in all, as strange as it may sound, come here for the mac and cheese.", "author": "Jax W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-16", "description": "Now that I don't live in NYC anymore, I can openly recommend Jack the Horse. Hands down, one of the best restaurants in the city. The bar and tender are ace, and the food is always top notch. I make it a priority to visit every time I'm in town.\n\nThat said, still an unfortunate name.", "author": "Eric T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Old-timey cocktails; Relaxed atmosphere; Knowledgeable bartenders.\n\nIt's usually fairly easy to get a seat for dinner or at the bar of this neighborhood joint. Hidden on a side street in Brooklyn Heights, JTH is where local couples or families step out for a quality bite to eat. The staff could be slightly more friendly and the food is a bit pricey, but the cocktails make it worth a stop when you're in the area.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-23", "description": "This place is very near me and perfectly serviceable, if forgettable. I love how cozy Jack the Horse is on a cold winter's day. It's a cute place located in the beautiful historic neighborhood of Brooklyn Heights that I'm lucky enough to call home. But it isn't adventurous. Like most restaurants in the area that cater to boring wealthy whities, the food is straight forward, but a lot of the time bland. Throw in a cocktail or two, however, and you'll be happy as a clam. Brunch is popular here, so come early.", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-11", "description": "I love eating in neighborhoods, I could never afford to live in. \n\nJack the Horse was a great lunch spot on a day trip out to Brooklyn Heights.\nIt's roomy - good decor and the food was pretty good.  Not amazing by any means but well worth what we paid for.  I would def come here again if I'm ever in the area.", "author": "Timothey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-19", "description": "My all-time favorite restaurant on either coast for the excellent food and attentive service and relaxed ambiance, and it is the standard by which I hold all other restaurants.\n\nThe dinner menu varies a bit with the season but is reliably delicious. (Yes, the Mac n Cheese really is the best.)\n\nSunday brunch is fun and delicious, as well as kid friendly, especially during the early brunch service. (Therefore my suggestion is to wait until about 2 p.m. :) )", "author": "Claire A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "I was looking for a brunch spot in Brooklyn Heights are stumbled upon this restaurant through Yelp. We ate the baked eggs and the buckwheat pancakes and both were great. The staff was friendly and the vibe was easy-going - perfect for a laid back Sunday brunch. The portion for the baked eggs was on the smaller side, though.\n\nI'm definitely going back!", "author": "Harsh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "Discovered by chance on a weekend trip...definitely going back! Don't waste your time trolling reviews for any other place...this is where you want to go.\n\nJack the Horse Tavern is exactly what you look for when in New York; a cozy restaurant with great food at a good price; an attentive, friendly staff; not overcrowded; great beer/wine selection.\n\nWe were making our way back to the High St subway terminal when we decided to have dinner in Brooklyn instead of Manhattan. As luck would have it, we made our way down Hicks Street instead of Henry St. Henry St is lined with restaurants and we would've been lured into a place to dine, but Hicks St has very few restaurants making this a hidden gem.\n\nEVERYONE on the staff was really kind. We were treated like regular customers.\n\nTheir menu seems to be seasonal and everything we ordered was perfectly prepared and very fresh. \n\nI'm happy to give this restaurant 5 stars.", "author": "Bernie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-01", "description": "Some really good food here. Mac and cheese got the most praise but I actually liked the cheeseburger better.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-03", "description": "Very beautiful semi-fancy restaurant nestled in the heart of Brooklyn Heights.  Expect great perfectly prepared food in perfect portions with attentive service. You'll pay a good amount of money but the dining experience will be worth it. I had the chicken entre with lemon potatoes and green beans which was pretty perfect. But the appetizer was the real star of the show...the mac and cheese (which consists of Cavatappi, Smoked Gouda \u0026 Fontina). Unfortunately there is no entre sized version of this treasure and the small portion is a bit pricey at $9 but it is the most amazing mac and cheese imaginable. The portion though small is ideal for a starter without being too filling.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-10", "description": "I had one great dinner experience here in September after a series of mediocre brunches. I was hesitant to go back because I wanted to keep the memory of my good experience alive, and I had this sinking feeling that dinner would suck the next time I went. \n\nAnd guess what? I was right.\n\nThe mac \u0026 cheese was still good. But everything else was lackluster at best. The goat cheese salad was a boring cliche. My pork chop was bland and came with crunchy, undercooked pears (two of which were sour) and mediocre roasted potatoes. The cornbread sauce was the only saving grace, and they barely gave me any.\n\nMy husband's chicken was absolutely flavorless, and the mashed potatoes were over-salted.\n\nWe didn't bother with dessert. Not that we had much choice. Our waiter brought the menu and then disappeared for like ten minutes, which is, apparently, his claim to fame. When we first arrived, he gave us the drink menu and then disappeared for ten minutes. He's a regular illusionist. David Blaine, eat your heart out.", "author": "Astrid V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "Definitely one of my favorite spots in Brooklyn Heights.\n\nThe mac and cheese is incredible! Ahh smokey cheesy crunchy goodness nestled in a little bowl...heaven. I do agree with other reviews  that the portion size is a bit small. Sharing this with 2 other people can be....well...dangerous.\n\nI think the best entree on the menu is the hanger steak, cooked to perfection. Though I have had the short ribs and they are rich, cozy, and comforting- perfect on a cold winter night. And the scallop dish is light but satisfying. \n\nLet me not forget the cocktails.\" Behind the knees\" is a crisp and light concoction that doesn't really taste that strong, but let me tell you, after a couple of those its no wonder how it got its name. The bar has old school charm, with the bartenders mixing drinks the way they used to back in the day.", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "Great neighborhood spot for dinner!!!  Our server Alex was phenomenal. He was clearly busy but gave everyone attention, knew the menu and treated all customers like guests.  The food was equally as good.  We had the Mac and cheese, pork chop and octopus. The ambience could use sprucing but all in all, this place is a gem. Will definitely be back for more.", "author": "Kimberly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-28", "description": "We've been here several times since we moved to the area a year ago, and it's one of my favorites in the area.  We would have come sooner but the name always made us think it was some kind of cheesy pub.  It's not.\n\nFirst, people are correct that the Macaroni and Cheese is spectacular.  Some of the best I've ever had, and I've had a lot. Frankly at this point my arteries are probably about as jammed as the approach to the Holland Tunnel around 5:30.  But the rest of the menu is solid too, so there is hope for the lactose intolerant.\n\nSecond, the ambiance and location are exactly what I love-- the place is elegant but also feels warm and welcoming.  It feels very integrated into the surrounding quaint streets, and very much the neighborhood hangout.\n\nThe drinks are your standard high-end Brooklyn cocktails-- sitting at the bar is lovely, quiet, but not dull.\n\nGood place for a date or to catch up with some old friends.", "author": "Quinn R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-25", "description": "When it comes to the food, you can't go wrong with Jack the Horse. Every appetizer, entree and dessert I tried was very nicely done. After reading dozens of reviews on the mac n cheese I had to try it, and I wasn't disappointed. The smoked gouda gave it good flavor, and there was just enough crunchiness around the edges to give it interesting but not overwhelming texture. I don't know that I would be compelled to come back to the restaurant just for the mac n cheese, but it was well done.\n\nThe crispy oysters and PEI mussels were average - certainly worth ordering, but not the stuff dreams are made of. The herb French fries were delicious.\n\nI really give Jack the Horse props for its cocktail list, however. I strongly recommend the Pisco Punch, which blends pisco, pineapple and egg white. Very, very good, and I'm not usually one for brandy. \n\nThat being said, there aren't enough seats in the bar area, and the din in the restaurant itself is intense. At times, I was shouting across the table! There was also a terribly draft coming from the window, so I kept my coat on for most of the meal.", "author": "Leslie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "Adding yet another \"second\" to the rave reviews of the cocktails and the mac and cheese. I took my sister and several of her friends here for her birthday dinner a while ago, and everyone loved their dishes. She still talks about it. I'm pretty sure there was a table stare-down over who got to finish the mac and cheese (we ended up sopping up all the leftover cheese with bread, oh man so worth it). \n\nI also love their happy hour, mostly because broke grad students such as myself can afford multiples on their delicious old fashioneds, made only more awesome by the giant ice cubes and fresh orange rind. Gah, is it happy hour yet?", "author": "Priti T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-19", "description": "Let's be honest...\n\n\nThe mac and cheese sucked. \nJK. It freakin' ruled. It ruled so much that it made the rest of the meal pale in comparison. :(", "author": "Nancy D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-23", "description": "This place has many things going for it (and I'm judging this just based on the bar). \n\nThe happy hour specials are great, and the wine options offered for this are quite good. \n\nI would really like to eat here...but they don't offer any vegetarian options. It's not that difficult to offer a pasta dish or dinner salad or branch out in some other way to give options to those of us who prefer not to eat meat. \n\nI had decided to settle on this place as somewhere just to have drinks. However, one night I was having a drink with a friend and a third friend showed up unexpectedly. The bar was full, so we asked to move to the one lone empty bar table in the corner. We were told that we had to pay our tab at the bar and that happy hour specials weren't available at that table. Mind you, there is ONE bar height table in this place, RIGHT NEXT TO THE BAR. While sitting there I could reach my arm across and touch the bar. \n\nFine, we move to this table so our friend can have a seat. We now have to be served by a waitress (who has to go out of her way to come over to us, since she's serving the tables in the rest of the restaurant), and the happy hour specials are not available to us. \n\nThe most ridiculous part of the evening was when we walked ourselves over to the bar and asked for a candle (the bar was full of them) for our table tucked away in the dark corner of the bar). He refused, saying that they have a terrible time getting wax off that table. This implied that we were going to spill wax on the table. We persisted, and he finally relented. Guess what? We didn't spill any wax, and we had a little pocket of light in our corner. \n\nI really want to like this place more than I do, as I think it has a lot of potential and clearly seems to be a favorite for many other reviewers.", "author": "Taren W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "Used to eat here regularly when I lived in Brooklyn Heights. I've always enjoyed the food but the service can be very hit-or-miss (lost reservations, giving away a promised table, huge delays getting drinks, no water refills, etc). \n\nWent by for the first time in a couple of years with some out-of-town visitors and it's same ol' same ol'. Decent menu but very iffy service. Our waiter was under the illusion that he was working a Fine Dining Establishment with Complicated Menu Written in Foreign Language instead of a gastropub. He first asked if we'd dined with them before; \"yes\", sez we (and the menu's apps, salads and mains, dude, think we can figure it out). Undeterred, he then launched into a detailed explanation of every.freaking.dish (\"blah blah sous vide with a hint of cherry jus, blah blah cold smoked which is blah blah as opposed to hot smoked which means blah blah...\"). Kind of fun to then order burgers and mac and cheese, heh. Food is good enough, not always piping hot; hanger steak was chewy even for that cut of meat, burger nice, scallops tasty if skimpy, mac and cheese fine. No water refills until glasses drained and empty for a good long while.", "author": "Emmeline C."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}