{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "Nice restaurant in one of the coolest New York neighborhoods. Warm and cozy, and bustling. Liked it so much after a late dinner on a Sunday night that we came back for a 7:30 dinner on Monday. Lucky to get a table without reservations! Friendly staff.\nI read about it on yelp while checking out places within walking distance of my daughter's new student residence where she is studying and interning in NYC for a semester. So after the move-in, we wanted to try it out. I noticed the rave reviews for their Mac n Cheese. My daughter is a Big Mac n Cheese fan, so we jumped at the chance to try it. Absolutely the best I've ever had. Perfect crunchy topping and the most amazing Gouda cheese creamy flavor. \nWe also got a side of their Brussel Sprouts, also fantastic. I ordered the skirt steak dish and my daughter got their burger. Both were delicious. Hers with fries, mine with roasted potatoes and salad. Ample portions! Brought home leftovers.\nThe second night we got the Mac n Cheese again as a starter. I got the risotto that had Brussel sprout leaves in it along with small carrot cubes. Delicious flavors. My daughter got the cheese ravioli special. We invited her roommate along, and she had plenty of gluten free menu options, and opted for a bun-less burger. Finished with apple crisp and scoops of gelato for desert. Prefect!", "author": "T V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "All around excellent experience - this restaurant is located on a quiet, \"off the beaten path\" in Brooklyn Heights. The windows were open, allowing a pleasant summer breeze into the dining space. The atmosphere is unassuming, rustic, and home-y. Very good cocktail and wine selection. The mussels were some of the best I've ever had - the sauce was just terrific - maximum om nom nom factor. After you finish your mussels, you can dip the french fries in the white wine sauce. Do yourself a favor and skip the condiments for the fries. Considering the charming space, we were seated in the corner, near the kitchen and facing the restroom - otherwise this would have been a 5 star experience. Definitely would go back (and requesting a seat near the windows).", "author": "Michael G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "I am so in love with this local place! I just ate the best steak in my life. Great atmosphere, friendly environment. Cozy and comfortable. Will definitely come back. Highly recommend to others!", "author": "Vera B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "I love this place. It's my go-to neighborhood restaurant/bar. Drinks are the best in the hood - the bartender is terrific and the custom cocktails are all top-notch. I often come here to eat because the cocktails are so dependably great. The service is also terrific and I have never had a bad experience getting food/drinks on time. Every friend whom I have taken here when visiting me wants to return.\n\nI love the menu, particularly the smoked trout salad, the pate and the mussels. The brunch menu has tons of options for someone like me who doesn't like to eat eggs that much - a lot of variety. \n\nI will say that I have had a couple of not-great experiences with the food (usually during the week - not on the weekend). Once the potatoes in the trout salad weren't cooked enough, once my mussels came a little too cold and one time I ordered a special but had to send it back because it was overly seasoned (salt must have been added twice or something). Again, anytime I have had a problem, the staff addressed it quickly and professionally. \n\nI expect to be coming back here for years.", "author": "Barry M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-21", "description": "My friend and I went on Tuesday night. It was practically empty. We ordered starters and a salad to share and the waiter told us that they only do full dinner ?? But she asked her manager and we were allowed to have what we wanted. \nThe food came out quickly and was delicious.\nBut then again, the staff seemed in a hurry, asking us often if we were done (I don't like when you still have pieces of good food in your plate and they make it seem as if you shouldn't eat the whole thing). \nBefore 11 the heat was off and it was clear everyone was tired. So we had to leave.\nI feel this place could be really good if the service was better. I chose it because from outside looks cozy, but inside is kind of cold. But not terrible. \n3 stars because the food and wine were really good: We ordered the beets salad, the ravioli and the polenta. I had sparkling and my friend got red wine.", "author": "Rocio A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-15", "description": "After waiting for our table and being told we were about to be sat, the hostess told us the owner said not to seat any more people.", "author": "Beth J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "Great ambience, great happy hour. Their food is very good, the portions are as expected from any pricey restaurant (paltry).\n\nWould I go back? Maybe once every now and then, but not that I'm dying to go back.", "author": "Jessaid P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-29", "description": "This is indubitably* the best mac \u0026 cheese I've ever had; it is mind-blowingly delicious. In fact, I will be personally offended if you do not take me up on this suggestion. Coming into Jack the Horse and NOT ordering this starter is tantamount to spitting in my face.**\n\nUnfortunately, everything else is not quite as amazing. But really, how could it be?\n\nI decided on the hanger steak, which was merely good, although it was served with the Horseradish Cream of the Gods. The accompanying scalloped potatoes needed the addition of salt and pepper, and then they were tasty enough. Her halibut was passable; however, it was overshadowed by its smoky chorizo sauce that made the fish itself seem quite bland.\n\nWhen I come back, I definitely plan to start with the mac \u0026 cheese again. But instead of the hanger steak, next time I'll probably go for the mac \u0026 cheese as my entree, perhaps with a side of mac \u0026 cheese if I'm particularly famished. And although the strawberry tart was good, I think the mac \u0026 cheese would be the perfect end to an absolutely flawless meal. \n\nAnd then I'm going to come back the next night and do it again. Soon I will be 300 lbs. But I'll be happy. \n__________\n\n*Indubitably is indubitably one of my favorite words.\n**And the last time someone spit in my face...well, I didn't do anything about it. She's still my girlfriend, and she terrifies me. But it's mean, so don't do it.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "What an awesome find!\n\nMy boyfriend took me here for our anniversary. It is in the most secretive, gorgeous neighborhood in Brooklyn right off the Promenade. Beautiful interior with beautiful people to match. I got the sense that this is a local favorite (and the locals aren't broke, let's just say). Regardless of this, I felt no pretension upon entering.\n\nWe were seated at the best table in the house, right in the window. The service was very professional (no sloppy hipsters here!) and the food was fantastic. We got the mac \u0026 cheese app to start, and I got the chicken with mashed potatoes and greens. My boyfriend got the pork, but he preferred my dish. We also got a great bottle of wine for around $35, not terrible for an upscale restaurant.\n\nI had a great overall experience here and will definitely be returning.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "Loved it! I got there right at the tail end of HH. The drinks looked yummy. I had a glass wine and ordered dinner at the bar. I had the burger and thought it was super tasty and filling. The fries were soooo good.  I had a great dinner. The Bartender seemed to be really busy and frazzled at times. Wished for a little more personalized service at the bar. Overall, the place was cute and quaint. I will def go back!!!", "author": "Tony J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-16", "description": "We have lived practically next door to  Jack the Horse for over a year and it was the only restaurant in Brooklyn Heights we had not tried, until yesterday! \nPerhaps it was the lack of vegetarian entrees, or the sort of Wall street atmosphere at the bar.  \nAll of that being said, we finally went and had a wonderful dinner with great service My husband enjoyed an octopus appetizer and the hanger steak. The real treat here is the Macaroni and Cheese- It is definitely the best Mac and cheese I have had in as long as I can remember. Delicious!! \n  I also discovered the chef will make vegetarians Entree size portions of a mixture of all the veggie side dishes and starters.   \nDelicious meal, warm atmosphere and who can beat a 1 minute walk back to home!", "author": "Tara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "My friend Jim introduced me to the flank steak here, and I've never looked back!  Scrumptious!  While I haven't tried anything else on the menu, my dining companions have, and they have thoroughly enjoyed fish dishes, etc. The appetizers and entres are creative and reasonably priced. Arrive a couple minutes early and treat yourself to a creative cocktail designed by the talented bartenders.", "author": "Patrick D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "This place is really a hidden gem in Brooklyn Heights. The candles on the tables, old style building and coziness really add to the romanticism. The bartenders also make a stiff old fashioned. By all means order from the unique daily specials such as the  smooth asparagus in brown butter sauce app and the braised short rib main course. These are really masterfully prepared by chef Tim who has worked with some of the best chefs like Collichio and Floyd Cardoz. . And when I left I had that warm happy satisfied feeling even though I was extremely full.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "The duck was amazing. The cocktails superb. The chocolate mousse dessert is the best dessert we've had in years - and one of us is a NYC chef. Please change the music line up. We are frequent patrons and love you, but the 70s overload with the music is dated and boring.", "author": "Mary F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "I went here on a recent Friday with a friend who had been here before. When we first arrived, the hostess said there were reservations coming in for tables, so we wouldn't be able to get one until around 9pm. (This was around 6:30.) I was prepared to go somewhere else, but my friend suggested we wait for seats at the bar to open up.\n\nOne seat opened up fairly quickly, and later 2 seats opened up at the end of the bar, so we moved over there. The bartender was nice and helpful when I asked for recs on which drinks were on the sweeter side. I enjoyed the Hemingway Daiquiri (one of his suggestions).\n\nWe also got two orders of macaroni and cheese, which was really delicious. I can't speak as to the rest of the menu, but based on this, I'd be glad to come back here sometime for dinner.", "author": "Elle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-18", "description": "Five stars for the service. Smooth and efficient, and most importantly, they don't snatch your plates as soon as you've finished, which is something that most NY restaurants would do. So, great etiquette, but also cozy atmosphere, good bar, very nice cuisine, which all sum to a great place in northern Brooklyn heights (probably the best there).\nAnd again, thumbs up for the rare quality of patience of the waiters. In NYC, this is priceless.", "author": "Margarita I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "I've been here at least twice on weekends by the time I'm writing this, with friends. I recall having most recently their take of the Mexican burrito, which came with something like a purslane \u0026 cherry-like tomato side salad on the side. The burrito itself tasted heavenly, w/o much cilantro added to it but I tasted lots of bacon bits, scrambled eggs and rice. The service is attentive, friendly but not intrusive (we were served by the same waiter who dons a long a hairstyle). I also enjoyed their coffee. Yes, the place can get noisy but it looks like everybody's up to having fun while having their meals in the restaurant. You could basically hear everybody murmuring something to someone else inside the place. But it didn't matter to us; I guess it's the food that much enthralled us. We're sure we'll be back again.", "author": "Jerome Espinosa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "After a long day at work... This is the remedy: old fashion drink, Mac and cheese and one more old fashion simple but delicious the Mac and cheese. Staff is quick and make sure you are having a good time.", "author": "Alexis R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "Slightly biased because we live down the block, but I'll try to be as candid and honest as possible...\n\nBEST RESTAURANT IN THE WORLD (kidding...sort of)\n\nThis place has never failed to please. Service, food, location; all outstanding.\nBeen many, many times; sometimes for socializing with friends over drinks, sometimes for brunch, sometimes for dinner. And, honestly, each time we leave we realize we shouldn't wait so long to come back. Lately we've become regulars for Sunday brunch, so we're reaching our goals.\n\nNote: Brunch is only served on Sunday mornings.\n\nService is great from the moment we walk in the door. Always greeted with a smile, there is a spot to leave your umbrella if it happens to be raining, and rarely a long wait for a table.\n\nAmbiance and decor are inviting, warm, casual, and fitting with the neighborhood. \n\nFor brunch, the best things we've had are the buckwheat pancakes and the monte cristo; both incredible, hearty portions, always satisfying.\nFor dinner, we love the burger and scallops; and our friends tell us the bowl of mussels is great, too.\nFor either meal, the fries here are really great; crispy, light, and perfect every time.\n\nEvery drink we've had has been great; classic bloody mary, mimosa, bellini, and the Long Bottom Bramble from their signature cocktail list is one of the best drinks we've had in the city.\n\nIf you're in the neighborhood (please leave...jk), and want a great place to sit, relax, and enjoy great food \u0026 libations, this is the spot. You will not be disappointed.\n\nBest things:\n***Monte cristo (brunch)\n***Buckwheat pancakes (brunch)\n***Burger\n***Long Bottom Bramble (cocktail)", "author": "Briggs S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-25", "description": "We live in the neighborhood and I've eaten here before and enjoyed the food, but recently had such a horrid experience making a reservation on Opentable for dinner that we'll never be back. Three hours before my reservation, I received a call from the restaurant telling me that they saw I'd made a reservation on Opentable for 8 pm.  I was told that they didn't actually have a table for that time, with no apologies.  When I asked what had happened, since Opentable had let me make an 8 pm reservation, the incredibly rude and flippant woman on the phone, who again never apologized or offered any accommodation whatsoever beyond inviting myself and my guests to simply come in and offering to seat us \"if a table opens up\", made some passing comment about Opentable showing tables as open before the restaurant would like them to be shown -- so apparently an issue that they were fully aware of, as some other reviews confirm.  If you have an issue with a ubiquitous reservation system like Opentable, fix it.  If you have to move or cancel a reservation because of an issue with the system, especially if you know about it, apologize and attempt to work with your customer.  A solution may not be possible, but take some responsibility for the situation, recognize that you've put someone out, and at least have the decency to say that you're sorry the situation occurred.  Simply unacceptable.", "author": "David S."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}