{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-05", "description": "I want to love this place for brunch, I really do. It's a block from my house and the establishment itself is really cute.\n\nYet every time I go here, I'm underwhelmed by the brunch menu. I have given it my best shot, and I order something different every time I go in hopes I'll find that one awesome standby dish that makes me happy. As far as I can tell, it never changes - except for that one time they took the immensely popular bacon bloody mary off the menu [seriously? why??].\n\nI tried a friend's french toast here once, and that's likely the best they have to offer. If you're a huge fan of eggs, then you can have them here basically any way you like. The drink menu is pretty impressive, but I'm not generally one to have *just* booze for lunch. \n\nOne thing I will say is that the waitstaff here are pretty cool. I've never had to wait for anything, which is nice. \n\nJust sure wish they'd spice up the menu every once in awhile.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "This place is fantastic, best in Brooklyn Heights for sure. This was one of the first places my husband took me when we first started dating... and now 8 years later, we still go and have an amazing time. We don't go as often since having a kid but I dream about it! That mac and cheese in to die for. Food is fantastic, space is cozy and romantic, bar has a modern vibe.  You really can't go wrong.", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "Went here for my birthday had ricotta balls for appetizer very good ..grouper as main entree excellent and wine really good and great service I want to go back !", "author": "Shelby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-11", "description": "I had a lovely dinner at Jack the Horse Tavern with my boyfriend and his family last night. We all arrived tired and stressed after busy work days, but soon our worries drifted away as we shared a nice bottle of red wine.\nThe bf and I shared the mac n cheese (thanks to reading yelp reviews) for an app and it was just as good as everyone said. We particularly liked the bread crumbs and bacon - y taste. I ordered the smoked trout salad for my entree, and was equally impressed with this dish.\nThe whole experience was enjoyable and our server was attentive and kind all evening. Of course the good company added to making the night special, but I would definitely recommend Jack the Horse Tavern to others looking for a cozy dinner spot.", "author": "Becca C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "Pretty cool place. It gets little loud sometimes, but the food is really good. Enjoy coming here.", "author": "Zsolt S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-30", "description": "Came here for brunch.  We ordered the duck hash and a cheeseburger-medium rare, please. My duck hash was less of a hash and more of a deconstructed plate of potatoes, chopped duck, and an egg. Bland and not at all delicious. The burger might have been tasty had it not been so overcooked- medium well bordering on well done. Our drinks were fine; not horrible but not memorable.  We left disappointed and vowed not to return.", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "Cocktail: Behind the Knees\nAppetizer: Mac and Cheese \nEntree: Roasted Half Chicken \nDessert: Some sort of peanut butter and devil's cake concoction\n\nI never write reviews, but I absolutely loved my meal at Jack the Horse Tavern. My husband and I went on a random date night and being that we wanted to be near the promenade to walk to after, we decided to try this place out. \n\nThe Mac and Cheese was the best I have eaten in a very long time. The cheese was smooth and the crumbs added the perfect crunchy balance. Left you wanting more.. I'm craving it as we speak!\n\nThe chicken dish was delicious, moist and not overcooked.. the flavors were simple and not overly done. Perfection. \n\nThe dessert was a great end. We love peanut butter so the combination of peanut butter with devil's cake was great and a wonderful exclamation point to a good meal.\n\nI love girlie cocktails so the Behind the Knees drink was an awesome partner to a wonderful meal. If you haven't tried this place yet, DO IT. You won't regret it.\n\n(Do note, PARKING sucks around that area!!)", "author": "c p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-25", "description": "Still one of my go-to places in Brooklyn.  Honestly.  Everyone is awesome here.   Amazing drinks.\n\nBut a revelation -- since my last update, I've been having their burger.  Uhhhh yeah -- it's pretty much AMAZING.  For $15 it's a steal -- asiago cheese, tasty fries, ridiculously juicy, like notorious BIG..  Anything of this quality in the city would be 18-22 bucks.  I really love this burger.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "My friend and I stumbled upon this restaurant when we were craving something good to eat as well as something good to drink. We took the chance of yelping locations in the downtown brooklyn area and we were happy we took the risk. \n\nAt first when we walked in the lady asked if we had a reservation, the answer was no. She made it seem as if we needed one even though the place wasn't so full. That was somewhat irritating. \n\nAfter the 1 minute argument we were seated. The seating area in the back is very comfortable, you'll end up drinking and eating for a couple of hours which is the point! The restaurant itself is decent in size and the decor is very nice. The lighting is dim for dinner which creates a very mellow environment. \n\nOur server was polite but he had to keep going back to the kitchen to ask about some of the items which we wanted to order. Overall nice guy and made sure we were taken care of. \n\nFor cocktails we have ordered a tittos and pineapple, and a tittos and tonic. They do not have brand name liquor so when I say tittos its simply their word for vodka, which by the way is very good. The drinks were very good, and mixed perfectly. \n\nFor apps we ordered the polenta and the mac and cheese. Both appetizers came out in a timely fashion and both were very delicious. The mac and cheese was so creamy, as well as cheesy MMmm. The polenta hit all the taste buds, it was also very pretty to look at. \n\nFor the entrees we ordered the hanger steak, and the cod. This was very pleasent. All the meals were shared and they were very good. The steak was cooked perfectly, the cod was melting in my mouth. \n\nOverall I had a great experience. I will be coming back .", "author": "Gabriel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-26", "description": "My husband and I showed up late-ish for the 5-7 happy hour a few weeks ago...and our only regret was that we hadn't come earlier.   Earlier to happy hour (for the great drink specials) and earlier to this restaurant (because it was amazing)!  \n\nThe $5 old-timey and \"modern\" drinks were delicious; the best of this type that we've had in Brooklyn.  The Mac and Cheese...also the best I've had in the city; the burger super-juicy and flavorful; the fries...more than nice.  \n\nNeighborhood-y with a soberly buzzed bartender, properly Brooklyn-ized in his vest and beard.", "author": "Heather C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-13", "description": "I could not have been happier with my dining experience here!!\n\nThis was my first time exploring Brooklyn Heights, and my girlfriend and I wanted to find a place to stop for drinks before seeing a concert in Brooklyn Bridge Park. I searched Yelp before heading into the area and saw this place had good reviews, so when I realized it was right by the subway we took, we decided to go in for a drink.\n\nI hadn't enjoyed a well-made cocktail in quite some time (Jack and Coke at fratty city dive-bars get old after a while). We found 2 seats at the bar and i ordered a Brooklyn Heights, which is a variation on a traditional Old Fashioned. The bartender really knew how to make a drink, and was extremely helpful, friendly, and cordial. \n\nThe drinks, service, and atmosphere at the bar were so enjoyable we decided to stay for dinner at the bar as well. As thrilled as I was with the drinks, the food left nothing to be desired. I was in the mood for a burger  (not to mention it was the cheapest thing!) and the asciago cheeseburger was possibly the best I've ever had. Served on a blood-absorbing italian-bread heel, the burger was cooked to perfection (med-rare) and was really delicious. My girlfriend had a skate wing special, which was really tasty as well. \n\nI highly recommend this restaurant for anyone who finds themselves in Brooklyn Heights. A really great place in a really great neighborhood.", "author": "James M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "I was here few days ago. It's a nice place, but to loud at the evening. Food was good, but not exciting. This is a good place where you could come with friends", "author": "Alex R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "Had a great time with a great group of friends here. Everyone single person (group of 8) raved about their food and drinks. The atmosphere was perfect for catching up with  your favorite people on a Saturday night. Our waiter was excellent, when asked he gave perfect recommendations on both food and wine and was a large part of the overall wonderful experience. I would definitely suggest checking this place out and plan to go back again soon.", "author": "Brittan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "Nestled away, just 1 block away from the madness of Court Street, is a perfect little restaurant called Jack the Horse Tavern.  If you take just a few extra steps away from the main, you will be rewarded with a wonderful dining experience.  It's elegant, comfortable, clean, and on the quiet side.  Perfect after a long night of work.  Be sure to sit at the bar and have your meal there for once rather than the table.  Get to know the bartender, he will help you out with a thorough knowledge of drinks - not to mention a good conversation for sure.  Do yourself a favor and just go...", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Food was excellent, the atmosphere was nice and the service was very good. Would definitely dine here again and hopefully soon!", "author": "S. O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-31", "description": "If you want to have an excellent meal at an ultra darling restaurant in Brooklyn Heights then go to Jack's (we're on a first name basis) and order the following:\n\n- Mac and cheese\n- Bacalao croquettes\n- \"Behind the knees\" cocktail\n- Diver Scallops entrée\n\nEverything will be perfect and delicious and you'll want to come back tomorrow for another order of that Mac n' cheese because that ish ain't foolin' around, ya hear? \n\nGreat for a date, great place to bring the parents and even great for a larger group if you make reservations in advance. Jack has got your back!", "author": "Jane K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-05", "description": "The set up:  I had just proposed to my girlfriend of almost seven years (I'll give you a minute to roll your eyes or wonder why it took so long).  I knew it had to take place in Brooklyn Heights; that's where we fell in love.  On a cold winter's evening we would need a spot that was close, warm and intimate with great food and something good to drink. Ever the planner, I scoped out a ton of places in the area.  Our favorite Manhattan restaurant was just too out of reach on such a cold night.  I liked the look of the place and I liked the reviews.\n\nJack the Horse Tavern had a lot to live up to.\n\nI made a reservation and called to see if I could get a menu ahead of time.  Chef Tim Oltmans was a gentleman on the phone to me and kind enough to email a menu.  It was a pitch perfect dinner.\n\nThe hostess and staff were very gracious.  They were present enough to serve us and absent enough to let us have a great evening.  Our server, Rusty, suggested we start with a mulled wine which was infused with chocolate.  It was velvety and warm and I had to remind myself to sip and enjoy it.  From there, we moved onto appetizers and cocktails.  We enjoyed the fabled, Behind the Knees with its crisp and clean citrus flavors.  As for appetizers, the Mac \u0026 Cheese was a must and worth every dollar - so creamy and substantial for a small portion.  The artichoke and pancetta appetizer was also very nicely balanced.  \n\nFor dinner we decided on the Scallops with Pumpkin Seed Gazpacho and the Grilled Pork Rib Chop with Pears and Parsnips in a Corn Bread Sauce.  The basic flavors blended beautifully in each dish and above that, the small surprises like the pumpkin and scallops or the corn bread sauce really brought the meal to another level entirely.  They're playing with the common feeling of a tavern and mixing more sophisticated flavors and techniques and we both really appreciated that.\n\nNot exactly a pub and not exactly haute cuisine but, somewhere wonderfully between the two.  Comfortable and yet not ordinary.  \n\nThe setting is quiet and clean while being intimate and cozy.  Jack the Horse treated us to a great start.\n\nCheers to a great place with a talented chef, a gifted mixologist and genial staff.  By the looks of the brunch menu and the rest of the dinner menu, we'll be seeing them again soon and often.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "Nice place, nice people, and good food except for the baked eggs.  We got the royal eggs with duck and it was meh - two poached eggs mixed with pesto mushroom and duck - weird taste so I would recommend going with another egg dish or the pancakes!", "author": "Mei S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-05", "description": "I stopped in for a beer here and it was nice enough. Honestly I just can't get past the name. Every time I see the sign I turn and walk away.", "author": "Joseph E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-23", "description": "Amazing food, ambience, everything. I ordered the hanger steak and it was arguably the best steak I've ever had. Their drink menu is amazing as well. It's tucked inside brooklyn heights and you'd miss it if you weren't looking for it. Highly recommend checking this place out.", "author": "Jared A."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}