{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "My friend and I capped off our Brooklyn Heights evening with a trip to Jack the Horse Tavern.  Walking through the door on a Sunday around 7:30, we entered a busy restaurant full of stylish yet cozy decor and a lot of happy diners.\n\nTo start, I had the red and green lettuce salad with manchego cheese, plums, and herbed croutons.  It was fresh, a good size, and well-dressed.  Next, I had the polenta with tomatoes and a soft-boiled egg--a satisfying savory plate.  We split a side of perfectly cooked brussel sprouts, which also had a few bright, delicious veggies (I think they were pickled radishes?).  My wine was good as well (and the description on the menu of \"agreeably aromatic\" made me laugh).  My friend may have fallen in love with her mac and cheese.  \n\nAlso, the tavern has good lighting and a good bathroom.  Service was solid.  For instance, they ran out of the risotto and let us know before we ordered that they had replaced it with a new offering--also a good sign about a restaurant that they are running out of dishes on a Sunday before 8pm.\n\nI would happily go back next time I'm in the area.", "author": "Sydney B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-30", "description": "Writing this review on behald of my mother.  My parents took me here to celebrate my birthday.  My mother called 3 weeks in advance to get a reservation and to ask them to put a candle in my dessert.  When we arrived on time, the hostess seemed annoyed that when she called (2 hours before our reservation) to confirm the rez my mom's phone went straight to voicemail.\n\nWe were in a show, cell phones off sort of situation, and its not ridiculous to be out of touch for two hours before a reservation.  The hostess was snotty the entire night.\n\nOur food was overall good.  I had brussel sprouts and the mussels.  The mussels were excellent, my fathers hanger steak was a bit tough, and my mothers Mac and cheese appetizer wasn't all I thought it would be from reading reviews.\n\nDessert took a long time to come out- we all assumed it was because of the candle they were putting in the cake.  But when the cake came candle-less my mother was very upset.  I was fine, it didnt really matter, but if a customer tells you to make a note of it when making a reservation and reminds you three times, it really shouldn't be  a problem.  The waitress apologized and offered a free dessert though said canceling the bill and recharging could be a bit of headache.  My mother went over to the hostess to see what happened and the hostess said \"it's all my fault\".  No real apology, no offering to do something about, not coming over to wish me a happy birthday.  \n\nWe left and the hostess didn't even say goodbye.\n\nThis is one of the few good restaurants in Brooklyn Heights, I just wish their customer service was less distracted with a smaller attitude.", "author": "Allison H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "Came her on Saturday at 6:00 for dinner and drinks.  \nWe got off to a rough start when the hostess told us we couldn't get a table for two until 8:00 (I must point out that half the tables in the place are empty) or we could eat at the bar.  So we ate at the bar.\nStarted with some happy hour specials: an 1862 cocktail for me (followed by an old-fashioned) a glass of Bordeaux for Yaryna and we shared some mac\u0026 cheese.\n\nThe drinks were a steal at $6, the 1862 (a divine blend of cognac, orgeat, angostura bitters a wedge of lime and just enough cayenne to give the drink a little spice) is in the same league as the best concoctions you'd find in Manhattan.  The mac and cheese is as good as everyone makes it out to be...the second best tasting $5 I have spent in NYC (the best if cupcakes are excluded).\n\nFor mains, I got a burger with bourbon onions, Yaryna got the pork chop.  My burger was juicy and delicious and came with a side of fries (which were quickly pilfered).  The pork chop was tender and tasty, but I question the use of bland oatmeal as a side).\n\nService was bit of a mixed bag:  We had to ask not once, but twice for bread but otherwise service was quick.  Then there was empty tables...all through dinner, there were at least 2 tables that remained unused.  Why could we not sit there?  Apparently this has been a problem for a while.", "author": "Todd A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-31", "description": "Cute, warm place for drinks. The Behind the Knees cocktail was Refreshing, with gin, grapefruit, lime, elderflower and cava.\n\nI'm vegetarian, so I was told only option for me would be a soup and\nsalad. I feel there is no need to come back for dinner, since I can make that at home.", "author": "Elizabeth T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "Awesome happy hour! Oyster were great, old fashions were super good, and so was the Mac and cheese.", "author": "Alissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-24", "description": "My boyfriend and I love this place and go when we (middle income) are in a good place to splurge a bit. We like to sit at the bar where Aaron is the bartender and creator of many of the drinks on the cocktail menu. \n\nThe food is not too salty, especially good since we don't add salt to our food at home. And because there's not too much salt, the flavors stand out.\n\nThe head chef often comes out when the kitchen isn't too busy to check out what's happening in the dining rooms. He's open to answer any questions and listen to the customers.\n\nThe portions are just right. One appetizer and an entree is just the right amount of food. We like to order Aaron's specialty cocktails before dinner and have a glass of red with the entrees. With dessert, the bill comes out to about $125 for the two of us. Not bad for art on a plate.", "author": "Kiai K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "Cozy and inviting. Ridiculously good macaroni and cheese. And appetizing salads. Menu is so appealing you'll have trouble deciding what to order.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-21", "description": "The best burger in the Heights.  I sat at the bar.  The bartender was friendly and service was good.  The variety of red wines by the glass is a little linear and disappointing.  But did I mention that this place has the best burger in the Heights?  So I guess I'll return.", "author": "Charles L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "Came here for dinner with a group of 6 adults and toddler. We first started at the adjacent oyster bar which is also part of the establishment. The oysters were very fresh! After having a few oysters we moved to the main dining room. They gave us a very spacious round table which is hard to come by in Brooklyn. Our waiter was very knowledgable with the menu and even brought over some books to entertain our toddler. For appetizers we shared a beet salad which was very good. The salad had 3 types of beets with greens and aged goat cheese. The grilled octopus was overcooked, however our dinner host told us that it's usually not so charred. I may give it a try on another night since I love octopus. \nFor the main entrees, we tried the pork chop which I highly recommend and the seared scallops, also excellent. The cauliflower purée was an excellent compliment to scallops and the hazelnuts added a bit of crunch. If you like Brussels sprouts, I highly recommend a side order. It was roasted well and cooked perfectly as with the other dishes. \nWe did not try the dessert. However I would definitely like to return to try their eggnog panna cotta. The ambience is great for small groups and casual. There was a decent amount of spacing between the tables which made for a comfortable dinner. We really liked the service from our waiter. If you are looking for a high quality meal in casual setting with cozy ambience then this is the place!", "author": "TIFFANY C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Excellent Brunch - Mimosa's are great. Service was top notch and a very relaxed Sunday Morning ambiance. Food was excellent and very moderately priced.", "author": "Manny R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-03", "description": "I was in there this past Sunday and the brunch was ruined by the waiter who was a total d-bag. If you see a hipster guy with like greasy jheri curl hair and bad earring (maybe southern drawl but more likely bs affect)-- that's him. \n\nbtw I'm local so this isn't some out-of-towner whine. \n\nPlace was packed (so much is forgivable with a decent attitude) but dude saunters over like he's doing us a big favor when he finally swings by to take our order. \n\nWas there with my girlfriend-- and parents (elderly but sharp). He talked down to my Mom as if she was developmentally disabled. Told my girlfriend they weren't \"doing lattes\" today although we saw people at the bar drinking them? His tone was terrible.\n\nHe never fills the waters once. Never fills the coffees once. Never stopped by to ask if we needed anything at all-- although he passed right by the table non-stop. \n\nEvery time I tried to flag him down he did the full ignore (obviously saw and heard me) and eventually when he stopped by he acted completely annoyed because I asked for more coffee at brunch. (Which by the way he poured half-full with a splashy finesse). Matched him to a tee.\n\nI've had bad service around town. I empathize with servers when they're overwhelmed-- but this guy was radiating jerkiness that it motivated me to post on this DAYS LATER.\n\nHope he sees this and he changes his ways-- or somebody over there wakes up to the fact that you have an ahole server on staff.\n\nI'm an awfully nice guy. I've waited tables. I don't like writing stuff like this-- but that guy was simply over the top. Time for a career change, yo. Maybe something with computers?", "author": "Filo B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-14", "description": "Decent enough food and beverage. However, they are not particularly polite or accommodating, especially for mid to larger parties. I find it questionable and in poor practice that a place that is known as a \"neighborhood\" spot would not be friendly an accommodating, especially to others in the area. When I was setting up a small get together for colleagues, they were extremely unwilling to work with us. Would recommend finding a place with a better attitude and, for any picky eaters, a wider selection.", "author": "Em M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-20", "description": "This is the first time I have walked into a restaurant in the 5 boroughs that felt like a neighborhood place. No hipsters, yuppies, business diners, red-eyed drunks. Brooklyn families! Locals! Enjoying outstanding food.\n\nNice beer selection, lots of local brews. Mac and cheese, which is the reason why we chose Jack the Horse, is a nicely balanced combination of flavors with the smoked gouda and the texture provided by the breadcrumbs. Share it as an app.\n\nHangar steak was well prepared, and I really appreciate that it came with potatoes as part of the meal and you weren't forced to buy an $8 monsterously-sized side dish (ahem, most steak places in the city). That might be ok for a table of 6, not for 2.\n\nThe smoked trout salad remained light enough, even though it had potatoes and a cream dressing.\n\nFor a normally-portioned meal, I thought a shared mac and cheese and the smoked trout salad was more than enough.", "author": "Alexis S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-19", "description": "Jack The Horse is another great neighborhood spot - their drinks are absolutely incredible!  Forget Calgon, \"behind the knees\" take me away!  Such an amazing cocktail - I highly recommend.\n\nMy boyfriend and I had only been here a few times for drinks and/or dessert, but took my parents for Mother's Day recently and were just as pleased with their dinner menu.  \n\nMy dad and boyfriend had a fantastic fish dish with polenta fries and my mother and I had the grilled artichoke which was lovely, and she had the mussels (the fresh ginger in the broth is such a great touch!).  I had another appetizer - the beet and watercress salad which was perfect.  We shared the rhubarb cobbler for dessert and I think that was the highlight of the meal... so deliciously unique!\n\nThe staff are very attentive and friendly as well... we will need to eat here more often!", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "I really wanted to love this place. In fact, I want to love it so much that I am probably going to give them another chance in the future. Unfortunately, my experience so far was mediocre. I should say that I have only tried this place for brunch. Three of our party had the eggs orleans, poached eggs with fried oysters, a to die for combination, right??? The fried oysters were indeed delightful and eggs were well poached. The problem was that the Hollandaise sauce was kind of disgusting, or let's say \"off\" if we are to be charitable and it kind of ruined what could have been an amazing dish. I would be tempted to bet money that what I was tasting was a bunch of mayonnaise with a little bit of Hollandaise sauce on top or Hollandaise sauce with mayonnaise mixed in. Now, it is true that Hollandaise sauce is similar to mayonnaise in some sense. However, I saw what looked like white gobs. Perhaps it was badly mixed or just bad Hollandaise sauce in some other way. None of that changes the fact that it kind of ruined the dish. Partly, it was just way too rich, but it also did not have a good flavor and it drowned out the wonderful flavors that were there. While I don't like to speak for other people, I will mention that the two other members of my party that ordered the same thing did not feel the sauce ruined the dish to the same extent I did, though they agreed it was not a good sauce. The fourth person ordered an omelet and was also unimpressed. On the up side, it was reasonably priced for the neighborhood.", "author": "Aliz C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-08", "description": "Had a disappointing experience here prompting me to post a very rare Yelp review.  Called in advance to make a dinner reservation with my wife's family.  When I called, I told them we would have a small, well-behaved baby with us in a car seat.  I said I wanted to make sure that was alright.  The guy I spoke to was very nice and took the reservation for 7:30.  He said he would make a note of the baby so they could accommodate us at an appropriately-sized table.\n\nAt 3:30 the day of the reservation I got a call from the hostess saying there had been a \"mistake\" with their reservation system and they could only seat us at 6 pm or 9 pm.  Of course neither of those worked, so she cancelled our reservation.  Surprisingly, she wasn't particularly apologetic about the cancellation.  She seemed to regard it as our fault for not being prepared to accept the offer of a 6 pm dinner reservation.  (Who gets home from work by 6 pm?)\n\nThe odd thing is that a few weeks before, I stopped by in person and asked the hostess about making a reservation on a different night, also mentioning we would have a small baby.  At the time she also told me they could accommodate us only at 6 pm or 9 pm.\n\nIt's perfectly fine if the restaurant isn't kid friendly.  (Although maybe a bit surprising, since Jack the Horse bills itself as a neighborhood institution in a neighborhood that is full of families with young kids.)  I certainly don't think all New York restaurants have an obligation to be kid friendly.  And I don't mind if they have a policy of trying to seat parties with kids before the dinner rush (or after it).  But taking a reservation with full knowledge that it includes a kid, then calling back to cancel a few hours before dinner strikes me as very poor form.\n\nTry Sociale instead.  The food is better, the staff more accommodating, and you don't have to worry about the restaurant drumming up a phony excuse to cancel on you a few hours before your reservation.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-24", "description": "I am biased because this is my go-to neighborhood restaurant, but I have been eating here consistently (at least twice a month) for the past six years and have had consistently good experiences. The name is a bit misleading, as the decor is much nicer than I would expect for a traditional \"tavern.\" It can get a bit loud, which to me is a good sign, as it shows that people are enjoying themselves, but you can also find a corner table here or there where it'll stay quiet.\n\nThe drinks are excellent (Long Bottom Bramble is a favorite), they always have a good selection of beers (Captain Lawrence) and wines, and the food is always a winner to me. \n\nI highly recommend the Hangar Steak, the Mac and Cheese, and the Ricotta \u0026 Butternut Squash Ravioli. Their burger is also excellent, as are the mussels. Come to think of it, I have had most of the menu and am a big fan of all of it. As a side, the brussels sprouts can't be wrong. \n\nTheir brunch is also worth checking out, but they can get a bit busy.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "Spending a leisurely Sunday morning at JTH before taking a leisurely stroll through Brooklyn Bridge Park is my ideal Sunday morning. The food at JTH is tasty but not overbearing. The hash and burrito are my favorites. The cheesy grits and eggs are also excellent. I always have a few Pumpkin Ale's while hanging at the horse and never fail to meet an interesting fellow patron to strike up conversation with.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "Absolutely one of the most consistently wonderful restaurants in Brooklyn (and Manhattan, actually). Tim, the chef, has a remarkable story to tell of how he came into catering and is available to share it with you most nights, as he is there almost all the time.\n\nWhich is one of the reasons I suspect the food is so delicious all the time. While everything is fabulous, I HIGHLY recommend the trout salad, at dinner or brunch. Also I'm a huge fan of their oyster appetizer. \n\nThe bar is GREAT (albeit a bit small and filled most nights with diners, so just popping in for a cocktail is risky on weekends especially. HOWEVER the cocktails are GLORIOUS and the bartenders (I'd call them Mixologists, but they are very modest) will get creative if you tell them what you have a hankering for. \n\nGreat dining experiences are rare. Consistently good food is rarer still. Jack the Horse sees to both.", "author": "Anne B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-11", "description": "Return? Yes\nAtmosphere (4) Low key, neighborhood feel - older couples and adult families. Quiet so easy to have a conversation.   \nWait (5) We had a reservation on a Thursday night and were seated immediately. Fyi, no brunch on Saturday\nFood (3+) beet salad (4 - would be better w/ more greens added), mixed salad (4 - caesar-esque), nrussel sprouts (4), grilled octopus (5 - other worldly good, served w/ white beans), chicken with cauliflower and potato puree (3+ predictably good but not any different that you could get at 10 other restaurants in the city), pork chop (3+ - onion sauce w/ sweet flavor), mussels (3), \nDrinks (n/a) 2 beers, 2 teas ($95), sauv blanc, martini ($105)\nService (4) Friendly and low key\nCost - $95 to $105 depending drink orders before tax and tip", "author": "Will S."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}