{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "Phenomenal breakfast sandwich - an artful twist on a classic.  Loved the thick-cut, braised pork belly, brioche bun, etc.  Unsung hero was the Dijon-ish potato salad - unexpected (strong), but excellent (complementary to rest of the meal). \n\nPlace was hopping (line out the door) midday on a spring Sunday, but able to snag three seats at the bar.  Didn't detract from the experience one bit.  Laid back yet perceptive staff ideal fit for the brunch crowd.      \n\nBut for living in another city, would frequent regularly.  A polished little spot.", "author": "John P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-06", "description": "Jack the Horse Tavern is my new neighborhood place!  \n\nWith a cozy bar area, and a quaint and warm dining room, this place is home away from home.  All it's missing is a fireplace.  \n\nGet a cocktail while you peruse the menu.  Order the Macaroni \u0026 Cheese ($9) appetizer to split (though I could easily eat one by myself).  It's very different, but in a way I can't quite explain.  I think it's because instead of cheddar they use Smoked Gouda and Fontina cheese...there's a little bite to it that's fun.\n\nFor dinner, I highly recommend the Free Range Chicken Breast ($21), but can't wait to try the Diver Scallops and the Nova Scotia Halibut.  The Big Bowl of PEI Mussels with Toasted Country Bread and French Fries also sounds out of this world.  But I have no worries...with this restaurant literally three blocks away, I foresee many a Fall and Winter evening at Jack the Horse.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-12", "description": "I'm dropping JtH another point.  The food is just pedestrian at this point. I can make most of this at home myself.  When I go to a restaurant I want feats that I can't pull off myself.\n\nJust there last week and it was really a chore to eat the entree.  Boring and lacking flavor.  And for $26, I want some action.\n\nSad, because when they first opened it was an above average dining experience. Not anymore.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-06", "description": "Came during a somewhat busy Saturday dinner service. Food was a solid B+ (ordered two appetizers to share and burgers all around) although took some time to catch the waitress's attention and even more to receive entrees. \n\nI'd return though perhaps not on a Friday or Saturday evening.", "author": "Laura F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-27", "description": "Had a late brunch here on Sunday. We were sat quickly, got our drinks, ordered, then waited for almost 30 minutes to get our food. All the tables around us, including some that sat after us, finished eating before we got our food. \n\nI ordered the duck hash. It had delicious chunks of savory duck mixed with salty potato deliciousness. The whole has was rounded out with a earthy nutmeg or a bit of cinnamon. If you don't like a bit of sweetness to your hash, I wouldn't order this. \n\nOther diners with me had the pancakes and an omelet. They were pretty standard and nothing to truly write home about. I'm planning to check out the dinner in the near future, as I have heard it is pretty stellar.", "author": "Justin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-03", "description": "Great cocktails, even better burger. \nThe only problem is there is always a wait when we stop by during the week, so it's busy almost always, call ahead and make a reservation.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "What is with the overpriced places! No you are not opened past 10 pm on a Saturday, portions are small and you are not even that great. The only thing I would say is worth trying here is the bar: amazing drinks made by a great barman.", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-10", "description": "I cannot believe the oysters I was just served. Tiny snot-like things, one like the next, although supposedly three different kinds. Maybe, but who would know?--despite their dozen-plus number, there wasn't enough to 'em to taste or see the difference. I would have been offended by these ridiculous wannabes at the happy hour price of a buck, but charging full price for these pathetic imposters:  what a colossal rip-off!! Shameful... If you ain't got the product, just say you've gone fishing and don't screw your patrons with this trash. Caveat emptor!", "author": "Lin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "Went here for brunch last week. I got the pork hash and it was amazing! Tastes great; the only reason I gave it 4 stars is because it's a bit pricey and I probably wouldn't go here more than a couple of times per year because of that. Nothing unreasonable, of course, but spending $15-20 on breakfast is a bit steep for me. Otherwise a nice place. I went in gym clothes post-workout but most other people were definitely dressed nicer :) Judging from the menu this would be a nice place for dinner, though, again - probably around $30 per person before drinks.", "author": "Alexandra G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-24", "description": "Unbeatable happy hour special! And for quality beers, wines, and cocktails -- not just the crappy well stuff that most places try to unload during HH.\n\nWe get the mac n' cheese every single time. The seasonable veggies have never disappointed.\n\nWinner, winner!", "author": "Erica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "Food - excellent. Service - adequate.  The fresh tomato with lemon salt and olive oil was a great starter and the beer selection was small but nicely varied\n\nEntree meats were cooked perfectly . Chicken had a crispy skin while retaining moisture and the angus hangar steak was a true medium rare", "author": "Geoff D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "Low key but able to dress it up. Beer or cocktails. Fries or oysters. Neighborhood joint with friendly air.", "author": "Tim C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "Came by for brunch on a Sunday morning right when they opened. I'll review food and service separately. \n\nI ordered the Royal Eggs, with bacon. They were absolutely amazing, I generally am not a runny yolk person but these would be my exception. They came with toast, great combination. I opted to add bacon, which was a great choice. Bacon was perfectly cooked, crisp but not overdone. I don't even think this is the best brunch dish on the menu, i.e. It gets even BETTER. I will be back. \n\nNow, service. They have 5 star food, but 3 star service. We arrived right as the restaurant opened and were having a leisurely brunch, as it should be. The server came over within 3 minutes of us sitting down and asked if we were ready to order. Asked for a minute. Server came back every 3-5 minutes and was a bit pestering. Restaurant was still half empty, I wasn't sure what the hurry was and I don't enjoy being rushed. Ordered, asked to add bacon to my Royal Eggs. Got a massive plate of bacon that was just ridiculous for one person. I thought, no way $1 gets me this much bacon. I was right. Server added a full side of bacon. Not a big deal, just annoying. If I wanted a pound of bacon, I would ask for it. Lastly, asked to split the check between two cards and server put the wrong amount on the cards... Not sure if maybe it was an off day, or server was new, etc. I'll be back but will request another person. \n\n\nWould definitely recommend. Great place for brunch and I'm excited to go back and try their dinner.", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "I can't tell if the name of this establishment sucks or if it's awesome.  After having experienced the ambiance and food this past weekend, and really enjoying myself, I'm going to go ahead and give it a thumbs up.  I read that the name references a fishing lake in Minnesota which is cool with me.  Especially because I had the smoked trout salad here and it was awesome.\n\nThis neighborhood joint is the type of place I'd want to be a regular at.  The bar area is inviting and big enough to sit at a table and still feel like you're at a bar.  If you want a more refined or romantic meal, you can sit in the tabled section.  Whatever vibe you're going for, you are guaranteed a quality meal.  If I lived around here, I'd be here at least once a week.  \n\nOnto the service.  I think we had the most enthusiastic, job-loving, menu-educated waiter ever.  He was extremely welcoming and helpful and explained the menu as if I've never eaten at restaurant before.  For example: \"An appetizer is a food item that you would start with before ordering your (air quotes) \"entree\".  It's typically smaller in size and meant for sharing.\"  That's a bit of an exaggeration but I think he explained to us what risotto was.  Some of his descriptions were actually quite helpful and I'm grateful for that.  This guy got an A for effort and the walk lived up to the talk.  \n\nAs for the food, I mentioned the smoked trout salad earlier which was really good.  I don't think I've ever seen a salad like this which is why we ordered it.  It was comprised of so many various items that you'd never think it would work but they all came together harmoniously.  I never thought potatoes and apples and fish to go together but it really worked well.  We also started with the mac and cheese which everyone raves about so we had to try it.  It was very good and extremely rich but after the food boner I had from our table neighbors orgasm over it minutes earlier, it didn't quite live up to the hype.  To me, the salad was more exciting and that says a lot coming from a fat boy like me.  For our (air-quote) \"entrees\", I had a short rib special over cheese grits and wife had the scallops in a shishito puree.  Our detail oriented waiter felt the need to point out that shishito peppers were more sweet than spicy.  Again, A for effort but unnecessary explanation.  The scallops dish came with 6 well sized bivalves of the diver variety which was unexpected and appreciated.  Most places tend to skimp on scallops giving you 3, 4, or 5 but my wife and I were both very surprised by that 6th mollusk.  They were cooked perfectly and the shishito puree was fantastic.  I was debating between the pork chop and the short rib and I'm so happy I went with the special.  Braised for 2 days, the pieces of short rib were fatty, tender and melted in my mouth.  Even my wife who isn't really into fatty meat loved them.  They sat on top of cheese grits which were maybe a little too pasty but the flavor profile was there.  A couple drops of sweet sauce dotting the plate balanced out the heavy grits and fatty meat.  I would order this dish again in a second.  We ended the meal with a tart which was forgettable.  \n\nMy only qualm with JtH is that they don't offer any oysters, even though they have an oyster bar next door.  I understand I'm not at the oyster bar and I wasn't too butt hurt that I couldn't get them in the restaurant but it seems like they are really missing out on some easy money here.  If they are already ordering oysters for their sidebar next door, what's the harm sending a bus boy over to get a couple dozen at a time?  Again, not a big deal in the end but just my 2 cents.  \n\nOverall, we had a fantastic meal and experience here and will definitely come back next time we find ourselves in BK Heights.", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "I could not resist taking an odyssey to my neighboring borough to have a bite of the supposedly luscious mac \u0026 cheese.  \n\n Brooklyn is not a strange land to me- in fact, I consider myself as a \"Brooklyn wannabe resident.\" Commuting from Queens to Brooklyn is generally a piece of cake but my subway ride to JTH Tavern wasn't exactly the norm: there was a crazy old drunk man, 2 teenagers who seemed not to have a sense of what personal space is and a guy who decided to just knock on the conductor's door [side bar- the man operating the train actually stopped the train and opened the door, to the horror of every passenger on-board]. One could just imagine the colossal hope that Jack the Horse Tavern will be worth the unnecessary inconveniences.\n\nTo my relief, JTH Tavern's celebrated first course entree made me forget about the previous ordeal (at least for the time being). The mac \u0026 cheese was beyond satisfactory. The aroma was a teaser, I couldn't help salivating as the dish was placed in front of me. I took my first bite and I was transported to what felt like a fluffy room filled with things that made me melt and fall in love. It was an epic moment when the smoked Gouda and fontina cheeses and the cavatappi pasta melded in exquisite harmony. The wise move of choosing the mentioned cheeses added a sophisticated depth to the dish (something that I wish every mac \u0026 cheese have). It was savory, sweet and a little bit salty. The smoky element was also there. My favorite part was the texture- it was crunchy upon the first bite and when bitten, it just melts in your mouth. The mac \u0026 cheese brought coziness and warmth. It was quite challenging to remain civilized when consuming it.", "author": "Christina E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "The food and ambiance both deserve 5 stars! The octopus and pork chop are 2 favorites.", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "I loved Jack the Horse.  I went with my family - seven of us total - for brunch on Sunday around 1pm.  The place was packed, but we were in luck, due to a table of 8 just leaving as we got to the door.  The wait was less than five minutes and our drinks (amazing bloody marys) were ordered very promptly.  Everyone working there was very friendly and attentive.\n\nEveryone's food was phenomenal - between the seven of us, we had:\n- Eggs Orleans (I deducted one star because the fried oysters were particularly fishy...although I wouldn't say they were bad at all.  Maybe not super fresh?)\n-Royal Eggs\n- 2 Eggs (over easy)\n- Cheese Grits with Poached Eggs and Bacon\n- Pancakes\n- An Omelet\n- French Toast\n\nEverything was over-the-top delicious (aside from my oysters, but I wouldn't let that stop me from ordering the same thing again).  I'm so sorry not to have gone to Jack the Horse sooner and am anxious to try the dinner fare.  I can't imagine it will disappoint!", "author": "Lily E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-23", "description": "Five stars for the most out-of-this-world pasta dish i have ever had.\n\nSometimes, when I'm sitting at my desk I find my mind wandering to those perfect spirals swimming in an ooying, gooying steaming hot smoked Gouda and fontina pool of pure bliss. I think about the perfect layer of crunchy, buttery bread crumb topping and my heart melts a bit. These are winning flavors, my friends. It comes in an adorable ceramic dish. It is perfection. \n\nThere are other items on the menu that are excellent as well. Their salads are very good and the pork chop, when available, is juicy and delicious. Items change seasonally, which is a major plus in my book. Everything I have ever had has been very good. \n\nThis is a very neighborhoody and classy spot in beautiful Brooklyn Heights. I highly recommend it for a romantic date night or catching up with family or friends.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "bar seat. beer. bread. burger mussels fries.", "author": "Steph G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "Came here for dinner on Wednesday with the lady (we didn't do the Prix Fix).\n\nGetting in:\n- Walked in, seated immediately\n- Bar in the front with ample seating\n\nAtmosphere:\n- Rustic, cozy\n- Great neighborhood place right down the street\n\nService:\n- No complaints, good job\n\nFood:\n- Mixed herb polenta was tasty, poached egg oozes all over it - very nice\n- Brussels sprouts were great, although a little heavy on the radishes, which I didn't mind but the lady did\n- Cauliflower could have used much more time being roasted - it was a little underdone for my tastes\n- Risotto Rabbit Confit was very good\n\nDrinks:\n- Had a bottle of wine\n- Thought the wine list could use a few more approachable reds, price wise ($30/bttl).  Why not stock some great reds at this price point (Liberty School: $12/bttl, mark up 2.5x to $30...)\n\nOther:\n- I like this place.  I really want to try the brunch and the oyster room ($1 oysters from 5:30-7pm every day)", "author": "Matt B."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}