{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "The Happy Hour here is awesome. Really cheap drinks, especially for Brooklyn. They also have cheap plates during HH. If the bar is full step next door to the tiny Oyster Room. They have similar drink specials that are actually made at JTH bar and they share a kitchen with JTH.", "author": "Paul G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-22", "description": "My first time at the Jack Horse Tavern was also one of the first times I was able to explore this area of Brooklyn Heights. I arrived to find quaint tree lined streets, immaculate brownstones, mansions, public outdoor areas, benches, parks, and a series of uber clean streets named after fruits. This area of the city feels like it's reserved for wall street execs, old money, doctors, and lawyers, but to my surprise they let common folk roam around these streets too. Win one for the Serfs.\n\nAfter walking around the area for a little while I entered Jack Horse Tavern where I found all the employees extremely nice and accommodating. Our server was really laid back and had a genuinely friendly vibe about him. The food was fantastic. The highlights included the smoke trout salad and Eggs Orleans.\n\nIf you are looking to break out of your usual brunch places, this place is worth the visit, even if you're coming from another Borough.", "author": "john M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "Went there for a night cap, Friendly service, good drinks, nice atmosphere.But  from a design standpoint I would have went with a more historic font \u0026 signage to compliment the historic structure \u0026 surrounding area, but thats just me...", "author": "Michael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "Really cute venue.  Good food.  Good service.  Much less expensive than an equivalent place in the W. Village.\n\nThey use well liquor in the \"happy hour\" drinks so not as good a deal as you might think", "author": "Tom P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-25", "description": "I enjoyed the Eggs Orleans, which is an eggs benedict type dish with a fried oyster and artichoke.\n\nNice brunch menu complimented by the Jack the Horse bloody mary with bacon infused bourbon.", "author": "Korye L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-17", "description": "The food was delicious, but the hostess and our server did not add anything to our dining experience. We were not impressed with the service, but enjoyed our meal.", "author": "Cris G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-17", "description": "I'm tough on Brooklyn Heights - you can easily see that in my other reviews. And I'm a tough critic when it comes to brunch. This place is now in my top 5 best experiences in NYC for brunch period. A fried oyster, an artichoke heart and the best Hollandaise sauce made for the best eggs benedict. Period.\n\nCons: Staff shoved parties WAY too large at smaller tables just to get them seated. A table of 8 French tourists crammed into a 4 top next to us, was annoying on many levels not least of which was them all ordering the cheeseburger, rare. And the drinks. C'mon people. 8 bucks for a mimosa is 2 bucks too many.\n\nIf they hadn't crammed the European vacation next to us, I think this would have been a 5 star - full disclosure.", "author": "S B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "We started with Trout Salad. A little on salty side but very good. The braised short ribs over creamy grits with fingerling potatoes was the BEST ever had. For dessert stick with gelato and DEFINITELY avoid poppy seed crepe cake.", "author": "Alphonso R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "This is by far my favorite restaurant in Brooklyn. The cocktails are great and the food is delicious. It has a very intimate neighborhood feel to it that makes you just want to eat and drink there all night.  I have yet to have a bad meal here and a couple of times the chef has taken the time to come out and say hello, which is a nice touch.  My fiancé and I had our first date here and now we bring anyone who visits NYC or hasn't been here.  One thing all of us agree on is that the mac and cheese is the best in the city, hands down.", "author": "Elle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "My husband and I went for brunch and it was wonderful. our server was really great and gave us free homemade scones as it was our first visit. They were delish! We both ordered the cheeseburgers and fries and I must say it was one of the best burgers I have ever had! Very juicy and cooked perfectly. I had the Vermont cheddar but my husband had the Gruyere which I thought was better! To drink I had the Behind the Knees (Gin, elderflower, citrus juice,\u0026 prosecco). You can tell they take their drinks seriously. Very well done and heavy on the pour. ; ) We can't wait to be back to try the french toast and pancakes for brunch. The folks next to us had that and it looked amazing as well. Also, a must try for dinner -the mac n cheese. We will be back!", "author": "Katie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-09", "description": "One of my neighborhood haunts.  \n\nHappened upon Jack approximately 9 months ago when I moved into the neighborhood.  As cliche as can be, it was love at first bite.  \n\nMust have's - \n- Mac n Cheese - hands down.  The smokey-ness of the gouda and stringy-ness of the fontina make this one of the best mac's in NYC. Although, I wish they gave you a bit more...good breadcrumb distribution on top as well.\n\n-Smoked Trout Salad - even for someone who doesnt love \"fishy fish\" - this is damn good - nice balance of sweet and salty - combo of textures and bite is fantastic.  And I did not find one piece of that lame leaf they call \"Frisee\" (throat hairball) in there at all.  A+.\n\n-PEI Mussels - Oh gawd how I love this dish with the crispy garlic bread for sopping up the mussel juice. \n\n-Any drink bartender Jay is making.  I like the dark stuff (yumm, Bourbon) so I enjoy the relatively new addition the Buffalo Rifle. They also make a damn good Old Fashioned and Vieux Carre.  Don Draper, anyone? Right.\n\nIn a neighborhood (Brooklyn Heights) in which legtimately \"Good for NYC!\" restaurants are quite scarce, this one's a major win.\n\nGreat atmosphere - they know me in there by now, so I am always greeted by the manager, hostess, bartender(s) and servers.  It just feels like home.  \n\nBe sure to make a reservation on a weekend! You will have to wait to even sit at the bar.  It's just that good.", "author": "Alanna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-01", "description": "We went on a mind-numbingly cold night and shook the frost off with some potent old-school cocktails at the bar.  I recommend the punch, which would more accurately be called \"brown ale spiked with whiskey and a whole bunch of spices.\"  \n\nI stuck to the cold-busting theme at dinner with a crisp-topped mac \u0026 cheese and a smartly executed cassoulet.  My wife had a filet fired rare and punched up with blue cheese.  Both were too gut-busting for us to consider dessert, but we lingered over our wine, putting off our return to the cold outside.", "author": "bryan s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-14", "description": "I have to say, I think I'm pretty lucky to live about 2 blocks from this place. It constantly delivers. I would go there every week, if I could afford it (hey, I live here on subsidized law school housing!) but alas, once a month just has to do.\n\nJTH is a great place, first of all, to stop by just for some drinks. It has the creative cocktails that have become pretty popular in most of the city, for about 2-3 bucks less than city prices, and done really well. And if you get a good bartender (shout out to Aaron, he's awesome!!), like ours, he played around with our taste and made us unique off the menu coctails which were amazing (one being a cayenne peach drink, yum yum).\n\nDinner also is wonderful, along the lines of Perilla (new American type stuff executed very well). I've loved everything from the fish, the mac n cheese (an app but very filling, and warm/yummy), brussels sprout, and steak.\n\nDefinitely worth a visit for you Manhattanites :)", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-31", "description": "This cozy restaurant is located on a cute tree-lined street in Brooklyn Heights, a perfect neighborhood hangout. And the food is surprisingly good. However, in the 2 times I've been there the service has always left something to be desired. They are slow and inattentive, even when not full. And if you're not dressed well, or (gasp) come with a child, be prepared to get a bad table.\n\nFood: Small menu but well balanced for various preferences and tastes. They have a delicious mac \u0026 cheese made with smoked Gouda and a crunchy topping. Really amazing, I even have started having cravings for this and I don't even like smoked Gouda. My companion got the trout salad which he raved about. For last night's dinner I had the Divers sea scallops, a small dish but very filling and incredibly tasty. The scallops were perfect! On another visit I had the pizzette which was good but no need to order it again. I think whatever you order off this menu would be good, it's just degrees of good.\n\nAlthough people bring kids here, I wouldn't peg this as particular kid friendly. They have high chairs, crayons and a box of books at the front but no kids menu. I was pleased they gave my child water in a plastic Dora cup. You have to check your stroller at the door, and I'm told on weekend brunches it's stroller central. So that would all sound kid friendly, but really, I think they aim for an adult, up-market clientele and tolerate kids.", "author": "Laura D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "I normally loathe the artificial, watered-down mealtime commonly referred to as \"brunch\", but Jack the Horse is one of the few places that can actually get me jazzed up about it. I love coming here on a lazy Sunday morning and having the adorable bartender mix me up some heaven in a glass while I down some delicious comfort food and contentedly read the newspaper. \n\nTheir Behind the Knees prosecco cocktail was the first thing I ever had here and I'm very partial to it, but I'm slowly branching out and trying all their other cocktails too. So far each one of them has been terrific. The bartender is also great at mixing up something original on the spot, so don't be afraid to ask! \n\nFoodwise, I'm convinced that the smoked trout salad with a side of red flannel hash has got to be one of the best meals on Earth.\n\nI would be remiss if I did not also mention that the staff here is so sweet and friendly and the vibe is classy and laid-back, like the neighborhood it serves.", "author": "C.J. T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-26", "description": "Brunch\nWas bland.\nAtmosphere\nComfortable\nAnd was told by friends that dinner is good.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-07", "description": "One of the best bars in NYC and my favorite spot in Brooklyn Heights.", "author": "Haas R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-18", "description": "Here's what we had:\n\n1.  Crispy oysters with seaweed salad.  Delicious.  I'm a sucker for oysters in all forms, though.  They were perhaps a tiny bit overcooked, but still really, really nice.  The itsy-bitsy seaweed salad was good, too. This was the most memorable and unique dish of the evening. \n\n2.  Seared sea scallops.  Again, I'm a sucker for scallops and these were very sweet and had a nice texture.  Two beefs with the dish - it was $23 for 4 scallops.  And two out of the four were quite small.  I would expect for that price that they would all  be sizable sea scallops.  The size difference also contributed to the done-ness being inconsistent.  The two that were (too) small were sear and cooked perfectly.  The two that were big a plump were undercooked.\nAlso, the rest of this dish was equally tiny.  Tiny plate, miniature vegetables scattered around.  In fact, the more I write about the dish, the more annoyed I'm getting. It should be an appetizer and sell of about $15. \n\n3.  Burger.  No complaints.  Great fries, too.\n\n4. Lemon Blueberry Cheesecake.  I wanted to lick my plate.  Second favorite dish of the night.\n\nThe service was good, too.  I don't think I'll go out of my way to eat here again, since there's a bridge between it and me,  but it was a pleasant experience, none the less.  I can see why it's a hood favorite.", "author": "Dela C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-25", "description": "At brunch this morning I tried the smoked trout salad with grapes, fingerling potatoes and creme fraiche vinaigrette.  Life will never be the same.  \n\nThe mac n cheese is superb.  Oh but that smoked trout salad.  \n\nGreat cocktails too.  \n\nDid I mention the smoked trout salad?", "author": "Jeanne E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "Popped in here on a Wed night after a few cocktails at the Bklyn Hts Wine Bar.  There was no wait which was great.  Cute interior and decent dinner menu.  Slightly pricey.  I got the burger for around $16-18 I think.  It was fantastic.  If memory serves, it comes with melted fontina cheese and side a fries.  Very generous portion of fries and they were DELICIOUS.  Burger was slightly undercooked to my specification but that is pretty standard at most places.  OH, you HAVE to get the Mac 'n Cheese appetizer.  It's the perfect size for two people to share and daaaannng, it is good.  With all the good restaurants in Cobble Hill/Boerum Hill... I'd come back to Jack the Horse Tavern.", "author": "Krista C."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}