{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-09", "description": "I can't believe it has taken almost 3 years for me to try this place given I live in the area but I'm glad I finally did!  Most of the stellar reviews appear to be for brunch but this review is for dinner.\n\nFood:  Flavorful, filling, and delicious!  We started with the mac n' cheese which was amazing.  You have to order this!  I had the roasted chicken for my main which was very good.  Great portion size and super tasty!  My husband got the mussels which weren't quite a good, but still pretty yummy.\n\nAtmosphere:  Super cute neighborhood feel.  We came during the holidays so it was nicely decorated and felt very cozy.\n\nService:  No complaints!\n\nWe will be back for brunch soon!", "author": "Jen D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-10", "description": "To look forward and only experience disappointment... \n\nI have eaten here many times, never with frequency to be recognized, but a handful of times - living in the neighborhood for just 8 months.  \n\nAfter a long day and looking for a quiet dinner at the bar I was greeted by someone talking non-stop on her cell phone, no intent to get up and take the call away from the bar.  \n\nI ordered the mussels.  Looking forward to a meal that I can't prepare at home - the thought of the broth, bread and mussels seemed appealing on a cool winter night.  \n\nWhen the mussels arrived they were massive.  (Bigger is not always better!)  The first mussel I tried eating was so large I nearly gagged trying to chew it into digestible pieces.  Each chew my molars ground through a mouth full of sand - at last washing it down with beer.  \n\nAt this moment the bartender asked how they were - I responded \"I don't know what to say, they are massive - I'm not sure, I just don't know...\"  He responded, \"Yep, they are big.\"  \n\nI picked out the larger ones and put them aside not wanting to venture in to the metallic mouthfuls again.  I ate the few smaller ones and focused on dipping the bread in the broth.  This meal, which I had longed for, was ruined. \n\n Every mussel I ate was full of sand, they were also overcooked.  The abductor muscle which should remain attached to the shell in a properly cooked mussel was either detached or the shell had broken lose and a fractured piece of shell remained on the mussel.  \n\nAt the end of the meal the bartender asked, 'How were the mussels?' I replied, do my best impression to be polite, 'Let's leave this as don't ask don't tell.' So then he scoffed and handed me my check and I told him,  'These mussels are too large to be served, you need to inform the kitchen they aren't being cleaned properly - every single one I ate had sand in it - and on top of it all, one had a crab the size of a half-dollar in it.' I pointed to the crab on my side plate which he has worked to cover up with the bowl of shells.  His response 'Yeah, the kitchen is aware.'  \n\nIt's so unfortunate that he failed to make *me* aware when I ordered the mussels.  To add to my deep regret over this meal - I had to hear him and another patron talk about me as I put my jacket on in the curtained vestibule on my way out.  'I would have given him something else if he has asked?!' But, this is is not my place to ask - it was only his to offer.  \n\nIf an inferior product is on the menu is should be removed.  Don't serve dishes with problems that the kitchen is aware of!", "author": "DC S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-24", "description": "Weeknight quiet cozy spot to have dinner. However, the tables are too close together, and we heard every single word of others conversations who were sitting 2 tables away. I had the steak and hubby had the chicken. We were disappointed at the price of the half chicken since it was almost as much as a steak. I buy organic chicken all the time and I know that its definatly cheaper then a steak. Also, they did not include the wing. They do have Oregon Pinot Noire which is a great wine. It's a nice neigborhood spot, and I suggest y oi u stop by in you are in the area.", "author": "Donna P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-02", "description": "Mid week, it was nice and quiet.  The interior is charming and very comfy with the pillows by the wall.  The seating is pretty tight so coming here when its busy (perhaps over the weekend) will likely box you in with your neighbors and make you a part of each others conversation.  Overall, the food was delicious and the waitstaff is friendly.  I dont care about pricing as long as the quality is good but I feel like $27 for a chicken dish is too much.  Steak was delicious, and the octopus salad was equally delicious.", "author": "Leonard G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "As my boyfriend would say, Jack the Horse Tavern is a \"no frills\" kind of place. The service is swift and efficient, and the food is A+.\n\nThe burger is highly recommended - envision a perfectly grilled medium rare patty affixed to an ooey gooey slice of melted guyere cheese sandwiched between two fresh slices of focaccia bread. Each bite was really divine. The red and green baby lettuce salad I ordered was also surprisingly very tasty. Loved the diverse flavors and textures of all the ingredients in the dish. The roasted cauliflower was also great!", "author": "Jane N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "We started with the trout salad, which was a good size and tasty.  I had the hanger steak, which I enjoyed.  The rosemary fingerling potatoes were also good.  (The only off note was my own fault.  I thought that the balsalmic onion jam was a piece of meat, and happened to leave it for last, rather than enjoying it with the meat.)   One friend had the risotto and one had the salmon.  Both seemed happy.  Noshed too much on bread before the food came, so we were all too full for dessert.  \n\nWheelchair accessibility notes:   Easy entry and a ramp down to the second room.  Good-sized wheelchair accessible restroom.", "author": "Meg S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "JtH is probably my favorite brunch spot in Brooklyn. The chef comes out sometimes and makes the rounds and he has always been very kind.\n\nThe atmosphere is as the name suggests: a Tavern. On a quaint street in Brooklyn Heights, you can find some of the best french toasts, homemade biscuits, and my personal favorite, their Monte Cristo Sandwich. Buttery pieces of brioche, with melted cheese and ham. Even now writing this review, my mouth is watering.\n\nThe wait can be long on weekends and gets quite loud as well so be sure to get there early.", "author": "Charles R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-01", "description": "I've come here off and over on over the years and wound up having breakfast the other morning. I had gone in thinking I wanted the breakfast burrito- I was pretty hungry, but ended up with an omelet. The waitress recommended it and said they were light and delicious. True - the eggs were light as fluffy and a bit salty which was nice. I ordered the veggie option because of the goat cheese, mushrooms and caramelized onions. The filling was a small proportion, so I left a bit hungry. I should have ordered the bread and jams to start. The side salad was my favorite part of the meal. The greens were fresh and the salad dressing was spot on - I almost asked another portion. My side of bacon was very light as well - the bacon was cut extra thinly. It was a good sharing size portion - I brought about 1/2 home. The house coffee was nothing special. It was a busy day and everyone seemed to be happy with their food for the most part. The lemon ricotta pancake special sounded pretty good too. Looking forward to trying the breakfast burrito sometime soon - served with salsa verde, my fav!", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "A friend told me Jack the Horse Tavern has AMAZING pancakes. A few months back we visited on a Saturday - be warned - they only have brunch on Sunday!! A few months later we were able to make it back on a Sunday.\n\nI was excited to find there was no wait, since they only take reservations for dinner. We were seated in a cozy, couch-like booth. Their menu boasts have a variety of sweet and savory options, I opted for savory and ordered the cheesy grits and poached eggs ($9). You can add bacon for $1 or shrimp for $2, so I opted to add the shrimp. I was pleased with my dish. The grits were flavorful, with scallions and a nice seasoning, plus the shrimp and perfectly poached eggs added a nice touch.\n\nI couldn't help but steal a bite of my friends' pancakes. You can order plain buttermilk pancakes ($12) or add blueberries or bacon for $1 each. The pancakes come with a stack of 3 fluffy and filling pancakes, so try to arrive hungry or share these! \n\nOur waitress was super friendly and everything we ordered came out pretty quickly. All-around Jack the Horse Tavern offers an excellent brunch at reasonable prices, especially for Brooklyn Heights. I highly recommend!", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-16", "description": "I had the most disappointing meal at Jack the Horse last night. We moved into the neighborhood last year and are just getting around to trying local spots. I overheard two women at yoga last weekend raving about the brunch at Jack the Horse, so when I was trying to find a place to take my two houseguests it came to mind. It was \"burger night\" and that sounded good to everyone. We ventured out on a cold night, arrived at JtH and ordered. They were out of the salmon burger which both my husband and I had planned on ordering. Fine, I got the lamb burger and my friends both ordered a beef burger. Their burgers came with cheese ( one friend asked for cheddar but still it came with gruyere) and some onion, but no lettuce or tomato (it was extra?) and fries. My lamb burger  came with a small amount of chickpea fries and some mache', and a small tzaziki sauce. My husband's trout salad was overdressed and mush, his potato puree bland. The server was not great, and frankly seemed annoyed by us. These were pricey burgers ($18 for the lamb) and for a night dedicated to burgers seemed really uninspired, and not much quantity wise. There was no salt and pepper on our table, nothing welcoming about the place, in fact the whole experience really left a bad taste in my mouth. Maybe brunch is better? Happy hour? I don't know, I am reluctant to give them any more of my money or ever bring out of town visitors. The best part? The art work.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-25", "description": "This local tavern offers reasonably priced Sunday brunch in a laid back and chilled environment. Service can be a bit slow at times but overall we had a really good experience. I would highly recommend back wheat gluten free pancakes! I added extra blueberries and they were just delicious! Big portion too!", "author": "Marzena D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Friendly service, fantastic menu. I've been here for brunch and dinner and I really enjoyed the food and flavor combinations. This place is located on the cozy Hicks street. Grab a bite here and walk the promenade afterwards. \n\nOnly suggestion: milk alternative options for coffee at brunch.", "author": "Kristin D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-12", "description": "I used to eat dinner here all the time; however in my opinion, in recent years the service has declined immensly.  Warning the following involves a pubic hair in our scone.\n\nTake brunch last week. Sat at the table, received water, then 20 minutes passed before our server came to our table. Then she rushed us to get our order in.\n\nWhen we received our scones, their was a huge pubic hair on the Danish roll style scone. When I grabbed the scone before noticing the hair the roll broke off. (Important part of the experience)\n\nI then asked to have a new plate of scones, the server said she would get us new ones. She did no such thing as she came back with the same scones with their hair taken off - we know this because the Danish roll was broken off. GROSS!\n\nThen we were invisible - no one came to fill our water. The only time the server came by again was to give us the bill, rushing us to leave.\n\nIt was sad because we had a guest in from Vancouver, and they were horrified with this experience. Plenty of places in the heights, i'll skip this one next time.\n\nWord advice to management, if you can't handle a NYC brunch rush, don't offer it.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-14", "description": "Whenever we are in town for our anniversary this is our go-to place for a relaxed delicious dinner. The smoked trout salad is a constant favorite and we tried the butternut squash ravioli which was fantastic. Perfectly done salmon with crispy skin - delicious cocktails and was happy to have organic pinot noir as a choice! The desserts were just ok - maybe next time we'll try the cheese instead.", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "Great sports bar ,now that its baseball season everything is back in full circle, so I can enjoy watching the game in a good sports bar", "author": "Charles B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "It is a very nice spot for brunch.   It is quiet and it has positive atmosphere.  I order a duck hash with poaches eggs.  The vegetables are balance out the salty of the duck. The eggs are poach perfectly.    My friend order the egg orleans. It is also good.", "author": "H L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Great restaurant close to the Brooklyn Bridge. Everything we had was delicious. Service was great. Ambiance was calm and relaxing. Wait staff took great care of us. Will come back next time I am in Brooklyn.", "author": "Will B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-12", "description": "Went for Sunday brunch. Great food but slow and sometimes forgetful service. Waitress was nice. Peak hours brunch should have two waitresses instead of one.", "author": "JP W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Yummy : Comfy : Friendly\nAppetizers were great. \nMains were great. \nDessert was great. \nTruly welcoming staff and excellent service all around. \nDid I mention that the food was great?\n\nIt was snowing the night we went there. That made for a lovely view to go along with dinner.", "author": "E.S. L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-07", "description": "Nice place. We stopped for a last drink after dinner nearby at Henry's End. I was drinked out but my companions - hubs, bro in law, nephew enjoyed Jack's special cocktails and a simple scotch and water while I took a break with soda water and lemon.\n\nIt seemed like a good if pricey neighborhood bar, good service \u0026 semi-divey attitude. I did love the neighborhood and the people in the bar that night - a quiet night but good people - tolerant of \u0026 amused by a mildly intoxicated southern lady and her fellows.", "author": "Jennifer B."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}