{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "On my sole visit here, a couple I was with ordered 4 apps for their meal--what a good way to go.  I had a pork loin, which was also very good.  There's a decent list of beers, and the atmosphere is lovely.  For a delightful evening I'd recommend taking a stroll along the promenade and hitting the Horse for a late night meal.", "author": "Nathan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "I finally ate the food and I was very impressed.  So as not to personally offend peter d. and because I love a good mac \u0026 cheese, I tried it last night and I am so thankful that I did.  It is a small appetizer portion that comes in a small dish and is unrivaled in its perfection.  The cheese crumble on top and the amazing consistency of the dish form an unstoppable duo rich with a unique flavor.\n\nI also had the trout salad which was really good.  Potatoes, pears, grapes and greens all mixed in with a very tasty dressing.  There was not a ton of trout in there, but it was very flavorful and a good mix overall.\n\nAdd in an old fashioned which was mixed to perfection and a tap IPA and it was a good meal and a good night.  The service here is always very friendly and helpful.  I like that you can eat at the bar which is a nice option to have.\n\nThe only reason I can't give the fifth star is because I have not tried an entree yet, but the mac \u0026 cheese is worth 6 stars without question.  This is the perfect neighborhood restaurant and anyone coming through Brooklyn Heights should drop in for a drink, appetizer or full-on meal.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-07", "description": "I thought this place was just a bar, but turns out it's actually a restaurant.  Oops!  But they were still very accommodating to me and my friend - we shared just a cheese plate and a few glasses of wine.  The chef came out to explain where all the cheeses came from and other pertinent info.  The wine by the glass selections were amazing - hard to find!  Very good.  I looked around at the food and would definitely come back for dinner.", "author": "Julie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-30", "description": "My first Brooklyn review!  No way!  I am off the island, did I get lost?  What happened?\n\nOnly a good friend's birthday (or a date with a cool guy [hint hint]) could get me out to the BK.  Last night we ended our night here, it was warm, inviting, and the food smelled great.\n\nMax, the bartender, was very knowledgeable, friendly, and a great mixologist.  Now that I'm trying to incorporate Bourbon into my cocktail rotation, I decided to have my first mint julep.  It was delicious, slightly sweet, slightly minty, and very borboun-y.  \nNext I had the Behind the Knees since it's made with St. Germain, which is also a booze I have been trying to incorporate.  I'm not sure what's in the Behind the Knees, but it sounds sexy and tasted amazing.  Once the kitchen closed, the place cleared out except for a few of us booze hounds, which we truly enjoyed because then we were able to sit at a nice round table and have some pretty heated convo.\n\nI left this establishment the way I always want to end a Saturday night, past midnight, pretty tipsy, and not alone.  Damn he was just a friend...\n\nA very cool place in the BK, I will definitely be back.", "author": "Rebecca H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-07", "description": "Stop number 2 on a mac and cheese crawl.  OMG I think I am in love.  And last time I checked, I cannot marry a bowl of macaroni and cheese. \n\nThey hostess here was very accommodating and very friendly.  Although they don't normally take reservations, they did for us Yelpers.  Kudos to them.  \n\nBetween the 8 of us ordered 4 plates of Mac and cheese.  They gave us the 5th on the house.  AWESOMENESS\n\nANNDDDD their chef even came out to meet us and introduce himself.  \n\nNow, down to the cuisine.  As previously mentioned, I'M IN LOVE .  The mac n cheese was crispy, oohey and gooey. The chef did not use regular macaroni.  Instead it was tubular and long and twisty AND DELICIOUS.  Everything about this dish makes me want to travel two hours to Brooklyn Heights for some more of this mac-and-cheese-goodness.  \n\nWill I come back here? AbSoFuckiNgLuTeLy", "author": "Brandice H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-04", "description": "\"try the behind the knees cocktail! I GUARANTEE you will like it!\"  so began our evening at Jack the Horse Tavern, with a confident and totally accurate endorsement of a delicious cocktail by our exuberant server.  The other cocktails we tried - the Brooklyn and something with Tequila - were also smash hits.  \n\nthe Mac \u0026 Cheese comes in a small dish for the price, but you will overlook that based on phenomenal tastiness.  (Ben: \"this tastes like it might have bacon in it!\"   Dee, a vegetarian, shoving mac \u0026 cheese into her mouth: \"I can't see any, so I don't care.\"  I actually think its just the smoky flavor of the gouda.)  Even without bacon, I'm prepared to say that this mac \u0026 cheese cannot be improved upon.  That's a bold statement, and contrary to my usual position on everything being better with bacon, but I'll stand by it.  The sprinkling of bread crumbs provides a lovely crunch, and the combination of cheeses is lipsmacking good. \n\nThe entrees were also great:  the pork loin was succulent, the monkfish with mussels and little potato disks was so amazing we had to ask for another basket of bread to sop up every last bit of sauce.  The only thing that underwhelmed us was dessert - the brownie was too dry.  \n\nThe atmosphere is relaxed and charming.  We stayed quite a while and weren't rushed at all.  The restaurant is on an adorable corner in Brooklyn Heights and has giant windows, and the sight of the old Brooklyn veterinary society with its quaint red door across the street nicely complemented the meal.", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-13", "description": "On an unassuming corner in historic Brooklyn Heights fruit stand streets is a corner door.  Enter and you'll find a warm, cheerful bar and comfortable dining room with pillows strewn along the large banquet. As casual as Jack the Horse feels, the servers try hard to maintain the dignity of the menu.  \n\nMy friend was more than pleased with his grilled diver sea scallops over pureed cauliflower ($19).  I had the briased short ribs over mashed potatoes and grilled brussel sprouts ($18) and cleaned my plate.  The food tasted fresh and cooked perfectly and the prices were impressive for such delightful dishes.  The wine connoisseur was happy with the wine list and selected a bottle of 2005 Mendoza, Argentinean red which was gorgeous paired with my beef. \n\nThe over all ambiance of Jack the horse was a comfortable yet sophisticated.  If only I lived on Pineapple or Orange....", "author": "Lindsay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-08", "description": "If there are two things I love in this world, it's macaroni \u0026 cheese (as in the dish, not 1. macaroni and 2. cheese) and classic cocktails.  I seek both out with the fervor of a bloodhound on the trail of a criminal--a new old-timey speakeasy opens up?  I'm there the first week (see:  Hotel Delmano).  I catch wind of some phenomenal mac \u0026 cheese at the latest comfort food destination?  MUST.  HAVE.\n\nMind-blowingly, JTH has both, and is a 3-minute walk from my apartment.  How is it that a year has gone by, and I haven't been?  Mostly because my friends are lame and will make up any excuse not to go to Brooklyn.  But I finally made plans with a friend whose bf lives up the street, and we arrived at JTH, our goals twofold:  \n\n1. Eat mac \u0026 cheese.  \n2.  Shmooze up the bartender and try as many cocktails as possible.  \n\nMission, my friends, accomplished.  The mac \u0026 cheese was perfect (though TINY!!!  I could have eaten probably 2 more orders)--sharp cheese, perfectly buttery and crispy on top.  I also had the spinach salad, which was fantastic--baby spinach with goat cheese, dried cranberries and apricots, fresh cranberries and pecans.  Best salad I've had in recent memory.  \n\nAnd now...the drinks.  How much space do I have here?  Aaron the bartender knows his shit.  Over the course of the night we talked all kinds of cocktail nerd talk--LeNell's, PDT, M\u0026H, Pegu etc.  So fun.  They have a seasonal menu, so most drinks were in the dark-liquor family--bourbon, scotch, rum--but a couple of gin drinks to round things out.  We started with a Man of Leisure, a bourbon-based drink where the garnish is a flaming orange peel, and a Robbie Robbie, a variation on a Rob Roy.  \n\nNext, I wanted something made with Aperol, so Aaron made me an Aperol Royale (not on the menu), which has Aperol, gin, lemon and champagne--very tasty and refreshing.  My friend's next drink was the Widow's Kiss, which was apple-y and very sweet, my least favorite of the night, but the bar was set so high!  \n\nHmm...I feel like I should wrap things up here. Had 3 more drinks, including an Aaron original, the Stylish Cocktail.  Everything was so good!  \n\nIt could be a very dangerous thing that JTH is within stumbling distance.", "author": "Becca S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "Delicious prixe fixe dinner menu. Highlights were the braised smoked pork belly appetizer, mac n cheese and mussels in a white wine broth. Honorable mention to the peach almond tart dessert. The service was attentive and friendly and the location is perfect.", "author": "Mae W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-25", "description": "Jack..the ass! My girlfriend and I had both been here before and liked it, so we thought we'd stop in for a quick bite on our way to a show. We figured 45 min. would be enough time to order a drink and an entree, especially since there were only a few tables occupied (we were there around 6:30pm on a summer Friday.) \n\nWe were wrong! Got our wine and then we waited...and waited...while our waiter disappeared behind the bar to mix drinks, the chef came out to chat with the table next to ours, and the rest of the waitstaff (and some of the kitchen staff) stood around in the back of the restaurant chatting. No one came by to check on our table, even as (the few) other tables got their entrees, then their desserts. Finally, I went to find our waiter, still behind the bar. He sent another waiter to check with the kitchen. Waiter #2 reported back to him, not to us, so I had to get up again and ask him for the scoop. His response? \"If you're in a hurry, I guess you'd better go, because your order got lost.\" Lost? With maybe 6 tables occupied in the whole place? Hard to believe they could be so sloppy and unconcerned. \n\nThe bar manager, who overheard the waiter's comment, did run out after us to apologize and offer us complimentary drinks in the future, but at this point, we're pretty sure that Jack doesn't know jack about decent service.", "author": "Stephanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-23", "description": "I went last night for dinner with my wife.  The pork chop was delicious.  It was a nice portion, not huge.  The fluke was good but not exceptional.  The octopus appetizer and the beet salad were very tasty.  The wines paired nicely with our food.  This is a sophisticated, comfortable restaurant with no attitude and great food.  I highly recommend Jack the Horse Tavern.", "author": "Paul A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "Nice ambaince, huge windows, awesome Mac \u0026 Cheese\n\nOur 2nd stop of our Mac \u0026 Cheese Crawl, having come from a very disappointing Mac \u0026 Cheese at Waterfront Ale House, my only re-assurance was that it can't much worse than that (and if it did, I would be heading to my local grocery store to pick up some Kraft's Mac \u0026 Cheese and make it myself).\n\nJack the Horse Tarven has a rustic feel to it. Although the construction and furniture are quite new, I really felt like I wasn't in the city, but in more rural area of the country. The owner was quite warm and welcomed all of us. We put together 2 table of 4s to make 1 table of 8. This setup was actually better because we didn't feel like we had to shout across to talk to each other. It also helped that the place was relatively quiet on a nice Saturday mid-afternoon.\n\nWe had a beer and had 4 orders of Mac \u0026 cheese. The owner was gracious enough to give us a free one on the house. Boy, did that come in handy. The Mac \u0026 Cheese was so delicious. It was one of the best Mac \u0026 Cheese I ever had. If we weren't doing the crawl, we would have order more and just stuff our face until we can't eat anymore. It was that good.\n\nI really like Jack the Horse Tavern, I also like their huge windows too. Its so relaxing to look out into their huge window, on to the quiet street, no traffic, and just enjoy their Mac \u0026 Cheese. I will definitely be back to try out the other items on their menu.", "author": "Jack N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-11", "description": "I was fairly underwhelmed by this place. The staff weren't the most helpful or friendly, we waited ages for the food and when it came it was just average. The bloody marys are the worst I've had in a while, watery, no spice.\n\nThe place looks very nice inside, I just think the food and service needs improving. Don't rush to check this place out, I'd give it 2.5 stars if yelp had that option..", "author": "Charles R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-03", "description": "Proof that alchemy still exists (both behind the bar and on the fire), Jack the Horse served up some of the best food I've had all year. In fact, I've just ratcheted their crunchy oysters to the top of my Last Meal fantasy menu. The two other dishes we sampled (beet salad and an olive-laden roast chicken) weren't shudder-inducing so much as solid performers without a false note between them.\n\nRather, it was the service that seemed to be singing off-pitch-- inexplicably so, until we learned our bartender was in the throes of a celebrity chef interview.  He did comp us our last round, though - a thoughtful gesture considering there had been moments when his rants about fermentation (addressed to the journalists beside us) had skirted the line between animated and over-the-top. (While I happened to be in the mood for a citrus-y sauvignon blanc, I'm sure all will be forgiven once I sample one of his competition-grade cocktails.)\n\nAs I sat at the bar, I couldn't help wishing I'd spent less of my youth cramming for science tests, and more time experimenting with the alkaline levels of the dozen varieties of bitters I spotted.   Their curled yellow labels, promising both olfactory and digestive benefits, provided a trendy dash of apothecary chic to a timelessly handsome and polished interior.", "author": "Natty G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-27", "description": "I really love this place. The drinks are amazing. Especially the Brooklyn Heights. The service is excellent. The bartenders are friendly and know how to make great cocktails. I can't recommend the mac and cheese enough. It is the best I have ever had. I just wish they would serve a larger portion because it is so good. If you have had a bad experience here I recommend giving it another try. Maybe just sit at the bar for some drinks. Definitely worth it. I'm just happy I live close by, and can come regularly.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "What a great meal we had at this place.  My family picked it because Brooklyn Heights is sort of in the middle of where we all live.  Each course was delicious and the drinks were great.  The place itself is cute and charming and fits perfectly into the neighborhood. It has a casual elegance which feels great while having a meal.  Looking forward to coming back!", "author": "russell b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-01", "description": "Perfect neighborhood place, of which there are far too few in Brooklyn Heights. Ideal date place and for married couples who want to enjoy a night together. Too quiet and subdued for boisterous kiddies, but there a couple of larger tables for families. \n\nThe grades... \n\n1. Value. Grade: B+. Not cheap by any measure, nor are the portions huge, but the food is of high quality, well prepared and I've never left unsatisfied. The bar menu and wine list are very reasonable. \n\n2. Food. Grade: A-. I've yet to have a bad meal. The bar turns out great cocktails, including a handful of signature drinks. For starters, the fried oysters are great but the portion is small. The smoked trout salad is fantastic and large enough for a main course. For entrees, the short ribs and potato puree is perfect for a cold winter night. The hangar steak is delicious, but it arrives sliced, giving the impression of a smallish portion. For fish, go with the catch of the day -- it's never disappointed. The pancakes, french toast and HOMEMADE sausage on the Sunday brunch menu are all out of this world. \n\n3. Service. Grade: B. Unremarkable either way, which means the service is good. Everyone is friendly and generally efficient. The occasional small misstep happens -- a forgotten drink, etc -- but no biggie. \n\n4. Ambiance: Grade: B+ Exactly the type of casual, reasonably high-end place you want to find in a neighborhood like Brooklyn Heights... A worn, comfortable feel... dark, exposed brick, old wooden floors, motiv candles on every table provide the primary lighting. Sunday brunch sees a nice mix of families and champagne guzzlers, giving the place a very happy vibe. \n\nBottom line: One of the best places in the neighborhood. Bring your best girl, your mom and dad when they're in town, friends for alcohol-fueled Sunday brunch or enjoy a quiet meal with some wine and a good book. Grade: A-.", "author": "O U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "Excellent dinner--worth the trip from Manhattan to Brooklyn Heights, for sure.  Highlights were the flavorful chunky gazpacho, individual vegetarian pizza, peach cake, and dark chocolate gelato.  Next time want to try the mac \u0026 cheese, which looked great.  Pleasant atmosphere, lots of charm in a quiet neighborhood.", "author": "Dorothy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-20", "description": "Jack the Horse Tavern did a beautiful job feeding our party of eight before a Barclays Center performance. The polenta was fabulous and the heirloom tomatoes were a perfect start to the meal. The setting was cozy and we will go back again!", "author": "Helen U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-02", "description": "Years ago I used to LOVE Jack the Horse Tavern. Over the last year, however, I have noticed a discrete change in its quality of service. I have returned dishes to the kitchen each and every time I have been there over the last year because they were either cold or undercooked. It seems as if the kitchen is suffering from quite a bit of mismanagement, and unfortunately there are lots of timing mishaps as a result. It is sad because the cooks are obviously putting quite a bit of effort into food prep, only to have the staff to ruin the meal with poor execution.", "author": "tanya m."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}