{"aggregateRating": {"reviewCount": 370, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-05", "description": "Been here several times.  Food always good. Brunch is very good but crowded.  Unfortunately, the service is almost always \n quite poor and unattentive. They really need to improve the hiring and training", "author": "David W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-07", "description": "I've eaten in this restaurant many times and enjoy its atmosphere and service. It sometimes gets busy on the weekends, especially for lunch, but its really a great spot. I recommend it highly.", "author": "Datan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-17", "description": "UPDATED\n\nI went back here, and they have really gotten it together. They are now changing the menu regularly, and the bartender Damon is quite the mixologist - fans of little branch, etc will enjoy drinking here. It's much calmer than Henry St. Ale House, which is nice - I had a delicious hangar steak (though a tad undercooked), and the chicken liver schmeer w/ cranberry compote. Yum! They have excellent steak, chicken, burgers, and many other good dishes, red snapper, lamb loin. I crave the steak though.The service is warm and personable, and the manager once bought us drinks because we sat at the bar and chatted about sports, which we'd all enjoyed.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-28", "description": "JTH is really great.  Whenever we have something to celebrate, this is our go to BK Heights spot.  As BK Heights is a bit of a dead zone for good food... JTH is absolutely a diamond in the rough.  The burger is great, as is the mac \u0026 cheese (which we ordered with brussel spouts... DEFINITELY recommend).  They also have reasonably priced wines ($8 glass).", "author": "Mike P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-08", "description": "another restaurant that i had on my bookmarks for a very long time before i finally had an opportunity to try it.  we got there somewhat early (around 11:45, i think?) and that was good because we were seated right away, and there was a lot of people waiting when we left an hour later.  the service was good and the food was very tasty -- i had the eggs royale with prosciutto, and my bf had the omelet.  i would say... i liked my dish, but i found myself kinda regretting not ordering something else. i dunno, it didn't feel that substantial -- i could've eaten more after i was done.  but, i have no complaints about the food itself, it tasted good.\n\ni also tried the bloody mary version that was made with gin and had sliced cornichon.  good, but not worth $11.  the food prices are reasonable, though - most dishes are around $12.", "author": "Lily T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-23", "description": "I will begin this by saying that this was one of our favorite neighborhood restaurants and very convenient as we live across the street. As such we come here frequently and have always had great food, drinks and service. However, I wanted to write as I recently had a very annoying experience. We popped in around 6pm on Memorial Day weekend with the intention of just having a quick drink at the bar. All the bar seats were taken and so I asked if we could sit at one of the other tables explaining we would only be there for 1 drink (there were about 10 free dining tables at this point) I was told no, they were only for dining, so as a last resort I asked if we could just stand at the bar. Again I was told no, there is no room, which quite frankly was ridiculous. The maître de who I was speaking with was new and not the usual girl, I felt she was very rude and unaccommodating, speaking down to us like we weren't good enough for her establishment. A great shame as we usually have a wonderful time here.", "author": "Niki M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-04", "description": "I wish I could come often enough to reflect how much I like it!\n\nWhat's working against me:\n-It's in a very quiet neighborhood, so I'm never just passing by.\n-It's a little too pricey to pop in \"just because\".\n\nThis is sad, because the food is truly excellent, as is the [short] wine list. This summer: white gazpacho and a memorable gurwetztraminer for $9. On a Friday night last fall, everyone at the bar buzzed with conversation with each other and the bartender, yet it was never crowded or noisy. Seems like a nice place to come by with a book on weeknights, too.\n\nHalf-grastropub, half-restaurant, it's great for preplanned nice dinners, or for grabbing a drink with anyone in the neighborhood while actually being able to hold a conversation.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "Yeah, man. I like this place a lot. Last time I was there, I got the Monte Cristo. That shit makes me feel mad fat but I dig it so much, I don't be caring. They could put a little more horseradish in the bloody mary though.", "author": "Brad H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-02", "description": "Perfect little spot with just the right touches. 5-star comfort food not too expensive, great wine list. And easy to get to off the subway.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-18", "description": "Dropped in for dinner ,what a disaster ,the place has a very nice feel and in a beautiful part of Brooklyn ,but the food ,don't bother. Salad was dry and disgusting with canned beans ,entrée was short rib steak? What? a lifeless cold piece of stringy meat with almost no sauce that was one of the worst ideas I have ever seen ,when I was asked if I wanted to take home this disaster I said no throw it in the garbage ,I don't know why but I ordered dessert ,I was still hungry ,tarte tatin is caramelized apples on inverted pastry it is not 5 or 6 pieces of poorly cut barely cooked apples on raw puff pastry ,couldn't eat it ,they took nothing of bill even though I didn't eat entrée or dessert I tipped the waitperson well, the wine I had was good and I will never go back, too bad pretty place", "author": "Owen M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-24", "description": "neighbourhood favourite, esp. with the older folks. decent although not very exciting food. attractively priced prix fixe at 30 usd. big portions: my gf couldn't finish hers. not so generous servings of wine by the glass though.", "author": "Per P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-19", "description": "Good neighborhood tavern. The place is consistent and a blessing to have in a neighborhood with so few dining options. The trout salad, always a treat.", "author": "M L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-05", "description": "Came here with my wife (pregnant) and a couple of friends from Manhattan (wife also pregnant) for a very late Sunday brunch. Manager had assured us when we phoned in that while they don't take reservations, none would be necessary. When we arrived, place was full and we were told we'd have to stand around for 30-40 minutes (past brunch hour) - obviously wasn't happening. Didn't seem to want to help out or care much. The food might be good (wouldn't know) but the service says \"not much competition in Brooklyn Heights - so we couldn't care less about you\". Not coming back.", "author": "Ron R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-22", "description": "Jack the Horse always comes through when we want something nice, good and in Brooklyn Heights, and don't want a crazy wait.  Lighter fare than Henry's End, but I think just as good.  Great place to take parents in town, friends from other boroughs, etc... and include a walk over to the promenade before or after dinner.  \n\nEverything I've had is good, but I still dream about the heirloom tomato summertime salad. . . .", "author": "Allison S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "I frequented this place 3 times already and every time, the food has been good. It has charming decor and great service.The Mac and Cheese app is delicious as well as the mussels and the Trout salad. All staples on the menu. Its not cheap but not expensive either. Their wine list is good. I have never had a reservation to dine, here but the 3x i have come i arrived around 630-7 on a weeknight.", "author": "Rebecca F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-27", "description": "Stick to the basics. Burger is superb and the short ribs are sensational. Find Many things here to be rather heavily salted. Service is great. Drinks are great. Definitely a must try but call ahead and order simply.", "author": "Thadeus P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "My wife and really loved the food - had a fantastic beet salad to start and then had the Halibut, which was moist and delicious.  Good beer selection, and the ambiance is great.  I'm looking forward to going back again, and I'd highly recommend it to friends.", "author": "Benjamin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-15", "description": "I came here for the first time for brunch last Sunday and it was a delightful experience in every way.  I sat at the bar, it was a lovely day, I could look out into the street from where I was sitting..appreciating the lovely fall weather. Then I was served the \"behind the knees cocktail\" which was just perfect. I decided on the eggs orleans since I love eggs benedict..I ordered them without the oysters, and asked for a side of the duck confit. Wow, it was indeed the best version of eggs benedict I have ever tasted. I happen to also love artichokes, and this is the first time I had this dish incorporated them in it. .I was in heaven..The hollandaise was excellent and the side order of duck confit was also the best I ever tasted, and rare to find. This place can be described as understated elegance, comfortable but not stuffy, with a gourmet flair. The staff all work together beautifully. Congrats to you all, and the chef, on this delightful experience", "author": "Miriam P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "This place gets busy, but one of our favorite sunday brunches in brooklyn heights.   We get there early to beat the in-evitable rush.  \n\nSome of our favorites:\n\n1) Appetizer - Scones and jam.  An assortment of home-made scones and jams, it's a guilty pleasure.  Scones are flaky, moist . . . you hardly need the jam, which is not overly sweet. \n\n2)  Red Flannel Hash - A combination or brunoise (1/8th inch squares) of potato, corned beef, and beets.  My fiance who loves corned beef hashloves their take, which is actual corned beef instead of spam filler.  I think it's bland, but understand why she likes it. Nice texture contrast in my opinion. \n\n3)  Brioche French Toast - a favorite of ours!  Warm and a bit mushy in the middle, crusty around the edges, strong hints of cinnamon.  The slices are huge, definitely for sharing.  Because it's oversized, they get a nice crust on the circumference, but it's a bit soft in the middle usually. I like the contrast in texture . . . like thomas keller's salmon.  \n\n4)   Shrimp Club Sandwich - It's a triple decker, the standout is the shrimp (cold but cooked perfectly), avocado, paprika, which blends with the mayo, and a BLT.  I usually don't like clubs, don't like shrimp in a sandwich, but I do like this.  The ratio of crunch (bacon, toast) to meat (shrimp) to creamy (avocado, mayo) and umani (paprika) is great.  It's subtle.  I thought it was good, but was surprised I was coming back for it. \n\nOther recommendations:  Eggs orleans (especially if you like oysters and cholesterol. \n\nStay away:  Royal eggs.  It's a subtle dish of baked eggs, goat cheese, pesto and some other stuff.  I do appreciate a perfectly cooked egg,  but  . . .it's mushy, small, and in my humble opinion, nothing really ties the dish together. \n\n*Disclaimer:  this is clearly a place that I like.  It's a neighborhood place,  and there is inconsistency, but overall, a favorite brunch joint.", "author": "Glenn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-10", "description": "Mac and cheese, and a 'behind the knees'...both delicious, both a must. The mac and cheese is one of the best I've had - I want to go back right now just thinking about it.\n\nI also ordered the chicken which was wonderful. Very moist and flavorful, not too salty. The lemon potatoes were too strange for me, but all in all, a lovely dinner.", "author": "B H."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Jack the Horse Tavern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dUho9dARMFXtzGrRLNayGQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}