{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-11", "description": "Food is generally good though all meat seems to only have one cooking temperature:  black.  To be honest-I used to order out from this place all the time on seamless. Then i figured out their prices at the restaurant were as much as 30% less than ordering on seamless.  For instance, their Pete the Greek Wrap is $13.95 with chicken on seamless but only $10.95 on the menu.  So i started ordering at the restaurant.  Then it turns out they are now charging 3.99% if you use a credit card.  That seems like a lot to me.  I'll continue to eat there  (paying only in cash i suppose) but these pricing tricks have left a sour taste in my mouth so stars off for that.", "author": "John D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "Horrible customer service! I came into Nature's Grill excited to get a green juice. I ordered one that could be customized. Once ordered, my drink was being prepared and then made. After it was ready, I gave the cashier my card. She said we don't take cards for orders over 10. There was no visible sign. There was a small sign that was facing her! I asked to speak to a manager and there was no one available supposedly. The cashier took my drink and literally threw it out instead of allowing me to pay for it on my card. The experience was noted and I will not visit again.", "author": "C C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-12", "description": "I'm a regular at this place. I've been coming here for years. Every day I get the same protein shake... Chocolate powder, peanut butter, and almond milk blended with ice. I have lots of allergies to different fruits, so I don't add anything additional to my shake. I have watched the prices skyrocket with literally no enhancement in quality or service. When I first started coming here shakes were in the low eight dollar range... Then I started paying $8.71 which was fine. Today, they tried to raise the price yet again to $9.20. Additionally, they demand cash from me every day because it's below their $10 debit card minimum, which I have complied to seven days a week every day for the last three years without complaint. Last but not least, they have some nerve constantly raising prices on their loyal customers when you have to beg for an extra packet of hot sauce with your meal... These are the stingiest, cheapest owners I've ever met. It's a shame because the food is great, but I will no longer be spending my hard-earned money at a place that continues to up charge every six months. Spend your money elsewhere.", "author": "Liz E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-29", "description": "Just meh. Menu is huge, but I feel like everything tastes the same...it's bland. My biggest peeve was ordering a bison burger for delivery, selected the seven grain and for the burger literally on sandwich bread. It's a burger...so when you offer 7 grain we assume it's a 7 grain bun. And to be honest, the price is as high if not more than Moo Burger or Bareburger and they have much higher quality.", "author": "B B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "This a great place to eat, a large menu with many different types of food. The service is great. Staff are respectful and courteous. I dine here 3- 4 times per week.", "author": "Cathy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-21", "description": "I just moved to the area about a month ago and just found this place. I grab a spinach roll and a hangover helper juice all the time after hitting the gym. Great food, great service and a nice place. Definitely a favorite in the neighborhood.", "author": "Marc G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-16", "description": "There are some meals I order here regularly that I love...But if I order them for delivery I am not only paying a delivery fee and tip, but getting less then I would get in the restaurant. Multiple times I have ordered a sandwich for delivery that I regularly get in the restaurant and it comes with a side of blue chips...But delivery does not..And many times I have asked that they include them and they don't. Nor do they even acknowledge the request. For the price I'm paying for the sandwich and the delivery I'm not sure why I'm given less for the same exact order in the restaurant.", "author": "Marisa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-19", "description": "Nature's Grill, you are a mess. I stopped ordering from there about a year ago because they allllwaaayyssss screwed up my orders. Just tried them again (their proximity to my gym suckered me in). And of course, they screwed up my order. Get it together for the rest of your customers, I am done.", "author": "Brooklyn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "My  GF suggested this spot after we killed a workout at PF this morning, I was hungrier than a hostage so we headed downtown BK. \n\nI love the atmosphere of the restaurant, upon entering it smells like a heavenly garden of deliciousness. (Could have just been the hunger really, LOL) We were told we could sit anywhere, and decided to sit closer to the back because the draft of the door opening \u0026 closing often in January wasn't my idea of a cozy lunch. \n\nMenus in hand, the menu options consumed me because well, 1. I was starving \u0026 slightly hypoglycemia after the gym 2. I'm such a Foodie, I want it all!! \u0026 3. I can be severely indecisive.  So after changing my mind 4x \u0026 telling the waiter come back 3x (a bit annoying), I finally decided. \n\nThe wait for the food wasn't long at all, maybe 15 mins. I had the Blackened chicken on a jalapeño wrap with sweet potato fries. The fries are crunchy \u0026 sweet (tempura style or something), the wrap was packed tightly and made sweet love to my taste buds for 10 minutes. Had a lil pickled cucumbers on the side, which I liked surprisingly seeing how I loathe pickles. \n\nPrior to arriving there, I had joked about there being cheesecake because I felt like I deserved a reward for all the sweat I dropped off at the gym. Low and behold, there was! I didn't get it though because carrot cake steals my heart something fierce, I convinced my GF to get a slice for us. This isn't made at Nature's, \u0026 they told us it was sugar free but when I tell you D.I.V.I.N.E. S.U.B.L.I.M.E., PLEASE BELIEVE ME!!!! Something so inappropriate to my palette while eating that slice,  the best carrot cake I have had in my life thus far! *bows down* \n\nOkay, enough of that. Overall, I enjoyed this little place and will return to try out some other menu options. Thanks for a satisfying lunch guys!!", "author": "EBONY B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "Google said the this place had great food and gave it 5 stars but sadly we were mistaken. My partner and I both got burgers and there was absolutely no flavor what so ever. Even when we added ketchup and mayo it was tasteless. They were also over cooked: we ordered medium and both were well-done, it was like eating a hockey puck. The sweat potato fries that come extra tasted as if they had been cooked the day before; dried out and not fresh at all. My partner ordered sides of mixed veggies but while eating them we noticed a piece of sliced cooked chicken had been mixed into this veggie side dish. Now both of us eat meat but what if one of us didn't?! Unclear how that piece of chicken ended up in there but we quickly stopped eating it once it was found. All and all neither of us plan to go back here ever again.", "author": "Olivia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "I came here for lunch the other day and really enjoyed my meal!You have the option of sitting or getting food to go. There are about 15 tables. I ordered the black bean, roasted red pepper, brown rice, and avocado wrap. I substituted balsamic in for the teriyaki sauce. I loved it! It was fresh, tasty and filling. You could tell high quality ingredients were used. I would absolutely come back here for lunch. The service was also fast and the servers were lovely. The prices were very reasonable for what you got. They had a huge array of choices: wraps, paninis, bowls, salads, sandwiches, etc. They also serve breakfast. I would absolutely come back here. Glad there is a good healthy option in this area! Great vegetarian, vegan, and gluten free options available.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-06", "description": "Boyfriend and I just finished working out and wanted healthy food. We walked and came across to this place. Great food. I had a rice bowl and it was healthy and fresh. We will definitely come back again. \n\n\nBoyfriend : eto ta buenisimo coño", "author": "Rosalie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "I decided to give Nature's Grill another chance, and the quality of the food was good. I would highly recommend the salmon burger, it was very good and full of flavor. I would continue getting food from here.", "author": "Christi C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "If you're looking for a go to healthy spot.. Don't go here! First of all, as a pretty clean eater I immediately noticed many of their dishes contain mayo, sauces, added sugar and salt. I used my fitness pal and added some of the dishes in to see and they were 700-800 calories plus and atleast 60-70 carbs. However I decided to give it a try. \n\nI ordered the ahi tuna wrap and asked for no mayo or sauce. The wrap came drenched in mayo. The veggies were soggy and going bad. I thought they forgot the avocado but they didn't--The avocado was rotten and literally gray, I couldn't recognize it. Also, the portion of tuna was maybe 2-3 slices... Not an actual 5-6oz tuna steak as stated in the menu. \n \nThis was def not worth the $12.", "author": "Anicia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-25", "description": "As other have said, the menu is extensive and the portions are large (kinda defeats the purpose of being healthy, eh?). Service is great and there's tons of seating inside.\n\nThe combo wrap (bison and chicken) had a nice smokey flavor, but a tad oversauced. The ahi tuna wrap could've actually used more sauce (fixed with the Cholula hot sauce at the table. My buddy also had the grilled chicken bowl (with brown rice) and it was an exorbitant amount of food.\n\nThere are so many options here, everyone's bound to find something they agree with. They also have ostrich burgers, which I may just have to come back and try.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "Well, if you want to watch Fox News while you eat your organic salad, this is the place for you.  Food is relatively decent, but TV situation is awful. (Upgraded to 4 stars because of restaurant response.)", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-08", "description": "$15 Credit Card Min : \n\nOrdered a chicken Cesar wrap, waited about 10 mins or so until it was ready. I was annoyed at the fact that the credit card min. was $15.00 so I had to buy things I didn't want (a fruit salad along with a Vitamin water, came out to be $16.01) \n\nMy coworker kept telling me how glorious this place was and after eating my wrap, I wasn't pleased. It was just a regular wrap to me, nothing special. I've had better wraps at diners and the fruit was somewhat dry. Eh\n\nI won't be going back.", "author": "Shann R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "I've come here a handful of times and I really enjoy their wraps. Some wraps do come with some type of low fat mayo or sauce that you may want to request to have on the side in order to control how much you have. I don't know why other health freaks complain about that. Common sense: have it on the side or tell them to hold off on the fat-free mayo. Anyways, their wraps are really filling and they also have some tasty smoothies! The wait staff is pretty friendly and attentive as well.", "author": "Moses G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "Been here a few times to pick up food or dine in. I usually get the teriyaki steak salad bowl. They also have lunch specials that come with a free tasty calypso smoothie . The staff has been kind at all times.", "author": "Fabiola C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-09", "description": "This place has great salad and rice bowls. I got the cuban one here for lunch. Kind of pricey, but considering their options for brown rice and mostly organic items - it's about the same as other places in the area. \n\nWarning - service is really slow. Everything is made to order, so be prepared to wait.", "author": "Jess W."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}