{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-14", "description": "Check your order! Geez!! been there a number of times, and every so often they seem to screw up my order! Not the first or second but at least three times! What's frustrating is that it takes quite a bit of time, and you would think, getting it right would be part of the delay, NOT SO! I clearly understand GOOD FOOD takes a while to prepare, however,  a 25 min wait and to then have your order mixed up with someone else's is pretty frustrating! Took me 45 min exactly, after walking away with the incorrect order twice!!!!!!!!!! Someone with some authority needs to check all outgoing orders!", "author": "Jack W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-11", "description": "The split pea soup is good (it's creamed) although the second time I tried it, it had a tangy taste to it, they definitely don't skimp on the salt. Had the hummus avocado pita (served on flat bread) which was delicious but the sprouts in the sandwich were old and yellow. The vegetarian rice bowl, while big, is just not good. The zucchini didn't look fresh and the sauce they stir fry with just wasn't good. The rice was overcooked and COMES MIXED WITH CORN. It doesn't state that anywhere!!! I don't eat corn so I was a bit put off by that. Bf had bison burger which he enjoyed and baked potato. If you get a side of sweet potato fries that comes with your meal don't say you weren't warned at how small the portion is. Service is good, the (Russian) girl who waited on us was very pleasant but that techno music has got to go! I'll give them an extra star for service. The food is certainly not 3 stars.", "author": "Kay B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-25", "description": "Bad customer service, bad tasting food (dry, flavorless), clueless, and overly priced. Do not go there, do not order from them. Just a terrible experience.", "author": "Sarah H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-18", "description": "Super disappointed. The service was really bad, and when I asked the waitress about a gluten-free menu or gluten-free options, she told me she didn't know. I'm pretty sure she just didn't know what gluten is, but made no effort whatsoever to find out if there were available choices. For a \"health conscious\" kitchen, I found that pretty surprising and sad. I also sat at the table with a bowl of rice and no utensils to eat it with for a solid ten minutes, AFTER we asked for forks. The place was disorganized, service was atrocious, and food not very good at all.", "author": "Alison G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-01", "description": "Food was pretty good however their menu is wayyyy too big it feels like a phone book and i cant pick out what i want. TOO many options isent always good.", "author": "Yelena R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-26", "description": "I've stopped by a couple of times before and liked the wraps. The place is very clean and good selection of different healthy eating options. The staff is also friendly and helpful. I had some friends over at my place and was looking at some healthy food options. Nature's Grill recommended the wrap sampler and my friends and I loved it. Overall, the wraps had good flavor but they are healthy! My favorite was the teriyaki chicken wrap with rice. May not be a great option for someone on a low carb diet but the rice was really good. Most places use rice that's hard and dry but the rice in the wrap was like Jasmine rice and it was soft and delicious. If you have some friends over and don't feel like ordering a pizza give the wrap sampler a try.", "author": "Kenny Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-11", "description": "Food here is fine.  I come by after going to the Y for something \"healthy.\"  As it is though, a lot of the items are large in quantity, and I have very little self-control when it comes to not finishing what's in front of me, so I'm not sure it's all that healthy.  Besides that - the menu is huge and you could do worse for lunch in the area.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-30", "description": "I called, annoyed that a flier placed on my windshield had turned to muck in the rain. Granted, I probably shouldn't have hung up right after making my comment, but I did. The manager called me back and said that I was \"fucking ignorant\" for hanging up on him when he was going to offer me a free car wash. He then said I was a \"fucking fag\" and hung up on me. I called back and said that I was indeed a \"fag,\" and that I did not appreciate his use of the term. In the end, he apologized for calling me a \"fucking fag\" (after I demanded an apology) and did reimburse me for a car wash, but still? Do I really need to be called names in my own neighborhood?  The owner needs to fire the manager immediately and find someone who actually knows one or two basic rules of customer service.", "author": "David A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "I love this place. We usually order out and the food is always good and they always get the order right. Ate inside a few times and the service was good. The food is delicious. The soups are great, I love the split pea and my boyfriend gets the lentil. I tried the mozzarella basil pizza and it was very good. Usually I get the BLT though.", "author": "Dina D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-18", "description": "As I sit waiting for my replacement burger, after waiting an hour to receive the wrong order, I thought I'd share my thoughts. First of all, my apartment number which is quite clear on my receipt and my account was misprinted on the delivery person's order, so he searched 15 minutes before he realized it was the wrong apartment and phoned me. By this time, the food had a chance to get nice and COLD. Then, I opened the burger and it was not prepared according to my requests on the Seamless Web menu. I called the restaurant to ask them what could be done, and I was very curtly informed that they could send another burger, but the incorrect order would have to be returned. I laughed because the thought of eating both - well, it just amused me. It has now been 45 minutes since my call, and 1 hour and 35 minutes since my original order was placed. I'll let you know if I ever see anything. Run the other way, folks. And fast.\n\nPost-script : the food showed up after another 20 minutes. It was cold and congealed and inedible. I rest my case.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-30", "description": "Maybe it was hunger that brought my boyfriend and I to this place for brunch. We walked, and walked and we saw something Grill, nice place, small, we saw the menu and it looked \"healthy\" not that is bad to have something healthy, but we were craving eggs, bacon, home fries, definitely something fried. Anyways, we were there and hungry, our food arrived spotless, not a drop of salt. I added ketchup to my wrap to give it a little flavor. I have to say the smoothies are so refreshing and natural 100%, this was the best part.. We left satisfied, this place is good for someone on a healthy diet, zero fat, zero carbs, etc. May go again, oh! and make sure you wear a sweater if you are eating there, the place is a like a freezer inside..", "author": "Angela C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-07", "description": "I ate here once- after reading their menu that is way too big- I got a veggie burger and later I had diarrhea. Never going back!", "author": "Wanda D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-11", "description": "Worst delivery experience ever!! We ordered through seamless web and they left a bison burger out of the order. I called back and told them they left it out of the order. They girl said it was her fault and she would send another. Now our order was paid for through seamless web which means by credit card. Needless to say the forgotten burger arrives and the guy wants me to pay for it. I said no it's paid for and next thing I know some guy is harassing my doorman saying we didn't pay for our food! When we called natures grill the guy on the phone was extremely rude then when we said we paid through seamless web he couldn't even apologize for the mistake he said oh wrong address and  hung up the phone. Never again will I order from here. The food was ok but not worth the hassle.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-28", "description": "Excellent food, excellent service, great smoothies and love the rice bowls.  Definitely recommend.", "author": "Matthew G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-12", "description": "One recent Sunday afternoon, I decided to try this spot, which I've walked by many times. I sat in the practically empty restaurant waiting for a very simple order (burger and sweet potato fries) while the folks at the next table ordered, received and ate their meals. The waitress kept assuring me that the food would be right out, and then after 25 minutes asked me if it would be okay with me if I received my burger now and the fries later. At that point I got up and left. Maybe it was an uncharacteristic glitch, but I won't make the mistake of giving them a second chance. Instead, when I want a delicious, grass-fed burger I'll just walk across the street to Bareburger and be done with it.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-24", "description": "Well, seeing as I was unsuccessful in actually ordering any food here, it's hard for them to earn any stars from me.\n\nI walked in around noon on a Sunday and the place wasn't very crowded. There was only one person ahead of me ordering and so when I got up to the register, I took an extra few seconds to process their ridiculously huge menu and decide which wrap to order.\n\nThe fat lady at the register decided it was therefore a good time to catch up on some paperwork she had piled up nearby. Fine, multi-task. But this lasted for about three minute, during which time she even called over a woman I assume was the manager to ask about some of the ins and outs of the receipts and forms she had there -- all the while, refusing to look at me and basically oozing disdain for the concept of their customers. I eventually said, \"hey,\" loud enough for them both to be forced to make eye contact with me and walked out. \n\nIt's called point of sale, fat lady at the register and your manager. Look into it.", "author": "Jeffrey W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "Since my first review I have tried the basil mozzarella pizza \u0026 the sweet potato pancakes again. The pancakes were even better than the first time... honestly I don't believe they're healthy because they taste so good and satisfying! Really, they're amazing. The pizza was tasty - it's a light and thin crust, the mozzarella is pretty flavorful even though it's low fat and it was cooked perfectly. \n\nMy only issue with this place is the waiter service. While the staff is friendly, it's annoying that you need to wait for your order to be taken, then wait after your meal for the check and so forth. Since I don't live very close I don't like doing take-out but if I want a quick in-and-out meal the whole thing just takes way too long. If they allowed you to order and seat yourself it would be so much better and more efficient. \n\nUntil then though, I'll still be back for those pancakes!", "author": "Davi H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-20", "description": "Didn't appreciate the false advertising. Yelp said: \"mention yelp for a free smoothie.\" Clerk said:\" No free smoothies\"", "author": "Tom G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-23", "description": "I used to order online takeout from here fairly often.  It was my go-to for food that was decent and somewhat healthy.  I always knew the service was fairly slow - minimum wait for a wrap is 20 minutes.  Regardless, I ordered from here  the other night over the phone.  The person on the phone told me that it would be a few minutes.  I got there 25 minutes later and was told my food was not ready.  I waited in the store an additional 20 minutes and finally expressed some frustration that my order was not ready.  The employee told me I'd only put my order in 20 minutes ago, but I showed her on my phone that I had actually called my order in 45 minutes ago.   She said \"well whoever took your order didn't put it in the computer until 20 minutes ago.\"  She didn't apologize, offer us anything to smooth things over or even make any effort to expedite the order.  I understand that mistakes happen and would probably have continued to order from here  if the employee had just apologized or comped part of my meal.  Because she was rude, I'll just go to the other \"health food\" establishments in the neighborhood instead.", "author": "Abby W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-26", "description": "I might become obese from binging on this delicious health food. It's the Nature's Grill paradox!", "author": "Philip W."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}