{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-03", "description": "Terrible.\n\nI ordered sesame ginger chicken entree with rice and vegetables to go. While it was a huge portion, it was also just awful. The chicken was dry, overcooked and tasteless. There is no way this sad bird was marinated, as stated in the menu. The rice was overdone and gummy as well. \n\nI would have walked back to the restaurant to return it, but I was in meetings all day so I was stuck with it.", "author": "David M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "Great addition to court street. Ive lived here for 5 years and most places are either overpriced or serves small portions. You can eat here for under 15 dollars and walk away feeling good about yourself. The quality of food, flavors along with service deserve a 5 star. I'll definitely returning.", "author": "Steve K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-06", "description": "Was pretty disappointed with our order.  The Hangover Helper juice was okay--it tasted a lot like pomegranate.  We were not pleased with our Tropical Rush or You're Soy Strong Smoothies.  \nI had the Greek Breakfast Wrap and thought it lacked flavor.  It was mostly egg white--very little tomato, onion or feta.  I had requested that spinach be added through Seamlessweb, but I won't fault them for that omission.  My companion had the Egg Sandwich and found it similarly bland.  I was cheered slightly by the inclusion of a slice of grapefruit.  \n\nBig ups for being on Seamlessweb, though.  I may give them another go since they have so many options on the menu.", "author": "Grace W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Really some of the best food you could ask for for a catered event, especially for health conscious clients.", "author": "C. Eileen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-14", "description": "Food is decent, but after delivering to us several times, this last time I was told I was \"really far\" and then after I said \"but you were just here two weeks ago\" I was told \"maybe you can call back later and we'll see?\" Nope!", "author": "Samantha V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-31", "description": "I really like this place.   It is really healthy and delicious.  It is pretty close to the train, like a 3-4 block walk from 4/5 train at borough hall.  I got a sun dried tomato wrap which was chicken and tasty caesar salad on the inside, basically.  I even got blue corn chips on the side.  It was so filling.  My fiancee got a soup and a smoothie and was also really satisfied.  They have numerous options(most of them healthy, some not so much).  You'll never get bored.  I recommend eating half and saving the other half for later.  I walked out, but I'm not sure how I made it.  I saw people around get different things like platters with fresh guacamole and huge sandwiches.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "Love any place where I can get fresh juices! I'll have to try the food off the menu one day.", "author": "Fay A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-20", "description": "If you're looking for healthy food, well you'll definitely get it here.\n\nI happened to feel like eating healthy one night, so I ordered from here.  Big mistake -- maybe if you've eaten healthy foods all your life this might be decent, not so much for me.  That being said, portions are generous, and it seems to have all your healthy food fixings.\n\n***", "author": "Minh L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-04", "description": "I recently found out that I have food allergies. I'm allergic to wheat,yeast,corn,soy,cow's milk, and egg whites. So I've explained that to the younger staff and they are understanding patient and nice. The only person on the staff that I have a problem with is this older waitress. I didn't get her name but she's the heavyset white spanish woman. Any way, everytime me and my fiance wait to be seated. She takes forever to get to our order, by conversing with other customers that already have their orders. And when I told her about my allergies, she was not so helpful,very inconsiderate and insensitive. We also didn't have clean glasses of water. And I feel like we might not go back there until that waitress is fired or spoken to. We also think that there should be more waiters and waitresses. The tables are waisted space without them.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "Great place for healthy food. I have been ordering regularly and the food is always consistent. I love the various healthy options they off as well as their smoothies and juices. Try the natures grill salad it's always good and comes out quick. The wraps are also great.", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-12", "description": "This restaurant calls itself a health conscious kitchen but it 100% is not. I suffer from an autoimmune disease and follow a very strict diet to avoid flare ups. I asked the workers at nature's grill twice whether or not their sweet potato fries have any additives( even mentioned that I have food allergies) and received assurance twice that they were 100% sweet potato. After I ate the fries, I immediately started to feel effects of an allergic reaction. My face is red and itchy, I have an upset stomach. Only after I asked for a third time, was I told that the fries are pre-processed, come in a bag and are coated with flour. In what world is a pre-processed French fry coated in flour healthy? The manager offered a free food voucher, as If I would ever consider eating somewhere that made me sick again. I now need to go out of my way to get a refund. If you are actually health conscious avoid this place. I'm paying the consequences for eating there right now and probably will be for the next couple of days.", "author": "D C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-06", "description": "I am thoroughly disappointed with the service of this establishment.  I called on the phone to order bacon and some other items to meet the minimum for delivery.   I didn't see it offered as a side item on the menu at GrubHub.com but they said they had it.  When I get my delivery I find out that its turkey bacon and has been charred almost black on the grill.  I would have been ok with turkey bacon but it tasted disgusting from the char.  When I called to ask for a refund I'm told since it is listed on the menu as turkey bacon under other items like a BLT (not directly specified) they won't refund.  However, after a few phone calls and actually going in person they finally relented and refunded the money for the bacon.\n\nI did try the other items I'd ordered.  Orange juice was good but that's hard to mess up, however, the salad was repulsive.  It contained cucumbers that were almost rotten and mushy.\n\nI do NOT recommend this restaurant.  Their food is worse than sub par, their service abrasive, and their management shady.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Super delicious! So many choices and everything looks appetizing. I could eat here every day and never be tired of it. The shakes are another healthy alternative when I need a boost. Try one you'll be hooked too.", "author": "Jacqui K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-17", "description": "Overall, prices are high for what you get (9.25 for a veggie wrap) an impression somewhat improved by a free small smoothie. (special Yelp offer) Not an awful experience, but nothing compelling about the place. Lots of other places to try before I'd return to this one.\n\nThis place deserves customer service props because even though the server didn't know about Yelp special \"mention Yelp for free 10oz smoothie\", she did call someone, and honored it even though it was supposed to be 4-6 only.\n\nPro- they were ok with my special order, (cheese instead of hummus, tortilla instead of pita). Counter staff friendly and competent, kudos for their attempt at being green (paper carton, unbleached napkins)\n\nWeird- Why so much meat on the menu? (more meet than veggie choices, even beef), why include a slice of grapefruit as garnish?\n\nBTW: I ordered lunch 2:30pm on a weekday. Service took about 10 min.", "author": "Lane G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "Since the new year started I decided I needed to start eating healthy. I found natures grill to be exactly what I was looking for...healthy local food at a reasonable price. The service was quick and now it's my regular stop on my way home from work.", "author": "Patrea P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-07", "description": "I've only ate here twice and would have eaten here many more times (I live next door!) except every time I go here I have to get myself mentally ready to wait a while (40+ minutes) to get simple wrap, Or I have to deal with rude customer service who ignores me and I can't order because they ignore me, or I didn't bring cash (who carries cash anymore?) and they have a 10 dollar minimum on debit/credit cards and are rude about it (the brunette at the counter is usually nasty for no reason!) It is not worth it, as the food is just okay.  I am so over this place, maybe if they had better, quicker service and nicer employees i'd try it again.", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "So I finally got to stop in here this wknd after I did some shopping at Trader Joe's \u0026 I gotta say me \u0026 my family were very happy with our food and the service we received. We started off with some smoothies \u0026 fresh squeezed OJ \u0026 than selected a couple of dishes from their enormous menu(which will keep me busy) I had a glazed salmon bowl that was delicious \u0026 everyone else had wraps which they were very pleased with. I think I will def be eating here after every trip to the NYSC gym down the block", "author": "Seth W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-15", "description": "The service was great, but the menu wasn't very exciting. It's nice to get simple, seemingly healthy food at a reasonable price. The food isn't mind-blowing, but seems reliably satisfying. My juice wasn't great, probably my fault for ordering a weird combination of broccoli, beets, apples. celery, and carrots. Kinda tasted like that misting water they spray in the produce aisle after it drips off the fruits and veggies onto the floor and is squeegee'd down the drain.", "author": "Zachary G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-17", "description": "February 17th. Got there at 10:24 pm.  Front door says open till 11pm.  10+ customers were having dinner inside yet the \"gentleman\" cleaning up the tables refused to let me eat in the restaurant, even though one of the waitresses had asked me to seat in any of the tables. Oh and yes, it was 15 degrees outside. Next time will go elsewhere where they do actually welcome customers.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-16", "description": "This place is great! Where else can a person who is watching their weight go out to eat guilt free? Most restaurants worry more about food presentation, portions, and taste than they worry about how many calories and fat are in their plates. Most entrees are high in protein and low in fat and the staff is always knowledgeable about all items on the menu and are happy to help you out in making your healthy meal decisions. I love their Protein Vegetarian bowl (it has avocado and roasted peppers yummm!) and my usual large Green Popye juice.", "author": "Jennifer I."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}