{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-11", "description": "Worse place to order lunch for delivery! I ordered today, the guy doesn't tell you it will be OVER AN HOUR WAIT. So of course you call to say hey where is the food and they say the order is out delivery will be there soon. Right! \nAnd they have the WORSE SWEET POTATOE FRIES. Texture so hard makes them taste stale. \nLast time I order.", "author": "Yahira R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-17", "description": "I just ordered a smoothie with pineapple, banana, orange, almond milk \u0026 vanilla protein, but all I could taste is the vanilla protein and almond milk. I went back to tell them and the lame excuse I got was that vanilla protein usually overpowers the taste of the fruits. I make smoothies all of the time with vanilla protein and buy them from other places and NEVER had that issue.", "author": "Terry T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "Okay I have found the best thing on the menu! It is the chicken and bison combo wrap with the bbq sauce, turkey bacon and cheddar! Amazing and everyone around me had order envy. Even strangers were asking me what it is that I ordered, I should definitely get a cut of the profits from promoting this sandwich. YUM. Since I got free double meat, half a wrap was more than enough for me and I had the other half at home. I got a side of sour cream to go with it and perfection. This will definitely be in rotation!\n\nA bit pricey, but I guess since it comes out to about two meals, i am still winning!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "I'm a big fan of the Nature's Grill in Bay Ridge, and this one did not disappoint.  The taste, is very, very similar (which is a good thing).  I had the meat lover's pizza..and it was pretty good.  My friend had the chicken/ bison/ turkey bacon combo bowl and i snuck in a few bites of her food when she wasn't looking, and also very good.\n\nService was good and prices were decent.  Would definitely come back!", "author": "Joe M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Nature's Grill is one of the best health food resturants I've been to. The menu has so many options to choose from, especially if you're not a full fledge health nut but want to try something new. The Nature BLT is my go to, along with one of their delicious smoothies and some wheat grass shots, I'm good to go. Of course they have custom salads and the option to create your own. This location recently had some renovations done so it looks great inside. I recommend this place to anyone who happens to be in downtown BK by court st.", "author": "Glynn B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-17", "description": "Terrible customer service. The staff are a bunch of airheads. I even smiled at one of the delivery person when I passed by and was completely ignored. Wtf? He wasn't even cute. The food was also bland and it took forever. The counter people seemed obnoxious and gossiping about people cheating on their spouses and other animalistic nonsense. What a circus.", "author": "Felicity R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-14", "description": "Ordered the Thai lettuce wraps.  Menu said it would come in a peanut sauce but it was so bland and I tasted nothing reminiscent of peanuts.  One of the worst meals I've had.  Healthy should never mean no flavor.  Next time I'll save the money and make something myself.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-19", "description": "I placed an order for the salmon wrap! when I called the order in the guy was very rude and he  didnt know what I was talking about.. when I got the order the salmon was not good at all and was not what i was expecting. I would not be ordering from here again", "author": "Maria R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "I didn't even know there was a Nature's Grill in Brooklyn Heights until I saw a Groupon Deal. Sooooo glad I checked it out. I'm a BIG fan of their other locations, one in Bay Ridge and the other in Bensonhurst.\n\nBeen here 2x since I discovered this place and I LOVE IT! Everything is great! I love their Chipotle Sliders and the Salsa Steak Wrap! I walk into a place with a name, Nature's Grill and always manage to get the most unhealthy stuff lol\n\nAlso my favorite smoothie is the Maui Sunset, it has Strawberry, coconut milk, banana, yogurt, pineapple. Delish!\n\nStaff is attentive and friendly, and with charming decor, this place fits right in at the trendy strip in Bk Heights!", "author": "Angela G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-13", "description": "I ate here with my friend who is on the paleo diet due to some health issues. The name of the restaurant alone \"NATURE'S GRILL\" proves to be a huge misconception. I used to come to this place to eat because it was a huge leap from neighboring restaurants, however, you do not get the quality fresh, natural foods the way you think. My friend ordered sweet potato fries and called and asked beforehand if they were coated with anything, and she was assured that they were purely sweet potatoe. Naturally, when we went there, she ordered it, and again, for reassurance, asked the waiter if they were coated with anything  because she had food allergies and needed to be careful \u0026 he to claimed that it was just sweet potato. After ingesting them, she started to get flushed in her face and complained about stomach pains. It wasn't till then that she RE-ASKED the waiter what was in the fries, and he answered \"to be honest, we buy the sweet potatoes already made in a package.\" HELLO! if that doesn't scream out processed food then I don't know what does! Is this just presented better than your local McDonald's? DO NOT EAT HERE IF YOU WANT QUALITY HEALTHY FOOD. Long story short, the sweet potato fries were indeed coated with flour, and now unfortunately she will be dealing with a flare up that she was obviously trying to avoid.\n\nNOOOO STARS if it were my choice but Yelp wouldn't let me post otherwise", "author": "Erika G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "This is my go to spot. Delicious food, friendly staff, quick service. They are doing some sort of makeover that looks pretty good too. Great prices. The only issue I have had is when I do take out its a $10 minimum credit card and they usually don't budge which can be a little annoying if you are just getting a smoothie or juice.", "author": "ALLISON L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-13", "description": "One star for marketing. It's unfortunate when \"healthy\" eating equals unappetizing food! The greens in my salad were wilted, the chicken was dry. There was ginger sauce was slopped so heavily on to the chicken, it destroyed any other flavor in salad. My bf got the teriyaki rice bowl and the bison tasted like liver. And we don't like liver! I wanted to like this place, I really did.", "author": "Transistor R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-26", "description": "I have begin going to Nature's Grill for four years,but today it suck.I the order the turkey burger deluxe for lunch today which had done on several occasions  notice that food is not as enticing as it was in the beginning .They substituted items Iike ice berg lettuce which  they used Romaine in times past  l  wish they would give  patron what they order  seeming that they called their establishment organic. I felt that not I received today.", "author": "Pauline A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-24", "description": "Ate brunch here on Monday.  very nice clean restaurant.  \n\nIf you are looking for a healthy option this is the place to go.  I am not a breakfast person so I ordered the turkey burger and made it deluxe meaning it came with sweet potato fries and a pickle.  \n\nMy food was amazing.  The best at my table since everyone else got pancakes and eggs.  \n\nMake sure you ask for some bbq sauce to dip your sweet potato fries in.  Delicious!!\n\nI also ordered a small bahama mama smoothie for $4.  It was so delicious and later on when I was stuck in traffic I found myself craving the smoothie again.  Will definitely try this restaurant again.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "cool, cute and cozy spot. I love a place that I can label the 3 c's. definitely better for a quick lunch bite than a place to sit w friends. Dark walls give the place a wonderful feng shui!  I tried the split pea soup and had no complaints absolutely delish.", "author": "Adrea M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "The food here is consistent and good. Very healthy options. I've had both meat dishes and vegetarian options and they are both great. This is the perfect spot to come for a high protein, low calorie meal after a workout. Never eaten at the table service, always did take out. But it is good, standard, tasty food. I like this place very much.", "author": "Greg C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-24", "description": "Really really dislike this place. Gave it more than a fair share of visits! They don't listen, it's over priced and not good healthy food it claims to be. Got my last order wrong 3 times and had to send it back \u0026 by time I got it I wasn't hungry then! It's only good for smoothies! Disappointing that food comes out cold! And we waited nearly 30 minute before we got it. I know it takes time but surely a baked potato with sour cream and scallions with a side of medium cooked steak is not hard?? And why ask how I want it cooked when it comes out well cooked and over seasoned with Pepper! So crazy!", "author": "Emma R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "I'm a fan of Nature's Grill's restaurant, food and servers. What I'm not a fan of is their illegally imposed $15 credit card minimum. The federal law is $10. Until they amend their policy, I'll be dining elsewhere. http://www.creditcards.com/credit-card-news/credit-card-minimum-payment-purchases-law-1282.php", "author": "Kim N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-09", "description": "Came here hungry, left hungry. Definitely NOT impressed with the preparation of their dishes. I ordered the bison burger. It was ok, but I've definitely had MUCH better. My boyfriend ordered a wrap that well, lacked size. My dish came with sweet potato fries. I laughed when I saw the portion. \n\nI get that it's healthy food, which I enjoy, but it doesn't mean the portions have to be non-existent.\n\nI'll stick with Eva's or Muscle Maker Grill.", "author": "Janelle F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "So I've been here a few times since my last review. Everytime I've been more than satisfied. Despite the slow cooking times (which are made known to customers) the food has continually been worth the wait. \n\nMy last trip here I enjoyed the peanut Thai dish which is basically nice and plentiful cuts of grilled chicken, glazed in a nice Thai peanut sauce over brown rice. I made the mistake and doubled up in the carbs by choosing the sweet potato. I should have taken the asparagus option and balanced my meal. \nWish I left room for a peanutty blast smoothie.....maybe next time.", "author": "Tony C."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}