{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "I'm in love with this place. I order at least once a week.\n\nThe food is healthy, but tasty. I love the meat lovers pizza with fat free moz, buffalo, no beans and no jalapenos. I also love the grilled salmon steak, all the shakes/juices, and even the vegetarian burrito (I am morally opposed to vegetarian food but this burrito is so delicious)\n\nTakes 45-60 on seamless, but so does almost everything else around lunchtime. Just order in advance of when you'll be hungry", "author": "Emma Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-30", "description": "I'll give it a couple of stars for the smoothies and (despite some of the other reviews) the service. And I can't vouch for all that's on the menu. However, I had the steak burger and I couldn't recommend it to anyone.", "author": "Naomi B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-06", "description": "I live close by, so I was happy to see a new place serving healthy food. I can highly recommend the New Yorker Panini.\n\nI prefer this as a takeaway option than sit-down. The placement of the air-con together with all the open fridges can make it uncomfortably cold. \n\nTo avoid waiting I always order over the phone or the Internet. Imagine my reaction when I once went to pick up my online order and the server says to me \"Hold on, damn people these days are faxing their orders through, I hate ringing these up *so* much!\" ... I then kindly explained I was one of those people.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-13", "description": "I ordered online through their website. It took about 70 minutes for the food to be delivered, but as the sign in the restaurant says, \"Good food isn't fast and fast food isn't good.\" Or something.\n\nWhen the delivery guy called (my buzzer is broken so I directed them to call) he kept saying he was at my address, but he was saying the wrong number - 225 instead of 255. I kept saying \"It's 255. Two five five\" and he insisted that yes, he was outside. I was standing outside and he wasn't there. I even told him the cross streets several times. Finally, after describing a nearby landmark and him insisting that he didn't see it or me, I got him to understand that he was at the wrong address. It turned out that even though I'd typed it in correctly (I checked my confirmation email), the address was wrong on his receipt.\n\nI ordered the veggie pizza. It's more of  a semi-burnt flatbread with vegetables piled on top and smothered with cheese. It literally all slides off when you go to eat it, there is no sauce or anything, and the crust/flatbread is gummy. Pretty disappointed.", "author": "Kaitlin U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-06", "description": "I had been wanting to try this place for a while. Now that I have, I don't really plan on going back. There are other places in the area I'd like to go to first. It's too bad. I wanted to like it.\n\nThe menu is too big for anything to be really good. Food was just okay. Not bad, but definitely not great. Everything sounds good, but it turns out to be blah.\n\nI asked for a whole wheat tortilla instead of the chile, but they gave me the chile anyway. I was so hungry that I didn't realize it until I took my first bite, but since I did so I decided not to mention it. Hummus came in a plastic container as if it were to-go, but placed on a plate.\n\nAgain, it was alright. Nothing special by any means. I won't be making a special trip to come back.", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-12", "description": "Usually love the food here, service is great. However today I got a baked potato that was unwashed and still has soil and dirt attached to it. At first it was like.. um.. I don't think that's the skin. It was a small clutter so I thought they missed it and just cut that chunk off. It would of been ok if that was all because I eat here at least once a month and actually like their food. However I decided to do the smart thing and peel the whole skin since they probably didn't wash it, only to realize there was a whole patch of soil and dirt attached to the other side. I recommend you to carefully look at your food before you put it in your mouth over here at this location...", "author": "Amelia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "Healthy, cheap, quick. If this is your criteria for a meal on the go while staying a hotel in Brooklyn, I say go for it.  No frills, no surprises, but easy and pretty good.", "author": "Austin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-25", "description": "Finally I found a place I can go to for lunch any time of the week! I am originally from Los Angeles and so I love to eat HEALTHY \u0026 guilt free and it is really hard to find something in Brooklyn on this side of town. \n\nA friend of mine told me about this place and once I went, I will always go back for more. Their menu is truly huge with tons of options, and everything tastes really good... I can actually try something new each time I go and not be disappointed, versus always sticking to just one thing!\n\nThey also do catering which is awesome, because all my co-workers are health freaks like me! :)", "author": "Digital D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-23", "description": "I work around the corner from Nature's Grill and have been curious about it (2 weeks ago?). The menu is the size of an appliance instruction manual and is full of words like \"low-calorie\" and \"turkey bacon\" (ick). I however got excited by the promise of \"fresh juices\" and \"goat cheese,\" so I ventured in for lunch today.\n\nFirst off, I don't do \"health food\", I like to think that I eat tasty, whole, responsibly sourced food. I also eat whatever I want and not what someone tells me that I should in order to be healthy. I hate gimmicks. \n\nThe space was large and I think that they have casual waiter service. The staff was friendly, eager to please (and impress, I think) but somewhat on-edge. \n\nThere is a disconnect between where you order and the custom salad station. They need a list of ingredients by the cashier. \nMy salad was just okay. I asked for mixed greens and got baby spinach (which wasn't horrible). I think that trying one from their extensive salad list would be a better idea for next time. \n\nMy boss had the \"Dice It\" rice bowl and said that it was fresh (she raved about the grilled chicken) and tasty. It took a bit longer to prepare, so I'm really glad it was worth it. \n\nThe complete highlight of this lunch was my juice. They have a long-ish list of juices to choose from, but also the option of choosing your own. I got a beet, lemon, ginger combo and it was AMAZING. It was tangy, earthy, spicy, and fresh-tasting. I was impressed by the number of beets that he used and by the size of the large (only $5). In the summer I would probably want it over ice. \nThe juice alone gets 5 stars. \n\nI will definitely be going back.", "author": "Taueret M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-24", "description": "Slow service even though it's 3 PM on a Saturday and the place is half empty.\nMy lentil soup was delicious but not hot enough to my taste. After a long effort I managed to get a waiter's attention, she took my not so hot soup plate and five minutes later I got another not-so-hot soup.\nThe pizza was the kind of thing you do at home with a pita bread, a can of pasta sauce and some cheese, in short not the real thing. My wife ordered a steak sandwich which she enjoyed.", "author": "Reuben S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-23", "description": "Nature's Grill is the only place I go when I want to have healthy food that doesn't taste like cardboard. The menu is big so that just means they have something for everybody and the staff is always willing to work with you to make sure you getting exactly what you want (they're always friendly too). I've been going here for years and my favorite item will always be their salmon wrap, they create there own special mango salsa and it's always fresh and delicious. The wait is extremely reasonable for the food your getting. Like they say \"Fast food isn't great \u0026 good food isn't fast\" but Nature's Grill is worth it.", "author": "Ayana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "I love this place and was surprised to see mixed reviews. The food is of the utmost quality and everything is super duper healthy. The menu variety is great, too. Staff is friendly and there isn't too long of a wait. I eat here multiple times per week. Yes, the food is on the more expensive side but not obnoxiously so. You get what you pay for, which is exceptionally healthy AND tasty food. Great lunch/dinner spot!", "author": "Abby D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "It was my first visit at this very cozy and welcoming place. The waitress was very sweet and attentive. I ordered balsamic chicken wrap and it was delicious!!!! I would recommend this restaurant to anyone who is in that area for sure!!!!", "author": "Kristina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "This friendly neighborhood spot is perfect for those fit and others who just want a simple good meal. Open late this establishment fits the late trendy working who can't make that late meal but want to eat healthy.  Order a simple wrap with any imaginable food item for dinner or breakfast.  Try the glazed salmon bowl or tilapia bowl and like me you keep coming back.  For those P90X 1% er's the smoothies and recovery drinks are unreal!", "author": "Robert J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-26", "description": "Food is okay. I'm not really sure how \"healthy\" it is when you add all the sauce on top of it. Been coming here on off and off for at least the last 10 years or so and the thing that happened to me on my last trip will prevent me from coming back any time soon. I ordered take out (wrap and dice it) the bill was $18.20. I gave the woman $19 and while I was standing in front of her waiting for my change she took the 80 cents and put it in her tip jar. Granted I was going to give a tip, but I was highly insulted when she gave herself a tip. Maybe I'm being picky, but where I come from that's not how you act.  Not saying i'll never come back here but its going to be awhile.", "author": "Elizabeth E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "There are a lot of fantastic eating options in Carroll Gardens, so when this place (which looked like a chain) opened last year, I was doubtful, but curious.\n\nHowever, the food is great and the service friendly. I'm not a fan of eating there -- the menu has way too many options and the ambiance and design is a bit pedestrian --  so I normally get sandwiches to go. I am always surprised by the quality and consistency of the food.", "author": "John B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-24", "description": "Good food.. But... If you order food for delivery expect to wait a lonnnng time.", "author": "Francis L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "My gf and I would have to say the food is A-mazing! However, service could be better.We will keep returning though, even if waitresses seem to forget about us.  Just for the food. Oh and bring exact change so you don't have to wait a second time for change.", "author": "Cyn R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "Good, healthy food and the juices are a great value. I love that they have bison. I order delivery often, and almost always the food is hot and fast.", "author": "Damayanti B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Great protein shakes good salads excellent chicken Caesar wraps", "author": "Irvin R."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}