{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-19", "description": "Happened upon this place while I was in the area looking for a cheap, health dinner... and loved it! Big menu selection, healthy options, and reasonable prices, especially when they've got sit-down service too. Service was uber friendly and food was pretty good.... convenient, health-conscious - wish they had a place like this near my place! Will be back if I'm ever in the area!", "author": "Ann L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "LOVE this place. i come here for everything! on break from work, a quick bite before a movie and sometimes after the gym for a protein shake from that guy with the glasses he makes them sooo good!", "author": "Mason F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-31", "description": "I live in the area and it's one of the healthier options around. The food, though not served in the biggest of proportions, is very good and you can't go wrong with most of what is on their menu. What makes them really great is their smoothies. Every smoothie on their menu is delicious and well priced, and that alone keeps me coming back.", "author": "Robert A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-11", "description": "Bison burger can be pretty dope from here... the delivery time and quality can be absolute shit.", "author": "Kyle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-24", "description": "Excited for this 2nd location considering that I am regularly in this neighborhood shopping at Trader Joes. Everything is always delicious! Great addition!", "author": "Olga T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-22", "description": "I haven't been to the one in Bay Ridge, but I've been anxiously awaiting the opening of this Nature's Grill since they put the sign up months ago. The atmosphere is bright and clean, and everything looked fresh. The prices for lunch and dinner are right, especially considering the enormous portions they give you. The Thai Lettuce Wraps were good, but a little too spicy for me. The Vegetable Panini was just ok, though. They also have smoothies, make-your-own salads and a giant catering menu. Overall, I would definitely go back but do wish the place was a little more cozy or 'stay a while'-ish.", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-09", "description": "Used to love this place... now they suck... food is no longer tasty and way over priced.  Get over yourselves.", "author": "V F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-29", "description": "I don't really know what to make of this place. Went for breakfast with one other person and though the waitress was very accommodating of our rush order we still waited a considerable amount of time for her to pour us coffee. (Pre-made coffee into a tiny cup) Otherwise, my egg burrito-style dish was pretty good.", "author": "J M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-29", "description": "Food was very tasty. Generous portions. Staff extremely friendly. Price of food very reasonable.", "author": "Chuck M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "Always crowded, especially around lunch time. Love all the options for food and juices !", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-22", "description": "If you want healthy food delivered, this is a great option (actually, one of the only options for Cobble Hill, besides Wild Ginger or one of the sushi places on Smith St).  Everything is made fresh. And it's easy via Seamless web (I despise calling restaurants on the phone).  BUT -- I wouldn't recommend eating in there, as the experience is a little awkward.  The servers don't exactly wait on you (also: practically everything is garnished with stale tortilla chips and limp fruit).  Your best bet is to keep trying different items until you find your stand-bys (and accept the fact that you'll have to re-season the food yourself at home -- it's \"healthy\", remember).  My recommendation: grilled salmon with steamed vegetables, and an order of brown rice on the side.  Mix it all up and pour a bottle of soy sauce on it.  I get it delivered once a week.  Omega 3s, baby!  (The \"Oh California\" wrap is also a great choice for lunch -- grilled chicken, spinach, avocado, and tabasco)", "author": "Matt D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-02", "description": "Ordered delivery off their gigantic menu which is probably why they screwed it up..they have too many options they cant even handle it.  Ordered one of their \"bowls\" over brown rice. Food arrives 75 minutes later (they said 45 minutes over phone when I ordered), and there is a whole bunch of beans in this thing. Menu says nothing about it. I called and asked WTF, and they were shocked that beans ended up in my order. They said they'd send a new one over. This time only took 20 minutes. No brown rice at all this time. Morons.....order carefully and expect the worst", "author": "Brooklyn F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-19", "description": "SPECIAL YELP OFFER ONLY DURING CERTAIN HOURS.  I asked the two girls who were serving me about the offer and neither of them had heard about it.  Finally the one girl told me it was during certain hours only.  Which was kind of annoying because it was part of the reason I had chosen this place for breakfast.  So no smoothie for me, which was a bad way to start off.\n\nBut I tried to have an enjoyable meal anyway.  And it was mediocre at best.  The place has the atmosphere of a cafeteria and the service wasn't great.   I got the breakfast wrap and my friend got the strawberry and banana pancakes.  Both were totally bland.  I had to douse mine in ketchup to make it tasty.  Healthy does not have to mean flavorless.  \n\nWill definitely not return.", "author": "Prosper P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-01", "description": "I used a Groupon to try out the place.  I thought the food was delicious and would go back.  They also have a pretty extensive menu,  which I appreciate.", "author": "Elle W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "My Veggie Melt sandwich tasted great even if it was too big for its sawed open pita. Perhaps a bit too heavy on the giant carrots but still good. Eating there unfortunately requires pointless table service that only succeeded in wasting my time. Strangely the food came quickly but getting the wait staff's attention and waiting for the check were annoying. Next time I'll eat in the park.", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-22", "description": "Overcharged, double taxed and treated poorly.  Incompetent staff and nasty owner.", "author": "brenda K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-24", "description": "I've only ordered here once, but it was a pretty good experience. I ordered the steak sandwich, which was frankly so good I wondered if it was actually low calorie. There seemed to be a LOT of steak in it, which may negate the point of eating at a \"health food\" place to cut back on calories. Boyfriend ordered the so-called meat lovers pizza, which only allowed one meat choice. He got bison and it was ultra-bland. Delivery was pretty fast and they didn't mess anything up. I'll probably give it another go.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-18", "description": "I'm neutral on the this place. At first I was really excited to find health-conscious food in this part of town. It's not great for takeout, though--I've had to wait 30 mins on two different occasions for orders that I called in ahead of time. I'll still go to eat in, but otherwise I guess now I'll have to call in my orders an hour and a half ahead of time!", "author": "Laura L."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}