{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "Pretty solid health food. Very reliable weeknight option for fresh juices, wheatgrass shots, and a huge variety of healthy food options. I recommend their rice bowls, especially the teriyaki chicken and glazed salmon bowls. Generous portions of good proteins, veggies, and whole grains. The salads are also large and healthy but nothing too delicious. Baked sweet potato fries are another hard to find healthy favorite to get there. No frills space but an upscale diner feel with nice prompt service.", "author": "James A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-09", "description": "Nature's grill is exactly what I've been looking for in a restaurant and was never able to find. I'm usually looking for a meal that isn't deep fried, cooked in butter, or topped with cheesy or sugar sauces and that's surprisingly hard to find. Nature grill's menu is giant and has all day breakfast, sandwiches/panini's/wraps, salads, and regular entrees. Prices are very reasonable where most things are $6-9 except for the full entrees which are $9-15. As I mentioned earlier everything they sell is health conscious in some way. Low fat cheeses, grilled meats, egg whites, bison burgers, vegetables, and so on.\n \nOne of my only issues with them is that they don't list the calories for anything, something that could really help me choose the right meal. I ordered the taste of China entree ($11) which I'm sure had a lot of calories if by no other reason but the sheer volume of food I got. The dish came with strips of steak and chicken marinated in low sodium teriyaki and served over broccoli and rice. It was pretty delicious. Now I'm a pretty picky eater and there aren't many vegetables that I enjoy but I still had a hard time choosing what to order here because there were just so many great options.\n \nI ordered delivery so I have no idea about the location itself. Nature's grill is the only place I've ever ordered from that charges for delivery but it's only $1 so it's not that bad. They told me it might take up to an hour which was surprising but they showed up in half that time. I'll definitely be ordering from them again (and again).\n\n\nUPDATE:\n\nI've gone to the actual location. It's got a real polished branding which is very uncommon for a restaurant with only two locations. Its set up is sort of the cross between a corner deli and a restaurant. If you're ordering to go then you can go up to the counter and order/pick up but if you want to eat there they won't let you order at the counter. They instructed me to have a seat and when no one was coming to take my order the girl at the counter just put my order in for me anyway. Table service continued to suck and ended with me getting up after my meal and paying at the counter instead of waiting for my waitress to make an appearance. Service and set up aside the food was still great and was presented quite well. The wrap was on the smaller side but was grilled and tasty and came with some healthy chips (something they don't give you if you order delivery). I'm still a fan.\n\nUPDATE #2: \n\nWent back for breakfast. Service still kinda sucks but the food was still good. I got the sweet potato pancakes with lean turkey bacon (which just looked and tasted like smokey ham) and 3 egg whites ($9). The pancakes were very good. There wasn't a huge sweet potato flavor to it but you could definitely taste the difference between that and a normal pancake.\n\nUPDATE #3:\n\nThe pizza here is pretty gross so definitely skip that. The Thai chicken was just ok and came with bland dry rice and a sweet potato with no topping or seasoning to it whatsoever. But I'm still keeping them at 4 stars for the wraps, pancakes, and some of the other dishes as well as their approach to cooking in a more healthy way.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-30", "description": "I was walking toward Lemon Grass Grill when my feet (and hunger pangs) veered right into this spot.  I quickly scanned the menu as it was my first time here, grabbed a seat, and put my order in: Oh California--it's a grilled chicken wrap with avocado, spinach, sesame seeds and \"hot\" sauce. It definitely wasn't love at first bite.  My wrap was okay, and I expected more flavor especially with ingredients like hot sauce and avocado.  I anticipated a bit of a kick--but nada.  It was okay, but nothing special.\n\nThere's ample seating here and various menu options.  And the waitstafff is good.  So, I may be back to give this place another shot (but not anytime soon).", "author": "J M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "I am visiting from Texas and had food delivered to the Marriott. It was fabulous! I got the tuna wrap and it was delicious. My husband ordered the salmon plate-cooked to perfection! We will definitely be ordering again- if not this trip- for sure in the future", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "Good, Tasty and health meals that are worth it. Great place after a good workout and even before the workout, lol", "author": "A K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-12", "description": "Very good service...There was one main waiter tonight which was fine because there were only about 5 groups of seated customers at 9:30p on a Wednesday night. He was very nice and made sure I was absolutely satisfied with my food, even gave me a free rice pudding sample to try. It was good. Just the right amount of sweet but guilt free. For dinner I had an Asian salad and ginger dressing with the salmon. It was very good. Again, health conscious. Lastly, I'm having one of their fresh juices. They have many combinations of these freshly pressed juices so I just picked the Popeye (I cant remember but its broccoli, celery, parsley and something else) and added ginger and wheatgrass.\n\nI do wish their menu was up online.", "author": "Denise P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "Before moving, this was our go to place for delivery - especially the salmon wrap, sweet potato fries and smoothies. Now I just wish there was one in Park Slope or anything similar.", "author": "Joy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "I was here this past Saturday for the first time with my sister for lunch. I love green juice and was able to get a huge one for $6 which was very reasonable. We both got salads that were big and fresh, but the chicken was very dry. The atmosphere is was small and a bit loud but that didn't bother us seeing as we just stopped in for a quick, casual lunch!", "author": "Morgan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-30", "description": "I came here when I was craving something nutritious and full of vitamins, and settled on the salmon wrap with mango salsa, but I went for the \"wrap in a bowl\" option so it came on a bed of brown rice instead of in a wrap.  \n\nI like this idea in principle, dump all the contents on rice, but the problem is that there's iceberg lettuce in the wrap, and lettuce on warm rice is just odd.  Other than that, the salmon was well-cooked and fresh, and I'd probably go back and try something else off their substantial menu.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-01", "description": "I have been here twice now- I had the Ostrich burger here. It was very juicy and full of flavor. Tasted very good, well prepared and cook. Season well and was portion enough. Then I now tried a Smoothie which was delicious. I recommend this place for brunch or dinner.", "author": "Fabolous D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Good food for a healthy choice, i get the same thing every time.... bison burger goat cheese pizza. Staff is nice, delivery times SUCK lol\n\nThey have expanded for a reason, they know what they are doing and provide a healthier option than other fast food places", "author": "Anthony S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "Service was great, was attended to as soon as I entered, food was delicious, had the best egg sandwich I've ever tried before. And I also had the steak strips with veggies, beans and a sweet potato. DELICIOUS", "author": "Aslan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-29", "description": "Seeing Nature's Grill was like a ray of sunshine among the many fast food spots in this area, so of course i had to go in. Nice place, very clean, very big menu (could be quite overwhelming if you're very hungry) I ordered the sesame chicken wrap and asked if it could be made cold rather than hot- she said no- when i got it back to my office, to my delight- it was cold. I have returned here about 4 more times, and being the creature of habit that i am, i ordered the same wrap each time, got the same girl, asked for it to be made cold (since it was cold the first time i got it) and each time i get an odd look, and an some silly utterance such as \"i never heard that before\"  when actually she has heard it before, about 2 days prior when i came in and asked for the same exact thing. \n\nAnyway, i hope to break out of my routine and possibly try something else and hope it is as good as my usual.\n\nPS- it may not be as \"healthy\" as they claim they are...you can easily tell the difference if you have tasted food from Fuel....", "author": "Nikk A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-17", "description": "My go to spot for a healthy meal. Not too many places I can trust with my stomach.  Food is quality, it can be a little skimpy and bland at times ( you can always add a little salt) for the price. But it is what your body needs when you can't get home cooked food. I recommend the seared tuna! I order the lunch box specials often.  Irked that the free smoothie has too be the calypso one only. I like the peanutty blast! This is America!  We need variety!  In Russia they don't get choices!  You hear me management?", "author": "Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-20", "description": "Good food - had some delivery issues in the past and have avoided it overall, but before that I enjoyed the meals I had gotten.", "author": "Erich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-10", "description": "I just started working over at Metrotech and was referred to this spot from a co-worker. I would say they are more health food diner than health food restaurant given the enormity of their menu...TONS of options...but overall, I've ordered lunch from here 3x over the last 2 weeks and it has been above average. The fresh juice is just that, fresh....and way better an option than other local spots..Their burgers are good...not unreal...but a solid option (and cheaper than the other burger joint across the street).\n\nby far...the standout for me is the salad bar...there are ZERO decent options down here for a decent salad....only pizzerias with wilted lettuce and non-ripe tomatoes...they have lots of options to kind of do a different one daily.\n\nI've only gotten delivery and can't speak to the locale itself...but I'm a fan.", "author": "Joe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-12", "description": "My best friend and I had worked all day and were starving. She knew we needed to stay close to where we were and suggested Nature's Grill. We wanted something healthy, tasty and budget conscious.\n\nI thought she hit the mark on all fronts! The food was tasty, hot, fresh and the service was fast and super attentive. The salads were filling and delicious. We even stayed for coffee and dessert - the recommended carrot cake was fab!\n\nI would definitely eat here again. There's no ambience to speak of but if you're looking for a good, solid meal try this one out.", "author": "Joanna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "I've tried this place for take out. The menu is a bit overwhelming but it's nice that there are so many options. I ended up getting the Cuban as a bowl with brown rice instead of a tortilla. It was really good - fresh and very flavorful. The portions were huge. It's definitely enough for two meals.", "author": "Ann L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "Great clean flavors. Like a gym's juice bar pluss a bunch of extras! Nothing is fried and the vegies are never over cooked. It is not gormet but it is good.", "author": "vicente f."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-24", "description": "This used to be a go-to for us but the past 3 times we have been were let down's (a waiter told us that there is a new owner). They've removed some of our favorite items from the menu, the service is now mediocre and the food has not been very good at all. I wish places would ask feedback from loyal customers before making critical changes because we probably won't be back.", "author": "Rebecca K."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}