{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-27", "description": "Solely chosen for its proximity to Trader Joe's, BF and I had brunch here last Sunday.Although BF liked his sweet potato pancake with his Smuckers sugar free syrup* (a processed sugar-free syrup replete with industrial chemicals and items I need to look up on the internets), my egg white and turkey bacon - in- a -pita-sandwich  was dry, flavorless and awful.  The blue corn chips did not make me feel more sated. The smoothie I ordered was pretty good. But not good enough to merit a return visit. \n\nWhat bothered me most was that It bills itself as healthful, but in a half-assed way - see asterisked note.\n\n * Ingredients listed: WATER, SORBITOL*, CONTAINS 2% OR LESS OF: CELLULOSE GUM, SALT, NATURAL AND ARTIFICIAL FLAVOR, CARAMEL COLOR, XANTHAN GUM, SORBIC ACID AND SODIUM BENZOATE (PRESERVATIVES), ACESULFAME POTASSIUM (NON NUTRITIVE SWEETENER)*, SODIUM HEXAMETAPHOSPHATE, PHOSPHORIC ACID, SUCRALOSE (NON NUTRITIVE SWEETENER)*", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Food here is excellent! Healthy eating! Low sodium foods, for those whom have high blood pressure. Take great care of your body. Healthy foods is the best to eat!", "author": "Antoinette N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-26", "description": "I am always disappointed with the food here. It is flavorless and I feel like the fill up with the cheapest stuff but put very little of the good items. For example, on a sandwich they will put a lot of the sprouts and a tiny bit of humus and even less avocado. You still pay almost $10 for it. The staff is super nice and I will give the stars for them. I wish it was a better place cause is right by my house.", "author": "Joana F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "I always order a Peanutty Blast with almond milk and protein after a good workout.\nThis place is winning for that smoothie. One of my favorite places to stop in.", "author": "D E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Awesome spot. Fresh, healthy, tasty, filling and awesome service. First time here and it feels like home. Great place to stay, or for take out. Appropriate for a date, lunch date,   or dining solo.", "author": "Uriah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "If I could give Natures Grill (cobbile hill) 4.5 stars I would. The only thing I would say negative about the restaurant is it's fairly small and on cold winters in Brooklyn the air can be overwhelming. This is my second time coming to this eatery. \n\nThe first time was about a year ago. I ordered the veggie pizza and was very impressed. This time around I ordered the NY steak panini with sweet potato fries. What a treat after a great work out! We also had the carrot cake which is almost to die for. \n\nThe menu is very extensive and semi overwhelming but for someone picky like me, it gives me a chance to digest what it is I'm in the mood to eat. The steak was very favorable and I couldn't be more satisfied with my meal. \n\nI was a little annoyed with the frequency of coming back to ask if we were ready to order. Kinda felt like we were being rushed. After we were done eating, I introduced myself to one of the owners Chris, that was very nice. I let him know my girlfriend and I were looking to blog and research healthy food options for urban communities. He gave great ideas and suggestions. \n\nNeedless to say this particular Natures garden is my new favorite place!", "author": "Robyn L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "Honestly, their food is so bland, I don't understand why my mom likes it so much lol. One time I ordered a salmon wrap but in a bowl, I literally had to add ketchup. It was that tasteless. The wrap as an actual wrap was tasteless too. They have good service though, and I like their juices. The place is also clean, which is nice. But that's about it, sorry.", "author": "Sophie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Excellent food and service. Non-GMO restaurant with delicious food. Highly recommend!", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Nice, clean and simple place with good prices and healthy options. \n\nI've ordered from here a lot but my first time dropping by and it didn't disappoint.", "author": "Matt A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "BEST HEALTHY ORGANIC FOOD EVER!\n\nCame to Brooklyn for work for a week. Ate here every day for lunch because I didn't want to try anything else and regret not coming to natures grill! \n\nI had their salad, smoothies, lunch boxes, and panini and everything was incredible and fresh.\n\nThe lunch box was a fun and filling option. There are like 6 lunch boxes to choose from and they all come with a smooth for about 10-12 dollars.\n\nThey also have protein brownies with 24 grams of protein! \n\nStaff was awesome and helpful too.\n\nSeriously if you're in Brooklyn come here! \n\nNatures Grill if you're reading this please open a spot in Bergen County New Jersey I'll be there every day. :)", "author": "Nancy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "Great food, reasonable prices, wonderful staff.\nTheir menu is HUGE, they have it all. Big thumbs up.", "author": "Sandy P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-14", "description": "Nature's Grill is a lie. The food is just skimpy portions of dry, flavorless, frozen meat over rice or in a wrap. The only food I saw leave the kitchen that looked remotely appetizing were the juices... and really, who can get that wrong? They pose as a natural food spot, but it's just a cover for their cheapness and lack of skill in the kitchen. \n\nI recently ordered a Teriyaki Rice Bowl. Instead of the brown rice advertised it was some puffy round white rice that was dry and barely warm. There was approximately 3/4 cup of finely ground, dried out bits of vegetable and meat that had been burned in a pan without any oil or sauce. One or two bites had a hint of what might be considered a sauce, but it wasn't very sweet or teriyaki like. Their \"bison\" tasted like frozen liver and was dried out beyond any other meat dish I've ever eaten. And to top it off, it was a really overpriced dish. \n\nThe worst part, was being able to see Bare Burger out the window, across the street, and know I could have gone there for Natural food that actually tastes good, is prepared with care, and is worth the price.\n\nI'm a decent cook, and I've eaten all over brooklyn for over 20 years. My friends are foodies and chefs.  It's beyond me how a restaurant like this survives, but it's a reminder that a lot of health nuts just don't care if they are served garbage, as long as it's labelled Healthy or Natural. This place is for them! I hope they all go here, will just mean a shorter wait for the rest of us at better Natural places... like Bare Burger, right across the street. If you love being served organic shoe leather by a knuckleheaded gym body - THIS PLACE IS FOR YOU!", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-21", "description": "Good soup but veggie melt wrap had vegetables that were only warmed for the cheese to melt so were still raw. Was supposed to be roasted veggie melt. Disliked the TV blaring on FOX News also (in Brooklyn of all places!).", "author": "Suzanne K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-07", "description": "Ordered from seamless. They stole my money, didn't deliver food and didn't answer the phone or the voicemail. Avoid ordering at all costs.", "author": "Samuel O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "Best bison burger and sweet potato fries I've ever had! I love visiting here before or after my Saturday supermarket runs! \n\nFriendly staff and great customer service. Waiters always know explanations of food and smoothies and that's what makes me happy to eat there.", "author": "Vicki B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "Decent food, friendly staff, very slow kitchen, limited seating.\n no useable nutritional information. If you hunt through the website you can find basic nutritional info for types of food or ingrediens, but nothing relating to or telling you how much of those ingredients are actually in your meal, nor what goes Into the sauces, drinks, etc.\nSo it's half and half, good food, friendly faces, but they've got room to improve.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Fresh, tasty and quick service. Always walked by this place to go to Chipotle of all places lol, I will def be coming back here.", "author": "Isaiah S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-13", "description": "The absolute worst. They present themselves as a healthy neighborhood spot, however they are anything but that. They use slabs of mayo, high fructose maple syrup, and other processed ingredients. We ordered the organic salmon burger for pick up tonight and added the baked sweet potato fries. I went to pick up the order (about a 15 minute walk), and when I arrived my order was ready on the counter and the girl behind the register casually responds \"oh your food is ready but we ran out of the bread you chose and we also don't have the baked sweet potato fries.\" Seriously?! Isn't this something you could have contacted me about before I walked over? So rude. I left the food on the counter and called delivery.com for a full refund. The only reason this place is still in business is because of the prime location near atlantic/court. Do yourself a favor and try anywhere else on court.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-07", "description": "Ordering through the website (directly, not on Seamless) is not advised, unless you want it to be even less convenient than picking up in person. I ordered, got a confirmation email, and then waited .. and waited. Almost 2 hours before I called and was told the order never made it to the restaurant. They did refund my $$ at least.", "author": "Kat K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-03", "description": "Broke my tooth on the brown rice, owner said it happens often with rice and the beans. Claimed to cover cost, never did. Called department of health on them.", "author": "Ethan S."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}