{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-20", "description": "it was our first visit, and we were welcomed by an attentive waitress who provided quick service. I had a chicken quesadilla (tasty chicken breast meat, fresh tomato taste with a kick of hot sauce) and a moist half of a sweet potato. My date has a salmon burger (reported to be quite tasty) and sweet potato fries. As an apology for a minor order error, we both received a tasty dessert of rice pudding--enough to enjoy, but not enough to induce guilt.\n\nA reasonably priced, healthy, tasty alternative to standard diner fare. I'll be back", "author": "bjorn i."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-22", "description": "Love that they have purely veggie juices because I don't eat fruit on my diet!\n\nThe chicken or steak with steamed or salad veggies is pretty tasteless.\n\nThe staff is nice and fast.", "author": "Lizzi A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-08", "description": "How far is too far to ride on a bike? This health conscious kitchen thinks less than a mile is just too much for their poor delivery person to handle.  Let me know how I can be outside the delivery zone when searching for food in grub hub after giving my address for delivery only establishments.", "author": "Marie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-31", "description": "I went here for brunch with a friend today, and to be honest, I wasn't impressed. The food was average at best, the place was loud, and they messed up both of our orders.\nI ordered the meat lover's pizza with grilled chicken, jalapeno peppers, and mozzarella cheese. What I got was a tortilla with melted cheese, a tiny bit of sauce, grilled chicken, and green peppers instead of jalapenos. It tasted pretty bland.\nMy friend got an omelet and asked for mozzarella cheese on it, and he instead got mushrooms.\nThe menu had a lot of options though, and the portions were bigger than most of the meals I've had in New York.\nHowever, I wouldn't eat here again.", "author": "Nick I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-09", "description": "Pleasant setting, sweet servers. Food was fresh and healthy, although totally tasteless. I had the grilled chicken panino (panini is plural for panino, btw) which was hard to chew, dry and totally bland. The goat cheese and veggies equally bland. I hate blue corn chips. I had a smoothie out of berries which was yummy and fresh!\nI don't think I'll be back, although I do want to try the bison burger......", "author": "Tom I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-09", "description": "3.5 stars. 4 for product, 3 for prices.\n\nThis morning I decided to stop in to Nature's Grill for the first time after passing it every other day while walking in my neighborhood. \n\nI was on the prowl for a protein shake (vegetarian problems) and I noticed they had a large menu of shakes, juices and smoothies.\n\nFor $5.90, I got a delicious chocolate Lean Body low carb shake ($5.00) with peanut butter added (+.50). After filling up the large to-go cup, the lady at the counter decided that the remaining vat of shake left in the blender shouldn't go to waste, so she filled up a small to go cup and gave me both. It was a little awkward double fisting my meal shake while walking down Court, but I was so happy to have gotten my $$$'s worth. The shake was delicious and I'm afraid I've found a new go-to, albeit a tad pricey, place when I'm in need of  protein power on the go. \n\nI might stop in and try their expansive food menu, but for now, I'm happy with shaking it up here.", "author": "K I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-09", "description": "Gave this one three tries... First time, the meal was so bland. I got the salad bowl but it was mostly rice. Second time got a wrap as a \"salad\" but again, very little veggies. So I went back again for a salad bar I thought \"How can you go wrong at a salad bar?\" Bad avocado and rude employee, that's how. Won't go back again.", "author": "Christie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "Love this place. As an athlete I am always on a strict diet. Like I need to know portion sizes, what its cooked it, and seasoning. Nature Grill is great because they offer clean food that's not dirtied up by sauce or oil. Their menu is literally a chapter book. So many options from breakfast to dinner to salad. They have protein pancakes ( my fav) and BISON.  In addition to the menu, Nature Grill is large so there is never a wait to be seated. Service here is quick and prices are reasonable for what you get. Now only if they're bring this place to Bed Stuy ( *hint hint)", "author": "Simone B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "It's a little pricey but the portions are big so I usually turn one delivery order into 2-3 meals. \n\nI ge the lettuce chicken wraps and the maui smoothie. The smoothie is AMAZINGGGGG. Delivery is FAST (but I live close)- it's never taken them more than 15 minutes from delivery to my door.", "author": "Kathleen R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-08", "description": "Don't waste your time or money!  First off, the staff hasn't a clue.  Almost EVERYONE you speak to on the phone calls themselves the 'manager' yet they don't even know their own menu!!!!  Seems when one person cannot assist you, they put another worker on the phone; that person says \"I'm the boss\".  When that person cannot assist you, you're then given the 'boss' of the 'boss'.  Please!  Instead of being apologetic when they mess up your order, they catch an attitude!\nThen the food!  How can you get baking a sweet potato wrong....how intricate could the recipe be!  It was burnt and half of it was rotted!  Steer clear of the grilled chicken.....can you say DRY!  Couldn't swallow it!  And the menu says to add so much money for 'double' the chicken, beef, etc.....well, double 8 oz I say should be 16 oz!  It's not!  And when I questioned this I got attitude and a ridiculous response!\n\nTootles to Nature's Grill.", "author": "Brooklynne J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-19", "description": "I like this place, despite the wait!!! \n\n...I stop doing yoga for three weeks and feel awful... So I thought it was finally time to check out the healthy place next to Trader Joe's on Court--- Nature's Grill... \n\nThe Menu is a 15 page booklet, so many choices... too many if you ask me but I guess I won't have to order the same thing twice! \n\nWhat to do, what to do??? Of course like the miss gluttony that I am I wanted to get something big. I didn't have lunch and if a cow stood in front of me I would eat it... So I picked (Jumbo Steak Burger (Cow) - cooked medium) I asked the guy over the counter if the steak burger was really jumbo and if it was too big for me and the other guy started to laugh... oh brother! Get your mind out the gutter!!! We all laughed and I order it anyways! \n\nGetting my order took FOREVER! I wanted to kill myself--- Everyone else was waiting a long time too--- It was getting boring at this point, so everyone started talking to everyone... The folks to my right talked about how I looked like Natalia Woods (oh brother) Can any type of wood float? lol ---old joke .... and the folks to my left were trainers who go there everyday to get their high protein on... So of course I took the opportunity to ask them how to get rid of my problem areas.... lol Knowledge while you wait! \n\nFinally I got to savor my healthy burger! IT WAS SO WORTH THE WAIT!! I Love it!! \n\nGood (Wait) Healthy Eats! lol", "author": "Maritza S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "I've been here a few times and have always enjoyed the experience. I recall having a steak burger here, which was huge, filling, and done just right to my taste. I would also have sweet potato fries, which orders were also OK. Service's friendly and not intrusive. The place looks clean, tidy, well lighted and spacious. And I recall having ordered food for delivery, which process was easy (somebody answered the phone, although there's a recording we heard before someone's actual voice came thru so we could place our order) also came right on time. I'm glad they accept credit card payments.", "author": "Jerome Espinosa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "I've been coming here a lot in recent years since it's right next to Trader Joes and near the\nB-57 and B-61 bus which I use frequently. It's a very clean restaurant with clean bathrooms\nand a nice patient staff. Some of the wait staff has been there a long time which is always a good sign in a restaurant. The water glass is filled frequently and you almost never have to\nask for a water refill.\n  I am huge fan of their 8 oz. bison burger which is one of the great bison burgers in NYC. It's much healthier than a regular burger with far less fat. but still has that satisfying beef taste. The price on this bison burger as well as their other burgers is very fair. I have been unhappy with the specialized burger places on Court Street ie Bare Burger and Moo Burger given their\nskimpy 5 to 6 oz burger portions and high prices. \n  Another cool thing about the burgers here is that you can get French BAKED sweet potato fries on any of the burger deluxes.You can also get a very big\nwhole sweet potato on the burger deluxes. Moo\u0026Bare Burger don't have baked sweet potato nor BAKED fries.\n  I'm also a fan of the salmon teriyaki on rice bowl which is very filling.  The standard portion is very filling.I once got the double portion in the salmon teriyaki bowl of \nsalmon and that was incredibly filling. i like the teriyaki sauce because it's a light sauce\nnowhere as heavy as tradtional Japanese teriyaki sauces.\n  Oh I forgot, another great thing at Natures Grill iis they have non corn syrup Ketchup for the burgers.\nAlmost no restaurants in NYC are carrying Ketchup with no high fructose corn syrup.\n  I enjoy the fresh juices. The fruit is fresh and good. The price point is fair.\n  I like the atmosphere. They don't play the music super loud. The 2 TV sets are there if\nyou want to look at them. The  Free WiFi is super fast. There are\nno crashing of plates nor people yelling. They don't rush you out. They've got low and high\ntables to sit at. The chairs are comfortable. The floors are not slippery in wet or snowy weather.\n  I'm so happy that a health food restaurant opened finally on Court Street. It's long overdue.\nCome here for clean, nice,flavorful, non greasy, non bland food. Lastly when I walk out, I don't have that aftertaste ever, of too much salt or MSG. The food always agrees with me. \n  My one request, as someone who avoids Dairy. is for them to carry in the summertime,\nSoy French Soft Custard Ice Cream in different flavors. There used to be one Japanese desert place On West.47 and\nNinth ave that had French Soy Soft Custard Ice Cream. It would be great to have that in Brooklyn since there\nare so many Vegans and Vegetarians in all of South Brooklyn who avoid dairy. I'm obviously not a Vegan nor Vegetarian but I avoid dairy. I enjoy eating vegan and vegetarian food also.\n  Enjoy the food. It's a nice place with no attitude. I'm happy to support them. I've stopped going to the Court Street Burger Restaurants now that I have my Nature's Grill Bison Burger.\n  Please note they carry many exotic burgers but they do not have regular hamburgers. Frankly the Bison Burger is so good here and so satisfying that I'm not sure why you would want a skimpy regular burger at the overpriced Moo Burger and Bare Burger.", "author": "Jack H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "They revamped their atmosphere and they vibe inside is great. The food is usually hit and miss. However, since the renovation I haven't been disappointed yet. As a vegetarian I can always count on them for a healthy protein packed meal.", "author": "Mallory A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-20", "description": "Nature's Grill on court street is that rarest of good places that offers the option if truly healthful eating! A rarity even in this day of the health conscious and fad diets.\n\nThat said, the menu options are enormous and Everyrhing is prepared fresh to order! Which makes for an overworked kitchen staff, there are one to two depending on the day, then a shake person, and finally a register clerk. Which in turn makes it very easy for them to get backed up. \n\nOn the plus side, I've RARELY if ever known them to get an order wrong! Either if I was eating it there or getting take a way for a major win! \n\nOn the down side, call well ahead during busy times and at least 15-20 minutes ahead during not so busy times. Because...it's going to be a while!", "author": "Keith J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-24", "description": "Usually everything is amazing. This time everything was odd and crappy. From service to juices and under seasoned food. Shame.", "author": "Liron H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "This is my go-to place when I'm downtown Brooklyn and I have the craving for something clean, fresh, and healthy. I love that I can have a freshly made drink with different fruits and veggies with my meal. Makes everything taste 10x better.  I had no idea that I would enjoy beet in a damn drink! Now I love it.\n\nAll their wraps are on point.  That chicken caesar sald wrap is #1. Cut the fried crap and hit up NG!", "author": "Tristan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "This restaurant reminds me of place in Queens called \"Juice for life\". This place serves healthy food which is great especially in this area. However, unlike Juice for Life, Nature's Grill doesn't list the amount of calories in its entrees.  That would be helpful for weight conscious patrons and I know they are many.  Some of the meals such as the rice bowls are healthy but huge so I kinda would like to get a feel of how many calories are in the bowls as well as other items such as muffins, brownies, shakes, etc. \n\nI must add that the staff is very friendly! The ambiance is nice especially in the warm months. \n\nOne setback is that the menu is too large.  It's kinda all over the place making it very difficult to order.  If Gordon Ramsey (Kitchen Nightmares) saw the menu, he'd have a heart attack! Please remove the El Mexicano wrap from the menu.  I disliked the El Mexicano wrap. The meat was tough and should be either cut into smaller pieces or consider using ground beef.  It tasted like it was trying to compete with Chipotle but fell short.\n\nI do like the lunch specials like the fish of the day and the Bella chicken and dice it up bowls. I enjoy the smoothies ( I add my own sweetener to them) and muffins are incredibly fresh and tasty.", "author": "Autumn C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-08", "description": "TERRIBLE. DON'T WASTE YOUR MONEY.\n\nThis rating is based on the dreadful, bland food my friends and I ate (and all cumulatively hated) AND the waitress that actually complained about how tasteless and bland the food is there.  Can you believe it?  She was actually telling paying customers that the food is gross there while taking our order.  Not once.  Not twice.  But 4x!  After asking her about different entrees she rolled her eyes to all of them and said that because of the \"healthy\" nature of Nature's Grill they don't use salt and pepper or butter so everything tastes like ...... OLD FOLKS FOOD.  She literally said that.\n\nWell, I complained to the manager about the waitress and that our food was absolutely gross and he saw none of us ate more than two bites.  We got up and left without paying.  The first time in my whole life I've ever done this and I didn't even feel bad about it.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-30", "description": "Warning warning do not eat here. \n\nI have eaten here twice,  and had problems both times. \nUnfortunately my coworkers frequent this establishment,  and I was forced to go the second time. \nThe first incident was about 6 months ago,  I ordered Tuna steak and vegetables,  it looked a little off and smelled fishy,  I though it was the seasoning.  That night I had terrible stomach pain and diarrhea,  it lasted 2 days.  \nNext was a couple of months ago I ate the breakfast sweet potato pancakes while I was eating them there was a huge plastic wrapper cooked into the center of the pancake.  I told the waitress and asked to speak to a manager they took down my cell number to have the manager call me and they never called to apologize, or see if I was alright.  it's been 2 months I gave them a fair chance to redeem themselves and they failed. \nBeware all,  you will get sick,  do not eat here.", "author": "Derek S."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}