{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "The food is very bland, mediocre at best.  I give it two stars instead of one because the bowls are fairly edible.  Guam and chips are flavorless.  Sweet potato fries tasted like they were fried in rancid oil.", "author": "Kim D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-08", "description": "10:28 pm.. it's closed.  Door says 11pm hours on here says 11. Make sure you don't come after 10 I guess", "author": "Jesse A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "Great spot for sandwiches, smoothies, juices, etc. Great variety and options for everyone, and good service as well.", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Absolutely loved my first experience here today!!!!! Tried the Guadalajara Salad!!! Best salad by far!!! Perfect for my plant based transition. My new go to for healthy and happy food!!! A friend mentioned this place a couple of months back and I kept in the back of my mind. Glad I followed the impulse today!!! \nA definite wholehearted recommendation!!!!", "author": "Mikali H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "Superb menu, large selection, nice space, fast delivery, great shakes.  Nice staff. Restaurant experience is not warm and fuzzy but service fast and professional. Underrated place.", "author": "chris H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-31", "description": "I came here with 2 other people (I suggested it because it's supposed to have more healthy options than bare burger and chipotle) yesterday at around 3pm. \n\nWe were seated and given their incredibly long / crowded menu. The waiter came to us about 4 times in the span of about 15 minutes while we were clearly still deciding to ask us if we were ready. My friend said the first time he asked and we said we were still deciding he rolled his eyes and sighed.\n\nLater my sister and her 3 small kids joined us, just as we were served our food, and another waiter started taking care of us. This was unplanned. When we got the check gratuity was already included (not suggested - but included). He also did not bring us back our change but assumed he was meant to keep it. \n\nThe food, which I think is the most important part of a restaurant, was a miss for nearly everyone at the table.\n\nI got the balsamic salmon salad - which came with sprouts, 4 cucumbers, 4 cherry tomatoes, and lettuce with the dressing on the side. While I was happy they didn't add my dressing without me specifying them put it on the side, the dish was pretty plain.\n\nMy mom got the hawaiian hula? wrap, which came with a side of chips (see pics). She said it was dry and boring and was only able to eat it by adding my dressing to her wrap.\n\nMy friend got a salad and said it was just okay. My sister got her sons the tuna sandwich (her son hated it and she tried some and said the tuna was not tasty at all.) She got her other son the pizza which was just a flatbread (not a dough) with lots of cheese. Of course anything smothered with cheese would taste somewhat okay but it was definitely overpriced and pretty plain).\n\nShe got her youngest and herself a side of sweet potato fries - half of the fries were left over when they were finished because it just wasn't that great. \n\nYeah, I'm really surprised this place is still holding up with the attitude of the server, lousy decor and even lousier food. I'll never eat here again or recommend anyone. I'd rathe go to lemongrass down the block for healthier and tastier fare.", "author": "Camille H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-21", "description": "After hearing about this place for quite some time from friends of mine in the area, I decided to pay them a visit after the gym on Saturday evening. I had some likes and some dislikes.....so here it goes\n\nPro's\nNature Grill is predicated on a healthy conscious kitchen and have a large menu full of healthy food options, shakes, fresh juices, etc...\nThe brown rice and spinach were cooked well\nYou can place your order online and pick it up or they deliver.\nThey have protein shakes and several options. The two women at the counter are friendly and welcoming.\n\nCon's\nHow can a place that is health conscious not have the nutritional information on the menu, or even on the website?. They offer a generic nutritional statement, but I could have found that elsewhere or on my fitness app.\nOne of the male workers had a horrible attitude when I made an inquiry about something on the menu and passed me off the the lady at the front counter.\nThey are a bit expensive. A protein shake was $5 with an additional .75 per additive (banana, strawberry or peanut butter). I ordered Grilled Tilapia with brown rice and spinach and that was $17.\nThe Grilled Tilapia was not seasoned well and didnt have much flavor to it at all.\nTook approx 15-20 minutes of waiting time\n\nAll and all, its a wonderful alternative for a healthy food option, but the customer service could use an energy boost. I went to the Bay Ridge location the following day and they were much more welcoming, but the location is not as large as this location.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "I have been a customer at this Nature's Grill for a few years and I have always had great experiences and everything I've ever order from the menu has been fresh and delicious.   I'm low-carb/keto and there are so many tasty options on the menu.  They also have low-carb wraps for people who do low-carb \"breads\"\n\nThe grilled veggie wrap is a favorite among my friends.\n\nThe bison burgers are top notch and the steamed veggies with the garlic dressing are SO good.\n\nToday, I ordered in to work, which I never do and the delivery came in wrong.  I called and they were amazing about correcting the problem.  A+ for customer service.\n\nIf you're in for a treat try the sugar-free cheesecake which is one of the best I've ever had (and I've tried as many as I can get my hands on!)", "author": "Abigail M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-09", "description": "Never will come or recommend anyone to this establishment ever again. Racist, unprofessional, disgusting customer service. I ordered my food (as I do all the time) \u0026 an hour later, I receive a phone call saying they feel my neighborhood is \"unsafe\" to deliver to, so they will not be able to process my order. After I already waited an hour. I have been coming here for a while \u0026 recommended many others. Never again will they receive my business, or anyone I know, as long as I have a say in it. Completely turned off by this. Please do not eat here! This is NOT how you treat anyone, especially loyal customers. Not to mention the food is mediocre so you truly have the audacity! Get it together, Your business will fail!", "author": "Kimberly A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "I was starved and searching for breakfast. Bored with my traditional spot, I decided to revisit Nature's Grill to satisfy my curiosity. What would be deemed a healthy breakfast? To my surprise, I noticed they offered sweet potato pancakes ($11) which was southern style golden sweet potato pancakes, grilled and served with 3 egg whites and lean turkey bacon. It was accompanied with sugar free Smuckers' maple syrup. I loved it! It was a dish I had never heard of or tried, but definitely delighted. Who knew I could have pancakes after a workout and not feel guilty? \n\nGreat service. Very attentive wait staff. I figured I've been here twice so why not join the rewards program. Move over Subway, I think I've found my new spot for healthy eats.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-02", "description": "I love the healthy food selection here, and it's pretty good. It's right next to my gym so very convenient for to-go lunch. Unfortunately, it's too expensive for me to be a regular. I would be a regular if my lunch box order were around $10 instead of $15 and up. Maybe they should offer a student discount for people like me!", "author": "Jessica F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-29", "description": "Before I went to go see Dope (which is awesome) I decided to bypass expensive unhealthy theater food and try for some real food!\n\nI decided on Nature's Grill because it was healthy and it had a nice seating area. The first women I spoke to behind the counter was great, very friendly and informative. ( I saw several different menus and wasn't sure which ones were active) She also directed me as to where I should order, because I started at the wrong end of the line.\n\n+1 star\n\nWhen it was my turn in line I ordered the multi-grain pancakes with strawberries and bananas. I asked the guy behind the register if there were any sides that came with Breakfast as I didn't see any on the menu. He snarled \"Yea extra, you pay extra\" I told him that was not a problem and if I could have eggs and fries. In which he responded \"no eggs , only sweet potatoes fries\"    \n\nI sighed and looked at the menu again. Another server (who was also gorgeous by the way...) came up and told the man behind the register that they DID do sides of eggs and showed him how to enter it into the computer.\n\nI felt happy and again this man was gorgeous so +1 Star\n\nI sat down at a table and waited for my food. about 15 minutes later, my food is setting on the counter in a bag. I was really confused because I did not order my food to go. I informed the new women behind the register that was my food, but I intended on eating inside the restaurant. She just looked at me with a blank stare and handed me my food\n\n-1 Star\n\nOnce I got my food and sat down I was upset because now I had all these take out containers to deal with, and even though I indicated I planned to stay no one came to assist me. I had to find someone to get silverware, then again for water.\n\n-1 Star\n\nAs I sat there angrily eating my pancakes ( which were okay, kinda dry and I need more syrup but I didn't feel like chasing anyone else) I noticed then when every new customer came in they were greeted with \" Hi, how many at you table?\"  I started to understand why my food was placed in to - go containers now, however no one greeted me at the door and ask me if I want a table, so I assumed it was all self service.   \n\n-1 Star\n\nBased on service alone I may not ever come back to this place", "author": "Wanda W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-07", "description": "Honestly this place is very mediocre. The food is bland and boring and is very overpriced for what it is. I really did wanna love this place since I'm all about eating real, clean, healthy food. On the first visit we tried the chicken salad, chicken panini and bison burger; the salad was good but the rest of the dishes were plain; we wanted to order the fries but they were out for the night unfortunately. \nI decided to give this place another chance and went in with high hopes; this time trying the salmon wrap and a panini. And we lucked out with the sweet potato fries which were really good, crunchy on the outside and baked! But the food still fell short taste wise. \nI have to say that the service is amazing though and the sweet potato fries are good.\nWould not spend money here again.", "author": "Deemy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Was a great experience!! The food was delicious,fresh and the portions were more than enough. There was no delays on the extra orders. The staff is amazing!!!!!!! They're friendly, patient and  polite even though the restaurant was busy. \nI really recommend it 100%...", "author": "Kathrin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "The menu is overwhelming so I try to keep it simple.\nI love their juices, $4 for a small but when they make them it is SO LOUD in there.\nI usually have the same server and she is sweet and friendly.\nI highly recommend the pesto chicken in a salad. It is so flavorful. This is the kind of healthy eating that is actually satisfying. You can get almost anything (really ALMOST ANYTHING) in your salad.\nGreat spot for after the gym.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "3.5/5 \n\nThis place is my go-to dinner place after working out at Blink one block away. Healthy and delicious, their food is always consistent.\n\n.5 off because they are constantly out of sweet potato fries, which is not necessarily their fault but I'm just not a huge fan of their baked sweet potatoes. Sometimes it feels like the potatoes have been out for a while and are slightly discolored on top. Another .5 off because they are more expensive only Delivery.com than when you order in store (they charge the price after tax in store, online). Another .5 off because every time I order my sandwiches/wraps/burger as a \"deluxe\" they have never given me the pickle that is included in the deluxe upgrade. \n\nDespite these flaws, I'd round up to 4 stars rather than round down to 3 because the food good and fresh, delivery is relatively punctual and the service is great. Also, the cost (in-store) isn't bad. You know if I'm willing to pay that extra price on delivery, the food is good. I will continue to order/pickup from here!", "author": "Maria J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "First time we ordered from this place yesterday and have them delivered to work. 4 different burgers all with about $2 difference in prices ($10-12+). One of them was veggie burger. Got to us and none of them were labeled especially at least the veggie burger for our vegetarian co-worker. I called to ask for help to identify which is which since it's not labeled. The woman answered with an attitude on her tone: oh we don't label! Hold on!   Puts me on hold forever that I had to attend to my patient so I asked front desk to wait.  Finally the woman on the other line returns still with an attitude: you're just gonna have to open each burger and see for yourself.  Front desk nicely responding: we have no choice but to do that but just so you know it's not nice and hygienic to be holding and checking others people food. \nAttitude girl: well why didn't you request for it to be labeled?!?! Next time ask for your food to be labeled and hangs up.   There's never gonna be next time. Besides , all 4 burgers looked the same. The non-vegetarian burgers looked and tasted the same even with the $2 difference. One was suppose to have caramelized onion in it but instead it had regular uncooked onions just like the rest!! Costumers suppose to be always right.", "author": "Mich R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "By far this is my favorite place to grab a delicious healthy meal . The staff is absolutely excellent ! They work hard , very respectful , extremely neat , great presentation , healthy food , and never disappoint . \nThe owner is super cool and they love there costumers . Anyone ever in this neighborhood , you should stop by .", "author": "Luis V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-15", "description": "All you have to do is look at the picture that I just posted. A salad with two slices of totally rotten avocado on top. Who decided to place these slices of avocado on the salad - they clearly didn't give a F.  Totally unacceptable.", "author": "Paul B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-09", "description": "Nature's Grill\nNY: Brooklyn: Cobble Hill\n1pm Thursday 27th February 2014\nThree Stars\n\nThis place is hippie-dippie health juice bar and café. I had the Elk Burger ($11 MP).  The toasted brioche bun was good but you have to put on your own mayo and mustard.  The patty was packed way too tight making it tough to chew through, plus I was not impressed by the herb/spice blend in the meat.  The Pico De Gallo was questionable choice on a burger because it all falls out while you eat it.  I then tried to add Cholula to my burger but it was Frank's Red Hot inside the Cholula bottle (Weird).  The upgrade to tempura style Sweet Potato is a must.  The pickle was gross because of the excess of amount salt used in their brine. Nothing was particular good.  I think I will stick to Bare Burger across the street.", "author": "Leonard L."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}