{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "Took my girl to Barta bak on smith street then got real hungry . Bartender suggested Nature's Grill on court st. We walked about 6 blocks to court and pacific. Saw a bright and clean open space, kind of quiet but we decided to go in. It was about 1030 pm and I guess they were closing but busboy was nice enough to clean a table and set us up in front. The ordering process was kind of quick as the waitress u guess was ready to go home...I ordered the Jimmy steak wrap and my girl ordered a smoothie. We wanted a juice but machine was closed or GETTING cleaned???@$! Regardless, food was great and we decided to visit again in day time. Our next visit was good, a bit crowded but good. Took us a little over an hour, in and out.... I suggest you order for pick up if u ina rush bit overall great stuff...", "author": "Maria K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-26", "description": "Love the food options here. I'm all about healthy food and fruit shakes so I was pretty excited when this place opened. However I'm not crazy about the space. It really takes away from the whole dine-in experience. While there is waiter service it feels more like one of the lunch places you go to in midtown where you can make your own salad and be in and out in five minutes. Will I come back here again? Absolutely. Would this place be top of mind when trying to find a good spot for dinner with friends? Unlikely.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "Great Salmon Salad, wonderful. Refreshing healthy food. A constant in the lunch rotation.", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-31", "description": "I really WANTED to like this place.  They're obviously healthy and affordable.\n\nThey have a sign at the front of the main counter that warns their service is slow because \"good food is not fast and fast food is not good\".  Unfortunately, their food WASNT' good.  I ordered the salmon wrap and a smoothie. The salmon was burned on the bottom and dry in the middle, and the mango salsa on the wrap was almost non-existant.  My boyfriend ordered the grilled turkey sandwich, and the toast was burnt.  Both dishes were extremely bland.\n\nThe seating arrangement is also awkward. They have a bunch of tables that are set up against the wall - with booth-like seating against the wall, and chairs on the opposite side.  The booth-seating is way to low for the tables. The table came up to my chest when I sat down there.\n\nNot comin back.", "author": "Gina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "I am a big fan of healthy food!!! My mom and son are not... but they love this place!!! I took my mom who adds salt to everything and is a picky eater and she loved it.  I was surprised that she did NOT add salt and actually ate her whole meal.  This is a weekly visit for me.  My son loves their protein smoothies.  Great spot to go to especially if health conscious!  A bit of a wait but that's because the food is made at the time you order.\n\nI definitely recommend a visit here!", "author": "Vilma T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-20", "description": "I wish we had a Nature's Grill in Los Angeles. It's a little on the pricey side, but I love the make your own salads. So many fresh toppings to choose from! Go with a small size salad - I can't imagine being able to get through a large - seems wasteful. I would absolutely come here for lunch again.", "author": "Katie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "Fantastic . Can't say anything bad about this place. Had the Bison Burger and it was everything I expected and more, complimented nicely with amazing sweet potato fries. The service was delightful and fast.\n\nWould definitely recommend it/come back.", "author": "J. B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Good spot. Fast juice counter, Mad friendly staff.", "author": "Frank L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "The burgers here are phenomenal. Love being able to choose different meat options you can't get everywhere. Everything is made really fresh. Service is always super slow but you get what you wait for, everything tastes great! Their bison burger is my favorite.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-13", "description": "Liked the healthy menu options, but the food was ok. Chicken was overcooked and lacked some flavoring.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "So I read lots of reviews first and gave it a shot\n\n-Yes the wait for the food (with no one there) seems larger then most..\n-Good things take time..\n\nThe food was great and not overpriced..Staff was nice and not to bad as most say.", "author": "Scott M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-22", "description": "Food is good, albeit a little pricey. It was one of the better bison burgers I've had from a delivery place, and the side order of grilled chicken was solid as well. My fiance had vegetables with fat-free mozzarella and seemed to enjoy it quite a bit. This would be a 5-star, if not for one small issue. I ordered a diet 7-up, and they sent a regular Sprite. I'm fine with the brand switch, but I'm on a low-carb diet and a 120 calorie can of soda with a boatload of sugar doesn't work. It's sitting in the fridge, and I may drink it someday (I don't like wasting money and it was $1.50). I could overlook it, but I ordered lunch from a similar \"healthy\" place in Manhattan that day, with a diet orange soda, and got a regular, full calorie sugarbomb.", "author": "Lee R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "Friendly, fast, and fresh.  Really, what more can you ask for?  I ordered the Veggie pizza and it was delicious!  I wasn't expecting it to be so good, especially when ordering \"healthy\".  I highly recommend this place, especially for delivery.", "author": "Melanie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-29", "description": "We've had their encyclopedia of a menu sitting in the kitchen for a few weeks and decided tonite was the night to try it. We ordered a few salads. One of us is happy \u0026 still eating and the other is writing this review. My salad wasn't terrible, just not thought out as the wife's was.\n\nA word of advice from a man that has a history with pasta - avoid the Dijon pasta salad like the plague. It's sweet. Dijon is not naturally sweet. So, I question the title \u0026 the taste. \n\nThey also charge you an extra $1 on take-out to support their green initiative. Not sure how I feel about that. \n\nI do know how I feel about their exclusion of cheese on the menu - I hate it. I'd rather have the option of full-fat cheese, then flavorless, non-fat mozzarella built on fillers. Dairy issues aside, it's good to have a place like this in the neighborhood \u0026 hopefully I'll pick a better dinner next time.", "author": "mike l."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-06", "description": "Ok.  I'll write this review in points.\n\n1. The food is mediocre in taste, but relatively healthy, which is why my colleagues on my current project and I (800 plus of us, from the #1 big 4 firm head quartered here in NY (Yes, Nature's Grill is very stupid for not trying harder to accommodate us)) order from here often in large quantities.\n2. Customer service is non-existent.  The manager has the worse attitude possible, and cares nothing about his customers, small or great.\n3.  The delivery guys are rude and unprofessional.  One even dropped our order and we had to wait forever to get it replaced.  No compensation was given for THEIR mistake either.\n4. This is not the place to order from if you're in a rush.  They never deliver in less than an hour and rarely get it right.\n5. If there's a problem with your order, don't expect them to correct it, because they won't.\n6. If they make a mistake or never place your order, they won't give you a refund and will not compensate you otherwise.  They'll just rip you off and keep going on like nothing ever happened.  Repeat business isn't important to them.\n\nSynopsis: If you're looking for healthy fair, but don't care about taste, service, timeliness, etc., this is the place for you.  Oherwise, my advice would be to skip it.  We certainly will be from now on.", "author": "Treva B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-09", "description": "My roommate LOVES this place.\n\nIt has a good / diverse menu for people like me who are not used to eating \"healthy\".  There Bison \"Burger / Sandwich\" is solid.  I was impressed by there Caesar Salad and the dried tomatoes.\n\nOverall a good place with a good menu.\n\nUnderground Business:  You have to walk through the Food prep area and the area where the help takes breaks.  A quick trip there is comfortable; however, I would not make a long deposit because of the proximity of the help.", "author": "Carlos S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-28", "description": "The best and healthiest food in Brooklyn. Excellent locations, pleasant and helpful service. I eat at one of their 3 spots several times a week! I always order the teriyaki salmon rice bowl with vegetables and the maui sunset juice.", "author": "Nicholas D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-27", "description": "I ordered from here for delivery - i got given the wrong kind of cake - but the cake they gave me had mold on it - i am beyond disgusted! when i called to complain they did not care that they give out the wrong food - and food in terrible quality.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-30", "description": "The takeout here is so slow I wanted to gauge my eyes out. Seriously. I waited twenty minutes by the register for a salad that should have taken 3 mins to spin together. \n\nThe salad was good - I got the Hawaiin chicken salad. Fresh, good ingredients. However, it lacked in the stuff that made it special, e.g. the fruit, avocado, etc. It did have plenty of protein though. I also enjoyed whatever citrus sauce they put on it. They also however, did not spin the salad at all - it remained separate compontents. This irked me a bit too.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-30", "description": "This place is yummy and fresh and totally my kind of place. Their menu is quite extensive, so lots of choices- most of them healthy. I got a pita that was delicious. We also got blue corn tortilla chips with guacamole to start. The guac was obviously fresh and thus yummy. \n\nBrooklynites, stop on in at Nature's Grill after your Hatha yoga class and before you use your recycled shopping bags at Trader Joe's down the street. Yeah, it's that kind of place. In a good way. :-)", "author": "Rebecca D."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}