{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "I usually get the Teryaki Rice bowl fills me up and I'm good to go. Great selection of smoothies and protein shakes.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-09", "description": "Had the salmon burger and it was pretty good. My friends dish was decent as well so the food seems to be on par with decent to good quality.  There are also lots of tables and it's a pretty big space so it's a good place to stay and eat.\n\nBut the service.. well that's just  terrible. I literally waited at the counter for 10 mins while the cashier and the owner were having a discussion over receipts. They both saw me. Turned back, and continued speaking to one another about an issue that I'm SURE could have tentatively been put on hold. This doesnt sit well with me..at all.", "author": "Liz P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "omg... so we walked around for hours, looking for a healthy juice place and finally came upon this place.  Heaven!!!  They have vegetables juices and healthy shakes and all the food is super clean but tasty.  Loved it!", "author": "Aneta S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Huge fan of their hummus and smoothies! My husband and I also love the salmon panini! Definitely recommend !", "author": "Elaine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "MY ALL TIME FAVORITE PLACE FOR HORMONE/ANTIBIOTIC FREE BISON BURGERS.  If you never had one, you MUST go here. \n\nThe baked sweet potato fries are delicious.  Great, diversified menu, wonderful staff.  You're in for a treat.  You'll soon become a regular.", "author": "Natasha S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-20", "description": "The one in Bay Ridge is so much better. My co-workers and I gave this spot a few chances upon ordering lunch and each time was a miss. Something is either always missing in the delivery, including a whole meal ordered, or it comes late, cold, and wraps can be soggy. Maybe it's better to just go in there in person but ordering sucks.", "author": "Miguelito J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Really love this eclectic spot in the heart of Brooklyn.  Everything is done with a touch of class and refinement.  The ambience is really great and the food choices are the best.  Caters to diners who appreciate healthy food.  Owned by a good friend and formidable chef Anastasios Verteouris.  A lot of ample seating and a good dining spot for a day out with friends.  Check out their three locations in Brooklyn- Bay Ridge, Cobble Hill and Caesar's Bay  You'll love the grub and with cool names like Bella Chicken Wrap and Wild Wild West, you'll be hooked.  Let's have lunch!", "author": "AJ N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-17", "description": "Nature's Grill was just fine. A coffee and the special of the day, a salmon burger, was $13.56. The salmon burger was served with a handful of tortilla chips on an interesting multi-grain sandwich roll. A snappy, garlicky sauce brightened it. It was nicely grilled; perhaps over an open flame. This might be more valuable if it's your neighborhood diner, but it's not a destination place. \n\nThe service was thoughtful and concerned. Props to the staff.\n\nTIP: It's adjacent to the Trader Joe's, and that makes a decent pairing of dining and shopping.", "author": "Steve N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-24", "description": "I have this uncanny ability to zero in on the most unhealthy item on any menu, usually within seconds. I call it, \"deciding what to order.\" \n\nIt took a bit longer at Nature's Grill because:\n\n1. They seem to be very health-conscious (ugh). \n2. The menu is humongous. \n\nI was thinking bison burger for a while, but then I saw the Nature's Grill Combo Wrap. This thing is filled with both grilled chicken AND bison, turkey \"bacon,\" cheddar, and BBQ sauce. Obviously it's really good for you, and it turned out to be quite tasty as well. And ENORMOUS,* especially for $8.50. I had to take half of it home, although eating have of her Chicken Lover Panini (equally tasty) might have had something to do with that.\n\nAll in all, I was pleasantly surprised by Nature's Grill. Healthy-eating isn't really my thing, but everything we ate was fresh and delicious (including the guacamole). I'd happily return for lunch or dinner or anything in between, especially since the smoothies are awesome and you get much more for your money than most spots in the area.\n___________\n\n*If I ate here every day, I would end up looking like the monster of a man who was working the cash register. You know, if I lifted lots of weights, ran every once in a while, and grew 4 or 5 inches.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-09", "description": "Ate here today. Had the lamb burger which was quite good. Cooked well and spiced nicely. \nHowever, we were offered fries or vegetables as if it came with the meal. Of course we got the bill and were charged for them, so a bit duplicitous of the waiter not to tell us. Made sure to dock his tip the same amount of the food, leaving him with a small tip. \nWe also asked about the non sugar desserts, and if any sweetener was put in. Not only did he not know, neither did anyone else. For a so called health food restaurant I found this ridiculous. \nAlso, while they bill themselves as natural, good luck trying to find a vegetarian dish, maybe 3 0r 4 on a menu of 50 items. \nThe ambience of the place is horrible. Pumping in loud disco music to a health food seem incongruent and it was hard to talk. \nAnyway I won't be going back. Many other good choices nearby.", "author": "Robert C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "A healthy conscious kitchen, cafe, juice bar, and grill spot. I enjoy eating here with my coworkers. The food and juices  are really good. Everything look fresh.", "author": "Maylin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "My boyfriend and I are both health fanatics, with the occasional, ok weekly, pizza \u0026 wine slip-up. So when we feel like we need to detox and absolve ourselves of our foodie sins, we love coming to Nature's Grill on Court Street in Brooklyn. The food is healthy and fresh, and the portions fill you up. I like to work out hard, so I like healthy food that comes in human, not squirrel-size, portions. I love the salads and the option to turn salads and bowls into a wrap--who says healthy eating has to be boring? My bf loves the Nature's Grill Super Protein Platter. It's a manly size that is still waist-conscious. Lastly, make sure to sit in Nurbek's section. He offers up great suggestions and is very attentive. My only complaint....why is there no Nature's Grill in Manhattan? Oh yeah, I forgot--it's not a multi-million dollar chain that pumps out crap!", "author": "Debra H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-06", "description": "A group of 8 of us visit every time we have a staff development meeting at least 3-4 times a year. We used to look forward to our lunches at natures grill. This past June we came in for lunch and the place was relatively empty. We specifically told our server we only had an hour. He took our order and we waited and waited. Some members of my party didn't get there food until they literally had 5 minutes left to scoff it down. (Mind you all her ingredients were raw) other tables came in after us and were served. The sweet potato fries were cold and tasteless. The manager did apologize and asked us to give it another chance. We returned again a few days later and this time it was empty. Again there was a mistake at the table on someone's order. She sat and waited for a new sandwich which again came out so late she had to wrap it to go. The manager actually came back to the table and questioned her if she ordered it correctly?? We will never return. Food mediocre, service unfriendly and condescending.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-08", "description": "I wanted to like this place. Maybe some of the food is fresh and good quality... but it's overpriced. I'm ok with paying higher prices for fresh, high-quality food and my tossed salad was tasty, but $3 for 1/8th cup of fresh-ish mozzarella cheese? To their credit, they gave me more when I asked, but it felt like they were trying to skimp. My husband got a to-go style cup of strawberries (just under $5) that were moldy. Again, when we asked, they got him a serving of freshly sliced strawberries. They were delicious, but why not serve those to begin with? And the disgruntled service didn't help anything.\n\nI'm sure you can find something healthy and satisfying on your first try, but be warned that it will cost a lot. And it may or may not be worth it.", "author": "Katelyn P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "Went here to pick up two salads the other day. First impressions? Well the place is noisy so I wouldn't chose it if you wanted to talk to someone. Service, even for take away, was pretty bad as I had to try and get someone's attention to serve me. They don't chop the salads - which I have come to prefer - and the salad itself was pretty average.\nSo....would I go back? I have to say probably not.", "author": "Lee P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-27", "description": "Went in yesterday during TJ grocery shopping session and ordered their famous bison burger. It didn't completely won me over. Felt like it could have used a better sauce..and more generous with it...Bun was also a little too hard for my liking...and I would have liked if they  had options for cheese or avocado slices.\n\nOverall it wasn't a bad burger. Just for $8 you kinda expect more...lol\n\nStill I liked the place. Loved the fact they had so many good choices for lunch. So I'll certainly drop in if I'm in the neighborhood again in the future.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-22", "description": "I order from them often because they are the healthiest option for delivery in the neighborhood but never again. I placed an order and waited well over an hour for my food. I finally called to check on my order. Apparently their \"website is down\" so they never received the order. If your website is down, don't send an order confirmation, which they did, send an error email. Unacceptable. I was given 2 choices a) cancel my order or b) they would rush my order and get it to me in 40 more minutes. Again unacceptable. They were \"nice\" enough to give me a $25 credit the next time I order so that's good. I'll get a free smoothie the next time I order from them. Horrible customer service. If you order online, make sure you call them right after to make sure your order went through.", "author": "Dave G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-25", "description": "Bleck! Wasted $17. Avoid the sesame chicken. Dry, zero sauce, flavorless -tasted like prepackaged meat! Instead of the listed brown rice they put in some weird pseudo-Spanish white rice- steamed flavorless veggies....SO disappointed.... \n\nAlso the protein brownie is like a prepackaged Little Debbie, without the flavor. \n\nWho knows, maybe they have good smoothies but w/ food like that- who needs em!", "author": "Spark O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-19", "description": "A good option when you want something \"healthy\". First came here after there was some kind of Groupon/LivingSocial deal and have been back a bunch of times since. \n\nThe best items on the menu are the fresh juices. Tons of options of fruits and veggies and the price is pretty good compared to fancy juice shops.\n\nThe rest of the menu items are all mediocre. I would say most of the things I had were all similar in taste... some combination of a grilled meat, chopped up veggies, and a starch. This place is for you if you want lots of protein and don't really care about flavor or originality. Portion sizes are pretty big but you don't really need to be eating THAT MUCH brown rice. Usually I end up getting a make-your-own salad which is hard to go wrong with (there are no other options for this in the neighborhood, am I right??). \n\nService for me has not been as bad as others. Both the young guy with the big hair and the shorter older woman have always been pretty friendly and available when you need them.\n\nNote that their delivery via Seamless totally sucks. I've ordered a few times and half the time it has been the wrong order or food/drink has spilled out of their containers into the bag. Best bet is to eat in or take out.", "author": "Michelle Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "I try (keyword: try) to eat healthy so when I heard there was a health conscious restaurant in the area, I had to see what it was all about. When we got there, we were told to sit anywhere we'd like and by the time we sat down someone was bringing water to our table. We took about 10 minutes to figure out what to order because their menu is so massive. I ended up getting the \"Taste of China\" which was decent enough but could have used a bit more flavor. Hubby got \"The Energizer\" and he enjoyed it. We shared a large smoothie which was really good. We got our food probably less than 15 minutes after we ordered. Their portions are pretty big and you get a lot for the price. I don't think think there is any place around here that you can get steak for so cheap (Please feel free to tell me otherwise)\n\nNow on to the BEST part of the meal... the SUGAR-FREE cheesecake. Doesn't even sound good right? That's what I thought until I gave it a try. Let me tell you guys, hands down this was the BEST cheesecake I've ever had. I'd happily make that walk to Court st. for JUST the cheesecake. Junior's move over...Nature's Grill will take it from here :-)", "author": "Marla B."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}