{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-07", "description": "Order a salad, one of the best I've had, I mean anyone can make a salad right? Just throw stuff in a bowl and add dressing! But man theses people made the salad with love. It was pricey but I didn't care cause I was so so good!! I'll definitely order again and also recommend someone!", "author": "Karen M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-11", "description": "Natures grill is a very safe and bland place. Everything I've had there is fine, but nothing worth remembering. The reason I give it three stars is because the juices are expensive but really great and fresh!! The hangover juice is my absolute favorites. Visit here if you're on a health kick.", "author": "Carly G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-01", "description": "I've come here twice and im not overly impressed.\n\nTheir food is healthy and its decent but nothing to brag about. I haven't had anything extraordinary here though. \n\nI ordered a protein strawberry shake and it was actually disgusting. I gave it away because of how poor it tastes. \n\nThe staff is pretty friendly and its relatively spacious. its a good spot for a quick healthy lunch but not something i would seek.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-09", "description": "Food is good, I had the natural grill bowl. It had grilled chicken and bison with brown rice. It has a good amount of meat and rice, however the price for the bowl came out to 14$ without a drink! So you can say they are pricey. It's a nice eatery, you can go in and have a seat and eat your meal. What I found cool is that they have organic wine and beer, I dont think I've ever had that. The only thing is that everything on the menu is pricey.", "author": "Duvesh N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-21", "description": "Walking in at 9:25 to order something quick to eat and go. Look at menu for 5 minutes and then waiter comes to me after I looked at him. I say I'd like the burger..., and he immediately chimes in \"just to let you know we close in 20 minutes. Can you take it to go?\". I say how long will it take? He says 15 minutes. I say okay don't worry. I stand up to leave and he goes to the kitchen to check how long a single burger will take to cook and then comes back and says yeah it's going to take 15 minutes. It's 9:30 so you close in a half hour, get a watch. I own a quick service restaurant and would fire the entire staff immediately if this was my place.", "author": "John G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "Nice place for lunch. They got good variety of choices. Rice bowl are delicious,. They are bit pricey but big enough for two people. \nDice it was very tasty, with lots of veggies and chicken. Perfect to eat while still hot. \nThe seared ahi tuna wrap was a bit bland. The tuna was cooked perfectly but the peppers, lettuce and that sauce overwhelmed the tuna.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Obsessed. My husband introduced me to this place and I've been hooked ever since. Natures Grill makes healthy taste delicious!\n\nOnly downside is that I feel it's kinda pricey considering. Or maybe adding avocado it everything just always ups the price lol", "author": "Amani A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-23", "description": "Stopped in for a quick bite before heading into Trader Joe's...I ordered a \"hangover helper\", not because I was, because I wasn't LOL, but b/c it had some of my favorite ingredients...apple, beet, lemon, and ginger. \n\nI then ordered a black bean burger w/ sweet potato fries. It was ok. I'm not a black bean burger kind of chic, but wanted something on the vegetarian side....\nThe menu is pretty extensive, so I'd probably return to try something else.", "author": "Lyn D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-11", "description": "I came it at 9:24 (it's 9:30 pm now) for the 2 person meal for $49 that is until 10 pm. I was told I couldn't get it because it's only at tables and they aren't taking tables. \n\nI'm mostly posting in case Managment cares how the establishment is being run. If a sign says a special until 10 but you don't take tables at 9:24, it would be worth changing your signage to reflect that. \n\nShame really. I don't go back to restaurants who don't value customers.", "author": "Kole W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-08", "description": "They serve the worse Salmon burgers. The service is not all that great either. I am not going back. This location used to be so busy. Not any more.", "author": "Laura R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Not sure why the bad reviews. The place is good in terms of quality, variety, and service. It is pricey for what they serve, but there's also no other spot like it around. I come here about 1x a week. They have fresh juices, bowls, and sandwiches/wraps/paninis. I've only been disappointed once in terms of food, I spoke with the server and he fixed the issue with no attitude.", "author": "Zareda N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "Only ever ordered in from here but I really like this place.\nThe food is pretty healthy, the lunch deals are baller, and they make fresh juice on premises.\nPretty solid choice if you're looking for a healthy meal!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "So yesterday my fiancé and I decided to get groceries at Trader Joe's but realized upon arrival that the line was crazy long and we were both starving! We were craving a good salad and stumbled upon yelp reviews for Nature's Grill- which luckily was a few storefronts down. The restaurant itself is super cute and modern- 2 booths on alternate sides of the entrance, many 2 seaters and a few tables for 4. There menu is Cheesecake Factory level HUGE- but with much healthier options! Additionally they sell organic wines and beer. If I'm not mistaken they had a gluten free beer as well. The salad section had many options. I decided on the Guadalajara salad with chicken (I subbed carrot/ginger dressing for the fat free choice they had paired with this salad) My fiancé chose the Greek salad. The portions were sufficient to fill me up and still have leftovers for today's lunch (woohoo!) I would definitely recommend going here for a healthy lunch or dinner.", "author": "Saira W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "Love this spot. Awesome healthy food and great smoothies. A little on the expensive side but the food is worth it. I treat myself to this place once or twice a week. Love the salmon rice bowl and the peanuty blast smoothie", "author": "Ana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "I come here every other week or so. It's quick and got lots of healthy options. My go to post gym meal place. Price is reasonable and you can't really go wrong with whatever you order. \n\nWhat I don't like: sweet potato fries get soggy after 10 seconds of being on the table. I like it super crunchy so not a huge fan.", "author": "Melanie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "Have frequented this establishment several times, the most recent time I ordered to take out and was very happy with my food selection.  Had the brown rice bowl with veggies, and salmon.  I was happy to be able to substitute a vegetable for a more favorable one.\n\nEach time I've been there the space is empty as I walk in after \"normal\" lunch hours and the staff is on their game taking your order while handling other tasks.\n\nThe space is a bit bland and lacks décor, but I'm ok with it as long as the food is fresh and tasty.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Stopped in for lunch today.  Best lunch in the area.  Used to eat here all the time.  Lunch today made me fall in love with it again.  Lunch special came with a soup and a small smoothie.", "author": "Dawn D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-24", "description": "I was unimpressed by Nature's Grill. It advertises quality fresh ingredients, and the lamb burger I ordered was anything but that. Meat was very dry and lacking in flavor. My fiance gave them a try earlier in the week and had a similar experience. For the price I was hoping for a bit better. New to neighborhood and was hoping this could be a go-to healthy option, but I think I will look elsewhere.", "author": "Allison P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "I love this place, the staff is always friendly and attentive, and the food is always on point. If you're looking for a casual, medium price point healthy, but delicious location to eat, this is the place for you.", "author": "Alicia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Excellent service.\nAmazing food.\nReasonable prices.\n\nEnjoy going here with family and friends.  Yummy smoothies too!", "author": "AE F."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}