{"aggregateRating": {"reviewCount": 278, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-01", "description": "This place is supposedly healthy, but the portions are SOOOO HUGE, that it almost makes it un-healthy (and if you know me, I have no self control and will eat the entire plate).  The menu is also SOOO huge (Californians, think Cheesecake Factory menu), it caused me a lot of stress when it was time to place my order.\n\nI had the Oh California Wrap, bowled (served over brown rice instead of wrapped), which could've and probably should've been split between two people.   It came with grilled chicken breast, spinach, avocado, sesame seeds, grape tomatoes and hot sauce.  Everything was fresh and tasty, though they totally skimped on the avocado.  \n\nI'd probably go back (the breakfast menu is enticing), but the people working there (and the clientele) were rude and it didn't seem like the cleanest place I've been to....", "author": "Jenny W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-19", "description": "Love the idea and concept of this place. Food is actually very good. However, the service leaves a lot to be desired. Prices were also a little steep for a casual dining place. \n\nWe got the chicken \u0026 steak combo entree. Very tasty!\n\nWill give it another try.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "Really good! Great place to go for a casual sit-down meal, good food, yummy juices! Decent staff, healthy options, extremely vegetarian friendly! (I am a vegetarian) I would recommend", "author": "Ashleigh S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-14", "description": "We have come here a few times for the smoothies. My kids love them. Peanut butter and banana is great. But that is it, I have not enjoyed any of the food, and they use a lot of \"unnatural\" ingredients considering they call themselves \"Nature's Grill\" Smuckers sugar free jam? Holy processed food! \nThe worst part is their credit card minimum, which is either 15 or 20. If you don't meet it they charge you a fee. I wonder if this violates their agreement with their credit card companies, either way, it's annoying and petty.", "author": "Cecilia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "A local neighborhood staple with a lot of very good options. Very reasonably priced too for a higher quality. Never sat down and ate at the restaurant but order out weekly. Also did a catering menu for 12 which was delicious and also very fairly priced.", "author": "Josh C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-23", "description": "If there could be a way to rate Nature's Grill zero- I would. I heard rave reviews about them and was actually eager to try something new and healthy for a change. I had placed the order at 2:50pm. Didn't get the food until 4:45pm. When I had called the store, whoever answered gave me attitude about their \"attempts\" in delivering/ calling yet I never received a call. When the food finally arrived, it was soggy, tasteless, and the guacamole was brown instead of green. To make matters worse, I was trying to make the best of the cuban I had ordered only to find a hair in it. Needless to say the food is now in the garbage and I am still hungry. Thanks for the money wasted and the bad experience Nature's Grill.", "author": "Andrea D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "Good selection of vegetarian food and overall excellent selection for everything from wraps to smoothies and everything in between.  An excellent savory and healthy option for a quick bite.  Great service to top the list as well!", "author": "Rene B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "It's hit or miss with this place. Service is fast \u0026 cheap \u0026 cheerful menu. I usually get the Thai lettuce wraps but the last time it was a little bland I felt like they changed the recipe or the cook. But I usually am pleased. I would def say give it a try.", "author": "Karen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-01", "description": "Not bad!  I was impressed and overwhelmed by the huge menu!  I enjoyed the bison burger, and the lamb burger was just right!", "author": "A W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-26", "description": "Cold Oatmeal: Who would have known?!\n\nWe were here for a quick brunch during the week.  The server was nice and friendly and the spot was empty. \n\nWhen I asked about a menu item that was pictured, I got the most honest response. \"That's false advertising, we don't have the yogurt bowl with granola that is pictured.\"  \n\nWow! I was a bit taken aback, but the lady kept it real.  So gotta give it up for that and she recommended this cold oatmeal thing.\n\n- Cold Oatmeal: This was in the quick to go cooler, but she took it out and threw on some granola.  It was perfection.  Healthy, tasty, refreshing.  I am now on a quest for cold oatmeal recipes.\n- 5 eggwhite bfast sandwich: My sister got this, and the lady was like.. It's a small bfast sandwich! Um, no it's not. The sandwich is as big as her face.  It was a good sandwich, but uncomfortably difficult to maneuver and eat.  It was in a big tortilla pocket thing that was huge.  Tasty, but easily can be split.\n\nAll in all. The cold oatmeal was delish, and that alone held up the meal and spot.", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-04", "description": "Had delivery from here through Grubhub and it was quicker than expected only a half hour!  The salmon burger was delish and well done. It's hard to find good natural  healthy food for delivery so I'm glad I now have a good go to place", "author": "Quontay T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "We ate two meals at the resturant in Brooklyn on Clark St.  Great food and service.  I had salad and a sandwich, big enough to share.  Then at next meal I had a bowl of vegetable soup.  both were nutritious and very good.", "author": "Candice M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-05", "description": "If you like peanut butter, do yourself a favor and get the Peanutty Blast smoothie: peanut butter, honey, banana, and soymilk. \n\nSo. Friggin. Good.", "author": "Sheri G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "I have been here twice so far and ordered the veggie melt in the low carb-whole wheat-wrap both times. It's awesome. It's a super filling wrap, but doesn't leave me feeling sickly full or unhealthy. The best part is that it is made with fat free mozzarella. I've never been to a restaurant that carries fat free cheeses before, and this made me supremely happy. \nYes, the menu is huge as many other reviewers have pointed out, so it did take me a while to finally decide on something. However, my only complaint about this place is that they do not include calories/nutritional information on the menu or website.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-02", "description": "I am not a fan of healthy food, so I must start with that before saying anything negative about this place.\n\nI had the steak and egg whites.. I wish I never ordered it! The protein shake was all right, but I will stick to my un-healthy diet and not come here again.\n\nI am sure this would be a heaven for people who are health conscious.. just not me.. sorry", "author": "Sera A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-02", "description": "Not impressed! The elk burger is overpriced and not very elk-y. It tasted like a Mediterranean kufta. It was over flavored and dry as cardboard. I couldn't find one characteristic of elk. The sweet potato fried are good but were served to me cold with a burnt burger. Not how I ordered it. With so many restaurants around, I won't be coming back for the food. The juice bar is good and reasonably priced. The staff is nice and helpful as possible.", "author": "Joshua G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-23", "description": "Absolute wreck of a place. Food is tasteless, staff can care less why you're leaving with a plate full of food.", "author": "Artem F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-15", "description": "They get it! Absolutely outstanding food, great service, exceptional quality, great price.  It is always a challenge finding truly high quality and low carb options. If you ask for a low carb burger most places will give you a bland unflavored piece of meat on a plate with a sprinkle of salad and stare at you blankly as they marvel at how \"anyone could eat it without bread\". Enter Natures Grill.  THey serve tasty, well flavored low carb options with an amazing selection of fresh low carb veggies. Everything about the meal was perfect and it was even cooked on a grill without oil! I said without oil people!!!!! This place is such a rare find. If you love great food and want nutritionally balanced low carbohydrate meals, nature's grill is the best choice!!", "author": "Nihaahs E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-22", "description": "I love this place....the people that own it are great but the people that work there are retarded.   They never get my order right.  The food is clean and tasty and the owners know whats up.   The one in Cobble Hill is good too....also weird staff that can't get an order right.", "author": "tahanny c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "Went there for the lunch and it was pretty good. I got the steak wrap lunch special: you get a soup, full steak wrap and a Calipso smoothie. \n\nThe chicken noodle soup has spaghetti like noodles and it was great,\nnot salty at all. The steak wrap had a slight kick and the smoothie was very delicious and I thought the small was a very nice size. \n\nIf you're there you have to try the pita and hummus. Yea it doesnt sound fancy but the hummus is pretty awesome, it blows Sabra hummus away.", "author": "Tassamai S."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Nature’s Grill Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "283 Smith St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpDDcKiU6ej8G38kbfAQeA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525100"}