{"aggregateRating": {"reviewCount": 15, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-14", "description": "I found this place for lunch being intrigued by Paella being made in less than an hour. The wait was around 15 minutes as I actually got some churros from the business next door. \n\nI got my paella and the looked was very appealing with the shrimp and mussels in the middle with the different sauces on top of each side of rice. The flavors were very present with a sweet and savory combo. It was a little too salty, but I really enjoyed the dish.", "author": "Armand R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-15", "description": "I happened to be working in the area and found through Yelp all the wonderful, trendy restaurants located in the lower level of the Albee Square Mall. Very nice assortment of eating establishments of all types, but I chose The Paella Shack especially since I had just returned from a vacation in Spain, including Valencia.\n\nThe paella here is ok. It was flavorful although the small, cut up pieces of chorizo and chicken were dry. In my opinion, this was a bit pricey dish for paella but it was a very nice sized portion. Like I said, having come from Valencia, a dish of paella at a food market or local restaurant would've cost half this price and been twice as good. But this is now trendy Downtown Brooklyn and everything here is overpriced because of the location. My coworker ordered the seafood paella which had about 4 mussels and a few shrimp, for $13 I believe. It looked very nice as well but I didn't taste his. He liked it. We took our meals outside to the Fulton Street, Albee Square seating area and ate outside as the weather was nice.\nOverall good food, nicely presented but not something I'd go back for. Clean restaurant and the service was pretty quick as your order was prepared.", "author": "Sal L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "Not the most economic nor generously portioned- but what it lacked in quantity, it more than made up in quality. \n\nI had the bomba squid ink rice with mussels. I was a bit hesitant as the cook takes from one of the 3 large vats of different paella rice just beyond the counter to fire up and add additional ingredients.\n\nFear not- the rice is crisp and maintains unctuous chew. The flavors were deep, buttery and tasty. The combination of snap sugar peas, zucchini, chickpeas and al dente squid ink rice dabbed in garlic aioli is quite genius. Any protein could have gone with this and my miniscule mussels did not bother me one bit Bc the combination was already excellent. Next time definitely shrimp or something else. \n\nBut it's a must try. Delicious!", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-26", "description": "If you are looking for authentic Spanish food, skip this place. What they serve as \"paella\", is just fried rice with toppings and - inexplicably - aioli on the side. Especially the vegetable version is weird, as it includes a lot of kale.\nAlso ordered some ham croquettas, which were over-fried to the point where they tasted burnt on the outside and were soaked full of oil inside - simply disgusting!", "author": "Julia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "You would never believe how much flavor goes into this dish in such a short time. Though it is not exactly paella as the seafood ingredients are separate rather than cooked in, they make up for this by coming up with a way to please everyone!\n\nWe went for the typical paella maricos. The shrimp and calamari were absolutely perfect. My wife is not a plain calamari eater and you couldn't get her away from the next bite. The rice itself is the very best part as this is all the flavor. I can't believe I waited as long as I had to finally try this.\n\nOne of my very favorites in the Dekalb market. Will return soon!", "author": "Devon O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "Dekalb Market Hall is overwhelming because of how many great options there are. When I'm in the mood for good Spanish food, the paella shack is my go to! \n\nThe menu is simple: you select one of the combinations or create your own. I usually choose the Negra combination ($15), which comes with mouth-watering squid ink rice and a generous amount of calamari, shrimp, and mussels. The bowl also comes with peppers, pickles, and aioli. I'm not sure whether it's oil or aioli, but grease always soaks through the paper bowl when I order the Negra and once it got all over my white shirt. \n\nYou can modify the order and add or take out ingredients. The combination is cheaper than creating your own, where the price adds up quickly ($17+). If you're not sure of what to get, you can ask the cashier for recommendations. They are super helpful and friendly! \n\nLastly, it's unfortunate that this shop is in Dekalb Market Hall, where it's always difficult to find a seat. If you're paying ~$20 for food (including the tip you feel obliged to give on the iPad check out), you'd expect comfortable seating. Hopefully they can add some chairs in front of the paella shack!", "author": "Ruby S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-23", "description": "It's challenging to turn paella into a fast food. The whole principal behind the dish is that's it slow cooked for hours, so I give the paella shack credit for trying to serve paella quickly. I had the saffron paella with shrimp, mussels, and paprika aioli. It was closer to a fried rice dish than a traditional paella. The food was good but I had slightly different expectations.", "author": "Joseph T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "Another tough decision awaited me as I walked into DeKalb Hall for a quick dinner before going to Broadway for a show. I stopped first for wine, and asked the friendly woman there about her recommendations and she suggested Paella Shack as one of her favorites.\nThe choices include saffron rice, squid ink rice or regular rice, plus your choice of meat/seafood. $12 for base + $1-$2 for each added choice. There are also vegetables, choice of aioli, and pickled peppers. You can also choose from specialty options\nI chose the squid ink with shrimp and calamari plus the garlic aioli. They also have a salad and gazpacho but were out of the gazpacho. \nThe rice had good flavor that hinted of seafood, and a blackish hue from the squid ink. It paired well with the shrimp and calamari, that were cooked well.\nThe aioli was thick and plentiful, which I thought great until I realized that it overpowered everything and a little would have gone a long way. I would skip that next time, which is unlike me. \nThe rice had a nice bite to it, the exact texture I expected.\nThe biggest downside is that it isn't near seating of any kind, but only has a bar for standing at. I was in a hurry so that was okay, but I'd take it next time somewhere.", "author": "Anita S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "One of the best places down in Dekalb Market.\n\nFor the money you get a lot of food, I split it with my wife and we were full. We had the Mariscos Paella, it included shrimp, calamari, and mussels. For $15 there were 5 shrimp, 5 mussels and a bunch of calamari. It was served with 2 different sauces one was a chipotle deal and the other was maybe avocado, I couldn't pinpoint what they were exactly but were very good. Made in front of you so you know it's fresh. Maybe a little light on the vegetables but plenty of rice. The chef added the seafood in at the appropriate times to cook each one without overcooking. The Spanish lemonade was light and cut through the richness of the paella well.\n\nYou can also build your own to make sure you get something you like.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-16", "description": "I've eaten there many times.  My previous experiences were variable but usually pretty good but the last two times I was there I was disappointed.  I was disappointed because: 1) the paella mariscos no longer has squid - only shrimp and mussels,   2) the kale salad no longer contains beets.\n\nTo me, those two changes make a big difference,  With out squid in the paella and beets in the kale salad, both dishes become boring so I won't be going there anymore.", "author": "Clifford F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "The place is awesome!! Great food, amazing service, lots of options. The chef was nice enough to give us a sample, it was tasty so we decided to give it a shot. I'm\nGlad we did, the paella was amazing. We had the seafood one and honestly, it's one of the best values in the hall. They made everything fresh and didn't skimp at all on the seafood. The calamari was also delicious. Do yourself a favor and try the garlic sauce.... amazing! This place is buried in the back, but check it out. It's well worth it.", "author": "Charles A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-20", "description": "I got the black paella, good flavors but way too greasy, the bottom of the plate was literally wet with grease... not pleasant. Good portion of seafood and well cooked but barely any veggies and the sauces are completely unnecessary given how oily it already is plus it's WAY too much sauce.", "author": "Vanessa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "Im a big guy and I got two meals out of the 12$ pork and rice lunch.  Me likey!", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "There's so many places to choose from in this food hall but I'm glad I went with this. I got the Valencia paella and I was happy with my choice. The rice, veggies, and aioli were flavorful and complimented each other. You'll get your money's worth here. My only complaint was that the chicken was dry but I'll definitely be back to try the other paellas.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "Ordered the Mariscos Paella $15 - all the seafood tasted tasted like they came straight off the freezer. Save your cash and go elsewhere.", "author": "Debbie d."}], "servesCuisine": "Tapas/Small Plates", "priceRange": "$11-30", "name": "The Paella Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Mlc4jhR93N9MZCFQjz1KKg/ls.jpg", "@type": "Restaurant", "telephone": ""}