{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "Delightful felafel sandwich!!  And my husband enjoyed his lamb sandwich too.  So much food that we had plenty for lunch the next day.", "author": "Newcomer T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Lambajin pizza is delicious. Dough is heaven plenty of lamb and flavor.price is very reasonable and the atmosphere is cozy", "author": "Kevin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "This place is absolutely delightful.\n\nThe people who work here are always so nice and friendly, and it's decorated in a beautiful way inside.  I love that the restaurant has outdoor seating.\n\nEverything on the menu is prepared perfectly and the homemade pita is heaven.  I compare other Middle Eastern dishes I try to the ones made here because this is my favorite Middle Eastern restaurant in Brooklyn.", "author": "Namia I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "What makes this place really stand out as a middle eastern restaurant (especially on Atlantic Ave) is the fresh baked pita/lavash.\n\nThe harira soup was delicious. The hummus and foul were pretty good on there own, but were greatly elevated by being scooped up by hot rounds of fresh pita. The falafel on the platter was solid. The merguez in the sandwich was not what I expected. It was loosely packed ground meat more akin to kofte than the spicy \"sausage\" I was expecting. It was still tasty though it could have used more spice. Again, it was really helped by the wrapping of fresh baked lavash.\n\nMost importantly, we'll be back\n\nPS. They're cash only", "author": "Michael L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-04", "description": "Food was good.. it's a small place..sitting facility is smaller than this tiny gem..crowd was nice little louder..but kooler..lol..loved the food..the service was prompt and efficient .. and the decorations were Afghan met Iran typo..not Beduine (which probably means Gypsy).. but comfy enough to sip some tea and make a nyc conversation!!", "author": "Foring A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "If I lived in Brooklyn I'd eat here every day.  Just because of the fresh bread they use, seconds after taking it from the oven, to wrap around a falafel with the works, I'd be there.", "author": "jeb b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Getting ready to leave the neighborhood going to be sure to get in as many more meals here as possible. So healthy and fresh; good for the belly. Great for vegetarians. Last time around had the garden salad, shrimp pitza and chicken sandwich. 4 years in the area never a bad experience. Also don't forget the other salad selections and harira soup. Will be missed ... ;). Friendly service cost effective.", "author": "Zooey V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "Nice atmosphere with really good food. The waiter was a little over zealous with our table asking what we wanted, but everything was really nice otherwise. Would recommend.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Super delicious. Is it ok to say melt in your mouth falafel. There is nothing better than the spices in the zatar bread. My friend ordered the grape leaves and this is the first place I went it was not oily. She loves their pitza, next time I will give it a shot.\nI recommend it highly!", "author": "E F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-18", "description": "Lovely, wonderful back garden!\nUnfortunately that's where the goodness ends.\nLamb platter - not too good- too dry and flavorless.   Served with mayo.  ??  Hummus- oily/blah.\nChicken platter- overly seasoned with not-a-good-combo of spices.   Baba side was good, not great.  Side salad of blah iceberg lettuce, under-ripe tomatoes and a huge lettuce stalk in there too!\nPita looked great but was way too crispy and flavorless.  Great portions though.", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "Stylish, Tasty \u0026 a cheap lunch spot! \n\nBedouin Tent is a casual place that you can sit back, eat and chat away. Small tables mean you get to play plate Tetris but hey it's always a good time with good company.\nThere is an pretty outdoor seating option that was filled with people enjoying lunch \u0026 the sun.\n\nMy date and I decided to get a couple small plates to share. We ordered Tabbouleh,Baba ghanoush, falafel, pita bread and two sodas. Loved it all ! Falafel was fresh and warm as well as the pita bread. Everything was so delicious.Food came quickly.\n\nOverall a great atmosphere and price ! Tab came to $18.50 and we were beyond stuffed! Definitely a place to go if you're in the area. :)", "author": "Cat M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-08", "description": "Their pitas are amazing!!  The pita is baked fresh on the premise, and it truly transforms a humble pita wrap into an extraordinary thing.  I had the lamb pita, and the first bite was a revelation.  As I continued eating it, I soon realized that I didn't care much for the chewy lamb meat, and instead, I was more enraptured by the fresh baked pita casing.  And unlike a folded up piece of pita bread, resembling a taco shell, they rolled up the thin, hot pita like a burrito, and it made it a lot easier and less messy to consume.  I need to try to chicken pita if I'm in their hood next time.  I expect it to knock my socks off!", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "Well where do I start....maybe with the fact the store has been SHUT DOWN by I assume the Department of Health. Here I was, hungry and craving the Mediterranean classic, falafel sandwich which is quite delicious from here. Much to my surprise, I walked up to the door and witnessed the sign for myself which must have been placed recently because a local seemed surprised to see the sign as well. \nThe falafel and chicken sandwich was/is/will be again hopefully again excellent. Who can beat that just baked/fluffy pita. Can't wait until things are resolved here, gotta admit that I will be back.", "author": "Tony C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "I hate to be a rogue here but I thought it was just ok.. Perhaps I didn't savor the falafel sandwich that much because I came here on a whim as I was passing Atlantic Ave. It might be sacrilegious but I like Maoz better (OMG I know a chain!).. their falafel is so fresh, green, and I love the salad bar. The spices are there.  You get whole wheat pitas too.. I guess it's just different. Bedouin is more like your street meat falafel- the falafels are good..nicely cooked and not burnt, but they're a bit plain, but the lettuce and tomato alone didn't do it for me. The pita is warm, and soft.. but honestly. i've had better. The sandwich is rolled up really thin. Lastly, I wasn't a huge fan of the mayo ish sauce. It was really messy, but I generally don't like mayo or cream based sauces. \n\nNot bad for $5 given I was starving and going on the go.. but I'm not sure I would ever venture back.", "author": "Stephanie Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "Delicious and great service!", "author": "Emily K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Amazing plates! Excellent service for very low prices! We tried the tabbouleh, hummus, Seminole cake (awesome home baked) spinach cake and lamb pitza!!! Everything was incredible!", "author": "Natalia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Food was pretty great for the price,I just wouldn't recommend the water,it tasted bad,just buy a drink or a bottle of water.", "author": "Jim R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "Loved the food, loved the place. All the ingredients felt to be very fresh. Had the foul beans salad which was very refreshing on a summer afternoon. The falafels, hummus, pita bread was really yummy. Pita bread, omg! The best. Their pizzas are great as well with a well made crust. Didn't try the desserts though. Portions are great, service is great. But they accept only Cash. Would have been good if they accepted credit card.", "author": "Krishna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "The BEST Middle Eastern food you'll ever eat. Do not miss this place. Ok, the service can get a little crappy when they're packed, but you will eventually get some water and your order in, I promise. And it's worth it. \n\nThe salad combo platter is a great way to go if you're dining with others. Gives you the opportunity to sample a lot of tasty stuff - my favorites are the labneh salad and the feta salad. Drooling now. My other favorites are the Za'atar bread (frankly, all of their hot out of he oven bread is amazing) and the spinach and feta pie. The falafel is also perfect - not greasy at all. I need to go back soon to try some of their other items, like the sandwiches and the lentil soup!\n\nAbove all, the prices are very reasonable. You'll walk out of there full of homemade, delicious eats, for not that much money!! I always have leftovers too.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-16", "description": "Food: awesome, fresh\nAtmosphere: Decor is cute and simple + ethnic music (not usher piped in which really bothers me)\nService: prompt and friendly\n\nOverall great experience. Made to order pita, lambajin pitza, chicken ouzi, and salad platter.  We always order to much food and we did it again, for 2 people, we had enough for an extra person, but I don't regret it because it was delicious!  The salads were so fabulous I could eat them every day!  I've never had anything like the lambajin pitza or chicken ouzi and they were both awesome!\n\nCash Only\n\nIt was kinda confusing when we walked in because there were a lot of men making the pita out front kinda like a pizza place and we couldn't tell if we ordered there or sat down.  You go sit and then order.  Got here, try something new if you haven't had it before- It's AWESOME.", "author": "Kristan O."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}