{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Great place for a quick middle-eastern lunch.\nI'm vegetarian and I always get the Falafel platter. The falafel is awesome, the freshly baked pita stays hot even though it takes me 10 mins to walk back to my office before I eat. The hummus is very low on oil and babaganoush is perfectly smoked.\nThe salad included in the platter is a bit weak - It would be nice if they replaced the green leaves with a chopped tomato/cucumber salad and their hot sauce needs to be hotter.", "author": "Vasu C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "Absolutely amazing. Finding good middle eastern food can sometimes be tricky- but this place is the best I've ever had. Knocks it out of the ball park by far.", "author": "David F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "Great spot for lunch in the summer when you can sit in the back. The staff is friendly and fast. The falafel sandwich and platter are very good and we surprisingly enjoyed the pizza as well. Quick filling lunch at a great price and will def be back.", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "I think this may be the best pita I've ever eaten... and, coming from someone on a carb-only diet, this comment should be weighed heavily. ;)\n\nIt is seriously the freshest, doughiest, yummiest bread ever.  To me, that was the best part of the meal.\n\nI ordered the falafal plate; it was pretty good but think they could have been a bit crispier.  It was served with the pita and hummus (delish) and a small salad.  It was tasty but I'd make 2 suggestions: 1. Dress the salad; it was plain/bland with nothing on it (at least as far as I could tell;) 2.  Include some sort of refreshing tahini sauce to serve with the falafel.  There was a small, nicely spiced sauce in there but the falafel is so dense it would've offset the richness.\n\nFinally, the men behind the counter are super nice and friendly; if I lived here, I'd definitely make it a regular neighborhood spot.", "author": "Rebecca T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "The smell of the fresh pita they are cooking in the front of this restaurant wafts through the whole restaurant and makes you feel like you really could be in a bedouin tent, instead of on Atlantic Avenue in Brooklyn.\n \nAlas, you are still in Brooklyn, but the good news is they have a huge outdoor area and if you close your eyes, take deep whiffs of the wafting pita scent and calmly sip your mint tea, well, yeah, you are still in Brooklyn.\n\nBut the food is damn good.  Get the foul, thank me later.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "I almost immediately fall in love with a restaurant if you can create simple things from scratch, like bread, pita, like stocks.. basic no brainers that when made fresh and from scratch, the flavor is hugely different. I loved my lunch here and would definitely come back for more. It was fresh and authentic and I'd like to even say great value for money.", "author": "Krits R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "Into this place! The pita is fresh and to die for. They have a backyard garden seating area which is pretty amazing. Great Baba Ghanoush and za atar bread. I think it is cool that the pizzas are called pitzas.", "author": "Jane S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "My guy found this place and usually I'm a bit skeptical to his choices because I'm the foodie in the relationship, but he did good.... real good. \n\nThis place has amazing food.  The pita bread is warm, freshly-baked, and delicious.  It goes great with their baba ganoush, which has a nice smoked eggplant flavor. The salad with the light vinaigrette was a great complement to the falafel.  The falafel was delicious and not overly crispy, but had a great dense flavor to it.  The size of the falafel is larger than most Mediterranean places that I've been to as well.  The stuffed grape leaves were excellent, but I've never tried it before so I don't really have much of a comparison.  I didn't quite enjoy the spinach and onion pie because it was stuffed with too much spinach and it wasn't seasoned very well.  \n\nThey also give you little bites of almond cake with your check and it was sweet and fluffy.  \n\nThe price is right and I can't wait to go back for more.", "author": "Kiki R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "Awesome syrian food. Front end is carry out, but the back room is like you are in a desert tent.   Authentic down to the way the sauces are serviced in raised silver cups. \nChicken ouzi  was great.", "author": "Sparkle s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "Went to Bedouin for lunch one day.  What a pleasant surprise!  Had the falafel with a side of humus.  Amazing. Mint ice tea was a nice touch.", "author": "Peter B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-09", "description": "Cheap and good Middle Eastern food!  A really consistent option and charming little backyard.  The bread is really awesome.  I love all the veggie stuff, salads and breads.  The lamb wasn't my favorite, a little dry and honestly overshadowed by all the awesome veggies.", "author": "Alice E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-25", "description": "It was good falafel for the price. I liked that they added pickles to the sandwich.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-15", "description": "Fool me once, shame on me. Fool me twice, shame on you Bedouin Tent!!  First time I stopped into this restaurant the smell of fresh pita was intoxicating. I was super excited to try it after reading all the great reviews. I ordered a falafel sandwich to go. When I got it home I opened my neatly wrapped sandwich and dove in. The pita is divine, I will give them that, but the sandwich it self was a hot mess. The falafel was decent but where were the toppings? There were a few pieces of lettuce and two hard as rock slices of tomato. I decided I must have ordered the wrong thing and decided to give them another chance. I went back for my second attempt today and ordered the leg of lamb sandwich. This was infinitely worse. The leg of lamb was all fat and super tough to chew. I had difficulty stomaching it. It again was sorely missing its toppings. I am truly disappointed I wasn't able to experience what so many others are raving about. Sorry Bedouin Tent, you will not be getting a third chance.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-15", "description": "I've been ordering food here happily for over 20 years. They've recently changed staff. It's a change for the worse. The food is not nearly as good. The staff now is rude and extremely unpleasant. Tonight was the last time I go there. Too bad.", "author": "Carolyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "Bedouin Tent seldom disappoints.  The food is fresh, tasty and inexpensive.  I've had the falafel sandwich/plate, a few of the pitzas and the assorted salad (five items from among babaghanoush, hummus, beet salad, grape leaves, etc.).  \n\nThey make the best falafel sandwich ($4) that I've had in the City.  It is not too oily or soggy and is served in home-made pita bread, a decision which very much contributes to the quality of the sandwich.\n\nOf their pitzas, I enjoy the green pitza ($8) the most.  It has a unique combination of toppings - leeks, scallions and fenugreek with mozzarella - that go together well.  The shrimp pitza ($9) I do not like.  The garlic used on it can be on the raw side and the baby shrimp is of the pre-cooked, refrigerated variety.\n\nThe check always comes with a few squares of honey-sweetened almond crumb cake that really hit the spot.  In the summer, the charming backyard seating, with its crawling foliage and view of the church steeple next door, is not to be passed on.", "author": "Kelvin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "If you want to have good middle eastern food which is light on the wallet, I recommend this. I had gone here today afternoon with one of my Persian friend and we both enjoyed the dishes. The best part is the hot pita bread that they serve. Its fresh and hot and very tasty to eat. My friend was so impressed that she packed some for her home. The Falafel is indeed very nice here. Very soft and delicious. Babaganoush and Humus was above expectation.\n4 Stars as the seating arrangement and the ambiance is not so great but it could be made better.\nDefinitely worth a try. I will be visiting it again when I am in Brooklyn.", "author": "Jahangir S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-13", "description": "The food here is amazing yet simple. I'm not a huge fan of lamb so I can't really speak to those menu items but the bread is freshly baked on the premises and their lentil soup with a sprinkling of fresh lemon juice is divine. Whenever I'm in town, I try my best to catch lunch there with my wife. It's definitely one of our favorites and while the downtown Brooklyn crowd isn't really our scene, it's well worth a shot if you're interested in solidly good Middle Eastern/Mediterranean/North African food. ¡Buen Provecho y Ma'a Salaama!", "author": "Yarehk H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "Great service, very accommodating even with children, and the food is always very fresh. Quality is consistent every time I've gone. Their lamb pizza is my favorite!", "author": "Grace Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-21", "description": "Really great, fresh food and VERY reasonably priced.  My favorites are the spinach pie, the sun dried tomato pizza, lamb sandwich, all the dips, and the lentil soup.  My biggest problem here is not ordering too much food.  Good service most of the time.\n\nMy only gripe is in the winter they always close up early.  I work late!  I need my dinner!", "author": "Brad K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-17", "description": "3 1/2 stars.\nThis little middle-eastern place doesn't look like much from the outside, but once you get past the crowded counter area in front, there's a dining room decorated with authentic Egyptian tent hangings and khayameya applique work, hung with Moroccan-style lanterns. There's also an outdoor garden with beautiful, huge climbing roses.\nWe had a falafel wrap and the combo platter of five different \"salads.\" Food was very good, the grape leaves and the fresh-made pita were particularly outstanding.\nAlso got a turkish coffee, which was nice and strong, and we got a little piece of 'basbousa' cake as a complimentary dessert.\nPrices were very reasonable.\nIt didn't instantly become my most-favorite Middle Eastern place, but I'd be more than happy to go back again... there was a chicken-with-yogurt dish that looked intriguing that I'd like to try!", "author": "Althea A."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}