{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "I have been here a couple of times. The food is so good. The falafel, pita, hummus and chicken wrap are all amazing. The prices are great for the portions you get. The restaurant is nice even though I haven't been in the backyard. I am also dying to try their pizza. Great Middle Eastern food!", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-20", "description": "Bedouin Tent is everything that a great Brooklyn restaurant should be: cheap, comfortable, delicious. I took a group of 9 first-year graduate students here last night for a social dinner, and it went flawlessly. Ended up spending $15 a person. Sam was very flexible about seating our big group. Leg of lamb plate was good, although the lamb was a little well-done. Should have gotten the falafel. Excellent chumus, fresh pita. 2 blocks away from Hank's Saloon - never leaves me unsatisfied. No cash, had to run to an ATM a block away. And no alcohol - used to be BYOB but stopped about 2 years ago, according to the waiter.", "author": "Brian R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-21", "description": "I ordered the fallafel sandwich and was greatly disappointed, as it had very little flavor.  I also ordered the bean salad, which was not so great.  The only great part about this place is the bread, which is pretty good.", "author": "Marcus H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-11", "description": "By far my FAVORITE inexpensive quick meal in the neighborhood. The food is always fresh and delicious, and the employees are always kind and friendly. Dining in is not the most amazing experience (although there is a great rose bush in the backyard), but for take out or delivery I would highly recommend.", "author": "Grazina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-05", "description": "If you are craving some babaghanouj, falafel, lentil soup, hummus or other middle eastern food, this is the spot in Brooklyn.  Located on Atlantic Ave. near Bond St..  Aside from delicious main dishes, their pita bread is baked fresh...in front of you.  The staff is attentive and friendly.  For those of you who live in Brooklyn, I am jealous.", "author": "Mike T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "I heart this little restaurant! I used to come here with my guy when we lived in Brooklyn and we just returned to eat dinner there tonight after a 2 yr hiatus! The food and service are still great. They have really great food at such affordable prices and the food is legit, you will see many middle easterners coming in to eat. You must try their labajim which is a version of a pizza with ground lamb, very delicious. And they also have good hummus and their chicken plate is so delicious and comes with huge handmade pita, hummus and salad, and a side of tahini...all for $9! For dessert, try their semolina cake, which I think is called bambousa. If you come in the summer you can sit in the garden which is made to look like a tent, very cute. Oh and it is cash only!!", "author": "Marcie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-27", "description": "Amazing. We stayed in Brooklyn and checked Yelp for local restaurants.  Saw good reviews for this and gave it a try.  DELICIOUS.  The pita is amazing but the big winner for me was the mixed salad plate.  Delicious.  Came back a second time. If I lived nearby I'd be a fixture there.   Yum", "author": "Minnie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-14", "description": "My hopes were a lot higher - 200+ reviews and a 4 star rating - but I would say the food was as good as I have had at other places in Brooklyn. The food is good, but I would stick with other restuarnts that are closer to where i live.", "author": "J P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "Recommended if you like a nice big platter of cold appetizers -- they're better than average and a great deal.  The usual suspects (hummus, tabouleh, baba ghanoush) were good, but some of the more weird-sounding ones like the beet salad were really amazing.  Also, great pita.  \n\nIt is worth noting that there is currently (July 2008) some kind of issue with the BYOB and until they fix it, you can't bring any booze.", "author": "Jesse N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-12", "description": "I liked going to this place in person.  very cool atmosphere and the food is good too.", "author": "Ericka C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-20", "description": "Remember learning about clouds in elementary school? And there were the incredibly fluffy ones? The pita bread at Bedouin Tent is basically a Cumulus humilis cloud. Unbelievably fresh, the food at Bedouin Tent is undeniably the best middle eastern food I've had outside of Israel. And if it were socially acceptable to stand up in the middle of a restaurant and applaud, I would totally do it. \nPrice wise, it's very reasonable and even bordering on cheap (New York cheap not legit cheap.) \nAlso, a great place for vegetarians. So many options, there is no need to be that guy who orders the chicken salad without the chicken.", "author": "Sonia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "the zataar pita was the tastiest and best $5 i have ever spent on food in this city. dipped in a few-more-dollars-worth of creamy and delicious hummus, the meal quickly became the best $7 i've spent on food here.\n\nmoreover i was fortunate enough to have one remaining zantac in my pill vial. \n\nNo Regrets 2010.", "author": "jen f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "Delicious and nicely priced! Loved the Lambajin (meat atop pita-style crust). The merguez sausage was not as expected (too mild), but came in an enormous sandwich and it was still tasty! We really enjoyed sitting on the back patio.", "author": "Rachel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-02", "description": "What everyone else said. Amazing. Ordered the beet salad and a lentil soup, which came with a huge, fresh piece of pita. Everything was delicious. When the waiter brought my bill, he gave me a little tiny piece of some sort of cake that they serve and it was also super good. I just went there yesterday for the first time but I am going back today. It is that damn good.", "author": "Mary L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-12", "description": "Fresh bread, tasty food, pleasant ambience, attentive service and low prices - all ingredients for my type of venue for a good time.  The Leg of Lamb was my favorite.  The felaffel and  merguez are probably the best in town.   Their version of the pizza - not the greatest, but still enjoyable.  Order the platter for a few bucks more and you get the choice of delectable hummus or babagouneus (probably misspelled). Very light on the pocketbook for high quality fresh food.", "author": "William L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "Bedouin Tent continues to be my favorite Middle Eastern cuisine restaurant. Everything is just delicious, especially the zatar bread, the garlic bread, the pita bread in general, the assorted salad, the falafel sandwich and the falafel plate, the lentil soup, the baba and the hummus!!!! lol!! I haven't been there to eat in a long time. I always call them for delivery. In the past, we had some issues with some waiters. I can't tell now if they have improved the service. I hope.", "author": "Di H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-24", "description": "Excellent warm, freshly made pita on my falafel sandwich. Almost great experience.  Decided to sit down after having already ordered at counter. Quickly ate delicious food as my baby quietly played in her stroller. Waiter did bring food to me with cup of ice for my soda, so I left him a small tip. Got up to pay at counter. After I paid, the waiter told me that they work only for tips and don't get paid and then looked at me expectantly. Basically, asking me for a tip. Even if I hadn't left a tip (which I always do because I spent many years waiting tables and I understand), it leaves me with a negative experience when a waiter asks for a tip. Bad manners. I told him I already left him a small one. He apologized but it was too late. He could've offered to hold the door as I struggled to get the stroller out into the windy cold winter day.  Lost one star for that waiter's poor etiquette.", "author": "Meechu C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-10", "description": "Freshest pitas this side of the globe!  Everything is homemade, the staff is always friendly and the delivery is pretty fast.  So far I've had the falafel, grilled chicken and leg of lamb sandwich.  All delicious and not oily but full of flavor.", "author": "Louisa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-30", "description": "oh, sweet Fortune, to have a place like this a block from my sister's apartment.  had no idea what i was getting myself into.  simply put, this place has the best pita i've ever had, and until this, i had never really realized how much difference the pita can make for mediterranean food.  i have since gone back 4 times now, and i get the spinach and cheese pie EVERY TIME.\n\na lot of regulars, i've noticed, which is always a good sign.  the staff is amicable and accommodating (aside from not accepting credit card).  if a place like Beduin Tent were a block from me back home in Philly, i would seriously eat there every day.  i write this with a completely serious face.  seriously.", "author": "Johaun C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-10", "description": "this place is good but the falafels werent good.  pitas and lamb pitza are amazing, hummus was good but kind of a small serving.", "author": "Salvatore C."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}