{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "I go here for lunch about once a week, sometimes twice. I haven't had a bad experience yet, their food is always good, always fresh, and they have some good options if you want something healthy. I've tried almost everything on the menu at some point, I usually get a lentil soup or the garden salad, both are great. Their homemade pitas are so soft and chewy, I eat them slowly so they last longer. Prices are very reasonable, $4.50 for a falafel sandwich, you can't beat it. In the summer they have a nice outdoor spot in the back too. Overall if you haven't tried this place give it a shot, you won't be disappointed.", "author": "Victoria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-08", "description": "One of my favorite places to eat in NY! They have the best Pita Bread I've ever had, and prices are very reasonable. The Service is top notch with staff who are always friendly.", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-30", "description": "First thing I'd like to say is the previous reviewer, Jay W and his one review is a jerk off in my humble opinion. The combo appetizer plate is fantastic, 5 choices of delicious, fresh, healthy apps. for $9, perfect starter for two. The pizzas are good and varied, the chicken sandwich is my favorite ( get their homemade hot sauce on the side, but be careful ) falafel is solid and the pita is made to order and hot as hell. The owners and the service are as good as it gets. So take it from the majority and give it a try you want be disappointed. And did I mention it's BYOB.", "author": "Andrew G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-25", "description": "Their Za'atar bread is the best I have ever eaten in my life. No joke.", "author": "Ted G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-25", "description": "Ordered take away. Food arrived quickly. Lamb was great but chicken was a bit dry the hummus was great thou and very friendly phone service", "author": "NYC D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "a real meal rolled into a delicious, delicate, hot steaming FALAFEL - It is so good! The guys who work behind the counter are a hoot, too.  Jolly and kind. The best thing though? The smokey house made babaganoush!", "author": "monte b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-10", "description": "LOVE the freshly baked pita - as a wrap for some pretty darn good falafel, or as the crust for some tasty pizza.  Plus the prices are decent, so sometimes I forget-on-purpose to pack a lunch for work.", "author": "Rebecca E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "Delicious homemade pita, very friendly service, and the food is reliably tasty.  It's not extravagant or unique or anything, but it's always good and there are good options--veggie, chicken, lamb, etc.  I don't love their special pizzas, but the sandwiches and platters are great.  The one problem: no alcohol.  None served, no BYOB.", "author": "John R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "I've eaten here several times. The falafel isn't amazing, but it is tasty. I'd opt for the sandwich over the platter since the falafel portion seems similar and the quantitative difference is mostly on the side vegetables and other accompanying side attractions. The place has a really comfortable, home feel to it and the staff is accommodating and to the point in order to get you the best service (which is usually fast here). Why then give this place four instead of three stars? The pita bread. Sometimes one can neglect to give the simple things the attention that they deserve. This is one of the times where you are baffled by an every day thing being of extraordinary quality. The freshest, most delicious pita bread I have ever had. If I lived in the neighborhood I would come down daily and buy an order of pita bread for breakfast/lunch. Believe the hype, it is THAT good.", "author": "Gustavo J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "Best Lebanese/middle eastern in the area hands down.  Fast, friendly service coupled with excellent, reasonably priced food.  Love the bread and the chicken platter!", "author": "Rocco G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-30", "description": "This was the perfect end to a not so perfect odyssey in Brooklyn. It all started when a couple of older LES hipsters decided to go to Brooklyn 3 days after the Blizzard of 2010 to see how the streets of Brooklyn were fairing and to eat Jamaican jerk chicken at The Islands. We rode the subways to Prospect Heights and found The Islands closed. No problem, we caught the subway to downtown Brooklyn looking for Miles End. They had run out of meat because of their booming business and we were once again out-of-luck, cranky and still hungry. My partner pulled out her trusty phone with the Yelp application that directed us to Bedouin Tent two blocks away. What a find!!! \n\nThe place looks like nothing from the outside. In fact, it doesn't look like much from the inside, but there are a couple of clues. They make their own pita. I have never been in a place the makes its own pita. One guy rolls it out, the other cooks it to order! It is a family run place that only takes cash - a very good sign. We were not disappointed. The pita is delicious. The baba gahnou is to die for. We had the lamb meriguez sandwich - perfect and filling. \n\nIt is not he cheapest Mediterranean food, but it is the best. I will be back to try the falafel!", "author": "RJ T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-23", "description": "The atmosphere inside is warm and intimate, and the outdoor patio is also delightful.  I went for a lunch date with a friend, had mint tea, amazing fresh pita bread, and a falafel sandwich.  Definitely delicious, filling, and affordable.  I would definitely return!", "author": "Ling W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-16", "description": "This place is awesome. The man who runs it and takes your orders is so nice, and I've tried a ton of stuff on the menu. All delicious. And cheap! We get it once/week, at least.", "author": "A M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-15", "description": "There is not a single bad thing I can possibly say about Bedouin Tent. I have eaten here about 8 times now and have never been disappointed. The pita pizzas are amazing! I've had the lambaji (sp?) and another one that included leeks and some other tasty flavors. The lamb sandwich is out of this world. The lamb is perfectly seasoned, tender, and juicy and all the other ingredients are fresh.\n       I'm from Texas and can't resist handmade tortillas. Now I'm living in Brooklyn and can't resist handmade pitas. Although occasionally parts of the pita are a little too crisp this is only occasional and not consistent.\n       I almost didn't want to write this review because I didn't want more people to find this place, wanting to keep it a secret amongst the locals but these people deserve their due.\n       If you're looking for fresh ingredients, incredible food, cheap prices, and kind service then this is your place.", "author": "Carlo S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "Very cheap and delicious.  The pita bread is amazing.  And man...do I love their pitza, which I usually get with merguez on it.  The merguez is super savory, spicy, and generally awesome.  It goes really well with the pitza, although unfortunately, the pitza ends up being a bit oily as a result.  Oh and let's just say, if you have a boyfriend or girlfriend and you have one of these...I would feel sorry for them a few hours later haha.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "Love it! And we didn't even eat yet..you can just get a good vibe walking into this place! Everyone is friendly and looks happy to be here. My stomach is rumbling...", "author": "Nevar P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-02", "description": "yummy yummy!\nhad the five combo appetizer of hummus, grape leaves, chick pea salad, babaganoush, and tabouleh and each one was SO good!\neven the zaatar bread was bangin.\nfreshest pita!!!!!! doughy and light and so so soft\ncheap and quick.\nadorable outside patio.\n\nwalked by the baklava on the way out. so tempting! next time.", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-25", "description": "I've been frequenting Bedouin Tent on a semi-regular basis for over 7 years, and I love it.\n\nFRESH, FRESH, FRESH food and pita made to order.\n\nSeveral years ago they renovated the back patio and it was a great decision. The service is quick and they are incredibly friendly. \n\nThey are so consistently good after all these years. I've eaten at other Egyptian places in Brooklyn (Tut Cafe In Brooklyn Heights and Olive Vine on 7th, to name a few) and they are miserable by comparison. \n\nDefinitely share a baklava with your dinner companion.", "author": "Joy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-19", "description": "Falafel runs bountiful and plenty around these parts; however, I am not accustomed to most.  Call me spoiled, but I prefer a lightly crisp croquette with a creamy texture inside.  I was introduced to this hybrid at a magical place called Pita House (Greenville, SC).  Unfortunately I have not found another falafel of Pita House's caliber, but Bedouin Tent comes close.  They expertly season everything and have been around for 13 years.  The restaurant review on the back of the menu declares, \"...abounds with hospitality like the wondering desert people...Arabian music and instant offer of mint tea make you feel as welcome entering some one colorful plush home.\"  Hmm...last time I dined in, my boyfriend and I had to endure the same Enrique Iglesias song on repeat FIVE TIMES...\r\nBack to the falafel conundrum, most falafel around the city is too dry and crumbly.  Their's has a grainy texture and a perfectly crisp outer crust.  You will enjoy all the delights Bedouin has to offer-especially if you aren't too freaked out by the resident cat that slinks around the place (take out anyone?).   Plus, it's CHEAP and very fresh!  Certain entrees come with a just baked pita.  If you dine in, it is presented in puffed balloon form.  Perfect for stuffing with the excellent, creamy Babaghanouj.  The individual PITZAs (get it? ha!) are killer-I have yet to find a place that rivals their specialty.  The classic pitza is delectable on it's own; however, they offer special varieties that include ingredients like Lamb, leeks, shrimp, and assorted veggies.  Spinach pie is also one to try.  It's baked like a calzone and stuffed with mozzarella and spinach.  Typical legume, parsley and spinach based salads are available as well as soups.  I recommend the vegetarian tomato-based Harira soup-chickpeas, parsley, cilantro, and spices.  If you're feeling decadent, give the Basbousa (semolina cake made w/yogurt, drizzled w/honey) a whirl.  If you dine in, they may just give you a couple of complimentary cubes of this.  Especially if you're a female....!", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-06", "description": "I've been to a bunch of the many Middle Eastern restaurants on Atlantic Avenue in Cobble Hill/Boerum Hill Brooklyn and after each meal I find myself coming back to the same realization: Bedouin Tent is the best.  The fresh, hot-out-of-the oven pita bread sets this place apart from the rest.  My one complaint is that last time I was there, they rushed us out as closing time approached.   Other than that, I have no complaints- service is fast and friendly and there's no corkage fee (it's BYOB).   If you come in the summer you should sit outside in the back garden.", "author": "Jeanne E."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}