{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-18", "description": "the pita is terrific: warm and fluffy. the falafel is good. the merguez is spicy and tasty. the dolmathes are fine.", "author": "Jason S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-01", "description": "Perhaps the best value restaurant in New York.  Very high in terms of authenticity - clearly they're not faking it as so many \"meditaranean\" restaurants in NYC are wont to do.  The quality of the food is extremely high and the prices are more than reasonable.  Add fast service and how can you complain?", "author": "Ed M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-25", "description": "This place has great fresh-baked pita.  The chicken sandwich is great and the hummus is excellent, though a bit oily for my taste.", "author": "Jon F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-19", "description": "Been there a couple of times for lunch-to-go. It's alright. They cook the stuffing for your pita bread right in the brick oven. Nice 'wrap' for a light lunch. The staff members are friendly. Great spot at the back of the restaurant.", "author": "Fork U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-25", "description": "The cheese and tomato pizza is pretty large for a personal-sized pie and the pita is perfect. Couple the great food with incredibly friendly service, and I've got a new favorite in Boerum Hill. For about seven bucks I got a huge personal pizza and piping hot order of pita bread. Sure, it's not the healthiest or well-balanced of dinners, but I was just visiting the area and needed something filling and fast.", "author": "R C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-23", "description": "been coming back here for 10+ years because of the great food \u0026 nice people (before they had outdoor seating \u0026 a cat that would gravitate towards me, the nonkitty type).  chicken pitza, lentil soup \u0026 basbousa rock.  i heart bedouin tent.", "author": "M R."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}