{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "Omg this place is amazing,guys!!!!\nAfter I walked in - I got drawn away,somewhere close to my childhood dreams and fairytales about Morocco or ancient Arabia.... The food feels so natural and authentic at one,and of course it's delicious!  I felt like that old restaurant critic from ratatouille cartoon))) \nHighly recommending this place !!;)", "author": "Olha B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-13", "description": "I wish I knew their pita recipe because it is hands-down excellent. The food is fresh and has that homemade flavor that tastes like love.  The staff are welcoming but they kick up the notch of friendly when you speak their language. \n\nThe entryway looks tiny but the smells emanating from the kitchen make you come back to take a second look. The printed menu is outside and then you walk in to realize there is a lot of space in the rear of the restaurant. Takeout orders are placed at the counter but waltz right in for dining in. \n\nThe lamb is always my main go-to.  The serving portion here is generous and I recommend that you get a side of sauce. The lamb is not seasoned so you will want something to make it pop. \n\nIt didn't blow me away but it didn't scare me off either. Give it a shot. Dine in and enjoy their decor and hospitality but be sure to bring CASH!", "author": "Mardory V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-11", "description": "Found this place on a rainy Sunday afternoon. \n\nLovely decor- felt like I was actually in a tent. Though I did not like how the backyard looked- was filled with plastic chairs and disheveled furniture.\n\nThe price at this place was reasonable. Staff were friendly and the food came within 15 minutes.\n\nI ordered a falafel wrap. The falafels were good. They are bigger then what I was used to. The wrap itself was delicious. \n\nI would recommend this place for a quick dinner or lunch.", "author": "Shruthi R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-06", "description": "Cash only but I love coming here for their garlic bread and spinach and cheese pie. It's very yummy tasting and worth the need to find an atm if you don't carry cash often. It all taste very authentic and baked fresh!", "author": "Tracy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-05", "description": "A very unique experience with great food. We walked over after a hockey game at the Barclay center and enjoyed a family friendly meal at a reasonable price. The service and food were good and the restaurant was quaint deco. Worth trying and I suspect a great place for regular take-out. Enjoy!", "author": "Denzil D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-22", "description": "I don't remember a middle eastern place where they didn't serve RICE!! The chicken and lamb were dry and a small portion. Salad had what seemed like whole onions the cuts we're so big!! Someone forgot to cut them. \n\nBread was good, used to be great. Customer service... Not so good. Price is ok but not worth it.", "author": "John A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-06", "description": "The restaurant has spacious seating area inside and in their patio. With the traditional cloth hangings that have art sewn, the place definitely feels like a middle eastern relaxed cafe. Service is good, the staff are very attentive. Prices are great but they only accept cash. \n\nWe ordered the chicken shish kabob plate and the lamb plate. The bread that accompanies was not the traditional middle eastern pita bread, rather a naan-like bread (reminded me of Indian naan). Each plate came with salad (lots of it!), an option between baba ghanoush or hummus, and one bread. I think the salad took up most of the plate, could have given more space for the hummus or the meat. Also, I wasn't a fan of the bread. The baba ghanoush and hummus were decent, the salad was fresh, but the chicken could have been better. The seasoning/marinade in the chicken was lacking much taste and it wasn't grilled either (rather sauteed or roasted?). Also, their sauce didn't have any kick to it. \n\nOverall, it was okay. But the chicken, bread and sauce could be better.", "author": "Taiba Sheerin A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "I ordered a chicken pita and received a 14in vessel. It's definitely an amazing value at $8.\n\nThere are so many great things about this sandwich, but also so many things I would change. As mentioned, the sandwich itself was very well priced. Calling this bread 'pita' is a stretch, but it's definitely delicious, freshly baked, and doughy. Maybe too doughy though, it was pretty much undercooked. It was also really thin but unsturdy since it was so long, making it difficult to eat. The chicken inside was ok, the texture could have been better. Loved the hot sauce. \n\nI see the potential for this sandwich! And I will be back.", "author": "Katey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "Really good falafel sandwich, but I feel it needs something besides lettuce, tomato, and tahini sauce. Maybe pickled something? The pita was freshly made, and the real star of this sandwich.", "author": "Nadia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Ordered the five salad sampler, which comes with pita. The pita is the big draw here. It's made in house and the flavor and texture are mind-blowing. Don't skip the pita!\n\nThe baba ganoush was outstanding as were the grape leaves. Lebneh was rich and creamy and great for dipping the grape leaves and pita. The hummus and tabouli were below par, though. The hummus was starchy and relatively flavorless. The tabouli was crunchy and a bit rough with not enough salt or acid. I felt both were missing critical ingredients. The chick pea salad wasn't doing it for me either, but nothing was particularly off about it. Next time I would probably try some other menu items. \n\nOverall, this is very solid and works well as take out. I think after a few more visits I would be able to parse through their offerings and map out their specialities. Right now the baba ganoush and fresh pita bread are my favorites.", "author": "GT W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-23", "description": "Got the sampler and falafel platter.\nSampler not bad --didn't like all the beans.\nPicked one that said spinach and chickpea but it was more like all chickpea n hardly any spinach...I was expecting more spinach since that was the first word in the order of the dish --spinach and chickpea \nThe rest of the sampler was alright --love the babaganaush, humus, the fresh naan like bread.\nThe falafel platter was good-- they give some salad n sauce n your choice of babaganush or humus with it.\nFalafel was good size but bit dry, but guess that's why u get the sauce :-) overall fresh food n pretty filling", "author": "Lynie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "A wrap of joy freshly made! \n \nOrdered the falafel wrap and it was so worth it !! Freshly made dough flattened out and thrown into the toasty oven. Poof! It's huge and rose high up! Now add some hummus and delicious falafel with lettuce and tomato in there! All rolled up and huge portion! Magnificent ! \n\nWe will be back! Cash only!", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-05", "description": "I really like their falafel, and their pita is amazing, and they use excellent lettuce \u0026 tomatoes in their salad, but, honestly, their leg of lamb \u0026 also their chicken \u0026 also their baba ghanoush \u0026 also their hummus are disappointing. And since their prices have gone up a couple bucks in the past couple of years (AND IT'S CASH ONLY), overall, I really find it both undesirable and inconvenient, sad to say...", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-18", "description": "this place is great! I came here after work to meet a friend and i was very pleased! I felt at home \u0026 this definitely felt like comfort food. Felt homemade, it was delicious \u0026 inexpensive . Sort of felt like i was at a friends house for dinner. We ordered the roast lamb and the spicy lamb sausage plates \u0026 a spinach \u0026 cheese pie. I loveeeeddd the spicy lamb sausage!! It was so flavorful. Our dishes came with made to order pita bread which was probably my favorite part! It also came with hummus which i thought was fine. The spinach \u0026 cheese pie needed a little salt for my taste \u0026 the spinach inside gave off a frozen vibe rather than fresh but i didn't mind, minor details. Overall I'll definitely be coming back here for middle eastern food ! Seemed super authentic!\n-@francescas_feasts", "author": "Francesca T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "I have been going to this place for the past 10 years. Food always tastes as amazing as the first time. The Labne with the Zaatar pizza is soooo good and their falafel wraps are some of the best in NY. Their bread is made fresh as is pizza dough. Def try this spot if you're in the area. Staff ate super nice too. \nNote, its cash only but they do have an ATM.", "author": "Nancy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Bedouin Tent is a little unassuming from the street, but don't let that stop you from coming in and ordering some of their incredible food.\n\nI've eaten in their casual back dining room and have done take out from here. Neither disappointed. The food is just so good! Personally I prefer either the falafel or chicken wraps. They're the best I've had anywhere! Also be sure to get some hummus too or maybe the spinach and chickpea side...delicious!\n\nReally though as good as everything on the menu is, the real star of the show is the pita. As you walk in you'll see if being made in house by hand. They make it as it's ordered so when it gets to you it's perfectly warm and chewy. The pita is really what sets this place apart!\n\nTake note that Bedouin Tent is cash only. Definitely stop by next time you get a middle eastern craving or are in the area!", "author": "Liane C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "I love coming here. Service is fast and the food is extra fresh. The pitas are made as you order them and the staff is very friendly!", "author": "Marley M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "What an experience and a unique take on the middle east, right here in Brooklyn. It has a very small, quaint dining area. However, it also has an outdoor patio - which I'm willing to bet creates an amazing atmosphere in the warmer months. I decided on the chicken plate, my friend a lamb plate and both were delicious and the homemade hummus is to die for. We also tried the citrus drink, against the recommendation of our server. He said it wasn't good. We tired it anyway and loved it. It was really citrus-y and made for a good supplement to our pita, salad and chicken. I'd recommend this hidden gem to anyone. There is to-go but to sit there and eat is an experience all on its own. \n\nPRO TIP: The arabesque that hangs in the dining room area is perfect for photo-ops.", "author": "Brandon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Oh how did it took so long to write this. This has been one of my two go to spot for Mediterranean food in NYC because if their food, service and price. \n\nFood quality is out fresh and delicious which probably the only things you needed to make it outstanding. We usually order sun-dried tomato pizza, definitely their salad mix and a meat or veggie entree to share. Btw that is for  two people and it is plenty and filling. Mix salad you can pick 5 items and I suggest beet and grapeleaves roll. Hummus usually comes with your entree. Sun dried tomato pizza can be a hit or miss because they over cooked mine once but no big deal as burn cheese is heavenly. You definitely need to try other pizza as well such as lamb. Their cheese and spinach roll is always a thing I love to order but I place it at top 4th. I usually get one if I have friends joining us. Entree I would go for their lamb dish or chichen rice wrap up in a naan (ask them for the name). \n\nPrice has went up a bit over the time but usually cheaper than most places in the area except McDonald's. For a table of 2, you can walk away with a full belly and weight $40 less. Usually most dishes go for $10 to $14 thou. Btw they don't serve alcohol and bybo isn't an option anymore. But do call them to confirm. \n\nService can change if busy or not. Usually takes around 5 minutes to get your orders in and about another 10 for food to be served. You should be voice your need as they can be busy. Seating is limited to around 20 inside and outdoor is summer only. Backyard is lovely but can be some mosquito like everywhere else. I probably get one bite every time I am there in the back yard. \n\nDo give this a try if you are near by. It's a vegetarian heaven btw", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-15", "description": "Meat isn't halal but their veggie options are very good.\n\nYou get a lot of food for a very good price and they keep the bread coming!", "author": "Marina F."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}