{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "Incredible food for a great price!!!\n\nCustomer service was less than stellar why there are 4 stars. Our server was annoyed when we asked questions and would respond with one or two words. I'm sure he was tapping his foot he was that inpatient. \n\nFood overcompensated for the lack of service, so I will be returning.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "Great staff, cooks, inviting atmosphere and the food was amazingly delicious for the price. I will definitely be coming back here!", "author": "Mark D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "Very quaint atmosphere, AMAZING baba ganoush, and the falafel was delicious! I got the assorted salad plate ($11) and I was STUFFED! All the veggies were extremely fresh too. Definitely recommend if you're in Brooklyn.", "author": "Nancy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "great middle eastern restaurant with an array of wonderful veggie options. very casual, however.", "author": "David C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-04", "description": "Great food but horrible service. Especially the Asian server. If you don't mind the terrible customer service then it's decent since it's the only Mediterranean joint in the area.", "author": "vinod v."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "The falafel, the babaghanouj, the naan, everything is so good. the whole falafel plate cost 7.50 total! The service was really good and there was a complimentary bite of cake at the end! I recommend it. They don't accept cards so be sure to have cash.", "author": "Lisa J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "Great place with good food but not fancy.  And the backyard is very comfortable... a great place to have lunch with toddlers.", "author": "Katy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-08", "description": "Bedouin Tent has the best \"Pitzas\" anywhere! Came here to have a late night dinner and plus I was craving some good hummus. When the waiter approached us, we asked what he recommends. He told us they are known for their Pitzas and that they are all really good. No kidding, since when you walk in, there's a man making fresh pita bread. Done deal. We decided to get two, of course my favorite, the \"lahmbajin\" and we asked what was his favorite. He told us that his favorite was grilled chicken, kalamata olives, and cheese but it was not on the menu. He told us that they can make still make it for us anyway. Sold! \n\nWhen the Pitzas came out, they were super hot and the smell was intoxicating. The smell of the spices that came from my \"lahmbajin\" was amazing. The minced up lamb mixed with middle eastern spices and onions spread across fresh baked pita and then baked. Yum yum. It was so good. Best yet. But the chicken, olives, and cheese that the waiter had suggested, omg!!!! He hit it right on the spot. The combination was delicious. The cheese was gooey and bubbling, the kalamata olives were tangy and fresh, and the chicken was still moist. I'm definitely hooked. \n\nBedouin Tent also offers other middle eastern goodies, but they are definitely known for their Pitzas. They also have many different varieties to choose from. Since the Pitza that was suggested to us was not on the menu, they may give you a look and say we don't make that,  just give them a little hassle and they'll do it. I called once to order it, and they guy on the phone who I believe suggested it had said \"who told you about that?\" Lol. \n\nThe food is good, the staff is always really nice, and I love the traditional middle eastern decor of the restaurant. The only thing I give a thumbs down to is, I recently called to order and they had told me they don't deliver this far, which I found odd since they have many times before. I'm not sure if it were just an off day or they changed their route but it is upsetting! Lol. That doesnt change anything I still love their food and will contintue to eat it. :-)", "author": "Nicole R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "I've been back a couple of times since my first review. It is a solid affordable and delicious option for Middle eastern food in downtown BK.", "author": "Drex H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-06", "description": "Love this Place, they have really good Middle Eastern \"PITzas\", I have visited them once for a sit down dinner, but I mostly order Delivery-Take out from them. \n\nI love their Ptzas, made fresh to order, the dough/crust is freshly baked each and every time, made with Fresh Middle Eastern ingredients such as Lamb and fresh olives (not that canned stuff), you can really taste the freshness, it tastes nothing like your typical NYC Pizza.\n\nI recommend you adding cheese to your Pitza order since some of the Pitza menu options do not come with cheese, it makes all the difference in the world, trust me.\n\nDeeee-lish.", "author": "Leo L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "So glad to have found this place. Stopped in for lunch and had a falafel plate with freshly made pita. The pita was incredible,  puffy and warm. The falafel plate with a side salad \u0026 hummus was delicious. My only criticism is that the plate came with 4 falafel balls not 5, hence my rating of 4 stars. This place is a short walk from Barclay Center,  so consider it a dining option before or after an event.", "author": "Dave A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-17", "description": "Ordered in from this location to the office. The Falaffel was very good, however. They have changed their menu. They no longer provide carmalized onions or yougurt sauce for the lentil bulgar. So it's near ineditable. When you call them about the change vs the menu you are given, they promptly hang up.\n\nI'll order from Black Iris next time. Much better and more people friendly.", "author": "David E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-20", "description": "Fun times include chilling with friends in the back patio with some pita and hummus.\n\nTheir lamb sandwich and soups are absolutely delicious as well.\n\nCASH ONLY. \n\n+1 huge portions (that's what she said)", "author": "Will C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-09", "description": "Did take-out last night for 6 people, all food was good except the Chicken Ouzi, which is one of their specials for $13. Unfortunately it was a pound of rice with no chicken in sight.\n\nBut don't hesitate to try the other dishes.", "author": "Manny T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-16", "description": "I was really excited to try their Falafel sandwich, but I was really disappointed. Almost no vegetables, way to much sauce and it had a weird aftertaste. I liked the place though and the people were nice. I've tried so many Falafels in New York City and this is one of the worst I've had so far.", "author": "Henrik N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "Stumbled upon this place by chance first time and had their wonderful pizza for take away. Despite only being in New York for 2 weeks and stay in in Manhattan, we have made the trip back to this lovely establishment to eat in. The service is lovely, highly recommend the lemon chicken pizza and the falafel! Great place!", "author": "Barbak Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-23", "description": "I heard the place was good but for some reason I wasn't really feeling it when I walked in.  I was in a rush b/c I had to go to the airport in a little and it felt like the food was taking forever (probably actually 10 minutes) but then when I got home and ate my fresh pita with chicken plate, it was undeniably delicious.  Will definitely be going again.  The end.", "author": "Christine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "The labneh and baba ghanoush were fantastic and the pita was fresh-baked and amazing! The falafel was a bit disappointing (fried earlier and then warmed over, so not crispy on the outside and kind of dry inside) but it was later in the evening so maybe it's better earlier in the day. Nice ambiance and good location! Will come back to try the chicken :)", "author": "Faith R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-04", "description": "Not the best Falafel around - though not bad by any means- but the baba plus freshly baked pillowy bread  is amazing.  Perfectly spiced, smokey and creamy.  Who knew veggies could taste this good?", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "Had lunch with a friend there. The falafel plate is really great. Crispy falafel, smooth hummus, fresh salad and most importantly freshly made warm pita bread. Would like to go back.", "author": "Qian Z."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}