{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "BEST EVER! relaxing back patio, fresh pita, delicious falafel. Every salad is fresh, verdant and plentiful. The staff is awesome. The prices are beyond reasonable for the quality of food you get. The hummus is smooth and perfectly seasoned. They don't serve alcohol, but call ahead they do allow BYOB sometimes...", "author": "Wilkie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "3 stars for the food + 1 star for the overall ambience. We ordered the falafel plate: delicious falafels fried to perfection, excellent hummus, fresh salad and great tahini sauce (though I wish it were a little tangier); the harira: which possibly tasted extra awesome on a cool, rainy day - LOVED the flavours which were mild with a bit of an extra kick; and the vegetable pitza, which was a little meh but the mozzarella cheese was on point - beautifully chewy with a strong, freshly made scent. \n\nP.S. It was my mum's first time eating Middle Eastern food and she wishes to revisit sometime soon:)", "author": "Tara T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-20", "description": "We were at BAM for a ballet and were looking for cheap options to eat nearby. And with some help from Yelp, we found this little gem.\n\nOur order: the five-salad combo ($10), the lamb-shank plate (with baba ghanoush $12.50) and the lambajin (minced lamb pizza, $8).\n\nEach dish was excellent. The salad was a mixture of chickpeas, potatoes and beets tossed in olive oil and spices and were fresh and delightful.\n\nThe slices of lamb shank were the most flavorful pieces of red meat I have tasted in quite some time. The perfect amount of spice - did not overpower the meaty flavor.\n\nAnd the Lambajin, wow! I grew up in India where minced lamb with spices was a delicacy and boy did the chef get the combination right. And the pizza crust was as good as the best pizzerias in NYC. Soft in the middle, but just firm enough to support the meat with crispy goodness on the edges. Full-blown nostalgia on a plate, exquisite.\n\nService was nice, everyone was smiling and polite. Keep up the great work guys!\n\nI would be a regular if I was anywhere close to Brooklyn. I do plan to update the post once I try other things on the menu. Tough to see it disappointing.", "author": "Akhil B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "We got lunch takeout and walked over to pick it up. The place looked like a complete dump, bu when we got back to our friend's house, the food was superb!  We got a variety of typical middle eastern take-out dishes and liked everything.  The flat bread/pita topped with zatar was probably the favorite, though.  Recommended.", "author": "Mark O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "Their outdoor garden is to be enjoyed during lunch on a beautiful day. Have tried various items on the menu, lamb sandwich is always a good bet. Their baklava is decent and I enjoy their coffee. Similar to Moustache in the west village (which I prefer), but this is one of my favorite casual bites in the hood.", "author": "Jade D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "no delivery to gowanus/park slope- thats ok. its worth it to make the trip! Their food adds meaning to my life.", "author": "Jingmin Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-13", "description": "I wanted to see if their hummus was any good, and had also read the rave reviews about their pita. It's also really close to my apt so even though I REALLY wanted the hummus from Beyoglu, we came here instead.\n\n I ordered the falafel plate with hummus.\n\nBland, bland, and bland. Disappointment. At least the salad was fresh. The peanut sauce thing tasted funny, the hummus really had no flavor. I kept wanting to add lemon or something to give it SOME kind of flavor, and ended up sprinkling some salt and pepper on it.\n\nMy sis got the chicken pitza, which was just okay. The mint tea was refreshing, and I liked that there was no wait and the A/C was blasting. The little cornbread honey cake at the end was good, but I probably will not be coming back. \n\nBeyoglu, if only you weren't all the way in the UES!", "author": "Stacey P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-11", "description": "I wish yelp would give zero stars.\n\nThe start of my problem was that I found a dead fly in my salad. This is something that happens, not a huge deal, but what happened after that is something I've never encountered before.\n\nI showed my plate with the fly to my server to ask for a new one. The server apologized and took away the plate. To my surprise, he came back to me with another guy, perhaps the manager, and brought the plate BACK TO MY FACE, arguing to me that the black creature with legs and wings was NOT a fly, and that it was parsley!\n\nMy coworkers and I couldn't believe the situation and said, IT'S A FLY, BECAUSE IT IS! \n\nAnd then this person took the piece of onion with the fly on from my plate, and ATE IT in front of us!!! He looked straight at me while chewing it, smiling and saying \"SEE? IT'S OKAY, IT'S PARSLEY!\". \n\nBy this point, my friends and I were both dumbfounded and furious. Luckily the chef came into the room, also angry (of course!) told him to stop as even he saw the fly and agreed that yes, IT WAS INDEED A FLY. He then apologized and got me a new salad, but what a horrible experience.\n\nThe owners of the restaurant needs to check their staff. What would the board of heath do to this restaurant if it new that its staff were trying to convince customers to eat food that had bugs in it?\n\nUNBELIEVABLE", "author": "H Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-21", "description": "I've been coming here for years, and the messy waiter I mentioned in my older review is long gone. The reliability of these quick and tasty meals still continues to satisfy. I've introduced numerous friends to this restaurant, and they have been impressed with its flavorful and abundant portions. As a vegan, there always are enough options to choose from. The combination salad platter which allows you to choose about 4 or 5 salad items is a real bargain.", "author": "High Standard S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-01", "description": "I eat at this place for almost two years, it was inexpensive and I actually liked the food... Until one day I noticed it was shut for hygiene reasons! The other reviews about rats and cochroaches apparently were truthful!", "author": "Alberto G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-26", "description": "This place is INCREDIBLE.  My boyfriend and I were walking around for miles on Christmas Eve day trying to find a spot to eat.  We stumbled upon this place and were blown away by the STELLAR SERVICE and AMAZING FOOD.  Perfect experience.  Food came rapidly and was super fresh and hot.  We shared the lentil soup (which was genius) and I ordered the chicken plate -- DREAMS.  The complimentary almond cake at the end was HEAVEN.  Love this spot -- will definitely return.  (And the employees here are SO nice!)", "author": "Carrot Cake R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "The best Mediterranean food in downtown Brooklyn.\nThe decor is bit rustic \u0026 its a cash only place but the bread is fresh, food authentic \u0026 too good.\nWent with a big group for lunch \u0026 all of us came back groaning after running through the menu. Its difficult to work after a lunch like that.", "author": "Vinny M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "I really got lucky when trying this place. When we first walked in, it was so warm and the smell of zaatar was really strong- in a good way. The seating space is a little small, but luckily they had room for us. \nWe ordered the zaatar pita, which was WAY too strong with the zaatar. The reason why I got it was because my dad used to make his own olive oil/zaatar mix as I was growing up, but this stuff was way too intense. We also had the chicken kebab, which was slammin. It was so good, the chicken was spiced well and moist and the techina was really fresh and tasty. We also had the lambajin, or lamb pizza, which was also really delicious. \nThe entire meal was really good, and I remember it being somewhat cheap, but they lose a star for service - it was really, really hard to get our servers attention. Other than that, I'm totally going back.", "author": "Heather C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "forewarning: the back patio (however wonderful it may be to sit outside), has a lot of hungry mosquitos.\n\nAside from that less fun note, the food at Bedouin Tent is very well done. We all got a falafel plate which will absolutely fill you up for $7. The pita bread is freshly baked and delicious. It's soft at first and then gets a little flaky and hard after some time. The baba, hummus, and falafel were all tasty.\n\nI decided to get the baklava after our meal even though I was beyond full. It was so very good. Mostly philo dough, honey, and cinnamon. You get two little nice-sized triangles for only $2.50. \n\nHighly recommended!!", "author": "Adrianne E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "I went once a year ago and it was soooo tastey, I loved it! I literally searched for quite a while trying to find this place because I didn't save the name. I'm so so happy I found it again :)", "author": "Destiny G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-06", "description": "Best falafel in town. The tahini sauce is delicious and the falafel is so fresh. The pita is chewy and doughy. The hummus is creamy and seasoned well. Plus the price is very appealing to your wallet. You will not be disappointed with this place.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-26", "description": "Christmas Eve. We had a struggle to find a nice place for food. We walked around for about an hour looking for a place and many were closed because of the holiday. Smith St is struggling apparently, many places boarded up out of business too. When we ventured onto Atlantic, I was starving and gf was getting hungry too. We saw this place and were like go go go!! Service was so warm and luckily so was restaurant because it was 20 degrees out. \n\nWe ordered and got the lentil soup two minutes later which rocked our frozen world and brought us back to life with this fluffy balloony pita bread that we housed in a matter of moments. A slice of lemon they put on the side really took the soup to the next level. She got the chicken plate and I got the chicken wrap. They flew out of the kitchen, service was fast as well. Chicken was extremely flavorful moist and deliciously fresh. We had an amazing time. \n\nThey brought these little almond cakes at the end and my gf ate both lol oh gf she is small but has a champion's appetite! Part of the reason I love her. Yes honey we'll try to exercise more and eat less in 2014, promise. We were both ripped in ridiculous shape when we moved in together, now we're both like 15 lbs heavier! But that's what you do when you're happy in love right? You go out to restaurants and blow money and celebrate life! And Bedouin Tent was a wonderful experience in our eating adventures.\n\nPlace was packed by the time we left. Check was ridiculously reasonably priced and we left thinking the world of these guys. Thanks for the awesome meal on christmas eve and thanks for being open!! We'll come back soon!", "author": "Argot B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "I like this place, both to eat in and for delivery. The staff is always attentive and polite, even on holidays or when it's busy. \n\nIn the winter months, I frequently order harira soup, which to me is one of the best things to turn a crummy winter day in to a fun evening. Strange but true. I also like the zaatar bread. \n\nThe salads are great, and I've been enjoying the option to get an \"assorted\" salad fro $9. This is a chance to mix and match five salad dishes. The pitzas are what this place is known for; they have a different style for each different mood or guest! Kind of cool. \n\nWhat makes this place special is the extras you can get: a \"Middle Eastern Citrus Drink\" (loomi), Turkish coffee, mint tea, and basbousa (delicious honey cake). These make it worth it to sit in the back for a long meal. \n\nThe only thing that stops this place from being 5 stars is the issue with liquor. Time was you could bring your own bottle there, and they stopped this policy and told us they were fined. I guess every byob place gets fined and you pay the fine and let your customers enjoy their wine. Here, you can no longer drink, which is a shame since the food goes well with friends and a bottle of wine. The only alternative is to get take out and bring it home, but then you miss the friendly staff and the ambiance.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "The mint tea was not as good as everyone made it out to be.\n\nThe citrus flavored drink (forgot what it was called) was more of an acquired taste. I would not get it again.\n\nBoyfriend liked his dish: chicken sandwich.\n\nI got the 5 plate salad dish. Was good. \n\nThis is a better lunch spot. Not so much dinner.\n\nI was eaten alive by the mosquitoes!", "author": "Anne C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-07", "description": "ROACHES. I ordered delivery and when I opened my the plastic Tupperware container with my lentil and bulgur salad in it, I nearly had a heart attack as there was a LIVE COCKROACH running around inside. I closed it back inside, took a deep breath and called up. When I calmly explained to them about the extra protein scampering in my salad, the guy actually said it \"probably was from my apartment.\" Rediculous. How could they even try to weasel out of something so gross.\nI am so glad for yelp so I can get this review to the public. They took back their filthy food and returned our money. I have boycotted all the restaurants in the vicinity because the thought of that live little guy just turns my stomach!", "author": "Wanda D."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}