{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "My favorite Middle Eastern food restaurant in America....... Love their zaatar pizza (I always ask for thin crust hehe), falafel sandwich, babaganoush and hummus!!!!! Yum!!!!!!", "author": "Nie Koon L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-30", "description": "Hidden gem in Brooklyn! Ordered lentil soup, leg of lamb platter and the salad platter. All of the food came out in a timely manner and looked and tasted delicious! Our orders came with fresh pita bread and we demolished everything! The food was ok but like WOW but I would definitely go back for more cheap eats. Dinner for 2 came out to be $40 including tax and tip =] cheers", "author": "Brian W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "As I was seated, an electronic remix of a Taylor Swift song played in the background. It set the mood for the evening, which was fabulous. This place is a great bang for your buck.  The hummus had the perfect balance, with a garlicky note that made me giddy. The lamb on the lamb leg plate was simply seasoned with pepper. It was a bit dry, but in all fairness, for the price, it was great. The Turkish coffee was well made, no grounds rising to the top, with a wonderful flavor. The pita, puffed up and bigger than the plate it was served on, was flavorfull and crispy. The harira soup was rich and hearty with a strong tomatoe flavor and whole chikpeas in it. The mint tea was divine, the loomi an interesting new drink for me. A light bite after a large meal, moist, with a subtle, just sweet enough flavour, The basbousa was the perfect end to the perfect evening.", "author": "Celia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "Really solid, delicious Middle Eastern restaurant. The prices were really affordable and the amount of food we got for what we paid made it a steal. \n\nThe food was equally excellent. My friend and I both got the chicken plate, which includes chicken, salad, hummus, and fresh pita. Cannot rave about that fresh pita bread enough--it came to us soft, warm, and absolutely flavorful. Some of the best pita we've had. \n\nThe ambiance is also so great, with Middle Eastern music playing in the background and beautiful quilts on the wall. Will definitely come back for the rest of the menu when I'm in the neighborhood in the future.", "author": "Nuzhat C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "This place is simply delicious and great value. There's a larger dining area and outdoor garden in the back, so don't be deceived by the tiny, unassuming storefront. It gets quite packed at nights, and for good reason!\n\nAlthough the service can be really rushed/spotty (and we once received a dirty fork), the food is worth it, especially the leg of lamb and falafel sandwiches. We've also tried the platters, but I think the sandwiches are much better. These aren't your ordinary sandwiches ... it's about 1.5x bigger, the pita bread is piping hot and fresh, and they're generous with the fillings. I just love it.\n\nWe tried the salad combo but were underwhelmed with the hummus and babaganoush. I liked the beets and spinach/chickpeas though. \n\nIf you're in a hurry, just get the falafel/lamb sandwich to go!", "author": "Valerie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "I LOVE the falafel here. They make their own pita, which is soft and delicious and the falafel is wrapped in the pita rather than stuffed into the pocket. I don't know why, but that just works so well! The proportion of the falafel balls to other items is perfect and the tahini sauce, tomatoes, and lettuce combo is yummy.\n\nThe turkish coffee is also excellent. A perfect way to end the meal. \n\nI adore this place and stop in whenever in town. It is perfect as a meal before a Nets game at the Barclay's Center, which is just a few blocks away.", "author": "Angela D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-19", "description": "I don't get the love for this place. Did I order the wrong thing? Just had bad luck with terrible service? What is it, Brooklyn?\n\nThe first time I went here, I was really excited because I had been meaning to try it and this one particular day, I was actually passing by and was hungry. Perfect.\n\nI go in, order a chicken pita sandwich and stood back and watched. The guy on the right (front of the restaurant), put a piece a fresh pita dough into the oven, and we both waited. I enjoyed watching him deftly work the pita dough. And of course, fresh pita takes a while to bake. And that was fine.\n\nThen he took it out of the oven, hot and fresh. Shouted at the guy to my left (a little further back of the restaurant) to complete my order. My hot and fresh pita was atop the oven, waiting for its final journey. And waited. And waited.\n\nThe guy to my left, was too busy laughing away with another guy who worked in the restaurant for a good...oh let's just be generous and say 3 minutes. And I was watching him the whole time. Amused because I'm standing right here, so there's no way he'd let me wait that long, right? Wrong. The pita guy even shouted at him an additional two more times before he finally grabs my now cooled pita over to his station and looks around.\n\nHe then shouts something back to the pita guy. Something to the effect of \"where's the chicken.\" And the pita guy goes \"what are you talking about, it's in your station\". To which point the chicken guy grabs the empty silver kitchen container and shows him, in effect that no, there is no chicken.\n\nSo the pita guy apologizes to me, and says it'll be a bit longer and puts the chicken in the oven. And I don't know how many of you guys know this, but chicken takes a while to cook, especially when they have cubed it in giant pieces and like they have here. So I waited another...ooh let's just say 5 minutes.\n\nAnd then the chicken was out. And the pita guy shouted to the chicken guy that it was ready and to complete my order first. So the chicken joined the now cold pita and was accompanied by some sad lettuce and sauce. And there was my sandwich.\n\nIt was as appetizing as I've made it sound. The chicken was bland, the lettuce was depressing and a bit out of place, and it was drowning in sauce that I can't say was good. And because I was hungry, I ate a good half of it before I could no longer force myself to, and threw the chicken and lettuce out (I felt really bad about it). I did however, like the pita, however cold it was. And you could tell that had everything gone according the plan, the pita would have been spectacular.\n\nSo a few weeks later as I'm walking home with giant bags of stuff from Home Depot, deciding what to eat, I remember that I have some left over indian food (vindaloo), but I need a vehicle for it. Because I was too lazy to make rice, and was carrying things, decided that since the indian place is a tad farther than Bedouin, I'll just get commit food/international blasphemy and get the pita from there.\n\nI triple checked the menu taped outside Bedouin that listed Fresh Pita at $1.00. I thought maybe I'd get two as well. Anything else on the menu that I would want? Hmm...nothing sounds appetizing. Pita it is.\n\nI go up to the cashier and order two pitas, and he says he can't do that. I just stared at him, at a loss. Like...what. It's listed on your menu. I indicated as such, and he says that's only if you order an entree. But it wasn't written anywhere that that had to be the case.\n\nSo I walked out as this thought ran in my mind: your pita is the best thing here, and you're not even going to sell me that? Why would I ever come here then?\n\nAnd that's my verdict on this place.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "I have all sorts of love for this place! \n\nGreat food! Great service! Great ambiance! If we are in the area and hungry, I always try to grab a bite here. :) Never a bad choice for either a sit in lunch on the adorable patio or a quick bite to grab and go.\n\nLove hanging out in the garden during the summers, the trees offer cooling shade from the heat and the umbrellas offer protection from the falling leaves. The seating is plastic lawn chairs so it's decent enough for an hour lunch. My parents loved this place and that's coming from restaurant folks! \n\nThe Meguez Plate is by far my favorite! They have freshly baked warm pitas brought to the table with your meal and it's lovely. This place really knows how to cook fresh and delicious! They also have this very refreshing mint tea to enjoy after your meal. Perfect touch!", "author": "Nahid D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "The food here was absolutely amazing! I will certainly return.\n\nI had entered before but left thinking this was just a small store front pita joint. Foolishly, I missed the whole beautiful back room! In the summer it looks like they have a great yard with outdoor seating!\nThe tapestry on the walls is beautiful and there is enough space between the tables.\n\nWe had the spinach pie because the one next to us looks delish -- and it was. Soft cheese and bread, well done but not soggy spinach. Mmmm.\n\nThe mixed salad plate was on the pricier ($10) end but totally worth it. So many flavors on one plate! Fun to mix them around -- and the mint yogurt was great on the other dishes.\n\nThe spicy lamb merguez was pretty good. It wasnt fatty at all and had nice flavor, but I thought the salad was where it was at.\n\nWe thought it was going to be BYOB based on some other reviews, but as of April 2015 it is not. No booze allowed. NO LONGER BYOB.\n\nI will totally go as a destination again but knock off a star for service. They rushed us pretty hard even before they had begun closing. Didn't understand the rush.\n\nOverall, highly recommended. Just don't go close to closing, drink first and remember to bring cash!", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-08", "description": "Been a while; returned tonight. Downgrading to 3 to 3-1/2 stars now but the food is good as before. \n\nWhy the reduction in stars?\n\n1. The service (even though it's the same waiter all these years) is not as good and as attentive. \n2. This place used to be cheap!! It used to be so cheap that we felt bad if we left less than 25% tip.  Prices have gone up to the point they are not cheap anymore for the quantity of the food. The price point is just about average for the plates now.", "author": "Jake S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "I had heard really good things about this restaurant from a co-worker at work, and was excited to try this place! After not being able to get here for about a year, I finally was able to visit a few weeks ago for date night.\n\nThe atmosphere of the restaurant is small and feels authentic with the décor and style of music playing. It had a very interesting vibe, almost like all of the pieces were uniquely picked out with care at a cool garage sale. One detail I cannot fail to mention, was that the place was FREEZING COLD. I really do not think the restaurant had heat, the cold was literally unbearable to the point that I wore my coat like a blanket and my toes were freezing cold for some time after leaving. It really ruined a lot of the experience for me.\n\nTo start, I ordered the harira soup which was absolutely delicious and helped keep my mind off of the cold. Truly so so sooooo good. It was very flavorful and filling, I think one bowl could have easily been my entire meal. We ordered hummus and baba- ghanoujh, both of which were probably among the best I have ever had. The pita here is HUGE, was sorry I couldn't fit an entire piece in a picture! We also tried a falafel platter, but did not enjoy it. The falafel was flavorless and very dry, so dry that it was hard to swallow so we each just had one. We split the chicken pitza which was good...but just good. I wouldn't say it was anything to rave or write home about. We also tried the lamb platter which we both felt was pretty ordinary as well. \n\nOverall, the majority of the food was good, but it was not special enough to make me want to go back. If in the area or asked to meet here for a meal, I would have NO hesitation, it was tasty. But, I would not go out of my way to come here. Not that it's a big deal, but we were never asked what we would like to drink and were just given water. Tasty and unique place, but not one of my top favorites. I think the chicken pitza was the winner and definitely the soup! ***CASH ONLY!*** Boyfriend had to run out in the cold to find an ATM! (Why do people still not accept cards?!?!)", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "Yum!  Large portions!  Ordered the garlic bread which is very strong on garlic but worth it!  I also had beet salad which came steamed and flavored with some spice that is not bad at all. My friend has the dolmades (grape leaves with rice) and the chicken ouzi.  Ouzi is a chicken and rice dish with almonds and raisins wrapped in phyllo dough with yogurt sauce on the side.  I had the falafel platter and loomi.  Loomi is a middle Eastern beverage made of sun-dried tomato. It was strong and soothing for my sore throat.  Overall, we had a pleasant time!", "author": "Polly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "GREAT food and VERY fast lunch service. Had the chicken platter, perfectly spiced. Also had the tabouleh. Also very good but I usually like more bulgur. Still a nice \u0026 cool dish on a very warm June afternoon. Best of all was their pita -- light \u0026 very tasty. \n\nHighly recommended for everyone!", "author": "Tom T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-17", "description": "Food was okay, but nothing particularly special. The only thing that really stood out was the pita and hummus. Very warm, fresh delicious pita and nice creamy hummus. Otherwise, both the falafel and merguez plates were just mediocre.\n\nWe sat in the back garden area which is quite cute however I was eaten alive by Mosquitos (not the restaurant's fault, of course) and somewhat grossed out when a mouse scampered by. Hopefully they are only outside in the back area and not inside!!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "I'm always craving their falafel sandwich. It's only $5.50 and made to order with their freshly baked pita bread. It's perfect for any day of the week, especially after a long hard day at work! It had the perfect balance of tahini sauce, lettuce, tomatoes and falafel. I wish they would put pickled anything in there but hey that's why I bought a bucket of pickled turnips elsewhere. Regardless, this is a delicious falafel sandwich!", "author": "Julesy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Affordable, quick, fresh and delicious. \n\nWe always get the hummus falafel sandwich (it's like a burrito with very balanced proportions) and the veggie pizza. All for $20.", "author": "Ash C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-24", "description": "I came here after the blizzard. The restaurant was cold and I had to wear my jacket. The backround music I found annoying at times because it sounded like a man whining in Arabic with instruments in the backround. The food, well what can I say.. I had tbe lamb merguez as an entree. They brought it out 5 minutes after I ordered it. The only hot thing I got was the pita bread which was made fresh. Everything else was obviously premade and cold (my lamb). I had the same dish at the Bedawi Cafe.. It was much better. I didn't finish the lamb cause honestly it wasn't very good and cold. The Hummus and salad were good.. but hard to go wrong with that. I had semolina cake for dessert. It was tasteless except the honey flavor it had. I need something more exciting than that. The Turkish Cafe again have had better elsewhere.. it was VERY bitter and I put lots of sugar inside. The waiter was nice though he agrued with me when I told him that I wanted to get a salad before the meal. He said let me bring your food and then you can decide if you want more. Honestly I was in the mood to try some authentic salads but when he said that I just said to myself forget it. The restaurant is clean but better looking in the back area where we sit than in the front where you first walk in. One more thing they DON'T accept credit cards.. HATE THAT!!", "author": "Andrea K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "came here for a lunch takeout. the place is reasonability priced. I got the chicken plate which was very filling. the chicken was cooked well and flavorful. the salad made me feel a little healthy and the hummus was normal. I loved that the pita was freshly made so it was nice and hot and tasted wonderful. Definitely some of the best pita I've had! I don't think i'll be getting the plate again since was a little too much food for a lunch. i don't really want to food coma at work and fall asleep ]: but for around 11$ what a good deal.\n\nI didn't get any falafel but i'll definitely be back for it. and i'll most likely get a sandwich since it'll have everything my heart desires without putting me into a food coma at work!\n\none thing to note though. i did try and ask for falafel on the side and basically the guy told me my total will be 15ish that TWO falafels will be 4$... that is almost the price of a falafel sandwich so i decided against that lol", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-29", "description": "Nice take out place.\nPortions are big and cheap.\nRecommend to split with your friend.\nNot super fancy but good for daily meal", "author": "Aki K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Great clean and fresh food.  Great prices and pretty cool atmosphere.  Will certainly be going back", "author": "Cam R."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}