{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Absolutely amazing! My friend and I ordered the Harira Soup, Zaatar Bread, the Lambajin and the Vegetable Pizza. Clearly, too much food for two people, but I can't complain about eating leftovers the next day. Everything was perfect. \nThe one thing I did not particularly like was the baklava, I've had a lot better. Even so, I plan to go back.", "author": "Taísa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "For some reason it was in the seventies and gorgeous this fall day. My friend I wanted to have lunch in a patio. She rarely ventures so it's up to me to kick it up a notch. I have been to Bedouin before and love the fact that they make pita on site, right when you walk in. \n\nWe got here and there was still a few tables available in the patio.  It's funny when you are in downtown Brooklyn, it depends which direction you walk and the neighborhood can change so much. \n\nWe each ordered the \"Falafel Plate\". The waiter asked if we wanted baba ghanoush or hummus. And I thought, why must I choose? They let us do a split. The plate came out and it looked amazing. There was a little drizzle of olive oil over the hummus and baba ghanoush. There was 4 good size falafel balls and there was even a salad. The pitas were huge and tasted so fresh! This was the perfect lunch spot to forget about being at work and enjoy the good things in life, delicious food and great company while enjoying the outside.", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-11", "description": "Cons:\n\nFalafel was dry..barely any tahini, almost bland. Overhyped imo. \n\nPros:  it was very filling, the pita was fresh and it didn't take long to make.", "author": "Lina R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-19", "description": "I don't know why this place is hyped up. Ive had better sandwiches and gyros. The pita itself was good, the chicken inside was dry and the so called \"Sandwich\" was falling apart, couldnt even bite it. Not worth the trip. I wouldnt reccomend this place to anyone.", "author": "Ariela Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Great food. \nGreat decor. \nFood s amazing. \nThe pizza was great .\nService was excellent. \nOutdoor sitting is so nice.", "author": "neil m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "I ordered the chicken plate with half baba ganoush and half hummus. The chicken was delicious and the pita bread was probably one of the best I have had in a while, crunchy on the outside but soft and fluffy on the inside. Both the baba ganoush and hummus were tasty but I thought it could have used a little more seasoning. My friend ordered the same meal and she really enjoyed it as well. \nWe also ordered a piece of baklava to share because it looks really delicious in the window. We weren't left disappointed because it tasted just as delicious as it looked, not too sweet with a light and flakey texture. \nThis place is relatively close by to my school so I can definitely see myself coming here more often.", "author": "Tiffany J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "WOOOOOOOOOOW. This has got to be the best falafels I have ever tasted!!!!! Today was a kind of day where I wanted to explore great restaurants but on a tight budget. I ordered their falafel sandwich which was one of the cheapest items on the menu of about $6-7. I didn't think anything of it but the size of this thing was the size of a chipotle burrito but skinnier. There was so much that I was able to only finish half of it. pita bread was hot, soft, and crispy. the falafel almost tasted o so wonderful and the texture almost like moist meatballs! I swear when I was eating my left over later that day without reheating, the falafels tasted like meatballs and it was so great. Other people seems to be eating soup and pita at the restaurant and it really made me want to try it. Perhaps next time I come, I'll order the soup and pita bread. \n\nI think this place is CASH only. Maybe only the TOGO area is cash only but at the restaurant, i just paid cash without asking whether they took CC or not. Highly recommended mediterranean restaurant. their falaafelllllll sandwich. sooooo gooooood.", "author": "Angela K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "Food was fresh and made to order bread!!! The pita bread was yum. I ordered the chicken platter. Friend ordered roasted lamb platter.", "author": "Marz S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Huge fan! In my opinion, the assorted salad (picking 5 of the appetizer options) is the best deal on the menu, as you get to try a variety of their specialities along with a giant pita. I especially like the hummus, babaghanouj, tabouleh, and beet salad. Note that they don't serve alcohol, although there are plenty of great wine and cocktail bars nearby if you want any to grab a drink before or after.", "author": "Kate B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "So fresh and delicious. The staff are super nice. Everyone in this area lives on the lentil soup during the winter. It's a go-to and never disappoints.", "author": "Feather A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "4.5/5 This place has a pita my heart. \n\nI've eaten here and done take-out several times. The headliner for this epic middle eastern concert, \"fava town\" (watch out Guy Fieri), is the pita bread. They make it fresh right in front of the house and they are seriously the best eaten on the spot \"hot and fresh out the kitchen.\" They are so plain, yes, but they have a savoriness to them that can't be explained. Ugh, doughy and soft with pockets of steam coming out from where you ripped the bread. I'm salivating. Dip it into their baba ganoush, oooh girl. It really makes you wonder why more places don't make their own pita. \n\nI will say that as a falafel connoisseur, I've had better. Their falafels are a bit on the drier side, still good, but not great. I usually opt for the 5 choice salad. The reason I knocked off .5 stars is because you can't just walk in and buy pita bread for take out. You have to buy a side to get the pita. Which I understand, at a buck a pita, they would not be making much on pita alone. When I'm not dining in, I usually get a side of hummus or baba ganoush and get like 3 - 4 pita breads. The ones I can't finish I end up saving in the fridge and toasting for the next day. If I were rating this place on a bang-to-buck scale, it'd be a 5/5. You can definitely get a decent full meal for under $11. Service is ok here, nothing to rave/complain about.", "author": "Maria J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Fantastic joint for a quick lunch. We came in with a group of 13 folks on break from a nearby aikido seminar, and the staff was great at reacting quickly to our various asks. We ended up having to send half the group back early, and they boxed up our food, adjusted our tab as there were a couple items we couldn't take to go, and were just all around accomodating. \n\nTheir vegetarian Pitza is really really good.", "author": "A K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "Good, simple Middle Eastern food. There aren't any frills about this place, they're not too concerned about presentation, but the prices and service are good and the portions are on the larger size. That works for me. Although the front looks like a to-go falafel stand, they have a decent sized seating area in the back, as well as a nice outdoor space.", "author": "Randy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-13", "description": "CASH ONLY!!!!! I walked all the way up there and they are cash only... no ATM around. Going somewhere else", "author": "Rachida I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-26", "description": "Was driving late at night with a friend when we passed this place. I used to walk by this restaurant countless of times but never stopped to eat there. Luckily, place was open till 10:30 p.m. I ordered the spinach and cheese stuffed bread which I watched them knead the dough and bake it fresh right before my eyes. It was super huge and while the bread was tasty and they were overly generous with the spinach, it lacked onions and sumac (the traditional way of preparing this). My friend ordered the falafel plate. I tried one falafel...it was a salt bomb and wasn't the best...no green in it. The hummus was ok. Either way, I'm glad I satisfied my curiosity lol.", "author": "Mariam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "This place is our absolute favorite in the neighborhood! The food is delicious, fresh and very conveniently priced. I've never had a meal that wouldn't leave me wanting more and feeling amazing! -no bloating or bad feelings even after indulging.\nTheir hummus and green pizza are to die for.\nTake out is available by calling the restaurant directly or you can enjoy a lovely meal in their patio for the hot summer nights. \nIf you are in the area and haven't tried it, what are you waiting for???", "author": "Nani O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "My partner and I ate here tonight for dinner. We loved the atmosphere and that it felt intimate. We shared the vegetable pitza which was delicious! We also had lentil soup which was also good accompanied with a sliced lemon, garlic bread which was deliciously garlicky and bursts with flavor as well as the assorted salad. We enjoyed the hummus , pita bread and baghanoush very much! The wait service was very attentive in making sure our water was always filled to the brim!", "author": "Miriam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "The best falafel's in Brooklyn no kidding. Fresh bread on the spot. I usually get a lentil soup and a falafel,and can't even finish. Prices are reasonable,food is fresh as well. Summer time has a outdoor seating which is a nice rear yard spot. \n\nParking sucks on Atlantic Ave so make sure ticket agent doesn't get you,cause tow truck will be right behind them.", "author": "Joey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "Best place downtown bklyn, reasonable and very tasty. I love the lamb sandwich. Only downfall about this place they don't take card as payment, it's cash only. But there is a ATM machine in the store. Workers are also friendly and fast with your order. Highly recommend this place", "author": "Karen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Delicious food and fresh! Super affordable and exactly what you are looking for. Have brought friends and family here, and everyone is impressed.", "author": "Meredith S."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}