{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-10", "description": "Overall the place is pretty decent. I'd give it four stars, but I recall once (about 4-5 years ago) that I had one lamb dish and the small of the lamb just didn't sit right. It reminded me slightly of this awful smell beef can give (at least to me). The food tasted fine though.\n\nNow onto the good stuff. Aside from the incident above, their food is pretty tasty. They've got a nice sit-down area and a great back-area. Good mint-tea and the list of Pitza's is nice. I tend to find my weakness is lamb and I'll order that above most other meats, especially at a mughul or middle-eastern style restaurant, so I almost order some lamb dish when I go here and I've never been disappointed. It's cheap, fast and the staff is very courteous. I'm not sure exactly what it is, but there is something they do that is slightly different than most other places. I think it's the spices they use.", "author": "Aki A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-17", "description": "Loved everything about it. I had the falafel plate and it was definitely some of the best falafel I have ever had. Adding it to the list of go-to places in the neighborhood.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-02", "description": "Love the falafel sandwiches!  The pita bread is truly fantastic.  Would have been a full 5 stars if the falafel had a bit more flavor.", "author": "Swell 2."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "Love this place!  Great \"pitza\" - get the green Pitza.  Great falafel sandwiches and some of the best hummus \u0026 babagaouj around.  Just don't ask for just a little hot sauce unless you want a lot!", "author": "Eat It B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-05", "description": "Best pita ever.  Chicken plate is a must with babaganoush .  Wash it down with a tart Loomi.  You won't be dissapointed with anything you order on the menu.  Even the pitza looks amazing.  Def going to try it next time I am in.  Entire staff is very nice, attentive and always willing to give reccomendations.  A must try if you are anywhere near Atlantic and Bond Street.", "author": "Nick B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "Great outdoor space. Great falafel. For this type of restaurant, it's a winner!", "author": "Tabby M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-26", "description": "this hole-in-the-wall on Atlantic avenue is a genuine surprise. Food is delicious and filling, and the pita is fresh-made just in front of you.", "author": "Elena D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-10", "description": "My new favorite restaurant in Brooklyn.  This place has the best hummus, the freshest pitas, and the friendliest staff imaginable.  Even though they're cash-only, we go back consistently for their Chicken Sandwich and Chicken Platter.  Also, they're Merguez Sausage Pizzas are amazing!  :) :) :) :) :) :) In the words of my nephew, \"this deserves 5 smiles.\"", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-25", "description": "Very reasonable, cute authentic spot.  A bit small but the group of us arrived at a good time and were seated right away.  I had been craving middle eastern food for months after visiting Israel (including spending an evening at a bedouin village) and this place hit the spot. A+++", "author": "Dee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-31", "description": "The mint tea and zatar bread with hummus is my favorite. So good.", "author": "Katherine K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-06", "description": "Super place, great value.\n\nThe good:  the pita!  fresh baked before your eyes.  the pitzas.  falafel plate, chicken plate.  the back patio!  friendly staff.\n\nThe could be better:  I prefer the hummus from Zaytoons on Smith St, and to my taste the falafels could be moister and more flavored.\n\nStill, a total go-to!", "author": "Alec Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-20", "description": "This is one of the best cheap middle eastern places in the City.  I defy you to find me another place which is making pita fresh out of the oven to your table!  A lunch time must!\n\nDefinitely try the Babbaganoush and stick with the sandwiches.", "author": "Daryl D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-28", "description": "Yum, yum and yum! I really like this place. Another small, cash-only gem here in Boerum Hill. I've ordered from here several times and loved what I got every time. I've never eaten in here because when you first walk in it seems like just another tiny, order-out kind of place. But I know they have a garden space in the back and would like to check that out once the weather warms up again. I've had the chicken plate, which comes with hummus, salad and a HUGE and yummy home-made pita. I've also tried the falafel (another yum!) and the feta cheese salad, which is great wrapped up in a pita with chicken and salad. Though I haven't yet, I definitely want to try their \"pitzas\" as well. The food is fresh and the staff is very friendly, quick, and efficient. Definitely a good choice for a quick and delicious-yet-simple Mediterranean meal. I know I will be coming back here again and I highly recommend anyone to try it out too!", "author": "Natalia O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-16", "description": "I used to have a lot of love for this place but I think the quality of the food has been deteriorating over the past few months. I used to think it was a hidden gem, but now it's busy when I go and the food is disappointing. I loved their pitza which is now way too greasy, and their grape leaves but the last few orders have been hard and dry, they're old and I won't eat them. I wish they would put back some of the old energy in to this place!", "author": "Cat H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-14", "description": "it's like i died and went to heaven. the best lachmajun i've ever had. juicy, sweet, tender. perfect crust. i was so obsessed with getting this food into my mouth that i barely had time to chew. \n\nservice: authentic. ambiance: hilarious. love it all.", "author": "Jane F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "Quality food, nothing amazing, but very fresh, esp. the pitas which come out slightly charcoaled (I love that), and a garden that is empty on weekdays but charming. I'd pass on their pizza. The garden, pita and prices bring this to a 4. Also, place has personality.", "author": "Jeremy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-10", "description": "I'm almost scared to give these guy's all 5 stars, for fear that they may get complacent. I know my middle-eastern food( Kuwait, Born and Raised). First-off, its old school making fresh pitas right in the restaurant..that makes this place special right out of the gate..the falafel is crispy crunchy and not greasy, the baba ganoush you can actually taste the eggplant. I haven't strayed too far from the sandwich part of the menu which at about five bucks is a steal...oh yeah try the lentil soup as an appetizer if you're really hungry..really garlicky and lemony!", "author": "Bobby S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-11", "description": "As of 7/10 the Manager Said told me that BYOB isn't allowed at the moment because of some \"issues\" that had happened.  Still one of my favorite gardens to break Pita in.  I've yet to not absolutely love anything I've eaten here. The Pitza is nutballs. Go for the Lambachun and thank me later.", "author": "Patrice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-30", "description": "I've been here twice.  This may be some of the best Middle Eastern food anywhere in New York.  The falafels are done to perfection.  The hummus tastes like it was made no more than twenty minutes ago.  The salads are fresh, with generous portions of plump, juicy Greek olives.  Initially, the waitstaff got my order wrong -- I ordered the falafel platter with baba-ganoush, and it came with hummus instead.  When I pointed out the error they insisted on bringing me a separate plate of fragrant, delicious baba-ganoush.  They served a sweet corn-cake gratis at the end of the meal, and the bill, when it arrived, came to all of $7.  This is really really GOOD, cheap food and great service.  It's conveniently located in Boerum Hill, but worth the trip from any part of Brooklyn.", "author": "Jeffrey Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-08", "description": "All you people that are giving this 4 stars are truly blowing my mind!! There are better middle eastern restaurants in Brooklyn! This place should not even be categorized as a restaurant, as it only has a bread oven to cook everything in. No grill surface whatsoever!! If it was called Bedouin Bakery and only sold pita bread my rating would be much higher as the bread is really good and fresh. All you people that don't know any better and keep ranting and raving about the hummus and babagnus, go 4 blocks down the street to Sahadi's. It's light years better. The falafel is not good, mushy, and flavorless. Just incase you've never eaten falafel it is supposed to be crunchy outside and soft inside. Try Mamoun's the best! Even crappy Cheaps falafel near St Marks is waaaaay better. Avoid this place at all cost. If you rated this 4 or 5 star please try another place then you will see what you have been missing all these years.", "author": "Mandle F."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}