{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "the restaurant should be much cleaner - don't feel comfortable here and cash only", "author": "Alf O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-02", "description": "So I go to BEDOUIN TENT restaurant last night with my fiancée. We get the check and I notice it is a smidge higher than I expected. I say to myself out loud, oh they added the tip already. No biggie. \n\nThe people to my immediate right and left had coincidentally asked for their checks at the same time. They overheard me and re-checked their bills. No tip added. I immediately called over the manager and asked him why the table on the right had not been charged a tip. He explained to me that it was because they were regulars and only new people were charged gratuity. \n\nThis of course made me ask the table on the left if they were regulars. Needless to say, it was their first time there. The manager tried to make another lame excuse and I could not help but notice that there was only one difference between me and the people around Tiffany and I and it wasn't the color of our hair. As you can imagine, I was furious. \n\nYou know what they did is blatant and disgusting when the people next to us were apologizing for what had just happened. And an apology never came from anyone at this establishment. \n\nYes, I will be reporting this to the Better Business Bureau and I shall never eat here again. \n\nRacism sucks.\n\nIf you haven't guessed by now, my fiancée and I are African-American.", "author": "Tiff S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-16", "description": "I've only had takeout here, but this place has insanely good value for a place baking pita to order. I'd appreciate a little more going on in terms of fillings, sauces, etc., but what they're doing simply they simply do well. Definitely worth going to for a quick cheap lunch.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "I can't say this is the best middle eastern food I've had, but it was certainly good. The lentil soup is worth it enough to come back, so tasty! Falafel was nice and moist, though a bit too uniform in texture. The hummus was really good and and vegetables used in the sandwichy gf had and on the plate I had were really fresh. However, the meat was a bit dry in her sandwich and the bread that the meal comes with wasn't particularly amazing. We tried the harira soup which had cinnamon in it, something I don't think either of us have experience in the variety of food we've had before. Was pretty good, though the lentil soup was much better.\n\nAlmost forgot, we had the stuffed grape leaves which tasted good, though were drier than expected. Could be the more authentic way, though would have preferred them to be a bit more moist.\n\nI think we'd come back, though I would probably stick to certain things. At the least, this place helped turn my gf onto middle eastern food, so cool beans there.", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-28", "description": "I'm not sure if he just didn't like my appearance, but he wouldn't sell me any pita bread to go. Adamantly refused.", "author": "Abigail I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "Best middle eastern ever. Period. Still a bargain at twice the price so let's hope they don't catch on. 6-10$ plates are insanely good", "author": "David D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "Great price. This kind of authentic middle eastern flavor is hard to find in NYC. If you like something crunchy and flavorful, go for the falafel plate with the b___ sauce (sorry it has a long name that I forgot). If you like something meaty, go for the lamb. 4 out of 5 stars because this place has only 1 server, but what do you expect? You can't beat the price for the atmosphere and delicious food. Also, your bill comes with a complimentary bite-size dessert!", "author": "Yimei M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-16", "description": "Some of the best mediterranean food in Brooklyn. Good portions and in warmer months they have a romantic little garden seating in the back.\n\nTheir pita's are fresh to each order and their hummus and falafel is my favorite.", "author": "David D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "What the WHAT?! I stepped off the sidewalks of Brooklyn and entered into a foreign country when I stepped into this spot. Best find of the day! I could eat their falafel sandwich every single day if I had the option. I wish my stomach was bigger so I could have fit more of their food inside of my body. The Shrimp Pitza was \"ok\" but I would order something different - less safe - next time. Can't wait to go back!", "author": "Caitlin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Very good pita nice space outdoor too. The falafel is really good- actually anything on their amazing pita is the way to go", "author": "Kira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "Excellent food. Amazing service!\nCan I give them six stars?\n\nOk six hearts then. \n\nAnd what also amazes me is how low the bill is when I get the check. I keep thinking they made a mistake but they didn't. \n\nEnjoy\n\nP.S. Try to get a table outside in the back too :)", "author": "Richard C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "It was so nice to find a neighborhood Middle Eastern restaurant. The pita a really outstanding. I would also recommend anyone of the cold salads. We had the five salad platter and every one was great. Merguez isn't something you find on a lot of menus, and when you do it's usually not that good. Here it was moist, spicy, and perfectly well prepared.", "author": "David R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "This place is awesome! Extremely authentic and I was very, very impressed with all of the flavors in the food. The portions were great and very filling and cheap for the amount and quality of food received. \n\nThe place has a nice vibe to it and the pita bread was great. The chicken had wonderful flavor and the sauce that came with it (don't know what is is) was amazing. I would definitely come back here for some authentic Middle Eastern fare and recommend it to anyone in the area. A nice place to go for lunch - staff wasn't the most friendly, but this is more of an authentic, neighborhood joint rather than an artisanal type of meal.", "author": "Nicolette T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-24", "description": "I can't believe I've never reviewed Bedouin tent. I love this place! For delivery and for sit down. The food is absolutely amazing, especially the pita bread. The pita is best when it comes right out of the oven - fresh and warm! I have no idea what they do with the dough that makes it so amazing. Sometimes when you order it for delivery it hardens but it's still tasty.\n\nWhen we first started ordering from here, we would always get the lamb pizza. It's so delicious!! Over the last three years, we have slowly tried everything on the menu. You really can't go wrong here. The beet salad is good- very flavorful. The spinach pie is really good too - cheesy but not too heavy. The chicken pizza is ok. Lamb everything is amazing. Hummus and pita is a must.\n\nBetween my boyfriend and me, we probably order delivery here every other week. But dining st the restaurant is also a great experience. This is usually where we take people when they want to check out opt he neighborhood too. The service is good, everyone is friendly. When you walk in, the decor makes  you feel like you've walked outside of NYC and into a foreign place. It's wonderful.\n\nIf you area in the neighborhood, this is a must try!", "author": "Elaine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Unbelievably. Accidentally stumbled across this gem while heading home and starving. Sat in the back (too chilly to sit outside) and split a chicken sandwich and a salad sampler  plate with my boyfriend. \nWe sat in silence, shaking our heads at how mind blowing the food tasted. Seriously do it.\n\nIts cheap ($18 for the both of us), filling and delicious.", "author": "Ruby D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "Bedouin Tent is different from every other Mediterranean joint I've gone to in that they have freshly made pita! So hot and fresh and pairs perfectly with some hummus or gaba ghanoush. \n\nYou can take your food to go or sit in the back--there's an outdoor patio area for the nicer days out.  Great fast-causal joint with delicious, filling food!", "author": "Ashley L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "The fabric wall is beautiful. I felt even more cozy with this place listening to middle eastern music. I went for the merguez plate. It has salad (some lettuce, tomatoes, onions and kalamata olives), spicy lamb sausage, and a choice of baba ghanoush or hummus that you can decide between one of them. I also got their famous pita bread which tastes really good. The service was great and even greater when the server gave us free basbousa as a small dessert.", "author": "Winnie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "My favorite place to eat in all of NYC.\n\n- Awesome prices.  (i.e $50 for a FEAST for four people)\n- On a nice night, you can dine in their hidden courtyard\n- Waiters are super friendly and not shy about making helpful suggestions, which I appreciate.  \n- Freshly made pita makes all other pita takes like plywood.\n- Love the menu items-- salad is super fresh, baba ganoush, hummus, and beet salad also worth ordering every time.  Lamb and chicken plates are a go-to item-- delicious!", "author": "Kerry D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-21", "description": "The spinach and cheese pie definitely deserved a 5 star.  Their freshly made pita bread was awesome!!!  The best thing is the tiny garden in the back that is full serendipity.  We will definitely be back!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "I stumbled onto this restaurant after leaving a nearby coffee shop. The smell of the \"Pitza\" peaked my curiosity, so I stopped in. \n\nThe wait staff was extremely friendly, and the food was amazing. The spinach-cheese pie is arguably the best calzone I've tasted, and the Vegetable Pitza was outstanding as well. Their fresh ingredients, generous portions, and welcoming atmosphere made for a memorable lunch. I will definitely be back. \n\nHighly recommended.", "author": "Marques J."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}