{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Simple, easy and delicious. Staff in here are really friendly and the food is amazing. Good quality meat, salad is fresh and I could eat the pitzas all day long.", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Very authentic cuisine. Spice mix in sandwiches compiled themselves well together. The lentil soup was creamy and delicious. The baklava was a flakey, cinnamon-y last touch. We carried out but are excited to go back to dine in!", "author": "Allison B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Ahhh one of my favorite places! This restaurant looks like nothing but a pizza shop from the street but damn the food is good. You can sit in the back and the decor is minimal- but very cool. Middle eastern wall hangings do lend to the middle eastern feel. The menu has a salads section - which isn't green salad, they offer about 10 different vegetarian salads- feta, labna, beet, a few different chickpea salads, lentil, potato, tabuli, hummus.. I'm getting hungry writing this :) and comes with some super fresh from the oven pita breads. I usually get the salad assortment ($12) and they give you so much that you take 1/2 home. Their falafel plate is so good- just good darn falafel! Our friend always gets the pizza- which is a personal sized pizza With fresh mozzarella \u0026 veggie toppings- he loves it. We have recently tried the spinach pie calzone- which was so fresh and not a greasy pizzeria type of calzone. There's nothing here that we haven't enjoyed.. this is a real gem in downtown Brooklyn", "author": "Samantha W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "One of the best pita breads I've ever had. I had it as a side to the chicken plate which was a lot of decent food, especially for the price of 13$. Very friendly service.", "author": "Jedrzej N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "Bedouin Tent is a gem of Middle Eastern (read: Jordanian) authenticity in the sea of NYC Middle Eastern food mediocrity. \n\nI can't underscore how much I love this place. Always affordable and feels like you are eating freshly made food from someone's kitchen. You will find real Jordanian food here (not the fraudulent crap that \"The Halal Guys\" serve). \n\nWith the rapid gentrification of Atlantic Avenue, Bedouin Tent has persevered and I hope it never leaves due to high rent. It is *very* hard to find fresh, authentic, amazing Jordanian food in NYC - compared to Dearborn, Michigan, for example. \n\nWhen you enter, there is always an Uncle making fresh pita bread - which is always freshly baked, perfectly chewy and served warm. \n\nFavorites: \n1) Falafel Sandwich: It is large, filling and under $5. A total steal and so delicious and healthy. \n\n2) LENTIL SOUP: This is my favorite item on their menu. It's the real deal. Smooth, creamy, served with lots of lime/lemon and olive oil. I often order only this and eat it slowly in the backyard.\n\n3) Freshly rolled bread: speaks for itself.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-24", "description": "Ordered lamb pita. Meat is like leather. I asked for no onions. The thing is half filled with raw onions. Was supposed to have a lemon mint sauce. Nope, but there was some rotten lettuce  I am just throwing it out. Reviews made it look half decent. I tried to sort by recent to remove any kind of review gaming, but Yelp didn't show the option in the app. Maybe stores can pay to remove the review sort option? Either way, I can't believe I paid for this garbage.", "author": "William B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "We ate outside in their nice little courtyard.  I had a lamb dinner with Humas and my companion had Falafel Plate with Babaghanouj.  Mine came with a salad and humus.  \n\nI wasn't a big fan of the Babaghanouj which looked like the humus but they tell me  is eggplant based. \n\nI was a big fan of the beet salad and pita bread. \n\nAnother person had a lamb sandwich and Spinach-Cheese Pie. I did not try that but it looked really good.\n\nMy lamb was sorta over cooked but I still really enjoyed it.\n\nThey only took cash which was a pia. \n\nI would go back and recommend.", "author": "Brian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "Wow! That was great!\n\nWe got some chef special pitza and two falafel platters with different sides and everything was delicious. The food came out with a huge plate of pita bread which we finished and even asked for more. \n\nThe seating area was small but very pleasant, made up to look like, you guessed it, a Bedouin tent. \n\nAt the end of the meal, the check came and we thought they forgot to charge us for something. Nope, they just have great prices. That reminds me, they're cash-only. \n\nWe got baklava to go, which was not as good as I was expecting.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "The \"Moustache\" empire has outlets on Bedford Street in the village and on Lexington in the UES. I know that they've had this outlet for some time, but I hadn't been there in ages and ages. As in the past, they serve really nice Mediterranean specialities here -- soups, sandwiches, pizzas, salads, etc. They make their own delicious pitas. Prices are reasonable and the decor and service are super-casual. The one downside is that they don't serve any alcohol, which is understandable but was a drag for us since were were craving a glass of wine alongside our meals.", "author": "Hilary C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "This is one of my favorite spots in the area. The soups are delicious, the entrees are great, their assorted salads are fresh and very tasty.  Try the  garlic bread ( made on pita bread) it is sublime. Pita bread is made on the spot. The staff is friendly .The only draw back is cash only, but don't  let that be the reason why you would miss out on such a yummy and reasonably priced place to eat.", "author": "Ceci M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Where else can you get a giant Falafel Sandwich for $4.50? Please let me know because otherwise, I think I've hit the jackpot.\n\nBedouin Tent Restaurant is a cute little Mediterranean/Middle Eastern influenced joint in Dtown Brooklyn. The menu is simple - with salads, sandwiches and plates for VERY reasonable prices. Their food is incredibly fresh (homemade pita bread, holla!) and with quality ingredients. \n\nAnd that brings us to: the Falafel Sandwich. Simple and done right. Their homemade chick pea croquets are encased in a fresh pita right out of the oven and topped with lettuce, tomato and your preference of tahini and/or hot sauce. I recommend getting it all. \n\nAside from their sandwiches, I recommend getting their version of pizza... called the \"pitza\". With tomato, cheese and your choice of toppings. It's great! And last but not least, I thoroughly enjoyed their Semolina dessert. Topped with a simple syrup (I think) and almonds, this was a nice treat to end my meal with. I liked that it wasn't too overly sweet.\n\nOH. And a reminder: Cash only peeps.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "The falafel here is downright delicious. It's seasoned really well and very flavorful, unlike a lot of other places. The salad and hummus that come with the falafel is also very good. The pita bread comes out piping hot and fresh! How can I go back to eating the packaged pita bread sold in stores? Idk. Thankfully, this is a place I can frequent a lot because of its great price and portions. My friend had the lamb sandwich and she enjoyed her dish as well. One downside to this place is that it's warm and stuffy inside. Next time, I plan to sit outside. \n\nDefinitely recommend this place!", "author": "Jane M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "I was in the area and off a positive recommendation, I decided to try \"Bedouin Tent Restaurant\" in Brooklyn. Lucky for me she told me they don't take credit only cash so be prepared, I stopped at a ATM and got cash. Parking on Atlantic Ave is a nightmare so bus or subway are better options. Looking at the place it looks a bit run down, inside is no better. It needs work but employees a spirited crew. The owner recommended some items to me but I had my heart set in the spinach pie. I did get it and one he chose, the lamb wrap and then he told me to have a seat. There was seating in the back and it was packed with Brooklyn socialites, that talked politics and business while I waited for me food alone. I was on my lunch break I might add so I was riding solo, but I still enjoyed the atmosphere inside. When my spinach pie came out I really enjoyed it. The crust was pastry like and inside was full of mozzarella cheese and spinach. It was truly my favorite. When my main course came out I was surprised. It was long, really long. After a closer inspection I noticed the pile on the toppings but short you on the lamb meat. I ate it however and enjoyed the pita a lot. That and the yogurt sauce were amazing. I wasn't that sold on the lamb because it was a bit fatty and hard to pull apart, but it was flavored correctly and that's what counts. I definitely enjoyed the meal and I will be back. Next time however I will try the chicken courses.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "Beautiful and fresh looking food. The people working are quite nice as well. Haven't had any of the fresh baked breads. Unfortunately I have to say that it's just okay. The issue is it's overall bland food that has great potential. The ingredients and authenticity is there but middle eastern good should be exploding with flavor.", "author": "Noam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "i love this place! best tabule and keppe!\nI had an amazing experience at this place! When I mentioned to the owner Im from Argentina he says he know we had a Syrian's descendent president!!! It was a amazing surprise for me!\nBesides this the food was delicious.", "author": "Majo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Top notch!\nBest falafel in Brooklyn !!!!\nEverything is healthy \u0026 great !!!!\nLove the soup \u0026 pizza.", "author": "Billy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "This was the first place I came to when I got to Brooklyn. I wanted a fast, tasty, light meal. And Bedouin delivered. \nThe bread was fresh out of the oven, the chicken wasn't dry, the salad was seasoned well. Everything about this place!!! Everyone I know, I bring them here. It's a must go to place if you're ever around this area!", "author": "Mara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "Tasty, inexpensive Mediterranean food. I had the falafel platter and shared a spinach pie, plus had some bites of the lamb platter. I thought the falafel and the spinach pie were a little dry, but otherwise everything was great. Certainly the right price!", "author": "Gab G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "The zatar bread here is 10/10. You can get a HUGE falafel plate for pretty cheap as well. Good, cheap, and authentic. My go-to in the area.", "author": "Dominick D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Otherworldly, like stepping into a scene from Ceylan. The pita is made fresh, the hummus is remarkably smooth, and I can't go often enough.", "author": "Albert S."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}