{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "I just had their falafel sandwich and it was amazing. They bake the pita right in front of you and the falafel just came out of the oil. I really enjoyed it.", "author": "Lior S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-12", "description": "I had heard so many good reviews about this place that I was looking forward to some good middle eastern food when my friends suggested we go.\n\nI have to say though that the service we received was poor, poor, poor. The server came to ask us if we were ready to order and when we said we just wanted hummus and pita to start with he became very short with us and seemed to get annoyed. How many pita did we want? Well, we didn't know how many to ask for. Would one be enough? Two? So we ask him how many we should get, how many people can eat one pita, etc. and he kept cutting us off and asking the same things. Did we even want hummus? All with an attitude.\n\nSo eventually he comes out with probably the best pita I've ever tasted and then leaves...where's the hummus? I ask him next time he comes by if the hummus would be coming out and he says \"You did not ask for hummus!\" And I say, \"oh, okay well then could we get a hummus please?\" He stalks away annoyed even though we clearly ordered a hummus.\n\nThen, the fourth member of our party showed up just as we were placing entree orders. He hastily orders the chicken plate from the menu so our server wouldn't have to come back to him after taking our orders.\n15 minutes later our food comes out. No chicken plate though. So we guess that his will be out shortly. We wait and wait and wait and deduce that this food it NOT coming. So he flags down the server as he goes to help another table and says \"don't worry about the chicken plate, just cancel it.\" And the server just says \"ok\" and keeps walking. So our friend sat there with no food while the rest of us ate because of a rude server who he didn't want to piss off anymore.\n\nAlso, the lamb sausage sandwich was just okay.\n\nI want to say that this was just a one off bad experience but having worked a long time in food service I can't excuse this truly terrible service. I hope other customers have a better experience.", "author": "Chayenne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "I was on a mission in Brooklyn yesterday to eat a nice brunch with my gf and then play GTA V for the entire day.  Instead of stopping at a place with a \"brunch menu\", my gf told me she used to love the backyard seating here and freshly made middle eastern pitas.  Sold. I had been craving hummus and lentil soup for some reason and this satisfied all my needs.\n\nWe ordered:\n* Garlic pita - huge chunks of garlic toasted perfectly (probably bad for dates because I smelled like garlic the entire day)\n* Hummus - creamy and fresh\n* Pita - I love it when it comes served all poofed up and I get to pop it. the little corners that I peel off create pockets that soak up the lentil soup and make little middle eastern soup dumplings\n* Lentil Soup - creamy and lentily.. as expected\n* Lamb leg sandwich - the tastiest $7.50 lamb sandwich I've ever had. It's seasoned well and a great portion.\n\nWe wound up taking home the rest of the garlic pita and the extra pita that came with the lentil soup. Snacking on oven reheated pitas while playing GTA V made me more than happy to write a good review about this place. I think I'm just in a really good mood.", "author": "Clemens W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "Not too far from the very popular Mile End restaurant is block of restaurants, the best reviewed being this little gem. It's a Middle Eastern place with a take out counter in the front and a nice dining area and backyard patio. The front also has a couple of guys making pita bread from scratch, it's nice to see they go the extra step here instead of buying the pre-made stuff. \n\nIn addition to some more classic Middle Eastern dishes they have \"pitzas\", an interesting version of pizza where the crust is a typical thin crust pizza but the toppings are very Middle Eastern. I got the lambajin ($8.50). This was a 10\" pizza is topped with a ground mixture of lamb, onion, tomato, parsley \u0026 spices. The thin crispy crust with the airy interior was cooked to perfection and the lambajin topping was moist and packed a ton of great Middle Eastern flavor. The 10\" pizza made for a great meal. The service I got was great, and they even bring their check to you with a small piece of basbousa (a Middle Eastern dessert that to me, tasted very similar to corn bread with a sweet almond twist). \n\n\nUnfortunately this place isn't all good. The backyard patio features astroturf, plastic chairs/tables, and the occassional mosquito. They serve you luke warm water unless you ask for ice, and they're cash only. \n\nUPDATE: I've since had the Lambajin pitza from two well reviewed local places, Zaytoons and Fatoosh. Both use beef (and still call it LAMBajin), and neither is as good as the one here (but Fatoosh comes somewhat close). Bedouin's crust is just so perfect and their spices are so much more balanced and addictive.\n\nUPDATE 2: I've since tried their falafel ($4 for a side). It's really not good. There was a fair amount of seasoning and the portion was good but the outside wasn't crispy and the inside was dry. Definitely not worth ordering again. I also ordered the most expensive thing on their menu, the Chicken Ouzi ($13), a wrapped phyllo stuffed with grilled chicken breast, basmati rice, carrot, peas, almond and raisins, topped with green salad and served with a side of yogurt sauce. This was also not good, the chicken was actually tiny little pieces of ultra dry chicken, there wasn't much in terms of seasoning or other ingredients other than dry rice. The phyllo wasn't light and flakey like I expected it to be. Overall a fairly disappointing dish.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Bedouin Tent has terrific falafel and amazing pita bread. When I was looking for a place to live in Brooklyn I grabbed lunch at this restaurant after checking out a nearby apartment. Those fresh pitas were so good I decided I had to live nearby. I'm not really kidding.", "author": "Jeff G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-18", "description": "Bad hummus! The bread is the best thing about their falafel platter, especially when its warm. Falafel balls are a bit bland, but the hummus was runny and bland, a disappointment.", "author": "Violet M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-13", "description": "My boyfriend and I were in search of a convenient spot to grab dinner before seeing a play at BAM, and were happy to sit down in the festive dining room of Bedouin Tent.  It actually kind of looks like a tent, with tons of cloth hangings on the walls and a few lanterns hanging from the ceiling. \n\nTo start, we got the spinach and cheese pie, which actually turned out to be basically a calzone-type situation, with the ample fillings wrapped in a fresh and hot pita. My boyfriend also got the lentil soup and enjoyed it thoroughly, but alas I could not taste it to confirm (damn allergies!). \n\nFor my dinner, I got the chicken platter, and he got the falafel platter.  Both came with a nice side salad, your choice of babaghanoush or hummus, and more hot pita bread.  I enjoyed my chicken, but it was a tad on the bland side, and the salad was served without dressing at all, which seemed weird.  I snagged a bite of the bf's falafel and it was really tasty and moist. \n\nIt seemed that the highlights were the pita bread, which is really thin and chewy and delicious, and the babaghanoush, which had a great smoky flavor and tang, yum!  \n\nIt's a solid option if you're in the area and want a cheap, tasty meal.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-22", "description": "Very good authentic middle eastern food and the house made pitas are lovely. Being a vegan, this place defiantly offers many good yum options to choose from \nThe service on the other hand, is terrible. You need to yell to the waiter to make him notice you even when it's barely busy. And when he does, he is not really interested in providing any service at all. I don't accept this. Don't see myself coming back but who knows..", "author": "Meital B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "The fresh Pita soo good! Plus the baklava was delicious. Will be back for more tastings.", "author": "Mimi N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Those pitza's are delicious! And the baklavas are very tasty. The service was really good as well. Overall very satisfied, definitely recommend and will come back!", "author": "Imane B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-22", "description": "I thought the food was great until I discovered that they have rats and mice running around the dining area!!! They have rats running around underneath the carpets on the wall!!!! Stay away from there!!!", "author": "Deena F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "Lahmahcun review only. For $8 it's a great snack for two to share after, say, an invigorating session at Brooklyn Boulders. Unfortunately, it's not quite like the lahmahcun I'm familiar with from Turkey, which has more herbs and bits of tomato on it along with the meat. This one was just spiced meat, so while it was tasty, it got a little monotonous after the second slice.\n\nIt seems from the pictures that the 'pitzas' are more like what I'm familiar with, so you can bet I'll be back to try those. They're a bit more pricey though, but still reasonable looking.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "I love their pitzas, they're meze plates, and their soup. All super flavorful. My hubby recommends the merguez sandwich.", "author": "Elena S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "An oasis in the desert of Downtown Brookyn ;) Like the reviews say here, food is good and reasonably priced -- I had a scrumptious merguez platter, with very good baba ganouj and fantastic fresh pita.\n\nOne thing reviews haven't made clear: decor and atmosphere. I expected a total hole in the wall, and while it's nothing fancy they have made an effort to give it some personality and make it a comfortable place to eat. Very cute garden in the back as well.", "author": "maggie r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-04", "description": "I was pleasantly surprised to find this establishment just 3 blocks away from work! Some days when its hectic at the office I'll stroll over for lunch, relax on the patio and order some mint tea. As for the food, I've tried the spinach and cheese pie (which is actually just a calzone with tons of spinach), the harira soup (vegetarian and hearty) and the falafel sandwhich/pita which is just about the best falafel I've ever had, my only suggestion would be to add some hot sauce (sriracha pls!).\n\nThe fresh pita is really the best I've ever had, it has exceptional texture and flavor. And if you want to just get it to try it's only $1 so why not? The menu is decently priced, you'll be able to have your fill of food for just a few dollars, there are plenty of items (salads, hummus, tabbouleh, soup) for around $4.50. The waitstaff is friendly and didn't scold me when I had to run across the street to get cash since I happened to miss the huge CASH ONLY sign. All things considered, I love eating/hanging out on the patio here and would recommend this place to anyone looking for an exceptional falafel sandwhich or a calm getaway in the middle of your day. \n\nOh and the only large sign associated with the restaurant says Middle Eastern Stuffed Pita and not Bedouin Tent, just so you aren't looking for that.", "author": "Suzy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-21", "description": "Had a bird not pooped directly in front of me while seated in the backyard of this restaurant, splashing some of its' fallen feces upon my dry-clean only shirt, I might have given this place one more star. Alas, we were the only outdoor table without an overhead umbrella. Shortly after this unfortunate incident, my party moved to the indoor seating, though it was a beautiful day to be dining outside. \n\nThis place proved to be a quaint little local eatery. I hadn't heard of middle eastern \"pitza\" before this, which I believe this restaurant is most popular for; like all unique food dishes, they are usually hit or miss, and this one proved to be a hit.\n\nThe menu did not have many options. I ended up going with the chicken sandwich. It was a decent meal, aside from the chicken being on the dry side despite being coated in tahini sauce. We also cautiously ordered baclava, but it ended up being overly sweet and saturated with so much oil that it was nearly inedible, sadly.\n\nThe waiter, on the other hand, was pretty friendly and attentive. Points for him!", "author": "Tania R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "This place is so good and legit. Freshly made pita and everything was delicious. Don't go there for decor, but definitely worth for the food.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "A nice surprise hidden on Atlantic Ave that is very reasonably priced and has a good amount of options for a small place. As a vegetarian its nice to have more than just falafel at a mediterrian place. \n\nThe pita is made fresh and comes out piping hot for their homemade dips, whixh are great apps for sharing. The salad plate is my favorite, as it offers a variety amd most times leftovers. \n\nThe outside is cozy in the Spring/Summer for dining; however its super casual with plastic furniture.", "author": "Marla T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-15", "description": "I was getting lunch and ordered the leg of lamb plate. It was very good. I loved the salad. It was so fresh, and crisp. I loved the tomatoes and green lettuce. Now the lamb. It was good also. I am a salt person. So I like when my meat is salty but this was seasoned so well I didn't even want to put the mint  mayonnaise on it. It was not needed.", "author": "Arlene P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "Went here for the first time a few days ago, and then went back today. That's how good it is. The baba ganoush is amazing and you should order it. The falafel sandwich is also damn tasty. The portions are large and prices are reasonable and this place makes me damn happy. I think it's worth going out of your way for.\n\nCash only.", "author": "Kevin M."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}