{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-28", "description": "Not bringing someone's ordered dinner  at all is pretty bad in itself. But it really gets insufferable when the other party is constantly lying and never apologizing. Never got to taste their food. We ordered a delivery from exactly 8 blocks away. The delivery guy called us twice saying he had arrived (the first one was 10 minutes after we placed the order, so it obviously was a mistake), and both times it turned out he was nowhere in sight. When we called the delivery guy back, or the place, they offered us no reasonable explanation, and absolutely no apology. After waiting hungrily for an hour, we had to order from some other place", "author": "Nuri K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "I thought New York was a Middle Eastern food wasteland...until I discovered Bedouin Tent. From the authentic, made-to-order pita, perfectly cooked lamb, and fresh salads, I'm satisfied every time. If you've been in an actual Bedouin tent, the decor makes perfect sense. (If you haven't, look it up). The prices are amazing, the food is fresh, and it's quiet enough to actually enjoy a conversation. I make a point to being friends and out of town guests here. Note: they often only have one or two folks waiting on all the tables, so the service is a bit inconsistent, however, they are always friendly and I never feel rushed, and nobody offers to take my plate before I'm finished eating. My only complaint? The desserts were a bit dry, but we added some syrup and it was perfect. Highly recommend this spot.", "author": "Shari H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-29", "description": "This place is a neat little nook of a casual eatery with delicious and cheap food!  I recommend their lamb plate.  Their pita bread is homemade and arrives hot and fluffy right out of the oven!  A must have is their spinach pie with massive amounts of spinach and mozzarella.  It could use a dipping sauce on the side though.  Great food!", "author": "Margaret V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-24", "description": "Very mediocre dry falafel. Bland hummus. The pita was great, very fresh! The AC was blasting but the decor was rad!", "author": "Pan Trinity D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-22", "description": "I usually love this place and I always bring friends so they can check it out. But today I come in with my friend and the first things she saw, was the counter guy digging his bare hands into the food bins and eating. Licking his fingers and putting them back in the salad bins. I tell the other counter guy to make him stop but he tells me it's ok my food ain't coming from there. Now we are both telling him that we are ordering salads and to stop him from snacking from the bins. THE GUY JUST KEEPS EATING AND STARING AT US. Of course we walked out and googled the health departments number.", "author": "Doc T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "2 words. Green Pitza . This is a culinary masterpiece  .Leeks , green onions and fenugreek.", "author": "Pablo G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-21", "description": "They have the most delicious pita bread, but they don't sell it to go! What gives?? Throwing away money in my opinion.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-02", "description": "I don't get paid to do this and therefore I don't feel the pressure to try everything on the menu before I review a restaurant. So here's what I got on Bedouin Tent.\n\nVibe = laid back and mellow\nAesthetic appeal = Ok. Garden is pleasant. Tapestry-covered walls are a nice touch.\nPita Bread = fresh baked and piping-hot. Comes with every meal. Excellent\nHummus = Good. Probably the same stuff you get from Sahadi's down the street.\nFalafel = Hit or miss but when it's fresh, it's awesome. \n\nAnd that's it. I haven't tried the shwarma, babbaganoush, fava beans or any of the other items there. Though I will be ordering the merguez the next time I go", "author": "Gil S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "Very good food. Fresh pita, Love the hummus. Lamb gyro delicious. It would have been 5 stars if not for slow service. 1 server for the whole restaurant.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-12", "description": "I've eaten here now 3 times over the past year. First time it was because my friend swore it was the best middle eastern in the whole city... And he lives in Manhattan, and would actually travel for it, so I took his word. We got the appetizer sampler, and everything was good enough. Nothing to write home about. I got one of the pitzas I don't remember which kind, but wasn't impressed, he got the lamb pitza which I thought was disgusting.\n\nSecond time, I went alone when I found myself in the neighborhood was craving a chicken pita, and since my friend loves it, and the raves on Yelp, i thought I'd give it another shot. I ordered the chicken sandwich. Which is flavorless chicken pieces with lettuce and tomato on a thin rubbery pita, and I had to ask for sauce to put on it. (Yawn)\n\nThird, and this will the last time, I was with the same friend who loves it and insisted I give it another chance, and now I'm convinced this must be the most overrated restaurant on yelp. He got the same lamb pitza he had first time, and he liked it. I ordered the chicken pitza and this was actually nasty. If you like crunchy thin pita with chopped up flavorless chicken bits and peppers, well to each his own.  Oh, and this time they treated me to a nice long black hair baked into my pitza. Yummy, yum yum.", "author": "Gwendolyn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "The pita is baked fresh to order and so delicious! You can't help but want to come into the restaurant as there is always an aroma of fresh baking goodness billowing down Atlantic Ave. \n\nAll of the food is good and most importantly, reasonable!! It's actually hard to spend over $10 and I always leave full!", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-06", "description": "I came here for lunch today after a friend in the neighborhood recommended, and it was fabulous.  I eat a lot of falafel and hummos dishes in NYC, and I would easily put this at the top of my list.  \n\nThe men behind the counter (the guys cooking) and my waiter were all so kind and helpful.\n\nI had the pita platter which came with 4 really large (think palm of hand) falafels.   The platter comes with either hummos or baba, but I asked for both and they obliged without an extra charge.  The falafel was made with a green chickpea (the egyptian method) and was crunchy on the outside but was soft and warm in the middle - the spicing of the falafel was complex.\n\nThe pita bread is like how other described  it - thin as air, and arrives at the table still inflated from the oven.  Between the baba and the hummos, I think I liked the baba more.  It was smoky and sweet.  I also asked for a hot sauce which came on the side - again no charge.  \n\nThe mint tea was nice - and it comes unsweetened.  They offered me a piece of honey cake to finish, so I enjoyed that period at the end of my lunch as well.  It was light and you could taste the rosewater.  Tasted like it had been taken out of the oven only hours before.  I'd come back to try more items when I am in the neighborhood again, to stick to the falafel - since it was so satisfying.  \n\nAlso, the platter and the mint tea came to $9.25 for lunch.", "author": "Pumpkin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Stumbled across this place and I think I scored a home run by doing so! What a gem of a place. I had a falafel sandwich on their home made pita bread. It was delicious! Hit the spot. Cheap too!", "author": "Adrian M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-02", "description": "These people are messed up racists.  They will add a gratuity to your check if you're a person of color, and omit it if you're white.  Don't patronize them, they suck.  There is plenty of good food in Brooklyn, without giving money and business to racist a-holes", "author": "Rachel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "Great authentic no frills spot. the falafel and hummus were great. The pita is made right there and smells amazing. Update: I went back a few days later and tried the pitza with marinated chicken, so good! The pita bread is so fresh and the spices are amazing. I was planning on only eating half but.....ate it all", "author": "Joseph A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-25", "description": "What can I say, lately I've been on a lambajin tear (which is basically a ground lamb pizza blended with tons of spices and not the easiest thing to find) and this place did not disappoint.  \n\nIt's a hefty portion, easily sharable if you're getting other entrees.  But the key here is their homemade pita breads served flaky n pippin hot and their homemade hot sauce....whatever you order, request some sauce!!\n\nHummus was bland, lacked lemony zest was my take but the bite of falafel I had was superb.\n\nService was friendly, quick and they have a lovely and spacious back patio.\n\nCash only!", "author": "Jeff F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "Very delicious pita bread. The food is pretty good as well. Freshly made and delicious. We ordered lamb, salad, and hummus.meat had chewy pieces but overall ok. No special interior design but you kinda get the feel of the middle east.", "author": "Anna Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "By far my favorite middle eastern.\nI love the freshly baked pita and the menu is fantastic!\n\nYou will never get tired of this place. Also BYOB just across the street at the groucery store can't beat it!", "author": "Nels N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "This is the type of place that you wish had more locations and then have to stop yourself from thinking such because you fear that with more restaurants the place would lose its soul and the quality of its food. But I still wish it from time to time, because I love the food here, but it's so far out of the way for me (since I live in the BX) that to come here can be quite burdensome. Still, each time I make the trip, I don't regret it.\n\nThe menu has many enticing dishes that will catch your eye, and it can be difficult to pull the trigger on any one dish and not feel like your missing out on something else, but I can assure you that the one dish you must try here is the Lambajin. It's a pizza (with a pita crust) covered in a spicy lamb and onion blend that is a joy to eat. Each time I've come here, I've polished off an entire pizza on my own. \n\nAnother suggestion for subsequent visits when you're willing to venture beyond Lambajin is the Merghez sausage sandwich. The sandwich comes in a warm pita wrap and is sprinkled with lettuce, tomatoes and such. The flavor that's packed into the sausage is a treat for any foodie and the pita is of such quality that you'll want to order a side of it with some hummus just to continue the indulgence.\n\nAlthough they are inconsistent in giving it, usually at meal's end you will receive a piece of a cake-like treat soaked in honey, it's like cornbread sort of. A nice touch if you're lucky enough to get it.", "author": "Clayton A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "Went here on date night with my boyfriend and we both loved it.  The atmosphere is very quaint and warm.  I had the falafel plate and the bf had the lamb plate.  We'll definitely be coming back....", "author": "Monique H."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}