{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Pre avid Yelping days, I came here with a girlfriend on a snowy day as a late occasion to ring in the New Year. Back then it was byob and we popped a bottle of bubbly over some falafel and hummus. Between the excitement of our chatter and pretty much having the restaurant to ourselves, I don't recall much about the food. \n\nFast forward two years and I'm looking for a decent, healthy lunch in the area and I stumble on Bedouin on Yelp. It's near, the prices are right and the reviews are stellar. I walk in and immediately have a vaguely familiar feeling. It wasn't until I entered the distinct dining room with their carpeted wallpaper that I remembered having been here nearly two years ago. \n\nI ordered the same thing--falafel plate, but opted for both hummus and baba ganoush since I'm ready to feast. The salad that comes with it was so fresh, hummus smooth and delightful, pita freshly made and steaming, and the baba ganoush incredible--smoky, savory, delicious. I definitely don't recall the food being that amazing, but wow! I was so delightfully surprised and stuffed. Dreaming of it right now and even considering braving this cold for a fix.", "author": "Racquel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "Bedouin Tent is no frills, has a super laid back atmosphere and consistently good middle eastern food. I love the lentil soup which comes with a large piece of hot naan straight from the oven ($5). The Moroccan mint tea is always strong and pipping hot as well.  Everything else I've had on the menu from the chicken to the lamb has been seasoned well and the portion sizes are generous. Service has also been consistently fast and friendly. I wish I could give them 4.5 stars! It's worth stopping through if you're In the area and looking for a quick wholesome meal.", "author": "Nneka M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "From the street, you can smell the fresh pitas baking in the old style oven.  Unlike some restaurants, he kitchen\nis located in the front.  This is a classic advertisement!  This setup gets me every time.  The dining is in the back and on a good day, there is outside seating all the way in the back.  Staff are good but the reason you come to this place are the Mediterranean dishes.  Food here are heavenly, made by hands of angles!", "author": "Amorsolo D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "Authentic good and cheap middle eastern food in brooklyn (4)\nFood (4)\nChicken platter: The pita bread is freshly baked hot out of the oven. It comes with every entree but extra pita is only $1. Hummus was silky smooth, perfectly season and very homogeneous. Chicken was a bit dry. Salad was very fresh. \nLambjin pitsa was very different. I didn't taste bad but i wasn't crazy about. It was a bit too salty. \nService (2 1/2) \nService was very average, not good not bad.\nDecor/ambiance (2 1/2) \nIt seems they used a big carpet was wall paper lol. The bathroom stings. It does seem to have a nice outdoor patio. \nVery reasonable prices but cash only.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "Awesome hidden spot! A must try when near Barclays Center. We went a few min before they closed so didn't get to sit down and eat. It looked so good that we decided to get some to go and eat a park. \n\nWe ordered the spicy lamb sausage. It was pretty good and not that spicy, if you are looking for hear ask did their sauce. It gives it a good kick! \n\nVery affordable. The wrap was huge and only cost us $9. Large selection, but since we couldn't sit we only got one item \n\nBeware CASH ONLY but totally worth it :)", "author": "Arti G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "Great place to get a ton of food for cheap. A gigantic leg of lamb sandwich wrap is $9 and absolutely delicious. Big chunks of meat with veggies and a delicious lemon-mint mayo sauce. But watch out for the raw onions because they'll kill your breath.\n\nThey have dine-in seating in the back, but I was just getting food to go. The front of the shop is super warm because that's where the oven is and they're constantly making fresh pitas.\n\nSuper nice guys too. Cash only!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-13", "description": "Yet another random sleet storm hits the hood and all I could think about was Za'atar and hot mint tea. \n\nThis place is a celebration of simple Levantine cuisine. The flat breads are all baked on premises paper thin and served hot to dip into their tahini rich hummus and babaganoush. Most magical of all is their Za'atar bread. My friend and I were literally licking all the excess spice as it fell from our slices onto the table.\n\nMy only disappointment was how stuffed my falafel sandwich was with iceberg lettuce and beefsteak tomato. I was hoping for a finely chopped cucumber and tomato Arabic salad. Otherwise, the falafel were light and full of earthy cumin flavor. \n\nThis was my first taste of the tent. There will be more!", "author": "Julia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "The guys in here serve up a whopper pita with a whole lot of charm. Quick and easy plus your guaranteed to leave with a free sample of whatever has just been freshly baked!", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "I have been eating at Bedouin tent for the last 10+ years \u0026 not only is it affordable, the food is consistently delicious \u0026 the staff is ALWAYS friendly! \nI've been eating the falafel plate with hummus for 10 years and it's always so dang good! Paired with a cold glass of mint tea \u0026 ending with a piece of basousa...it's heaven. \n\nI go to sleep at night dreaming of falafels cause of Bedouin tent \nAbsolutely amazing restaurant!", "author": "Jaclyn W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "The value is insane. I have had the sliced lamb dish, and while it was good, it didn't blow me away. The real gems for me here is the mix salad, which is 6 of any \"salad\" offerings that you will dip amazingly fresh pita into. We had the babaganoush, feta, beet, yogurt, grape leaves, and hummus. For $12 you can easily feed 2-3 and feel full but not bloated stuffed. The falafel is also very reasonable and tasty.\n\nI recommend popping in with friends for a snack or light meal, and don't forget to get the mix salad. Done.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "Great for vegetarians. Very flavorful. Cheap. Nice staff. Best spot in the neighborhood!", "author": "Ray C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "Affordable and good food  with some original items ob the menu.\nThe service is particularly friendly. \nGreat atmosphere at lunch time", "author": "Laurent B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-10", "description": "Man. I was let down here. \n\nI'm HUGE on Mediterranean food, and anytime I go anywhere finding bomb Mediterranean food is high on my list of priorities. I was hoping that the volume of good ratings here would lead me to where I wanted to be, but i didn't get that. \n\nThe hummus was fine, but comparatively flavorless to others I've had. The falafel seemed a little stale and not fresh and crunchy, and the stuffed grape leaves had really good flavor but texture was very mushy. The only thing that was really good was the pita bread. \n\nI'd skip this place honestly and give something else a shot.", "author": "Tyler C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-15", "description": "I have gone to this place several times in the past three years, the food has always been very good. But what my wife and I witnessed in the last two times we've been there, I feel I will not be returning. Some of the folks in the front counter handle the money and then with the same unwashed hands start making your pizza. On another occasion one guy is playing with his smartphone and then he comes starts making your food with his unwashed hands, not cool, unsanitary.  I hope management reads this and provides training for proper food handling (use gloves when touching food)", "author": "Jay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "Great spot for falafel where they make the pita fresh with every order. The combo plate is also a great deal. One of the best takeout places in Boerum Hill.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "One of my favorite Mediterranean restaurants in the city outside of Queens. The falafels always taste fresh, and above all the aroma of freshly-baked zaa'tar pita wafts out onto the street, attracting passersby (myself included). Hummus and babaganoush are also great. I personally am not a huge fan of the pitzas, which I found a little cacophonous, but that may just be me.", "author": "Alan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "Great Mediterranean food. We liked their vegetarian options, had a falafel wrap and oat was soo good. Also liked their Mediterranean pizza. Good place for quick food.", "author": "Vaishnavi N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "I've been here a couple of times, most recently for dinner on a Thursday night.  I really like this place since they bake their pita bread fresh, you can smell it from outside.  You can watch them make it by hand in the front.  We ordered the lambajin pitza and the chicken plate.  The lambajin pitza had ground lamb, onion, tomato, parsley \u0026 spices on their freshly baked pita.  The chicken plate had grilled marinated chicken, salad, hummus, and their freshly baked pita.  The lambajin pitza was okay, actually prefer their cheese pitza more.  It could be because I like cheese more in general.  The chicken plate was tasty and the ingredients were fresh.  Their homemade hummus was creamy and the best part of the meal.  The portions were large and you really get the most bang for your buck here.  Service was decent - attentive and fast.  FYI - this place is cash only.", "author": "Julie Ying X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "This place has amazing pitzas. I was skeptical at first, pizza on pita bread, why would that be a good idea? But it is. I had the lambajin, which was finely ground lamb cooked almost into a spread, and it came out steaming on a big pizza platter. The hummus was also delicious and we devoured it immediately using extra pita and the crusts from the pitza.\n\nIt's important to note, while it looks like a to-go counter from the outside, there's actually a lot of seating inside and it's quite nice. They have big cloth tapestries up on the wall which help dampen the sound and the place is warm and toasty inside. They also have a patio out back for when the weather is nice.\n\nIf you come, get something with lamb, it's a Yemeni neighborhood and there are lots of local butchers bringing in quality cuts of lamb so this place has good ingredients to work with.", "author": "William J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Nice restaurant with an open backyard. My friend and I enjoyed our lunch in the sunshine at noon. \nWe ordered falafel salad with pita, lambajin pitza and a dessert, baklava. These are too much for two people, as the portion is pretty big. The salad includes 4 falafel balls, fresh vegetables(lettuces, peppers and olive) and hummus. The sauce of Lambajin pitza is full bodied, so it may taste a little salty. The baklava tastes sweet with special jam inside and it is worth trying.", "author": "Yingshi H."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}