{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-22", "description": "C. and I ordered delivery from here last night, and half of our dinner was awesome! (The half that wasn't was almost entirely my fault.)\n\nStart with the lambajin. It's a Middle Eastern pitza -- a pizza-like concoction served on fresh pita bread. The lambajin comes with ground lamb, onion, tomato, parsley, and spices -- and is quite good. Savory comfort food for the coming of autumn! Although, I'm curious: Is pitza a real thing... or merely the Middle Eastern delivery equivalent of pizza? \"What can we make that's like pizza?\" I hope the former...\n\nThen we got the merguez plate, spicy lamb sausage with onions, tomatoes, lettuce, olives, and hummus with pita. We got the plate instead of the sandwich, and I wish we'd gotten the sandwich. Perhaps in the sandwich, the sausage is ground instead of in one big lump. As it was, this wasn't very good with was a definite downer.\n\nWe shared a small order of foul, fava beans mixed up with other stuff in salad form. And I tried the loomi, a citrus drink. The loomi was unlike anything I've ever had to drink before. It didn't taste bad, per se, but it sure wasn't what I was expecting... Gotta fend off the scurvy, I suppose.\n\nI'd eat here again, but I'd be a little more discriminating and informed next time. Worth a go.", "author": "Heath R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-11", "description": "Really good, inexpensive Middle Eastern food.  Instead of Schwarma mystery meat, they give you sliced leg of lamb with a tasty cucumber yogurt mayonnaise.\n\nThe best thing is the fresh, warm, right out of the oven flatbread.\n\nCan't decide if Bedouin or Zaytoons is better...", "author": "Bryan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-09", "description": "Best.  Pita bread.  Ever.  \n\nI love these guys.  I walk down here a lot from work to get lunch (but when I order delivery it always comes super quickly and they've never messed up an order).  The guy who makes the pitas fresh is always there and smiling, even though he must get really hot standing by that oven making pita all day.  It's one of those places that just has that local, family-owned quality to it, which I love.  The falafel sandwich is a filling meal for $4.50.\n\nI'm not giving it 5 stars because, aside from the pitas, the food is definitely good but not really 5-star-worthy.", "author": "Colleen K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-29", "description": "Generous portions. Fresh salad and sandwiches.  Nice outdoor space. Family friendly.  Service was a little forgetful.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "By far the best baba ganoush ive had in a while, i havent been here in a little bit. Ive heard the baba ganoush isnt as good. I have to go again and try it. But when i did go, i used to go all the time and it was AMAZING! Fresh breads also!", "author": "Nishan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-06", "description": "I've been frequenting Bedouin Tent since it was called Moustache. The food has always been fantastic, and I find after all these years I am never bored or disappointed by the menu.  The spinach pie is a staple quick cheap dinner for me.  I love the combo plate of 5 cold salads for $9 (spinach and chickpeas, labnah and beets are my favorites).  The green and sun dried tomato pitzas are divine, as is the lentil soup.  Their pitas are soft and fluffy, straight out of the oven.  They are cash only, but the food is fresh, cheap and fast.  The staff are very friendly.  They lose one star because they used to be BYOB but stopped allowing alcohol a few years ago, so now I mainly have lunch there or do take out.  Back when they were BYOB I had a couple birthday dinners there which were incredible--$20pp for an amazing spread of everything on the menu.", "author": "Christine J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-20", "description": "Ok, let me start off by saying this Little funny Looking waiter is the worse.. !!! Bad attitude, disrespectful, no type of \"Class\". More like classless.. I can tell he's used to pushing women around.. Hey \"buddy\" ( yea' say it like you're talking to someone that's slow..lol) this isn't the middle east , nor a country where you can be disrespectful to woman and not get ya' ASS kicked!!! Anyway I observed this \"faiter\" ( fake waiter ) been very rude to some nurses  ( all women ) that came in for lunch with their uniforms on. One had her lunch with her, the other 2 were ordering there. Instead of approaching the nurse with the lunch to let her know they didn't permit outside food in the restaurant, he blurted out loudly \" YOU CAN'T EAT THAT HERE\". I must say the nurse handled herself very well in responding with a lower toned voice \" they are eating here, and I brought my lunch. So are you saying I can't eat here with my 2 co workers because I packed a lunch from home?\" The dude was a real Prick.. So she politely got up, along with the other 2 paying nurses, informed him that the nurses at the Hugh clinic up the block will not spend any money in their \"establishmenless\" for being soooo rude and disrespectful. This is New York!!! There are many small cafes/  small restaurants that allow people to bring there lunch in with other paying customers.. This lack of man, boy waiter just made the situation BADDDDDDDDDDD. It was as if he was trying to bait her into an argument. She walked past him, while he was being dumb and stupid, put her hand up and said \" Be Quiet\" and bye bye, no money made here today.. I don't know who owns this place but they just lost a lot of professional clients from the clinic up the block. Word of mouth spreads quickly in  the hospital / clinic settings. How do I know, My cousin works there and the news already made it to the 5th floor.. I think it's time for Bedoudin tent to get a professional staff that knows how to interact with people that come inside their establishmentless.. I observed all this just by sitting \u0026 eating with a friend there. Those 3 Nice Nurses got treated with no respect. I won't ever go back to this place. I don't  spend my $$$ in places that have a lack of respect towards women, ESPECIALLY NURSES!!! What type of person does that to nurses???? WAITER YOU SUCK BIG ONES!!! That was for the 3 nice nurses that just wanted to sit and eat there for lunch. BEDOUION TENT WAITER DON'T LIKE WOMEN!!! DO NOT GO THERE AND SPEND $$$. If you do go theremake sure you TAKE YA' LUNCH AND SIT \u0026 EAT..LOLOLOLOLOLOL", "author": "LA LA L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-15", "description": "Superb falafel, tasty hummus, and a really delicious zaatar pitza that will make any Lebanese mother cry.\n\nGranted, the hummus is the consistency of Nutella, but it's still pretty delicious. \n\nThe portions are already pretty enormous, and hit the spot when you almost want meat but you don't really. The falafel sandwich is amazing -- always ask for extra sauce, as is the merguez sausage (okay, fine, if you count lamb as meat); really, though, don't pass up the baba ghanouj because you'll thank me later.\n\nAnd you will always find a smile on your face when you're sipping mint tea.", "author": "Miguel d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-06", "description": "I like this place. Good falafel, lentil soup, a spicy lamb sausage sandwich (I agree with Ann T. that it is dry and you should ask for tahini on the side), salads...all of the basics are above average. Like most of the falafel places I have found in Brooklyn, they make their own pita and serve sandwiches rolled up rather than stuffed.\n\nThere are these pizza like things that seem a bit pricey but look really tasty that i want to try.\n\nThere is outdoor seating and I really love drinking cold water out of metal cups for some reason. It is indeed tent-like inside but I mostly ignore the decorations in there.\n\nThey give you a little bit of cake with your bill. Generally a nice staff.\n\n4 stars for above average falafel and the like. Doesn't have anything so special that convinces me to up it to 5 stars, but go try it. It would make a good regular falafel spot for someone in the neighborhood.\n\nMunch!", "author": "Erik F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-18", "description": "The outdoor space doesn't look that great but it's amazing sitting farrrr away from the sidewalk, seeing blue skies, and eating some bangin grape leaves. yum. \n\nprices are great and they def. don't skimp on food. key! \nI definitely want to come back and try different kinds of platter. to date, i've only had their falafel.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-09", "description": "I live near Zaytoun's and Olive Vine, and even though Bedouin Tent is farther away from me, I prefer it significantly more. They deliver, so that makes my weekly mezze-habit easier to maintain. \n\nI think their mezzes beat the competition. Their stuffed grape leaves are good. The mezze selection is pretty standard, but you do get fresh, warm pita bread to eat it with. That makes me happy.", "author": "Yasmin E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-26", "description": "Good food, fast service... The pita bread was amazing! freshly made.\nI had a falafel platter that came with babaganoush that was out of this world, \nThey even gave us a little piece of a \"cake like corn bread\" along with the check: I think that was a nice little detail.\n\nGood Turkish coffee, I think I will definitely come back...gotta try  the Pitza, it looked great!", "author": "Adriana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-12", "description": "You don't even know what a pita is until you've eaten here. The pitas themselves are the real stars, as is the hummus, but the various salads can be great as well. I could take or leave the falafel, but that's mostly because I don't much care for falafel. Their \"pitzas\" are generally solid, also, and prices are good all around. I would come here SO much more often if they would just take credit cards, and PLEASE find some kind of solution for all the mosquitos in the back!", "author": "X. J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "Very warmly received here on a rainy night.  Quick, friendly, unobtrusive service, in a nice informal setting, and very tasty merguez and zattar bread.  Turkish coffee also hit the spot.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "Solid food and very fast service. The lamb sandwich tasted great, but the meat was very tough in spots and hard to eat. Would come back again to try the falafel. Pita was excellent and prices for everything are great.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-06", "description": "The best falafel sandwich this side of the Atlantic (Ocean and Avenue). The pita is, hands down, the best part of the whole thing. Everytime I walk in, the same guy is making fresh pita from scratch.\n\nThe chicken sandwiches - scruptious. \n\nThe only downside is that they don't put enough sauce on the falafel sandwiches and I always forget to ask them to put extra on.", "author": "Albie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-24", "description": "This is my 1st 5 star rating.  They deserve it.  Fantastic, authentic, fresh middle eastern food.  Everything is good here, even if you think you don't like something from the way it sounds.  I've been thoroughly satisfied every time I eat here.  Plus it's not expensive, at all!  It's all good.  It's all inside.  JCPenney... or Bedouin Tent, rather.", "author": "Brandon R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-01", "description": "Delicious!  Amaazing pita bread. Their merquez is really spicy but flavorful.  Their chicken sandwich is great and very affordable -- highly recommended. \n\nThe interior is well decorated but still strangely unprofessional.  The backyard is pretty cool on nice nights.", "author": "Jonathan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "Fresh baked-on the spot- pita is great, worth the price of admission. Chicken sandwich was very good, especially for the price. Ordered a side of grape leaves and they were mediocre and mushy. No better than the canned ones, of course they may have been from a can. I look forward to trying the lamb sandwich as suggested here", "author": "Jon C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-18", "description": "Amazing pita bread. The best I have had. Service is very friendly and food comes out quick. I had the lamb sandwich and my only complaint was that the sauce was a bit too watery and I would have liked to have more of it stay in my sandwich than drip out. I would definitely come again though and still order the lamb since it was so good, but perhaps ask for extra sauce on the side. Pretty restaurant and I would recommend for a nice change of pace for lunch in Brooklyn.", "author": "Cynthia M."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}