{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "The absolute best thing about warm weather is eating and drinking in the sunshine. Until you get pooped on. Have you ever been pooped on? Me neither. Oh you have? Weird. I wouldn't spread that around if I were you.\n\nIn any case, the garden in the back of Bedouin Tent is one of my favorites in all of Brooklyn. If the weather is nice, there are always people back there, even at lunchtime on a Tuesday. A tiny fountain babbles pleasantly at the rear, and the trees provide a nice, leafy overhang if you aren't interested in getting a tan. \n\nUnfortunately, birds tend to perch on the branches, and occasionally they will poop, much to the chagrin of the lady to my left. She took the poop right on her head. Serves her right for not offering to buy me lunch. Let that be a lesson to the rest of you.\n\nBut what a lunch it is! I often enjoy the lamb or chicken pita, which they roll and wrap in foil, almost like a Middle Eastern burrito. Ask for the hot sauce, and enjoy a spicy, hearty treat. Bedouin Tent also appears to do a brisk takeout business, but the garden, the poopy entertainment and the tiny cake they give you with your check is worth paying tax and tip.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "I did a day stroll through Brooklyn and saw this place on the walk to Barclay's Center.  Amazing place.  Made to order, fresh tossed pita's for their wraps.  I had the falafel and it was really good.  Perfect fry and wrapped in that awesome pita.  If you like Med wraps, this is a must and really nothing on the West Coast can compare at this point.", "author": "Josh L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-19", "description": "So this place has a bird problem.  You'll discover it quickly if you sit in the lovely garden as we did today. You will be sitting, perhaps chatting with a friend, when the pooping will begin.  We saw the woman next to us get crapped on, and we thought, \"that's too bad,\" and then we started to get crapped on.  It turns out that this lovely garden space with its fountain is a bird-magnet, and we all know that birds love to bathe and love to poop.  All of this to say, I can't recommend sitting outside. \n\nThen again, I can't really recommend sitting inside either.  As many have said, the service is leisurely, which would be fine if the food were extraordinary, but I had exactly what I normally get at Black Iris on Dekalb-- the veggie platter-- and I can honestly say Black Iris is about 500x better. Beoduin featured tasteless beets, very sour baba ghanoush, teeth-chatteringly cold grape leaves, and some fine tabbouleh.  It is true that Bedouin is cheap, and that their warm puffy pita is delightful, but everything else is just mediocre.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-06", "description": "I've passed by this location for years but decided to give it a try as we visited family. I ordered the falafel sandwich and it was bland. There was no flavor to it, I ordered the chicken pita sandwich for my son and the same thing, he took one bite and wanted no more. The ambiance is nice and the service was good but I did not like the food. As someone else wrote in their review this location accepts CASH ONLY!!! Although they have an atm machine on location that was a peeve for me.", "author": "Vonye B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Best falafel sandwich I've ever had \u0026\u0026 I've had falafels in Jordan and Israel! As of today, I am Bedouin Tent's newest regular. I plan to frequent it!", "author": "Elizabeth L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "The pita is the real pita!! you can't find the thin, warm, fresh, white pita everywhere in New York. It comes complimentary with your order, which is great, we tried the 5 salad combo and everything was amazing. (although the tabouleh could use more lime juice)\nThe cheese spinach Fatayer (calzone) was AMAZING!! the ambiance and the decor is great too. would definitely go back.", "author": "Mahya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "I live across the street and eat here quite a bit. It's always good - the falafel is excellent.\n\nThe biggest factor:  they make their pitas fresh to order and are superb. Lamb sandwich is great and stuffed grape leaves are delicious.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "I walked by last night and could smell the pita around 9pm a block away. I started commenting and someone walking out with a pie stopped, said you must try it. Opened her box to show us. Beautiful. We made our way back for lunch today. Had small beet salad and a feta small. Outstanding. Also had the green pizza and spinich calzone. All exceptional. Have done for snacks on the plane back to SFO. :)", "author": "Adam X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "We visited Bedouin Tent after I'd walked by it at least 50 times in the last year and always assumed it was a quick take out place and not an actual restaurant. (It does have take out too, at the front counter, but there's a seating area and back patio to dine in at the rear). It's a small restaurant but people seemed to move in and out quickly that the wait was never too long. Service was great and quick. The pitas were very very fresh and are a must-try, not matter what you get. You can easily add one on for $1. I enjoyed the lamb sandwich which was huge and came with lettuce, tomato, and their own homemade mayo--very tasty and fresh. My dining partner tried the lamb pizza which was interesting--but in a good way! Had lots of seasonings and maybe even a sweet one like cinnamon or something? Tasty nonetheless. Soups looked really good, as did the falafel and hummus plates so perhaps we will try those next time!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Delicious merguez sandwich with real hot sauce. Freshly baked bread, pickle inside, great deal for 8 bucks.", "author": "Stephen Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-14", "description": "Introduced to this place by the misses I couldnt help but give it a shot. I ordered the lambanjin and have been hooked ever since. \n\nThe texture, taste and aroma are oh so welcoming....not to mention filling. \n\nThis place also has backyard dining and some of the best service I've ever had in Brooklyn. Did I mention the portions are surprisingly large for the price? \n\nThe staff appears to be new but the service remains the same. They are one star short of prefect due to a rude waiter I encountered a while back....haven't seen him in a while.\n\nThey are (and show no signs of changing) a cash only business.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "best baba ganoush and  hummus i've ever had. pita was a little hard and dry, but with the quality of every thing else little was to be desired", "author": "Ellie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "Absolutely DIVINE!!!  As a Michigan native, more specifically, someone who grew up eating authentic Middle Eastern food, I am beyond impressed with Bedouin Tent.  The food is fresh, well prepared, filling, and reasonably priced.  \n\nMy friend and I ate there for lunch today around 2pm, and I'm still satisfied as I write this review at 9:16pm.  I will definitely be back!!\n\nPlease keep your food authentic and fresh!!!!!", "author": "Imani K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Out of the many reasons I love this place, their freshly baked Pita bread comes first. Plus great vegetarian options and a very good service. Also, Bedouin tent is absolutely baby friendly and the prices are hard to beat!", "author": "Ma L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "Mmmm, Lambjin with extra garlic and parsley and falafel sandwich very good I just ate there. Been coming here for a few years and has never let me down. Cozy eating area in the back of the restaraunt.", "author": "Gary W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "My favorite restaurant by far! Great authentic Mediterranean food, brick oven for amazing pita bread.. You must try there lentil soup it's to die for! Honestly everything you eat here is so yummy", "author": "Brenda V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-25", "description": "We were walking down Atlantic Avenue one a cold day and could smell the food from here down the block.  It smelled terrific!  Out of all of the places we could have decided to eat, I think we made the best decision ever when we came here.  All of the dishes focus our their amazing homemade pita bread.  It is interesting that their pizza is just as good as their other food, when most places just focus on one or the other.\n\nThere is a very nice seating area in the back that is served by one waiter only.  However, the service is fairly fast and has a small town feel.  They have great cold salad dishes that go well with bread, and you can order a sampler salad to share with friends.  \n\nThe pizza here is excellent.  We had the sun dried tomato pizza, which was simple and rustic.  We also had the lamb platter, which is also simple and not overly seasoned.  Their hummus is rich and creamy.  The falafel is not as crisp as I normally like, but it has great flavor.  Make sure to add feta to your dishes.\n\nThey are also known for their mint tea, which I highly recommend.  Cash only.", "author": "Coty S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-10", "description": "I like the food in this place but the service is a nightmare. Just try calling! Don't expect to get a smile or even a friendly smirk. Too bad because the food is good. They seem not to want to grow. They desperately need new faces and someone answering the phones.\n\nThere's no women working here! Nowhere!", "author": "J C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-08", "description": "Do not be mislead by the photos of food at this restaurant. I went here for dinner and had a spinach and cheese pie, and also a falafel sandwich. Both were extremely dry and flavorless. The waiter hardly greeted us when he brought our menus and wasn't attentive aside from taking our orders. If you're looking for authentic and flavorful middle eastern food, this is not the place. Also this restaurant only takes cash. There is a tiny sign at the front which you will not see unless you stop near the register and look very closely. There is no indication on the menus that cash is the only form of payment accepted. They do have an ATM in the front but there's a surcharge. My dining experience here was underwhelming to say the least. I would not recommend this restaurant to anyone in the Brooklyn area.", "author": "Laura H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Wow!! It's so hard to find a place that has great service over the phone and punctual with their delivery time!! The food is SO good with such great flavors! I cannot wait to order again!", "author": "Krupa S."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}