{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "The bread and the dough in this place are phenomenal. I haven't had such good Zaatar mana'eesh since I left home. The Zaatar and spinach pies were really good but the hummus was not, falafel were good, salad was fresh and perfectly soaked in delicious olive oil. I'll definitely be back!", "author": "Leen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "I've been here a couple times. I went with a couple family members last night and it was delicious. Huge portions and great price.", "author": "Ricky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-10", "description": "Bedouin Tent is a neighborhood gem!  I'm definitely a fan of Middle Eastern food, and this place does not disappoint.  I went with a dining buddy, and I ordered the falafel platter as my entree.  He ordered the lamb platter.  We shared a spinach \u0026 cheese pie appetizer, and some semolina cake for dessert.\n\nThe food was really delicious.  Everything was seasoned perfectly, the pita bread was fresh and hot, the service was quick \u0026 friendly.  I highly recommend trying the spinach \u0026 cheese pie appetizer; it'll remind you of a calzone when they bring it to the table.  My only gripe was that the semolina cake seemed a little dry, but I'd be willing to try it again.\n\nWhile it is cash only, I feel the prices are pretty cheap and that you get more than your money's worth.  I look forward to my next visit!", "author": "Jaszon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "Was brought here on a date once.  I was skeptical.  The menu was unfamiliar.  Tried the Pitza w/roasted tomatoes, olives and mozzarella.  OMG!  Heaven in my mouth!  The staff was friendly and attentive.  I've been back a few times since.  As a matter of fact, I think my daughter and I will go for dinner tonight! :0)\n\nCash only!", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Love this place. The five-salads is a fantastic value and one of the healthiest take-out meals in the hood. Wife likes the pitza. And I like the lamb sandwich and lamb plate. The guys who work here are nice and provide friendly service.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Great quick, filling, and healthy dinner before a show at BAM.   Had the Harira soup....chickpeas and lentils, superbly seasoned, with fresh lemon on the side.   Also ordered the small babaganoush with fresh pita.   Terrific.   Not overly salted or garlicked like some other places do it.   Cheap prices, and the dining room and patio in the back is nice.", "author": "Dean W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "Come here if you want some affordable hummus, fresh pita, and lamb (or falafel) in downtown Brooklyn! They have table service in the back where its decorated in this bright Egyptian wall decor. Bedouin Tent provides a lot of good fresh foods for a good price. And PLEASE get the almond honey cake for dessert, I still dream about it. \n\nP.S: BRING CASH to this casual spot", "author": "Lauren T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "Falafel wasnt as good as expected. Definitely not the beatbin ny. The pita was fresh and amazing. Hummus was really good. Portions were big.", "author": "Sim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "A small restaurant in the back of pita shop, great for a cheap, quick and casual dinner.\n\nI ordered the falafel plate - portions are huge! 4 falafels, salad, hummus and their amazing fresh baked pita. ($7.50)\n\nI also ordered a beet salad - quite big for a small - which was very refreshing.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "Popped in as passing and enjoyed it. Nothing fancy; fresh, tasty food and they did a nice job with the dining room in the back. It's cafe style: good food, priced well. Enjoy!", "author": "Simon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "Wow, I just had the BEST PITA bread of my life! It's so soft, warm, and chewy here.. I've never had anything like it. Is this how pita bread is supposed to taste?? I feel like I've been deceived all my life. I ordered the lamb plate and it was a decent portion so I couldn't even finish it after eating a whole pita. The shaved lamb was very flavorful and tender. I also tried their chicken, and it was also delicious. They put a lot of peppery spices onto their meat. The plate also comes with a big serving of light and authentic hummus. Just a fantastic meal at an affordable price.\n\nService can be a bit slow, which is why I can't give it 5 stars. But other than that, would definitely come again or order delivery.\n\nAlso beware, it's cash only!", "author": "Susanna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "Highly recommend everything on the menu that takes advantage of their freshly baked breads, as well as any lamb dish. That said, it's also for diners requiring vegetarian or vegan options. Note that serving sizes for the mains and soups are generous.", "author": "Olive F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-23", "description": "Falafels are a personal favorite of mine, so judging their taste is a matter I take seriously. What drew me to Bedouin tent is the focus on the fold rather than environment. The falafel sandwich for 5.50 was a decent price, though on the steeper end in comparison to vendors in the area for 3 falafels in a wrap. Worth a try if you're in the area.\n\nThey are cash only, a fact that has at times limited my options on the menu.", "author": "Omar S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Don't Judge a book by its cover! Give this diamond in the rough a chance. The food is great and the service spot on.", "author": "May D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "Has quickly become one of my favorite restaurants in Brooklyn. Fucking love the spread platter! AND SO CHEAP.", "author": "David G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-19", "description": "Came here for a quick lunch. Got the veggie platter, where you get to choose five of about ten different salads. I chose hummus, baba ganouj, stuffed grape leaves, tabouleh and chickpea salad. Served with a large, freshly baked pita. It was like $12 after tip without a drink or any add-ons.\n\nThe hummus had a really nice flavor, but my other four salads weren't all that tasty. The pita was fluffy, soft, warm-from-the-oven, and was probably the best part of the meal. \n\nThere is a nice outdoor patio in the back where you can sit and eat. I would probably just get the hummus and pita next time.", "author": "Nicholas A R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "Grow ups always say to admit when you're wrong. Aside the first impressions, I as wrong, star added. This place has been consistently good. It is my go to place for lunch.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "You really can't beat a place that can make their own pita from scratch!!!\n\nA few of us came here for lunch on a Sunday and saturday at their back patio. It's not the greatest patio but it did serve it's purpose as the weather was really nice that day and we weren't being distracted with by a passerby walking on the street as we're eating.\n\nI ordered their grilled chicken sandwich with tahini. Unfortunately the chicken was a bit rubbery and it wasn't grilled as advertised--very disappointing. Instead, it tasted more like saute chicken with paprika, nothing special. Normally, I would have given them a three-star rating for this, but when I had the chance to try both my friends Pitzas, I was immediately taken back and thought WOW! Their Green Pitza that include leeks, scallions and fenugreek with light mozzarella cheese was so good. It had a light onion smell but not too strong with a mild after taste. They also did not skimp out on the toppings so the pitza was really rich and cheesy. \n\nTheir Lambajin middle eastern pitza with lamb, onion, tomato, parsley and spices was just as yummy. It wasn't gamey and left a sweet after taste from the veggies, tomato and spice. \n\nOverall, I really enjoyed my time here and watching adorable sparrows popping in and out of the surrounding trees was delightful and tranquil.", "author": "Nga C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-15", "description": "I love this place, I have been going here for years. The food is always delicious and quick to order. Service is always great. I love the lentils and pita bread the most. \n\nI gave it 3 stars overall because the atmosphere could use some improvements and my husband did get sick once after trying their falafel.\n\nAlso, I do get discourage sometimes if I'm in the area and want to drop in for a bite as this place is cash only and I don't always have cash on me. Get with the technology Bedouin!", "author": "P. N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Best Mediterranean food! I always come here when I visit from California.  Generous servings, friendly staff, and great price. Could not ask for more! Thank you for the dessert!  Will be back again.", "author": "Jan L."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}