{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-27", "description": "the chicken was amazing!! i was disappointed when my friend and i were refused entry into their outdoor eating area after ordering our food. they said it was table service. if you want to play that card,  you better get your wait staff ready.to explain your policy.", "author": "Greg V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "Yum, yum, yum. The chicken  pitza wasa cheeseless pie on a homemade pita bread with a delicious combinate of spices and grilled red peppers. The hummus was delectable.  The garden salad was a hearty mix of feta, grape leaves, and artichokes. Prices are very reasonable. You can get a falafel sandwih or hummus served with delicious homemade pita for $4. Though it seemed like at least half of the people were getting the middle eastern  \"pitza\"\n\n\n The afternoon we were there it was fairly comfortable even though it was 90 degrees outside. The music playing inside could be described as middle eastern electronica. Alot of color is used in the decor. There's an outdoor garden that looks like it would be nice when the weather isn't so sizzling.", "author": "Maureen W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-09", "description": "This place kills me it so delicous. I mean that lamb sandwich??  Come on!", "author": "Heather P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-26", "description": "Lovely random find whilst on a stroll through BK.\nFresh fare, wonderfully seasoned and excellent service.", "author": "Natasha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "WOW What a pleasant surprise! I've started hanging out in this part of brooklyn only a few months ago and to be honest, I'd rather come here than any other falafel joint I've been to in the city. AMAZING prices, GREAT customer service, COZY \u0026 beautiful decor, and during the summer a beautiful backyard! I loved the Mediterranean lights and the Bedouin tent. But, besides the decor (I'm an artist, so I can go on forever), the food was perfect. Usually Mediterranean food has too many spices, but this place has it down perfectly and you don't leave the place smelling like coriander. On top of that, the pita is made fresh! It comes so warm and delicious. Best pita I've ever had. They've got fantastic salads. You can tell the hummus is made fresh, so creamy! This is where I'm going from now on when I need my falafel fix. Also all the guys who work here are very nice. GO HERE!", "author": "Molly S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-28", "description": "I am one of those girls who loves falafel-type restaurants, but never orders falafel. I like mine baked...\n\nHowever, this place has soo many lovely little side dishes. Roasted beets with olive oil and parsley is probably the best thing ever made in my life. The baba is fantastic, my first harira soup experience was here, and I've learned my lesson to never order it anywhere else. The grape leaves are so fresh and flavorful. And oh boy, don't even get me started on the huge head-sized fluffy pita.", "author": "Amy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-05", "description": "Just called to make sure they were opened on July 5th evening for dinner to what the person that picked up the phone replied \"what do you think\". I was not sure I had heard correctly and re-stated that I was calling to make sure they were opened and he did say \"what do you think\" again! Sooo mean and disrespectful.\nAlways had a good meal experience on this place but will not accept that kind of treatment. Sorry guys you have lost two of your every weekend customers...", "author": "jenmac m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-03", "description": "Places like Bedouin Tent reminds me why I like food.  On a recent day, I was walking back to the office from a meeting and came across a big sign that said PITA!  And the lofting scent of fresh-baked goodness drew me right in to order a leg of lamb sandwich (with onion, tomato \u0026 homemade lemon-mine mayonnaise in fresh pita) and a side order of grape leaves.  Both were fantastic and the sandwich was still warm after 20+ minutes before I could eat it.  Great food for a good price! Who can say no to that?!?", "author": "Yosh H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "Bedouin Tent on Atlantic Ave in Brooklyn has wonderful felafel and beautiful pita! Everything is fresh an home made. Quite a lovely spot for lunch!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-28", "description": "I love finding authentic little places like Bedouin Tent that you can get a very tasty meal with huge portions for not a lot of dough! The outdoor garden is great place to sit on a warm sunny day. \n\nThe hummus and tabbouleh were very fresh and tasty and served with fresh, warm, yummy pita bread. The Merguez platter was fantastic-- the meat was seasoned and cooked perfectly. The falafel sandwich was also really good and fresh--this is a big deal since I am very picky about my falafel!\n\nThe service is good and the food comes out pretty quickly. It's definitely a great lunch place to stop in for some tasty middle eastern food that won't break the bank!\n\nPS: Like so many other little places it's CASH ONLY!!", "author": "Deanna D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "so good! so good! Stunning falafel, incredibly wide delivery zone that is surprisingly speedy (all the way to Park Slope) and excellent excellent baba ghanoush. the zaatar bread / pita makes me well up in tears over the years I wasted not having it in my life. Nice guys on the phone\nNot the best falafel in the area, hence the four stars. That award goes to Damascus with its freshly made salads, pickles and authentic spicing (pomegranate hello! )", "author": "Tom C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "This place is great. There's almost never a wait, the food is excellent and cheap, and the atmosphere is low-key and kind of funny/funky. It's great for vegetarians. The lentil soup is excellent and the pita is so fresh and hot. Perfect for a cool evening! Also the garden is nice.", "author": "Allison N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "Maybe it's just what I ordered the last two times, but the falafel sandwich was nothing special and the lamb was too oily.  Good service and great prices, but I just wasn't impressed.", "author": "Charles F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "Very very good!! I was pleased...had the falafel platter. I might make this place a regualr spot!...esp in the summer they have a really cute outdoor eating area in the back. My only issue with BT..was the hummus...not the greatest...but aaight. The pita was FREAKING FAB..warm and chewy...damn....I wanted to order like 3 more..\n\nIf you plan on going I would say to watch out for the PITA sign outside...if you are driving by..cause you cant really see the Bedouin Tent name driving by.", "author": "Bev G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "I had my first falafel experience here! I'm a believer now.\n\nEverything is made fresh and it's all very delicious. When my little brother and I go, we always start with a Garlic Pita Bread [fresh garlic and parsley strewn about on top] - we always add a little salt to taste, even though you probably don't need to. And our main course is a Falafel sandwich.\n\nI haven't been brave enough to try anything else, but I always find myself gawking at what other people have ordered. The salads look delicious.\n\nIf that doesn't fill you up, order a side of Pita Bread or some Baklava. They normally give a free piece of honey bread with your check...so yummy!!", "author": "La Toya L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-28", "description": "I love this place. They make their own pita, and they are actively pulling it out the oven, punching it down and putting it straight on plates, so you know yours is fresh, and it will likely be fresh enough to be warm. I'm a sucker for most things sausage, and the merguez sandwich is no exception. That said, the lambaijin pizza is a close rival. Particularly with a layer of hummus smeared on top. \n\nThe sign in the window tells me that they got a health grade of 'B', which is good enough for me, given that it's cheap and delicious and two blocks from my house.", "author": "Angela G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "Wonderful wonderful wonderful. I get the mergueze plate which is perfect with pita bread hummus. The food is delicious and very very cheap. One of my favorites.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-14", "description": "The outside dining area at the rear of the restaurant is peaceful and a great place to spend a couple of hours on a sunny afternoon.  We only shared a \"pitza\" so it's a bit hard to decide how good their food is.  I will say it was a bargain at $7.  Their hot sauce (\"shaata\") isn't as great as Tut's but then again, Tut's is the supremely bestest hot sauce in the universe.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-07", "description": "Fantastic, delicious, 2 ate under $16 for 2 platters w/ sodas + outdoor garden-not to be missed!! Deserves 10 Stars! First time visiting. GO!!", "author": "Jan Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-09", "description": "Pitas are the best I have ever encountered, and the lentil soup is surprisingly addictive.  Nice guys working here.  One of my top 5 Brooklyn eateries.", "author": "Misa M."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}