{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-17", "description": "Oh Bedouin Tent, how I love you so. This place has been around forever, and is reliably awesome. Incredibly fresh pitas, excellent baba and hummus, really good \"pitzas\". The people who work there are really friendly and seem to make a point of acknowledging regular customers with a friendly hello. I usually get take out but actually always mean to eat there more, since the space is really beautifully decorated. The back garden in the summer is absolutely fantastic and really peaceful.", "author": "Susan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-23", "description": "The falafel wrap was not as saucy as I would have liked, but the freshly baked bread more than made up for it.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-31", "description": "I stopped in here for a bite and was able to take advantage of the outdoor patio on the warm Brooklyn day.  I asked the waiter to recommend his favorite thing, which was the lamb, so I got the lamb. The lamb plate came with totally undressed iceberg lettuce and the wateriest hummus I've ever encountered in my life.  Thankfully the lamb and fresh pita and mint tea were tasty, becuase those were the redeeming qualities of the meal.  Also, cash only without a big sign in front saying so? Total boooooo.", "author": "Maryam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-08", "description": "we had the chicken sandwich and falafel sandwich with real homemade (i think) PITA bread that tasted like no other i've had before! it's not thick like the bagged grocery store kind that some places use. the 'hot sauce' is mild and delicious but if you want heat, ask for extra. outdoor patio is so cute. i want to go back and try the 'Pitzas' that they make right in front of you, hot and fresh!", "author": "Linda T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-03", "description": "What can I say - Bedouin Tent might just have the best falafel in the city.  The pita is perfection - always made to order.  Love this place - just wish they served alcohol or were a BYOB.", "author": "Jennifer J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-17", "description": "Mmmm... I'm always in the mood to get a falafel sandwich or their pitzas. Their pita bread is always fresh and has the perfect taste + texture. And... all at a good price! Fantastic.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-12", "description": "They fry the falafel once in the morning and microwave it during the day! Chicken tasted weird, definitely not middle eastern or Mediterranean.  Also tables were not clean. Would not come back.", "author": "Farouq A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "excellent falafel and pita pizzas. come here every 1 or 2 weeks for lunch. good price, friendly staff. have yet to dine in however", "author": "Irene B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-19", "description": "This place is fantastic. The food is fresh, delicious, and -- on the whole -- pretty damn cheap (fresh-from-the-oven pita for $1? Yes please); the people who run it are lovely; and the portions are generous. The only downside: it's cash only.", "author": "Julie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "The freshest and most delicious vegetable \"pitza\" bar bone. I have it at least once every week.", "author": "Shazza F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-28", "description": "great staff very friendly, if only they would place napkins on table so you dont have to ask for it, would be great", "author": "John E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-22", "description": "The bread. The bread. The bread.\n\nThis place is really something special, but mostly it's about the bread. I comes fresh out of the oven in front, and it works wonderfully holding together a sandwich, dipped in lentil soup or underneath a personal pizza. \n\nI've been eating here for the last few years and have never been disappointed. The food is tasty and very filling. The service is always friendly. And the price is just right. Definitely worth a try if you haven't gone yet.", "author": "Jed L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-27", "description": "Seriously I drive across Brooklyn just to come to this place.  This place is small, but its all worth it. Their fresh baked pita is to DIE for. Lentil soup, tasty, falafels delish. Chicken platter yum-o. Pita pizzas-great!  Minus a star because they dont take credit cards.", "author": "Meks N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-11", "description": "fast and fresh peta is amazing!!! check out the patio in the back in the summer!", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-23", "description": "I don't frequent Middle Eastern or Mediterranean places so I can't really compare, but this place is clearly authentic and offers fresh and delicious food! After walking down Atlantic Ave one day  I recognized the name (from reading on Yelp!) and stopped in to get a menu. The staff was so friendly and I was impressed to see the fresh pitas being made. I went back later that night and ordered the falafel platter with 1/2 baba ghanoush and 1/2 hummus. The pita was definitely the best part; for one it was HUGE (I barely finished a 1/4!), obviously fresh out of the oven and flavorful! The rest of the platter was also really good, and what a steal - $6 for 4 falafels,  hummus, a salad (with incredible dressing) and the huge pita! Will definitely be back to try again as well as other dishes!", "author": "Davi H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-20", "description": "this place just keeps getting better. after our delicious lunch the lovely wait staff gave us samples of the semolina honey cake which was, of course, amazing!", "author": "luckysquid m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-25", "description": "Pitas are made fresh every day.  Babaganoush is better than the hummous but all around wonderful food.  Good Chicken pita sandwich.  Perfect for delivery on weeknights.", "author": "Claire G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-01", "description": "3.5 stars.  would be 4, but i'm deducting a half star b/c they forgot the white sauce on my falafel sandwich takeout order last night.  as tasty as their falafels can be, this quick dinner option is a little bit of a let-down w/o the requisite white sauce.  sure, i coulda made the short trip back to rectify the situation, but hey, this is fast food, or at least a meal on the go.  but if it requires going back, eh, what's the point?  my quick meal would then be a wait-around-explain-the-situation-get-new-falafel-b/c-old-one-is-old-and-cold kinda thing.  or in other words, trouble.  and who needs trouble when all you want is a quick bite of deliciousness?   not this gal.  but of course, i remain charmed by the fact that they make their own pitas, right there in the front room, so that the smell and sight make you hungrier than you originally thought.  just check for white sauce before you leave.", "author": "Tina E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-04", "description": "Excellent Middle Eastern quick food place but it also has very cozy small place to eat and outside sitting in the summer. But perhaps most important are the guys that work at and run the place. Super friendly and very helpful. They make their own pita bread and it's delish!", "author": "E P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-21", "description": "Great food (had the hummus, baba ghanouj, green pitza, falafel, and, of course the amazing pita!!) and cheap.  And they do have a/c if you sit inside (we thought it was going to rain).", "author": "Ishkabibliophile Z."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}