{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-18", "description": "I love this place!  I've lived within a couple blocks of them for about 10 years now and they're great.  They are a go to for take out or delivery for me.  I usually order their lentil soup w/pita bread.  $5 = warm delicious dinner = I'm happy.  \n\nThere might bebetter places in the area now (again, I've lived here for 10 years and this place is my habit/comfort food), and sometimes the person answering the phone speaks less than perfect English.  Overalll, though, I really like the place and have gone there to dine in with friends and taken out of town guests there and had good experiences.  They have a very lovely, albeit a little quirkly, outdoor space.  I also love their garden salad - fresh ingredients and it's fairly healthy.  They'll vary what goes into the salad depending on the season/what's fresh.  I appreciate that.  \n\nBasically, this place is the real deal, quirky, local, good food.  I think they're cash only, and BYOB, but check first.", "author": "Andrea F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "So consistently excellent! After coming here since they opened over a decade ago (and eating all over), I feel really comfortable calling Bedouin Tent the best Middle Eastern in NYC.", "author": "malcolm e."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-19", "description": "I went to this place about 5 years ago and remember really liking it.  My boyfriend and I went today and it was a huge disappointment.  We had the harira soup which tasted like something out of a can with a few extra lentils added.  My boyfriend got the merguez which was overly salty and greasy.  He couldn't eat more than a few bites.  The salad on his plate was tasteless as was the baba ghanoush.  I ordered the chicken pitza.  The chicken was very poor quality.  It seemed as though they just threw everything onto the pitza without caring whether or not the flavors blended well.  They don't seem to care about quality in this restaurant and really don't care if you are satisfied or not.  Eating should be a pleasure and this definitely wasn't.", "author": "Camilla L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "Full disclosure - my daughter used to date a waiter from this place. The food is so good though, so please consider this objective! I have never had babaganoush or hummus this good. I don't know what they do to it, add crack possibly? its smokey, creamy, and fresh. no booze offered though, thumbs down on that!", "author": "Patricia B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-16", "description": "MP and I were in the mood for some tasty Middle Eastern/ Mediterranean food. When Middle Eastern cuisine comes to mind; I think of big flavors, vibrant spices, and hot pita bread.\n\nOh--was I wrong. We ordered a five combination salad platter and (I kindly) asked to omit grape leaves because MP isn't fond of them. Server comes back with grape leaves on the salad-- I kindly ask him if he can take the grape leaves out. He is slightly put off--and gently swipes the plate away.\n\nIn the meantime, my leg of lamb platter arrives and this time--there is no point of return. WHAT IS THIS--I thought. The slices of lamb are grey and dry. Is the kitchen staff taking shifts on cooking this same leg of lamb over and over again? I've finally given up on the dish when I tasted it.\n\nMP's leg of lamb sandwich arrives at the same time--which is the exact replica of my grey leg of lamb platter (half the price)--Picture my dish rolled up on a stale pita. Voila.\n\nServer comes back with the five combination salad. First glance: no grape leaves. Second glance: no feta. Where's the feta? They gave us fava beans, instead. MP wants her feta. She immediately flags the server (who is already not happy with us) and tells him that we didn't order fava beans. Server (turns red) lashes us with loud rants \"I had to throw the first order out...!\" (and some words in his native tongue). He was so enraged and staggered--we couldn't help ourselves but laugh (completely involuntary). To help mitigate the situation , I order the feta separately and the waiter storms off.\n\nThe rest of the story is history but I must say: this is one of the very few times that I felt that I was inconveniencing a server while he was on the job. But we did get a good laugh. It was kinda worth it.\n\nOne more recap: when we asked for the check, he seemed surprised to see so much food left over. He demands \"Take rest, to go!\"", "author": "Amy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-01", "description": "This is my favorite restaurant in my area. The food is quite reasonably priced, the service is good whether you dine in, carry out, or have the food delivered. We have done all three. I ordered from there today, a Friday, at 8 pm. The food was at my house within fifteen or twenty minutes (granted, I live about a quarter of a mile away). It was hot and as always, amazingly good.\n\nEvery time I have been in, the service has been great. The staff is all very friendly and attentive. The garden is very nice when the weather is good, but it's also nice when you sit inside.\n\nI've ordered most everything on the menu and it's all been fabulous. Their falafel is the best I've ever had, and along with their fresh, home made pita, is my favorite to the point that I crave it sometimes.\n\nThe only time I've had to walk away was when I tried to order 5 pitas (and nothing else) for a potluck I was attending on a Saturday evening. It was explained that it would be an hour, since they were very busy and had a lot of delivery orders, as well. They were very nice about this, and I understood their point, so I bought pita elsewhere.\n\nThe next time I did that, I ordered it early enough that I didn't mind if it took longer, but since it was a slow time, the pita only took a few minutes to be ready.\n\nThey only accept cash, but that's OK by me considering that the food is so inexpensive and good.", "author": "Wendy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-05", "description": "The food is good for the price... suppose.\n\nThe service is terrible, they need to get rid of that big old guy, who seems mad at the world.\n\nWon't be back.", "author": "Al B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "I went here for lunch and thought this place was really cool. With a friend split a falafel sandwich and a three selection salad. The presentation of the food was great, food was fresh, and an overall great experience - and only $10 a person.. For lunch - this place is definitely worth going to (considering for the same cost you get a burrito at Q'doba). I'd like to come back and this place out for dinner too.", "author": "Dew P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-25", "description": "Yes, there is a garden. Is it Xanadu? Probably not. But it's nice. The service is friendly. The food is just fine.", "author": "Sir M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-14", "description": "Coming from Lebanon, and having tried a LOT of \"Arabic\" restaurants here in the US, I have to say that this is one of the BEST.  The freshly baked pitas are just the right thickness, and come piping hot out of the oven.  The Zaatar (thyme) pitza is deliciously authentic, and closely matches the Man'oushe it aims to replicate.  The baba ghabbouj is excellent, bursting with the flavor of garlic and charred eggplants, and the falafel are crispy, with all the right spices.  The chicken sandwich is better than the meat, and the spices on both smack more of South Asia than the Mediterranean.\n\nThe caveat is that you have to be careful what to order, because not all items on the menu are created equal.  The foul (beans) are bland and the hummus is runny and to be avoided at all costs.  Mmm, but when I stick to the good stuff, I can close my eyes and almost pretend that I'm back home....", "author": "Omar C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "This place used to be called \" Mustache\" and one of my regular eat-out/take out places when I lived in Boreum Hill years ago. Just baked out Pita bread is unbeatably fresh and warm and goes well with the freshly made hummas and Tabbouleh. Yummy...... The garden is a good place to hang out during the summer. It is indeed a bit rough but, feels like eating in your own garden. \n\nMenu is not pricy at all and the portions are generous to fill you up. I always feel like it is such a deal and easy. But most of all, the freshness of dishes are the best value in this place. Tea menu in this place is quite good and exotic. Love mint tea. \n\nI have seen a Mustache in West Village and wondering if it is the same owner. but that one did not have a garden and is smaller.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-11", "description": "This Place has a very calm setting, and when you come in the cooks are in the front, and the seating is in the back, but I loved their Falafel, and Hummus it was amazing, as well as their baklava I highly recommend it and they were really cheap, but I overall had a great experience.", "author": "Breanna T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "So maybe I spoke too soon.  I went back again, and the falafel didn't taste nearly as fresh.  Still good, though.  I took a picture this time also.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-11", "description": "I will never go there again. A roach was running on the counter and the employee, trying to hide a roach from people, smashed it with his hand. He then went on with making food without washing his hands. My friend and I then just walked away. Thinking about all the times we ordered deliveries from there, I was disgusted all day.", "author": "Susan G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "Food is ok not great just ok I have def had better at just about any place in the city that serves the same food, maybe 3 stars. So if you are just grabbing and going it is ok (though I think this area has better food) but what makes it a one star is that the workers have a horrible attitude. One of the worst I have ever seen. The place is dirty as it gets strike 1 (and makes me wonder about the food too). Worse there is a seating area in the back that had no one it yet despite asking twice to simply eat my sandwich there, the workers would not let me just eat my sandwich there and looked at me like I was committing a mortal sin for even bothering them. Memo to the owner if you want to have awful workers that act that treat customers like the soup nazi start making food to match otherwise get workers who have a good attitude, the latin place down the street with the really nice workers maybe can lend you some.", "author": "charles W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "In a time of social unrest in the Middle East, lets take some time to think of the best things this region has brought us - keffiyehs, Arabesque music, and of course, falafel.  \n\nThe falafel sandwich at Bedouin Tent may not be tasty enough to stop a near century's worth of conflict, but it certainly will satisfy the taste buds and stomachs of any passer by. So put down your guns, your bombs, your signs and stop by for some of the best pita this side of the Atlantic has to offer.   If there's one thing we can all agree on, it's the continued survival of the chickpea.", "author": "Lisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-01", "description": "Very authentic and affordable middle eastern food. The hummus was fresh and delicious, the falafel is doughy and light, and the mint iced tea is perfect. The atmosphere is very laid back but still legitimate. Quick service, delicious food at good prices. I will definitely be back to try more.", "author": "Jude D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-01", "description": "AHHHHHHHHHHHHH! PITA!!!!!!!!! AHHHHHHHH!!!!!!\n\nHere is what you should do. Order like 10 pitas from bedouin tent and eat them, with nothing else or nothing on them. Jesus christ, this is the best pita ever. it comes straight out of the oven like a pizza. GODDAMN IT!!!!!\n\nAll the food is good so put something on/in that pita. But goddamn it if it doesn't remain the main event. Fuck. I want one so bad right now.....", "author": "Scott P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-31", "description": "Having grown up eating Arab food, I'm quite skeptical when it comes to places like these. But Bedouin Tent does not disappoint.\n\nFIrst of all, their pita is A. Maze. Ing. Fresh, hot, soft, tasty. Thank god it comes on the side with almost everything on their menu. In addition, their pizza is wonderful (Sun-Dried Tomato Pizza in particular.) The platters are great, though I wish more than 4 pieces of falafel were included in the Falafel Platter.\n\nI recommend the Assorted Salad. FIve salads for 9 dollars is pretty great, in my opinion: all fresh, and all taste great. \n\nMy number one con is that they don't take credit card. Super annoying.", "author": "silly a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-22", "description": "LOVE!!!\nI just adore this hole-in-the-wall on atlantic avenue!\nThe salads are fress - the pitzas are delicious.....you just cant go wrong!", "author": "Amy S."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}