{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "I love the fresh falafels and pita bread. Food is delicious and cheaply priced.\n\nServers are very nice, professional, and attentive.\n\nDecor is lacking completely, but it the food is delicious and cheap, so that makes up for it.", "author": "Anna H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-14", "description": "Dined here recently because of good Yelp reviews. \n\nI ordered the chicken pitza, which was good but too much garlic as the taste was too strong for me. My friend had the assorted salad, which she enjoyed. I sampled her plate and it was really good. The pita bread was delicious and fresh. \n\nThe atmosphere was really nice and peaceful. I'll definitely come back here again to try some other dishes.", "author": "Kali N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "Delicious Mediterranean cuisine! My friend and I had the chicken plate which included grilled chicken, salad, babaghanoush, hummus and pita bread. The portions were huge! Definitely worth the price. We also shared a baklava for dessert and it was perfectly sweetened. The texture was super crispy and flakey. \n\nFrom the outside, it looks like it's mainly for take out but they have plenty of seating further into the restaurant. Beware that this restaurant is CASH ONLY however, they have an ATM machine inside. (+ the ATM machine fee is very pocket friendly) \n\nOverall, I would definitely come here again to try other dishes because everything just looked so good!", "author": "Sunny H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Great food. The freshly made pita was amazing, especially with hummus. I also had the chicken sandwich on a pita, which was delicious. Great prices and great food.", "author": "Ankush T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-17", "description": "Went there for dinner. They have a to go counter upfront but if you head straight back there is an outdoor area with umbrellas. Not really breezy though but it's great as the weather warms up. \n\nOur waiters were attentive and great. We ordered the lamb leg plate and spicy sausage plate. Both come with a small salad, large pita and a side. The main attraction was def the freshly made pita. Once eaten hot, it's so soft and delicious with the hummus, amazing. The downside of the meal I didn't either lamb or sausage that tasty. I think I am just used to different middle eastern meat taste. Portions were good too especially given how large the pita is.", "author": "Mina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Their authentic falafel sandwich is amazing. They are very kind. Convenient location, smells so good inside. One of my favorite hummus spots in Brooklyn", "author": "Andrea Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This is the absolute best middle eastern food I've tried since moving to the city! The price is unbeatable and the portions are huge, I'm so excited to eat my falafel plate again for lunch tomorrow!! Highly recommend the Baba Ganoush and zaatar bread to start! The falafel plate was AMAZING, the falafel were fluffy and flavorful and thinking about their pita literally has me salivating!! Do yourself a favor and check this place out, you will NOT regret it!", "author": "Chelsea M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Perfect food, perfect service, perfect prices. Their lambajiin is pretty close to turkish lahmacun and is soo delicious. All salads are fresh and light. It's a great mediterranean restaurant.", "author": "Zeynep Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-31", "description": "Great food at great prices.  I just moved into the neighborhood and was so happy to discover Bedouin Tent.  The food was delicious.  We had the chicken plate, the five salad combo plate and the lamb plate.  Everything was delicious.  I will be visiting this restaurant often.", "author": "Pamela T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "This is the falafel I've been looking for!! The best one I ever had was in Berlin at Sahara but this one is so fresh pitas are YUMMMM\n\nThey also put a peanut sauce on it that makes it delicious!", "author": "Jerrica J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "Very good food, affordable prices. Nice outdoor seating. \n\nStaff is caring, and hospitable. \n\nDecor has such a comforting vibe. A nice little getaway in Park Slope. \n\nMy go to is always the falafel, house salad, with hummus and pita. I'm always happy when I come here.", "author": "Alexia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "It's all about the food and nothing else matters. As everybody mentions, the pita is insanely fresh and delicious. I had the merguez platter and the assorted salad. Everything was extremely fresh, well prepared and generously portioned. Highly recommend the babaganoush and the feta salad.\n\nSuper affordable with the most expensive item being $13. Everything for the most part falls in the $5-10 range. It is CASH ONLY so make sure you come prepared. \n\nService was quick but could be a bit more attentive. I had to call over the server for anything that was needed but it's a small place so it came quick. Was also brought the bill before they asked if anything else was needed...I clearly needed dessert! \n\nNot a high end establishment by any means, but it's truly worth it. Will be back for more and likely calling in orders soon.", "author": "Jesse S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "This is my 2nd trip here. Last one was 4 years ago and I wasnt a yelper back then. \nThis is a must for any Arab food lover. Portions are big, and their bread (pita) is fucking fresh since they have the tandoor inside!!! they have take away, and a good sitting place. I went in Ramadan, they offered dates, water and the waiter was very patient and elaborate in their description of the menu. Highly highly recommended!!!!", "author": "Haroon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "I have seldom found good middle eastern food in NY there are a few spots The Bedouin Tent is a gem, we arrived around 12:30 pm on a Saturday and saw a small takeout operation at the front and thought we had made a mistake, we were ushered through past the very compact and clean kitchen to a back room that leads onto a terrace.\nWe ordered a mixed plate of veg salads that came with the best fresh pita I have had in the city, we then had a lamb pizza without cheese kind of thing amazing stuff a little spicy with lots of flavor, we also had a lamb plate with Baba and salad and another pita came, everything was amazing.\nOthers were eating soups that looked good and the falafel looked great too, when the bill came it was $34 !!!!! We brought food home too.\nWe will definitely be going back soon.", "author": "Huw P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "This is one of the best Mediterranean restaurant in Brooklyn. The price is reasonable and pizza is really good here. Also the plates are very good. Service can be slow.", "author": "Ferdous A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-15", "description": "Love this cute little restaurant in downtown Brooklyn! The place can get crazy busy at times, and for good reason. This place churns out solid Mediterranean/Middle Eastern food for really affordable prices!\n\nThere's indoor seating in the back, and also a small little backyard area that's open when the weather is nice. As others have pointed out, the service can be spotty at times...I feel like during busy dinner hours, food can take a while to come out too because they are in a mad rush trying to fulfill to-go/delivery orders. I wouldn't recommend coming here for a sit-down dinner if you're in a rush to be somewhere. The place is cash only (unfortunately) but they do have an ATM at the front of the restaurant for your convenience. The falafel is good, and so are the chicken and lamb that I've had...but the fresh pita straight out of the oven and paired with the hummus is the BEST! The pita alone is worth a stop.\n\nDef recommend this place for solid, reasonably priced Middle Eastern food if you're in the area.", "author": "Gene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "Little hole in the wall making the best damn falafel I've ever had. Period. And the pita bread! My god! Soft but also a little crusty. I was in heaven. The older gentleman who works behind the counter is super nice too, and he kept giving me free samples of this pastry that was sort of like baklava but different (wish I knew what it was called but IT WAS YUMMY!)\nWill absolutely come back here. I'm happy to provide a nice place like this business.", "author": "Mary H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "One of my favorite recent discoveries! \n\nI've been on a hummus kick recently (aka I have been drinking hummus at many Greek institutions around Manhattan like a disgusting person) so  it was only inevitable would I eventually end up at Bedouin Tent. \n\nThe restaurant is pretty small at first glance, but it hides a very nice and cute space in the back for people who are eating in the restaurant. If it's your first time going there, walk past the counters where they make the food for take out orders and you'll come to a back dining room with a cozy ambiance. Every time I've gone there, I've been one of the only customers but as I eat, the place will gradually fill up. I'm not usually too picky or care that much about ambience, but I like how intimate but casual the back dining room is. I can't wait for the weather to get warmer so I can sit outside! Also, they are very nice and the service is attentive, but not stifling.  \n\nEach time I've gone, I've only gotten the chicken platter which comes with a huge pita (honestly I think its like 10 inches diameter...why do I eat it all...). It also comes with a huge dollop of hummus, a lightly dressed salad, and a lot of chicken. There's also this little sauce in a cup that I have no idea what it's called, but I dip my chicken in it and all my worries wash away and it's just me and that sauce and my chicken. Better than meditation, seriously. The sauce is kinda nutty and creamy, but has a really strong flavor. The chicken is consistently cooked very tender and juicy - I'm not even a fan of chicken breast, but I loveeeeee the chicken breast here. The hummus is awesome, it's smooth and rich. If it was socially acceptable to my dining partners, I'd probably JUST LICK IT OFF THE PLATE. I'LL PROBABLY JUST DO THAT ONE DAY. The dish goes for $13 which is very reasonable considering the amount and quality of the food you get. I highly highly highly recommend if you're in the area!", "author": "Katherine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Excellent... I wanted a quick take out on my way home from work.it looked like a real hole in the wall but because of the reviews I decided to try it. I got eggplant and grape leaves... and the bread it came with... so incredibly delicious. Food was amazing and the workers were really nice. Definitely my new go to take out ..", "author": "La Rubia V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Probably one of my favorite meals when I visited the east coast. This quaint little establishment is a must-visit when you're in the Brooklyn area. And for the prices, you can't go wrong. \n\nI had the spicy lamb \"Pitza\" and it was hot and delicious. It's a pizza style dish where the crust, I'm assuming, is made of pita bread. Very hearty and perfectly spiced. I was surprised at how big it was. 2 people can easily share this. My friends got a lamb wrap and a spinach mozzarella \"calzone\". Their hummus was great too. Prompt and attentive service. Will definitely be back.", "author": "Khristine C."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}