{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "Bedouin Tent is one of those places that you walk by on the sidewalk and so many amazing smells are coming out of it you go \"WHAT IN THE EFF ARE THEY MAKING IN THERE AND HOW CAN I GET IT IN MY FACE ASAP?!\"\n\nI've only dined in, but I know they deliver as well. A lazy meal in their backyard when the weather is nice is a fun way to spend an afternoon.\n\nThe menu is good, simple Middle Eastern food. Everything we've had there has been delicious and satisfying (generous portions). \n\nIf it's your first visit, make sure to get the Z'aatar bread.\n\nCash only!", "author": "Diana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "Bedouin was a divine sign from above.  We were starving after a concert, which ended around 9:30 and hadn't eaten since noon that day. We were stumbling on Atlantic Avenue, and lo and behold Bedouin takeout was available like a beacon in the dark!\n\nMy two friends had never tried falafel(!), so it was time to also do some new culinary introductions. I split the chicken wrap and baklava with my sister. It took a bit of time for a takeout place but the wrap itself was made from scratch.  The wait was worth every bite, and for 4 people, total cost didn't even amount to $20!  We were stuffed and happy.  The baklava didn't blow me away - there wasn't enough honey nor pistachio nuts, but Bedouin did a great job on the hot sandwiches! Total [cheap] gem for Brooklynites!", "author": "Gera K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "Best Zaatar in the universe. Really delicious freshly prepared food. The pitas are baked to order. The hot sauce is real Harissa,  There is a slightly jenky patio which is somewhat like a Persian oasis on Atlantic Avenue in summer. The staff is kind enough to advise me not to order too much food (which I do anyway). A great destination or roll by for lunch.", "author": "Kenneth A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-24", "description": "I fell in love with a sandwich this weekend.  It was magical...\n\nOnce upon a time, during the walk from Carroll St to Target, I started getting hungry.  First, I inhaled a restorative pork bun at Eton Too.  After a few blocks, I was already regretting not picking up a few dumplings or a Hawaiian shave ice.  I tried supplementing at a soul food restaurant, but the deep fryer wasn't working.  I left.  My mac and cheese would have been so lonely without some fried whiting to keep it company.\n\nSuddenly, like an Oasis in a desert full of antique shops, Bedouin tent glimmered across the intersection.  I walked in to the inviting sight of plump mounds of pita dough happily rising on the counter, peeking up at me mischievously from under a red and white cloth.  (Note: it is possible that I was just hungry and delirious.)\n\nI ordered the falafel sandwich ($4) for 2 reasons.  After the soul food fake-out I needed fried.  Also, there were a bunch of articles on the shopfront about the falafel.  At 4 bucks, I didn't expect much.  Maybe just another little sandwich to tide me over for the rest of the walk.\n\nIt was MASSIVE!  Decadently, gloriously large!  The best falafel sandwich I have ever had the privilege to devour.  Every girthy bite was loaded with tahini, lettuce, delicious falafel and chewy amazing pita bread!  I planned to eat half and save the rest for later.  Saving be damned!  I ate the entire thing in no time at all.  You MUST GO TRY THE PITA!\n\nNext time, I'm getting the babaghanouj and checkin' out the the tent space in the back :)", "author": "Ida C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "Homemade bread, beautiful and cozy backyard cafe. Food tasted homemade. We had a few appetizers to share, a lamb entree and a chicken dish. This is my go to place when I'm in the neighborhood. If you are looking for down to earth home cooking, go there and you will get a satisfied meal.", "author": "L T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-12", "description": "A close friend of mine got food poisoning from this place - I was with her when she ordered the food and was her person when she got sick.  This was when they had a B/C rating from the city but I think they now have an A.  Diner beware!!!", "author": "Chris D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "Wonderful cheap eats spot in Boerum Hill..  This review is for take out only.  I get my hair done across he street and this place has become a tradition for me.  Delicious fresh baked pita, non-greasy and fluffy falafel.  I may dare to say one of favorite falafel sandwiches I've had in NYC.  I have also tried the chicken sandwich which was tasty.  But the falafel keeps me coming back.  A must try", "author": "Devorah D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "Legit falafel sandwich. The bread really makes it.. so fresh and delicious! Will definitely come back to eat in the restaurant next time!", "author": "Ella R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-12", "description": "Very good! We are quickly making this cash-only restaurant one of our regular places. Meals center around their incredible homemade pita bread.  The baba ganoush is absolutely amazing - the best I've ever had.  I also highly recommend the \"pizzas,\" which are pita bread topped with goodies.  We've also had it delivered a couple of times and our orders were prompt, hot, and accurate.  It's a gem.", "author": "Terri B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-21", "description": "1st rate place. Good food, good value, pleasant atmosphere, friendly service.\n\nI've been coming here since 2001 and never been disappointed. Salad plate for $9 is a winner. So is the $4 falafel sandwich or plate. Mint tea always hits the spot, and the soup is good too. \n\nChicken sandwich is ok. Not bad, but not as good relatively speaking as the other menu items.", "author": "Tom G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-08", "description": "Great food, smart prices! Go for the food not the decor....unless you sit outside when the weather is good. Really cant  go wrong with the hottest homemade pitas  served with every dish.", "author": "M B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-02", "description": "Great and unique middle eastern restaurant.\n\nWe started with the \"salad\" combo, which was really more of a dip platter. There were many to choose from; any five come with the combo. We chose hummus, herbed feta, curried chickpeas, some kind of yoghurt, and a fifth item I can't recall. All were great, and best of all was the fantastic house-made pita bread that came with it. Yum!\n\nFor my entree I ordered the chicken \"pitza,\" which is apparently Bedouin (Bedouin-American?) for \"pizza.\" It was under-seasoned, but with some salt it was fantastic. Again the Bedouin Tent displayed their refined bread-baking prowess by producing a delectable crust that was the star of the pitza dish.\n\nIt was a lot (the shared salad combo and personal entree was too much) of great food for quite a reasonable price. I'd be back if I lived in the area, but unfortunately I was just visiting Brooklyn.", "author": "Adam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-04", "description": "Accidentally stumbled here a few months ago and it's been, by far, my favorite Middle Eastern pita place in Brooklyn, and even in NYC!\n\nWarm pita bread, delicious grilled chicken, leg of lamb, and they even give complimentary dessert at the end of your meal :-) \n\nIt's really funny how the layout of the place is very simliar to Olive Vine cafe in Park Slope.  But this place definitely rocks and outbeats Olive Vine. Why do you have to be so far Bedouin Tent??", "author": "Caroline C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "Soup was awesome! Amazing broth and lentils and beans. Falafel with hummus was in a lavash which I don't enjoy as much as a pita but it was definitely tasty. Wifey got the sampler which is up her alley but wasn't 100% satisfied with the offerings. The waiter definitely could have checked in with us more frequently as we were seated in the back with only one other couple and I sort of had to lean into the doorway to get his attention sometimes. Overall this is a place I would definitely come back to.", "author": "Seth H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-02", "description": "So unbelievably yum yum.\nand I'd have to say  verging on underpriced.\n\nThe only issue is that they keep the place uncomfortably warm.\nHowever, the falafel and pita are so mesmerizing that sweating while eating may just become your new thing.", "author": "d L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "This establishment has been here for over 17 years - and there's a reason! They have amazing puffy pita bread that is freshly rolled, pounded, and baked. Great mint tea as well! We tried their lamboujin and it definitely tasted authentic. They also serve great baba ganoush. One of the most authentic Jordanian restaurants I have seen for a while!", "author": "Dianne R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "Fantastic, good, simple, fresh, \u0026 plenty of healthy choices.  Big fan of Bedouin Tent \u0026 we eat here weekly.  Very reasonable prices \u0026 the staff are lovely peeps.  It's a great addition to he neighborhood.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "I took my two sons there after it was written up in Gothamist as one of the best falafel places in New York. It was really good! The service was excellent and attentive and the food was fab. I had a falafel plate and the boys had lamb \"sandwiches\", which came in pita bread wrapped tight in foil. I'd go back there again.", "author": "Goonersainter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-13", "description": "Pizzas were unique... In a very good delicious way. We had the garlic bread (pizza) and the chicken plate. Both are really good. The chicken plate doesn't look too appetizing but it was actually really really good. I had the lamb plate the last time and that was very good. I would probably order the lamb again the next time we go to the Bedouin Tent. The only thing was that the menu was kinda limited. Vegetarians would love it but omnivours like me would have liked to see a menu that offered more non-vegetarian option.", "author": "Terk C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "I'm really hungry. I'm really tired. I'm headed to Atlantic Ave in Brooklyn...a strip almost completely devoid of anything appetizing to satisfy my cravings for deliciousness that's fast and cheap. But, wait! Bedouin Tent is here! \n\nIf you want to have the best pita in Brooklyn, head to Bedouin Tent. They make it fresh, right there before your very eyes in their oven. Fresh, amazing pita is one thing, but a place that offers great dishes at extreeeemely affordable prices on a consistent basis is another. I love the chicken sandwich (with added baba ganoush). It's the size of my arm and filled with chunks of flavorful, marinated chicken breast. I also love the spinach and feta pie (and it makes me feel somewhat good about myself eating it). The pitzas at Bedouin are big enough to be a personal sized pie and then some. Although lacking in spices (I wouldn't say bland, necessarily, just all natural flavors from the ingredients), the pitzas are piled high with fresh toppings of your choice. \n\nThe employees are also amazingly polite. My only major qualm with Bedouin Tent: they only accept cash. But, I suppose when you can get this much great food for $4-5, a credit card shouldn't be a necessity (too bad I never have cash...).", "author": "Catherine C."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}