{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Very nice middle eastern restaurant. Lentil soup was excellent as was the pita-pizza. Quaint dining room. Only drawback is that they don't accept credit cards.", "author": "John D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-08", "description": "Went there last night for the first time, on a recommendation. Not very impressed, to be honest. The falafal was mediocre. The leg of lamb was super disappointing. not tender at all. not flavorful. the hummous was good. the bread was excellent. the lentil soup was good. but i wouldn't go back.", "author": "robert w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "This is my new favorite place, well deserved five stars, very simple place, decoration is a tent like very similar to lots of places in Cairo's streets. \nThey did injustice to this place by having a front/ open kitchens and a back seating; this fools bypasses in thinking this is a halal cart like joint. \n\nThe place is clean, simple, quite and the food is delicious. Service is friendly and everyone is awesome. \n\nTried several dishes and all were made to perfection. \n\nHighly recommended place", "author": "Ameenii M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "This place had me at pita. \n\nBedouin Tent's pita bread is one of the best (and biggest) I've had! They are made to order fresh out of the oven. I would recommend dining in and eating the pita right after it's been made. You'll see steam coming out as you rip the bread apart. It's thin, light and doughy--you can eat it by itself! It's tasty on its own. I had to take some leftover pita bread home--warmed it up in the oven the next day and it still tasted delicious. I've had the following menu items:\n\n-Harira Soup: Delicious and full of flavor. It came with a pita bread too. Soup contains chickpeas, parsley, cilantro, celery, tomato sauce, lentil and spices.\n-Lebna Salad: If you like yogurt based dip, then this is for you! It pairs well with literally anything on the menu--I had it with the pita, Lambajin, and Merguez sandwich/plate. It adds a nice coolness and tartness to a dish. \n-Babaghanouj: Made with baked eggplant and then blended with tahini and garlic. Loved it! \n-Lambajin: Their version of middle eastern pizza. Made with pitza with lamb, onion, tomato, parsley and spices. I'm assuming pitza contains the same ingredients as their pita bread. This was very delicious and really paired well with the lebna dip.\n-Merguez Sandwich: If you like spicy foods, you should definitely try this! It's a spicy lamb sausage with onions, tomato and tahini in a fresh baked pita. I really loved the flavors of the sausage--definitely will get this again. \n-Merguez Plate: Same as above but comes on a plate with onions, tomato, lettuce, olives and hummus or babaghanouj with fresh pita bread. Great sized portion! \n\nAlso, it's CASH ONLY!", "author": "Gena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Probably the best pita I have ever had. \nZataar bread authentic and flavorful. Babaganoush was great. Falafel could be better, but still good. Helped by the fact that everything was very fresh. Great spot for an affordable low-key meal.", "author": "Margarita O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "I have been here too many times, so an average initial review simply does not make sense.  My conscience brought me back here, especially after trying their lamb sandwich which is truly stellar.   Also, around the time I wrote the first review, I was hanging out with certain putrid individuals who shall remain nameless, lest I get sued. Hint : they have similar ideology and they hate raw onions.  I think it's all interrelated somehow.  You know, the whole mindset thing.\n\nI love their food, especially the crunch of the raw onion in the lamb sandwich.", "author": "Dmitry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "The pita is warm and chewy and delicious. The za'atar pizza is spectacularly flavorful. The roasted beets, baba ganouj and Hummus is stellar. Everything is fresh and full of flavor.\nThis is a good place with great portions and reasonable prices. Go there.", "author": "Richard R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "A very unassuming restaurant tucked away on Altantic Ave.  Egyptian/ Middle Eastern food at it's finest at reasonable prices.  Ordered the lamp plate with hummus.  The pita was piping hot, I was actually eyeing their sandwich more since they'd roll up the plate into a giant gyro basically.  Will definitely come back for it.  Note, the menu isn't for people who's shying away from carbs.", "author": "Albert W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-09", "description": "I really wanted to like this but I am ultimately disappointed. I ordered the lamb sandwich with falafel as an extra. The sandwich (pita) though filling, had no flavor. The lamb was cooked fine but it was bland, as was the falafel. The pita had some \"mint\" mayo sauce, but not nearly enough so this became a chore to finish. I am sure I have had better from a food cart. Maybe I just got the wrong thing?", "author": "Kirkland G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Sometimes I dislike going to this place because it reminds me too much of my childhood and I'm not even middle eastern. The place is truly autentic, that is all. As you enter, you'll be greeted by the smell of spices and pita bread.. then by an old guy wearing all white.. must be heaven? \nMy partner and I usually dine in, we always get the lamb plate, grape leaves and pitza. The lamb is very smoky and flavorful.. the pita bread is so soft.. idk how they do it.. and the vegetable pitza is just on a whole other level. I just can not accurately describe this place in a Yelp review, just find out for yourself.", "author": "Cee V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Super tasty food in large portions. I had the salad plate with hummus, babaganoush, beet salad, green salad, stuffed grape leaves and feta. My husband had the roast leg of lamb platter, which I ended up having some of and found really delicious. We both look forward to eating here again.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Best Falafel Sandwich I've had. I think the trick is in the pita. Fresh baked to order, it has a yeasty super fluffy texture and almost a sourdough tang. The tahini is also bomb and falafel are always super fresh. I get mine with no lettuce and extra tahini. simply awesome.\n\nThe place also is super cute and everyone inside has great vibes. The stocky guy at the register is always happy and you can't not smile when you see him. \n\nThe outdoor seating area is really nice and adds to the great food though my girlfriend and I usually get ours to-go and eat them in Prospect Park.\n\nKeep wanting to say more but I'll end this by doing a quick shout-out to the other good stuff about this place:\n\nShout-out to the yummy smokey baba ganoush, the spinach pitza, the pita guy, the bright yellow wall, the pita sign out front, the location, the speed, the price! and the good vibes!\n\nThanks for all the good meals!", "author": "Alexander L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Some of the best Middle Eastern food I have ever had!!!  I can see why it gets such great reviews.  I follow a plant-based diet.  This place definitely has good offerings for those on plant-based diets.  My favorite, Falafel, was very well seasoned, crispy on the exterior and soft on the interior. The Falafel balls were big, not small the way some places make them.  The Baba Ganoush was excellent--best I have had.  It was creamy and flavorful with small chunks of egg plant.  The Tahini was a delight.  Most times I have had Tahini it has a bite to it.  This one did not.  It was creamy and delicious!  The salad was fresh.  The black olives were wonderful.  Bedouin Tent is definitely one of Brooklyn's gems!!", "author": "Gordon M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-28", "description": "FOOD:\nThe falafels were not great. Mamoun's and Maoz are waaay better. \n\nSERVICE:\nIt was alright, nothing out of the ordinary to report on.\n\nBATHROOM:\nSmall and extremely dirty.", "author": "Kat H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Amaaaaaaaaaaaazing Fresh pita bread.  If you are the downtown/cobble hill brooklyn area and craving some cheap mediterranean food I suggest coming here.  \n\nIt seemed that everyone around us was ordering the pizza?  I was a bit skeptical because really, pizza at a middle eastern restaurant? -- didnt make sense to me but MAN was I wrong.  The pizza is made on super fresh pita bread, I ordered the garlic and it was AMAZING.  I would come back just for this... no joke. SO. Tasty.  Next we had the falafel chicken sandwiches which were HUGE, almost a foot long no joke here either.  The falafel tasted super fresh, I only wish they gave us a few sauces on the side for it but i'm just a sauce kind of person.  \n\nAnyway if you're in the area go grab a pita pizza for shooooo.", "author": "Lauren A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-11", "description": "Food is good, but damn they're rude if you're to go. Curse you in Arabic for being 'cheap' and then don't even cut your sandwich (and are cheap by not putting in Hummus (just Mayo..eww) in a $9 sandwich).\n\nBe happy you have customers...don't get too complacent because of positive Yelp interest. It can start biting you in the ass.", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "The best falafel sandwich I've had in a long time. Homemade pita bread! Need I say more? My wife had the lamb sandwich and really seemed to enjoy it. It comes with a lemon and mayonnaise sauce. Also my wife ordered mint tea which is the perfect complement with this kind of food.", "author": "Jorrell A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "FRESH HOT HOT HOT out of the oven bubbly PITA MMMmmm highlight of the meal\n\nheard about the great pita here, it's definitely made to order, but made constantly because they are so busy!\n--lamb plate: tasted like a pepper steak, the lamb wasn't terribly moist but it comes w/ a sauce. the plate comes w/ babaghanoj its DELISH BUT you must specify or you'll get hummus like I did (although they were nice enough to give me a free side of babaghanouj anyways)\n--spinach cheese calzone: HUGE, not bad\n--free basbousa if yah eat-in: it's kind of like a sweet soaked cake.. not a fan\n\nCASH ONLY\n\nNOTE: if you are eating in, don't order at the front, but let them take you towards the back patio area \u0026 the ONE waiter will help you.. slowly but surly (they need more staff at this popular joint)", "author": "Jenny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "This place is amazing. Great food and super affordable! It really should not go understated how amazing their pita is. Where can you get fresh pita now a days? HERE. Hummus was super creamy and flavorful. I got the chicken plate and the chicken had great spices on it and a really great flavor. Also the salad it came with had a lot of fresh vegetables on it like onions peppers and tomatoes. I can't wait to go back and try the lamb or the salad combo. I tried the loomi drink which the waiter warned me was really sour. But it was pretty good! Kind of tastes like how canberry ice tea would taste. I might just make the trip back to Brooklyn for this place!", "author": "Marisa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "The only reason Bedouin tent gets 4 stars is because they close at 11. Best food ever. Best price ever. Best service ever. Worst hours ever. I come here 1-3 times a week for dinner and everything is absolutely delicious and affordable. I'm going to continue to come here 1-3 times a week forever.", "author": "Jennifer N."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}