{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "This is one of the best middle eastern food restaurants in New York! Very affordable. Despite the frontage of the restaurant, they have a very nice back yard, perfect for a Sunday brunch. \n\nThe falafel plate is is huge, the salad is very fresh, and the hummus is perfect tasting and goes very well with their signature pita! We also ordered the lambajin pitza, it is a salty for us, but in general it is very special. One last thing to mention is their dessert, baklava! Great close of this big meal.", "author": "Xinyu L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Amazing food, good prices and good service. I had the assorted salad and added falafel to it. Super yummy and service was fast and good.", "author": "Ayhesa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "I love mediterranean food. Hands down one of or the best joint Ive tried. Fresh as fuck, hearty portions, marinades and falafels not overly garlicky or dressed (common tendency at many places), family-owned vibes, attentive and welcoming service. TY,Bedouin Tent", "author": "Grace C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "I'd like to start by saying that the people who work here are all such nice people. I brought my girl and her kids in with me a few times and they gave us some desserts for free on our walk out for the kids. \n\nNext thing I'd like to say is the value is unbelievable. My girl friend and I and the 2 kids runs me less than 35 bucks. \n\nFood is amazing. Everything high quality and fresh. Simple recipes done right. In a very warm and friendly atmosphere. I love the soups and the falafel. The pita is thin, crispy, hot, fresh, best I've ever had.", "author": "Michael Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Delicious and fresh. Lots of vegetarian/ vegan/ meat options. There is something for everyone. If you love middle eastern food then give this restaurant a try. Bonus, they make their own pita bread. Yummmm!!!", "author": "Shoma M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "It has been a long while that I have been here. I am missing it a lot! The falafel plate has always been my go-to dish at this place. Falafels were very good and nothing can beat freshly baked pita.", "author": "Wei V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-01", "description": "I really want to love this spot, unfortunately I cannot. The food looks great, but it does not taste as good as it looks. It's deceiving to say the least. \nI've been here a couple of times to know that the only worthy dish is the pizza, nothing else. \n\nI have tried the falafel sandwich and it tasted awful. The baklava which I am a huge fan of was horrible, the worst I've ever tasted. The lentil soup is bland. I am not a salt eating monster but with my recent change in diet I can easily taste off the bat if something is under seasoned or not.  \n\nThe cheese pie is the only reliable dish. It is not anything special but it does surpass everything else as far as flavor goes.\n\nThe guys here are nice but that cannot and will not compensate for the bad food, sorry guys.", "author": "Evelin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "I'm continuously on the hunt for great Middle Eastern food in NYC, and one of the best indicators that you've stumbled upon something good is the waft of freshly baked pita as soon as you open the door.\n\nBedouin Tent Restaurant did not disappoint; you enter the restaurant to a small takeout/counter operation, and shuffle through all the good smells of the kitchen to a cozy dining room in the back. In order to try as many dishes as possible, I tried their combination salad plate ($11) with beets, feta, hummus, babaghanoush, tabouleh, and of course, a beautiful pillow of fresh pita bread.\n\nEach of my sides was awesome - super fresh and light. I only managed to take down half of my plate before I gave up, and the leftovers that night were even better.\n\nMy coworker spent much of the next week craving the feta salad if that's any indication of how good it was. Now I'm dying to go back and try some of their falafel. But beware- cash only!", "author": "Marina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "They have great service I love the fact that they have the outside as well as the inside. The waiters are nice they explain stuff to you that you don't on the stand and the food comes really fast. I tried a lot of new things I never had  before . Like hummus and lamb I never ate them before so it was really great. The only thing is they don't take cards you have to have cash.", "author": "Tishella J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "I've been visiting the restaurant next door (Bacchus, had my wedding there) and how I missed this place is damn embarrassing. The leg of lamb sandwich is so delicious!!! \u0026 it's $9 and can feed two people!!", "author": "Jenny T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "This is my favorite restaurant in the neighborhood. Amazing food, great price, service is great. It's cash only so bring cash! I always get the mix salad because it gives me the variety \u0026 fills me up.", "author": "Cathy J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-17", "description": "Well the restaurant smelled like BO and the food came out within 5 minutes of ordering, which made me question its freshness.\n\nExcept for of course the pita bread which was definitely hot and fresh and for sure the highlight of my meal. It stressed me out a little that the pita was falling off the sides of the paper plate onto the table, because I don't know how clean the table was, but what can you do-- a few germs probably won't kill you.\n\nThe leg of lamb plate was primarily salad but also included a bit of hummus and a sad pile of lamb slices. The hummus was fine but not impressive, especially since it's quite easy to find a decent hummus these days in New York City. The lamb on the other hand had been obviously and poorly re-heated and did not taste great. I'm still grossed out just thinking about it, and it's been a few days since my meal.\n\nThe restaurant was not crowded, so we were able to sit and talk for awhile after we had already paid and they didn't pressure us to leave, which I did appreciate.\n\nAnyway, it seems like a lot of people had a great experience here, so maybe don't order the lamb, and you too will rate this place 5 stars.", "author": "Sarah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Ordered the chicken sandwich. It was great. There is seating in the back. Cash only, they do have an atm inside.", "author": "Jessica W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Best Middle Eastern in Brooklyn! Don't be fooled by the front of the restaurant. When you walk in it feel like a to go pita place, but the back is a room with Jordanian blankets hung up on the walls, making you feel like you're in a real Bedouin tent. \n\nMy favorite item is the sample platter of dips. I get the hummus, baba, feta, chickpea salad, and the tabouleh. The food is fresh, and portions are large. The lamb pitza is a fun take on middle eastern lamb with cinnamon and other great spices in a warm fluffy pita. \n\nFinish off your traditional Bedouin tent experience with a cup of mint tea.", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "Spectacular Mediterranean food! \n\nThe \"plate\" meals are super filling and worth it. I ordered the leg of lamb plate and my girlfriend ordered the chicken plate. Both meats were cooked perfectly and coated with herby goodness. Also the house made hummus was super super creamy and delicious. Also the babaganoush was spot on, something I rarely order because it's never done well but they got it right here. My real favorite of the night was pita, fresh crunchy and chewy. Who knew something so simple could taste so good. \n\nFantastic meal for an affordable price!\n\nTip: Don't sit outside after 5, mosquitos enjoy hummus flavored blood.", "author": "John T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-13", "description": "Not worth the 4-star rating. This place is so hyped and I'm not sure why. Yes, their pita is good and they have a cute backyard garden. Yes, it's well-priced. But the flavors are lacking. I tried the falafel and the chicken platter - hummus, falafel and chicken all fell short. Btw- cash only!", "author": "Stacey F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-03", "description": "Actual Rating: 3.5\n\nPlace: The dining area I would say was pretty cool. When you get to the back, you have option to sit inside it outside. Inside, they have pretty decent to cool walls, but not as pretty as the pictures portrayed. The place is pretty small so I would suggest to bring up to 4 people here.\n\nService: Service was pretty decent. Our waiter was nice and quiet abd brought our pizzas in decent time.\n\nFood: My friends and I ordered the pizzas since they seemed pretty tasty in the menu. We ordered Lamb, Chicken, and Vegan pizza. The chicken we all agreed was the best one. It was pretty flavorful. The vegan pizza had a very smooth texture, but I just wish there was more flavor since it seemed bland. The lamb pizza caught me off guard as well...it was not as flavorful as I would expect it to be, but as time passes by, there would be a stronger taste as I ate more. I guess, the spices accumulated? I don't like how the pizza were hard to cut into slices. I was worried from time to time that parts of my pizza would fly outta the metallic plate. \n\nConclusion: This place is a nice place to get a quick and easy and cheap meal. I have a problem with their menu though since when we received our check, the prices were different. They really need to update their menu even if it's a slight change. I'm not sure if I'll ever go out of my way to go here again, but if anyone is ever digging cheap, and easy Mediterranean food and we're around, then yeah sure. We'll drop by, I guess.", "author": "Elaine E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Perfection with taste. They always add just the right amount of sauce to lettuce ratio. It's spread evenly over the entire sandwich.\n\nThey made the falafel at the right temperature and crisp levels.\n\nThey baker always bakes the made to order pitas to the correct levels. Which enhances the entire sandwich.\n\nAlways enjoy the visit here.\nStaff is always super friendly!", "author": "George W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "Yummmmy!!\nI ordered the plate of chicken which comes with salad and pita bread. And a humongous scoop of hummus. The plate was huge and delicious.\nIt was super duper affordable and the workers were all nice. \nIt was a nice weather so their garden in the back was open.\nMy boyfriend enjoyed his plate of lamb leg and told me it was good!\nI believe this place is cash only so make sure to bring cash.", "author": "Gloria K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "I went here ten years ago and I still dream about it often, but 3000 miles prevents me from doing so. Brick oven baked pita straight to your plate. Drool worthy falafel. I will return oh I will return.", "author": "Chandelite L."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}