{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "You will not expect this place to be that GREAT from the outside. I have been living in this neighborhood for few months now and I have been going to restaurants surrounding this one but never dared to go in. But I should have! The garden is great on a nice day. I went in for late lunch with few friends and everything we ordered exceeded our expectations. Amazing Lentil soup, fresh made pita, and amazing Beet salad. Try Pitza! I am lactose intolerant so I can never really enjoy eating normal Pizza but PitZa is great!!!", "author": "June K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-12", "description": "Yeah not really sure how this place got four stars. Came here for lunch on a Sunday w a friend, we ordered the meze platter (aka platter with various appetizers) which ill say wasnt bad, but it was pretty much downhill from there. I got a chicken shawarma sandwich which was basically a giant ball of grease. My husband got one of their specialty dishes which was this pastry thing filled w rice and bits of chicken, better than my grease ball but nothing to write home about. My friend got the falafel...said it wasnt the best she ever had and it looked over fried and kinda dried up. All in all not a place i would return to. If ur craving middle eastern food in the hood go to Zaytoons (dont order from them tho because they are a hot mess...they dont fill seamless orders by claiming they never got them, and when u order over the fone they just bring you half your order) so i say either go and pick up or just eat there...the food there is actually good!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-21", "description": "The garlic \"pitza\" was really good, but be prepared for large chunks of garlic. The lentil soup was solid, and the chicken platter was very tasty. We were disappointed by the falafel however. This was takeout, so we can't comment on the seating or atmosphere, but the staff was nice.", "author": "Alan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "So much I dont know about my own city.\n\nBefore today, getting good middle eastern food meant going to Coney Island avenue OR Lower East Side, NYC.\n\nI'm glad my brother called an audible on his original plan and picked this place. The food is very good, the space looks cool, and despite average service, it was a great time.\n\nI ordered the chicken sandwich \u0026 the garlic (pita) bread. The sandwich was fantastic and made up for the bread, which looked amazing, but didn't have much taste.\n\nHonestly, I took pieces of the chicken off the sandwich and put them on the bread. Makes for an even better sandwich than the original bread used (note to owners: if you use my idea, I want it named after me: \"kafir chicken sandwich\" LOL).\n\nAnyway, I'm looking forward to warmer days, so that I can try this place during that time. Looks like I found me a new date spot.\n\nFinally, in case my review is the first you read, please keep in mind that this place is CASH ONLY.", "author": "William C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "CASH ONLY.\n\nI could eat the lamb gyro or lamb plate from here every single day.  It's perfecly seasoned, cooked, and cut.  The staff is all very friendly and a little bit clueless .... so , you may have to get their attention a couple of times if you dine in the back.  It's a pretty small place so I didn't mind too much.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-15", "description": "I'll say this for Bedouin Tent: I had an authentic and undeniable urge to go wandering in the desert after eating here.  Usually, Yelpers don't disappoint, and there are so many great options on Atlantic in BK that you can't go wrong.  \n\nOh but you can, dear Yelpers.  I had a hankering for hummus and fresh pita, which is what the large sign hanging over Bedouin Tent advertises.  And so, armed with the four-star rating, I went in with a friend and with confidence.  \n\nWe ordered the five-salad appetizer, getting the hummus, babaghanouj, chickpeas, tabbouleh, and bulgur and lentils.  My pal ordered a lamb shank sandwich (really a pita) and I ordered the merguez sandwich (also a pita).  We were disappointed in all of it.\n\nThe hummus had little flavor, and no texture.  It was like eating a tub of tahini (not knocking that, we've all been there before).  The babaghanouj tasted stale, as did the chickpeas.  The lentils and bulgar were dry, and the tabbouleh had not a mote of flavor.  No lemon, no garlic....not even a parsley flavor.\n\nHis lamb shank was juicy enough and nicely cooked, but the sauce was...can a sauce be insolent?  I thought the sauce was sort of daring me to eat any more without complaint.  My merguez was like hamburger helper: the meat was dry, overground, spicy simply for the sake of heat, and not flavorful.  \n\nAt least we got a heaping helping of surly from the waiter -- no charge!\n\nSorry Yelpers, this one gets a 1 star from your humble correspondent.  Next time, just pick up some hummus from Brooklyn Fare and call it a day.", "author": "Jay W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-19", "description": "Amazing falafel platter. Humus with  pita bread is delicious.\nAll personal pizza's are great and filling, personal fav Lambajin will have you coming back for more. \n\nIf you eat at Bedouin Tent you also get treated to a small dessert treat that caps off a great meal.\n\nSmall spot on Atlantic with great dishes.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "The Lambajin pizza is yummy and the portion is actually pretty good for one. I wish they had tongue sandwich as well.", "author": "Mehdi Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-27", "description": "The boy and I decided to check this place out before catching a rooftop movie at DeKalb market. He ordered the lambajin (minced lamb on a \"pitza\") which looked so good. He loved it and he ate the pita (huge and fresh) that came with my Merguez (spicy lamb sausage) as well. I quite enjoyed the plate- it was pretty much a lamb kofta but spiced well. The salad that came with it was excellent- and I'm not a big fan of salads.\n\nService was a little off but we didn't mind. We went on a weeknight so there was almost no wait for a table around 7:00 pm.", "author": "Ro C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-08", "description": "Holy za'atar! That's not some science fiction god, it's a melange of spices served up on Middle Eastern dishes and it's beyond fucking delicious. Each country has a different version of it, but it usually contains at the very least thyme, sumac, sesame seeds and salt.\n\nBedouin Tent makes a za'atar bread that is the superlative of amazing! The spices are caked with fragrant olive oil on pillowy flat bread and I dare you to stop at just one piece. It's perfect for dipping into hummus (how rich), however you can easily eat it on its own. I'm gonna warn you that it's impossible to not order a bunch of dishes here because they are superb. Check out the option that allows you to make a Middle Eastern plate of your own design. My favorite items on this were the hummus, falafel and grape leaves. I didn't taste the foul... let me take pause here to mention it's pronounced \"fuul,\" I believe and it's an Egyptian street food often eaten by locals for breakfast. Being that there's no \"real\" spelling for this word with our alphabet, I implore anyone who has this food item on their menu to spell it fuul, hell, I'd take fool even, but please not foul because I can't wrap my  head around eating such a thing once it's in my  head!!\n\nBedouin Tent is definitely a serious contender for best Middle Eastern restaurant on Atlantic Avenue. Decor is modest, but in nice weather you must sit out back in the garden. It's pretty sweet out there. \n\nAs good as it gets for Middle Eastern food. Absolutely.", "author": "Joi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "Always fresh ingredients make this a lovely weekend lunch choice! I'm never disappointed in the food, although the decor and service could use a step up.", "author": "Darlene H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "Best hummus in Brooklyn! Their food is consistent and fresh! Why not get a huge bowl of freshly made hummus here than go to a grocery store!!! Ps: it's actually cheaper!!! Love this spot! Their pitzas are great too!!!", "author": "Piotre W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-11", "description": "Delicious and cheap middle eastern. They make the pita fresh and the servings are huge.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "I walk in to find old, moustached dudes making fresh pita in a big ol' brick oven. Kinda already sold.\n\nOld school and to the point: fresh and simple ingredients, rustic and inviting. \n\nVERY reasonable prices: Big felafel sandwich for under five dollars? Bang.\n\nSo glad I came upon this place. I'll be coming around often.", "author": "Adrien P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-18", "description": "Pitas are never on my list of food I want on a given night, however, I do enjoy a pita every now and then. This place...this place...I would eat this place every night. The Zaatar Bread (covered in olive oil, thyme, sesame seeds) was to die for. I had a little salad that I put on top of the Zaatar and dipped in some sauce...quite the flavorful bite! For the main, I went with the Merguez plate which was A) huge and B) nice and spicy. As others have noted, this is cash only...but there are plenty of ATMS nearby.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Great fresh food.  Been going here for more than 25 years.  Never disappointed.  Try the lamb or green pizza.  The lentil soup and tea is also a perennial favorite.   They can get busy so calling can be tough but go inside and you won't be disappointed!", "author": "Erich B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "This place has great middle eastern food!!  They have seating the back with some awesome cute decor too!   The falafels and salads are awesome!", "author": "S W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-01", "description": "Went for my third time, this time for lunch. Got charged $9 for an $8.50 lamb sandwich, cash only. The guy claims its tax. Hey buddy, it should be $9.20 then. You sure you gonna report that and the extra $0.50? Food this time was so-so. Not going back.", "author": "Dave K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "My go-to Mediterranean food in the area. Hits the spot every time. \n\nOrder tips: baba ghanoush (great), beets (nice, made with mint), yogurt, and fresh pita bread. Also the falafel sandwich is very good and only like $4.50.", "author": "Asparagus S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "I live right around the corner, and Bedouin Tent is my jam. Everything is always super fresh and tasty, and the portions are large enough that I usually save some for a second meal. If I happen to be craving Bedouin Tent on a weekend, I'll opt for the Chicken Ouzi (available Friday night - Sunday night, for some reason), which is a huge, wonderful combo of chicken, rice, veggies, almonds and raisins, baked into phyllo dough. Otherwise, I get the assorted salad platter (with an extra pita). I get the beet salad, the chickpea/spinach combo, hummus, and two servings of labna, which is a tart yogurt that tastes almost like the smoothest, tangiest, creamiest cheese-like thing ever... it's hard to describe, but GOODNESS it's addictively wonderful. So much food for so little money; can't complain at all. The takeout guys are always super nice too.\n\nI did eat in the other night, and the service wasn't super attentive, but it didn't bother me too much. The only objection I really had was that I ordered Loomi, a drink made with black limes that tastes almost like very citrus-y tea. The waiter insisted that I try it before he would let me order it, and he brought a small sample in a Dixie cup. That's all well and good, but he didn't return to ask if I would want to actually order it (which I still did), so I spent awhile trying to flag him down to get him to bring it. I didn't get it until more than halfway through my meal, which kinda sucked. But hey, nitpicking. If you want to order it, just insist, I guess.\n\nOh, and cash only!", "author": "Peggy N."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}