{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "Oh.  Emm. Gee.  \n\nI'm used to home made Lebanese food, I'm spoiled.  Bedouin Tent was as close as I've ever gotten to that.  \n\nPita bread is off the hook.  2 words - Chicken Ouzi.  Whaaaaaat?  So good!  It's this chicken and rice (with additional yumminess like raisins) inside of a fluffy, flakey dough.  Just...hot happiness in my mouth.  \n\nThey have mint tea and other goodies.  I haven't tried anything else, I'm looking forward to the lambajeen and it's literally steps from my place.  The outside garden area is nice too.  When i first walked in I thought it was take out only bc the kitchen is in your face but walk back, have a seat.  You'll be glad you did.", "author": "Monks C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "Ouzi....mmmmmm.....  (only available Friday night to Sunday)...chicken, rice, raisins, spices wrapped in a not-quite puff pastry balloon of goodness. \n\nThe rest of the food that I had (falafel, salads (labne, beets, chickpeas, feta and dilled potatoes), hummus and babaganough) was all good. Not 'amazingly good' but certainly enjoyable with crispy garden vegetables and freshly baked pita. \n\nService was OK...waitstaff tended to sit and chat a lot when they could have been circulating (refilling water on this 90+ degree day, offering extra napkins, checking to see how things are...just general waiter stuff that for some reason they didn't do that day).", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-20", "description": "I LOVE Bedouin Tent for the most perfect falafel sandwiches and 'pitzas' made on the fluffiest, most authentic middle eastern pita.  I have been eating here for over a year and it really tops the list for best pita out of any place I've ever been in the States.  Most of the guys are Jordanian and they are always friendly and nice (perhaps it helps that I am half Jordanian?!)  \n\nThe only complaint is that they have a total no alcohol policy.  (It used to be byob.)  I wanted to have a pre-wedding dinner for my family here in the garden and wanted to rent the place out, have music and a bellydancer and was told no belly dancer and no alcohol whatsoever.  We weren't looking to get crazy but I thought it would have been nice to offer something to drink and wanted to be able to have arabic music/dancing etc.  Anyway, that's not their thing which is FINE of course! :D  Just will keep coming back for amazingly tasty, fresh and CHEAP falafel sandwiches!!", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "I really love the local of this joint, foods solid, the company you keep while waiting against the wall for to go oreders is always chat worthy to help pace, and the owners daughter is the cutest thing in the world where ever she may roam!", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-30", "description": "Yay! I'm a big fan!  Order the mixed salads...not because it is a bargain but because otherwise you would have to choose.  we ordered the eggplant (baba gahnou), labneh, lentils and bulgur, fava beans and beets, along with a merguez sandwich and soup. then we ordered more babganou.  the labneh was perfect on the merguez sandwich--and should be a topping for all of the sandwiches.\n\nYou can probably order less and be really cheap, but why?  everything is so good you don't have to decide, just order what you want.  \n\nthey really appreciate when you appreciate their food. at first the waiter seemed a little bored, but as we devoured the food and ordered more, he paid more and more attention--really nice to see they notice when you love their food.\n\nvery homey in back--do not be deterred by the sign on the door or the door in fact--what looks like and is labelled a 'pita' place is indeed home cooking by a true home chef--one who takes pride and care in the preparation.\n\ncan't wait to go back.", "author": "Colleen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "Went to this place for Falafel and it was very good.  The hummus was great and the tahini sauce was also good.  Everything seemed very fresh and you can see them making it in the kitchen.  I'm definitely going back :)", "author": "A H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-19", "description": "I had a Falafel sandwich which was delish! What I really like is that the pizza maker was there and made a fresh pita for my sandwich. It was over stuffed more like a burrito. This place is on Atlantic Ave. not far from the new arena where the Brooklyn Nets will play. So go there before the game. I noticed they have a backyard garden to sit in.", "author": "Larry B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "Loved the meal we had here on a late Sunday afternoon. Everything was good: Zaatar bread, leg of lamb, hummus, and pita. Baba ganoush was the best I've had, The garden area was a lovely place to dine, complete with fountains and sunshine. Our servers were fairly attentive, if a little sullen.", "author": "Arah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-20", "description": "Wow. Seriously the best falafel sandwich I've ever had.  The pita bread is out of this world.  I have no idea why I kept walking by this place and never trying it.  I see a few of these falafel sandwiches happening a week in my future.", "author": "Tony T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "So glad I stopped by... The front almost looks like a take out joint with an open kitchen and a line of customers but I had intended on eating in so they led us to the back where everybody seemed intent on taking advantage of the weather in the garden.  We stayed just inside because with the doors open we were still in open air and I wanted a nook away from the crowd to nurse my youngest in before the meal.  The waiter was attentive but also patient and kept his distance until we were ready to order (my boyfriend takes obnoxiously long to decide so most places ask 3 times before he knows what he wants). I got the salad plate with spinach, grape leaves, babaganoush and fava beans.  When it came out I was absolutely floored by the portions they came up with for nine dollars.  Crazy. Crazy deal.  The babaganoush was perfect, very creamy, some of the best I've had in the city.  Grape leaves were really good too.  The only thing that was kinda disappointing was the fava beans, which were oddly bitter.  There was also a lot on the menu that I was curious about.  And I will be back...", "author": "Chelsey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-03", "description": "Wow, this place is amazing.  Went here with a friend and shared hummus \u0026 pita, got our own individual meals, and split a piece of baklava (delicious) for all a little over $26. I ordered the chicken plate, which is marinated grilled chicken with salad and hummus \u0026 pita.  Definitely had more than enough food :) I plan on coming back soon to try the other dishes!", "author": "Sierra B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-15", "description": "this review is only for the lentil soup. the price is $4.75 now! pretty pricey for just lentil soup. nothing special about it. very plain. it comes with a pita which was nice and soft but still nothing I would crave. I tried the soup cuz of the other yelpers mentioning it. it's a boring lentil soup. save ur $$ for smtg else. I will try smtg else next time and hopefully that will meet my expectations?!", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "Great value and really good food.  Quick and attentive service, Arab music and decor just completes the place, no complaints whatsoever.  My date and I shared the platter with 5 different salads and got a couple of extra pitas.  Filled us both up for $15 tip and tax all included.  Beet salad was perfect, chickpea \u0026 spinach salad was solid, hummus and labneh better than most places, grapes leaves were good.  Pita is the star here!!", "author": "Beth T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "Don't know how I haven't reviewed this one yet, since its proximity to my house means I get take out from here almost once a week. The falafel is excellent and the chicken in the chicken sandwich is super tender and tasty. The only thing I don't recommend is the hummus. Get the babaganoush instead and enjoy the amazingly fresh and hot pita. \n\nDelivery can occasionally be a little slow, so if you live in the area, I recommend just picking it up. It's fast, the guys behind the counter are really friendly, and that way the food is always super hot. I've only dined in once or twice, and it has a nice enough area in the back. \n\nOverall, the sandwiches are in my top three for cheap neighborhood eats. About $6 and you'll be totally full. When available, definitely try the beet salad and the special chicken dish.", "author": "Becky S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-29", "description": "Praise Allah for Bedouin Tent! I have lived at this restaurant for years. It's inexpensive and sensational.  Downside, CASH ONLY.\n\nI've broken their pillowy-perfect pita with many friends and family. It's also a weeknight dinner standby. The quaint outside seating is a total oasis in the spring and summer.\n\nI have literally had everything on the menu and no complaints.\n\nMereguez is spicy! Babaghnosh is creamy heaven. Chicken platter is a meal for the whole family. Huge portions. I love all the assorted salads like feta, and labna dip. The faul (sp) is not the greatest. PiZzas are great for kids a plain is six bucks! \n\nService is pleasant and food Always arrives quickly. A true nabe standby.", "author": "Foodie Mamma X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "Cheap delicious Middle Eastern food. Harira soup is so tasty tasty and affordable. Now that I've moved, my only wish is that they delivered to Ft. Greene.", "author": "kc r."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-16", "description": "This is one of those local places that you go because it is an easy, laid-back kind of place. Everyone is really nice, no one  rushes you out, and, more, importantly, everything is always good!   The food is always fresh.  One key element is that  they bake their own pitas and make their own hummus.  The chicken wrap, falafels and pizza are my personal favorites.  The prices are good.\n\nBut please note this is not FAST food.  So,  don't go in there thinking you'll be out in a couple of minutes.  Everything is made to order, so please go when you have the time to enjoy it.", "author": "Elle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "Great staff and amazing food! The pita bread was fresh and delicious. We ordered the lamb sausage platter and a salad sampler and could not decide which of the 8 items was better! The price was fantastic as well.", "author": "Sandy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-22", "description": "This place is very good and so cheap! Ambience is cute and cozy. Finally a place that doesn't sell overspiced, hard, cardboard-y falafel. Instead, it's the perfect amount of crispness on the outside and fluffy on the inside. The baba ghanoush is roasted, smoky deliciousness, and the yummy bread is hot and fresh. The food is actually quite simple and that's probably what makes it good. I almost died when they brought the bill with small piece of cake made with semolina that I hadn't had since I was a wee little girl. Oh the memories!", "author": "S H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "We went super early, so the service was a little spotty, but the food was REALLY good and if I am ever in the area again (when we went there it was the first time I was in that area in my life) I will definitely make an effort to get me some Bedouin cuisine again! I had the spicy lamb sausages, which were really delicious. Also, the pita and humus was great -- especially the pita, which really tasted more like naan than like the crappy store-bought pitas I've always had until now. What a difference that was! I loved their seating in the back, too -- I just wish it was warmer so that we could have taken advantage of the outdoor part.", "author": "Jon L."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}