{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "We stayed at Sheraton few blocks away, and  ordered dinner for delivery.  I had my food within 30 minutes.  I must say the Bedouin Tent is a GEM in NY.  We tried Beet Salad- it was good.  Lambajin - Lamb Pitza - Awesome full of flavor, and just the correct amount of spices.  Chicken Sandwich was superb!  I was most impressed with Tahini Sauce mix and quality of the chicken cutlets-  What do I mean by quality?  You could taste the chicken the way it is supposed to be Natural- No Growth Hormones, No Steroids- So No Stink in the White Meat.  \n\nGreat Job guys!  Keep up the high quality.  I will definitely stop by every time I visit NY.", "author": "M A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "Great place with simple and delicious meditarenian food. For 20$ you can easily East for 2 people, I recommend the lahmadgun.", "author": "Levin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "I don't usually write many reviews, but me and a friend went here for dinner today and were pleasantly surprised by the quality of this joint. They make fresh bread up front, which is delectable. The chicken and lamb is made perfectly and the portion size is good. It leaves you feeling full and not the greasy-I -know- I -shouldn't -eat -this full, but the satisfied-after-eating-a-solid-meal full. Will come back soon!", "author": "Hassan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "Food was excellent.\nService superb.\nGreat value for money.\nA must GO in Brooklyn,NY", "author": "Food L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-11", "description": "Straight trash , lf you like your chicken pre cooked go here. If you like pita bread burnt and rock hard go hear. This place is very very bad don't waste 17 dollars like I just did right now. !!!!!!", "author": "Ali J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "Having just returned from the Middle East, I'm still on a seemingly unending falafel-hummus-pita kick, and a dear Yelp friend assured me that Bedouin Tent Restaurant is THE spot in Brooklyn for the aforementioned treats.  Without a second thought, I jumped on the 4 train, and made my way to BTR.\n\nI went simple by ordering a falafel sandwich with a side order of hummus and pita.  The pita was warm and fluffy, and the hummus was silky smooth.  In other words, quite tasty.  The falafel sandwich was served almost in hoagie form...a long-rolled pita filled with salad, falafel and tahini.  It was quite good.  Not the most flavorful falafel I've ever had, but good enough for me to return...repeatedly.\n\nWhile the food at BTR doesn't QUITE measure up to the street cuisine I inhaled in the Middle East, it was undeniably satisfying.", "author": "Ryan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-22", "description": "Falafels are amazing! AND HUGE. The pita is made fresh right in front of your face. The hummus is delicious. The heated tent is a nice touch. I\nwent here for years before moving out of the area. Still my fav falafel place(sure beats any in the bay area). I love that they allow you to BYO wine \u0026 NO corkage fee (unless things have changed). AND the prices won't break the bank.\n\nA must!!", "author": "Ashlee F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "We have been searching for a great falafel place near us - we found it!  We were enticed by the people making the pitas fresh right in front of the restaurant.  We had the zaatar bread - perfect amount of crispiness and not too oily.  The spinach and chick pea salad was perfectly cooked and the portion was generous.  The falafel sandwich was great!  Large portion, fresh ingredients, perfectly combined spices.  Leg of lamb sandwich was tender and perfectly spiced.  The pita was hot and fresh out of the oven.  The hot sauce was hot (but not too hot) and seemingly home made.  We will go again!", "author": "Mimi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "The lamb dishes are great and the restaurant is a small cozy place.", "author": "Tariq W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "Fantastic falafels, at $1 each they're a pretty big size compared to other places. I'm looking forward to trying their pizzas!", "author": "Spark O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-19", "description": "I LOVE this food.\n\nAll that has been said about the food is true - excellent, fresh, very satisfying and delicious. Chicken sandwich on freshly baked pita  forget it, it is awesome!\nCall ahead and take out or dine it.\n\nThey keep it simple here and first and foremost it has to be about the food...and the food here is really soooo good. I think the owners are Egyptian and they make their food in that style of freshness and simplicity - I love it. That pita that they are constantly making up front is so damned good it should be illegal.\n\nThe service is really good and the staff is always nice - never had a problem.\n\nThe freshness of the ingredients and the spices of these simple dishes make it outstanding. Damn I wish you were near my house. I have taken special trips to Boreum Hill just because I have been craving it - and it is always worth it.\n\nMy only problem with the place is the DECOR and cleanliness...it is a dreadful place it dine in...plastic chairs, dirty quilts on the wall, plastic, sticky tablecloths and poor lighting. I don't want my fork to touch the table...ever.\n\nI just wish the interior were more like Zaytoons in terms of ambiance/ decor - and cleanliness. They just need to spend a very LITTLE bit of time and effort on fixing up the dining area and cleaning - thoroughly - a bit. \n\nI know this is NYC and a \"hole in the wall\" can have some of the best food - you do.\nGuys, please hire your interior designer cousin to give the interior a little make-over. Nothing fancy or trendy. Just get some real chairs and table cloths in there. Get rid of the dirty astroturf out back and the dirty quilts on the wall...", "author": "M. Ward N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-16", "description": "I could easily become a regular, if I lived in the neighborhood. Nothing I had was out of this world amazing, but I didn't have any major complaints, either. \n\nDon't be fooled by the front section (which looks like a standard takeout place) because the dining room behind is a surprisingly nice atmosphere.\n\nThe lentil and bulgar appetizer was a bit dry for my taste, but it was pretty good. For my entree, I had the lamb platter. It had been a while since I'd had lamb, and to be honest I was kind of hoping for drippy perfectly seasoned melt-in-your-mouth lamb. It wasn't that. It was just... fine. And for the price/portion ($12) I'll take it. The lamb became amazing though, when I created \"lamb burritos\" with the baba ganoush (you get a choice of that or hummus), the mixed salad, and globs of the lemon mint mayo. Now THERE is a satisfying meal.  All in all, I spent  about $15 pre-tip. Not too shabby.\n\nWhat would make this even better? Alcohol. I would have killed for some red wine to wash everything down.", "author": "Tanya T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "Incredible pita, and their hummus is yummy too. Also a big fan of their sun-dried mozzarella pitza!", "author": "Julia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "recommended by a friend from Abu Dabi. would definitely recommend it to anyone. fast and good food. very friendly staff.", "author": "J C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-19", "description": "I've been here on two occasions, both of which resulted in the lack of pomp and circumstance. 1 - I was meeting a dear friend from undergrad and we decided to reconvene here; 2 - My +1 and I went to Sugar Lounge Yelp Event when unbeknownst to me, it was postponed, so we rather unceremoniously came back here. \n\nConveniently located in Boerum Hill, Bedouin Tent is not that bad of a stretch from the tumult of the Atlantic Ave Terminal Shopping Center, also a location in which a large consortium of subway and LIRR trains converge.\n\nThey have backyard seating.\n\nThis is not Chuck E. Cheese.\n\nPeople seem to come here to quietly eat and stare at each other, awkwardly. Luckily, they have this incorrigible Asian girl whose politically incorrect conversations provide either entertainment or provocation to feel mutually indignant about.\n\nTheir falafel balls fall short of my expectations: dry and salty; no bueno. Their pita bread, however is some of the best I've ever had the pleasure of eating. However, culinary redemption materialized in the form of a side salad, particularly, BEETS. I love beets. Their beet salad conjures up Pavlovian effects; drool. A lot of people seem to come here for the pitzas; my friend enjoyed the chicken pitza; I lived vicariously.\n\nThis is a lovely restaurant to sit, relax, chat, and eat in; especially on a nice summer afternoon-to-evening setting. Best of all, nearby the nearby locale accommodates the mood should you a) need a drink (Deity) b) need a dessert (cafes aplenty) c) want to walk around (by all means, do it.", "author": "Kendra C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "I consider this place to be a great find!  The food was quite good and for the price, it's pretty hard to beat.  There is a fantastic courtyard in the back that was a very pleasant place to eat when the weather is nice.  Do be careful, we sat outside and tried to BYOB, but weren't allowed to drink it.  They were polite, but unwavering in this regard. Someone else had posted that it was BYOB, this might just be for inside the restaurant.  I tried to ask, but couldn't quite understand what they were saying.  \n\nIf you are not put off by the potential of not drinking alcohol, which you shouldn't be, I absolutely recommend this place.", "author": "Ffej C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "This place has the best pita. Everything is good, but the pita makes this place a must-eat. Pro tip: you can't order pita for takeout without ordering anything else, so when you eat in or take out, order a side pita for snacking later.", "author": "Lee C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "Pleasant place, especially the garden in back.  Highlight of the food is the fresh baked, hot pitas that come with your meal.  Other stuff is not of super high quality but pretty good for the very reasonable prices.  Harira soup is really nice on a cold day.", "author": "Mark A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-08", "description": "I was born \u0026 raised in NYC \u0026 have had falafel sandwiches all over this city. Bedouin Tent serves the best falafel I've ever had. It's delicious \u0026 filling. Not too filling. Just right. I live in Manhattan but often when I am in Brooklyn, I will make it a point to head to this spot to pick up a falafel sandwich for lunch or dinner. I've also sat and eaten here with friends. The ambiance is nice with mini fountains bordering some of the area \u0026 trees hovering over in their outside seating area. There's also a inside seating which is just as nice with the nice artwork on the walls. Great pricing \u0026 fresh food.", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "This place is a find - friendly staff; the house-made pita bread was yummy; fresh, tasty CHEAP food; speedy service, lovely atmosphere and cozy. It was delicious - mouth watering just thinking about it - I wish I lived closer.", "author": "Linda R."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}