{"aggregateRating": {"reviewCount": 587, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "Awesome little joint in BK. With a friend, we split a green pizza, which was okay, nice and cheesy. We also split the chickpea salad, which was fine, but cold, and contrasted with the rest of our meal in that way. We also each got the falafel sandwich, which was incredible, filling but not too much so, just great.\n\nI just wish da place served booze.", "author": "Mike O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-18", "description": "So I live a stone's throw from this little mideastern hub, the main reason I have been frequenting it lately. That and my continuous cravings for falafel and hummus. The place itself is small and dark, nothing special, but they do have a backyard which always counts for something in my book. \n\nThe food is pretty decent-  I am a fan of the falafel plate with hummus. I had the lamb once, wasn't too excited about that. The best part is probably their bread- the aroma hits you as soon as you enter the place. The trick is to eat it fairly fast, because as the minutes tick by it goes from soft fluffiness to hard crunchiness. \n\nAnother pro is the quick time it takes to get your food, whether you are eating it there or taking it home. I also like the price- not bad at all when you don't want to burn a hole through your wallet.", "author": "Sara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-23", "description": "Bedouin Tent Restaurant, like it sounds tries to mimic a bedouin tent inside the restaurant by having tapestries on the walls.  It felt like a bedouin tent because it was probably 90+ degrees in there without the AC on, windows open, and of course the kitchen was baking fresh pita bread.  The service was a little awkward with us having to ask for the check more than once, and ask for water more than once (we asked for water, the guy filled one cup walked away and helped other tables while the rest of our cups were empty).  \n\nI ordered the chicken pitza and we split a hummus plate with pita.  The pita is nothing like you get at the store, they were super thin, fresh baked, and when it came to our table it was poofed up to the size of a volleyball.  The pitza was a nicely sized pita pizza without any cheese.  Loaded with chopped chicken, green onions, and other spices.  To me it was a little plain and probably could have used a bit of acid like lemon juice to really give it a punch.  The prices here are reasonable and although it was amazing, I'd be interested in coming back here to try their other dishes.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-15", "description": "Delicious, fast service and reasonably priced. The zaatar bread and hummus bread were particularly memorable.", "author": "JC J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "The best hoummus I've had in the United States. Fresh pitas baked on site. Simple food and cheap. The decor is the only weak link in this culinary experience.", "author": "Theo R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "Great Middle Eastern food on the sometimes food-sparse Atlantic Ave. My coworkers and I made a reservation for 10 on a weekday, for lunch, and they dealt with our large party very well. They have a small indoor seating area, and a slightly larger back garden. I had the salad plate with 5 appetizers: hommous, baba ghanouche, tabouleh, lentils, and foul. All were fresh, but the baba ghanouche was by far the best, creamy and just a touch smoky. \n\nMy coworkers ordered a variety of different dishes: merguez (lamb) plates, chicken plates, lentil soup, chicken pitza, and other salads. All were served fresh and people were happy with their meals. The fresh pita is also delicious.\n\nBest as a lunch spot. CASH ONLY.", "author": "Claire M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "This is one of those rare places, that actually make you feel like you are eating an authentic food, straight from the source. Everything is so fresh and delicious, that i sometime wish i lived closer, or that they will open one next to my house.\nTheir Falafel Sandwich is very good (sometime a bit oily), but the smell of the fresh spices, chopped vegetables and amazing Pita bread make it disappear.\nThe only reason i took off one star, is due to a loud argument between one of the waiters and one of the guests. I think that the waiter/manager could easily take it to a different place, and not let all the customers feel a bit uncomfortable.\n\nTry it, unique experience!", "author": "Saul B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "There are few places in NYC where the food is always fresh. The pita bread is so fresh it comes right out of the oven and straight Tk your plate. I typically get the chicken salad and am always pleased with the crisp greens. I have ventured out and tried several things on the menu always well seasoned and tasty. My only complaint is cash only bit for the food quality it is worth the trip to the atm!", "author": "Keda P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "Disclaimer; I've only had Bedouin Tent as take-out, but they did a bang-up job. \n\nI only got a Greek salad (NB: it was massive) and a sun-dried tomato pizza, but both were fantastic (total came to $19). I'll have to branch out later into their Middle Eastern specialties. Service was a bit gruff, but what should you expect from these old-timers. \n\nCash only, but there are plenty of bodegas around in case you need to stop by an ATM. I'm still thinking about the pizza: perfectly blistered and chewy.", "author": "Cortney M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "I love this place. Makes me feel warm and fuzzy inside. Awesome pita and everything else. And they have real diet coke!", "author": "Lucio O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-28", "description": "Okay, I know this place is probably better than my experience. Problem is, we ordered delivery from Bedouin, so I'd have to err on the side of a bad experience because we did that. \n\nWe arrived at a weird time or something, because we walked in and they said orders are delayed by 30 mins. So we went to a friends place about 2 miles away and hung out there then ordered delivery.\n\nFirst off, the food arrived lukewarm. So it ruined the freshly made pita, and made it feel like rock hard store bought. The falafel was rock solid, and felt like eating a sea-stale piece of bread. The salads had all warmed up to the point of feeling not fresh. The lamb wrap, even though it was wrapped in foil, had solidified by the time we unwrapped it. \n\nHowever, the pita/pizzas (pitzas) are super delicious. The Lamb version is to DIE for. Cold pizza will never make me sad, so I think it held up better in the delivery process. Flavorful, spicy, and really a great deal. \n\nFor now, I have to say 3 stars. I'm ABSOLUTELY sure that had I eaten it in house, it'd have been delicious. But if you are going to offer delivery, you have to have quality assurance with that process, and control the temperature of your food (maybe use some insulated carriers?). Could we have microwaved it? Sure, but that would have probably ruined it more. Just avoid takeout, and I'm sure it'll live up to everything it could be.", "author": "Jon H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-28", "description": "The two stars are for the fresh pita and the nice staff. The other food we tried; about 4 different things were not special at all. I don't get the buzz about this place. It is okay and a little pricy.", "author": "Tagi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "10/30/16 We had a delicious dinner at Bedouin Tent last night before heading to a concert at BAM. The food was fresh and delicious, well seasoned with a nice but not overwhelming spice. We had the lamb pizza, zatar pizza, the 5 selection appetizer plate and the merguez plate. I had leftovers today for lunch and they were just as good as last night. This place is very casual, cash only and no-alcohol allowed. Our only complaint was that the merguez was not like the French merguez sausage my husband is used to; this was more crumbly, but still tasty. Yum.", "author": "Jill F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Super authentic family-run middle eastern experience. The decor and music take you to the middle of the desert. Great on the wallet. Celebrated a 30th birthday dinner with 6 friends. The best.", "author": "Igor G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "Hands down best middle eastern restaurant in the area!\nNot fancy but solid food", "author": "N T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-10", "description": "My boyfriend and I came here on 8/26. We ordered. the chicken pizza and falafel sandwich. The chicken pizza was pretty good.  My boyfriend made a comment saying \"All this pizza needs is cheese and it would be perfect.\" I stated back, \"Then go to an American restaurant.\" I didn't like the falafel sandwich. My boyfriend did. Our waiter was really nice and very attentive. Everything on the menu is under $10.", "author": "Constance A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-15", "description": "I ordered leg of lamb plate and shrimp pizza. They mis-ordered for choking pizza and asked me to take it when I refused they asked me to wait for 20 mins.  My original order was done in 10mins, I don't know why I had to wait for 20mins. Definitely not so great experience.", "author": "Taku T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "This place serves some of the best Mediterranean food I have tasted in the US! The restaurant is a small cozy place and has a feeling of those restaurants along the highway back in the culturally diverse countries. As you enter you can see a chef rolling dough for fresh pita and smell of fresh baked bread fills your heart. Their salad platter is delish(ohh that beat salad!) And the hummus is finger licking good. I would definitely recommend this place to any one looking to enjoy local food. It had good veggie options too.", "author": "Kalyani P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "Get the merguez sandwich and you may not be hungry for a week. Spicy crumbled lamb sausage with the right amount of heat and grease, overflowing its pita bread wrap.\n\nI also tried the five salad combo for $9.00 and a \"green pizza\" for $7.00. Neither was anything special but at these prices you can't go wrong. And the proprietors are really friendly accommodating people. Order takeout at the front counter and watch their food prep routine on a busy night and you will get entertained while your appetite builds.\n\nOne, thing, if you like harissa-type heat you might mention this when you order. Other than the merguez, everything was just a bit bland for my taste.", "author": "Otis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "Definitely nothing fancy to look at but the food is tasty and the prices are reasonable. They have a few tables in the backyard too.", "author": "S D."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Bedouin Tent", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "405 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qFXR_duySQcvwvrXiP5tpA/ls.jpg", "@type": "Restaurant", "telephone": "+17188525555"}