{"aggregateRating": {"reviewCount": 83, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "The first thing to know about Karasu is that is has killer ambiance.  It is a great spot for a date (if you are ok with the price tag) or for dinner with friends.  The staff is great as well. \n\nThe second thing to know is that the food is really tasty and the drinks are interesting an dwell prepared.  We loved the streak for two, and I highly recommend springing for that.  The only knock on this spot was that some of the appetizers weren't as good as the entrees, but the menu is focused and you really can't go wrong. \n\nIt is the back of Walters, which is a tasty restaurant in its own right.", "author": "Ian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "This is my first Yelp review, and the only thing that motivated me to write it was an absolutely fantastic, personal and memorable experience at Karasu. So glad to have this gem of an addition to the Fort Greene foodscape. \n\nMy fiancé and I went there for a low key birthday dinner last Sunday and came away having had a terrific meal (the sashimi and dorade are to die for) and feeling the warm and fuzzies thanks to our lovely hostess Lauren, who brought out celebratory drinks of sake, dessert lit by a candle, and generally made us feel so special. \n\nThank you Lauren and Chef Peet - look forward to the next time!", "author": "Sruthi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "I don't know how this has only gotten 4 reviews. It's a lovely spot - quiet, not crowded, easy to make a reservation, beautiful setting. \n\nFood menu is small but what they do have was delicious. We got the scallop sashimi, hibiki and the ribeye. The steak was delicious and wasn't heavy in the way it's done at a classic steakhouse. Ftw", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "This speakeasy-ish restaurant is a great place for a unique interpretation of Japanese cuisine.\n\nKeep on walking thru Walter's. It's right thru the hallway. It's a dimly lit brooding dining room with an intimate ambience.\n\nMe and 3 friends ordered 3 appetizers: the duck kara-age, age-dashi and the tsukune. It was a good amount for us and each of them were innovative interesting takes on traditional dishes.\n\nI then made the wise decision to order the tonkatsu. Oh man, it was stellar. I have been to Japan dozens of times and this was easily one of the best pork cutlets I have ever had. It was perfectly breaded and fried. Not too chewy, not too crunchy. When I bit into it, the cutlet was juicy and rich. Thankfully there was a lot of it and I was able to share the wealth with my friends.\n\nMy only problem was that the prices were a little exorbitant. I can find a slightly lower quality Japanes place which would be 2/3s the price. But my only complaint.", "author": "Timothy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-26", "description": "Cute backroom restaurant/bar with good mix of tunes (and not loud.)  My whiskey cocktail was good but not amazing.  We ordered four dishes...unfortunately, two were fried, so while delicious, they weren't special - they were just fried food.  The best dishes were the smallest in size.   Probably won't go back as it was expensive.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Great service and amazing food/drinks. I like the fact that it's very low key. I advise making reservations, tables go quickly.", "author": "Rafael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "My new local! I love this place. The staff is so charming, the menu is delightful, and they serve champagne by the glass.", "author": "Toni G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "nice interior and vibe mixed with a Japanese touch\nGood price and so many good drink selections for whiskey lovers as well as cocktail lovers\nAnd most importantly, friendly and kind bartenders!!", "author": "Ami P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Drinks were great, karage and steak are excellent. Very cute and romantic setting with a speakeasy atmosphere. The salads were very impressive! It is Asian fusion, not quite authentic but dishes were very well prepared.", "author": "Hit U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "Love the ambience of this place and the food was pretty tasty. Particularly the octopus and fried chicken. Not a big menu and more of a good spot for delicious drinks. We went on a Monday and it wasn't too busy yet service was pretty bad. Would go back for cocktails at the bar.", "author": "Megan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "Stopped by with a couple of friends. Reservations are a must. Drinks were delicious. I was looking for a vodka based drink and they were able to substitute the Gin for vodka in a drink called Bee Side which I highly recommend. We had some sashimi as well which was fresh and delicious. Try it out.", "author": "shana l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Great service, fantastic experience.  This hidden gem is a Brooklyn treasure - must come and find the hidden secrets this has the unlock", "author": "Sean T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "The Dippermouth was the best cocktail i've ever had. Beautiful interior design, awesome cocktail glasses...took me back to time spent in Japan!", "author": "Todd T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Fantastic experience, from the food, to the service, to the decor. We had multiple apps (the fried chicken was so good we had to order a second batch), the octopus, oysters, edamame (best I've ever had - with a nice amount of salt), miso soup, then moved on to the whole fish and rib eye. And, the buttermilk ice cream, with just a hint of \"tang,\" was delicious! We cleaned every plate! I would absolutely recommend this hidden gem and, as an out-of-towner, truly hope I get to return!", "author": "Kaye M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "I still give this 5 stars, quality is still solid from when it's existence wasn't even advertised yet. Great cocktails and good sake menu. The Koji ribeye for two was right on the money.", "author": "Gift B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "Cocktails are solid. Food is good. Sashimi small dish was aaawesome.  Interior is Art Deco in a cool subtle kind of way. Lastly, I love when you can tell a waiter how hungry you are and they give a legit answer to if you have ordered the right amount of food. Our guy hit it spot on.  Nice experience.", "author": "Marc P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "This is a terrific hidden gem behind Walters- go thru Walters to the door in the rear. The food is the best Japanese I've had in Brooklyn maybe all of NYC. Truly a find. Romantic space too. eat up!", "author": "Eve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Go here for a cocktail. Sit at the bar and order something, anything with your favorite booze and you will likely taste flavor combinations you've never had before. Have another. Admire the vintage glassware and perfect decor and decide you need to upgrade your cocktail glasses and light fixtures at home. Get hungry and order a thoughtfully prepared nibble, maybe the fried chicken thighs and wonder how they manage to get them so crispy. Ask the bartender (who's an unassuming pro) to pour you something else, and be astonished by a delicate floral sake that's so good you want to take it home to sip in bed. You consider taking the bartender home too. Instead come back to this super sexy place with a date and do it all again.", "author": "Odetta S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "Fantastic ribeye (we've come back just for the beef), good cocktails, and interesting apps/sides.  Great vibe and mid-range prices.  Nice foodie-oriented wait staff.", "author": "Heidi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Creative dishes, excellent service, and overall amazing experience. Karasu is one of the best hidden gems in NYC. Its versatile vibe is well suited to groups of friends or a romantic date. This is a fast favorite for thoughtful Japanese dishes that are perfectly paired with craft cocktails. Led by two brilliant chefs, Karasu is set to be a fixture in the global culinary scene.", "author": "Ariele F."}], "servesCuisine": "Japanese", "priceRange": "$31-60", "name": "Karasu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Dekalb Ave\nWalter's", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/atmzrAGEHNrJZfPNUyKpEQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472234811"}