{"aggregateRating": {"reviewCount": 83, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-04", "description": "Though this is a three star I was fairly disappointed. The good stuff: the whole space is nice even though it's basically half a restaurant (you have to go into another restaurant to find it). My drink was awesome, I believe I had the night nurse (eat the leaf it's delicious). The hot soba was better than good. The noodles were chewy, the tofu was flavorful and the different kinds of mushroom had distinct flavor rather than like here's a mushroom and now here's a slightly different mushroom but it's basically the same.\nThe not great stuff: service was meh, though they were very accommodating of my friend who is celiac. My appetizer, the lobster and scallop, was fine though there was no need to dump salt on it. Basically overall it was too expensive for what you got. I'm fine spending money on small, expensive plates that are delicious. But this was just high prices for ok food. Maybe we didn't order right. I would maybe go again and order completely different things but still cannot decide if it's worth it.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Wow. Slightly buzzed after a night of cocktails at Karasu but I couldn't wait to write this review.\n\nI'm entranced. After dinner at Walter's, a couple friends and I headed to the back of the Fort Greene, Brooklyn restaurant and entered into this mysterious, completely black, no signage door that led to one of the greatest speakeasy type bars I've ever come across.\n\nThere isn't a ton of space as far as tables go (maybe 8?) but there's also a bar area and, if you're lucky, you can snag a seat there without having to make a reservation. I was automatically impressed with the service from the moment I sat down - attentive bartenders and they were knowledgeable and willing to explain drinks if needed. My friends and I tried out a few different options and each of us loved all of the ones we tried.\n\nIf you're a gin drinker, the Bee Side (gin, basil, lemon, lychee) is amazing.\n\nFor darker rum drinkers, the Nettai is good (and strong) but it's essentially shaved ice like... definitely unexpected. But, for so much ice, it's actually strong (seriously) and there's quite a lot of drink in it.\n\nBoth of my friends had the Wave (gin, coconut, lime, etc.) and really liked it. I'm not a coconut fan, but they both are and enjoyed it.\n\nAn odd thing about his place is that, as my friend said it, \"it's sort of Russian roulette with the glass your drink is served in.\" One friend ordered a drink and it was in a small cocktail glass, then a bartender made the same exact drink 10 minutes later for someone else in a glass two inches taller than her. Slightly odd, but I think that's just the way it is... the luck of the draw. However, all cocktails are $14, no matter what size glass you get sooo, good luck.\n\nThe ambiance, experience and true chemistry that goes into making these drinks is unmatched. I'm excited to go back and actually have dinner here next time!", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-20", "description": "The food was okay. Nothing spectacular like I was hoping for considering the price we were paying. Service was okay. Our server was not very friendly. She was very short. Sure, she may have been busy, but she was like that with another friend who went another time.\n\nBack to the food.\n\nOysters were good.\nSashimi was okay. I could've just went to the handroll at Dekalb Market.\nNoodles were good, but too salty.\n\nNothing really stood out for me.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "We had delicious food and an excellent waiter. Four of us had a great mix of the tapas. The gazpacho is a definite get, as is the Lobster and Scallop. The mackerel was perfect, with salted crispy skin being a highlight. The chefs really understand the delicate balance of flavour, texture, smell and visual, and are able to craft a full sensorial pleasure.", "author": "Lorelei P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "Great place for drinks at night or a date. Almost has a speakeasy feel with the separate bar and entrance at the back of the bar. Apparently their kitchen closes sooner than the front bar which closed its kitchen at 1am. I'd recommend.", "author": "Vikram A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-17", "description": "This place was good - a little over-hyped. I don't think we'll be back just because of the fairly small menu and the servers were a bit weird to interact with and seemed more focused on up-selling us vs. just being normal/nice. We were running 10 minutes late and they made sure to let us know we only had the table for an hour and a half. This was a completely fine amount of time, but it just felt kind of tacky. I personally don't like to know they are booking the tables that close together - to the point where they have to let you know what time to leave. The ambiance was cool; perfect lighting and noise level (good for a date). I thought the food was really good, so if you're willing to overlook the other things mentioned I'd give them four stars. I had the whole fish, which was amazing IMO - paired with this delicious white wine they had by the glass. My bf had the ramen, but he thought it was lack laster in comparison to others he's had for half the price. We also had the pickled veggies \u0026 warm potato with sesame butter (yum!). It's worth trying if you're looking for a new experience in BK!", "author": "Telina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "I love to eat dinner at the bar, and this is probably one of the best places I've had the pleasure of doing so. Great cocktails, simple menu, excellent experience. Service is top notch.\n\nOysters, pickles, salad, steak for two: each thing was as delicious as the next. The steak is truly exceptional. Fatty, marbly, unctuous Porterhouse that would hold up at any fine steakhouse. The Caesar salad is worth ordering for the egg alone, this is a great dish. Pickles were a fantastic addition to the meal. \n\n10/10, would eat here again.", "author": "Heather M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-10", "description": "I'll keep it to the point. Are here last night. Food was delish- amazing concept, great menu. \n\nThe service was atrocious. When I say service I mean the server that \"helped\" us. I put helped in quotes because she did literally nothing. The food runner brought our food. There was someone else to fill out water and set the table. The people helping her were friendly and efficient. But the lead server that helped us made the entire experience awful.\n\nIt took her about 25 mins to even acknowledge we existed. Even tho it was 10 pm and really only a few other diners. She was extremely unengaged and uninterested. It was comical. She gave us zero recommendations. And said a total of 2 words while taking our entire order. She moved throughout the room as if she was sedated, walking slower than probably any living thing in NYC.\n\nIn all of my dining experiences ever both in NYC and around the world, this was by far the worst service ever. I'm not fussy or picky about service. But if you're going to be the only person on the floor in an institution like this, she could at least pretend like she cared about anything at all.\n\nI hope you find this helpful.", "author": "Toan P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-26", "description": "I'm disappointed every time I leave manhattan for Brooklyn. This place looks good in the reviews. Other places I've visited in Brooklyn were the same. Until you get there and notice it's just hipster millennials making Japanese food...not a real Japanese place at all. \nThe food is good. It's extremely overpriced. $76 ribeye for two isn't big enough for two. It would be a large steak for one, but for two...no way; especially at $76. \nService was very cold and not so good. No explanations and very rushed though. It looked like the waitress was the only one in the room. Maybe not her fault but minimal in terms of service. \nThe steak was delicious but you can do it at home with a little know-how and a pouch of shio koji. I won't come back and you shouldn't bother.", "author": "Nicholas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Ignore the haters. One bite of the fried chicken and you'll be a convert. \n\nA truly welcome, sophisticated Japanese place in the neighborhood. A great steak, a flavorful \u0026 crunchy pork katsu... Nice raw fish dishes and cocktails. And the setting is like a cozy movie set.", "author": "Eater O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Okay.. so I do NOT travel to Brooklyn (and I really need to more often) but my friends boyfriend threw her a surprise dinner here today and I have to tell you.. I will be back! \n\nWe started with the sashimi (kobujime fluke) and fried chicken ( that were so amazing!!) I'm a huge fan of the sashimi. It was super light and full of flavor \n\nThen we had several orders of the Caesar salad topped with a soy cured egg (perfect and refreshing). The sake steamed clams were also yummy but not amazing to me. Then we also had the Whole fish and ribeye. My favorite out of the 2 was the Ribeye... at my first bite I swear I got chills! So so yummy!\n\nAlso! The cocktails were awesome! \nWe ordered like 12 Shades of green... I swear to you the flavors are made for the perfect cocktail! \nThe ginger Baker was super refreshing and ginger strongggg but surprisingly sweet!\nIf you like mezcal... this is just for you!! ( my friends favorite for the night!) \nAlso of you want something cute and off the menu (full of ginger and a balance of sour. Order the penicillin! \n\nOverall 2 thumbs up! Great service and amazing food and drinks ! Perfect for an intimate date or a group celebration!", "author": "Blaine T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "I just moved to Fort Greene and as one does, I made it an imperative to seek out the best food joints in my new hood.  Came across the NYT review and made a reservation for a table on resy.com for Sunday night.\n\nThe restaurant is very well-designed. Lighting and wall aesthetics are well curated.  Cool vibe and hip clientele.  I agree with a lot of the reviews here about the food being decent but overpriced.  The karaage was excellent, tender and tasty.   The seaweed salad was meh and the oysters were fine.  Wasn't a big fan of the sea bream sashimi but that's totally subjective.  We were happy with our drinks.  I had a Ginger Baker and my bud had the one with a slice of pineapple.  I was very happy with my drink.  $14 a pop for drinks, slightly overpriced for what you get IMO -- BUT they have a happy hour it seems where drinks are $7 (would definitely come back for that). \n\nMy three star review is not attributed to the food or drinks.  The two docked stars is for the service.  Our waitress (and I believe the only waitress in the joint) provided unhelpful answers to a number of elementary questions about the food/menu and was pretty inaccessible during our 1.5 hour meal.  To be fair, the restaurant was full and it appeared that she was the lone waitress, so it may be a management issue.  Now I'm not a d-bag when it comes to service at restaurants, but when you're required to make a reservation and shell out $100+ for a few snacks and two drinks, decent service should be part of the package IMO. \n\nHaving said that, I would consider coming back with friends for drinks and some karaage at the bar during happy hour and suggest you do the same if you're considering a visit (you have the option of choosing either a bar or table seat on resy.com).", "author": "Tony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Shortly after sharing the Ribeye I came to the realization that I just had the best steak I've ever had. Returning to this spot is a no brainer.", "author": "Jared L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-22", "description": "KenScale: 7.5/10\n\nNew York City probably has too many speakeasy bars at this point and my favorites tend to be the ones that have been around for a while now (Angel's Share, Raines Law Room, etc.). Most of these bars that are hidden behind some secret entrances usually serve alcohol only without food options (maybe some light snack options at the most). Karasu, which really opened in Fort Greene, is a new speakeasy bar located in the back area of Walters, a casual looking American restaurant, that also serves casual izakaya-inspired Japanese dishes. I was certainly intrigued by the pedigree of the bartender (formerly at ZZ's Clam Bar) and the chef (formerly at Shuko), and was hoping that Karasu could deliver a major surprise. Overall, I felt the cocktails were at a higher level than the food.\n\nThe concise menu at Karasu consists of snacks, appetizers and larger dishes. My particular issue with food at Karasu is that it seems to purposely go for the heavy, salty flavor that caters to Americans without preserving the authentic feel to the refined Japanese cuisine. Sesame katsuo (skipjack tuna) sashimi, for instance, was tasty, but the addition of garlic oil and ginger felt like an overkill. Tonkatsu also had nice texture to the Berkshire pork chop, but why is the sauce on top of the meat all over the place, whereas typically the sauce is on the side so you can control the flavor while savoring the texture of the meat? Handmade pasta with uni and mentaiko (marinated cod roe) was a bit more moderate in flavor to my liking, but this time the texture of the noodle was an issue. I felt having a regular thick pasta noodle instead of the thin one that I typically see in Asian rice noodle dishes could've made this dish a lot more wonderful. The most satisfying dish of the night was daigaku imo, an assortment of soy glazed kabocha squash and sweet potato that my girlfriend and I enjoyed quite a lot, reminiscing our childhood memory when a similar dish was quite popular in Korea. \n\nThe space at Karasu is relatively small and it was close to fully packed in the course of our dinner, so I would suggest booking in advance. I did really like the cocktail selections from the bar where there are unexpected mixes of ingredients to create powerful libations. The dining space looks like a typical neighborhood joint in Brooklyn, not quite as magical for a speakeasy compared to, say, Raines Law Room. Karasu seems like a better option for a drink or two of cocktails while you are in Brooklyn; as someone who has known and tasted authentic Japanese dishes, the kitchen's direction was not quite agreeable to me.", "author": "Ken S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-13", "description": "This hidden spot in the back of Walter's has a great, romantic atmosphere. Service was also really solid, as was the tremendous sake selection. The food was underwhelming for the most part and very overpriced. The only dish we loved was the fried chicken appetizer. The rest was pretty bland - especially the udon main dish which cost $20 and the clam appetizer for $15. Nothing seemed to have any salt or seasoning. Portions are also quite small.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-20", "description": "Nice design and tasty drinks. Overpriced and undertasty. Go for drinks only and you'll leave happy. Food was lacking flavor and much more pricey than it should be. I like the concept: a sort of hidden Japanese izakaya style restaurant behind another restaurant (Walter's) in Fort Greene. The menu is short, with limited options, including donburi, pork tonkatsu, ramen, steak for two, and karaage (fried chicken).\n\nI started with a flavorless miso, bummer, and followed with a flavorless ramen, big bummer. The fried chicken appetizer was fine, but nothing like what you would find in a great izakaya, and still on the bland side. The sweet potato appetizer was decent and had some flavor, although minimally prepared, so the flavor is more likely due to nature than the kitchen. The pork tonkatsu was fine, but $27, which is unnecessarily high. Best item on the menu is the Daydream cocktail, rum with crushed ice and coconut.\n\nTwo drinks, three small apps, and two small to medium sized entrees will easily cost you more than $100, plus tax and tip.", "author": "Will V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-17", "description": "Made by bakagaijin for bakagaijn. Service was slow. Nasu nibitashi was good, but as long as you follow a recipe, there is no way to fuck that up. Pickles: just okay. Salmon and ikura donburi: unacceptable. Ikura was not fresh. Dessert: don't bother. Sake list: mediocre. Lotus root: possibly my favorite thing, but not enough to redeem the meal. \n\nWhen bakagaijin think they have something to add to a thousands-years-old tradition of Japanese cooking, and other Brooklyn bakagaijin are ready to eat that shit up because they don't know any better and are intimidated by actual Japanese people, this is what happens. \n\nNever again, thanks!", "author": "Olga F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-08", "description": "Delicious food and cocktails but I'm still not sure it was worth the price tag. We prefer Walter foods/Walters. My fiancé left hungry, which is no burnout after throwing down a couple hundred dollars for dinner. I thought someone might have wished us congratulations also, as we were celebrating our engagement, but they did not.", "author": "Alyvia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Karasu deserves its reputation as one of the best new restaurants of the year.  I loved the vibe of the place.   I arrived at 10:15pm for a 10:30pm reservation and the place was packed.  Fortunately, Taylor at the front door managed my expectations throughout.   We didn't get seated until near 11pm, but had a drink in the front at Walter's and it was OK because Taylor kept us informed.\n\nThe food is the real reason to go: must-haves on the menu include the mushrooms and the Tonkatsu.  My partner said the mushrooms were the best dish he's ever had, and he hates mushrooms normally.    \n\nStart with a Japanese whisky drink if you can and then ask for a reco on the sake.   At our servers suggestion, we had the Masumi \"Okuden Kantsukuri\" 500ml.  Really excellent.\n\nTaylor and our server took care of us all night.   Loved the entire experience and we'll be back.", "author": "Doug J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "In the back of another restaurant, really set up the mood once you get in.  Good sake, tasty food.  Had a very pleasant evening.", "author": "S H."}], "servesCuisine": "Japanese", "priceRange": "$31-60", "name": "Karasu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Dekalb Ave\nWalter's", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/atmzrAGEHNrJZfPNUyKpEQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472234811"}