{"aggregateRating": {"reviewCount": 83, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-29", "description": "This place in my opinion is one of the best restaurants in the city, one of those places you want to tell everyone about but like also nobody so that you can have it for yourself. Even more so the case for Karasu, because it is not huge and I can barely get a reservation in the first place. \n\nMy husband and I come here very regularly. We like Japanese food a lot (especially him), so that could make us a little more biased towards izakayas. I also love love love craft cocktails in hidden, not-too-loud places, so Karasu is pretty much my sweet spot. \n\nMy go-to drink is the Love Supreme, but lately have been enjoying the I'm So Green (am a big fan of whisky / mezcal-based drinks though). Go-to food items are the karaage and tonkatsu, don't think there has been a time when we went there for dinner and did not order those items -- like even when we decided to not order the karaage in the beginning, we ended up ordering it after we finished what we first ordered. But overall everything else I've tried here is perfection as well. \n\nService is also consistently awesome. If you can't get a reservation and have a small party (like, 2 people), you might be able to snag a table or bar seats anyway. They really do try their best to make it work. \n\nCan't think of anything even mildly negative to say. Oh, I guess it can be a bit pricey. So yup, go here when you're looking to go out for a nicer dinner!", "author": "Susan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-25", "description": "I've been to Karasu several times for good snacks+drinks, good service from the bartender. I live close by and have gone to Walter's for years. This review is for my first experience dining at a table, which was miserable. I made a reservation for myself and partner and visiting family. I came a bit early to see if it was possible to move the reservation. A hostess said we had the big table in the back but it wasn't ready. That was totally fine and we came back an hour later at our reservation time. Another host then told us that we would be sharing the table and one of us would have to sit on a stool in the bathroom walkway, then they walked away. This was done in a totally rushed manner that none of us understood until we sat down. \n\nThe problem isn't with sharing space its that the other party we shared the table with were trashed. They came from the bar, so the service staff should have been aware. Anyway, be drunk! Cool, whatever. I'm down. As a person who has worked in restaurants and bars before, the host/waitstaff, etc. should have known better than to seat them with us or at some point checked in to make sure it was ok, comp'd something, made me not sit on a stool where people had to squeeze by to use the toilet.\n\nOur unexpected dining companions spent the entire dinner shouting, discussing their sex life, making out, kicking the table and... cracking jokes about us. \"Oh man, they totally hear us, right?!\"etc. etc. I sound slightly crazy but... no. They were so loud that I couldn't participate in the conversation with my party at all. It was like I was the third attendee on this creepy dude's date. Aside from total unpleasantry of hearing this guy's gross come ons the service was rushed (or else I would have obviously asked for a reseat although they obviously overbooked the place), the bus boy spilled water on my arm and knocked my chopsticks off my plate every time he came back without apology and can't say much for the waitress as she seemed to be avoiding the whole situation. I looked for someone to talk to after dinner but there was no host or our waitress. It was awkward, uncomfortable and totally not ok for the kind of place Karasu poses itself to be. I was embarrassed to have brought my partner and visiting family there. \n\nI mean it was so bad we had to go for another stronger drink down the street to shake off the wasted time, money and really gross info about what this guy is gonna do to his drunk date. Could be a funny story, but not with the price tag. Food was ok, but they need a completely new service staff. What's been echoed in other reviews here -- rude, rushed, unpleasant.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-17", "description": "Very disappointed. This place has such great potential, I really hesitated in writing this. I haven't written a yelp review in EONS. I felt compelled to share my opinion; I would like this place to do well. As of my experience in Feb 2019, this place is overpriced and overrated.\n\nThe restaurant has beautiful decor and great ambiance.\n\nThe wait staff were miserable. Four of us sat down after a cheerful host showed us the table; we had reservations. This was a belated birthday dinner. One minute later, the waitress came to ask for our drinks. The other couple looked at my partner and I like, huh? The drink menu is extensive, multiple pages, and we were looking at which type of whiskey by the glass and table sake we wanted. One of the men at the table said something along the lines of, well there are a lot of whiskey choices, so no, not yet. The waitress didn't offer any suggestions or recommendations, she just politely walked away.\n\nMinutes later, she returns. We ask her for sake recommendations and she helps us. By the time she returns w the table sake we know which individual drinks we each want- two got cocktails, two got a glass of whiskey. Let me put it this way, the whole table felt rushed. \n\nOnce the drinks came, the waitress asked to take our order. We ordered one of nearly every appetizer, a ton of stuff, and two of the fried chicken. She asked about entrees and we said we would order those once we see the appetizers because we don't want to over order when we should share entrees. We wanted to taste as much as possible.\n\nThis is when the waitress told us this was not possible. Genuinely confused, we all looked at each other. Perhaps the entrees were complicated and required forewarning. Instead, the waitress said, we really can't take just part of your order, it's Saturday night. \n\nKarasu, you have a choice here, to be any old Manhattan institution that pushes you in, hopes you take some insta pictures and immediately pushes you out. Or you can build a cozy, inviting, neighborhood atmosphere with your Brooklyn clientele. I say this as someone who lives in Manhattan and came to eat dinner w our Brooklyn friends. So, not wanting to hold anything up, we ordered the grilled fish, ramen, schnitzel, and something else I can't even remember- something along the lines of steak. \n\nOverall, the food was hit or miss but largely disappointing as agreed by all four of us. The ramen was completely bland, the fish was actually disgusting- totally fishy, unappetizing, we didn't say anything to the waitress, we had plenty of other food, but she also didn't say anything about this nearly uneaten dish when she took it away. The meat dishes were good. \n\nThe plates were just ushered in and out with no regard for whether we wanted to order more of something, etc. We wanted another sashimi but never got the waitress's attention in time. We ordered two fried chicken plates but only got one. I picked up the last oyster, held the tiny spoon in my hand while I used the condiments, and someone came over and picked up the oyster plate while I was in the middle of drizzling the condiment with the spoon. We all laughed. This is terrible service. The feeing of being rushed was just out of control.\n\nThis meal was approx $300. Ladies and gentlemen, we were outside of the restaurant, walking to a bar in less than 1 hr 45 minutes from when we sat down. \n\nThe food was disappointing, especially considering some of the prices. The wait staff made it a pretty rushed and unwelcoming atmosphere. At this time, I would not recommend this restaurant to my friends.", "author": "Chrissie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-25", "description": "Dropped by around 6pm on a Saturday to grab a drink and app before dinner. We didn't have reservations, but they were not needed as the place didn't get crowded until almost 7pm.\n\nLocated behind a door in the back of Walter's, the space is open and inviting. There's bar seating, tables for 2 and 4, and then this elevated, tucked in booth for 6 which we were seated at (our party consisted of 3). This was a great seat for people watching as you get a full view of the bar and dining area below.\n\nThe menu consists of a single a page of food (snacks, small plates, and large plates) and then multiple pages of alcohol. The karage was hot and juicy, but there's better karage out there. \n\nFor cocktails we got the manteca, daydream, and mighty mighty. The toasted sesame really stood out in the mighty mighty while the coconut gave the daydream a nice creaminess with the nigori. \n\nI would come back for cocktails, but probs not for the food.", "author": "Connie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Take the train out to Fort Greene. Stride confidently through Walter's, a beloved neighborhood restaurant, to an unmarked door in the back. Take your quoted wait with dignity, and don't despair if it's for the bar. Walk your companion around the park as the sun sets. Come back for your seat, and put yourself in Karasu's very capable hands. Boom. Date night solved.\n\nKarasu is a Japanese speakeasy in the back of a restaurant, and I'm aware of how played out that sounds, but they do it right. The drinks are the draw, though we were ultimately more impressed with the food. It's a little pricey for what it is, but I think the ambiance makes up for it.\n\nCocktails are $14 across the board, and feature the usual suspects: plum, ginger, coconut. A few leaned away from the typical hipster Japanese palate, like mango and curry mezcal or rye and pineapple. My Daydream had ample creamy coconut, but was hindered by ice overload; my boyfriend's Mighty Mighty had a nice note of sesame but was ultimately just gussied-up bourbon to me (though he drank it happily). Both were served in unique glassware.\n\nAlso notable is the sake program. At the end of the meal, I had a glass of absolutely delightful aged sake, which was closer to a port and deliciously cinnamon raisin-y.\n\nWe had the sashimi of the day, which might have been mackerel. It was fishy and oily, but in the best possible way. The pricing was pretty high for a few small pieces ($12ish), so you could skip it.\n\nKaraage ($13) was a much better buy, juicy chicken thighs fried perfectly and served with lemon and soy sauce. Just get this. We also had a side of lotus, carrot, and other vegetables ($6), which was typical but refreshing.\n\nWe split a noodle dish ($18) which was huge and delicious. A great broth, topping, and noodle texture situation.\n\nOverall, it ran $55ish a person after tax and tip, but it was a lovely experience. Service was attentive, and though pacing was relaxed we were never left waiting. So long as you're willing to accept the price, it's an easy charmer.", "author": "Liz S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-19", "description": "Cute dark small space- they had us stand by the bar because the tables all had reservations. Good drinks but the katsu sandwich was amazing!!!", "author": "Mindy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Such an amazing gem. It's located inside another restaurant called Walters. My friends and I had reservations for 8 at 5:30pm. We were the first people to arrive so we got to take in the cute ambiance before it got too crowded. The service was great - she was attentive and patient with all of us as it was a our first time.\n\nFood:  My friend and I shared plates while the other 6 ordered individual dishes. For our appetizer we got the Green Salad (the cape gooseberry were SO GOOD). For our large dishes we ordered: the Koji Prime Ribeye for Two, Whole Mackerel, and Donburi. It's safe to say that everything we ordered was so on point. I can't wait to come back here. I really do recommend the ribeye and mackerel. We also washed it down with one of their special sakes. Definitely make this a place to check out!", "author": "Carol L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-29", "description": "Go behind the secret door and experience a real treat. We thoroughly enjoyed Karasu- loved the ambiance and design of the space. Not as thrilled about the kinda slow service. But I digress. Let's talk food.\n\nWhat we loved here:\nJapanese sweet potato (probably our favorite dish of the night), the kaarage (always a favorite), and the roasted mushrooms\n\nWhat we really liked here:\nthe pork chop (tasty!) and the mezcal cocktail\n\nOther:\nthe pickles (not a fan), and the olives (ditto).\n\nAll-in-all we liked this place. Try it out if you're in the neighborhood.", "author": "Art C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-31", "description": "The restaurant was OK, but not great. It's at the back of another restaurant and doesn't seem to have windows or ready means of ventilation. It took me a few minutes to stop sensing in initial smell.\n\nThe dishes I enjoyed the most were the sashimi and mushrooms. The fish was well grilled, too. The oysters were small (for $3.50 pp), but fresh.\n\nThe pickled vegetables were less than I expected (I love oshinko), the octopus salad was ok, as was the crab salad.\n\nNot a bad place, but for the price they charge, I expected more.", "author": "Alex Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-22", "description": "This speak easy style restaurant is very intimate. It's located through Walters, lit but candles and frequented by couples. The menu is designed for sharing. We started with the Sweet Potato (highly recommend), karaage (highly recommend), and the mushrooms (eh). For our main we had the steak for two which was cooked perfectly. Our whole meal was delicious but WILDLY overpriced. The night finished at $200.... I was so disappointed. This is a place for extremely special occasions. Like my death.", "author": "Gabrielle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-23", "description": "Watching an episode of Chef's Night Out brought us here, and we were not disappointed.  I dig that this place is sort of like a speakeasy, where the restaurant is located behind a backdoor within another restaurant.  The look of the place is very cozy and you feel enrobed within some secret society where they serve impressively delicious Japanese food that comes out of an even more impressively tiny kitchen.  We didn't have reservations on a weeknight, but we were lucky enough to score two seats at the bar.  We came for a snack, but ended up ordering about 4 or 5 dishes, that were all quite tasty.  The most memorable and my favorite item was their Karaage Chicken followed by the Pickled Vegetables Three Ways which was the perfect acidic balance to the fried chicken.  We also had the delicate egg custard, \"Chawanmushi\" but that took a little while to make.  My husband was surprised by the Crab Salad (red crab, tofu, mentaiko, served with gyoza wrapper chips) and really seemed to have enjoyed that above all else.  Me, I was going in on that amazing karaage chicken thigh!  They serve nice, large chunks, that were meaty and juicy, but not oily, and just scrumptious, and actually the best karaage I've ever had.  It would have been absolutely perfect with a warm bowl of rice.  And we washed down our little \"snack\" with a refreshing yuzu soda, and it was overall a really delicious meal.  I'd be thrilled to come back and try their infamous Koji Prime Ribeye, that looks hella dreamy based off all the photos posted here on Yelp.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-10", "description": "I have a haiku for this quaint little Japanese restaurant:\n\nWe ate here, got sick\nNo thanks for a ruined trip\nFuck you Karasu\n\nFirst let me say, most of the meal and experience was excellent...save the fact that my wife is sitting here suffering from FOOD POISONING from eating their  veggie ramen....\n\nI would have given this place a 4* review.\n\nThe drinks were great. The steak which was recommended by the bartender was great. The fried chicken appetizer was great. \n\nThe ramen, my wife said was surprisingly bland. And now she is shivering in bed going thru bouts of vomiting and diarrhea as I write this....\n\nWe ate and shared all of the same food today...\nKatz's...great no problems\nNot Ray's Pizza...great no problems \nKarasu...the only place that we didn't share (lucky me...not her) FOOD POISONING \n\nThe bartender seemed on point minus the typical NY bit of an attitude at first, until she goes on a rant talking to another customer at the bar for 10 minutes loudly about her life and neglects getting us anything to drink until she notices us put our empty glasses to the edge of the bar, and finally comes over saying she thought she saw us motion for her...\n\n$200+ for a meal for 3 plus drinks to have to deal with a sick partner...\n\nYou decide.", "author": "C M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-30", "description": "I have been to Karasu many times, have brought family here and have raved about it to friends.  I was a big fan and supporter.  I came here last night and was utterly disappointed.  We tried 2 new (to us) dishes - the shrimp and the crab salad.  The shrimp was basically boiled shrimp with little extra flavor - nothing special (for $19), do not get.  The crab salad was also disappointing - it was just small and the flavors were not there.  The fried chicken was definitely good (we have always loved the fried chicken here) but it did not melt in our mouths like times past.  The beloved ribeye, which we also usually rave about, was just not as good as previously - it was chewy in many parts and just did not meet expectations.  I am hoping this was just an off night but the quality of the food seems to have gone down considerably and I can no longer congratulate it.  Also a salmon starter dish that we loved before (I believe lightly seared and it also melted in your mouth) was off the menu - another disappointment and sweet potato jumped from $6 to $10!  I hope Karasu works harder to regain quality they had previously.", "author": "Abbey Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-07", "description": "A bit overhyped. Sub-par food. \n\n+ Lovely environment \n+ Fine service  \n+ Good cocktails \n\n- The food! We had the salad, trout and ramen. Bland and disappointing. Let down of a meal. The ramen in particular was bad. So bummed to say this, but we won't be back.", "author": "Camille S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-04", "description": "This was our second time to Karasu. We're fans of the food and the atmosphere. But last night, the miso soup was pretty tasteless. The server wasn't particularly friendly and a dish (the Japanese sweet potatoes) came out cold. When we asked the host if they were supposed to be cold- especially seeing as they came in tin foil and had butter in the side, he sheepishly said no, then returned to apologize and ask if he could offer us something else as there were no more potatoes. We assumed, given the situation that this would be on the house, it was after all a small dish that they brought completely cold and had no more of. So it was surprising to see them still charge us for the replacement item which totaled 12 bucks. I didn't say anything, it just felt like bad style and generally like the place isn't nearly as classy as it tries to appear.", "author": "Andros Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-11", "description": "Tonight I learned that you primarily go here for the cocktails. I wanted a family style meal and if I wanted to get one I might as well have just gone to Walter's. Not that this place is bad, just really come here for the cocktails and expect it to not be cheap.", "author": "Deirdre L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Amazing little gem. Happened to stumble upon while strolling around the neighborhood and killing time to wait for a nearby restaurants seats. This place literally beat the other restaurant (which was also good, but this was even more memorable). A spontaneous find with my girlfriend and lots of dishes we both enjoyed. The steak is to die for - the best.", "author": "Charles C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-08", "description": "Noted there's a birthday celebration and the servers just seem over the night. Never checked if we were good or how the food was. Knocking over a glass on the birthday person and casually saying sorry cause you feel forced and walking away. Hostess was amazing. Food was good. If you're going to wipe all around the table don't be one handed and lazy, pick up the glasses in the way which would've prevented knocking a glass on my lap. I really wanted to like this place.", "author": "Chewy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-06", "description": "My friend had her 30th birthday dinner here last night, and being the Yelper I am, I read copious reviews on what to order. The restaurant is a small space at the back of another establishment called Walter's. Our table was the only group table in the space -- there is bar seating and also smaller tables. We had a total of six people, just fyi. \n\nThe place had a very cozy and romantic atmosphere...no windows. While it is a bit dark in there, the light from the bar area is enough. \n\nWe decided to order a bunch of things and share. The food is tapa-style except for the larger dishes. Here's what we ordered:\n\n*EDAMAME: your average peas, could've used a bit more salt\n*PICKLED VEGGIES: three types of veggies, including soy-marinated cucumbers and daikon\n*MISO SOUP: I didn't try it, but a few people ordered it\n*OYSTER: I ordered one -- it was nice and fresh, presented beautifully on ice\n*SASHIMI: five pieces of seabream (so soft and clean)\n*CURRY DONBURI: Curry didn't have much flavor, not salty and not spicy (would not recommend)\n*DONKATSU: very crispy and the meat was so soft but rich. Comes with a small side of cabbage salad\n*DRY AGED RIBEYE (meant for two): this was my favorite dish, hands down. The meat is so tender with the perfect amount of fat. A few pieces are just all fat, but I totally ate them to go with my cocktails\n\nFor cocktails, I tried both the DAYDREAM and the WATERMELON MAN (I think those are the names -- their menu isn't on their website for some reason). The watermelon one was a bit too sweet for me, but the daydream was perfect. Has rum and coconut in it with flakes and crushed ice. \n\nAll in all, the food was good but way overpriced for the small portions. Good place to come with maybe one or two other people. Cocktails were $14 each...yikes.", "author": "Jenni K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "My boyfriend took me here as a surprise for an early Valentine's dinner over the weekend. Don't blink or you'll miss it! You have to go through Walter's restaurant to get to this speakeasy. The atmosphere was romantic - dim lights and enclosed space. Drinks were quite pricey at $15. \n\nThis is definitely a more American/Japanese fusion. Don't go in here looking for authentic Japanese tapas (Izakaya). We had the: \n- Sashimi Chef's Choice (5 pieces for $16). Melted in your mouth good!\n- Sayoko's Karaage (kind of like small pieces of fried chicken $13). Chicken was crispy and meat was tender.\n- Koji Prime Ribeye (for two $76). The steak was good alone. No sauce needed. Some pieces were way too fatty and not edible.\n\nCustomer Service is all part of the dining experience. They need to step it up. Even if you are seated at the bar, you should get the same exceptional service as if you were seated at the booth or at the tables. The bartender would just place the plate in front of us with no explanations. On top of that, when we asked about a certain ingredient in a drink, instead of explaining what it was, he corrected the pronunciation of it.", "author": "Christine L."}], "servesCuisine": "Japanese", "priceRange": "$31-60", "name": "Karasu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Dekalb Ave\nWalter's", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/atmzrAGEHNrJZfPNUyKpEQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472234811"}