{"aggregateRating": {"reviewCount": 83, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-02", "description": "Eh. Atmosphere is cute but food was severely underwhelming, and drinks didn't live up to the hype. And it's expensive! There were lots of bones in the sashimi (!), and everything else (octopus sunomono, seafood udon, pickled vegetables, mushrooms) was bland and portions were tiny. Wouldn't go back!", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-30", "description": "Unfortunately we were not impressed. We go out to eat a lot, I read an article couple of months ago, saw pretty good reviews her on Yelp and decided to take my husband here (he did not want to go). When we came in we were pretty excited, the place looks very intimate, however once we took a look at the menu we were turned off. Menu is very limited, prices are way too high. We have been to quiet a few Japanese restaurants and this is by far one of the worst. The edamame does not need a citrusy zest, the eggplant was not anything special just a poorly pickled vegg, we really wanted some raw fish (they just offered good old herring which I would only get at a Russian restaurant), and the dorado was somewhat decent. I honestly would never go back, I was quiet disappointed that my husband stayed pretty hungry after we left since nothing tastes good it was just ok. We were hungry so we had to eat. The scotch is very very overpriced. You do not have to pay$ 26 for a mediocre scotch and barely an ounce pour. Overall i would not go back and do not recommend to get the dishes we got. May be others like it but if you enjoy good Japanese go to Zuma!", "author": "Dilya F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Small place, but cozy ambiance. Great drinks, nice bar  nice staff, great food. Very small menu, but I have a weakness for tonkatsu and this is by far the best tonkatsu I've had in the US - maybe even in Japan because I didn't used to go to fancy restaurants there. The whole fish was also very good - maybe a tiny bit salty but done perfectly. Highly recommended.", "author": "David M."}], "servesCuisine": "Japanese", "priceRange": "$31-60", "name": "Karasu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Dekalb Ave\nWalter's", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/atmzrAGEHNrJZfPNUyKpEQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472234811"}