{"aggregateRating": {"reviewCount": 4, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "I had the bacon egg and cheese here, which by the way is really good. That meal started my day. Any who,  the breakfast rush happens everyday. I once got lunch around 10:45am and there was still a rich going on; just no line present. I never got lunch here , but I assume the same applies during the hours of 12-2pm. \n\nThere is additional seating upstairs that's in the cut , so if your not looking for it you wouldn't noticed it. I also saw the hot and cold buffet as well. Never got that because I don't usually grab the food that's outside in a deli / bodega type of place. Kind of picky about food that's on display for long periods of time. \n\nAnyway if your in the area and just need something to grab real quick, or want something affordable in the vast changing area this place is not a bad choice.", "author": "Diane D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "This is a great place to grab breakfast in the morning. I stayed at the Hilton up the block and walked there to grab a bagel and coffee. The food was good and it was quick. FYI they only take cash.", "author": "Kimberly I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "This is a great place to grab a variety of breakfast or lunch items to take back to the office. I also just discovered that they deliver and I can order online. The staff is very nice and the food is great and for a great price.", "author": "Elizabeth H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-18", "description": "Very Rude... I called to place an order first off the phone rang about 20 times and finally when someone answered she placed me on hold that was no problem, when she came back she said hello and I answered guessing she didn't hear me she hung up. I called back and was able to place my order but at the end of the call my phone cut off so I called her back and gave her my phone # and before i could ask the total she hung up.. so I called back and said you hung up before i could ask you the total at that point the lady said \"OMG MY GOD\" I honesty thought that was very rude I am a customer no matter how many times I called there was no need for her to say that.. My Co workers and I always order our breakfast from this restaurant but I will not be anymore and I'm going to advise my co workers as well...", "author": "Atina J."}], "servesCuisine": "Delis", "priceRange": null, "name": "Smith Food Express", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "21 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/RGWi8zEFOA4BgEyEvDfgrQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188550405"}