{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-05", "description": "As I understand it, Brado is a pizzeria from the same folks as Gruppo on Avenue B. While I feel a bit nostalgic for my days in Alphabet City, Brado doesn't seem to live up to my fond memory of Gruppo's pies.\n\nThe pizza's thin, cracker crust is too thin and cracker-like for this man, and the house pie toppings (Chickpotle, Shroomtown) weren't as well-balanced and outstanding as I remembered. Perhaps the mistake was not going for my standby, the Big Pineapple (to be sure, not ordering the bacon and pineapple pie is always a mistake). I'm sure I would've enjoyed the salads more if I liked salad more, and also if I didn't dump it all over my pants. \n\nThat said, friendly service (shout out to our dude from Cleveland), and a welcoming bar area probably means I'll be back soon to try again, at least for a few drinks and a pie.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "I love a good super thin crust pizza, which you don't find many of in the NYC area. Brado is the only one I know of, in fact (besides something like Pizza Hut or Domino's...but let's don't go there).\n\nYou can't really go wrong with any of the pizzas at Brado... the Meatball, the Meat Lover's, and the Tres Fuegos (especially yummy w/ manchego cheese, avocado, marinated diced tomatoes, and chorizo). Note that because the pizzas are thin crust, you might need like 2 pizzas (just saying)... OR you might order a pasta or salad on the side. Their pastas as equally as good--particularly the Pappardelle al Funghi Chicken Carbonara Sauce (w/ Carbonara sauce, bacon, pulled chicken, and mushrooms). OMG, sooooo good!\n\nBy the way, one of my favorite salads in all of NYC is at Brado--the Quinoa and Avocado Salad. The feta cheese, avocado slice, and lemon dijon dressing combo really creates a taste explosion that you'll remember for quite some time. Don't miss the salad. Oh, and it's huge and shareable. =)\n\nAs for the interior, it's not as quaint and romantic as some of the other Atlantic Avenue pizza spots, so the place doesn't scream \"date night\" to me. It has a more family friendly look inside. Brado does, however, have outside dining for days when the weather cooperates.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "Don't ruin your lunchtime. Go somewhere else. One waitperson, slow kitchen. Here come our entree. Oh wait, it's almost dinnertime!", "author": "Mark K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-26", "description": "The pizza is delicious but the bartender downgrades the restaurant. The same bartender worked at Waterfront Ale (formerly at the same location) and I stopped going there after many rude encounters with him.  He continues to be one of the nastiest people in NYC.  We tried to get seated last night (completely empty except the bar) and the bartender proceeded to ridicule our requests to sit by the window.  Nothing like going out to pay for a dining experience served up with mockery.  I hope the owners read these reviews and get rid of him.", "author": "Mathilde C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Love their Mac and Cheese with bacon and their salads are delish!  Fast delivery :)\n\nTragically, you can no longer order through Yelp.  You have to go to GrubHub or use Brado's own website.", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "This is my favorite pizza joint in the area. Really delicious crispy thin crust pizza and great choices for toppings. The Tres Fuegos and Meat Lovers are both really good (although you probably can't go wrong in general here).\n\nThe pizzas come loaded with LOTS of toppings, but the crust stays really crispy (doesn't get soggy and gross).", "author": "Bo J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Delish brunch!  The steak hash is unbelievable and enough for 2!  Chicken parm is great too, but wasn't earth shattering.   Start with a mini cheese pizza and small side of meatballs.  Lastly but not least, the Wolffer Dry Rose Cider is the bomdiggity, I could drink it all day long.   Not too sweet, everything about it is on point.", "author": "Kay E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "I like crispy pizza and this place delivers, literally and figuratively. It's a little salty, but I put arugula salad on my slice and it's perfect. Meat lovers is the best.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "This place is really great for so many reasons. The food is on point, there is a good variety of drinks including decent beers on tap, and the price is right. And check out the happy hour, for reals. \n\nSurprisingly awesome brunch! You won't leave hungry, I promise.", "author": "Jeri H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "This place was amazing! I went with a group and we indulged in three wonderful pizzas - the best featured chorizo and avocado. I dream of this pizza. So good.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "I've ordered Brado over a dozen times since moving to Cobble Hill earlier this year. The delivery is always quick and the pizza is AMAZING. I try my best to eat healthy and Brado has the option of a thin 9-grain crust which makes me feel much better about my weekly pizza habit. The customer service is also incredible - they always work with my crazy delivery requests with kindness.", "author": "Elaine K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "This pizza is VERY specific. If you like/want VERY thin crust- almost cracker-like, you will love this. In fact, even if you don't normally like this, you will probs like Brado. The pizza is filling and the toppings are fresh and plentiful. The drinks are stiff, good value and the service is awesome. They are consistent , too. I alwasy come out feeling satisified. Extra points for a good, happy hour set up!", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "This is one of my FAVORITE places to eat.\n\nAMBIANCE\n\nThe inside is a little small but there is plenty of seating. There are two booths when you first walk in on the left and two others on the right near the window. The FULL bar is also on the right hand side and there is enough space for a crowd to be there on a Friday night. In the middle there are two more booths. One sided booth/chairs [you know where the girl always picks the booth and sticks the guy with the chair] along the left hand side. It really is a nice set up and they have plenty of fans and dim lighting. They also have some tables outside so if its a nice day you don't have to be inside. \n\nFOOD\n\nThere truffle oil is really good. I always get the meat lovers pizza which comes with Italian sausage [I believe two types, one sweet] and pepperoni. Its a great combination. Ive tried other types of pizza, they are all good. The meatball is great and the Salsiccia Dolce as well.\n\nDRINKS\n\nThe bar has pretty much anything you ask for as far as alcoholic drinks. If you're getting a regular soda ask for a can because the one that comes out of the spray [the thing at the bar] it will be flat.\n\nSERVICE\n\nGood service; they are attentive enough but don't pester you.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "What an amazing surprise! Free large pizza with a purchase of a bottle of wine? Dreams do come true!! Love the super thin crust too. 5 Star!", "author": "Marie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Consistently good pizza and even better service, which is really the reason we come here every week (we are particularly impressed with Bertin, who is always professional and accommodating)", "author": "Fany M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Awesome thin crust pizza! We had the white pizza with arugula and added shiitake mushrooms! So good!\n\nWe highly recommend the outdoor seating if the weather permits.  Atlantic in this area is booming and full of energy!  You have to try this one!", "author": "Scott H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-26", "description": "I never bookmarked this place but never had to as what they offer is memorable. Pizza is typically the best answer. And after much nachos and popcorn at the movies when we were still hungry, thin crust pizza seemed like an excellent choice. \n\nService and wine are outstanding. We were greeted and seated right away. Our waitress was quick to give me samples of wine, a full cup practically, and offer suggestions as to her favorites as well. Their wine list focuses on those of Italian origin and I got to sample (and fall in love with) two new favorites. I like my wines dry, earthy, and zesty. These wines are carefully selected and do not disappoint.\n\nWe ordered the classica and the pesce. The classica is your typical mozzarella, tomatos, and basil. When it came, I have to say I was a little let down. The crust is thinner than I'm used to. And the tomatoes are diced, not the slices of whole ones I was expecting as well. And instead of actual fresh basil leaves, they were shredded. It all come together in an underwhelming way.\n\nI'm glad we had the pesce pizza as well. By the time I sampled my boyfriend's, I had grown accustomed to this unusually thin crust. It breaks clean and snaps when you bit into it. And when this thin pizza is topped with cheese, substantial chunks of salmon, capers, and arugula, it becomes quite the satisfying meal all on its own. Their pesce pizza is delicious. We gobbled it up and got another one to go.\n\nI'd love to go back and sample other pizzas on the menu. And with such welcoming service and great wines, I'll be back soon.", "author": "Julie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Oh. My. Pizza. If you like thin* crust, this is THE place for you. I've never actually had a pizza crust this thin before, ever. And trust me, I consider pizza its own food group. I stopped by to pick up a take-out order so I cannot comment on the service or atmosphere etc. I also cannot comment on any other food aside from pizza. However, I can let you know that they offer a 9-grain organic crust, and also personal-size pies**! AKA the keys to my heart. I made my own concoction with spicy marinara sauce (HIGHLY recommend spicy), spinach, roasted garlic, and extra cheese. I felt the spinach was a little scarce but luckily the taste made up for it.\n\n* The crust is so thin its almost like its not there at all, making it almost guilt free. \n**Any sized pizza is a personal-sized pizza, if you believe in yourself.", "author": "LeAnn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "Well, they definitely aren't lying! The pizza redefines what a thin crust is - it's actually more of a pizza crisp than a crust. I love thin crust, but I actually would have preferred a little bit heavier of a crust.", "author": "Justin E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "Recently stopped in for dinner with friends. Realized Brado is sister to the restaurant Vezzo in Murray Hill! Amazing thin crust, great salads and friendly service. Will definitely be back next time I'm in the area!", "author": "Emma B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Brado", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RrLJC-f4mxcRr1P2Uqk99g/ls.jpg", "@type": "Restaurant", "telephone": "+19292981531"}