{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-08", "description": "The service was horrible The waiter forgot my order. Never brought my salad and also forgot my pizza order I never received the pizza and he  came back and asked what my order was well after my order was placed 15 minutes ago. It wasn't even busy.", "author": "Iesha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "Seldom do this but this place earned it!  Kale and manchego salad begins the glory (and the Chardonnay, of course!) with its light and glorious flavors. Follow it up with the shroomtown pizza. Truffle oil, marinara and an exciting blend of perfectly cooked fresh mushrooms paired with their deliciously thin and absolutely lovely crust! Been back a few times and want to come every day!  Desire to try other items on their menu but it's REALLY hard, as this combo is a gem.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "My boyfriend and I stopped in for dinner and had a great experience at Brado.  I ordered a glass of cotes du rhone and rigatoni with mushrooms as my entree, and my boyfriend ordered their chicken \u0026 mushroom carbonara dish.  Both of us really enjoyed our meals; I found the portions to be well sized, considering it was too much food for me but enough for my boyfriend.  For dessert, we took a chance on their bread pudding (it's always a chance!), and it was really delicious - order it a la mode!", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "Great menu with tons of options, hubs always wants pizza and some of the other pizza spots in the area only have pizza on the menu, thus locking me in. That being said I made my own personal pizza when we tried it soon after opening and it was delicious. Rich pesto, sweet Caramelized red onions, fresh ricotta, and the most amazing thin crispy crust. Great vibe and a nice bar, looking forward to trying more items from their menu!", "author": "Angelique L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-29", "description": "We got a card with a 20% discount! Great opportunity to try a new place. After the fact (just finished), a 100% discount would not have been enough. It is in fact a very thin crust, but everything else was awful. We are big fans of Table 87 just down the street, we'll stick with our standard, thanks anyway.", "author": "Stephen A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Miss the old Waterfront Alehouse greatly but this thin crust pizzeria fills out that old space nicely.  Thin cracker crust pizzas that remind me very much of the dear departed Lento's of Bay Ridge. 20 or so craft beers on tap along with Bud \u0026 Stella. A lot of the old crew from the Alehouse is here on both sides of the bar. We'll always miss Pete's but I'd it had to go this ain't a bad replacement.", "author": "David J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Really solid pizza and beer list. We had the meat lovers and a few different IPAs and the quality is definitely there. The real star of the show though was our bartender, Bertin.  I'm in the service industry and haven't received treatment like this in a while. I'll definitely be coming back to see Bertin and have another pie or 2.", "author": "Matthew K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "We come here often. Really great pizza and beers, but the service is just always very very slow - even if the house is empty.", "author": "Sascha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Been here a few times with my family, including little kids.  Food is wonderful, excellent vibe/decor, and excellent waitstaff.  Both times my wife and I had salads with grilled chicken, which were great.  The kids love the pizza and pastas.  Not exactly what I'd call a family place, since there's no kids menu and kids aren't hanging off the rafters, but maybe that's a good thing provided your kids aren't maniacs, which mine may or may not be on any given day :)", "author": "Joel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Great place with delicious food and a variety of beer.  Only wish I could watch a Sunday football game there!", "author": "Deborah F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "Excellent thin crust pizza. Great beer list, friendly bar staff and wait staff. Salads are also on point. Great that they hired back some of the best from the previous restaurant in this space. Continuity of service is a major reason people keep coming back to a place.", "author": "Wade B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Brado has some pretty good happy hour deals. If you buy two cocktails you can get a free plain pizza. Pizza was pretty good. Didn't like one of the two cocktails we ordered and we were given a different one free of charge.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-23", "description": "Would give 0 starts if possible. Pizza was like tasteless cardboard. Service is bizzare. And half of the restaurant crew is out smoking cigarettes! Then they serve you food, gross! So many better and cheaper options just a few doors down. Never again.", "author": "Sarah O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-27", "description": "First the good:  the place has been updated since it was Pete's Waterfront Alehouse.  Really nice decor!\nFor the bad:  thin crust pizza doesn't have to be so thin it's like a flat cracker.  And the toppings certainly don't have to be thin and skimpy.  We got the large \"Tres Fuegos\" pizza that is supposed to have chorizo, manchego cheese and sliced avocado.  The only thing you could make out in the toppings was the thin slices of avocado.  The cheese was like a thin schmere of cream cheese and the chorizo must have been shaved on.  Because there were absolutely no slices or chunks.  The pizza was so thin that once you had a slice and it cooled down, the crust was crispy like a cracker.  When you took a bite and all the topping came off with that bite, you were left with an empty thin cracker in your hand.  I was so annoyed!  I might go back and order a salad, but I won't pay for another pizza.  What a disappointment.", "author": "ellen j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "I can't believe I'm typing these words, but...I actually CRAVED their Kale Salad (with Manchego, Currants, Pumpkin Seeds in a Sweet \u0026 Spicy dressing). It was SO good. Who the kale am I?? My mom was visiting, and I had wanted to try this place because I'd walked by so many times, and my Mom is a pizza nut, and we'd literally eaten Dellarocco's, My Little Pizzeria, and Table 87 in the preceding 2 days...so why not? Well, Brado finished out the weekend with a bang! We shared the Burrata appetizer which was fresh and delicious, and the Kale Salad, and a plain pizza. Everything was fresh and tasty, the thin crust pizza was a nice change of pace, and any place that can get me craving Kale...that's nothing short of a miracle. Why 4 instead of 5 stars? Because the super thin crust pizza, while good, will never fully win over my palate - it was tasty, and I enjoyed it, and I will enjoy it again, but when craving pizza, this isn't exactly what I have in mind. We ate outside, because it was a nice day, but the inside looks modern and clean. I've already ordered from here on Seamless since, and will be back. Brado!", "author": "Day H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-02", "description": "BEWARE, The 15\" Large IS ONLY 13\". Which is like losing at least a whole slice, which sucks, because the pizza was fn.  delicious. The kale \u0026 manchego was too small and not worth 12 bucks -  Largely just kale.   Overpriced and left two adults going for second dinner after ordering this in. for $40.", "author": "s b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "The house salad here is probably one of the best salads that I ever had. The ingredients might sound simple, but the mushrooms were nicely grilled and the greens were well-tossed.  It was so yummy and refreshing.", "author": "Mimi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Had the meat lovers pizza with jalepenos and basil and 2 beers, 33.75.  Pizza was super delicious,  just the right  crispness and flavor. Our waiter and bus boy were really attentive. ..major thanks to Temas (our waiter) for keeping such a great smile all the time", "author": "Linda P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Brado has burgers!  We have been regulars at the previous Ale House and now Brado. We were thrilled that the new management maintained many of the excellent staff; Mary, Clarence, Peter, and Dimetri. Although we have enjoyed the thin crust pizza and the excellent happy hour, we missed the burgers. Last night I had my first Brado burger and it was great. It is served on a house baked brioche with cheddar cheese, lettuce, and tomato. Fries are included in the $15.00 platter and a side of spicy mayo is amazing,; great for dipping the fries and for dressing the burger. My husband had the Fried Chicken sandwich and was equally satisfied. The battery fried breast was crispy but the breast was very juicy. Brado has added six new sandwiches which are available at all times at the bar and table service. They are burgers, pulled pork, pulled chicken, fried chicken, chicken Parmesan and meatball.", "author": "Anne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "Amazing thin crust pizza and excellent, hearty salads. We order from here weekly for an excellent and easy dinner. The plain thin crust is wonderful but recently tried the pesto base and loved it. The kale salad, apple cheddar salad, and tre colori salad are all excellent with wonderfully paired dressings. The bread pudding is served with a warm bourbon sauce -- to die for!", "author": "Katie L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Brado", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RrLJC-f4mxcRr1P2Uqk99g/ls.jpg", "@type": "Restaurant", "telephone": "+19292981531"}