{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "We ordered salads, pizza and pasta. All were amazing!  Pizza reminded my husband and I of our beloved Lentos. Thin crust and crispy. Salads were fresh and big enough to share.  Service was on point and very accommodating. Very kid friendly too with outside tables. While I was sad that Pete's Waterfront closed, I am very happy with this replacement.", "author": "Mia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Management made the great move of bringing back key staff, who along with the rest of the team, make it a great place. Mary, Clarence, Peter Z, Dmitri, are all wonderful. Pizza is top notch, but the new sandwiches, all farm to table, are killer. Organic burger, pulled chicken and pork, and the fried chicken are winners. Kudos to the whole Brado team!", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "So far, so good.  I've had the shroomtown pizza and arugula and prosciutto pizza.  Both were really tasty and the thin crust pizza is a nice addition to the pizza options in the neighborhood.  I've also had the sausage appetizer and mozzarella and tomato.  Both were delicious and really fresh.  They have a great happy hour and a beautiful bar.  You can also feel welcome to just come in and have a drink.  There is a great beer list and cocktail menu.  Brado has welcomed the former staff and regulars that frequented the previous business at this location (Pete's) and it looks like they will be a great neighborhood spot for years to come.", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "Super accessible and family friendly (if a bit loud). Came early on a Friday evening for the pizza, stayed for the cheddar apple salad and pasta carbonara. Will be back to take advantage of the happy hour specials!", "author": "Laura F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "Delicious and unique offering that stands out among the millions of pizza options in the hood. Delivery was super fast as well, just wish they were on seamless!", "author": "Darrell G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-10", "description": "I made the mistake of ordering from the Seamless.com menu where I thought I was getting pasta, salad and garlic bread for $12 as stated. When I went to pick it up, I was told that it was $15 for the pasta and garlic bread which is the dinner portion. They said I must have seen the lunch menu, but I only saw one menu on seamless. The menu associated with this yelp page seems to be more accurate.", "author": "Ms. Jasper G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-31", "description": "Don't order the pasta. I have had several pizzas from Brado. All are delicious. I decided to branch out and try the pasta. Big mistake. Big, food poisoning mistake. We ordered the pappardelle with mushrooms and chicken and shrimp linguine. The pappardelle wasn't great by any means. The chicken was virtually tasteless. It was drowning in sauce. Also, something about the chicken made me feel like it was leftover from another dish. The shrimp linguine was terrible. There was almost no sauce. The noodles were broken in short, stumpy pieces. They were overlooked and stuck together. The shrimp was undercooked and had no seasoning. It was bad. It looked like they made a huge pot at 9am and now, twelve hours later we were getting the bottom of the barrel. It did not look or taste fresh. We also ordered the garlic bread. It tasted stale and reheated. All in all, I spent $40 for terrible food and then, got very sick. Like I said, the food did not look or taste fresh. I would suggest just sticking with the pizza.", "author": "Lee D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "I have never really been a huge fan of thin crust pizza...until now!  Brado's pizza is delicious!  We had the Formaggio Bianco and the Meat Lover's pizzas (both excellent) and a very tasty Greek salad.  Great beer selection and a solid wine list.  The staff are very friendly and helpful and the place just has a nice feel to it.  Added bonus -- because this is pizza with a very thin crust, I did not experience the dreaded pizza coma!", "author": "M H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Brado", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RrLJC-f4mxcRr1P2Uqk99g/ls.jpg", "@type": "Restaurant", "telephone": "+19292981531"}