{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Stumbled upon this place while walking back to my hotel. It has a rustic vibe and there are some tables in the front that provide for prime people watching. The servers were very attentive and gave many recommendations on food options. There were specials as well and it made my decision that much more difficult!\n\nI chose a salad and the short rib rigatoni - would highly recommend. The pasta was cooked perfectly and tasted authentic. There is nothing worse than eating Italian and tasting the packaged pasta.  I also opted for a glass of red, can't remember what it was, it wasn't very memorable but I suppose it did the job. I would suggest a better wine selection for such amazing Italian food. \n\nNext time I will try the pizzas and the desserts - FOR SURE!", "author": "Ashley G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "I love Brado - the delicious thin crust pizzas, the freshest salads... I also would give them 7 stars for service. My order tonight was slightly wrong and Clarence not only fixed everything immediately and sent me a new pizza - he also called to make sure I got my new order. When I ordered pizza for my daughter's 2nd birthday last fall they threw in 2 extra pizzas just because. Brado is a neighborhood gem and they make it a pleasure to eat there.", "author": "chloe d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Went here for the first time a few weeks ago for lunch.  It was pretty quiet when my boyfriend and I arrived.  We got a 16\" pie of half Meat Lovers and half Tres Fuegos.  I kept telling my boyfriend how amazing the pizza tasted while we were eating - love me that crispy thin pizza. The Tres Fuegos was the perfect amount of spicy for me and a little too spicy for my boyfriend.  We also had Downeast Cider, which is now one of my favorite ciders and one that I'll be looking out for.  I love the brick wall, the rustic light fixtures, and the overall look of the bar area.  Service was good - our waiter was nice and even the bartender made sure we were accommodated even though we weren't seated at the bar.  I'm definitely looking forward to coming back here again.", "author": "Kat S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Amazing pizza. I am coming back next time I am in Brooklyn.  Oh yeah. Love it. Great service. Coming back!!!", "author": "Bob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "Hands down the BEST pizza in brooklyn without a doubt!  Everytime we get it it is consistently deicious, amazing quality sauce perfect thin crust!", "author": "Mike Mike L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Delicious!!!! I had the meat lovers and it was sooooo good. Best pizza in Brooklyn during my stay!", "author": "JLynn J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-14", "description": "I came here a few times when it opened and the pizza was amazing. Came back recently and it was TERRIBLE. The pizza was not what it used to be. The sauce, cheese, toppings-ugh. And not inexpensive. What a waste. So, especially when there are so many great pizza spots in the neighborhood :(", "author": "Amy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Perfect, crispy crust! \nThe pizza itself is delicious, toppings overpower and fine to skip", "author": "Maheen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "My favorite thin cRust pizza is BK. The Kale salad is amazing, my girlfriend and I get two every one order! This is the best neighborhood spot for a casual dinner/takeout! I love BRADO!", "author": "Laura W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "Yes the personal pizzas are wee tiny things (9~10 inches?)  Yes the crust is wafer thin, reminiscent of matzoh.  Yes 80 bucks is somewhat pricey for 3 personal pizzas, 1 crostini,  2 glasses of wine and 1 beer.   I won't even fault you for thinking \"hmmm, Domino's Thin Crust...\"  But dang, this is good stuff! The Tres Fuegos is spicy, but luscious, owing to the avocado slices.  Add a little more Tres Fuegos hot sauce and get ready for a party in your mouth.  The Chickpotle consists of delicious pulled chicken, pineapple and other ingredients that deliver a smoky punch.  If you are feeling adventurous, create your own pie from scratch.  Our waitress was cheerful, and the runner who brought our dishes was downright adorable.  I left happy, but not too full. While I didn't mind, I can imagine others might find the small personal pies disappointing.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-05", "description": "This is just not pizza. It's like super thin cracker bread with raw tomato sauce and fake mozzarella. The restaurant is on the impersonal neutral side... Positive note is that the Staff seems very kind.", "author": "Valeria L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Charming Brooklyn neighborhood restaurant! The space inside is rustic \u0026 cool, and the view of the neighborhood is picturesque Brooklyn. \n\nWe live around the corner, and both the food (we've tried numerous pizzas, salads, cocktails \u0026 beers) \u0026 service are constantly great! \n\nLove this neighborhood place!", "author": "Margery D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "I have never been a fan of thin pizza until I tried it here. It was the most amazing pizza I have ever had in my life. My boyfriend and I started with appetizers. We ordered the bruschetta and rotella and they were both good. The food was fresh and I couldn't leave any piece behind. We ordered half meat lover and the other half pulled pork, both were great but the pulled pork was to die for!!!! Deft try it. Our waiter was so friendly she recommended us in trying the LA ice tea and it was strong and good. We ended the night with dessert which was bread pudding with a cognac cream sauce....reminded me so much of my family's take on the dessert. I will deft be back.", "author": "Pharah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Your food is great, but it had been a hour and I was still waiting for my dinner. When I called and spoke to Melanie she apologized and said the order never came through from grubhub and issued me a refund + a credit at the restaurant. Thank you!", "author": "Anne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "So good! I love this family of restaurants and Brado is definitely up to par. The great staff here will make you feel right at home. Come for the happy hour - you will not be sorry! I mean, a free pizza with a bottle of wine or a pitcher of beer? Duh!", "author": "Kymberlee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "As much as I miss Waterfront, Brado could very well replace it as my go to place. Much of the staff from Waterfront has been retained, and it's great to see the many familiar and friendly faces I've grown accustomed to over the years (especially Mary!)\nThe pizza here is top notch, I can't say enough good things about it. The margherita pizza is delicious, so much so that I went back there two days in a row just to have it. I especially like the fact that almost everything used for the menu is locally sourced, and you can most certainly taste the freshness that comes with that in the food. The beer selection is excellent, as I expected, and they've got a great selection of bourbons as well. You really can't go wrong with this place!", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "My daughter and her boyfriend moved to downtown Brooklyn and love this place, so when I came in for a visit we went.  We had a large half parma/half meatball-red onion, and a small margherita.  All I can say is the pizza was absolutely delicious.  The crust was crispy, the toppings were plentiful and mouth-watering flavorful.  We fought over the last slice of meatball it was soooo good.  I wish I would have taken photos.   Service was great, although we waited almost 45 minutes for the check.", "author": "S T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Had a delicious dinner here!!! My wife and I started out with the Crustini appetizer then did a large pizza of arugula white cheese and truffle oil and tres fuegos. The Crustini is my favorite. The spice from the tres fuegos hot sauce was the perfect challenge of spice. We also had nice bottle of wine and relaxed.  Can't wait to go back.", "author": "Cat P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "First off, the best move the owners made was hiring some of the old staff. Mary is what kept me coming back to Pete's and will now keep me coming back to Brado.\n\nSecondly, the food and beer list are amazing. I was very happy to see that they will be bringing back rotating kegs of craft beer. It's very fairly priced, too (most are $7 a pint). They also have great lunch specials that come with a $5 beer or wine option. I ordered the personal pie and small house salad lunch special. The salad was very fresh and had great additions, like marinated mushrooms and kalamata olives. I got a personal meatball pie which was outstanding. The crust is super thin and crunchy and the sauce has tons of flavor.\n\nNeedless to say, I was more than satisfied and can't wait to come back and try more of the (expansive) menu.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Thoroughly enjoyed our lunch here. Everything was just fine, from the fresh salad to the perfect thin pizza, to welcoming and charming hosts. I will be coming back.", "author": "Pablo M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Brado", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RrLJC-f4mxcRr1P2Uqk99g/ls.jpg", "@type": "Restaurant", "telephone": "+19292981531"}