{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "The Happy Hour deal is one of the best in the city (buy a pitcher of beer, get a FREE large plain pizza).\n\nThe pizza is delicious, finding a good thin crust is hard in New York and Brado provides a welcome reprieve, as much as I do love a classic New York slice. The sauce here has the perfect level of sweetness for me. The cheesey bread is great as well.", "author": "Nick C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "This review is for the pizza bianco, which is an all white pizza (no red sauce). Their crust is so thin its so intriguing that the pizza doesn't break when you eat it.\n\nI love the location of this spot too. There's a lot going on and easy to get to from subways.\n\nThey have an awesome happy hour deal as well if you get a large pie, a pitcher of beer is on the house!!", "author": "Jessica E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "This is my favorite pizza chain in the city, but it does drive me mad that they name every location something different (Gruppo, Vezzo, Posto, Spunto, Tappo- I mean really!). I only know about one when I happen to pass it by and see the telltale signage on their facade. They do manage to keep impeccable consistency, so while some might wish each spot had something that makes it stand out, it's also nice knowing exactly what you're going to get every time you walk in.\n\nI can even say that down to the ambiance. They seem to keep the same soft lighting, the same soft/classic rock, the same unobtrusive but friendly service. A calm, relaxing atmosphere that seems to encourage lingering and conversation. \n\nI got my usual Shroomtown personal pizza and had my usual happy experience. Tons of fresh mushrooms, paper thin crust with a great crunch, flavorful sauce.", "author": "Luci B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-13", "description": "I really enjoy this joint!!  They have nice thin crust pizza - I especially like the one with mini-meatballs, red onion, and fresh basil!!  There's also a large bar, and a pleasant, casual ambiance.  We have tried the bruschetta which was yummy and fresh, as well as the cheesy garlic bread \u0026 tomato \u0026 mozzarella.  It is a sit-down table service restaurant, and they also have Grubhub delivering for them, which is convenient, if u don't feel like going out!!", "author": "Meri K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "This is a great family Italian restaurant! My favorite is the shrimp pasta, which is creamy and super flavorful. I've also had the pizzas and garlic bread, both amazing! Definitely a place to take a small group for dinner to eat really good food!", "author": "Carly G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-15", "description": "Not a bad pizza necessarily, since the ingredients were good and fresh, but nothing about the pizza was anything more special or enjoyable than just eating the broccoli and cheese and bread on its own. The salad was also really just the ingredients you'd get from the supermarket sort of just placed one on top of another. \n\nAlso when it gets busy they do have dismal customer service. I couldn't call to ask where our order was when it was over half an hour late and was put on hold whenever my call did go through. When I finally did get to talk to a real person, I would get hung up on after I asked my first question.\n\nI don't think it's anyone's fault if the restaurant is busy and orders are coming late, but when that happens it's really helpful to let customers know how long they'll need to keep waiting so that they can choose what to do in response (e.g. pick something else to eat for dinner if the order wasn't going to come in the next hour, or potentially at all). The communication was futile and frustrating left me with no answers and a dial tone and was totally unsettling.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "Solid thin crust pizza joint on Atlantic Ave. Was a little skeptical after reading some of the negative reviews but based on my experience I'd say they were unfounded. Came in for a late brunch and we were seated immediately. They have a happy hour from 3:30pm - 6:30pm all week including weekends which I thought was fantastic. Happy hour includes 2 for 1 on select wines and draft beers. There was also another offer including free beer with a particular kind of pizza that I can't recall. \n\nWe decided to order the quattro formaggi on the server's recommendation and also a make your own pizza with a pesto base topped with jalapeños. Pizzas came out in about 15-20 mins and were piping hot as you'd expect. When they say thin crust, they mean it and the wafery thin texture of the base literally melted in your mouth. I loved that the base wasn't overdone to the point of being burnt which I imagine would be easy to do when making a thing crust. Both pizzas were delicious and I'd be hard pressed to pick a favourite. The quattro formaggi delivered as expected from a classic but the pesto base pizza was really yummy too. May have been a little salty for some people's liking but I had no problems with it. Will definitely be back to try some more of their pizza.\n\nService was friendly although it did get a bit slow when the place filled up a little. Didn't take away from a great experience though.", "author": "Varun D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-05", "description": "The amount of arugula they put on their white pie is ridiculous.\n\nIt's basically a salad with a pizza underneath.\n\nThe chipotle chicken with pineapples is... fine.\n\nThin crust, and they deliver to DUMBO (for better or for worse).", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "Really great thin crust pizza in Brooklyn! I ordered via GrubHub and it arrive so quickly and hot from the oven. We got half olives and half jalapeños. I heard they have a special sauce that is really good. I will have to try that next time with this.", "author": "Shivani S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "The first think I have to mention was the sick happy hour special - get a free large cheese pizza with the order of a pitcher of beer or bottle of wine. We added toppings to ours. What a good deal! The food came out quickly and everything we ordered was super tasty. If you're craving thing crust pizza, this is an awesome option. Everything was also reasonably priced and we left there full and happy.", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "Summary is: it's good, it does the job, it was a fine experience ,but nondescript, and in a city with so much pizza I'd rather explore new spots than return. \n\nBreakfast pizza is a new thing for me but I'm into it. I was in a bit of a rush to catch the ferry so I got a personal size giardino pizza with two poached eggs to go. The pizza was really good. Good crust. Liked the sauce and the toppings were fresh. It had a lot of flavor in every bite. I wish the eggs were a little runnier though.\n\nThe service was accommodating, polite and nice and pretty fast. It was pretty quiet when I went there at 12:30pm but the interior was nice. I can see this place picking up later in the afternoon.", "author": "Shayan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "This place has an excellent happy hour deal- either buy one get one drink free, or buy a pitcher of beer and get a large pizza for free! Beer selection had a lot of variety and some IPAs- my fav. I enjoyed sitting outside in the front and getting to personalize our own pizza. The kale salad was also delicious- it had a soy honey glaze on it that I could have eaten for eternity.", "author": "Aly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Liked the thin crust pizza....got the Classico n shroom personal pizzas.\nIt wasn't doughy, definitely enough to fill us up.\nShroom pizza had some truffle oil.\nClassico pizza just had why a margarita pizza would have.\nWould have like some more/ slightly thicker crust but it is thin crust--really thin crust....at least it was good :-)", "author": "Lynie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "So pleased to write a review of this place. My wife and 6 month old daughter dined here on a Friday, early evening-about 5:30 pm. They were not only accommodating to children, they seemed to be happy to have them. The staff was excellent, but more about that later. I had the pappardelle pasta with carbonara sauce and it was perfect. The pasta was al dente and the flavor and textures of the ingredients really complimented each other well. My wife had the lasagna and she loved it. The garlic bread that comes with the dishes was very good--just the right amount of crunch and garlic/oil. The house salad was also delicious and ample. All of the portions were sized just right. The atmosphere is very inviting, friendly, and low pressure-but also very professional. Which brings me to our server, Temes. Temes is what every business owner longs for in their staff. Who knows, maybe he owns or manages the place. He certainly takes pride in what he does and adds tremendous value. Not only was he extremely knowledgeable of the menu, but he was sincerely happy to serve. He also mastered the balance of being attentive but not overbearing. He never stopped smiling and it just made for a really fun meal. There was a party going on and the place was getting packed, yet Temes never lost his cool. Being a food business owner myself, I couldn't help but watch him as he multitasked without losing his smile and generous spirit. This is the experience patrons deserve when they go out for a meal. So what to do? Double tip Temes, write a five star review, and get back to Brado as soon as I can.", "author": "Vince C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Brady has really good thin crust pizza... My faves are the Big Pineapple and the Milanese, but I don't think you can go wrong with any of them. The pizza is pretty big and can be shareable. They are thin crust and delicious so if you're like me you don't want to share! =)\n\nThe inside is cool and family friendly. Great spot for lunch with my little one.", "author": "Channelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Loved this place!  Quaint and cozy pizza place on Atlantic with the thinnest pizza I've ever seen, but that means fewer calories!  So I get my pizza fix without the guilt of all the calories associated with it!  Win win!!\n\nThe \"Classica\" which from the description appears to be a Margharita Pizza but it came with huge chunks of tomato on it.  I also got a pear drink (can't remember if it was a martini or margarita) but it was delicious!!  \n\nCan't wait to return. I think I'll just ask them to leave the tomato chunks off next time.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Pizza dough's as thin as paper. Despite the thinness, the pizzas were able to hold onto a good amount of toppings. 3 large pizzas - classica (think margarita-$23), chickotle (chicken, chipotle sauce, pineapples-$26), and tres fuches (spicy marinara, chorizo, avo, tomato-$29) rang up to a pretty penny but they were all quite enjoyable. Rounding up the rating b/c of service. Waiters were incredibly patient and polite at 10 pm on a Monday night.", "author": "Jamie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-15", "description": "As an experienced pizza eater born and raised in BK, totally recommend, especially if you like thin crust.", "author": "Jon A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "Good pizza toppings, super thin crust. Being someone who isn't huge on thin crust, this place has *good* pizza.\n\nThe meat lover toppings were really great. Not fake and frozen tasting like lots of other meat lover pizzas. I'd definitely choose a thicker crust pizza if I had the option, but would totally come back here. The outside seating is quaint and it wasn't too packed for a Tuesday. They had 2 for 1 sangrias until 6:30 as well but I missed it. *rolls eyes* \n\nWaiter was super charming and so friendly. He was really awesome in the beginning but kind of disappeared for a bit once we finished eating and were about two sips away from finishing our beers.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-13", "description": "The food is fantastic here. It's a true thin crust pizza joint. Recommend the Parma as well as the Shroomtown. The salads are fresh too. The staff was warm, welcoming and accommodating - thank you Marylou. Also a shout out to our waiter Bentin who took great care of us at the restaurant as well as with updating our info with the computer system for delivery.  A+ on food and service.", "author": "J L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Brado", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RrLJC-f4mxcRr1P2Uqk99g/ls.jpg", "@type": "Restaurant", "telephone": "+19292981531"}