{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Excellent service. Temes is genuinely great people, who provides top notch service and makes you feel at home, while being well versed concerning menu \u0026 bar items. There is an exquisite craft beer selection, with a knowledgeable staff. The food is fresh, unprocessed and tastes a cut above the rest. It's healthy, filling, delectable and with great portions. The restaurant can provide a cozy, intimate feel, a fun vibe or a cool family time, depending upon where you sit. This restaurant is a top fave of mine. My husband and I love it there. The lasagna is amazing, but the whole menu is great.", "author": "Dakeeta G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Simply some of the best pizza in Brooklyn... hands down. Dont know if its the best but its the best pizza ive tasted outside Chicago. New york pizza that makes me a believer in thin crust. Excellent.", "author": "D E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "This place is a familiar feel in unfamiliar times. Great for families or just a quick happy hour drink. Clarence is the best bartender from here to ATL; and the food will leave your stomach smiling.", "author": "Romel N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-08", "description": "Service is piss poor. Unfortunately we didn't have the chance to sample the pizza. The service was so slow and unacceptable we left before being served. While we waited we witnessed 2 other parties leave and head to the restaurant next door. Mind you, these parties arrived AFTER we did. I don't care how good the pizza is, if the service sucks it spoils the experience. Ownership/management needs to clean house or turn this into a takeout joint. IF the pizza is good.", "author": "Schavonne F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Went to Brado based on a recommendation. Loved it!!! My friend and I made It for their happy hour which is amazing. We shared a bottle of wine and had the free pizza. Our waiter was also very friendly ! Overall, awesome experience!! Will definitely be back :)", "author": "Allegra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-29", "description": "This place had bad service but now they are great they really have messed up the order", "author": "Reed M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "Their pizza is great, thin, not heavy! salads are great too, original and tasty. They have fast service and prices are good. One thing they can improve: wine glasses...they use this little water glasses... Not cool", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "Brado's staff is wonderful. I felt welcomed \u0026 attended to. The signature pies were like nothing I've had before and so delicious. I highly suggest Brado to anybody who enjoys good food, being treated well and loves thin crust pizza!", "author": "Alex G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "The BEST thin crust GLUTEN FREE pizza I have ever had!", "author": "BILL S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-01", "description": "Service was great but pizza was meh.  I like thin crust but this one was too thin somehow and didn't have a proper edge.  The sauce and/or cheese also had some herbs in them that rubbed me the wrong way.  I am not that picky with my pizza but this one didn't make the cut. Altho maybe's it's because we had the lunch special?  Will never know I guess.\n\nOn a positive, hubby's pulled pork sandwich was stellar.", "author": "Marianna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "I love this place - I have eaten here at least 10 times since it opened. I am not normally a fan of thin crust, but this is the best thin crust I have ever had - and its always crispy! \nAlso love that they have an excellent selection of salads - and good sized! I find it difficult to find a place for dinner that has an entree sized salad so I am thrilled that this place came to the neighborhood.\nAlso, place is always clean and have always had good service. Well stocked bar with a great selection of beer and liquor.\n\nHighly recommended!", "author": "Debra L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Amazing deal during Happy Hour - free pizza with a pitcher of beer... or it might be the other way around :) Great thin crust cheese pizza and a good beer selection.  We settled on a cider type.  The waiters were very polite and friendly and I loved the interior!  They do have outside seating as well but we preferred the air conditioning indoors.", "author": "Elle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Brado is a great neighborhood spot. The space awesome, it never feels over crowded and had the perfect South Brooklyn vibe. Their wine and beer selection does not disappoint. Also the staff here is second to none. I haven't tried the food but I'm looking forward to it! A very welcome addition to Atlantic Ave", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Pete's Waterfront Ale House was a great hangout and we were sorry when it closed, but Brado is an outstanding replacement! This is the best thin crust pizza that I have ever tasted! I will definitely visit here again the next time I am in Brooklyn.", "author": "Rod A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "From decor to staff this place is a gem. Great food through tout the whole menu. Staff makes you feel at home. Love this place", "author": "Charles K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-26", "description": "Just wasted 30 minutes waiting for a cheeseburger. Finally got sick of waiting and paid for my beer. As I was settling my drink tab the burger came out and, sadly, I had to tell the bartender I couldn't stay to eat it (laundry across the street was ready for me after 52 mins in the dryer). No recompense. No apology. No offer to take the burger to go. No... Nothing. That is how I would describe my experience here: nothing. Didn't even have a chance to experience the food because it didn't come out in a reasonable amount of time. Just terrible.", "author": "Phil M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-18", "description": "I have ordered many times from Brado.  They have great salads and pizza for the most part is very good. \n\nMy issues is with the service, in particular ordering over the phone. I was put on hold too many times, they had me repeat my credit card number three times, and then after one hour when my food did not arrive, I called back and they said they lost the order.  Had to start all over again. \n\nThey were nice and didn't make me pay for part of the order.  But the reality is that when you order food you want professional phone service, organization, and prompt delivery.  If they fix this it is a 5 star place.", "author": "MC M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-22", "description": "I'm really not sure why this place has such great reviews, sort of confused...we had a horrible, disgusting experience. \n\n1. My pulled chicken sandwich had sharp, shards of chicken bone! I was feeding it to my 3 year old. Thank goodness I got the mouthful. \n\n2. I would have told my waitress, but she was too busy chatting with bar patrons. At one point I decided it wasn't even worth it and let the busboy take our plates away. While we waited for the kids to finish we just wanted another glass of wine - so I had to get up, and flag her down. Once I got her attention she said with such attitude, \"Do you need something?\" without even moving. \n\n3. My son got the meat lasagna and vomited later that night. I'm guessing food poisoning but have no proof. \n\n4. My other son got the pizza - as others mentioned it is saltine-cracker thin and I didn't find it flavorful at all. \n\nWe won't be going back. If you do, stick to pizza; your life may depend on it.", "author": "Heather P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-29", "description": "Terrible service and grossly overpriced mediocre food. On any afternoon it's like Chuck E. Cheese for the smug hipster crowd. \n\nThe service just sucks. The bartender snapped at me for asking for a coaster.", "author": "Zack R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "I went here last night sat at the bar and tried a pizza the bartender recommended the meat lovers was delicious I'll be back to try the rest of the pizzas overall very good experience nice place .", "author": "Armando M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Brado", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RrLJC-f4mxcRr1P2Uqk99g/ls.jpg", "@type": "Restaurant", "telephone": "+19292981531"}