{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-31", "description": "Brado appears to be owned by the same group that owns Vezzo on Lexington Ave in Midtown. The pizza is very similar: overly cheesy, solid zesty sauce, dry and crackers thin crust, with a decent amount of char. The pizza isn't bad. Just nothing to go out of your way for. Also had a salad to eat, which was pretty good. The wine I had to drink seemed, unfortunately, to have been open for too long. It was also strangely breezy and cool from the ventilation system.\n\nWould not repeat.", "author": "Michelin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Where are my thin crust lovers at? This place is for you! Thin + crispy crust topped with seasonal and fresh ingredients. They also gave a great wine selection. \n\nOh and the ambiance!!! Dim lighting, candles +pizza... yes!", "author": "Anicia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "My favorite things about this  place were my waiter  who  looked  likely one of the Wayman brothers. He was very kind.  The next thing was the decor.  I wasn't  impressed with the taste of what i ordered Penne and vodka sauce  it was ok. Prices  were not high.  Nice vibe in there.  Fast  service too.  Thats about it i don't  think i will return", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-06", "description": "Only reviewing for delivery, never eaten in. I want to love this place because the toppings and sauce are amazing, but there's something about the thin crust that just does not hold the toppings in place. Both times we ordered from here, the pizzas came with all of the toppings having slid off the crusts into the corner of the box, where the cheese hardened. \nAlso, one time they majorly messed up our order, bringing us someone else's order, and we asked if they could just quickly take the pizzas we had to the rightful orderer and bring us our pizzas. But apparently once a pizza has been in someone's house you can't bring it to someone else. They insisted on making all new pies, which was nice, but it was hours before we ate. \nStill, it's the only place in the neighborhood I know of that has a good wheat crust and great non-pork meat toppings -- like grilled chicken and all-beef meatballs.", "author": "Olive U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "One of the best thin crust that is very tasty and delicious. Tried the Salsiccia Dolce and Shroom and both where great.", "author": "LL Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Great service!! The waiter T was so nice and friendly, super attentive. He definitely made our experience more enjoyable. The food was delish and reasonable priced.", "author": "Stef D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "We had two personal pizza - salsiccia dolce \u0026 shroomtown. Flavour of pizza was very good, but not hot enough, it was between warm \u0026 hot. The muti- grain crust was crispy and chewy. Service was good, very attentive. I really like their Arnold Palmer,  it is very light and not sweet. Will come back again if I am in the neighbourhood.", "author": "G G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "The sweet Italian sausage.... thats you all you need to know really. \n\nThis is my go to pizza place, either in-house or home delivery \u0026 that pizza gets everyone in raptures. Service is also brilliant which means it ticks all the boxes. Great food, great people. Yum!", "author": "Kate D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "Thin crust pizza at its best, and one of the best pizza places in the area. Table 87. No way. Sottocasa pizzeria. No way. \n\nNice selection of unique wholesome salads, and fresh pasta entrées. \n\nI cannot knock this place. It's my go to when I'm in the area.\n\nPS. Staff has always been courteous, and professional. A refreshing change indeed.", "author": "jay r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "I like that they have gluten free pasta! \nThe pizza is more like a cracker than NY style pizza, but my friends love it. They don't have gluten free pizza, but there are a couple of pasta dishes that can be Gfree.", "author": "Jillian W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "So delicious! Love the thin crust, price is just right, and the bartender was A+. Love it!", "author": "Taryn V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-11", "description": "The food gets 4 stars but the customer service gets 1 star. \n\nAfter I paid my bill (and left a slightly above average tip) I went to use the restroom. I wasn't gone more than 3 minutes and my leftovers (which was in a to go box) was thrown out. I could almost understand if the pizza wasn't boxed up but if I go out of my way to ask someone to box up left overs they shouldn't assume it should be tossed if left unattended for a couple of minutes. When I asked about it, a server fished it out of the garbage to show it to me, as if I would want it, but didn't offer me any type of compensation. \n\nThe place wasn't very busy and there were only two people working the floor. There shouldn't have been such a mix up.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "My friends and I went here for lunch and were served by Bertin, a knowledgeable, friendly waiter, who made some excellent suggestions from the menu, which we followed, and could not have been more pleased.  \n\nThe pizza was incredibly delicious and did not wilt when held in the hand. The Kale and Apple salads were extremely fresh and not overly dressed. \n\nThe only downside was that the Barbera wine was no longer on the menu.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "We have been coming to Brado since the first week it opened and are regulars. I'm sure it will be a neighborhood favorite for years to come. The first time I was there, I ordered the cheeseburger pizza. It was the best pizza I've ever had! Every time I came back, I intended to order something else, but, once there, I HAD to order the cheeseburger pizza. Then, one Saturday, it was no longer on the menu. I still enjoy the thin crust pizza, but PLEASE bring back the cheeseburger pizza.\n\nThe service and wait staff are awesome as well. And the beer is great too!\n\nDid I say before? Bring back the cheeseburger pizza!!!!", "author": "Ronald B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Dear Brado, \n\nI'm a long time fan of thin crust pizza. Having you in my neighborhood is a dream come true. You deliver delicious super thin crust pies and I love visiting your location. My favorite time to visit is for your great happy hour deal. \nThe staff is always very friendly, you have a great beer selection, and the millionaire bacon and mushroom toppings always make my tastebuds dance. Keep up the good work!", "author": "Heidi S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-16", "description": "Stopped into Brado with family earlier this summer and had a tasty time, though the service could be improved. \n\nI try not to let service issues get in the way of a meal, but this case was a struggle. The interior of the restaurant was cold beyond words -- you could see people at the bar fidgeting and rubbing their hands together. I get it's summer and you want to fight the heat, but this was overkill. When we asked the host to turn the AC down, he seemed irritated. All said, it took 3 different requests of 3 different waiters for the icebox to melt. \n\nThankfully, the food was on point. We ordered the personal salsiccia pizza, chicken Parmesan, and spinach salad. \n\nThe pizza was very fresh, albeit not incredibly filling for one given the thin crust. So I'd recommend supplementing it with a salad or appetizer of sorts. My sister loved the chicken Parmesan -- she said it's the best she's ever had!\n\nIn all, Brado clearly serves up good food. But I think I'll order my meal to go next time.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "Let me start by saying that when they claim to have \"thin crust pizza\" they mean PAPER thin crust pizza...but don't let that deter you! Their ingredients are incredibly fresh tasting and loaded with flavor. I usually come here for lunch to get a house salad (which is huge!) and a mushroom slice. It will be hard to find a slice with mushrooms of this quality anywhere else in BK (really, the mushrooms are FRESH, FRESH, FRESH tasting! No canned junk here)!! I'm typically a square-slice gal (and usually cannot stand paper thin ZA), but this place is one of my favorite lunch spots on this end of Atlantic Ave.\n\nDefinitely check out their lunch specials and their happy hour (YAAY to 2-for-1 GOOD draft beer--no sharing, but who the hell would want just one anyway!?)\n\nWhile I have really only commented on the lunch special/happy hour, the reason I am leaving 5 stars instead of four is the staff...not only is the owner friendly, personable and knowledgable, but the folks she has working there are polite, courteous and caring. Absolutely worth a visit!", "author": "E S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "I love this place. The food is always on point, the service is friendly and the beer selection is fantastic. \n\nI will be back many times", "author": "Adam L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-05", "description": "I went for lunch and ordered a margarita and fried chicken sandwich. The margarita was obnoxiously strong for a lunch time drink, and I really didn't enjoy it. The chicken in my fried chicken sandwich was so thin I was amazed they were able to bread, fry and handle it. Only giving them 2 stars because the fries were decent and my friend liked her beet salad. Will not return.", "author": "Asmika D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-02", "description": "Please... this is NOT PIZZA but a flavorless thin crust cracker flat bread! There are too many good options in the same block. 2 doors down luzzo's bk makes an amazing Neapolitan pizza with really friendly set ice and a hip vibe, and table 87 ( a neighborhood institution) is not that far! Don't waste your time, nothing italian about this place... at best a sad local l dive bar!", "author": "Greta P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Brado", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RrLJC-f4mxcRr1P2Uqk99g/ls.jpg", "@type": "Restaurant", "telephone": "+19292981531"}