{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "This is the second time we've been to Forno and it will absolutely be our last. This place is relatively expensive, has poor service, incompetent management, and most importantly bad food! Tonight we had a party of 5 and ordered some apps, wine, lamb chops, steak, chicken, and pasta. Apps and wine were fine, but then our entrees didn't come out for nearly an hour and half. Again and again we asked the server where our food was, and she kept saying everything would be coming out in just a minute. Well. It didn't! Finally after the third time of asking she came and said there was a miscommunication with the kitchen. What it was I don't know, but when we finally did get our mains nearly two hours after we sat down, the pasta tasted like sewage, the lamb chops tasted like they'd been sitting in a freezer for 6 months, and the steak was hard as a rock despite being ordered medium rare. We finally asked for the manager and he gave a half-assed apology and said he would take care of it to the best of his ability. Unfortunately that meant comping a few dishes rather than bringing out new food that was cooked appropriately. Clearly this place has no standards either for guest service or their food so they won't be getting my business ever again and I would suggest you don't give them yours either. Can't wait to see what comes next after this place. closes in a few years.", "author": "Ben C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "Ok place very loud , service very average and the pizza was ok not up to NYC standards. We are from Miami and we were not impressed by anything not he food nor the service.", "author": "Orlando R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "I had an amazing experience in this place , their food is so tasty and it didn't take a long time to get it. The drinks are wonderful too. All the staff are really nice and polite. Stop by soon!", "author": "Art I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "Delicious Lasagna. Nice warm sourdough tasting bread. No traditional Caesar salad or minestrone which I do like in any Italian restaurant but they are more \" upscale\" with their menu. Service was friendly, nice. Not overbearing which I like. \nInterior is nice and warm feeling even with the high ceilings wasn't noisy though it wasn't nearly full. \n\nOnly reason I took away a star was it took a loooong time to get the main course served. I noticed a single next to me and she waited over 30 mins from finishing her salad , and the restaurant was only maybe 1/3 full, not sure what was going on. \n\nBut delicious food!", "author": "Mr X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "It was the middle of the afternoon on Fourth of July, and I was just getting after a long morning of sleeping off the night before. I stumbled around Downtown Brooklyn, first in search of a Latin restaurant, then a diner and then a sushi place. They were all closed, either with reduced hours or a day off in honor of the holiday.\n\nForno Rosso takes no such breaks. They were open, with pleasing high ceilings and a slightly industrial feel. I went to the bar, had a couple of glasses of seltzer while chatting with the bartender. She was working just through the afternoon, before walking down the river to see the show. \n\nI ordered a heaping bowl of gnocchi with pesto and sage, and then used most of the crunchy bread that came before it arrived to soak up the sauce. \n\n\"I assume you hated and want it to send it back,\" the bartender asked, refilling my seltzer and taking away the empty plate. If I thought that might been the ticket to another plate of this gnocchi, I might have actually played along.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-17", "description": "The food is good. Service is very slow. My party was one of the first in at 11:30 on a Friday and it took and hour to get food. This is the second time I have been in here and I was swarmed by fruit flies the whole meal both times.", "author": "Amanda F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "Food was 4* service was 5* so I'll round up.  I was in on a quiet Monday evening and was seated promptly, served with a smile, and was checked on enough to know the staff was there but not so much to be intrusive.  Food was very good.", "author": "Don P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "I came from Italy, and this is the best and most original Italian pizza in Brooklyn. The tartufo pizza is my favorite !", "author": "Steve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Great environment. The artichoke, avocado, arugula, pesto, and cherry tomato salad was SO GOOD. The complimentary bread and EVOO\u0026lentil sauce was even better (probably just cuz I love bread and lentils). Will definitely come back/would recommend for a dinner date or even larger party.", "author": "Bianca B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "There is the most tasty pasta I have ever eat!!! Perfect!！ everything is perfert，but the classic blood Mary is a little bit spicy.. I don't like this", "author": "Wang S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "Very nice pizzeria in downtown Brooklyn.  The space is very large with plenty of seating.  The pizza is very good.  It's similar to Adrian's on Stone St. in lower Manhattan.  They have white and red individual pies that easily feed 2.\n\nWe also had a fried antipasta which had pasta, rice and potato fillings.  This was also very good.\n\nService and price is right.  Head on over!", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "I love this place, best pizza in the Area and great vegan options!! So delicious, such great service, and the bread with lentil dip they bring you is so good and like nothing I've tried before!! Go!! You won't regret it!", "author": "Leah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Stopped in to this establishment after a manicure and pedicure next door; was promptly seated. Ordered the Rugolina Salad  and the Fettuccine Bolognese. Yum! The fettuccine was cooked just right and the sauce was very tasty (not too much meat). Oh and did I mention the bread with olive oil/caper dip? Two glasses of wine made this a perfect dinner. Highly recommend! The pizza looked bubbly-yum as well!!", "author": "New England D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-27", "description": "My 5 friends and I came for dinner tonight. As we sat, we waited a while before a server even acknowledged us. We ordered a fried calamari and pizza appetizer. The calamari was tiny, and they even put fried zucchini in there to fill the plate. Pizza was ok, but not even close to being worth $15. For my meal, I ordered the special gnocchi with shrimp, scallops mussels and clams.  When it arrived, there were only baby shrimp, but no scallops or mussels. It tasted like something you buy in the frozen section of the supermarket. Not worth $25. Totally misleading. Later, we received the check and found that a 20% service charge was already added. The service was poor. The waiter did not come back once past taking our order. The manager did deduct my dish from the bill but offered to give us 50% off our bill THE NEXT TIME we come. Sorry, but this will be the first and last time I will be coming here. Hopefully this place takes the criticism and improves upon this experience for other future customers.", "author": "Matthew W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "So we started our evening at Gotham market and didn't want to eat at any of the places.  Then to city point and still felt like we wanted something else. Then we came here.  So glad we did.  We had a fantastic waiter, Ergin and had a great meal. Ergin had great food recommendations - listen to him!  The wine was good the food was yummy and the service excellent.  We will return.", "author": "Garen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "In Brooklyn for a work conference and wanted a good Italian meal before heading home.  We shared the Fettucini Bolahnese and it was AMAZING.  Comfort deliciousness ... fresh ingredients, homemade pasta , no processed food.", "author": "Martha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "I came here last night for dinner and the manager made our experience worth while. At first, I was skeptical because our server wasn't the best. However, Annie was super personable and attentive and even gave us great recommendations such as the tartufata which was to die for. The pizza is similar to when I was in Italy. I will be sure to come back here soon.", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Excellent service, delicious food \u0026 a cozy atmosphere ! I loveeeee the lasagna bologna! I tried multiple items on the menu and although it was all good that was my favorite item! I don't think you can go wrong here with any selection :)", "author": "Brittany W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "Industrial feel but classic Italian restaurant. The calamari was crispy and a HUGE portion. We enjoyed our pizza and general vibe of the restaurant. It's a little pricey for pizza and beer, but the happy hour (M-F 4-7) is half price, so we'll definitely be back for that!", "author": "Haven B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "Wow!  That sauce was incredible.   We ordered the calamari, which was great.\n\nThe margarita pizza is a must have... I'll come back soon.", "author": "Odalys G."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}