{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "I found this spot by accident! From now it's one of my favorite places! When I just came inside hostess met me with warm smile. You can feel that comfortable relaxing atmosphere inside! I decided to sit at the bar! Bartender Diana was very nice positive and attentive she recommended me to try one of the pasta! Food was delicious. Chef of restaurant is Italian so for sure will come back with friends and try their recommended wood fried pizza!!! Thank you for great service!", "author": "Alina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "Excellent food and service!!!! Rahel was our waitress and she was amazing. Very consistent and kind!! Food was great. Truffle ravioli to die for.", "author": "Shannon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "Best happy hour in downtown Brooklyn! The pizzas and apps are amazing and service can't be beat. Be sure to ask for Brian - he's awesome.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "We were in Brooklyn doing the tourist thing, including a nice visit walking over the Brooklyn Bridge. We were hungry for Italian afterward and I had Yelp'd this place, which had really good reviews.\n\nWe were looking for authentic Brooklyn pizza and so that's what we ordered. It was a thin-crust pizza with sausage. Very good!\n\nThey also provided a complementary basket of Italian bread with dipping oil. Really good bread. Fresh and delicious.\n\nI love dessert with my meals, and I'm never shy to order. It was a good way to end the meal (see attached pics).\n\nThe interior was warm and inviting, and the service was really fantastic and friendly. This is a nice theme. I think, often times, the perception is that New York service is rude and impersonal, but I continue to find examples to the contrary time and time again.\n\nThis was near where we stayed ... a block off of Flatbush Ave. and in the heart of downtown Brooklyn. I would strongly recommend stopping by. We had a great experience and really good pizza.", "author": "Greg B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "I tried Forno Rosso when visiting Brooklyn a year ago and was impressed. The lasagna was excellent. I've been back on subsequent trips and it has been just as good. The pasta is cooked to perfection and the wood fired pizzas are excellent as well. \nOne of the best Italian restaurants in NY with reasonable prices and good service. Definitely a go to when I am in the city. You will not be disappointed.", "author": "John F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Was looking for pizza after a few drinks and was recommended here by a bartender and this place did not disappoint.\n\nOne free cocktail if you check in on Yelp!\n\nGrabbed two pizzas and two bottles of wine to share.\n\nPizza: Piccante was my favorite \u0026 almost felt like ordering another one for the road\n\nAppetizer: Tried the octopus which was interesting but lovely.\n\nFinished off with some dessert on the house (thanks Fabio!) with their fried pizza dough and Nutella - I'm a Nutella fan and this was the best part of my night here.\n\nService was wonderful and attentive. Manager was pretty cool in swinging by chatting and making sure we were taken care of. :D\n\nDefinitely would recommend if you wanted to grab a drink or catch up with a few friends!", "author": "Vincent H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "I live in Manhattan and I'd come back here for their food. I'm not a foodie, but I have to write that their food is really delicious and has a refined way of flavors and presentations. Their kale salad with salmon are amazing. My coworker brought me here while we're we're working in the area. We ordered a group lunch to go when we returned for over 12 people. We have no photos to post because everyone (gluten free, lactose free, vegan, no food issues) ALL are their lunches before we could take pretty photos. The service is polite and genuine. Their staff is friendly and helpful. The restaurant is spacious and open. It's location is close and a little difficult with GPS ride shares, but that's not a biggie.\nThe brick oven pizza is sooo good - the crust is crispy but not rough and the sauce is delicious and enough. The desserts are homemade too and there were no leftovers.\nThank you for the great menu, service and prices. It's amenable to ordering online in advance too.", "author": "J H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-09", "description": "I'm really confused here. I absolutely adore the food and happy hour menu. First time I came here, service was amazing (as was the food). Should have worn fat pants for all the bruschetta, truffle pizza and wine. It was like I had an adopted Italian grandma who hung out with Nigella Lawson, and was like, \"Of course you can get chubby and sloppy drunk tonight!\" \nThen, however, comes the second visit with the man friend (who is familiar with the whole hot mess part). We were seated immediately, and I was thrilled to talk about my day with him. FOR TWENTY-FIVE MINUTES. I wanted to suggest that the restaurant use text messaging between the patrons and their waitstaff. For the entire evening, it felt as if we had to light a fire under someone's ass in order to get attention, and even then, we'd often had to do it twice. If there was any recalcitrance, I'd be more forgiving, but there wasn't. It's sad, because, this place could be a really great go-to for neighborhood couples like us, but I'm not sure if we're willing to put in the effort for a place that doesn't seem interested.", "author": "Shana S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-28", "description": "ALERT ALL CUSTOMERS! Do not order delivery pizza from here!!!!!!!!! DO NOT! \n\n\nI was delivered the wrong pizza and it was cold. I called the restaurant DIRECTLY and was told by a woman at the restaurant that a new pizza would be made free of charge. I get a call 1 hr later telling me that the new pizza is almost here. I wait 30 mins, no pizza. I call the restaurant again to check in. They tell me that I'm wrong, no pizza was re-ordered for me, and that it was the delivery driver's problem not theirs. I then explained the situation again, they interrupted me and said that is not what happened and that I actually was talking to the delivery person before (which is impossible because I called the business' number directly when this happened). WHAT NERVE\n\nNEVER EVER ORDER FROM THIS RESTAURANT! PIZZAS ARE COLD, OVER PRICED AND THE PEOPLE ARE RUDE TO THEIR CUSTOMERS!!!!!!!!!!!", "author": "Anna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Probably the best pizza, service and overall place I've been to. The brunch on the weekend (bottomess pizza _and_ prosecco/mimosa/bellini) is a must have. Pizzas are amazing and the staff is very responsive. Kinda hidden on the street, but very worth it, go there! Ask for Eduardo and Jeffrey they're amazing", "author": "Stéphane C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Great restaurant here in Brooklyn.  Comfortable decor and an excellent menu.  I had a brunch special - steak and eggs - and my wife had the orecchiette- both were delicious. We enjoyed it so much we bought a gift card as a gift for our nephew who lives in the area.", "author": "Anna E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "So happy this is within walking distance from my new apartment. It is a GEM! The reviews are all spot on - very cute place (bigger than I expected) with just really awesome food. I've been for both brunch and dinner. For brunch, we came in at around 1 on a Sunday and were able to sit right away. The complimentary bread is phenomenal - the oil specifically - it's so flavorful. I actually thought there were capers in the oil, but turns out it was lentils! My mom and I (who are HUGE eggplant parm fans), split that for an app. It was among the best we've ever had. If you have a great red sauce, it makes all the difference and Forno Rosso absolutely does. We then split a margherita pizza. On a good day, I could eat one all by myself (it's a larger personal size), but we split it and that worked perfectly. When I came for dinner I had the bolognese just to get a taste of the red sauce once again. For me, there was a bit too much meat and not enough pasta, but still good. My boyfriend got the shrimp tagliolini which was a serious highlight - definitely something I'd consider getting next time, which I hope is soon.", "author": "Ali C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-26", "description": "This place use to be ok but ever since they installed an obnoxious speaker outside their restaurant sending noise pollution out into the street I just can't bring myself to eat there anymore. Show some class and take that speaker down.", "author": "Yoav E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-31", "description": "I've dined here a few times and  what is strange about the dining experience here is I always leave with an odd feeling. The food here is consistently good which is why we've come back. The problem is every time we come here it feels like we are being rushed. \n\nDuring our last visit a week ago we arrived in time for happy hour. We ordered the oriechette pasta with eggplant and ricotta, meatballs, papardelle with mushrooms, and two glasses of wine. They also serve complimentary bread with the meal which is absolutely delicious. It comes with lentils to spread on it which tastes heavenly.  Before we were even finished with the bread less than 10 minutes after it was brought to us, a server asked us if she could take the bread basket, when there was still bread left that we wanted to have the rest of our meal. So I said we're not done and pointed to the bread that was left in the basket. She seemed highly confused. Our food came out in under 3 minutes which was also baffling. Yes, we were hungry but why was everything happening so fast? What was the rush? The restaurant wasn't even halfway filled.  The food is good and the price is right which is why we've come back.\n\nMy husband and I always take our time and order a few rounds of drinks, and even dessert when we go out to eat. A typical dining experience takes about 2 hours. We were in and out of this place in under an hour.  Wam bam thank you ma'am. \n\nI hope they fix this issue because it really makes for an unpleasant and uncomfortable dining experience.", "author": "shana l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "I must say the server was amazing extremely friendly very helpful in making my decision truffle pizza was really good for one of my favorites was veal tortellini. Definitely coming back here again", "author": "Allen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Visited on 4/29/18 and the food was superb!  Signature Tartufata pizza was spot on.  The pastas were so flavorful and some of the best pastas I've ever tasted; rivaling the best in the city.  PAPPARDELLE AI FUNGHI \u0026 FETTUCCINE BOLOGNESE were outstanding outstanding outstanding!!  There was a mix-up with our pasta and Sophia and the management were beyond courteous and understanding.  Classy people and classy establishment.  My family was very impressed with this secret place; it deserves way more than I can write in this review.  A real gem for this neighborhood. High ceilings...real swanky.  Try it out and you'll be thoroughly impressed", "author": "Wallace W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "What a treat, came here for lunch early September after all of the tourists had gone, not too crowded.  The place has a nice layout and the food was exceptional. Mozzarella with Prosciutto is a must have anti-pasta here, well seasoned and smokey.  I ordered the Siciliana pizza and it came to me with a slight char to the crust and perfect. Pricing isn't cheap, but the service and quality warrants it.", "author": "Dan T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-08", "description": "The food was more or less, but I called a manager with name JULIA to ask her about the menu but she ignored me because she preferred to be screaming with a employee. I found it very unprofessional on her part not to serve the client and treat the employee that way. A bad example of a manager.", "author": "Jonh R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "We ordered a fair number of items. The best app was the bruschetta. It was loaded with a bunch of tomatoes on a nice wedge of bread. The FRIED shishitto peppers not the best way to prepare these delicious peppers. The squid was def very tender but had me begging for salt and pepper. My daughters friend got her pasta dish to bring home. My daughter seemed to enjoy her dish orecchiette. The squid ink pasta was good. It came with four shrimp. My boy was happy with the dish. I got a custom pizza with Brussels and some prosciutto do Parma. Not even in the same lead as mirroring. It was ok but I prefer my pizza to be able to stand up on its own a bit. This pizza fell completely flat. It was tasty enough. I can not really see myself returning. They were nice but it is nyc and to many great places to eat.", "author": "Greg W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "OMG service positively the best.  Waiters make sure your glass is full and attentive to everything.  Order an appetizer because the fresh home cooked meal takes a bit of waiting.   Calamari scrumptious Fresh bread and garlic oil and capers tasty.  Lasagna and ribeye 2 thumbs up.  A definite must return when in Brooklyn", "author": "Vilma B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}