{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-27", "description": "We got the ravioli and it was really good! We got the fried dough with Nutella for dessert at it was huge and so worth it. Great atmosphere, but the servers were very slow and seemed to forget about us. Otherwise it'd be 5 stars! Would return.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-23", "description": "Tried this place because I didnt make a reservation in time for a sat night dinner and the reviews looked good. Generic looking, sort of like a chain restaurant. Bathroom was somewhat dirty.  We were both vegetarian and were told there were several options to choose from. The vegetarian options were marked so it was easy to choose. We chose the tartufata pizza and the ravioli with truffle oil. Pizza was ok. The neapolitan crust was excellent though. We didnt like the ravioli-too bland for our taste, so the waiter was sweet enough to replace it. We ordered the orechhiette ala norma  which would have been perfect if they hadn't undercooked the pasta. We had the Neapolitan baba for dessert which was also just ok. Overall was disappointed with the food after I read such good reviews. Probably has better meat options. \nThe service was great though, attentive and friendly.", "author": "Amruta T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "Their fettuccine bolognese is quite literally the best I've ever had anywhere in nyc.", "author": "Henry W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-29", "description": "I'd come for happy hour before a game anytime! $4 drafts are awesome, half off pizzas and pastas too. The thing is, the happy hour pasta portions are tiny - like two shrimpy shrimps tiny - but a good value nonetheless to sample their menu. The pizza is Neapolitan style so personally I can eat one by myself + bread and apps. Like others have said, pizza is soggy in the middle because it's so thin and I suspect the mozz they use has a higher water content than the shredded stuff. So prepare to have toppings/sauce slip and slide on your hands and plates. Not a problem for me since I'm a savage but others be warned. \n\nThe diablo isn't spicy at all which was disappointing but the Margherita was delicious. The bus boys and servers here are so sweet but I'm super perturbed by one that tried to take our calamari away when there were 5 rings left! Please understand the meal is not over until I lick the marinara bowl, swallow the lemon rind, and attempt to eat the plate!!", "author": "Nancy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "After working up an appetite walking up and down the Brooklyn bridge, we ended up at Forno Rosso since they are in walking distance.\n\nThe service was great. Our server was attentive and helpful with explaining the menu.  We ended up ordering the Montanara pizza and the truffle ravioli. The ravioli was amazing and the pizza was one of my favorites from our New York trip. \n\nI'd definitely recommend this place if you're in the area!", "author": "Sarah V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "This was such a great find in the downtown Brooklyn area. I was staying overnight in the area for my friend's wedding and stumbled upon this place.\n\nI was there for a late lunch around 4pm with my husband and we got a margherita pizza, truffle ravioli and the chicken entree. The complimentary bread was deliciously chewy with a lentil and olive oil dip which was delicious. The pizza dough was yummy, but I think the middle was too thin so it was hard to eat floppy pizza - the taste was good though. The chicken dish was ok, 2 nice sized thighs with truffle mashed potatoes, brussel sprouts and mushrooms. The star of this meal though was the truffle ravioli! The cream sauce is delicious and flavorful, speckled with truffle. You get about 12 pieces and it's scrumptious!\n\nWe were super full and content with the food! \n\nHowever, we couldn't help but notice the very distinct urine smell. We sat in the middle where the booths are on the opposite side of the bathrooms and we would get hit each time the door was open - which happened a lot because apparently there is an employees only room in there too. Another couple, what were leaving, also ended up making a comment on the way out. The staff was also very laid back, it was nice to have time to eat, but inconvenient to have to try hard to flag down anyone for a replacement napkin or something.\n\n\nHowever, the food was so good, that I suggested it for dinner to the bridal party and rolled back in with 5 others. I then got to sample the shrimp and avocado salad and the beet salad - both of which were good if you want salad. I additionally was able to check out the steak, the meatballs and the squid ink pasta. All were delicious! The pasta was cooked perfectly and the sauce was really good.\n\nNote: I didn't notice the smell if the bathroom during this dining experience and we were sitting in the same area, but at the day edge closer to the kitchen.\n\nI would recommend and come back! :)", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "I have been going to this restaurant for approximately two years now. Hostesses, waiters come and go. In fact the running joke with me and my coworkers is who will be the new staff today. The service has always been good and food is great. Today I came in and had the best service to date! The manager, Brian went above and beyond to make our stay exceptional! He was very accommodating with friendly, professional service! Our waitress, Melanie was on point! Give these guys raises! And for goodness sake, don't let them go!", "author": "Miguel Á."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "Ellie is the sweetest !!!! Great atmosphere great food! We enjoyed everything. Will definitely come back again soon! Did I mention Ellie is the sweetest ?!!!!", "author": "Austin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-15", "description": "The calamari is great y'all! Ellie is great! Great vibe, and great spot for a lil sodey pop between friends.", "author": "Benjamin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-15", "description": "Not sure if it was an \"off night\", but our pasta and salmon special dishes were terrible. The cheese plate was just cut up pieces of parmesan and cheddar. Bland, flavorless, and not great service.  The space itself is nice and the pizza looked good, but skip anything else.", "author": "Petunia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-14", "description": "Where to begin...oddly located on the corner of Gold street, but don't let the appearances fool you, it's far from it.  A very intimate, curated, Italian dining experience. I had the short ribs, and my friend had the steak. The short ribs MELTED in my mouth! My sever, Thereza, was SO attentive, and made sure I had everything I needed to enjoy my experience. Drinks were satisfying, and the music was a nice mix of odd and new tip 40. 5 out of 5 would do again!", "author": "Ayodele D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "BE CAREFUL WITH THIS RESTAURANT. They stole money from my friends and me. Please look at my 2 photos as proof. \n\nSo my friend and I went to this restaurant because we had a long day at school. We go to this restaurant which is so freaking expensive. One shot of alcohol was $10. and it wasn't even that good. It was probably 2 fluid ounce, or maybe 60 mL and it definitely was not worth the high price of $10..... \n\nThen the appetizer was $17, which is just garbage since it was so bad too. The bread was too stale and the waiter took forever to give it to us. \n\nThere was another waitress who gave us bread and said it was unlimited refills. But the current waiter tried to charge us for the refills. \n\nAnyway the waiter was pretty standoffish, so whatever. He ruined the dining experience for us with his rude snide remarks and his sleazy attempts to steal more money from my friends and me. \n\nTHEN IT GETS WORSE. WHEN WE ARE PAYING WITH A CARD, I LEAVE TIPS IN CASH. On the bottom of the credit card receipt, my friend notes that the total CREDIT was $29.40, which is his appetizer and drinks. I leave the tips in cash. \n\nBut then the next day, we find out the waiter stole $3 as tips from our CARDS!!!! This is messed up. We already left a decent tip at 20% in cash already, and yet this waiter stole more money from us.......\n\nThis wasn't even a mistake. This was truly deliberate as my friends had sign off their signatures and written that the total amount in credit card debt would be $29.40. We explicitly wrote that in the total section of the receipt. Yet the waiter/restaurant has the audacity to charge us more in tips, and think we wouldn't find out?", "author": "Cal C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-08", "description": "I only did four stars because of the ambiance.  It was nothing special/unique.  I had the orata...it was delish and my husband had Bolognese, I thought it was just ok.  Probably better off getting something else.  A basic salad. Tables around us had yummy looking food.  If i lived here i would go back, for sure to try some different things before i made my final decision about the place.", "author": "Tracey H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-08", "description": "Everything was delicious, I d definitely come back. My only complaint would be my drink (which was a cocktail with limoncello) was acid, it was like drinking lemon juice without any sugar on it, didn't taste good, but food was on point!", "author": "Orlanda F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-25", "description": "Easy to get a table on a week day night- the place is surprisingly big once you enter. \n\nOnly around 5 other parties when we arrived - we were promptly seated and given water but it took about 10 minutes for anyone to take our drink order or drop bread off. We were ready to order our meals by the time the waiter stopped by. \n\nI had the Forno pizza - which was supposed to have sauce and a ricotta stuffed crust. Neither of which it had...... the overall flavor was ok but nothing special. \n\nMy dining companion went with the linguine bolognese. This was better than the pizza and had good size pieces of meat you could clearly see.\n\nAfter we were finished with our meal and plates taken away and drink glasses empty it took about another 15 minutes for someone to drop the check. It was almost comical since the place was basically empty. After trying to wave down anyone we finally grabbed and check and headed home!\n\n\nOverall for the price you would be better off trying a more homemade or traditional Italian spot, but if you have a larger group this would be a decent place to get a table!", "author": "Elizabeth W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-03", "description": "Looking forward to a nice Italian meal, we decided to check out Forno Rosso.  The interior had a nice charm and we were greeted promptly by our energetic server.   I ordered a glass of the house red, but was told that it was only served by the glass during happy hour.  So I chose a different red.  Big mistake. I should have had a beer.  The red I choose was about as good as grape juice. \n\nThat's ok though. We ordered meatballs as an appetizer. They arrived promptly with lots of red sauce. They were actually quite good. \n\nThen the long wait began.  I should have timed.  It was at least 30 minutes maybe more. I felt like I was on an episode of Hells Kitchen and was about ready to leave. In hindsight I should have.  The chicken dish I ordered was overcooked and flavorless, unlike the brussel sprouts which were undercooked. \n\nMaybe it was just an off night, this place has so many good reviews.  But I'm just a visitor from out of town so I won't have an opportunity to find out.", "author": "Ed J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "Came here this past summer for a birthday dinner and had an amazing time. The service was impeccable. The manager or owner (don't remember which one) even came by and chatted with us for a bit. It always makes it personal when that happens.\n\nI'm very indecisive and didn't know what I wanted, so I asked our server for a suggestion and she recommended the veal tortellini. It was very flavorful and the sauce was amazing. If you don't like veal or aren't family with it, i would stay away because the veal was not subtle. \n\nMy boyfriend got a pizza. Can't remember the kind but i believe it was the Speck.  He enjoyed it a lot and literally barely let me taste it.", "author": "Mia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "Ellie, our server, was fabulous!!!! Ask to sit in her section!!! She gave great recommendations \u0026 took perfect care of us!!!!", "author": "Laura L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-31", "description": "I love Forno Rosso. I've been here a few times and every time the food, drinks and service are great. Lately I've been coming mostly for happy hour (Mon-Fri until 7). This is one of the few places between downtown Brooklyn and Dumbo to grab a drink or dinner. \n\nOn my last visit my expectations we're exceeded by a chance run in. I'd come in for a cocktail and the bartender and managers were selecting new cocktails for the menu. The indulged me and allowed me to try the cocktails and review. The drinks were delicious and the bartender and manager (Julie) were so welcoming and nice! \n\nI hope to make this my go to neighborhood spot!", "author": "Kayla M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "I was in town for a conference and found this place on Yelp.  It had good reviews so I decided to give it a shot with one of my colleagues, and boy am I glad I did! \n\nThe atmosphere is very nice, low light, good ambience.  The food was incredible!  Being a first timer, our server, Ellie made great recommendations, and they were delicious!  She was very attentive all night despite the restaurant being busy!  A great experience--highly recommended!", "author": "Michael M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}