{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Amazing restaurant. We have been dining at this restaurant since it opened and it has become our regular weekly date night place when in Brooklyn.\nThe food is delicious, especially the burrata, bolognese and deep fried calzone. Don't forget the mojito panna cotta and tiramisu. \nGiuseppe is the most welcoming kind owner/manager you could imagine. Wonderful service.", "author": "Aysha T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "The food here is excellent. The ravioli was al dente and the pizza perfectly done.  I would definitely come back!", "author": "Zachary R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "This place was very close to the hotel and we loved it!!  The food was excellent and the service matched. They have a wonderful happy hour that includes not only appies and drinks but also some selected meals. They were all very good. Enjoy!!!", "author": "Grant F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Food is delicious. Cocktails are amazing. Forno Rosso is my go to place. Highly recommend!", "author": "İrem C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "All dishes are amazing!!! We tried three different pasta dishes they are all great! Desert is great. Service very nice. Perfect.", "author": "Wangshu S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "This place is amazing! Leigh, the bartender is everything you want in a server. The calamari is crisp and fresh. The drinks are quick and perfect. A+", "author": "Tim H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "THE BEST PIZZA IVE HAD IN MY LIFE!!!\nGreat service\nAngelic Decor\n72inc HD television!!!! it's the spot you can take everyone from baby mama to boss!", "author": "Charlie D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-08", "description": "food poisoning delivered. Stomach cramps, vomiting, diarrhea, fever, sweating, the shakes. All for hours! Hours. Almost went to emergency room.", "author": "B D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Myself \u0026 a Senior/Colleague friend, opted - finally to take a well deserved \"Friday Lunch\" - we gave this place a try. Our Waiter - \"Handsome Italian Chap\" was awesome; Very friendly and knowledgeable. The Vegetable Soup was damn excellent . . . . . Very nice bread \u0026 this really tasty olive oil to dip it in. We had the Pizza. Service was excellent! - They always kept your water glass filled to the top with great \"Brooklyn Water\". - I had the \"Personal Pizza\" - They have this really awesome \"Wood Fired\" Stove - 2 Thumbs Up. Plenty of \"Top Shelf\" Beers on Tap, not that we tried any. I would definitely come back to this place.", "author": "Louis R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Really enjoyed our dinner here! The staff was very timely and attentive. The food was outstanding and the drinks too! Highly recommend. Must try the new salmon tartar. Very delicious.", "author": "Mark B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "This place became my number one Italian restaurant. I think I have tried every dish that was on their menu. I absolutely loved everything from top to the bottom. Service is super important for me and restaurant stuff didn't get me disappointed. It's a rare case, where you can enjoy food and service at the same time. From now on, I go to the restaurant at least a couple of times a week, considering the fact that I don't live around the corner. I guess, I should move closer to eat there more often.", "author": "Noel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "Forno Rosso is perhaps the best addition to the neighborhood to date. The ambiance is nice--pretty large yet cozy and warm--and the staff is super friendly and accommodating (especially for families although it doesn't come off as a \"kids\" restaurant, which even as a mom of a 3 year old I find to be a good thing). All of which makes sense when you meet the chef Giuseppe, who is just about the warmest human being you will ever meet. \n\nGiuseppe also happens to be a wonderful, true Italian chef, and all the dishes on the menu demonstrate that Italian approach to food--simple and delicious, all made with fresh ingredients. We have explored quite a bit of the menu--calamari, salads, pasta, pizza, fish and specials--and I've yet to come across anything I wouldn't recommend or order again myself. We go pretty much twice a month, at least!", "author": "Whitney R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "My boyfriend and I decided to celebrate our anniversary here and were happy with our choice. We had the bruschetta and the meatballs to start with a wine white. I got the black ink tagliolini with brandy sauce / shrimp and he got the ravioli tartufo (truffle cream sauce). Both were on the heavy side but still very good. Our absolute favorite was the deep fried sweet pizza dough with Nutella and powdered sugar (coccole con Nutella), definitely recommend! Unfortunately, the creme brûlée was not at all good and way too egg-y. The best part was definitely the drinks though! Highly recommend their espresso with baileys drink as well as the White Russian. So strong but so good!", "author": "Jihae M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "One of the best spots in downtown BK for pizza or pasta! Favorites include fettuccine bolognese, and the \"Rosa\" make your own pizza. For a pasta dish, I highly recommend swapping out their traditional pastas for gluten free pasta (which does NOT cost extra, but tastes great just the same!) I also get a side of broccoli rabe and mix that in with my bolognese and it is a-mazing. \n\nObviously can't go wrong with the make your own pizza. Its basically a personal pie cut in 4ths but you can easily get two meals out if it if you are not super duper hungry. Be sure to ask for mozzarella (or another kind of cheese) because it is not included on the pie unless you ask! The pizza comes out lightning fast and on a few occasions, the dough was a little soggy in the middle of the pie (could have used some more time in their wood-burning oven.) So beware if you love your crust crispy, ask for well done.\n\nI come here a lot to grab a drink and bite after work, on my way home. Always sit at the bar and have a great time! Also LOVE the olive oil dip that comes with bread; the olive oil is loaded with lentils and it is a great starter for your meal. Be sure to ask for some if they don't bring it out right away :)", "author": "LeAnn L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Just returned from a Brooklyn trip, and of course my daughter and I had dinner here, again. Still amazing all around, and already looking forward to our next visit.  We sampled additional Pasta dishes (a very full flavored black ink pasta - and a Traditional red sauce non meat pasta dish my 18 yr old daughter loved and of which she refused to share a bite) \n\nGreat service! Wonderful menu, love the casual warm ambiance, and of course the food is absolutely top notch.", "author": "Shannon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "A truly awesome pizza place. Modest but modern, great service, top drawer food. I will visit every time I am in Brooklyn. Do not miss it!\n\nOk, I'm becoming a tragic for this place. Back for brunch before I leave Brooklyn. Started with a soup of the day which genuinely reminded me of the best homemade chicken soups I've ever had. Tasty, unpretentious, simple.", "author": "Vinny D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "This place was absolutely amazing. The food was phenomenal. I ordered a Diavola Pizza and it was to par with the best restaurants in NYC! The presentation was absolutely amazing and we had the best person serving us the food! Amanda made a really good impression and gave the best service possible! Im really happy with the experience and the entire staff is super friendly! Great bar service too!", "author": "Sohrab B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Excellent service, good food. Exactly what youd expect. Nice sized portions, would eat here again", "author": "Sim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "We ordered takeout from here via an app and had it delivered to our hotel room so I can't speak to the restaurant or the service but the food was delicious! I had the pork shank and the meat was tender and flavorful and it came in a spicy tomato sauce loaded with peppers and onions. The mashed potatoes under were creamy and even though it was takeout the food was still hot when it arrived. We also ordered two pizzas which were good but didn't travel as well. These appear to be coal-fired pizza and either being in a box or the winter weather meant they were soft and coldish instead of hot and crispy by the time they got to us. If I ever make it back to NYC I will have to dine in.", "author": "Elita K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-02", "description": "3.5 if I could. I've been here about seven or eight times now, it's located on my block- so even if I didn't like it, I'd probably be back. But, it's good. The menu is a little boring sometimes, but I feel like it has all the basics of what you would need. The food is solid- not spectacular but definitely good. The lasagna is my go to- although last time it was disappointing. The fried calzone type pizza is excellent. The \"no sauce\" pizzas are as bland and boring as they sound- I don't need sauce but I need something. The fried street food app was also disappointing as was the salumi app- didn't love the mix and there was a crumb of cheese and about 3 olives. Pastas are good.\n\nHonestly the worst thing about this place are the hostesses at night who insist that you can't sit at a 4 top- When the resto is Empty!!!! We end up spending $100+ for two ppl so we can generally get the waiters to move us- but still.\n\nI ordered takeout from here and I was disappointed by that hence the 3.5 stars- the portions were small and for 2 people it came out to $80, 2 entrees an app and a pizza to share and we were still hungry! Although they gave us these tiny cups of panna cotta with the take out and it was delicious.", "author": "Bethany W."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}