{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "Excellent service and food! Ellie was amazing and food was on point. I would definitely come back here again. Thank you Ellie for making my night. It took me a while to finally find a good restaurant in Brooklyn after moving here from the bay area. Thank you from my bottom of my heart.", "author": "Ron J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-05", "description": "Not what is advertised. Let me explain. I love pizza. My wife loves pizza. My family loves pizza. Been to Naples, Capri, amafi coast, Trenton, new haven, Regina's to Tacconellis, and+++. \n\nSeveral in NYC, many in fact. And Brooklyn. From Mr. D's to Lombardi to Roberto's. \n\nOur pizza didn't look like the images in yelp. Didn't look like the little pizza paper they hand you w your bill. And definitely NOT the \"wood\" fired ZA expected. Dough was less than meh. \n\nCheese was sub-par, flour sub-par, rise sub-par (old dough? Bad yeast? No yeast? It requires GOOD yeast.) chew sub-par, sauce yuck!, taste sub-par. \n\nThis was bar-pizza. No more. \n\nSomething changed is my opinion. A lot for that matter. And their oven can do such wonders if given the chance.", "author": "Gerald F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-18", "description": "The lasagna al ragu is delicious!!!  So was the peach old fashioned cocktail.  Great ambiance and atmosphere.  Ellie, our server was also great!", "author": "Diamaris W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "This place surprised me. I wasn't expecting much but wow, this is a solid pizza joint. I think the true star of this place is how they make their dough. The dough is light, airy, chewy and crunchy all at the same time. I got a couple of pies to share. I don't think you can go wrong with any since they all use the same dough. As for the sauce and other toppings, can't say it was as memorable as the dough/crust. However, if I'm ever around the area, I'll definitely be back.", "author": "Mary F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "The atmosphere and the kale Caesar  salad made this go from 4 to 5..  Strong work Forno .  Our server, Brian, was very attentive to our needs.  We will be back ! \n\nPs- Monday's = Margaritas!!!( Delish for an Italian place)", "author": "Jacob H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-13", "description": "Ordered delivery. The truffle ravioli is amazing. The cheese pizza is great as well. Turned into one of my favorites through postmate delivery.", "author": "Milkessa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "I couldn't have asked for a better Valentine's D dinner! I took my time to find a perfect, romantic delicious restaurant that doesn't have a pre-fix menu, where they charge you $75 for spaghetti and meatballs. This place was beyond my expectations! \n\nI made a reservation on Yelp, two hours before our arrival. We got seated right away. The place looks absolutely breathtaking from the outside and from the inside. I loved the high ceiling, pictures on the wall and throwback music playing in the background. The table set up was just perfect for our night, decorated with a candle and a small red rose. The tables were kind of small, but you had enough space.\n\nThey started us off with an appetizer- bread with lentils! I have to say, I was a little bit shocked when I saw the lentils, but it tasted great on the bread. We were debating whether to get brochettes or the charcuterie platter. We went for the charcuterie platter and it was great. It came with four different kinds of meat and four different kinds of cheese. The pita bread was warm with rosemary on top, absolutely amazing. The only thing it was missing was some kind of small simple salad or a dressing.\n\nAs our main corses, we decided to try some pasta. I had linguini bolognese and my boyfriend had pasta with mushrooms. His pasta was too oily for me personally, but he really enjoyed it. However, my pasta was out of this world. It had the right amount of meat, pasta was cooked to perfection, and it was seasoned right. Very, very tasty. We were too full for a dessert, but I was eyeing tables around us who tried the chocolate mousse cake and it looked amazing! \n\nWe had a nice, simple romantic dinner, that was very tasty and intimate. I highly recommend this place. Our bill was little over $60! The service was ok, they gave us enough time to read the whole menu and discuss what we want to get. Our server wasn't always in our face, being overly friendly and excited about working, if you know what I mean. \n\nWe did take a car to get there, but this place is in Downtown Brooklyn and there's a lot of trains within a 5 minute walk.", "author": "Meggie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-20", "description": "Walked in on a Saturday night, the vibe is not of the typical New York restaurant. It's a combination of sports bar and Italian restaurant; the ceiling is very high. The mushroom and truffle oil pizza tastes good but the middle of the pie is too soggy. We also ordered the rib eye steak, which is a big disappointment. It came as a trunk piece and not cut into pieces like most Italian places or steakhouses do. The meat was a bad cut as 1/3 of it was totally inedible and super hard to cut even with a steak knife. \n\nService was half-hearted but okay. I'd recommend going other places in this area.", "author": "Simon T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "Saw this place on Yelp and it exceeded expectations! Spacious, unique and true Italian restaurant. Amazing selection of pasta - even a build you own pasta section. The pizza was perfectly crisp but not burnt from the fire oven. Dessert selection was pretty great too. I highly recommend the chocolate mousse. Only call out would be that the truffle pasta is a bit too rich. It was truly amazing but a bit overwhelming so it may be better to share.", "author": "Tara R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "This is one of my new favorite spots to go to now. Surprisingly enough me and my best friend were sat in the same table multiple times and we had the same waiter. We LOVE it. The food is amazing and the atmosphere is just perfect. The amazing waiter Carlos always greets us with such warmth and his customer service skills are top notch. We can't brag enough about the food. Everything is so delicious even the dessert oh my goodness. I can go on but seriously visit this place. I highly recommend it.", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "First restaurant in Brooklyn that I tried , and LET ME TELL YOU ! It was to DIE FOR !!!! I accidentally came across this restaurant while looking for another place . \n\nAt first glance , it seemed like a pricey quiet spot . Relaxed and cosy . Just enough lighting . \n\nThey seated us right in front of the big window that showcases the chefs doing what they do best , along with the big burning pizza oven . \n\nOnce I saw guac toast and Truffle Ravioli , my mind was set . Ordered some drinky drink and I was ready ! \n\nI can't even make this up , I dream of this place . The food was heavenly . Those damn little lento's in the oil !!!! You know I had to take some home lol . The Guac was by far the best I ever had . And I am a BIG avocado fan . The ravioli was beyond what I expected . That had to be what sex tastes like . Everything , and I mean everything , was flawless . Everyone with me was just as in love with their dishes .\n\nI will definitely be coming back ; need to catch those bottomless mimosas ! That first experience blew my mind . You won't be disappointed . \n\nSide Note : I didn't try the pizza , however I did see a lot of people swing by and grab a pie . Will be trying that as well :)", "author": "Domino H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-13", "description": "Great food and wonderful atmosphere. We shared the brussels sprouts, calamari, and orecchiette with eggplant and enjoyed all of them. We were pleasantly surprised that the prices weren't astronomical for the quality/type of food and locale. Ellie made great wine recommendations and took good care of us all evening. We would definitely return.", "author": "Erica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "I've been here twice: once for their Bottomless Pizza brunch \u0026 the 2nd time being for dinner. In both occasions the staff went out of their way to make me and my guests feel comfortable \u0026 happy. Service was simply on point. The interior is beautiful \u0026 spacious with high ceilings and a beautiful layout. There are many dishes here that are simply delicious but let's highlight a few I thought were top notch: In the pizza category we have the Piccante pizza: a Neapolitan pie with smoked mozzarella, Italian salami, red onions, jalapeño sauce \u0026 tomato sauce \u0026 it is outstanding! One of the tastiest Neapolitan pizzas I've ever had in New York City. I can definitely recommend all of the pizzas here but this one will totally steal your heard especially if you love spicy food last like I do. Their shishito peppers with pine nuts, parmegiano, basil \u0026 mint is an amazing starter. Another great dish is their salmon fillet with asparagus \u0026 lemon caper sauce. It was aces \u0026 is packed with flavor. Coming in strong is their Shrimp Tagliolini: squid ink tagliolini, sautéed shrimp \u0026 brandy sauce which is absolutely delicious. This dish is not to be missed. I serious mean that. I recommend this place for anyone looking for a delicious meal in downtown Brooklyn (that makes for a great date spot as well).", "author": "Em P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "Would give 10 stars if I could. Large menu. Came with group of 6 we had almost everything on the menu- our winners were Carlos the server, the Amalfi breeze was a winner,  the grilled octopus was brilliant. And main fav was ravioli in truffle cream. Absolutely great experience.  The tiramisu was perfect.  Great experience.  Bring a friend, bring a date. Bring your mom, dress up,  dress down, come alone, whatever you do,  just come and don't deprive yourself of one of the best dinning experiences in Brooklyn.", "author": "Shanon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-30", "description": "Stopped by for lunch and was in a rush,  service was quick yet friendly. Got the Parma panini and must say next time I'm in the area I'll be sure to swing by and have another!  Good times.", "author": "Marckenson C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "After living in the neighborhood for over 5 years now, I can honestly say this is one of the best restaurants in Downtown Brooklyn. The wine list has significantly improved over the past 2 years and the food is authentic italian cuisine that's affordable. I would certainly recommend this this spot to anyone looking to have a nice sit down dinner, a drink at the bar, or casual lunch. I almost forgot to mention, they have a great happy menu!", "author": "Lace D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "We were looking for a restaurant to eat in Brooklyn that was walking distance from the train station. Italian food is my least favorite type of food to eat, but I really enjoyed my squid ink pasta here. \n\nThe menu here is pretty small so if you're  a picky eater it might be hard to find something you enjoy eating . We settled on truffle ravioli, squid ink pasta, pizza, and the burrata salad. \n\nThe burrata was so soft and delectable. We all really enjoyed this dish. My squid ink pasta had a delicious seafood taste and a very nice creamy tomato sauce. The truffle ravioli was too salty after a few bites, it did have great flavor though.  The pizza was also a bit salty.  \n\n4 stars because I really loved the squid ink pasta.", "author": "Tiffany Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "This is my favorite Italian restaurant in Brooklyn! Great place to come for dinner or just to hang with friends at the bar. Food is delicious (ravioli with truffle sauce is one of my favorites), servers are very attentive and polite. They also have happy hour for both drinks and food which is great and change daily specials, so there is always something new to try.", "author": "Yulia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "Good spot in downtown Brooklyn - been here twice with friends over the course of 3 months. Friendly staff and service. Brick oven pizza was good - personal size (6 slices) Margherita pizza was good the first time, second time was a bit oily (could see the oil on top of the pizza). Regina Margherita (w/ buffalo mozz) was good.\n\nMain dishes aren't that big, so if sharing, you may want to order a couple. Fettuccine Bolognese - was decent, Mushroom papparedelle - good and would recommend, Shrimp taglioni - a bit al dente (a bit disappointed). Salmon was good. \n\nDessert: only tried the Coccole con nutella (deep fried sweet mini dough, nutella, powdered sugar) - good but can't eat too much of it.\n\nDouble shot of Johnny Walker Tennessee Honey from a new bottle was great! :)", "author": "Win L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Stopped in for a solo Sunday afternoon bite on my way out exploring Brooklyn (2pm-ish).  Ordered the Avocado Gambretti salad - which had small grilled shrimp, avocado, cherry tomatoes, arugula and red onion. There were just a few tables occupied - given the midday timeframe - and the service was quick and friendly. Thought the salad was solid - good amount of shrimp, nice avocado, and a creamy light dressing. \nThere was a small crowd at the bar watching sports and drinking mimosas. Looked like a fun place to pass a Sunday afternoon.\nDidn't have the pizza, but it looked really tasty (thin crispy and wood fired). There was a brunch special \"all you can eat pizza\" and \"all you can drink prosecco.\" I may come back for that!", "author": "Lori H."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}