{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-15", "description": "The service here is absolutely terrible!  Waited patiently to pick up my order while two waitresses were sitting at the table near the register having a conversation.  No one wanted to help!  Good pizza though!", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "I am not a native, but I can certainly understand why so many locals come here, even in the heart of a more touristy area.\n\nThis is my 4th time coming here across 3 visits to Brooklyn- I have gotten a different entree each time, and the one thing they have in common is that they were EXCELLENT.\n\nThe pasta is always fresh, comes out very quickly, and the service is excellent, too.\n\nYou can't go wrong with Forno Rosso!", "author": "Tom M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "This is definitely a great spot to sit down, order some appetizers, some sides, and a main dish and enjoy the barrage of flavorful dishes. The music playing in the background was a great mix of classic rock the night we sat down to eat, making the experience that much more enjoyable.", "author": "Erik T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-02", "description": "They canceled my grubhub order an HOUR after it was placed. Their reasoning was \"address is out of range\", which can't be true because you set your delivery limits in your grubhub settings. Unprofessional behavior and terrible customer service from Fabio, the manager. Pay closer attention next time, so hangry folks like me don't lash out on your employees who are stuck picking up the phone.", "author": "April L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Went for happy hour with my cousin. Was pleasantly surprised by the quality of the food and incredible service. The happy hour menu is small but adequate and extremely delicious. We started with the bruschetta (fresh and tasty), I had the bolognese and my cousin had the ravioli (both full of flavor). We finished with tiramisu (wonderful and rich).  Dinner was so great I took home an order of shrimp tagliolini and calamari for my bf. These dishes were also superb (the bf devoured his meal and I had a few delish forkfuls). I will be returning to try the pizza soon. 5 star experience!", "author": "Heidi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "The food here is amazing, good service, not a long wait to get your food. Start is friendly and tentative. If you're really really hungry, get more than one plate", "author": "Noel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Cozy setting for good hearty food. The red wine was tasty and server was consiste t with checking in and refilling our glasses. Had three different pasta dishes, and each was delicious in its own way. Pasta had a good quality to it and the ingredients were fresh. Barrata and tomato plate was delish and the limoncello = 100.", "author": "Tashay G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-25", "description": "Looking at the good reviews, I wanted to try this place. First,I came a little early before the opening time and explained Im meeting up people here and if I could use the restroom and the answer was no, which I can understand that they are not open yet, but I mean there could be some kind of flexibility. \nService: half star\nService: Rushing the whole time, very pushy with drinks, cleaning up all of  the utensils when there is still food and eating. Felt very uncomfortable and unpleasant, that I do not know what to review for the food. Came with 5 people at 11:30 and was out by 12:30.", "author": "Sara K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-27", "description": "I was so excited to try this place out as it had great reviews and I was super hungry after a long day out in the city. However, I was extremely disappointed. The service, well, lack of service was truly inexcusable. My party and I had to wait over 30 minutes just to place our order and then nearly another 45 minutes until the food was served to us. In the mean time we were given 3 slices of bread for a party of 6 that was visibly hungry. \nThe waiter came to check on us only once \u0026 when we voiced our feelings about the service he responded in a rude manner and pushed his false ideal of satisfaction on us. \nThe food itself was fine but most definitely not worth the wait or lack of service. \nI won't be returning or recommending.", "author": "Cara L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-06", "description": "I've ordered take out from Forno Rosso twice and both times thought the pizza, pasta and salads were just okay but not great or special in any way. \n\nThe pizza has been somewhat soggy and the toppings are always very sparse, including the tomato sauce and cheese! \n\nI've felt the same about the salads, which are mostly comprised of plain arugula or shaved brussels sprouts with almost no other ingredients. Friends we were having dinner with did not enjoy the pasta either and said the veal tortellini did not taste of veal at all.\n\nIn other words, I would order from here going forward as a last resort but there are many better options in the neighborhood.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "This place is legit Italian, amazing pizza \u0026 service!\n\nWood fire brick oven pizza.\n\nSunday afternoon 9/11 was pretty empty but very welcoming and clean.\n\nPizza came out quick and was gone even quicker!", "author": "Annette F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "Just had lunch there, the Pappardelle al Funghi was good. If it were a little saltier it would've been perfect but I get it just add some salt everyone isn't a salt lover. The staff is very attentive and helpful. My waitress was a young lady named Krystal she was very patient with us and our indecisiveness. I've also had the paninis here on another occasion and they are very good especially the Italian sausage one. The drinks are strong but I'm not complaining!!", "author": "Kia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "I had a really good meal here. The service was good and the food was just outstanding. I ordered the Paella Diablo and it was truly amazing. This was a lazy afternoon lunch with business associates on a cold day and they let us linger and talk shop and figure some things out rather than hustle us out, which was really appreciated. It's an easy walk from Newark Penn Station if you're coming in by train.", "author": "Tad D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "It was amazing food great staff. I'm definitely eating here again when I visit. The shrimp squid pasta was so good. The peach old fashion is a must try. Even ordered desert.", "author": "Marissa Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "My sister \u0026 I are in town on a birthday vacation \u0026 had to stop at our favorite Italian restaurant. We've eaten here before and every time we come in from Los Angeles we are sure to stop by and show some love. Our server, Clarissa was absolutely outstanding \u0026 we were able to converse with her not only about dinner but also casually. She deserves a 5 star award all on her own. The service was amazing, we always had water (thank you, sir) and we had our food brought out promptly. Thank you Forno Rosso for helping my sister \u0026 I celebrate our birthdays another year !!! We love you! \nXoxo, \nYour Los Angeles girls", "author": "Jes R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "This is a great restaurant, Eduardo and Carlo are fine waiters. Really prompt service. And superb pasta. Thin handmade fresh pasta,  we came three times on a recent trip because the food was so good. Casual but nice and good atmosphere.  Manager checked on us, too. Nice bar service.", "author": "Robin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-20", "description": "UPDATED: Since I wrote the review below, the owner assured me it would be handled appropriately. Glad to see that the establishment won't tolerate such behavior so I'm updating my review. \n\nMy parents had lunch here one day while I went to work and the server thought my Asian parents were dumb tourists and tried to rip them off. He tried to get more money by sneaking in 18% tip on the itemized receipt and not saying that on the receipt you sign. But they are not dumb, rather sharp actually. They noticed the total was too high and was looking through itemized receipt. The server saw them looking so he came apologizing for charging them the tip and tried to make nice with them asking about their trip. Yes my parents are not from here and they are too proud to fight for these things, but I WILL. I don't think he deserved any", "author": "Eugina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "Excellent Service and Food! I arrived during Happy Hour and had a great glass of their House Red and Fettuccine Bolognese. I finished my meal with a piece of tiramisu. It was a perfect meal and I didn't walk away feeling that I overate. Very tasty! The hostess and wait staff were great and attentive. I will definitely eat here again.", "author": "Antoinette M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "My company decided to come here on a Friday night to have our regular happy hour dinner. We ordered a lot of food and drinks, totaling $786 with taxes and 20% tip. The food and the service are good. We had a very pleasant company team dinner. \n\nTheir food is authentic Italian. All of us love their Italian chicken wings and Shrimp Tagonlini. Wings taste crispy and well-seasoned (we tried to order more, but wings were sold out...I definitely want to come back for wings). Shrimp Tagonlini is creamy. We ordered 4 of them. Calamari is always perfect with beers and wines. Drinks are no jokes. We also ordered one pizza, it was a little soggy, but still taste good. Food here is very special and delicious.\n\nThe store manager is a great problem solver. He contacted me immediately after I called him about my bill. He helped out.", "author": "Chloe M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-12", "description": "Can't give zero stars, so I'm forced to give one. Ordered a pizza on Seamless. It arrived late, and cold. When I called Forno Rosso to state that I do not think it reasonable to pay $30 for a cold pizza, the manager blamed it on Seamless and would not give me a refund. Also refused to convey my complaint to the owner. Owner, are you reading this? You should know that your staff would rather you lose customers than take accountability for your product. We will be going to Sottocasa from now on.", "author": "Suzanne S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}