{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "Great food. Great service. Authentic as can be (as far as I'm concerned, I've been to Italy a few times). Great decor. Prices are very reasonable considering how many restaurants are getting away with overpricing their food for yuppies and hipsters. Only thing I didn't enjoy was the owner chewing out his hostess during a dinner service. He wasn't yelling or cursing, but it was obvious he was scolding her. I also believe all some of the other owners were sitting at a table discussing business without being very discreet. It made me and my date a little uncomfortable.", "author": "Leo P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "This is my first-ever Yelp review but I had to tell how much we loved this place. I've been traveling to Italy for 36 years and lived there years ago. I'm always in the hunt for a great, authentic, wood-fired pizza and this is by far the best I've found in the US, and it even stacks up well against most places in the mother country. \n\nIt's wood-fired so the flavor is tremendous, the crust was like fine Italian or French bread, lightly salted with sea salt on the bottom, served in a pie tin like the real deal (if it's a by-the-slice pizza, forget-about-it!). The sauce, cheese and toppings were all fresh and tasted more like Italian than American. So you may not like it if you regularly eat Papa John's or Dominos.\n\nWe met Domenico and Lucca who are from Napoli and Puglia. It's getting harder to find real Italians who cook the food in these places...They were super simpatici and the place is very nice as well. \n\nI had the Capricciosa, my wife had the Calzone Rosso, my daughter had the Margherita and my son the pasta Bolognese. Everything was superb. If you want pizza that tastes like the best of what you find in Italy, this is it! \n\nWe will definitely be back!!", "author": "Elliott N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "So happy to have this brand new neighborhood addition! The pizza is thin crust and yummy, the other dishes equally delightful, but the main star of my dinner was the gnocchi - never had gnocchi this fresh and delicious. I will definitely become a regular!", "author": "Blaga S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-06", "description": "The pizza was burnt in spots and the margherita came with one very sad leaf of basil. Crust and toppings were also very unevenly spread, like the person rolling the pizza had very little experience doing so. Weirdly, the dough was also unevenly salted in some spots on the bottom (probably a result of spilled salt that wasn't cleaned up before rolling the dough?) Service is also spotty.\n\nAlso, some of the previous high reviews seem to come from from questionable sources.", "author": "April Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Absolutely fabulous food and service.  Fabio treated us like family. Felt like we were dining in Italy !!!", "author": "Warren M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "Was there last night for first time. Place is beautiful with incredibly high ceilings and exposed brick. You would think you were in NYC for sure and not Brooklyn. Had a brick oven pizza which was outstanding. Thin crust, not greasy fresh ingredients. Could not eat enough. Had a signature pasta dish with portobello mushrooms which was beyond description and I know pasta. Could not eat enough of it. You must go there.", "author": "Benjamin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-09", "description": "While staying in Brooklyn, we were looking for something close to the hotel.  Forno was very close and only a few minute walking distance.   As soon as we walked in we knew it was going to be good, the smells are wonderful.  We tried everything from paste, pizza and salad.  I only have two suggestions, one the Goat Salad needs more Goat cheese.  Three marble sizes goat cheese isn't even enough to wet your tongue. When doing fried calamari, they can not to over cooked because it needs to be chewing not hard.", "author": "Kellie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Great old school style place with awesome traditional Italian cooking \u0026 wood fired pizza.", "author": "T. C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "What a nice addition to the neighborhood.  I loved the salad and pizza. Just a little too noisy in the dining area.  The  service was good and Jessica  was attentive.  After dinner we were able to enjoy a beverage at the bar.  Was nice experience to start the weekend.  I will return.", "author": "Anthony M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-20", "description": "Had some pizzas and brought our own wine. The service was average but the table we got for a 5 top was hideous. They put us in the back right on the corner where the staff travels to and fro the kitchen, so my husband was basically hit in the back the entire night. We ended up asking for another table, where thankfully the table behind us was vacant so the passing and touching slowed. There is a lot of space up front, maybe converting some of that into 5 and 6 tops would help? Either way, the pizza is average and the service was fine but the seating was poor and colored my choice of not having returned as yet.", "author": "C C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-03", "description": "I didnt like the pizza, waste of my momey! I just had it about an hr ago, asked for two margarita pizzas. one with extra basil and mozzarella. let me first say the margarita pizza with nothing extra wasnt crispy, un cooked, soggy \u0026 only had 2 basil leaves! like WHAT! then the second pie with \"extras\" only had 5 basil leaves and yet again it wasn't crispy bc it under cooked and soggy. I wish I could get my money back. they make italian pizza look and taste like shit. never will I come here again, I would of rather went to grimaldis or sottocasa, they can be rated for 5+ but here is horrible unfortunately 25+ gone in the garbage. I have pictures to prove to you how it looked like, which I'm not gonna call them pizza, bc thats not pizza... I cant upload photos with the app. Ugh waste of time and money. thumbs down", "author": "E A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "The food is good, and the wait staff is friendly. The waiter let me custom order my pizza (which is something a lot of New York restaurants have a problem with), and it came out pretty fast. My caesar salad was different (with chard or some sort of leafy green instead of romaine lettuce) but good. The biggest drawback was that the service was pretty slow, but I also didn't appear like I was in a hurry. Bottom line: not the best pizza I've had in Brooklyn, but pretty good in a nice, big space. I would go back.", "author": "A L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "I come for the amazing buffalo mozzarella appetizer and stay for the wood-fired pizza! In an immediate area with no other options, this stands apart for sure.", "author": "Meg L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "Food is excellent and comes out of the kitchen super fast!!! Some of the wait staff seems inexperienced and it reflects in the service but the food makes up for the lack in service. The only other problem was the seating which made me feel very uncomfortable sitting next to a couple on a first date, it was very awkward. Some people do not mind the sardine can sitting in restaurants in NYC and I get it each seat is worth big $$$ so you have to maximize, its just my personal preference to have space. while I enjoy my meal. Overall the food really made up for any issues so I highly recommend this place just sit at the bar!!! :)", "author": "Elevated S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "So good!. This place is just lovely. Only steps away from our hotel, nice ambiance, great food!", "author": "Robin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "I came here for the first time today, and it was a pleasant experience. I had the diavola pizza and the don fiat cocktail -- they were both delicious. I sat at the bar, so I can't say anything about table service, but it helped that the bartender was very friendly.", "author": "Tamara T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "A brand new attractive restaurant in Downtown Brooklyn with a front bar and a back dinning room. Tables are well spaced so you never feel crowded and the atmosphere is inviting. The design uses original elements like the brick walls and skylights that add to the attractiveness of the restaurant.\n\nService is friendly and attentive and the owners and chef are there to greet you and make sure everything is in order.\n\nTheir specialty is crisp wood-fired pizza that can be ordered as you like it with many sauces and toppings. There are various salads and some daily specialties as well as great Italian desserts. We shared a wonderful pizza with mushrooms and onions and a great roasted calamari salad. For dessert we had ordered the nutella pie because we saw the couple at the table next to us were sharing one and asked about it. They said it was delicious. Unfortunately, they ran out so we ordered the seasonal berry cake which was fantastic. It was a fresh moist cake with various fresh berries. Next time we will order the nutella pie ahead of time to be sure to get it.\n\nThis is a most welcome addition to the neighborhood and well worth a visit for those not in the immediate area. A great place for friends and families.", "author": "Ronald C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "5 stars all the way... Food and atmosphere are perfect!  Very authentic good, love the pizzas, and live the staff.", "author": "DAVID D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-24", "description": "Amazing food and service. So lucky to have this place right by me.  Can watch a game, sit at bar for happy hour, or enjoy a romantic dinner. Great for a group too ie a bday party. Food was amazing, gluten free pasta made me soooo happy. And the wine options are also good. Great addition!!!", "author": "Alexandra W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "The staff, food,wonderful smell and atmosphere makes this restaurant a must!!!! We ate there twice (that good) and will return when we visit Brooklyn again.  Please ask for Luca he is amazing, amazing, amazing!!!!!!!!", "author": "Toni A."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}