{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Great food and good service. Always have a good experience at this restaurant - would highly reccomend", "author": "Marina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "In town staying at Aloft hotel (less than 5 min walk) and needing dinner with 5 colleagues from work we found this place on Yelp and gave it a shot.  Pizzas were amazing.  I'm not typically a fan of pizza crust but it was soft, light, slightly chewy, and better than any I've ever had.  Crust was puffy in the outside and quite thin in the middle.  They were cooked perfectly in the wood oven and were large enough to share if you wanted to.  Of course I had one to myself and didn't regret it.\n\nSoup of the day was well executed and one of our colleagues had the ravioli which was served with a stupendously flavorful sauce.\n\nWines were paired with most of our meals and prices were extremely reasonable.  Nice selection of beers for those in the mood.\n\nVery reasonably prices in general.  My meal, pizza and glass of chianti including a 20% tip (which is added automatically to groups of 5 or more) was less than $34.  Server was attentive and knowledgable of the menu but not at all overbearing.\n\nExposed bricks (painted white), and wood that was going to be used in the wood fires oven together with Italian art and advertising made this place quintessentially Brooklyn. The kitchen is behind glass so you a can watch your food being prepared if you want.  Also a small bar with a large TV above and I appreciated they had the college basketball tournament on (with no sound).\n\nI'll certainly be back the next time I'm in Brooklyn.", "author": "Jim P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "I live nearby so I dine here regularly. I have never been disappointed. All the pasta dishes are phenomenal. My top tips would be: \n1) Brunch on Saturday and Sunday/bottomless mimosas \n2) Delicious Italian coffee \n3) Happy Hour EVERYDAY from 4-7", "author": "MarLynn W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Fantastic place! Excellent atmosphere, very modern. Sauce is amazing! Ask for Carlos!", "author": "Kate B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "Wow, lots of 5 star reviews. I wasn't sure I would see that, but... it is deserved. I had a few friends meet me for Cinco de mayo HH. I called ahead for Forno, and they had a nice table in the front of house reserved. I don't give out 5 stars easily, but, here is the reason: Service. The manager, servers, bussers, tenders, are all awesome, and they are enjoying helping you have a great time. I had a nice Manhattan, some Margi's, Pizza, muscles, peppers, octopus, black ink tagliolini, and other items that were all outstanding. They make their bread on-premises, and just the bread on the table was exceptional (and i'm from SF, and get a Tartine walnut loaf every week for our house in SF). The Pizza was soo good, we got two to go to take it home for friends who were heading over later. This is definitely one of my new spots when i'm in DoBro/MetroTech.", "author": "Adam X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-18", "description": "Ordered the orecchiette with eggplant. It was incredibly disappointing, the eggplant was just mush and the sauce had no flavor. Portion was also on the small size.", "author": "rebecca w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "The pizza with the prosciutto and the crust stuffed with ricotta cheese is the reason I am writing this review at all. It is one of the most delicious specialty pizzas I have ever eaten, and I think about it often. The service is also fast, the restaurant open concept and immaculate, and the atmosphere is friendly. I also had the meatball appetizer and it was tasty! But the real star is that prosciutto ricotta pizza. Thank you for such a great dish.", "author": "Angelee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "We were a party of 14 and they treated us great.  Food is amazing and their happy hour specials are a great deal.  Highly recommend this nice big airy restaurant in downtown BK!", "author": "Ang M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-16", "description": "The service was good and the quality of the food was acceptable. The issue I had was that the portions that were served as dinners were more the size of appetizers. I ordered the Short Ribs, the key is plural, ribs and I got one small rib. When I questioned it I was told that the portion was appropriate. In my opinion for the price it was not appropriate. When I asked the server to inform the manager, and I saw her do so, the manager never came to the table to address the issue.  He will not have the opportunity to do so in the future, as I will not return. I almost forgot the most disturbing aspect of all, they charge you a fee to pay by credit card.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "is definitely price. but still it's nice. could be seen as a vice. a lot of carbs , not rice. i've gone twice. forgot to write the first time. the service is kind. bread and capers come before you dine. sparking? tap is just fine. espresso came from decent grind. the food came out all right.. as in correct, that usage type. the truffle ravioli was divine. the bad reviews are simply lies. eat here and experience the vibe. it's worth the multiple dollar signs.", "author": "Mosirabelyupopuo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "Once again, the food, beer and service is simply amazing. I've been here twice. Once with 2 other people and another time with 8 others. The service is always spot on and so is the food. This is my new go to spot whenever I'm here for work.", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-17", "description": "Came here on a whim with a large party and was seated quickly without hassle. Our waitress was pleasant but not super warm or friendly. Most of the party split four to five pizzas but a few of us got pasta. Our pastas came out within 15 minutes of ordering--weirdly fast. I had the orecchiette alla norma and enjoyed the pasta but wasn't crazy about the sauce. The slice of pizza that I had was salty. The decor is nice and probably the main draw here, since the food was decent. There was also an issue charging our cards at the end of the meal that left us feeling a little sour. Hopefully this was a one off situation but not likely to come back and try Forno Rosso again.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "This place was great!! We had our office holiday party here and they did NOT disappoint! I ordered the truffle ravioli which was light and delicious. I also tried some of the salmon, steak, and grilled octopus (which I would usually not order myself elsewhere) and all were incredibly good. The food is really fresh and perfectly cooked. The staff is super nice, which also contributed significantly to how awesome this dining experience was. The decor is cool as well=) The only slight minus is the dessert. I wasnt crazy about anything except the tiramisu - which was REALLY well made. But then again, I am not a dessert person. Anyway, I strongly recommend this place for lunch/dinner. Cheers!", "author": "lena p."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-28", "description": "Within 24 hours of writing this review I was contacted by the delivery company. Management reached out to them and they have refunded my money. I am happy this happened considering I have ordered from there before and would like to order from there again.", "author": "Jen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "I've came here multiple times for lunches and service is good to great.\nToday, our waiter, Oscar, was stellar. Friendly greeting, highlighted the specials and limited availabilities, provided ample time for us to look over the menu, plus ensured our bread baskets were filled. He was attentive to the floor too as he notified us he would be taking our orders sooner to avoid being backlogged against a large table's order. Superb service.\nI ordered their Forno Rosso pie and it's delicious. Prosciutto was balanced and the dough was slightly chewy with pleasant riccotta filling. The mozzarella was a tad much near the crust, but that's nitpicking. The Capricciosa is a great alternative, olives and mushrooms are a tasty combo.\nInterior is open and well lit with a casual vibe, Forno Rossa is a fine choice to go to to have a team lunch.", "author": "Kenny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "Just tried the pizza here. They have a great Hppy hour special with nice wine and pizza options that are affordable. The dough was a touch over-kneaded but I bet that will improve, and they are super solicitous of feedback. Nice space too", "author": "Deborah A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-28", "description": "The food is amazing ! My group of coworkers love coming to this place during lunch time, but the service isn't as good. They always mess up the orders and we recently went for our managers birthday and had to ask twice for a desert, they didn't forget to give us the check but they did forget to give us the cake. We felt terrible having to wait for a desert that never came. The response was we forgot. I feel like service makes the place even better, hopefully they work on it.", "author": "Gabriela P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-04", "description": "The food is great but the service is terrible. Every time I come it's something. Last time I went I reminded the staff three times about surprising my manger with a small cake, they charged me but never brought it. Another time my coworkers All got our meals at different times, we didn't eat together and we took about 1.5 hours to leave the place. Iv brought it up to the manager and he shut me up. said he'd return the money to my credit card and never did. My coworkers and I don't plan on coming back .", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Cute and quaint Italian restaurant just on the edge of metrotech center. Exposed brick, high ceilings,\nAMAZING cocktails and a skylight bring out the inviting and fantastic ambiance I love about this place. The skirt steak was delish and the Sicilian breeze(?) cocktail it will change your life. Double espresso and cannolis on the way I cannot wait!", "author": "Jason S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-29", "description": "I can't believe that this place got 4.5+ stars and perhaps one of the most reviewed pizza place in downtown Brooklyn area. To be honest, LA's pizza is so much better at a much cheaper price, be it the generic Domino's pizza or the build-your-own Blaze pizza. \n\nI really love the service here, though. Me and my friends came here 30 mins before they were closing to order a take out, and they treated us really well. The hostess let us sit at one of the empty tables near the front door, and the server even offered us water while we decide on what to order.\n\nWe got the Capricciosa and replaced the ham with the Italian sausage. It was quite bland and watery. there was a lack of toppings as well as flavor. The whole pie costs $17, so splitting among four people was not only expensive but also not filling and satisfying. \n\nI would not come back to this place any time soon, unfortunately. People always rage about NYC pizza, but this place kind of brought my expectation down a little bit", "author": "Hai L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}