{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "So this will definitely be my go-to pizza joint in the neighborhood. Awesome pies, great service, and a pretty damned good negroni to boot.", "author": "Shawn L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "Wouldn't go out of the way to go here again. Not the worst, but definitely overpriced.", "author": "Chelsie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-27", "description": "Extremely poor service. Sat down with a group at 10pm and didn't place an order with our waiter until 10:45pm. Received our order for 3 pizzas around 11:15pm. Pizzas were decent at best for the price, which prevents this review from being 1 star. We all ended up leaving hungry. \n\nSave your money and time and go to a real pizzeria", "author": "Justin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Tasty dinner in a great atmosphere.  Fun wait staff and delicious cocktails and pizzas!", "author": "J Allison M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "Tremendous addition to the New York artisan pizza scene. The space is enormous and great for large groups. Wait service is excellent. They will dote on you if you require extra handling.\n\nYou can't go wrong with any of the pizzas. They are flavorful, laden with fresh ingredients on top of perfect crust. So good. Appetizers were also nice--antipasti, cheeses, and the avocado and shrimp salads are highly recommended.\n\nAfter carb-heavy meals I rarely stay excited for dessert, but they had, I believe, a Nutella pizza...what! Amazing.\n\n...oh, and BYOB!", "author": "Yan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Brick oven pizza with a kick of awesomeness! Been here at least 10 times since it has opened. Even bought in my department which was 17 plus people. They all loved it. The fried calamari and tomatoes with fresh mozzarella cheese is a good way to start off your meal. My go to dish the is basil pizza with the spicy oil. Make sure to request for the spicy oil, it makes a good dip for the crust. the staff is friendly and helpful when you arrive. They refill your water by the sip! Such great service. The place has a high ceiling so it looks really open and the decor is nice and hipster-chic.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "Very cool place, like most designs lately very modern, with a touch of old italian. The bread and pizza were simply well made and super tasty, wish it had more prosciutto on top for the price, but oh well, they need to make a bigger profit at NYC. They have a special on paninis, they look delicious and huge, perfect to share. I saw the main chef teaching his waiters and waittresses about the dishes, cool that he is investing his time doing this, but not cool to customers as it delays the attention of the waiters on your table. It also takes away from enjoying the atmosphere of the restaurant since you can see they dont really dedicate a sole time to train them, they just do it on the fly.", "author": "Rye Bread C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Our bartender Pedro made our visit here so worth while. He's very accommodating and extremely friendly. Totally recommend coming here even if it's just for a drink although the food was great as well.", "author": "Abigail S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Pedro the bartender was amazing! Completely hospitable to my girlfriends and I who were brand new visitors to the area. Took very good care of us. Definitely recommend for a late dinner and drinks!", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-08", "description": "Get here quick people! it's BYOB until they get their liquor license. The first 'cool' restaurant food place to open in the neighborhood serving personal size pizza and ridiculously yummy salads.\n\nDecore is high ceiling rustic with contemporary vibe, huge screen TV at the bar, music not too loud, hostess really nice.\n\nIn a hood where most restaurants have failed (the only two which have tried in past year and a half), cross my fingers this place will stick around.", "author": "erika s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Forno Rosso is the new pizza darling in a corner of the exploding Brooklyn gentrification phenomena. They opened last summer and have worked out all the kinks. I'm very excited to have their little red oven, reasonable pricing, beautiful space, and friendly staff join the hood.\n\nPerry and I stopped in for impromptu date night for a Sunday at 7:30 pm. There was no line for tables, and the place was about 85% capacity. The bar welcomes you into the space on the left, with a ginormous TV and seating for maybe 10. Hostess stand to the right. Long communal tables are middle right, which could easily seat 10 people each (so bring friends!). The back is smaller two and four seater tables, close to the giant glass wall that displays the name sake red oven and kitchen. The ceilings are gloriously high and bring in wonderful light. However, the hard acoustics of the room may make it a little noisy if you're sensitive to ambient noise.\n\nWe had a great server, who promptly grabbed us water, asked if we wanted anything from the bar, and took orders within 10 minutes of sitting. He was quick to clear tables, checked in often, and was super sensitive to eye contact and small gestures that clued him in to jump in. \n\nPerry and I ordered:\nInsalata de spinica - includes fluffy fried balls of goat cheese and a sweet balsamic dressing over fresh spinach\nForno rosso - half calzone classica and half primavera white pizza - a third of the pizza is folded over for the calzone, filled with ricotta and salami. The primavera had generous prosciutto and arugula. The crust is thin, chewy, and had a great wood fired char. The pizza is personal sized, around 12 inches diameter, and yields about 6 slices. \nSalmone - While the serving was small, the salmon was cooked through, without being over done (but not done rare if that's what you like). The sides of potatoes and spinach were good. However, Perry had major food envy looking at my personal size pizza versus his 5 oz of fish.\nPanna cotta del mojito - a cream based mint custard, served with raspberry syrup and maraschino cherries. This was the most meh panna cotta I've had. While the mint flavor is pleasing, the panna cotta lacked the decadent creaminess and sweetness to be a standalone dish. You really needed to eat it with the raspberry syrup, which was very sweet and fake tasting. I would love to see this revived in summer with fresh macerated strawberries and mint to complement the panna cotta vs the raspberry syrup. \n\nDinner was $60 all in, which is par for a nice dinner out and for an establishment with such nice decor. I would love to throw a shower or small party here because the space is so lovely and the price point and menu so reasonable. We'll be back!\n\nUpdate March 2017. Husband and I get pizza here at least once a month and the quality still stands at 4 stars. The menu has changed some in two years,  but the pizza is consistently delicious, chewy charred tasty carbs.  I still favor the calzone, the diavola pizza, the siciliana vegetarian pizza, parpadelle al funghi, and the grilled octopus appetizer. If you're in the neighborhood at lunch,  the lunch specials are a pretty good deal and offer tasty panini.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "We loved everything about this place!!  They have no liquor license yet- likely in 2 weeks our waitress said. They welcome you to byob (Wright \u0026 Goebel across the street!) and don't charge a corkage fee to open it. \n\nThe service from the start was extremely friendly and attentive- the hostess, our waitress and soon after others on the staff. They're prepared to answer questions, give suggestions if asked and very knowledgeable on the menu.  Glasses were refilled throughout before the last drop was drunk. We were also give a tasty lentil spread with bread as a starter. My only wish was for more bread!! But I asked to save the lentils and then spread that on my extra crust as I ate my pie. \n\nNow let's get to those. They have a massive tiled wood fire burning oven in the back. It's behind a floor to ceiling semi fogged glass so you can sort of see inside. I wish that instead the top half was open air so you see in, perhaps make another bar area (in addition to the front of house) that enables the customer to eat with a view of the pizza making and engage the chef. Something to consider. \n\nMy fiancé had the Rosemary Bianca which features mozzarella, garlic, fresh rosemary and extra virgin oil. I loved my Tartufata Bianca which is mushrooms, burrata mozzarella, arugula, truffle oil and shaved parmigiano. We agreed each was extremely delicious and that the price point was fantastic- for the area or not. There's a pizza joint in Clinton Hill (cough ft on Girls as Rays Coffee) and their prices are a couple shillings more, generally pricier menu overall. Please don't change your prices FRP and you will thrive. And especially so when you have the ability to sell the booze- keep price reasonable and you will go so far. \n\nWe love this place and can't wait to try more of their menu!", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "Lovely pizzeria finally opened in Rambo! \n\nSince they just opened and are waiting to sort out all their licenses, it's BYOB but that doesn't bother me at all. \n\nThe restaurant has a great atmosphere, the staff is super friendly, perhaps a bit nervous, but very kind and attentive.\n\nGo have dinner there with a friend or two and enjoy this new neighborhood gem!", "author": "Nina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Never had a bad experience here. The food is great and the service is good.  Pizza and salad is the way to go.  Never too crowded. Great place to chat and catch up.", "author": "Sabrina A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-17", "description": "Was looking for a place to eat close to our hotel, this place was open and had a free drink with checkin. No complaints with the food, but they made us review the restaurant before they would bring us the check, they said it was a part of the check in deal. Shady, super shady. Great pizza, but I'd rather pay for the cocktail than have to churn out a review quickly at a table before I was allowed to leave.", "author": "Deirdre M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Very good atmosphere and food. Service was impeccable, and the food was to die for. Highly recommend.", "author": "Nicholas W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "For my very first visit, I was annoyed that I couldn't locate their phone number online, a current website (other than a Chicago location with the same name) and decided to walk-in to make a reservation. Turns out they weren't taking any at the time, but honestly, the wait wasn't bad at all, even for a Friday.\n\nThe caesar salad had way too much dressing on it, the burrata cheese was just ok. \n\nBut the pizza was perfect. I especially love the fennel sausage broccoli rabe one. The arugula and mushrooms + margarita were also yummy. The crust is super thin and the sauce is just right. \n\nTheir service (the first time around) still needed some work. Though I've been twice (since) and had an excellent servers, so they've ironed out the kinks.\n\nI also ordered delivery just a week ago and they weren't kidding about the pizza(s) being ready in 8 minutes. Even with a new chef, the quality and taste has remained the same. \n\nBYOB ended, as they now have their liquor license. I look forward to trying their desserts and cocktails in the future!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "The best Pizza in all Dowtown Brooklyn and all dishes is delicious highly recommended!!!", "author": "Arturo O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "Great pizza, great location, and very friendly staff. Can not complaint about anything. I sat at the bar and enjoyed a cold glass of local brew. Had a salad and a personal pizza. Everything was done perfectly. Competitive prices and very close to the Hampton hotel I was  staying at. Will have to visit next time i'm in Brooklyn for sure.", "author": "Kilbert P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Visiting from LA. Was walking around the city, walked across the Brooklyn Bridge and this was the location I came across. Was impressed the way the inside looked and friendly staff welcome. This was my first pizza trying out here in Brooklyn and loved it. Really nice n thin, tasted great!!", "author": "Marco H."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}