{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "Excellent food  service outstanding\nMario the manager 1st class\nThe kanches\nPittsburgh Pa", "author": "Melanie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "The food is delicious!  I had black shrimp tagliolini, awsome!!!! The servers  were very attentive and the ambiance is very nice! The appetizers were delish! Fried calamari, well seasoned. I will definitely refer friends to this establishment.", "author": "Tanya P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Close to MetroTech and good food. check out their dipping oil with lentils, delicious!", "author": "J P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "Pizza was great. We had the forno Rosso. The prosciutto was on point. I did wish I added tomato sauce with it. But it still turned out delicious. \n\nService at the bar was great. Very attentive and our sever Sergio was excellent.", "author": "Sondy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "I met friends for brunch at Forno Rosso this past Sunday and although I was hoping for something sweet like french toast or pancakes- unfortunately they only had savory brunch options- I was pleasantly surprised when I tried something new (the salsiccia e uove) which is sunny side up eggs with a side of sausage and it was absolutely delicious! Plus botomless mimosas, what's not to love! Our waitier was Assaf and he was totally awesome, our glasses were never empty!", "author": "Tomasilienne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "It's a bold statement, but Forno Rosso is perhaps the best pizza place in Brooklyn. Bold, I know. The staff is inviting, the pizza is divine. The siciliana pizza, with smoked mozzarella \u0026 eggplant, and the montanara, which is a deep fried pizza (yes, deep fried) are to die for. The happy hour drinks and apps are icing on the cake if you make it earlier in the evening.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Guy at hotell suggested. Food was amazing at a great price.. The staff and service was better.", "author": "Jay M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "We had a very good meal and great experience here.  The service was friendly and good, and the food and cocktails very good.   Drinks off their cocktail menu were very well made.  In terms of food, we started with the burrata and tomato and the octopus.  Each was very good.  For our main courses we had the orecchiette with sausage and broccoli rabe and the pappardelle with mushrooms.  Each was very fresh, well made, and super balanced.  Delicious all around.  If we find ourselves in the neighborhood again, will definitely return.", "author": "M K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-27", "description": "If I was reviewing the pizza only, I would give it 1 star. I ordered the regina margherita and something was just wrong. The crust didn't taste good. It was soggy everywhere except for the edges and burnt on the bottom. The sauce wasn't quite right- hard to say exactly what was missing, maybe sugar? The cheese tasted good but on this style of pizza, there isn't much of it. I can't remember the last time I had pizza where I didn't like the sauce and crust enough to eat it. Was not worth the calories.\n\nI had the arugula balsamic salad which was mediocre (not quite enough balsamic). My bf had much letter luck. He started with the burrata appetizer and had a pasta special and really enjoyed both.\n\nSo I guess I ordered the wrong things here. But for the pizza to be the wrong thing to order at a pizza restaurant... Not returning.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-09", "description": "Their food is awesome and their happy hour is great, but the takeout / delivery experience is so consistently bad I have to dock them 2 stars.  Here is only one of several examples (I live two blocks away, so I keep trying bc the food is good).  I called and ordered a pepperoni and mushroom pizza and a pepperoni and olive pizza along with a salad, for takeout (bc my delivery experience was so bad in the past that it was worth walking over even though we just had a huge Nor'easter and it's a hassle to go outside).  When I picked it up and got home I realized that the pizzas had no F'in cheese!  I called them and they promised to make it right, even though they started off by trying to defend themselves, talking about the Rosso pizzas having no cheese (which I had to lookup after bc I was confused AF).  The delivery guy came and picked up the pizzas (that confused me too), but when they were delivered after they added cheese it looked like they had been held vertically for the entire two block walk.  All the toppings and cheese were on one side of the box.  End rant.", "author": "Brian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "I happened to encounter this hip, cozy, pizza place after getting to the nearby Brooklyn Hampton Inn rather late (10:30pm). Because this place is open till 11:00pm, I scrambled to place a carryout order before the kitchen closed or the chefs checked out for the night. \n\nI got the Forno Rosso Blanco Special, it was good, not 5 stars, but a solid 4. The crust here is amazing, soft and buttery without being too dry or chewy, nor too doughy, just right. Good sauce, good cheese, good prosciutto, good arugula, good pizza.\n\nI was a little disappointed that my pizza wasn't piping hot when I got back to the hotel, but that was very likely the fault of the 10 degree temperatures outside, if it wasn't 10:45pm, I would have stayed and eaten in the restaurant. If it's cold out, get home with your pizza fast!\n\nThe restaurant did look inviting, this would probably make a good date spot. Dim lighting, decent beer and wine selection, it looked cozy in there. \n\nService was pretty solid too, since I ordered it to go, my only interaction was with the hostess. Despite it being 10:45 and the employees itching to call it a night, the hostess was still kind and went back to the kitchen to grab my pizza as soon as I walked in.\n\nAll in all, I give it a solid 4 stars. My only wish is that they were open later than 11pm, but I'm guessing this is a Brooklyn thing, because a lot of food places close here at 11pm.\n\nIf I could do it again, I'd stay at the restaurant, order a wine or beer, split a pizza, and split one of those salads or delicious looking entrees. If your on a date, don't forget the dessert, unless the date isn't going so well, in that case get the check.", "author": "K L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "In town and looked up a local pizza place. It did not disappoint. Just went with the bartenders recommendation and it was great.", "author": "Jon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "This is mine and my wifes favorite new pizza spot ! They have this delicious pie with ricotta stuffed crust. Hands down best pizza Ive ever tasted. The staff is very attentive as well.", "author": "Jerry P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "Ordered delivery via DoorDash and my food arrived within an hour. I ordered their burrata salad and shrimp/avocado salad - both were very good!  They even threw in some bread to go with my meal, which was highly appreciated.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "Margarita pizza was good, the pasta with mushrooms was really good and peroni on tap.", "author": "J K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-09", "description": "Update!: I went back today and ordered a custom pizza. It was ok, but most of all - not soggy! They have included some plastic thing in the pizza box to raise the pizza slightly and keep it from getting soggy. Still not amazing, but not bad! Update to a 3*\n\n-----------\nNothing to write home about. I was very excited to find this highly rated restaurant near my apartment I finally went over for lunch earlier this week. \n\nI ordered a pizza to go and a kale Caesar salad. The salad was delicious - but was literally just kale, cheese and 4-5 croutons. The dressing was good. \n\nThe pizza, on the other hand was ridiculously soggy. Terrible on a thin crust pizza. Literally dripping liquid (maybe water from the mix?) off of my pizza. \n\nPlus when I called, I was told it would be ready in 5 minutes. Then I walked down and waited an additional 25 minutes. Boo. There goes most of my lunch hour.", "author": "Vicki C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-23", "description": "Great service, cocktail menu, and wine selection. Happy hour deals are excellent and food is good for the price you pay. I have a feeling the reviews have been inflated by the yelp check in offers. Pizza doesn't compare to other local spots around here.", "author": "Pallavi Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Good food, nice atmosphere and really nice servers! The ambience is really calm and soothing, great for a girls' night or on a date. The fettucine bolognese was delicious and definitely get the dessert.", "author": "Autumn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "I regularly go here for happy hour, or to bring friends to try the very authentic Italian food. The bartenders are incredible here! If you're at Forno Rossi and pedro is working I highly suggest you have him make you a cocktail! Leave it up to him! He's extremely creative and talented mixologist. All the waiters are attentive and lovely. It's easy to say this js one of my favorite places!", "author": "Brielle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "Eating at Forno Rosso is always a pleasure! Delicious food,good atmosphere and great staff. Our waiter Luca was friendly and accomodating. I came here with my friends and they were really happy. We had fritto misto and eggplant parm to start,followed by shorts ribs over mushed potatoes and pizza pugliese cooked perfectly. Try to save some space for dessert because the pizza nutella is really tasty! Good selection of wines and beers. Strongly reccomended!", "author": "Teo S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}