{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-03", "description": "Great atmosphere and only steps from our hotel. Comfy inside and friendly staff. Everything we ordered was delicious and not too heavy. Loved the warm bread with lentils in olive oil as a free starter.", "author": "Don D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "My wife and I are originally from NYC but we recently moved to Colorado for a better overall life. But something we missed was the amazing food in NYC. We've been to Forno Rosso a couple times but this last time we went was one of the best restaurant experiences ever because of our server Ellie. Not only is her personality just so vibrant and beautiful she recommended the best dishes had the perfect balance of catering to our needs but letting us be. She made it so fun and we felt so well taken care of. Thank you so much Ellie! We will miss you in Colorado!", "author": "Alan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "Food was amazing- and Ellie our server made the experience incredibly enjoyable! Thank you!", "author": "Claire P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "I could say, probably the best food, the greatest atmosphere, the best service and place overall I've ever been. Kind of hidden from the street, we accidentally discovered that place. We had a truffle pasta, steak, and the Special mojito for $6!!!\nOur server Theresa and manager Julia were talking care of us. Definitely come back", "author": "Zhanna Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "We're in Brooklyn for a few days for a conference and came to Forno Rosso for dinner last night which was sooo incredible we had to come back again tonight.   We asked for our same server again, Ellie.   She complimented the food experience so much so that we had to have her again tonight.   This time we were honored to meet the chef, Mattereo as well.   What a treat to hear his passion around the food he creates here.  We're heading home tomorrow but not before I grab a few to go orders for home!! Do not miss this stop!   Incredibly affordable for the quality of food served here.   From entering to leaving you'll feel like your home :)", "author": "Anna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "We went to this restaurant because we are in town for business and wanted a nice dinner.  So we went to our favorite review app: YELP.  After reading the reviews, we naturally thought this is the place to go and we are so happy we made the decision.  We were there for happy hour and our bill was very reasonable for 2 pizzas and 4 drinks!  And we were especially lucky to get Ellie as our server.  What a charming young lady! She was helpful with the menu and checked back on us often.  The restaurant itself had great ambiance. Nothing negative to say!", "author": "Ramona R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "I have been here multiple times and enjoy it every single time. The food is so great and so is the customer service. Every time I bring a new person here to try they fall in love with this restaurant. The Margarita pizza and the chicken meatballs is one of my favorite appetizers. 10/10 would recommend to my friends and everyone.", "author": "Luz T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "Eggplant parmesan was perfect!! It was recommended by our server Ellie. She was knowledgeable of menu and asked great questions. Olive oil and bread were perfect. Definitely will be back.", "author": "Dawn E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-26", "description": "I have a feeling that the food would have been better if I'd eaten there rather than gotten delivery. However it was still good! Had the bolognese, decent flavor but the pasta had pretty much molded together. Also had the diavola pizza. Not a crazy pizza but the toppings that were on were plentiful without weighing the pizza down too much. Also the sauce to cheese ratio on the pizza was perfect. Would go again!", "author": "Adam L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "Best Italian Food I've ever tasted. Took a chance on Uber Eats to try this place and it was so good\nwe actually went to the restaurant today. You won't be disappointed!", "author": "Sue P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "This place has amazing service and food. We looked it up on Yelp and found them to fit our criteria. We walked in on a Saturday afternoon and was greeted politely, we were sat in a few minutes and our drinks were brought to us shortly. The restaurant was clean, the vibe was chill, and our server was on point. Everything was great from the appetizer, from the main course to the desert that followed. I highly recommend this place.", "author": "Joshua J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-15", "description": "Had dinner here tonight and it's a very nice room with high ceilings which makes it pretty conducive to having a conversation. The menu is pretty nice with all the regular Italian staples. I had roasted potatoes and broccoli rabe which is a favorite of mine. The potatoes were good but the rabe was not very good at all.  It had a lot of garlic and not cooked that well. Also, they brought out spinach at first and I should have stayed with that.", "author": "George S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-09", "description": "My party was throughly disappointed with our experience. There is nothing special about the food and I have to say we were fooled by the positive reviews. I don't know if this is a chain restaurant but it felt like it all the way down to the menus. If that is your bag go for it, but if you like a more personal, passionate, and thoughtful food experience I'd say look elsewhere.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "This is the highest rated Italian restaurant within walking distance of the Alamo Drafthouse. Sunday evening, they was able to accommodate five people with no reservation without trouble.\n\nTo share with the table, ordered a bottle of the Malbec ($40). A strong, thick red that went well with the free bread provided. For the main course, settled on the Truffle Ravioli ($19) - large pieces of ravioli stuffed with several different cheeses and swimming in a hearty cream sauce. I thought that the amount of cheese/creaminess would be overwhelming, but it was actually more balanced than I had anticipated (or the wine worked really well). \n\nService is prompt and the ambiance is conducive for conversation. A solid place overall if not something I'd seek out.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "This restaurant is amazing. Great food and service. We had Ellie as a server multiple times coming here and she is amazing. She accommodates on whatever we need.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Great, great place. Would go back in a heartbeat.\n\nFood was excellent and staff were wonderful. Carlos and Theresa took very good care of us!", "author": "Edward P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "This place is amazing! What a great find in Brooklyn. We had the ravioli with truffle oil and cheese, veal tortellini, and a pugliese salad. The olives in the salad were to die for. Our waiter Carlos was the best. He had a permanent smile and was eager to please. Great ambiance, cozy, hip and romantic. Highly recommend!", "author": "Tory w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "Great place! One of the best ink pasta I've ever tried in New York. The pizza was great as well. The service was absolutely amazing. Me and my friend name here during happy hour (which is from 4 to 7 I remember), so it's not very crowded. You can tell that the interior is designed and the atmosphere here is great.", "author": "Aubreyny G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Stopped by Forno Rosso for the first time on my birthday. Happily found out they have great brunch specials (bottomless mimosas + bellinis) also unlimited pizza that's served fresh. \n\nI didn't end up getting the pizza this time because I was craving a good bowl of pasta. The food was great, especially the bread that they serve as a starter with the olive oil. The service over all was great, everyone was attentive and even the manager checked up on us a few times. \n\nOur server was the best part of our experience at Forno Rosso, Rahel--she was incredibly friendly and very accommodating (I wanted a different type of pasta for my bolognese) without hesitation she made sure I got the pasta of my liking! My boyfriend and I will definitely be going back and hopefully we're in Rahel's section again!", "author": "Mimi N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-03", "description": "Omg! I love this place!! The food is amazing!! They always have a great happy hour and a great brunch!! I always order the Fettuccine Bolognese which is soooooo good!! This place is a must try!!!", "author": "Christina D."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}