{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Great venue and welcome addition to the neighborhood. Food was great, service was great, value was great. The decor is well done as well. I don't have many critiques to give them, just keep up the good work.", "author": "Todd S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "Finally my wishes came true. This is a beand new restaurant in this neighborhood and the food is really good. Pizza is amazinbf and you can make your own wich is a great change from all the standard toppings all the other places have. \nMy new favorite spot for sure!!", "author": "Ora T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "my roommate and I we had a pizza and a lasangna,(i cant spell this word, but u know what im talking about). the food was fantastic, (accordin to my roommate Kevin.) i give 5 stars for good survice, 5 stars for environment, 4.5stars for food cuz my pizza was burned, if my girlfriend was here she will tell me 'honey,dont eat that! thats cancer....' lol but who cares. i liked it. overall experience 5 stars.", "author": "Will G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "Best pizza this side of Brooklyn! Great service. Great staff. Amazing insanely great food. Every time my husband and I dine here, we leave happy and full. Do yourself a favor and eat here already!", "author": "Angela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "This is a great new addition to the neighborhood. The food is delicious and the service is fantastic. Pizza and wine always go well together!", "author": "Torri S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "Great food - a tad pricey for small pizza, but the view (lower Manhattan skyline \u0026 Brooklyn Bridge) atmosphere and music make it worth every cent!", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "Yo, you totally wanna go there. The pizza, the selection of Italian beers, the place itself, the staff: absolutely worth it. I'm Italian so I know my stuff when we talk about pizza, right? And this place is one of my favorite: I love the crust, which is not too soft and wet as you can find in most of pizza scene in NYC. Not pricey. Highly recommended.", "author": "Roberto S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "Forno Rosso is exactly what downtown Brooklyn needed. The atmosphere is a great fit for the neighborhood and the staff is friendly and accommodating.\n\nThe pizzas are terrific, but the incredible menu is where Forno Rosso really shines thanks to Giueseppe the chef. Everything from the fresh pastas to the seafood dishes are consistently top quality and highly recommended. Make sure you save room for the panna cotta!", "author": "Ian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "I absolutely love this place. Friendly staff. Good food. Nice ambience. The calzone is my favorite.  Small but noce wine list. 10 beers on tap. I definitely recommend this place if you're in the area and in the mood for good Italian food.", "author": "Choss T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "Great service! The area needed a good pizza place and it now has one. Be sure to try the white pizza with arugula, mushrooms, and truffle oil.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "Best Italian food around hands down! The friendliest staff and quick service. I come here weekly and learn to love it more and more everytime! PERFETTO", "author": "Arielle N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "Great ambience. Pleasant wait staff. Menu is concise and varied. Loved the plain pizza... The crust was the perfect level of crispy and the sauce applied on top at exactly the right amount. They have a bar which is a plus!", "author": "S B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "I enjoyed the specialty salad they made-spinach, goat cheese, walnuts, heart of Palm, tomatoes, apples, balsamic dressing. Plus the dessert was excellent.", "author": "Nicole F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "This place has some REALLY REALLY great pizzas.The service was great and the atmosphere is AWESOME!! When I got my pizza my thought was I'll be taking some home, but it's so light and delicious that I ate everything and ended up ordering to go too!!!!! I have been to this place couple times and everytime I had great experience. I would highly recommend this place and I wish they can open one in Long Island!!", "author": "Vicky S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "I have been here twice and both times the pizza was flat-out awesome.  This is true Neapolitan style pizza the way it was meant to be made.\n\nIf you are in the area I strongly suggest you check this place out!", "author": "Philip F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-30", "description": "Great menu options. Foods great. Love the atmosphere. Service was friendly and prompt. Will be back.", "author": "Eric G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-27", "description": "Stay home and order. Food is delicious, service is the worst I've had. That explains why on a Friday night the place was half empty, but the delivery couldn't keep up with the orders. Again it was half empty but my party of two had to wait 10 min to be seated?! When we did, it took like 20 min for us to get water, and we never got bread! Our pizza and our app came at the same time, but again they were delicious and well made. A couple already seated next to us when we arrived left because we got our food before they did!  Not going back but not forgetting this place for take-out.", "author": "Carolina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "For my first meal in Brooklyn, I had a really good one here.  The pizza is very good though not anything I would call the mythical \"best pizza in NYC.\"  However it was fantastic, a little pricey but you do get what you pay for.  Service was pleasant and attentive, the atmosphere was pleasant although I could have done with some music, and a decent wine selection.  Definitely going to be going back regularly!", "author": "Sean F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Delicious food and wonderful service. Loved the egg plant Parmigiana and the fettuccine bolognese.", "author": "Milou T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "The pizza and salads are great at Forno Rosso Pizzeria. They have a warm and easy vibe with the candles, seating and music. The staff are pleasant and responsive. Very good experience and we will continue to come back. Nice to have a good pizzeria in the area.", "author": "Lebleena L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}