{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "The decor: \n\nCozy, clean \u0026 neat.\n\n\nThe food:\n\nThe appetizer bread is so amazing. My financee says it's the most flavorful bread she's had and I agree. It's packed with flavor and it's free.\n\nI had their seafood pasta. Very interesting style of pasta. Wonderful texture and taste.\n\nThe vegetariano panini was spot on with texture.\n\nThe roasted potatoes side order was crunchy  and chewy.\n\n\nThe service: \nVery friendly staff, attentive and flexible.", "author": "Jay H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-14", "description": "Amazing food, fast service and a great ambiance-what more can I ask for? Visited for dinner with my family, called ahead and seated immediately upon arrival. We had the cold cuts and mozzarella -fresh, best mozzarella I ever had and fresh meats.  I also had fried calamari which was tasty, crispy but not heavy and cooked just right. \nAlso tried arugula and prosciutto pizza and sausage pizza -YUMMY! \nAnd appetizer of meatballs. Everything was beyond what we expected, we will be back.", "author": "Azul V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-25", "description": "Just around the corner from my hotel, so we gave it a try. Had the lasagna, and it was very good. Would order again. The food came out very quickly, but the server wasn't super attentive. Felt the price for what I had was fair.", "author": "Jen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-06", "description": "Super. Slow.\n\nWent here for lunch on a workday with my coworkers and even 1.5 hours we had set aside wasn't enough time for a meal. We sat at the table for almost 2 hours and spent almost all of it waiting for food. \n\nIt took them 20 minutes to get soda and 2 glasses of wine out. Took over an hour for the pizzas to be made and they were soggy in the center. Couldn't really pick it up and eat it. Also I made my own pizza and they got the order wrong, but didn't really feel like waiting another hour for a new one to be made.\n\nThe ambience was really nice, good crowd of people. But not worth the wait or price.", "author": "Anvita S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "First, a haiku:\n\nHappy hour is REAL!\nGood options for food and drinks--\nTry the deep fried one :)\n\n\nWent for the happy hour last Friday with my friend. I got two classic margharitas, but one was classic and the other was the fried version (FRIED DOUGH ON A PIZZA??!!), and had a couple of glasses of wine as well. The happy hour was, I think, 4-7pm, and there were plenty of food items and drink items on the HH menu. One of the pizzas we ordered was on it, and so were our glasses of wine. \n\nThe classic pizza was delicious but very hard to hold/dough got soggy in the middle. I heard about this from other yelp reviews. I love a crispy crust, but the flavors of this pizza were all there. \n\nThe fried one was AMAZING. WHY DON'T I KNOW HOW TO MAKE THIS? \n\nOur server was nice, but service overall was a bit spotty. Once or twice someone came over to us with the wrong order, and there were several other tables around us who had wrong orders. Maybe it was a fluke. I almost took the wine they mistakenly brought over, haha. \n\nI knocked off a star because of the things mentioned in those last two paragraphs, but I'll definitely be back for that amazing pizza. The truffle smell wafting through the restaurant every time entrees came out was also tantalizing, so I'm thinking about trying a truffley dish next time as well.", "author": "Dakotah E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Pizza is amazing and the Zeppolis dessert is a must try! If you get lucky and they have the lobster gnocchi for their special, get it!", "author": "David H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "We live in the New Haven, Conn. area and on a weekend visit, our sons wanted to find some excellent New York pizza to compare with the world-class pizza back home in New Haven. \n\nForno Rosso turned out to be an excellent choice -- top notch ingredients and toppings with a slightly softer crust than our local Wooster Square pizzas. Nice wood fired light charring on the underside of the crust the way it should be -- somehow the charring flavor was very subtle.  The overall verdict?  Not quite as amazing as New Haven but really very good pizza. The crust had some whole wheat in the mix, which I liked a lot. \n\nThis restaurant, however, outshone our hometown haunts in sides and appetizers.  \n\nWe got the grilled octopus, served over diced red and yellow bell peppers that had been tossed or marinated in a sweet, tangy, glaze (apple cider vinegar, lemon and honey or sugar?) It was tasty, and went well with the seasoned perfectly cooked octopus.  Our tween boys even loved it. \n\nI'm a pescetarian/vegetarian but my wife reported the prosciutto and mozzarella appetizer was very good. \n\nA baby kale Caesar salad was a crowd pleaser.  We sure like our Caesar salads, and this one was a good one!\n\nMy ten year old and I ordered the basic margherita pizzas. My twelve year old chose smoked mozzarella, sliced fresh garlic, and mushrooms a la carte. I had a bite; the smoke and garlic went really well together. \n\nWe forgot to check in on yelp for the free drink, but found a great deal anyway -- bottomless mimosas for our Saturday 11:30 am meal!  \n\nService was friendly and quick, the waitstaff had mimosas poured and ready to go as we finished ours.", "author": "Joe J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-19", "description": "Underwhelming. \n\nBeen here twice and both experiences were pretty similar. The first time, I had shared a gnocchi and a Margherita pizza with my friend. The gnocchi was mushy and tasteless. The pizza was not very good, especially compared to other Italian pizza places nearby. Just looked kinda sad with barely any cheese on there and some sparse sprinklings of shredded basil.\n\nThe second time, I had a shrimp and avocado dish that I could barely taste the shrimp or avocadoes in. Was just kind of a mush.\n\nAll in all, will not be coming here again. I've finally learned my mistake. :')", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-09", "description": "Unimpressive pizza. It was the typical Neapolitan style that is ubiquitous throughout Brooklyn... Bland (and burnt) crust and the sauce/cheese were even worse. \n\nHaving said this, food choices are few and far between in this specific part of Brooklyn, so if you need to meet with a friend before an event (like I did), order something off of the menu that is NOT pizza... \n\nThat is what I will do next time and will update my review based on their appetizers/pastas, etc... \n\nBUT AGAIN: STEER CLEAR OF THEIR PIZZA.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Came here last night for Valentine's Day dinner. Made a reservation and was seated within seconds of walking through the door. The atmosphere of the place is absolutely amazing. It was so cozy and romantic. The perfect place for a date night. The high ceilings and wood logs on shelves all over was such a cute way to decorate. We ordered the meatballs and bruschetta for appetizers to share. I loved both of them. They were he perfect size for sharing. After we shared the tartufata pizza. It was amazing. All of the food was delicious. We ended up being too full to have desert but I will definitely come back to try it. Overall my boyfriend and I had a really nice yummy Valentine's Day dinner. Definitely glad we picked this place!", "author": "Cay S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "Was looking for a good pizza and stumbled on this spot. Really nice laid back atmosphere. The waiters are vey helpful and will gladly make recommendations. The pizza was authentic and the flavor was excellent. Get as much of the bread you can eat, you will not be disappointed.", "author": "Rizzy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "I went here with my daughter and it's close to my job.  The place is cozy and warm. Nice decor. Thev hostess is very nice and looks like top model! The food was amazing! Its pricey, but certainly worth it!!!", "author": "Loida A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "Forno is a nice restaurant with a casual ambience and a small but straightforward Italian menu. There's nothing wrong with it but similarly there's nothing memorable. The pizza was fine, thin crust that could have been crispier coupled with toppings that slide off the slice. We also ordered the pasta which again was fine but nothing spectacular. Probably wouldn't go back as could find a better slice on the street somewhere.", "author": "Daniel Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-27", "description": "I'd love to tell you about the delicious Italian cuisine and amazing service, but I've never eaten here. I ordered takeout at 8pm on Friday, October 27th and it never arrived. I paid for the food, and I'm sure it's amazing, but I wouldn't know. I suggest you dine in.", "author": "Dan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "Happy Birthday Stister Today I celebrate my sisters and I thank you Forno Rosso Pizzeria for a great start to our day.\nI arrived without my party and asked to be seated beforehand and ordered an appetizer: \nThe Calamari Frito which came out before my party arrived lol but it was hot and crispy and delicious the right amount of salt and the spicy sauce to compliment was fresh and good.\nHad to try the Montepulciano (my favorite red wine) it was ok not my favorite. \nWe also had the Eggplant Parmigiana (Rollitini) it was good fresh ricotta and basil I've honestly had better though.\nFor Entrees we had:\nThe Black Shrimp Tagliolini my sister and my mom had their description is that the pasta was perfectly Al Dente with the right amount of Squid ink in the pasta.  The Shrimp was firm and fresh.\nI had the Pollo Arrosto which had Brussels and a truffle sauce and mashed potatoes 'Twas divine the truffle sauce is one for the road literally I asked for a ramekin to go lol the chicken was moist and tender.  And my sister couldn't stop eating my mushrooms.\nMy sister received the Mojito Panacotta  as her bday treat that was sooo fresh and delicious the raspberry and mani (I believe) drizzle around the play was enough to  \nFor drinks well what didn't we drink:\nMilano style: mom liked she says it would be similar to a Italian baileys \nSicilian Nectar:  Sissy loved it she slurped it down in one gulp \"Go Stister it's your Birthday\"\nAmalfi Breeze:  an Italian Mojito so to speak fresh and delicious\nSo to wrap up the service was great our waitress Clarissa was a pleasure my mom and her hit it off after they traded stories of Naples (Clarissa's hometown). \n\nSo thank you Forno Rosso Job well done", "author": "Tierra P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "The oven is handmade in Naples and  shipped over. The pizza is baked in a 1200 degree oven and is finished baking is 2 1/2 minutes. That is fascinating to me! The pizza has right amount of chew, thinness, and crispy-ness. I would definetly visit again when in Brooklyn!", "author": "Krystal T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "I came to Forno Russo as soon as I landed and mostly because it was the closest to my hotel. It was one of the best decisions I've made. I had the pappardelle pasta with the mushrooms and my coworker had the lasagna. They are so good. I'm picky when it comes to the sauces that restaurants use in their pasta, but Forno Russo's red sauce in their lasagna is so fresh, and so worth the extra 20 minutes of making time. \nAnother thing, my water cup never reached halfway, someone was always filling my water cup!", "author": "Mara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "Stumbled upon this gem as I was searching for something within walking distance from my Airbnb. \nHostess greeted us and we were seated promptly. The place was pretty busy for a Monday night. Our server was patient with us as we looked over our menus, struggling to find something to eat because EVERYTHING sounds delicious. \nI ordered the Heart of Naples cocktail which tastes just as amazing as it smells. \nWe ordered the calamari and meatballs appetizer; both of which were addicting. \nWe shared the Forno Rosso pizza. Although it seemed as though we waited forever for it between courses... It was Supercalifragilisticexpialidocious. \nWe would definitely come back.", "author": "Victoria A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-03", "description": "Perhaps this was an off night....dinner started ok and then slid downhill. I ordered a Pilsner and they were out of all of them except for their top tier that was substantially more expensive. Ordered meatballs for an appetizer. They were good. Not fantastic but ok. We got delicious bread but no balsamic vinegar to go with the olive oil. I ordered the tortellini with mushrooms in cream ssuce. After waiting for almost an hour I received a bowl of mushrooms with a scattering of tortellini and a dollop of cream sauce in a tiny bowl. My partner ordered the roasted chicken which arrived dry and under seasoned. We skipped desert. I was still terribly hungry so we stopped by 5 Guys on the way back to our hotel.", "author": "Steve D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "We ordered on grubhub for pickup. Food was ready within 10 minutes, pickup was easy and fast. The calamari is really good and cooked perfectly, I don't like the marinara that comes with it though, it makes it too salty to eat. As for the pizza we did the create your own for mozz, spicy salami, and Italian sausage it was really good.", "author": "Richelle J."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}