{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "pizza was very good, I thought some thing was missing, so I asked for some garlic, which they bought me some fresh garlic shaved paper thin, and after adding, it was the bomb! didn't have heiniken, but the pizza is well worth it.", "author": "Eric G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-28", "description": "It's was truly amazing Experience to try real Pizza, , real meatballs, delicious pasta  this place is great experience for southern man, Because we don't have this type of pizza where I am  from, Atlanta GA.  Their quality of food saying a lot about this place,Founder of Forno Rosso  is truly taking care of his Clientele, its Obvious, Quality, Atmosphere, Staff, and Artistic Presentation . Its all gives a great vibe.. Will be back, and definitely will be regular . Recommend to all ,  who is up to try Real PIZZA, PASTA, and taste of Italy ....", "author": "SnakeBite K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-23", "description": "This place is outstanding, best pizza I've had in a long time... If you're going to try a pizza .. go for the truffle pizza... It's mushroom amazingness!! The atmosphere has a very chill vibe, even our waiter was down to earth and friendly.. he walked us to the exit and opened the door for us as we left. To sum it all up... I would recommend this place to anyone.. it's a cute restaurant. Perfect for a spontaneous date night.. and they even have brunch!!! which I am looking forward to trying one of these days..", "author": "Gabriella J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-01", "description": "I really wanted to love this place since there aren't many options in the neighborhood. The first time wasn't bad but not great. We ordered the calzone and Marinara pie. it wasn't bad so we decided to try it again a few days later. I will never come back. We ordered the same items as before and it was inedible. The calzone was soggy and the marinara pie had no taste. There are a lot of other pizza  places around. We do live in Brooklyn. I also found the menu to be redundant and the service was a mess.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "Absolutely great place to go to in Brooklyn. The staff was really attentive and very friendly. The appetizer, main course, and dessert were all great ! You can guarantee I'm coming back here again next time I'm in Brooklyn!", "author": "Shawn A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "We read the reviews and tried it.  It's ok, or good.  Not great.  The waiter was managing.  The girl who bussed wandered well, but needed to be told to fill water glasses even though she carried the pitcher around.  The pizza is good.  Not great, but well prepared.  It's not cheap for what you get, but ok.", "author": "Viv A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Really great pizza and the price is right! So excited this place opened in the neighborhood. BYO (for now) is a bonus especially with Wright \u0026 Goebel across the street. Super friendly wait staff. Can't want to go back.", "author": "Andrea M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "Love this place.  Really good pizza, nice atmosphere and friendly staff.  I'm a creature of habit, so I've had the margherita maybe 6 times.. it's excellent (I know, I need to branch out)\n\nThey just started brunch service with $5 cocktails and a nice variety of dishes.  You can order on the brunch menu or their regular, which is pretty awesome.", "author": "Mel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "I went to this Neapolitan pizza place recently. The chef and the owner are both Italian , not Italian American, which is a promising sign when it comes to Neapolitan pizza. The pizza itself was a little thinner then the upscale Neapolitan wood-fired pizzas of Manhattan. The pie itself was a little salty however the tomatoes were fresh and sweet. I had the Regina Margherita which features buffalo mozzarella. This pie was very good although I cannot say it was 5 stars. I will be returning to sample other items from the menu. Overall, this is a good option for Brooklyn and it's close to the courts as well as the rest of downtown Brooklyn.", "author": "Nick A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Been here many times for lunch and dinner, with just 2 or larger parties of 6 people. And everytime this place is great! The pizzas are great, and its nice that they are smaller so you can share. Pasta dishes are great and they have many gluten free options which is always wonderful because it's gluten free and you can't taste the differnece.\n\nWould highly recommend.", "author": "Mia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Forno Rosso exceeded my expectations of an Italian joint. The pizza I ordered had ricotta cheese stuffed in the crust surprising my taste buds. The service was excellent. The staff is very attentive and accommodating.", "author": "A K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-05", "description": "Correct me if I'm wrong, margherita pizza has basil, yes? Supposed to resemble the Italian flag, or something like that? As photos suggest, any pizza here has at most one piece of basil for the whole pie. The pizza came out droopy. Droopy as in the sauce and the little amount of cheese on top just slides off the crust when you pick up a slice. Thin crust but not crispy. I probably would've preferred a thicker crust so that I could pick up the sauce that fell off.\nAlso got the carpaccio. It's ok I guess, but be warned you won't get much for the $14 you're paying. The meat is cut so thin, one might even call it a paste. \nI wouldn't travel more than 1 block to come here, but if you want pizza I guess this is the only place within a 5 block radius. Most customers are locals, bringing their kids to just hang out. Would not recommend for dates.", "author": "Jackie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-19", "description": "Convenient. It's right next door to my place. The pizza has great ingredients but I'm not too in love with the dough.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Simply the best pizza you can ever get and very reasonable prices definitely will be back  amazing place service was amazing as well food came out pretty fast", "author": "Johnny P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "Great service, authentic atmosphere, quick. Take out as well, though when I go to pick up I always get jealous of the people dining in. Such a necessary addition to the neighborhood.", "author": "Erin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "It has a cozy atmosphere with a thin crust pizza. Octopus salad, pizza Bolognese and Montanara deep fried pizza are highly recommended. Both service (above average) and meals (smaller than average) are European style.", "author": "Alper E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "Great place to go have a delicious plate of pasta, refreshing cocktail, and to get some work done all at once! The TAGLIOLINI AL NERO DI SEPPIA CON GAMBERI E SALSA AL BRANDY (yes I had to google this) was delicious and yes I finished every bite! Good service too.", "author": "Theresa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "Wonderful pizza, excellently prepared.  I had the Truffle special pizza called the Tartufatta.   It was decadent and I would easily return the next time I am back in the area.  It is worth the trip!", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-13", "description": "First time eating here. The pizza was kind of terrible. Fell apart as soon as you lifted it and the bottom was burnt. I mean....you are in NY and you can't get a pizza right. Peach Belini tasted bitter like grapefruit it was better after it was redone but not the taste of a real Belini. Pasta was good but nothing amazing. I'm sure NY has better options I wouldn't waist my time here.", "author": "Frankie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "I took 2 pizza to go yesterday night. I cannot believe how good they were. I am italian and this is the best pizza i ever had in NY. Great ingredients. The margherita with eggplant and the regina with bufala were simply amazing. Thank you i am so happy to have this close to my house. Will go back soon.", "author": "Asia S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}