{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "Solid pizza! My mind wasn't blown, but it was good. The house Bloody Mary was a bit watery, but overall had good flavor. Now to the pizza we got the truffle cream pizza and a diavola, they were both very good. The crust was light and both pizzas were cooked to perfection. Again not the best pizza I've ever had but the wait staff is super nice so I gave it four stars.", "author": "Sumit B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "10 stars of available. New place - amazing wood cooked pizza, the way it is made in Europe and the pasta - oh the pasta!!! Happened to be in the area for lunch and stopped in. Great service, good pricing, wonderful food. \nHighly recommend.", "author": "Steve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "This is a great little place.... The only thing is the drinks are a little overpriced in my opinion. $4.00 iced tea (nothing special)... But the food is very reasonably priced... So it seems a little out of balance. However I would recommend and they have a decent size bar to sit at if you are alone. Very convenient for the residences close by as well.", "author": "Ian W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Had dinner last night with an old friend and a loved one. We had truffle cream pizza and the pasta. Was wonderful. Special shots of lemoncello. Great modern atmosphere. Sweet helpful staff. I had a great time. World class", "author": "Bob P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Wonderful decor and staff service. We enjoyed the visible pizza oven on the back, powered by all the wood decorating the main room. Great calamari, lasagne, bolognese, and margherita pizza. Giovanni, one of the managers, even brought our little girl a complementary Nutella dessert that was bigger than her and delicious!", "author": "Mark J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "I have to this is one of the best Italian restaurants I've been to.  The service was on point and the food was cooked to perfection.  I love the Avocado Gamberetti salad.  Their pizza is delicious.  Very friendly staff.  Will definitely be back.", "author": "Claudy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-17", "description": "The wait staff moves pretty slow although they are really friendly. I got a calzone which was a huge portion but the inside was still cold when I got my calzone and the top part of the dough was still not cooked because it wasn't in the oven long enough. The flavors were there but it wasn't baked properly cause it was thick. Would definitely recommend just a pizza. Prices are a tad bit on the high side for Brooklyn and Italian food.", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Brick oven pizza perfectly charred topped with fresh ingredients. Love that place, and food.", "author": "Oleg S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "Just had the meatballs here. It was fantastic! Awesome atmosphere, nice, open and airy. Definitely will go again. Also, owner's are awesome!", "author": "William K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "Forget the pizza---which btw is still really good!  The guys in the kitchen are beginning to shine now with daily and weekly specials! This place is getting truly special with its fresh ingredients and wonderful array of dishes!  The wait staff is also very attentive and completes this magical experience that lives day on and day in!  Kudos to the owners, will wait for the brunch menu!!!\n\nMy only negative review is that I wish we had real cloth napkins instead of paper! Otherwise the bar is fully operational and flowing!", "author": "Jj L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Found this nice little restaurant walking to the subway from our hotel. Good food and Great service!  Thank you to our server Luca!    Very attentive and even gave us each a lemoncello with our dessert! We highly recommend it!", "author": "Cristina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "Stopped in there for the first time this afternoon after reading so many positive reviews on Yelp.  Had their signature Tartufata Pizza (mozzarella, mushrooms, truffle cream sauce, truffle oil, shaved parmigiana reggiano).   Seriously, this was among the best pizza's I've ever had. A+!  The crust was beyond delicious.  Perfect!   Burnt just enough.    Oh, yea.  I'll be back often.  Do yourself a favor, and get on a train or a bus or a plane and try it.  You'll be telling your grandkids.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-12", "description": "Worst delivery method ever. Twice now we have called ahead to pick-up since we live right by it and have been told they can only put the pizza in once you're at the restaurant. But then they make you wait for 20 minutes while your pizza is made. \n\nAnd the pizza is ok.", "author": "Terena D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "This gem was started by chef Giuseppe Marrone, from Naples, where they are known to be master pizza crafters. Here at Forno Rosso, the very traditional Neapolitan style pies typically have an almost spongy but chewy, wood oven charred crusts strong enough to hold their gooey centers, courtesy of the subtle buffalo-milk mozzarella Forno Rosso imports from Italy. Antonio, the manager, pointed out that their sauce is made in house and you can tell. Topped with basil and extra-virgin olive oil, their Margarita is a winner but the pasty sauce on the fried and baked Montanara is perfection. Of all the pizzas now in NYC, this is now the top spot holder.", "author": "DaLordzPrince I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Great \"almost hidden\" gem in downtown Brooklyn/Fort Greene. I have been living in the area for 3 years and somehow just discovered this great spot. They have delicious pasta, pizza, meat dishes among many others. The prices are reasonable and the service was great. This place will definitely be added to my rotation.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "My only real criticism was the timing of the meal - which is a big thing. They weren't very busy, and sometimes that is the kiss of death for your meal because the timing gets screwed up. This is no exaggeration - I got my glass of wine, the bread for the table, our appetizer and our pizza placed on the table all at the same time, and within 5 minutes of ordering. That's not a pleasant dining experience. First, I didn't get to enjoy my wine with a little bread and lentils before the meal. Second, I didn't get to enjoy the appetizer because I had to rush through it so my pizza didn't get cold. There was no chill time to visit with your dining partner.  Then our server was at our table asking how everything was, but clearly we hadn't had the first bite yet. Here's another restaurant etiquette problem - you should never remove someone's plate from the table while they are still chewing. It's not a good feeling for the customer. It feels rushed, and you can't enjoy your experience. Well, after getting the meal in ultra speedy fashion, our server disappeared and we were stranded another 25 minutes waiting for the check. Good thing I didn't want another glass of wine! Another thing that sort of spoils the experience for the customer is when the owners or managers are doing business at one of the tables - paperwork, accounting, etc. That should all be back of house and out of the customer's view because it spoils the experience to some degree. Now for the food and ambiance: bruschetta was very good - perfectly ripe tomatoes had been marinated in garlic oil and then topped onto a nicely crusted Italian bread. Margarita pizza followed - very solid! If you're not familiar with Neopolitan style, you might think the crust is soggy if you get take out. It's not a great crust for sitting around awhile. But when you get it fresh out of the oven - yummy! Nicely chewy and bubbly, great marinara, great cheese. Only thing I would criticize is that I prefer the basil placed on the pizza after it comes out of the oven so the basil doesn't burn. Also, there was not enough basil on it. Ambiance is cool - good place to take guests or a date. I would definitely return here and try some other offerings, but I would take charge of the timing myself and not give my whole order.", "author": "Jaja B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Lovely ambiance, delicious food and friendly service! Try the grilled octopus and shishito peppers!!", "author": "Elise V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "Absolutely delicious pizza! Probably the best pizza I've had (and I love pizza). Calamari was pretty good but the pizza was the star. I asked for a sweet red wine, which they didn't have, so I'm not too sure about it being \"a wine bar\". But is a very nice pizzeria with a bar.", "author": "Melissa V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "My first time trying Actual NY pizza and this place is bomb!!!! 5 stars!! Definitely recommend and the bartender Pedro shows a lot of hospitality and is attentive! Thank you Pedro! Will be back for sure:)", "author": "Stephanie Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Walked around Brooklyn aimlessly and stumbled upon this place. Not around too many, if any, restaurants and looked very out of place. However, the atmosphere was very nice once we stepped in. \n\nOrdered a pie and bloody mary for lunch thinking that it would be more than enough to fill me up. Well, it didn't fill me up, but the pizza was very good. Nothing special about the bloody mary, but still good. The bread you get as an appetizer would have been better if it has been served warm. The olive oil and lentils that came with the bread was very good as well. \n\nDon't know if i'll make the trek out to Forno Rosso again only because it was so far removed from everything else.", "author": "Sho Y."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}