{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "Feeling great tonight.  Good to be back in my old neighborhood spot.  They make a mean negroni.  And though I didn't eat this time around, I know their pizzas a", "author": "Matthew W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-03", "description": "Horrible service!!!!!! Bad attitude by bartender \u0026 when I asked for manager they pointed him out \u0026 they told him I wanted to talk to him \u0026 he never came obviously he didn't care as well it's unbelievable! There are great restaurants in the area that I would rather go to!!", "author": "Mina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "Hands down my favorite Italian place.  The food is delicious and very authentic.  The ambiance and decor is beautiful, it has such a classic Brooklyn vibe.  They have a fully stocked bar with a nice variety of beers on tap as well.  The Staff are super friendly and very accommodating.  The menu also includes Vegan and Gluten free options which is always nice.", "author": "Larissa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "They have great branzino, one of the best I had so far in general, great fettuccine bolognese, and great desserts. Fabio is such a sweetheart and so kind. I love the ambiance, will recommend everyone.", "author": "Damla C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "It's like the corner joint you go to all the time...not because it's great, but because it's close. Service was very good...atmosphere is good...food is ok. Not bad...but average. My meatballs were too salty (and I've never met a meatball I didn't like!!!), and my pizza was soggy and undercooked. I'll definitely go back...but I had higher expectations.", "author": "Brett M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "I don't understand this restaurant's current rating. \n\nOur pizza was way underdone, it was super doughy and floppy. The Caesar salad was sweet (with that unmistakable grocery store dressing taste) and dripping in that disgusting dressing. The meatballs were ok - a little gamey for my taste (do they put liver in them?). \n\nThe bread with lentils in olive oil was wonderful and the service was lovely.", "author": "Chaka K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "The pizza is the closest to real Italian we have had in this country. The signature cocktails are inspired and the bruschetta is a must, so fresh and flavorful! So good we came back a second night in a row because it was so close to our hotel!", "author": "Courtney S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "OMG. Incredible food/ great service/ friendly staff. The absolute hit though was the ravioli. Best i have ever had. Not just a great place to eat in downtown BK, i would dine here from other parts of NYC.", "author": "O K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "What a great place to stop and have some really delicious, very Italian style pizza, this is the place. Great atmosphere and a nice menu; Not overwhelming with to many options. The staff were wonderful. Definitely a shout out to Lee! She did a great job and was very helpful and had a lot of suggestions on things to try at the restaurant as well as in the area. Will most certified return if I find myself back in Brooklyn.", "author": "Tony W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Made my own pizza: ricotta, arugula, and shrimp, which was really good. The wait staff was attentive and friendly. Would definitely come back.", "author": "Erhardt G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Great atmosphere.  The burrata and tomato salad is plain awesome - the mozzarella is so fresh!  I just ordered the Forno Rosso Pizza - it's coming out any minute now...Tick tock..and there it is!  What I love is the stuffed crust.  Great flavor and the crust is slightly crisp and slightly chewy.  I got a side of marinara just because I love sauce.  Enjoy.", "author": "Tim S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-22", "description": "4 1/2 stars for service. Main dishes were pretty good. Pizza gets 1 star for soggy crust.The view of the oven is nice but the pizza should be crisp. Have been eating Brooklyn pizza for 40 years. This was expensive and tasted like a supermarket pizza or worse. Can't believe the reviews saying the pizza was great. Obviously some other yelpers agree the pizza is bad.", "author": "J L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-29", "description": "I am new to the area and stopped by to check it out and get an espresso.  I enjoyed the atmosphere and my double espresso, but then I got punched in the face when I got the bill $5.45 for espresso...come on!!!!  It's downtown Brooklyn not Venice, Italy.  I seriously asked the bartender 3 times, if he was sure that its $5.45 for a double espresso.", "author": "Gio B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-15", "description": "Very nice looking Resturant. The Servers were friendly. Now, the best food item we had was the bread. Delicious!!! The green salad was good but needed more salad dressing, pears and nuts... The pork shank needed more seasoning and had been pre-cooked and warmed prior to serving therefore making it very dry!!!  Now to my dish -- I had what I thought was a simple and traditional Italian dish -- lasagne!!! Really, it was warmed over and served to me cold!!! You draw your own conclusions whether you want to give this place a try. Pricy for the quality of the final dishes. Very disappointing. The manager did offer an apology and a mixed drink or dessert. It was interesting so I will leave it at that.", "author": "Janita M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "recently moved into the neighborhood... i have to say brooklyn foods are hit and miss. so happy to have found this place! this place is a hit!", "author": "Lola S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "This place has a great happy hour (at least when we were there). They had a good selection of pizzas for half off (!) with at least one of them being a specialty, in addition to having cheaper beer and wine. The happy hour is 6-7pm for sure and possibly earlier too. The exact deal might change depending on the exact time you go. Also, their website does not mention having the pizzas half off during happy hour, but we had this when we went.\n\nI've also gone not on happy hour and it was still worthwhile for the fancier dishes. While not cheap, the portions are generous and very tasty. I do have a criticism that the pizzas can be a bit soggy in the middle. I still think they are very good but short of perfection (or at least not quite as good as Juliana's on the pizza front.)", "author": "Aliz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Oh My God. Yummy in my tummy! I'm not living in nyc anymore, but I would come back there and recommend to everyone to go there. Super cool place and nice waiters. I was with my parents and they loved it there too!", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-20", "description": "When a pizzeria sends burnt pizza to the table somethings not right. Both my Margherita Regina and my wife's Broccoletti e Prosciutto Pizza Bianca were burnt on the bottom and the crusts.  We mentioned  it to the busgirl as she cleared the table, she said she would find out if that is the way they serve pizza here. Never heard back, our waiter didn't inquire when half the pizzas were left on the plates. My fingers still had black char on them as we left the place. Why have a wood fire oven for pizza, if your pizzaiolo doesn't know how to cook with it. Clearly they just don't care. I'll never go back.", "author": "Marv S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-21", "description": "My fiancé and I stumbled upon Forno Rosso due to its proximity to our hotel and it did not disappoint! From the ambiance (love repurposed sites!) to the bread to the pizza to the free house cocktails (thanks to help!) to the great customer service! Definitely will be coming back next time I am in Brooklyn!!", "author": "Kendra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "Best Italian in Brooklyn. Food is amazing and drinks are strong. If here for a nets game or just visiting, don't waste your time anywhere else. Cheers!", "author": "David V."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}