{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-20", "description": "I tried this place out when I first moved to town and ordered the pizza. I was not impressed at all with the pizza or the size of it for the price. I decided to give this place a second try by trying some of the meals on the menu. There is where I as much more impressed. I shared two appetizers and an entrée with my bf. All three choices were delicious. My only other complaint was again the portion size. You really cant even share your entrée because the portion is small. If I am looking for a good Italian spot but not starving I would definitely give this place  try again. The ambiance at night is also pretty nice.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Came here for the first time last Friday and had the meatballs and a couple of pizzas for the three of us. The server, Clarissa, was super helpful and sweet. Delicious food and great service! Next time we'll try the pasta dishes which looked ridiculously good!", "author": "Chayenne E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "I can't say enough about this place, top to bottom. From Amanda at the front door to Pedro at the bar, and Mai working the floor, amazing staff, friendly and professional. Do yourself a favor and stop by!", "author": "Greg F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-03", "description": "I usually don't write reviews and I have to admit that I am writing this because I am upset right now but..... I truly feel that I need to explain this experience that I just had. I ordered two pizzas thru seamless and received a time of delivery between 6:40-6:50pm. I ordered the pizzas for my twin boys and did not receive my food on time, not even a few minutes late. I called more than 4 times and still no pizza. Mind you I live only two blocks away. It is now 7:27pm, my boys needed to eat more than 30 minutes ago and still no pizza. I am a regular patron and now, I am so disappointed and annoyed that I don't know if it's worth the aggravation. Off to making the boys some home made pasta....", "author": "Caroline P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "I went to Forno Rosso yesterday with my husband and it was mildly busy. We ordered the branzino and the lasagna and our server Oscar was kind enough to inform us of the longer wait for those two items so we added an appetizer. He also gave us a suggestion for wine which me and my husband liked. The entrees were delicious but took quite a while. Good food. Great service!! We will be returning.", "author": "Melissa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "Went there on a date with my husband last night. On most dates, we discuss work, home, politics, etc. On this date, all we spoke about was how amazing the food was! Everything, and I mean EVERYTHING was so flavorful and perfect! We started off with the Eggplant Parmigiano and Baby Artichoke salad. Both were extremely fresh and delicious! The eggplant was baked to perfection. Not too mushy or too tough. All the ingredients were perfectly balanced. The artichoke salad? Divine! Who would have thought that avacado and basil pesto balance the tartness of artichokes so well?! We then had pizzas. I had the Gateux (?) and my husband had the Margherita with the San Marzano sauce. (The dough, we found out doesn't contain any yeast.) Both were so perfectly cooked and flavored! For dessert, we shared the mojito infused Panna Cotta. It was UNBELIEVABLE! Mint in every bite! So fresh and so prefect! I honestly don't know the last time I tasted food that was so delicious, from start to finish.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-11", "description": "The place decor is awesome, I think food can be A bit better l, customer service is ok. Food and customer service not to brag about.", "author": "Cary C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "Seriosly one of the best pizzas I have ever tasted.  I'm from Chicago and was not expecting this at all. Totally recommend it!", "author": "Norma D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "Awesome place. Walked in for an impromptu dinner. Excellent service and the food was great. Can't ask for more..", "author": "Neoindie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Forno Rosso is my neighborhood favorite. Authentic Neapolitan menu and cozy atmosphere.  The staff is always friendly and the service is great. The pizza diavola is one of my favorites. The restaurant is great for happy hour, dinner or brunch with friends, or date night.", "author": "Jason A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-30", "description": "The service was great, except for one thing.  I ordered iced tea, and since the glass was full of ice I got 2 refills.  When the bill came, I was charged for 3 iced teas, because refills are not free.  Soda refills are free but not iced tea.  Just ridiculous, and I  think the server should have pointed it out when I ordered.  I've never been to a restaurant that charged for iced tea refills, I didn't even get a new glass each time.  I won't go back to a place so cheap they charge $4 for each iced tea.  Kind of ruined if I thought the food was ok, no food is so good that they deserve 4 per REFILLED  glass of tea. Luckily Brooklyn has so many great places to eat , never going back to forno", "author": "Linda T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-20", "description": "The pizza crust was so soggy couldn't pick it up, sent it back for a few minutes in the oven, came back the same.  The other tables pasta looked ok, the kale ceaser was good.  It was a freezing night and we picked this place for the short walk, next time we''ll walk farther.", "author": "Marc P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "My friend and I had wonderful experience here. The place has very high ceilings with cool Brooklyn style of decorations. Staff are very friendly and attentive. Food was so fresh. For drinks I ordered Milano - it looks like tiramisu but its cocktail, absolutely recommend it.", "author": "Priscilla S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "Authentic Italian food, very delicious pizza and the (Coccole con nutella) dessert was the best went there with a friend we both loved it, service was excellent and the staff were super friendly.", "author": "Maisan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Wonderful service and ambiance. The food was delicious. Perfect for happy hour or a dinner date!", "author": "Noor J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "I live in the neighborhood and go there quite often. My family and friends have had various pizzas which we always enjoy, but the salads ( INSALATA DI CARCIOFINI, AVOCADO \u0026 PARMIGIANO REGGIANO especially) and the arugula salad are my favorite appetizers and love the lasagna and fettuccine bolognese. The waiters are always friendly and attentive. There is also just the right amount of noise level.", "author": "Vicki S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "First time eating in Brooklyn and stumbled on this pizza spot. Ordered the tomato and burrata and the signature pizza. Exceeded my expectation and loved the thin crust. Would definitely come back. Good service as well. Dessert looks good so will try it out next", "author": "Diana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "I'm not one to write reviews but this place is sooooo good! I lived in Brooklyn for 10 years and never head of it. I recently moved to the SW but every time I'm back in Brooklyn for work I come back here. Been 2 nights in a row now and can't get enough of it. Did a pizza with artichoke and ham 1st night amazing. Tonight I did a mushroom white pie and I can't believe how good it is. Not in the top nyc pizza place lists but it really should be it's amazing", "author": "Dylan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Great food, pizza was delicious. I highly recommend u try it as I was plan to come again in he near future", "author": "shawn g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "I can't write enough about this restaurant. Genuine, authentic, delicious Italian. I always go for the pasta, the fettuccine and the ravioli are crazy good. The tiramisu is fresh, delicious and the best way to end the meal. The atmosphere is also great. Every Time I come in im treated like family. Ill be coming here regularly, def one of my best spots in Brooklyn.", "author": "Nabegh A."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}