{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "This place is amazing. It's really all about the food and the food is outstanding and authentic and fresh and prices are reasonable. I've been to many restaurants and never went back, but I will most definitely return back here.", "author": "Mental O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "This place is hands down my favorite place in DoBro to get authentic Italian pizza! The fried pizza is my personal favorite. Every time I go there the service is quick and the staff are always pleasant. Thanks for the great service, Fabio!", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Tried the beef fettuccini it was good wished I would've tried the ravioli with truffle. My wife got that one and it was amazing! When we go back I'll be sure to visit this place again! Servers were super friendly.", "author": "Jesus A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Italian from scratch done really well.  The fresh burrata, margherita pizza,  and branzino were all delicious.  The calamari is even on the happy hour menu!!! Rustic and comfortable dining room,  and our food came out piping hot and super fast.  I'll definitely be back for wine and food!", "author": "Kimberly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "A really enjoyable evening spent at this Brooklyn gem!  The REAL Neapolitan pizza was absolutely delicious!  I also enjoyed the Cavetelli with Short Rib Ragù special...it was spectacular.  It's a big, beautiful space with a spacious bar with great beer on tap.  The menu is simple, straightforward, and above all, delicious.  Do yourself a favor and check it out!", "author": "Anthony S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "I've been here for several birthdays.\n\nIf you're going on the weekend or later on in the day, I recommend making a reservation. I haven't seen it get filled to the brim but it'll make getting a table easier for you, especially if you're in a larger group. It's not a huge restaurant.\n\nIf you're not driving or taking a cab, you're going to have to walk a few blocks for the train. It can be easy to get lost as well since it's not on a main avenue.\n\nThe pizza portions are expected for a nice restaurant (smaller than your average pizza pie from a corner shop). But it's great either way. The actual plates of food are delicious. I recommend their lasagna, mushroom pasta, and gnocchi.\n\nThe staff is pretty fast and friendly.\n\nAll in all, try Forno Rosso out.", "author": "Emily V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "We had Frank's pasta and the ink tagliolini, both are tasty. Very good espresso, too. Friendly service! Would recommend it.", "author": "Yi Yin W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-26", "description": "Came in with a group of five. The look of the restaurant is very open and spacious. The pizza ovens are visible from the dining room which is a nice touch to the open kitchen. \n\nWe had a salad, 2 appetizers and 3 pizzas. Quite frankly I do not know what the hype is all about. \n\nThe fried calamari was incredibly salty. The bolognese pizza was the best of the bunch, but not good enough to want to make a return trip. \n\nIs the food solid, sure. But that is where I would leave it. I would not be opposed to coming back, however, I also will not be recommending it either. \n\nWith so many great restaurants in the area, I am quite frankly shocked that this place is as popular and recommended as it is.", "author": "Lloyd R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Hidden gem in downtown BK. Warm, rustic, modern Italian atmosphere. Great \u0026 welcoming service. Most importantly... Incredible food", "author": "Sean M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-26", "description": "Pizza crust is super fluffy and pillowy. Not enough char and crispness on the bottom as a result, but some people love the softer style. Sauce was a bit too heavy handed and also too much tomato sauce instead of fresh tomatoes -- made it a little sweet and too heavy for the fluffiness of the crust. Cheese is decent, nothing amazing. Needs more basil.\n\nService is prompt and friendly. Something about the service feels like a chain restaurant though, but it is a pretty large restaurant for NY standards. The inside also feels kinda more like production NY rather than authentic old school joints.\n\nDecent but there are better pizzas to be had in the pizza mecca of America.", "author": "Latef X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "A great dinner. We were in Brooklyn for the day and at the Brooklyn flea market. The lines for pizza at the waterfront in dumbo are insane and so we looked into Yelp. A short taxi ride later, here we were. Very comfortable, light and airy place that I can imagine becomes really cool and inviting at night. The wait staff was wonderful. We were there with our 4 and 7 year olds and the wait staff were so friendly and accommodating. \n\nAnd then the food was really good. The pizza was light and delicious and the kids absolutely loved their pasta bolognese. \n\nDefinitely worth it if you are in the dumbo neighbourhood.", "author": "Erika T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Eduardo and Jeffrey our server and runner were SUPER amazing. I don't want to say TOO many good things because this gem may disappear, but service was unmatched and we had a wonderful time. $20 bottomless Pizza + $15 bottomless champagne is unbeatable. Love this place so so so much. It's not a weekend without PIZZA BRUNCH.", "author": "Caitlin R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-06", "description": "Do not do pickup here. I ordered the Sicilian pizza with kale salad. What I got was not Sicilian but cheese pizza, there was no mozzarella, three squared pieces of eggplant, and they didn't even have any basil on it.  Kale Salad was not what I expected for the price, got scraps of parmigiano. Definitely will not be back. Was disappointed, because as I was waiting for my order my co-workers and I were talking about potentially having lunch as a team. I will say the gentleman that helped us was very attentive, and was probably the only reason why I didn't ask for refund right then.", "author": "Pasang L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "We've passed by Forno Rossi several time and decided to stop by for dinner there today. As an appetizer we had the calamari with spicy tomato sauce. It is as excellent as were our main courses and desserts. I had the tortellini for my main course and it was really good. \n\nThe portions are sizable so make sure you are fairly hungry before you go ahead and order a bunch of stuff. \n\nThe service was quite good, the food came out to us fairly quickly. There were a couple of things that were off, but that's just me being picky. I didn't have any utensils or napkins at my place and had to ask for it. They were also pretty eager to remove our dishes.\n\nThe place itself is fairly spacious and has a decent amount of seating, they have a spacious bar area.\n\nI'll definitely be stopping by here again in the near future.", "author": "Subodh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Here on business staying at nearby Hampton Inn, highly recommended by the front desk staff. First visit with 5 people, second visit solo. Atmosphere is cool and hip, kind of urban bar vibe with long bench seating as well as 4-tops. Music is a bit too loud for a business crowd to have a group conversation - they could tone it down a bit at least during business hours. Service is pretty good though not as attentive as one might think - very pleasant though. Food was excellent - big fan of bolognese so I had the pasta bolognese the first night substituting penne for fettuccine which they were happy to do. Had pizza bolognese the second visit which was also excellent though could have been cooked a bit longer- otherwise delicious. Bruschetta was a star appetizer with our group given the large rich tomatoes spread on top. The only negative was the horrid bathroom - shared stalls and not clean -I opened a stall door to startle a poor young lady doing her business. Not well marked and not very clean - both easy fixes. Giving 5-stars for the food though others might deduct a star for the loud noise, inconsistent service, and challenged bathroom.", "author": "Garry W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-11", "description": "We ordered delivery for dinner last night from forno Rosso. As I am trying to be on the healthier side we ordered the kale Caesar salad and the amalfi salad a truffle pizza and a margarita. The salads are about $15 a piece and if you want shrimp or salmon it's and extra $6 /$10 respectively. I personally had the amalfi with shrimp. I was overall not taken aback by the salad it was nothing special especially for $18. The pizza was very good tasty and fresh ingredients however my thoughts are that you should put the same time and consideration into all of your menu items. I think if I was only having the pizza I would have had a different experience because it was great. We also ordered the black ink taglioni which was great.", "author": "Lucy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Should have reviewed this a year ago but got lazy. Now we are talking about a trip back to New York and all I can think about is going back here. We went there our first night in town and it was perfect!  We are from a smaller town and were nervous about the \"big city\" this place was amazing! Service was great food was delicious!  In fact we went to a famous chef restaurant in Manhattan one night and it was so loud and crazy we ate our appetizers and then went back to the hotel room and ordered take from here. Can't wait to eat there again!! Worth a plane ride from Cali just to eat here.", "author": "Carly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "I don't usually eat Pizza for dinner cuz in my impression, Pizza has always been greasy, heavy and unhealthy. But Forno Rosso has changed my mind. The pizza was simply simply delicious! Whatever Pizza I got, the cheese, basil, tomato sauce blend in perfectly together. My favorite are the Siciliana - simple cheese, basil, tomato sauce, as well as pizza with potato croquette and salami (don't think it is on the menu any more). The crust is another highlight - so so chewy. \n\nI have dined in once and did pick up a couple times (since I don't live afar). The decor is very nice and ambience is perfect for a nice casual dinner date. Take out service is also very quick - after I call to order, within 10 minutes, the food is ready and I can walk down to pick up. Efficient!\n\nThe price is also reasonable - with $15-20 you get a whole big pizza which can feed almost 2 people. You can also add toppings as you wish - veggie and seafood are both $1 and meat is around $3.\n\nAlso don't forget to check in on Yelp when you are there! You get a free house cocktail. Booze and enjoy pizza!", "author": "Shen Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Really fun industrial vibe!  Everything was delicious!We went here after running a half marathon and it was perfect late Sunday brunch.  \n\nBottomless mimosas for $15!! \n\nThe bread with olive oil \u0026 lentils was the perfect starter.  I ordered the pasta with eggplant and it was delicious.  My friends both ordered pizza and really liked it.  The donuts with Nutella were amazing and definitely enough to share for the table.  \n\nHighly recommend!", "author": "Cara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "I came on 10/27 with my friends and we walked in and were seated right away. The place is really cute for a date night or to gather with a couple of friends! My waiter for the night was Carlos and he was so friendly and so accommodating to my friends and I. The staff in general were just super nice and very welcoming. My friends and I ordered the Margherita and Siciliana, the food was very good! I will definitely be back again due to the service and the food! Thanks Carlos for being so nice to my friends and I!", "author": "Mary Y."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}