{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-11", "description": "Carlos is amazing... so sad to hear that he's leaving. He's always smiling and giving a wonderful dining experience. He was one of the highlights of Forno. Best of luck!!! \n\nThe Ravioli and the calamari are my favorites!! In the four years of getting the same thing, almost every time, they have never disappointed.", "author": "Dai A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-20", "description": "The wait staff is great, but that's about all.\n\nYou know that middle-class-fancy restaurant you sometimes go to when you're back home visiting your parents? The place with the cheesy faux-Italian name, where everything has that \"possibly microwaved\" vibe to it? That's this place. If you're looking at the prices and the photos of the food and wondering if it's too good to be true, it is.", "author": "Stephen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "Solid spot for happy hour - the usual drink specials but the food specials are an incredible value and so delicious. The pizza and pasta are both very fresh, with generous sizes being served even for happy hour. The Diavola pizza is my favorite.\n\nThe ambiance here is also really nice. It's surprisingly spacious and bright, with a large bar area. Great for larger groups but also quite enough for intimate dates. \n\nService is quick and friendly. I can always count on Forno Rosso to grab a drink and a quick bite after work!", "author": "Margaret Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-28", "description": "We were here on a Friday night for a friend's birthday. We had reservations and were seated immediately. Our server brought out the menus and we ordered drinks. Once we decided on the food, we gave our order. The food came out very fast, we still haven't gotten our drinks at this point. So we waited sometime for our drinks and finally 3 of the drinks came out and we were waiting on one more. Food came out first, then the drinks and some more time later we got some bread on the table. Finally, at last, the bread. \n\nThe food and the drinks were delicious. We enjoyed our meals however there was no attention to our group. Although the server was seemingly friendly, he didn't give a damn and made us wait for drinks, bread and our check. Once we paid, we had to wait forever for him to bring back our cards. \n\nGood food and lovely decor.", "author": "Kawomi E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-15", "description": "Definitely the best Italian pizza I have ever had! The bar is also amazing and stylish. I finished off my meal with a few mezcal cocktails and a lemoncello! \nWould absolutely go again and bring friends. Great atmosphere!", "author": "Yvonne M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "A great neighborhood spot for both lunch and dinner. Love the bar area especially happy hour. Recommend the Tartufata and bolognese pizza along with the shrimp salad. Never a wait, quick and easy service. It's always a trusted go to!", "author": "Aly L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "The best Tiramisu and Burger hardly at all not microwavable. The servers were nice and very pleasant and attentive to my visit. I will frequent here more often.\nNicole is awesome and very sweet and caring.", "author": "Rafael A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "MORE THAN 5 stars - 1,000 stars!\n\nMy server, Ellie was tremendously amazing! She was professional, intelligent about to the menu, eccentric and on top of her section. Not to mention, the food was to die for! Love the Happy Hour here! I will for sure come back as long as I am in Ellie's section!", "author": "Brooke M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "I usually don't go out to Italian restaurants, but I've been on a roll lately due to an unusual pasta craving! Fortunately, this place is only a stone's throw from my office, so I came in for lunch two days in a row. \n\nThe first time was actually with some colleagues. I had no idea this place was here, but as soon as I walked in, I immediately knew I would return. I absolutely love the ample natural lighting and tall ceiling, the easy-to-navigate menu, and the bread basket (the bread was fresh!) \n\nI got the mushroom tagliatelle on my first visit, then the squid ink pasta with shrimp the second time around. Both dishes were good! Though I would give the edge to the squid ink pasta dish - which had fresh pasta, fresh sauce, and fresh shrimp. Everything was balanced in terms of taste and texture. The sauce was lighter than I expected! The tagliatelle dish was good too, but it came with pretty basic sliced mushrooms and the pasta was a bit tougher than I would have liked. Still a solid option, though. \n\nService was good both times. It got busy during peak lunch hour, but it wasn't too loud, so I think it's a great option for grabbing lunch/dinner with a group!", "author": "Nataly N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "A local gem with the best Italian food I've eaten outside of Italy. Has a great ambiance. Portion sizes were Italianesque.  Staff were friendly and attentive. And saving the best for last you MUST have the Coccole Con Nutella for dessert, it's to die for! If only I lived in Brooklyn 'sigh' ....", "author": "Christina B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-22", "description": "Food just not that good.  Alot of 5 star reviews from people with 2 reviews.  One review said \"best pizza I ever had.\"[I'm not sure what rock she crawled out from under].  Clearly some shill reviews here by affiliated parties.  Pizza not that great.... \"Sicilian\" pictured in a review had that nice bright white melted bufalo mozz - ours did not.  The pappardelle alfunghi was a little better but a small portion - great sauce but the noodles were not 5 star material.  The Peroni was good though!  So much good food in this city, this felt like a wasted meal.\n\nService - great!", "author": "Stu W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-20", "description": "Service was fine but confused why this place has such good reviews. The food is not good. Kale salad tasted like Kraft dressing. Same with the pasta sauces. Felt like cheap chain restaurant food.", "author": "Kristi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-21", "description": "Excellent customer service! Our waiter Eric was very attentive and incredibly friendly. He offered great recommendations and enjoyed every dish. The popular dishes we had were the rib eye steak, which we shared with the table, and the parpadelle mushroom dish with truffle oil. AMAZING! Management was always checking up on us to make sure we were pleased with our meal. Ambiance was romantic but good to have with friends as well. Would recommend and come back again!", "author": "Elysia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "I had such a great night with my husband at Forno Rosso. The food was great and the ambiance was perfect. We were so lucky to have Ellie as our server, too. She was wonderful! She suggested a perfect selection of dishes that we loved and it ended up being on of the best experiences we've had in our visit to NYC. We highly recommend this place and ask for Ellie if possible!\n\n-Ecaterina and Alex,", "author": "Ecaterina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "I never really write yelp reviews, this is my first one. They made a wonderful night for our group. We love our waitress Ellie. She's very helpful, funny. Her recommendations were amazing. \nI loved the the Gamberi and avocado salad, the shrimp was tender and flavorful. Everything was super fresh. \nWe are glad we found this place .\n \nThank you Ellie for giving us an amazing time at the restaurant!", "author": "Jun Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "Came here with my kids on Sunday, and we had such an awesome time! Food was delicious. We had pizza, meatball panini and fried calamari. Excellent coffee. One of the best Tiramisu in town. And I really enjoyed house made limoncello. Will be back!", "author": "Yan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "This is an absolutely beautiful Italian restaurant near both the Manhattan and Brooklyn Bridges. The interior is a mix of rustic and modern; it has brick walls painted over with white as well as cute posters and candles/flowers on most tables. It gives off a very romantic, cozy vibe while remaining lively during evenings. The food is great, especially the olive oil they give you with the bread (I think they infuse it with peppercorns or something like that) and the papardelle al funghi. Not to mention the great service.", "author": "Sofia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-18", "description": "Stopped by around 6 for dinner with a few friends. The place was half packed and there was no wait to get seated. The food was out fast and lived up to my expectations. I would recommend the ravioli and  squid ink pasta. The tiramisu was good and a decent size to share with another person. Service could have been a little better because we asked for a refill of our water and almost 20 minutes later we still didn't get our water and just ended up finishing up and heading out.", "author": "Sultana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-11", "description": "Forno Rosso is not too bad, a nice addition to downtown Brooklyn. Lovely interior, great for intimate dates or a close friend gathering. They have both lunch specials and happy hour deals. Pretty happy I live nearby but this is definitely a spot I come to for more date/special occasions due to the pricing. \nThe few times I have dined here I received attentive service from the waitresses.  I see on yelp that you get complimentary lentils and bread but interestingly I never received that so I cannot comment on that... and I'm kind of salty that I never got that! But onto the next...The pastas here are delicious but for the price you pay it's quite a small portion. I should also add I am obsessed with pasta so there's probably never enough pasta. Pizza is a good portion to share between two, it's kind of a slightly larger personal pie. I am a big fan of their lasagna and their ravioli. I also think the chicken entree is fantastic and the portion size is plentiful. They have different specials depending on the day and I've never regretted ordering them. Don't skip out on dessert either, it's legitttt. So delicious!", "author": "Jodie Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-09", "description": "My husband and I came here few times. The food is good. We usually like to drink aperol spritz at Italian restaurants, we tried to order it a few times since it is on their cocktail menu and unfortunately they kept giving us Campari instead of aperol and on top of that the servers will assure that it was aperol when it was not. \nI also asked for a French 75 which wasn't in the menu and the waiter didn't know what drink it was  nor bother asking the person at the bar. \n\nIf you are someone who is going for the food... go ahead. \n \nAdvice for the business : do not give customer the wrong information and pretend they do not know what they are talking about. Plus servers need to work with customers at all times, especially when the place is empty.", "author": "Loriela G."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}