{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Really nice restaurant, I like the lighting and set-up. Food is delicious and the waiter was very welcoming (especially Luca)", "author": "Saskia T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-07", "description": "So it's my birthday right? I want Italian food so I hit up yelp for some assistance on picking a spot.\n\n1) this lying reviews has to stop, you guys obviously don't know what authentic Italian food is.\n\n2) the whole time I was there for dinner with me and my gf were being rushed out of the restaurant by a few bozo managers. they tried to take both our appetizer plates when we clearly weren't finished, and constantly asked when we were going to order our entree. They were rushing us out at one point. 3 staff members were at my table asking me if I was done at the same time. WTF? Back off!\n\n3) pasta taste like can ravioli, worst pasta I ever had !! pizza was flimsy and not cooked all the way through and NOT cooked in the brick oven. Didn't see one pizza go in or out of the oven all night! cocktails were not impressive as well as the wine (which is only served in a water glass unless you get a bottle, unacceptable). \n\nRobbed!!  \nNever going back.", "author": "Nada O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "Pizza is pretty good and the service is fast and nice.\nThe tiramisu is the best I've ever had!", "author": "Edvige C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "Wonderful new Italian restaurant in Downtown Brooklyn!\n\nI went here to celebrate New Year's Eve and loved all the holiday decorations, which perfectly utilized the open concept and high-ceilinged space. There is a nice bar area in the front, with a large TV for sports, but it's not a sports bar at all. And in the main dining room, there are plenty of tables and booths, good for small and large groups.\n\nOur waitress was awesome...very friendly and professional. All the service was outstanding. \n\nWe opted to skip appetizers and focus on the prosecco first ($8 glass/ $32 bottle). I opted to try what has recently become my go-to pasta dish...Parpadelle with mushrooms and truffle oil. It was delicious...huge portions for a decent price ($16) and very tasty! All the desserts looked wonderful, and the Panna Cotta did make it to our table, though I opted for more prosecco over the sweet treats. \n\nI can't wait to go back (and they deliver!).", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "Love this restaurant! The food and drinks are always great. The service is amazing and I love the ambiance. Today I had the Grilled Portuguese Octopus with mixed pickled bell peppers and gaeta olives.. oooo my God, delicious!!!!!!! I highly recommend it, phenomenal, melts in your mouth!", "author": "Olga O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "I enjoyed everything about this restaurant. Went with a small group, was seated instantly. Started off with a Tartufata Pizza with added Prociutto which was delicious, followed by Fettuccine Bolognese, Lasagna Bolognese, \u0026 Ravioli Truffle sauce. All must haves. I got to taste all this because We all shared our plates thank god lol. I'm definitely coming back.", "author": "Miguel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Beautiful and truly amazing place. \nSitting at the bar is a must whenever. But when Pedro is bartending... it is a next level experience.", "author": "Rodrigo L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-14", "description": "No pizza expert, but it was pretty good. The crust is a little sweet and puffy; almost like a pastry. The toppings on ours were minimal and kinda kept sliding off. So just felt like I was eating puffy bread. I still liked it, but I think there's probably tastier pizza out there. Nice cozy, but a little fancier atmosphere. Felt fine coming dressed a little like a bum straight from the airport.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "This is the best pizza in the city \u0026 beyond!!! I'm lucky enough to live a mere 2 blocks away \u0026 I'm amazed my weight hasn't reached 3000 lbs.\n\nI did the create your own pizza with red sauce, Italian sausage, onion \u0026 mozzarella...and it was pizza heaven. I also came back a week later for the bolognese \u0026 it was literally the best I've ever had. I ordered a cocktail but it was not what I expected. I politely told my waiter \u0026 he was very understanding and got me a new one saying \"if you're going to order a drink, you should love it! I'm more than happy to get you a new one.\"\n\nThe food is so fresh, the wait staff is so nice \u0026 accommodating - not only will I be back, but I will bring ALL my friends :D", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-20", "description": "I got the Rosmarino pizza, and while I did know this came with evoo I guess I expected a drizzle, not for the pizza to literally be swimming in oil. Kind of overwhelming and heavy. The pizza tasted fine, once I removed half the evoo, but the crust was the soggiest crust I have ever seen. Boyfriend got the Quattro Formaggi which again was fine, nothing special. Crust was less soggy than mine, but still not great.\n\nOverall, I would suggest skipping the pizza and trying one of their other dishes (which people seem to really love). There are a thousand good pizza places in the city, but this isn't one of them.\n\nThis would have been a 2 star experience for the blah pizza and a waitress who seemed pretty miserable, but I added a 3rd specifically for the wonderful hostess! She was super sweet and friendly, and made us feel incredibly welcome! Can't remember her name, but she was fantastic. Also, while the waitress seemed kind of miserable (we all have our days), her and all the wait staff were very attentive, so credit must be given there as well.", "author": "Anna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "I was born and raised in Italy and I am happy to say this is for sure one of the most authentic Pizza I have ever had in New York. I also go for lunch at least once a week and the Parma panini is also super tasty! The place  has great vibes with decorations from italy and the manager/staff from italy! TOP place", "author": "Davide P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "Great pizza, quick service, reasonable prices. Have had a few of the different pizza varieties and have not been disappointed. This is a solid spot.", "author": "Tim F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "One of my favorite spots! The manager is the best and the food is to die (I love the fried pizza!)", "author": "Channi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "After trying the other homemade pasta and wood fire oven italian restaurants in Brooklyn, this has emerged as my favorite. The marguerita pizza with the homemade sausage was on point. The pastas are actually homemade so they have that distinct texture and hold the sauce much better. \n\nMost importantly there is a warm familiar family oriented feel to this authentic spot and it will be a pleasure to return again. We were really treated like family!", "author": "Philip W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "The pizza with truffle oil is amazing! Good ambiance and drink selection. Definitely would come back", "author": "Eunice E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Delicious pizza - I ordered the Tartufata and it smelled heavenly of truffle and was delicious. The restaurant was spacious and had a nice vibe, even when it got crowded it wasn't too loud. The service was great - attentive but not overbearing", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "All of the pasta we had were really good. The pizza was a bit runny but tasted really good... maybe it was a bad day... I'll have to give it another try", "author": "sejin k."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "Amazing place with great service and even better food! \nThe place has a great atmosphere and very clean and beautiful inside. The pizzas are my favorite and the spearing avocado salad is one my the best!", "author": "Ximena D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-24", "description": "Love the space. Warehouse feel with brick walls ..view of the pizza oven. \n\nThe pizza was good, but I would've preferred the crust to not be so soft and mushy . If it is brick oven , I expected it to be more of a crispy crust. \n\nThe squid ink pasta with shrimp was delicious . Next time I go , will definitely go for the pasta over the pizza. \nThe apps looked good too.\n\nStaff was nice and helpful. Seemed to be uncoordinated though ..after we said we didn't want coffee and dessert ..another person came and asked us again and put down a dessert menu.", "author": "Tracie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "Came to NY for the first in a couple months and found this new place near where my sister lives in Brooklyn. Eating here reminded me of eating in Italy - real. italian. cooking. Their menu has classics (fettucini bolognese, margarita pizza, ect) and also creative specials (home made gnocci and mushroom pasta topped with shredded black truffle). Oh, and I could probably eat the mojito panna cotta for desert every day for the rest of my life - it's heavenly. Everything has seriously hit it out of the park both times I've been there. \n\nService is great, although both times I went it wasn't too busy. Great wine selection, nice small and focused menu, candle lit ambiance (while not too fancy). I'll definitely be back.", "author": "Katleiah R."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}