{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Pizza, Aperol Spritzes and Service are phenomenal. Just like you're in Italy! Chill atmosphere and go to spot for a cocktail with friends.", "author": "Gabrielle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Surprised at how good this was - great for the neighborhood, good quality Italian food, great space, great service.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "Forno Rosso Pizzeria delivers great authentic Italian food with professional staff in a cool modern and robust decorated dining room. From the moment we walk in the host greeted us in Italian and kept entertaining our group, Chef Marrone came to our table and served us with some of his fascinating homemade focaccia bread. After some chat about the menu, he recommended us some of the best menu items that we indeed ordered. the Pizza was original with a thin crispy crust and topping was simple yet delicious.  The deserts were killers, Grafe con Nutella and tiramisu. \nThis was our first time but definitively not the last .\nSee you soon.", "author": "Tiago D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "With a close friend traveling from Pakistan to see Brooklyn for the first time, I knew I had to take him to Forno Rosso by Executive Chef Giuseppe Marrone. Giuseppe is the type of chef you can rely on for the best performance in food and hospitality. We were a party of five seated by a caring waitress who works with children in special education. The dinner lasted two hours filled with great conversation, well executed food, and the pleasure of being in this beautiful restaurant. Giuseppe always surprises us with something special--he truly cares about each one of his customers, and when he calls us \"family\", I know he means it. I will always support people who are honest, hard working, and passionate about what they do. This is why I keep coming back!", "author": "AR B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "Pizza bolonese was super , for desert: don't skip the graffe con nutella.\nHighly professional service.", "author": "Yael I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "Recently I brought a group of 43 here for a corporate event that I organized. I would HIGHLY recommend Forno Rosso to use for large group events. They were INCREDIBLY flexible and professional with us from the first contact I made all the way through paying the final bill. \n\nThe space is great for a party our size because we took over about half the restaurant which left room for others not in our group but gave the whole evening an intimate feel.\n\nFirst, we were early by about 30 minutes, which they said it was no problem and we were more than welcome to come in and enjoy a drink at the bar. Since we were a party of 43 we took over pretty much the entire bar. I was asked many questions by Giuseppe and his staff to make sure that they evening ran completely smooth and that all of the guests were happy.\n\nHonestly, this place made my job so much easier as the party coordinator and I could not have pulled off such a great night without Giuseppe, Stephanie and his entire staff.\n\nNow the meal:\nEveryone LOVED our meal. We went with a prix fixe option ( I would recommend reaching out the restaurant for their prix fix menu if you have a large group). The timing of the meal was perfect, courses were brought out promptly but still gave us a few minutes in between courses to relax, enjoy and make room for more food. I noticed that they wait staff was incredibly attentive to filling water glasses and refilling wine/beer. The food was absolutely delicious, particularly the steak, which was cooked to perfection with a beautiful sauce poured over top. We had more than enough to eat. Giuseppe surprised us with a little dessert for everyone, which was not in the contract and given by him as a gift to us. \n\nThe next time I have a large event in Brooklyn I will be sending my group here. I could not recommend this restaurant more.", "author": "Kimberly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Great local Italian spot! Good food, cool atmosphere, there's even an authentic wood fire pizza oven.", "author": "Viena S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "This was my 1st time here and I am very pleased. Everyone was so nice and friendly. The atmosphere was great and it was one of the best experiences I've had at a restaurant. One of the owners, Giuseppe was so attentive and made sure we were happy. The place is disability friendly and entry is via a lift next door. They just ask that you make a reservation at least 1 day in advance. Prices are reasonable and the food is delicious. Try the desserts! Will visit again.", "author": "Barbara R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "This is a great addition to the neighborhood. Don't miss trying Forno Rosso if it looks closed from the outside. It always looks closed from the outside.  And, it is not easy to find - it is the wine-red canopy and dark canvas \u0026 plastic enclosure which looks like the employee entrance at a car wash.\n\nI don't go for the pizza. There's plenty of great pizza nearby and I enjoy more authentic NY pizza for lunch.  I can't get excited about pizza for dinner, even painstakingly prepared brick oven pizza .  To me pizza for dinner sounds akin to bologna and American cheese on white bread for dinner.\n\nI've read an honest review here about the Alfredo pasta.  Quick caveat: I have had fettuccine Alfredo at Alfredo's in Rome.  I won't have Alfredo pasta in the US - it never measures up to the standard set by the real thing.  Plus, as the reviewer notes, $50 is a steep price for a plate of pasta.\n\nAll of the aforementioned recognized, I've never had a bad meal here.  Every salad and main dish has been fresh and well prepared.  I'm always going back and enjoying my meal.  I cannot comment on the desserts as I do not often have dessert.  Nor can I comment on the wine selection.  Overall the food is well above average for a neighborhood restaurant.  \n\nI have only sat at a table once and it felt a little like sitting in a well appointed cafeteia.  Since then I sit at the bar.  That works well except for the huge TV behind the bar which always seems to be showing a football game.  I don't get that fitting in at an Italian restaurant. Why do I have to watch bone-headed, angry men in pajamas chasing a ball around on a lawn while I eat my dinner?  IDK?\n\nAll-in-all, I give Forno Rosso four stars.  If you tend to be cynical, call it 3.5 stars.  Certainly no lower than three.\n\nEnjoy!", "author": "PJ S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "This is one of the best brick oven pizza places in Brooklyn!! It's fresh, well seasoned and delicious. I have dined in and gotten take out and both times were outstanding! I really like their service as well!", "author": "Julesy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "Came to NY for a quick 2-day trip and didn't want to leave without getting some pizza. After going through several reviews I decided to try this place and I'm happy I did. We had already eaten so we only ordered the Siciliana with red pepper flakes. It was so good! I was already full but couldn't help trying to eat the entire thing by myself. They make they're pizza in more of the traditional way which focuses on quality ingredients and you can really tell. The sauce was delicious but didn't overpower the thin crust and there was the perfect ration of cheese. This was my first time having eggplant on a pizza and I was pleasantly surprised how much I loved it. The pepper flakes added just the right amount of kick (I choose to add those because I was debating whether I should try the Diavola). The staff member where extremely attentive and I never had to ask for a refill of water because the water guy never let it get less than half full. I took advantage of happy hour and ordered one of their cocktails with a house infused Burbon which was really delicious and reminded me of apple cider. My only regret is not ordering two pizzas! Shame on me.", "author": "Chamille B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-14", "description": "I have bit gone to the actual place, I can not say anything about that. But it was the worst delivery order ever! It took 10 mins to place an order, the girl on the phone could not get the address right even tough we spelled it. We did not want ham in it and said it 4 times. Delivery guy called saying he can not find the apt. Because she wrote it wrong! Finally we got the pizza and of course! there was ham in it and it was cold. I called back again to talk to the manager, they said they dont have a manager. They got me someone from the kitchen and I told him what happened he said he will replace it. It was replaced. Delivery guy brought us some sweet with it we can not name what that is, it tastes like a medicine and they are in little plastic cups that they usually bring spices in. I will not order from here! Never again!", "author": "Gls T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-19", "description": "Met up with some co-workers at this new pizzeria across the street from our job. Cute place with delicious personal pan pizzas. I played it safe with the margherita personal pizza and a glass (or three) or presseco. Delicious!", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Been coming here since it opened. Food and drinks? Por qué no los dos? Love me some Pedro.", "author": "Caroline K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Had an amazing lunch. All the food was great. Service was excellent. Clarissa was the best.", "author": "Eric A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-16", "description": "Went for lunch while my boyfriend parked the car. There was no one in the restaurant and I asked to use the bathroom as soon as I got there.  The hostess tells me \"Your not allowed to use the bathroom my boss will get mad.\" Hospitality starts with the hostess. I will never be back.", "author": "Jill R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "This place is really good, not joking. And the environment is also great!", "author": "Angela G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Excellent service, amazing unique pizzas, and upscale atmosphere that promotes conversation and happiness.", "author": "Christoph K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "Totally worth your time. The food is delish, the space is open and airy and not at all overly pretentious (or, worse, the new brand of increasingly boring Brooklyn \"cool\") and the staff were each so happy in their own reserved ways. \n\nI came hobbling in with a crutch and orthopedic moonboot on yesterday- I had just left a terribly disappointing 5 hour session at the nearby Brooklyn Hospital and was tired and cranky and ready for an early dinner. But that changed quickly. Our hostess was exceedingly friendly, she reminded me of my friends back in Dallas, and she was kindly accommodating given my special needs as a Tiny Tim.\n\nThe lasagna and {um, I can't remember what I had but it involved mushrooms and white truffle oil} made me rethink my apathy towards Italian food in general. And the tastiness of our food and comfortable atmosphere put me in a GREAT mood. So much so that I commented repeatedly during dinner about how much better I felt and what a nice surprise that was. Kind of a big deal.", "author": "Charle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "Are you kidding me with this hidden gem?!\n\nAfter doing a few errands in the area, My friend and I had dinner at Forno Rosso. The ambience was just right. We had a million questions for our waitress Christina and she was so helpful. Loved the food and service. \n\nDon't forget to ask for their weekly specials. Definitely looking forward to another experience there.", "author": "Michael I."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}