{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "The pizza is on-site point and Clarissa hooked up the exquisite service. Prosciutto pizza and beet salad! Good spot for dates or just hanging out. Definitely coming back!", "author": "Philip T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "Loved loved this place!  My daughter plays soccer at LIU so I know we will be back.", "author": "Jenny J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "Great little place near the foot of Brooklyn and Manhattan Bridges.  Really good happy hour food and prices. Great service   Closest restaurant to the Hampton Inn.  We tried it two years ago when staying here. Same great service, same great server. Really enjoyed the fire baked pizza, etc and a good black lager.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-08", "description": "I've been to many pizza places this wasn't exactly my favorite although those staff we'll very pleasant the food wasn't very tasty the pizzas were Bland, and were  small for the price, expensive, and there was no flavor they're oil dip with the peas was great but again no flavor. Everything  needed more flavor, alot more flavor the bread was good but it was cold. I've  been too many pizza places in NY, I grew up here, New York Pizza was and is the food to eat, and  around  here there's much competition they need to step it up a notch but again the place was nice and the staff was excellent", "author": "Tina P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-24", "description": "Atmosphere and service were great, the pizza was made with the freshest ingredients and fired in an impressive brick oven, my disappointment was in the crust. It was soft and doughy. I prefer a crunchy crust, it had the consistency of a thick, raw brito wrap. unfortunate", "author": "Dave L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Solid experience with multiple reorders! Great, human and quick ordering! Prompt delivery!  Great pizza!  Happy :)  making the experience of eating in NYC, easy, aaaahhhh.", "author": "Frank M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-02", "description": "In a nice atmosphere, our meal started with a desultory waitress with a chip on her shoulder finally condescending to wait on us. The whole wheat bread with evoo and capers was good, but the positives end there. Ordered a Pizze Bianche Contadina. Bland is giving it too much credit. The crust was soggy and droopy, although with nice smokey undertones. Be warned, even though the menu lists smoked Mozzarella, there was none to be found on my pizza. A very meager sprinkling of crumbled sausage, a few tiny bits of eggplant, and evoo. That's it. Basically soggy bread with a very few flavored salty bits. My friend's Avocado Gamberetti salad was decent.", "author": "Charles Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "The lasagna here is delicious! Honestly, I can't pick out one thing I didn't like about this spot. The location was great, good beers on tap, and friendly staff. I'm here on business and I was lucky enough to find this place. I'd highly suggest it to anyone.", "author": "Ryan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "One of my top favorite pizza places and I've been to many!\n\nForno Rosso is a local Italian restaurant that is very close to my apt. They make super delicious pizza made in a wood burning brick oven. Many places either make super greasy assembly line style (I'm looking at you 2 Bros) or have bland and flavorless dough and sauce. Forno Rosso makes pizza with a \"true\" Italian touch - fresh ingredients that are well cooked.  One downside is the price, however. Get my favorite - the fried pizza - which you are going to be set back about $20, you won't regret it. If the prices were a bit lower -- this would be my second home. Still high marks though.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "FYI It doesn't have the title or address of the restaurant on the outside of the Bldg. Overall pleasant experience. Great ambience, fancy/digital modern atmosphere. Good prices. Ordered the margherita pie and what I liked most about it was the soft thin crust--almost doughy. I prefer it like that rather than hard crispy cracker pizza. Service was fantastic--had 3 different people attending to us. 2 min walk from my hotel (Hampton).  I will definitely go back.", "author": "Robby H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-03", "description": "Order the Capricciosa pizza for pick up . The pizza was very burnt that all I saw was compete black ashes on the bottom. One of the worst pizza I have . I couldn't taste anything since the burnt taste overwhelm the pizza. The picture looks great on Yelp but my pizza was soggy / undercook but with brunt taste.  I wouldn't try pizza from them again but I might try the pasta.", "author": "KW W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-08", "description": "Their take out portion (for the kale salad in particular)are small as s***. Not much value for your dollar. Pizza was good but IMO overpriced. Perhaps dining in gives better results", "author": "Glen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "i love pizza. and thank god for forno rosso pizzeria in brooklyn. \nive been here twice already and i stand by my tip when i say i enjoy this place better than robertas in bushwick. \nfirst of all, i dont like calamari but i will inhale the calamari at this restaurant (served with spicy marinara \u0026 lemon)! fried to perfection this goes so perfect with a cold six point beer on tap. \nmy go to pizza of choice is the spicy diavola without salami (as i dont eat pork) but my friends also did a build your own pizza where they allow you to put any selection of ingredients you want on a whole pizza or half if you want more than one combo. pies are not personal sized, but they are thin. still, two slices + calamari and a beer = full shai shai.\ngreat place for a chill dinner with friends in brooklyn (right off the BQR)!", "author": "Shaiyanne D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "We loved this restaurant! In particular, we liked our waiter who hails from Portland, OR. He gave us excellent advice about the food choices on the menu, was attentive but didn't hover. Best pizza crust I've ever had. Flavorful bolognese sauce and the complimentary bread was tasty with a hint of cheese in it. We will be back.", "author": "Nan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Love the pizza ! I normally go day time and is always really busy , last night after I took my girlfriend out for dinner I finally got to know the pizza Cheff LOrenzo . His pizza is amazing and after talking to him I realized the reason ! He is 100% Neapolitan and just recently moved to America , his pizza was perfect and the crust just amazing ! I was really impressed ! Forno Rosso had gr8 pizza and gr8 service :)", "author": "Roberto G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "Maybe my mistake was to order two pizzas to go!  I have committed the ultimate pizza crime.  The crusts were a little too burned in my humble opinion, however I would come back to try dinning in.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Ending my Brooklyn trip on a high note as expected. Upon being seated at the bar, I was greeted AND served by the owner and head chef of the establishment.  After delightful conversation, I was served a delicious house cocktail (made with housemade vodka infused with cloves and citrus, named specially for me), and enjoyed the house specialty of homemade squid ink pasta and shrimps (to DIE for!). The bread is served with lentils in olive oil and rosemary... My meal came out so quick, I kept the lentils to enjoy even after I finished my pasta.  I was then spoiled with a homemade cannoli and limoncello for dessert.  This place is an absolute gem, owned by a dynamic \u0026 delightful individual (who happens to be George Clooney's former private chef!). Thank you for living up to the expectation and the hospitality extended during my visit!! I can only hope to enjoy the cuisine on the West Coast!  #fornorossonyc", "author": "Dani D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "Came here the other day for happy hour. Very chill vibe. All the staff are incredibly nice. The happy hour specials are reasonable ($4 drafts, $6 wine, $8 well drinks). In addition, they have a pretty extensive happy hour food menu. The pizza was great! The crust was filling but light. The house made sauce and fresh mozzarella also made the pizza worthwhile. I'll definitely come back here.", "author": "Nicole A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "We came here from manhattan and ordered tomatoes\u0026burrata and Forto Rosso pizza. We loved both dishes. The pizza's crust was very thin and chewy, which went really well with Palma ham.", "author": "Yuya T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-02", "description": "New to the neighborhood, and wanted an easy Saturday night. \n\nDelivery service is far from impressive.... Our order was not taken correctly and the manager did not correct it in a proper fashion. It also took an hour to deliver the rest of the order (after only half arrived!), and they did not offer any discount to make up for their mistake. The excuse for the mistake was that they were too busy! Don't take delivery orders then!\n\nAlso, we received a menu in the mail recently and the prices on the current menu did not match.\n\nHappy to find a better pizza place in the neighborhood.", "author": "Lauren A."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}