{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-13", "description": "My wife and I come here when ever we stay in Brooklyn for business.  The atmosphere is lively.  The aromas that waft from the kitchen are unbelievable.  The pizza is the best around.  The menu has something for everyone.  We had the most amazing server.  She had the best personality and we later found out that she had only been working in the Resturant for only three days.  You would never know it.  Our servers name is Ellie.  We will be back in a few weeks and will definitely request Ellie as our server.  I highly recommend the Resturant and especially Ellie as a server.\n\n\nJohn Dominic", "author": "John D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-31", "description": "3.5 stars rounding down to 3 because our experience was just OK.\n\nCame here for a glass of wine and an appetizer after finding out Wine Legend down the block was closed. It was pretty inside so we had high hopes. Ordered 2 glasses of champagne which came in gimlet glasses (odd) and the octopus appetizer. The octopus was probably my least favorite octopus dish of all time.. the beans to octopus ratio was seriously outrageous and they need to change the name as it's so misleading. 4:1 ratio BTW.\n\nMy least favorite thing about this place was the bathrooms. I already felt gross walking around town for miles and expected to feel better after washing my hands. NOPE, the bathrooms were filthy, not just filthy looking. \n\nI feel bad giving this place 3 stars based on 1 appetizer, but if it's THAT good as people say it wouldn't have tasted meh..? Pizza's did look good, though.\n\nService on the other had was great.", "author": "Anna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "Came here with a large group of people (family) and it was great!! They were able to accommodate us (15people) and we didn't have to wait at all!! The food portions were very generous as well. Will definitely recommend it to my friends and family! Great spot and nice location (downtown Brooklyn). I ordered a salad and shared a pizza with my grandma (it was SO good!).", "author": "Ada H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-01", "description": "Came here with my husband to celebrate my birthday. Had the fettuccini bolognese... this was probably the worst pasta I've had in NY. I do not recommend it. Husband had the octopus dish- lentils were over cooked. This place definitely did not meet expectations", "author": "Andrea M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-25", "description": "Good pizza. Great Prosecco. Good service. \n\nOverall a great Italian, date-night find in downtown Brooklyn. Warm and romantic interior. Recommend the octopus appetizer and pizza to share.", "author": "Victoria Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "If you're looking for delicious and authentic Italian cuisine - THIS is it! I always eat the same combination: Apps: Bruschetta, Gamberi \u0026 Avocado (the dressing is immaculate!) Mains: Parppardelle ai funghi and the yummy deep fried pizza called: Montanara! Desert: the homemade tiramisu with an espresso.\n\nThey also have really great drinks specials! Handcrafted, creative cocktails for reasonable prices!\n\nThe service is so attentive and accommodating - its a dream! The manager even came and asked if everything is good at our table!!!\n\nOverall this place is a true gem in downtown Brooklyn. 5 Starss well deserved!", "author": "Rahel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-01", "description": "One of my favorite Italian restaurants! I wandered in on a chilly evening in February for a quick dinner. The chef was kind enough to give me a half portion of the bolognese pasta along with the eggplant parm. The bartender was great and the service was friendly and timely. \n\nThe only reason I'm holding off on giving them five stars is because I encountered a fairly rude bartender on my second visit. She seemed like it was a pain to service me at all. Additionally, the broccoli rabe was more bitter than it should have been - it tasted like it was going bad. However, the manager was great and took it off the bill. \n\nAll in all, I'll be returning soon.", "author": "Krysten C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-08", "description": "This place is perfect for friend's night, a couple of drinks, enjoy the music and maybe an appetizer. I highly recommend this drink Sicilian (don't remember the whole name) is delicious and while you drink it Mediterranean Sea and also Europe came to my mind. Pizza looks delicious and fresh but the main courses nahh..  apparently everything is precooked and the truth is not even ten minutes when you have your appetizer and they bring you the main course. I had as a main course Funghi Risotto, had my night ruined  and my stomach upset. Prices vs food quality is not worth it... although I think I recognize the kindness of the waiters ... maybe I'll go back with friends but never again to a dinner with a partner.", "author": "Davide E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-25", "description": "I've never had a bad meal at Forno. Their pizzas and pastas are delicious. It's a great local restaurant, very specious too which never disappoints when it comes to getting a table. Good customer service too.", "author": "Marzena D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "Forno Rosso is my number one to go to in Downtown Brooklyn. The Pizza at Forno goes beyond average, the crust is soft and tender and yet crunchy. The ingredients are extremely fresh(they make the mozzarella in the house). My favorite appetizers are the Chicken Meatballs and Eggplant parmigiana. For main course I always try the different specials they offer daily. \n\nTheir happy hour prices are excellent and there's always a \"drink of the day\" that is sold on a happy hour price all day!!! \n\nI also love the service there. The bartenders and servers are always very friendly and attentive.", "author": "Thereza F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Can I just say: 6 stars! This restaurant deserves the greatest review. From the service, to the ambience, to the delicious and fresh food! This little gem is right in downtown BK, right next to the Manhattan bridge. Our waitress was highly knowledgeable and was able to offer me the perfect wine to pair with my pasta. The food was fresh, flavorful and beautifully made. Overall, I was highly impressed and this rating is well deserved. I will definitely be back! \n\nCons: Literally there were none. Just saying. \n\nPros: Quick seating, little wait for food/service, great wine and drink selection, spacious, chic, good music, and the waiters are attentive.", "author": "Dnique T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "Forno Rosso. It is difficult to describe the experience at this restaurant. The words unique, unexpected, and brilliant come to mind. The food was extremely satisfying and well made. Finding our way to this restaurant seems like fate after the unforgettable meal we just had. The building itself is very relaxing and pleasing with an industrial style. The service was amazing. All of the several people who served us were pleasant and friendly. The menu was easy to read, and the food was amazing. You cannot leave this please without trying the deep-fried pizza and the ravioli. The cauliflower soup is delectable. Don't hesitate to order the food you'd like to try. The serving sizes are perfect for one person or sharing. The cappuccinos take the experience to another level to finish off your meal with the tiramisu.  \nIn the words of my father, \"Son of a *** this is the perfect meal.\"", "author": "Madison M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-27", "description": "I stumbled upon Forno Rosso when I was working in the area and wanted a meal before heading home. I was definitely intrigued by the Happy Hour menu that ran until 7 PM, but because my meeting was just running so late, I missed it. \n\nStill, I ordered a variety of the items that I wanted which included the calamari, meatballs, pizza, pasta and dessert. I was really on the fence about the rating I would give this restaurant, but it is a solid 3.5 in my books. I wasn't amazed with the appetizers, especially with the price outside of the happy hour menu because it was fairly high for the portion size. \n\nThe pasta was definitely authentic which is not my first choice since it was a little too authentic for me. I preferred taking the leftovers home and cooking it up the next day. I still have to say that I really liked the Shrimp Tagliolini out of all items that I had. I would likely revisit to have this again and maybe find some other items on the menu that would satisfy my cravings.\n\nThe restaurant has a bar area with sports for anyone who's looking for a drink. They have seating for big parties which we witnessed get drunk from the happy hour menu on a weekday.", "author": "Cindy U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "We had the ravioli, pizza  steak  and soup  \n\nEverything was tasty, it was our second time there so I feel it's consistently delicious. \n\nTry Happy  hour during the week for some special deals \n\nService is friendly", "author": "Amy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Probably my favourite Italian place in Brooklyn.\nThe meals are exceptional.\nThe service is great. And happy hour everyday from 4-7pm.\nWould definitely recommend you try it out.", "author": "Mirabel I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "Everything about our meal was amazing! From appetizers to salads to entrees to dessert! 5 stars!!Our server Brian was top notch. Our drinks were never empty. He provided great menu recommendations and was so attentive to our needs. If you are looking for Italian food in Brooklyn Forno Rosso is a must! P.S. Order the chicken meatballs!", "author": "Bee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-21", "description": "I had my nephew/godson's 1st Birthday here. It was amazing! Ksenia, the party coordinator was very friendly and we contacted each other via email. She was so helpful and very accommodating with everything I needed for the party. Yara, the manager and Jimmy, the waiter for our whole party were very nice and approachable. The party was a hit to my relatives, they love the food and the ambiance of the place was nice with its natural light and high ceiling. Quite a lot of room to roam around if you have toddlers that want to walk and explore. All in all the service was superb. I highly recommend this place, if you want a good place to eat and a good venue for any celebration.", "author": "Jill B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-12", "description": "Seated quickly, friendly service, casual but upscale (feeling) atmosphere, and decent food.\n\nThe server was attentive and friendly, the buses and food runners also topped off water and cleared tables which was awesome because it felt like they all cared about the experience.\n\nWe started with the sautéed scallops which were cooked well and served with an aioli. A nice arugula and tomato salad cut the richness and came together well.\n\nThe pappardelle and mushrooms my wife ordered was not over sauced and had an assortment of mushrooms for different flavors. Good size portion. She loved it.\n\nI had the spaghetti and clams (they were out of clams, so they asked to replace with mussels). It had to have come with 30+ mussels which, quantity wise was excellent. It did make getting the pasta down into the sauce though so I shelled them all first then went to work. I'm not a big fan of Italian food but the pasta was cooked perfectly, and my wife loved the dish. I could of went for some more lemon and some freshly shaved cheese on top myself. Based on quality and portion I still give it a good rating.\n\nTook home some tiramisu, which the waitstaff pours a ton of espresso in the morning for the chef to make homemade and a cheesecake. Tiramisu was excellent and could tell the espresso was real, not just some coffee flavor. The cheesecake was straightforward NY style; however the graham crust was phenomenal.\n\nThe menu reflects a 3% cash discount which is annoying.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Needed a children friendly place to eat in Downtown Brooklyn.  This is a great laid back place; totally chilled atmosphere. \n\nThe server brought bread which came with lentil beans.  It was different.  We ordered margherita pizza (happy hour price - regular size), bruchsetta (happy hour price), salmone alla siciliana, pappardelle ai funghi, and shrimp tagliolini.  All the food came out quickly.  We were slowly eating and able to\n catch up without interruption.  The food was delicious.\n\nFor dessert, we ordered occole con nutella, which is very chewy dough so I recommend trying something else.\n\nParking can be challenging in this area.  It's a bit of a walk from the trains but totally worth it.", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Food was excellent!!!!!!! Ellie was an AMAZING server and made the experience so much more enjoyable. The squid ink pasta was sensational!", "author": "Emily C."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}