{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "Delicious cocktail (heart of Naples) to start a weekend if you like coffee and whiskey. The marinara sauce was tasty but the margarita pizza was a bit dry. Overall great experience.", "author": "Pramod V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "This pizza is fantastic. I've been to some of the best pizza places in the city and this place stacks up with all of them. I got the margherita pizza with prosciutto on top and it was really good. Strongly suggest this place. Also a cool ambiance", "author": "Nathan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-25", "description": "Nice atmosphere. Happy hour special was great ($4 Peroni draft). However, i came here for the pizza and it was nothing to write home about... Probably the soggiest pizza crust I've ever had. I could barely scoop it up with a fork, let alone pick it with my hand. It literally fell apart when trying to eat it. I might come back, but not for the pie.", "author": "Terry G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-02", "description": "i've ordered from here several times and although initially it was pretty good, we feel that the experience progressively gets worse. \nthe pizzas get smaller, the desserts come melted, ordered a margherita pizza and it had 1 basil leaf on it.. \n\nforno rosso no more.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-14", "description": "This used to be my favourite pizza delivery place in the area but delivery and service has gone seriously downhill. The last few times we made excuses of poor weather, peak timing, but it's just been consistently bad lately. Last time ordered at 6pm, received confirmation for delivery by 7.20, at 8.15 were still waiting. Called twice, first time we were told by a young woman it had gone out and should be receiving it within 10mins. This turned out to be a lie, as 15mins later and on our second call they said they couldn't find our order. After being passed round to three different people on the phone, finally spoke to a man claiming they found our order but somehow couldn't process it. He then said he'd send us our food and give us a refund, but after waiting 2.5hrs we ordered from somewhere else and lucky we did, since no food arrived. Won't be giving these guys another chance.", "author": "Foodie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-17", "description": "Food is very good.  Take-out portions are paltry.  I stayed at a nearby hotel and tried this restaurant on 3 different evenings.  1st time, I ordered the salmon dish...tasty. Paid $8 for a salad that was a little more than a handful.  Very disappointed.  \n\nTried it again, ordered takeout and the pizza was okay.  Ordered a $10 salad, complained about the portion size and received an even smaller salad.  Was told salads are much bigger when you eat in the restaurant.\n\nSaturday night, too tired to go out tried delivery and ordered the skirt steak that came with potatoes and vegetables.  No vegetables.  Dessert, tiramisu which was a little more than cream sprinkled with cocoa powder and two biscotti cookies stuck in the cream.  This was truly unsatisfactory for $30 plus the tip for the delivery guy.\n\nCalled restaurant, complained and they agreed to deliver the missing vegetables.  At 3 strikes, I had had enough and offered to return their food.  They agreed to send the delivery guy to pick the food up and not charge my card.\n\nFood is really 4 stars...Take out is zero stars with a hefty price tag and very small portions.\n\nAvoid takeout and delivery at all costs.  I would try this place again if I have the energy to dine in.", "author": "V G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "Luca was my waiter. Very knowledgeable about the menu. Super professional and made the experience a joy. Had the pork shank and it was perfect and literally fell off the bone. The beer was well recommended by Luca. Everything was great. Two thumbs up. Thanks to my waiter.", "author": "Ivan-Elena A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Enjoyed the pizza at Forno Rosso. Great spot and wouldn't hesitate to go back next time I'm in the city. Good menu options and the beer list wasn't bad. Would recommend.", "author": "Trey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "Forno Rosso serves delicious and authentic Italian fair. If you're looking for American pizza or Italian American food, it may not be for you. The two cuisines are quite different, and I can only imagine that is what the less positive reviewers were expecting. \n\nMy husband and I are always a little sad when we return from visiting relatives in Italy that the food here is never quite the same...except here, it really is. The pizza is just what you expect in an Italian pizzeria with the best ingredients. The other dishes are delicious too, but the pizza is why we come.", "author": "Heather B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "Excellent pizza. A fantastic Happy Hour deal. Ask for Luca if not too busy he will treat you right", "author": "Ty M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Did not disappoint. We checked yelp after a long day touring and scored. The service was great. Soup of the day was Chicken and  the base broth was flavorful and light. The skirt steak was juicy and well seasoned. Got to taste the combination pizza/calzone and am trying to figure out what made the crust so tasty. Definitely will be back when I'm traveling to New York again.", "author": "Marci G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Great place stop for a cocktail after mani pedi with friends. Great addition to the neighborhood!", "author": "Erin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "The staff, food, and environment are superb.  Will definitely return!!  The Parpadelle, the Pizza, and Lasagna are amazing!", "author": "Lanard P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "First, the positives:\n\nGood pizza. Good ambiance, decent beverages, and friendly service. \n\nWhy 1 star?\n\nI have been here twice now and each time had my card charged twice. That's both times. That's 4 charges for two meals. Contact with my bank only affirmed fishy activity with my card. Though I may come back for the food, I will only ever pay cash. Cuz that's pure sketch.", "author": "Nasi P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "Holy moly. Having been raised in New England, I have had some amazing pizza in my life. Forno Rosso had the BEST PIZZA I have ever had in my life. I had the white pie with prosciutto and rosemary.... unforgettable.", "author": "Brett M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "Wow their Paccheri Alla Genovese is AMAZING!!!!! Wow what an incredible flavor. The best pasta dish I have ever tried. Just to think about it my mouth gets watery. Seriously good!! Can't wait to come back just for this dish. The service its Amazing too, most of them are very friendly Italian guys offering a very professional service. Loved this place!", "author": "Kate S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "Excellent service today and delicious pizza with salad. Nice brunch menu. Good value. Salad was generous . Would come again.", "author": "Pam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "Wow.  I think this may be the best pizza I've ever had.  I've lived in the city for 15 years and been to so many pizza places - most just ok, a few only stand out.  But, tonight I had the Felice and found my new love.  Burrata, arugula,  shaved peccorino, and truffle oil.  You must try this!  So fresh and the ingredients explode in your mouth.  The crust was perfectly done too.  Can't wait to try more items off the menu.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "The pizza here is delicious!! My family was visiting In Brooklyn NY and decided to go to dinner after a along day in Manhattan. What can say; the pizza reminds me of Napali when I was there on vacation. Would definitely visit again whenever back in town. Also the martinis were awesome and hand made. Can't go wrong with the place. Had a chance to talk with her owner. He And the staff was very nice!", "author": "A M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "I love this place! The pizza is absolutely amazing and the chicken milanese was perfection. It's my new favorite spot. Aside from the food, the people working here are beyond nice. Completely efficient, laid back, perfect atmosphere and an all around neighborhood gem.", "author": "Meredith P."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}