{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Eduardo is amazing and easy on the eyes !!! Service is unbeatable and the unlimited pizza and prosecco deal is phenomenal. Always a great time here, happy to recommend to any friends and family in the area. Look at that pour!!!!", "author": "Christine C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-26", "description": "The FOOD gets 5 stars. The service, 3. And that's being generous. Sitting at the bar and the bartender has barely spoken two words to me. Had to flag him down to get a second glass of wine. There is only one other person at the bar, so there's no excuse. He's too busy cleaning and shutting the bar down an hour and a half before they close to actually give good service. Too bad, because the pizza was excellent.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Best lunch/dinner spot in the metro tech area.\n\nTry the cheese raviolis! You. Will. Not. Regret. It.", "author": "Bee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Forno Rosso in Brooklyn is great. It has a great ambiance with a rustic but trendy feeling. Wait staff were  great , not too attentive but good service. \nWe had fabulous PEI mussels in marinara sauce. We had Orecchiette Alla  Norma and Fettucine Bolognese , both excellent .  Wine and cocktails were great too. It seemed like a family friendly place too.  They had Happy Hour meal specials before 7 so a nice discount too. Would go again when travelling to Brooklyn.", "author": "Maureen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "Cool spot!\n\nGood pizza, drinks and ambience. Loved the calzone frito...basically their signature calzone with fried dough...so bad for you=so tasty. Definitely a nice way to spoil yourself on a Friday (after a run or something...this thing is serious!)", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Greattt food! Loved the deep fried pizza and the pasta.\nGreat ambience. calm peaceful setting. \nStaff is sweet. Good food!", "author": "Sabrina Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-06", "description": "I am so picky when it comes to Italian restaurants and this place definitely exceeded my expectations. The Sicilian pizza is to diiieeee for and the menu is extremely abundant. You have plenty of options to choose from and the service is amazing. I will definitely be coming back here as a regular.", "author": "Kellay F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "This is my 1St time here at Forgo Rosso and I am coming BACK. Everything the is awesome here", "author": "Gloria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "One of the best Italian place I have ever been in my life! The other reviews don't lie, it was amazing! They have a full bar service and the ambiance / decor was very beautiful. We were able to reserve even on a Friday night for 8 people. The service was very courteous and watch out, they are very generous on the amount of alcohol in the drinks!\n\nI am very picky with my Italian food and the gnocchi were fabulous. The tomato and cheese appetizer was fresh and delightful. The pizzas were oven cooked with a \"naan\" dough feeling and the pastas were al dente! We ended the meal by sharing a sort of Nutella dough strawberry dish and it was just perfect.\n\nAt the end of the night, the restaurant even offered us shots on the house! A really nice experience and evening! Would go again anytime, I recommend!", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "I found the receipt to my meal here today. It was dated from January 12, 2018. Why was I at Forno Rosso again?\n\nThat's right - it was lunch! And how can I help Yelpers with my memory of that meal? Ok, so it was a satisfying amount for a cold day in January. Vegetarian Panino! That's right - that's what I ate! \n\n(Also, have I and everyone else been calling it \"panini\" when we should call it \"panino\"?) \n\nOk, I remember saying to my friend, \"this is a sharp taste.\" I meant that and now I don't know what that means but it's a good thing. So panino, not panini is sharp. Which means good. And my friend liked her arugula salad. That's right - she recommended the salad!\n\nI remember the waiter/host walked us to our table like a family member. Like, \"you finally made it. Sit down, we're gonna discuss the flower choices you made for your wedding.\" That's right - I like feeling warmth from the waiters/hosts!", "author": "Hector H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-23", "description": "Food arrived completely cold. I called to see what they might do to accommodate me as a first time customer, and the manager never called me back. There are too many great Neapolitan pizza joints around here for me to ever order from them again.", "author": "Dana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "This is our second trip. Originally came for the squid ink shrimp tagliatelle, we were met with a surprise as their menu has changed. A pleasant surprise nonethless as we were forced to try something new. I opted for Frank's pasta and my boyfriend ordered the ravioli. Both were absolutely delicious and our waiter made the best recommendations.  Usually limited by my lactose intolerance I find pasta and pizzarias hard to navigate. The Frank's was perfect! And we ended with the fried dough + Nutella dessert and a shot of limoncello courtesy of the manager. Great evening and great restaurant with superb service. A new go-to!", "author": "Naria W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "My favorite go-to pizza Italian restaurant in Brooklyn. \n\nStart with the shishito peppers, and get the pizza with a ricotta stuffed crust. I love all the pizzas, and making my own with my favorite toppings (truffle - duh) and typically don't waste calories on the crust, but the ricotta stuffed crust is fluffy and perfect. Finish it off with their tiramisu! \n\nDefinitely stick with the pizza though, the pastas are pretty average in my opinion. \n\nOverall - great for a date, bday dinner, family dinner, etc. and close to the many downtown Brooklyn subways!", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "This awesome spot in Brooklyn delivers on all accounts. Decor is inviting, service was stellar, and the food was perfect. \n\nI had a salad of endive, arugula and parmesan with a light citrus dressing and a whole sea bass. Both were fantastic. The risotto special was almost as good as my risotto, which is damn good. Calamari, bruschetta, and salmon carpaccio apps were all delicious. \n\nI did not have desert but my fellow diners did and they were raving. \n\nOur waiter was super attentive and thorough. It was a great experience from beginning to end.", "author": "Brian N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "This restaurant really surprised me with their attention to detail. I had selected my dinner and drink, and went back in to my \"phone work world.\" The manager (I didn't catch her name, but a true class act!) caught me picking around my plate and realized I was unhappy. From that moment on I felt like a VIP. The staff constantly stopped  by to ensure my dinner was improving, drink was topped off and I was all around happy! After the meal the manager approached me and wanted to have a constructive conversation on what I didn't like. Took notes, listened intently, and genuinely cared about the experience I had. WOW!! \n\nLadies and Gentlemen, Yelp is full of bad reviews, often unfair. This restaurant, specifically the manager, noticed my disapproval and stepped in. She turned the frown upside down, she made my night turn around!\n\nIf you are looking for a great meal, go ahead and gamble. \n\nIf you are on a date, a business meeting, or wanting the assurance of a guaranteed quality evening and superior service, please try Forno Rosso. \n\nI will assure you, it was the best choice!", "author": "Kraig K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Love this place! I had the most amazing dish which was the Black Truffle Ravioli! My friend and I were visiting New York for the first time and wanted to try some Italian food. This place was nearby our hotel and I'm so glad we stopped by. The ambiance was great and the server was very knowledgeable and offered a great selection of wines to pair with my dish. Whenever I go back to Brooklyn, I'll be sure to stop by this place again!", "author": "Chynna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Stopped in earlier today for lunch for a co-workers birthday and we were not disappointed.  We had several panini and pizzas - all were delicious.  The service was fantastic from entrance through exit.  Just the right amount of attention - I hate when I'm entirel  I had the Salsicca panini and was very pleased with it.  I would strongly recommend them for a meal - my other co-worker said he often calls in an order and picks it up to take back to the office.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Totally satisfying!!! Carlos was our waiter and he and he mad us feel like he truly valued our patronage. A true class act! We had the peppers, chicken meatballs, whole fish, brussels sprouts, the meat and cheese plate,and the special margaritas! ( Yeah I can put it away, don't judge LOL) Great food worth every penny. Credit to the manager because the entire staff including the Bartender was on point and customer satisfaction driven. It is a breath of fresh air to go to a restaurant and enjoy the entire experience. I will be back.", "author": "Jonn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Stumbled across this place on a whim and it took me by a surprise at the quality of their food. Steak with eggs and forno rosso pizza from their brunch menu are both good picks and very filling for two. The steak was cooked slightly rare, which added more flavor to the meat. Forno pizza has very thinly spread cheese, which complimented the thinly sliced prosciutto. Loved the crust with cheese inside and the not-too-chewy prosciutto. \n\nThe space is roomy and our server was friendly and accommodating. Would recommend for bigger groups because there are plenty of tables.", "author": "Yaesol J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-29", "description": "Not worth it. It's brooklyn, you can get pizza anywhere. Why stop here? Staff can be rude \u0026 it's another hip pricy food joint in downtown Brooklyn nothin fancy", "author": "Jessilyn R."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}