{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-11", "description": "Ordered a main course salad and got a thimble full of diced, cold vegetables. Without a doubt one of the most uninspiring salads in my life. Just as unspiring as the waiters and maitre d' who didn't seem to care about their level of blasé. Why maitre d' has to be snotty I don't get.\n\nThe place was only half full so it wasn't an issue of stress. It was so obviously obvious that no one could ever be satisfied with so little food so we politely pointed this out and we asked could we at least have some bread with this? Four half dried thin slices of bread was dropped  by our table without a word. No sorrys, no nothing.  \n\nWhere's Chef Ramsay when you need him?!\n\nNot going back. We topped up at the nearest Starbucks.", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "Great spot for a quick and tasty lunch. From perfectly cooked al dante pasta bowls, to firewood baked pizza pies you can split or enjoy solo. The staff is attentive and will never steer you wrong when asked for menu suggestions. A few dished i have tried and recommend thus far : tartufata signature pizza (im not even into mushrooms, but this was delicious), fettuccine bolognese (pasta and meat sauce, saucy in all the right places), and a great and healthy avocado gambretti salad (with shrimp)!!", "author": "Tahsya M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-15", "description": "The short:\n\nThe pizzas are consistently delicious, the BYO keeps the cost down, the wait staff is friendly and relatively attentive but the owner/manager that lingers around, is awkward and a bit rude. Downtown BK has been in desperate need of some eateries and, while not amazing, it is good to have a local pizza place.\n\nThe long:\n\nI was waiting with great anticipation for Forno Rosso to open and since it has I've been there a few times.  If I didn't live in a restaurant-deprived area then I probably wouldn't have returned after my second visit.\n\nThe second time that my wife and I went there the service was a little discombobulated.  We had one person take our appetizer order, two other people offer to tell us about the specials and then forth person (the owner/manager) took our dinner order.  We ordered one of their pizzas and the chicken milanese special.  \n\nIt wasn't a terribly long wait for the food but once it arrived we realized that the pizza was a white pizza, not the one with marinara that we ordered.  Understanding that the restaurant is new, combined with not wanting to wait longer for another pizza while the chicken got cold, we decided to keep the pizza that we were served and just ask for some marinara sauce.\n\nI flagged down the owner/manager and my wife asked for a side of marinara.  The guy then said in an extremely condescending tone, \"oh, did you not understand that you were ordering a pizza without sauce.\"  To which I felt the need to reply \"um, no ... you brought us the wrong dish, we didn't order a bianca pizza.\"  \n\nAt that point he said nothing and left.  We waited 10 minutes and thought to ourselves - why is this taking so long - maybe he's bringing us the pie we ordered accompanied by an apology.  Wrong - he came back with a small side of sauce, plopped it down and left without a word.  Needless to say, I was not pleased with his attitude or the fact that ultimately we ate a cold pizza that we didn't want.\n\nWhy is this guy there?  If a restaurant decides to have the manager on the floor it should be to ensure efficiency, make the customers comfortable, and occasionally smooth over issues created by the servers or the kitchen.  Instead this guy was the issue.  He just walks around pretending he's the mayor shaking hands and patting people on the back while contributing little to (and in our case detracting greatly from) the actual experience.\n\nThat said, the pizza is good and it's nice to have another restaurant in the neighborhood.  I just make it a point to get take out or try and deal with the owner/manager/mayor/guy-sitting-at-the-bar-staring-at-his-phone as little as possible.  \n\nNote - It's interesting to see how many of the reviews are from people with only 1 or 2 reviews on their profile ... just sayin'", "author": "Collin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-31", "description": "Went for dinner over the weekend.  Service was pushy on ordering extras, drinks, etc. My sea bass did not come deboned, but was well cooked. The atmosphere was more that of a bar than a restaurant, complete with soccer on tv. Overall, it was meh. With different expectations, I might not have been so disappointed.", "author": "Irene S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "Wow! They make some of the best pizza I've had. For calibration - we spent a week in New York and went there three times. Yes, three times despite the fact that there's so much other good food around. OK, the third time was to pick up a backpack I'd left there the previous night but nobody protested at the thought to have lunch there the following day ... \n\nPretty much all pizze are great. Some of my favorites are the Margherita (the one with house made mozzarella and not with the mozzarella di bufala) and the Rosemary Bianca. But even their bread served with the starter is delicious. Nice sourdough and very chewy. And don't get me started on the desserts. Excellently done, albeit a bit pricy compared to the pizze. The coffee is well done - typical Italian bar coffee. Not the single origin high end roasts you get at Grumpy and co. but the type of coffee you'd find in Italy. \n\nThe staff are super friendly. Some of them are still a bit green but all try to do a good job. The interior design is perfectly executed (good color coordination with the red brick oven, stone, steel, glass, Italian posters, firewood). Almost too perfectly done for a single restaurant (we asked several times if they were part of a franchise just because it all matched so well that it was unusual to find in a restaurant of this type). \n\nIn summary - go there now while they're starting up. I'm fairly sure the place will be packed soon. Right now the pizza is a bargain given what you're getting.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "I can't testify to the restaurant's quality, per-se. I stumbled in here while walking around in need of a cold beer and a bathroom. What I can say about this place is that 1) They now have, verifyably, their liquor license, and 2) There's a vocal energy about this place (the hostess, the bartender and even the chef, himself) that they're proud of what they've made here for the downtown community, and they intend to be a mainstay. Good luck to them. It is a lovely place.", "author": "J.C. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "The place is fairly new and allows BYOB. We ordered a couple of pizzas and the gnocchi. The italian in the group gave a solid thumbs up for the dishes and I concur. The crust was perfectly crunchy and the cheese was perfectly cooked. \n\nI also loved the ambiance too. The industrial look mixed with the vintage posters reminded me of San Francisco. This is definitely the best brooklyn based italian restaurant that I can recommend. If you are in Fort Greene, don't hesitate to walk over and try it out.", "author": "Rahul H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Great pizzas and pasta. I love the thin crust of the pizzas and the margarita one is delicious. \nThe restaurant has a kind of industrial decoration with a see-through window in the back where you can see the oven. It's a nice place when you want to chill on a Friday evening. \nWaiters are attentive and the manager (Giuseppe) is friendly and conscious of customers' good experience in the restaurant.", "author": "Trinh And Laurie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Wonderful service and great food!  We were seated immediately, and greeted by our server. We had the mixed greens with lemon and oil, and it was dressed perfectly. The bread was warm and soft, and we loved the lentil accompaniment. Our pizza was delicious. I would highly recommend.", "author": "Melodie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Bomb pizza ! First time in the city for a friends birthday \u0026 We were going to take our food to go but the mellow environment and the awesome bartender who was very attentive provoked us to stay and we did ! Pedro, our bartender was on it ! Not only was the food delicious but the drinks and service was great ! Definitely coming back next time we come to NY city again!", "author": "Lizbeth R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "I'll preface with THIS PLACE IS AWESOME! I've been here twice since it opened and have been completely satisfied with not only the food and decorum but the service as well both times. The staff is attentive without being overbearing. They're there when you need them but don't linger or hover (in case you're secretly gushing over Chef Giuseppe). Speaking of Chef Giuseppe...he was very welcoming and came to our table to greet us with a burst of personality (which most chefs and managers usually lack). \n\nEverything we had from the gnocchi, some eggplant thing, salads (especially the one with Giuseppe's special sauce), to the tiramisu and lemon gelato were amazing.  But wait I save the best for last... (drum role please) THE PIZZA!  The pizza is made in the red oven which you can see from the dining room, which is so so cool. All of the pizza was amazing. I am pretty sure we had more but I remember and love the Siciliana, Margherita, and Blanca. They were flavorful, crispy and totally amazing. \n\nThe food, service, and decorum are all great and deserve an A+.", "author": "Jennifer W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Hands down the best pizza in all of NYC. I lived in southern Italy for a while and I've been on the hunt for true Napolitano pizza in New York ever since. This is it. Go there, order as much as possible, and listen to Luca. He just knows. This place, these people, and their food would make Italy so proud.", "author": "Myra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Came here with a large group of family, and friends. Everyone ordered different things of the menu and they all loved it. The pizza is really yummy here!", "author": "Alina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Food is amazing. This is as close as you can get to Italy short of flying there. The black ink linguini and the papadelle tartufo is absolutely divine. The interior is tastefully decorated. This will definitely be a staple restaurant we frequent.", "author": "Tony H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "PERFECT FOR THE HOOD! \n\nCome on out and support this place. We need great restaurants and this place seems to cover it! The pizza was deeeelicious. Food took a while to arrive, but service was friendly and once we tried the pizza, we forgot all about the wait. Besides, I'm sure that will improve. I'm willing to wait a little extra for quality food!\n\nLooking forward to going back. They said they will be expanding their menu. Can't wait!", "author": "Scott M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "I called fifteen minutes before arriving to let them know id be coming with a group of 11 and they were very accommodating. Warm welcome as we entered. Service was phenomenal. Both waiters who helped us were fantastic. \n\nHIGHLY recommend the Bolognese and the Tartufata. They were unbelievable!", "author": "Kat A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "Very very good place. It's new so still working out details, but be patient being this is the first good restaurant opened this side of Flatbush.....so far.  That's why I'm giving it 4 stars. Our server was a sweet and bubbly waitress, very apologetic about the items that weren't quite ready in a cute and funny way. \n\nThey start you off with a delicious lentil tapenade and bread. The appetizers are pretty large portions. Pizzas are really very good. They don't serve alcohol just yet, but  allow you to bring your own. We grabbed a bottle from wright \u0026 goebel and were set. \n\nTry it out, you will be please with the food.  I'm looking forward to what else they have in store.", "author": "I Love Cheese E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "I live across the street from this place so was very excited to see new pizzeria opened in our neighborhood. The restaurant has a great decor, very Brooklyn, exposed brick, lots of space, with a big kitchen in the back and a bar in the front. They don't have the liquor license yet but there is a liquor store 2 minutes walk from there with an excellent wine selection so just bring your own wine, no big deal at all, you save money. \nI ordered Caesar salad to start, it was okay, nothing amazing. Pizza was DELICIOUS, thin crust, nice sauce, great ingredients, very yummy. \nI came back and tried different pizzas and loved all of them. Service was amazing, everyone super friendly and attentive, great place! Love it", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "Special thank you to Giuseppe, great and unique chef!!!! I don't want suggest nothing because everything is excellent and he is real and authentic napoletan ;) \nGreat job guys!!!\nGreat place, great space ... Friendly staff ...\nYou have to try it!", "author": "Faby B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "I really enjoyed this spot. Now, all they need is to get a brunch going :-)\n\nAmbiance: Really chic. Lots of lighting from the massive skylight windows. Exposed brick. Very cool decor.\n\nPrices: a bit above average\n\nFood: SO DAMN GOOD. We ordered caesar salad (the best I have ever had in my entire life) and the rosemary pizza (a white pizza that was really flavorful). The pizza, by the way is 12\" which we shared between two people. I think the pizza could be shared by up to 3 people depending on level of hunger.\n\nService: The servers were attentive. It was not anywhere near crowded, but they checked on us often and were very quick to refill our water. \n\nOverall, I would definitely return and certainly recommend.", "author": "Mrs S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}