{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "Happened to be in the neighborhood and decided to drop in. The pasta and sauces were great and the service was helpful and accommodating. Even with a 2-year-old and gluten allergies, we were taken care of served a delicious meal.\n\nThe gluten-free pasta was cooked well, which is saying something. :)", "author": "Matt H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-23", "description": "This place was a nice surprise! There was no wait at 6 PM when we were seated and the waiters were very kind. We enjoyed most of the dishes we ordered and I would consider this a success since we came to this place on a whim.\n\nThe happy hour prices for pasta and pizzas were really good deals. \n\nTruffle ravioli (5/5):\nThis was divine. The sauce wasn't too heavy and had great truffle flavor.\n\nFettucine Bolognese (3/5):\nAn average dish but the sauce and pasta paired well together. We couldn't taste the veal so it could've been any meat really.\n\nCapricciosa (2/5):\nThis was kind of a disappointment. The crust on the pizza was really soggy and had no crunch to it. I'm thinking the sauce was too heavy for the crust to hold up. The toppings (ham, mushrooms, black olives, and artichoke) all didn't have much flavor either. The pizza overall was quite bland and soggy.\n\nBurrata (5/5):\nThis burrata dish was really good! The cheese paired really well with the tomatoes, arugula, and balsamic dressing. You can never go wrong with burrata.\n\nOverall, we had a really good time dining here. The ambiance is also really trendy but casual. A good place for dinner and happy hour.", "author": "Crystal C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Very good squid ink pasta which was one of their best dish. The whole interior was very unique. Liked the high ceiling also, The waiter, Brian, was super friendly!!", "author": "Yoon Jung H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "We made it out to Forno Rosso during a nor'easter. It was a great dinner. I had the bolognese pizza and I would definitely order it again. The best part of the experience was definitely the staff. Diana and Julia are awesome. If I was local I'd definitely be a regular.", "author": "Jake P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "One of the best Italian restaurant's in the downtown Brooklyn area. It's beautiful restaurant with a great staff. So attentive. The good is really good. Try the pizzas. Delicious.", "author": "david l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Food and service is excellent!! Rahel was our waitress and she was wonderful!! She provided exceptional service and she was very friendly.   Looking forward to going back!\n\nRita- Connecticut", "author": "Rita N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Very cute vibe inside, the food was great, and our server Ellie was super fun and sweet :) we'll be back to try the pizza (looked yum)!", "author": "Joseph M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "i'm not positive how to spell her name but \"ellie\" was lovely. very charismatic and charming. food was also good i recommend the octopus cause it was quite great not rubbery at all.", "author": "Jake H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-23", "description": "Elle was a delight! After walking around for a while trying to decided what to eat and stumbled into here. It worked out super well! Everything was great. I would eat here again. Low lighting but I liked it. Mood was fantastic. Elle didn't stop smiling.", "author": "Penny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "I really enjoyed this restaurant!  It's a great spot to visit if you're in the mood for Italian.  My husband had the eggplant Parmesan, which he loved.  I'm ravioli was very tasty as well!  The service was great, no complaints there.  It's a nice family friendly place, but also great for a date night.  Great ambiance!", "author": "Marisa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "Recommended by staff at the Tillery Hotel. Did not disappoint. Great staff and service. And the food was amazing. Glad we came here'", "author": "Simon R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "Talk about YUM! We're in town for the A-10 tournament and just wanted something familiar. Cue up yelp, and here we are! Restaurant is adorable, food was cooked beautifully and out to the table maybe ten minutes after ordering. The staff is excellent and very friendly! We had Ellie, she was bubbles and sunshine! Answered all of our questions about the menu and was attentive throughout our dining experience.  Recommend making a reservation and giving this place a try!", "author": "Aubrey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "To be honest with you, we were headed to another spot that ended up closing early.. but Jesus took the wheel and we parked here!\n\nMy wife debated whether this was a hipster place or not, look wise, its hipster-y, a Hipsteria if you will. But FOOD wise, you can put this place up again ANY italian spot you'd like. Phenomenal.\n\nWe started with the calamari. This was served what I call \"medium\" for calamari, you bite right though easily, versus a more \"well done\" calamari that gets to be on the chewy side. It was a perfect golden brown, and golden in taste with a smooth spicy marinara.\n\nMy wife enjoyed the bread and olive oil with leeks. I dont do leeks, but she raved about the sauce, so I had to throw it in there.\n\nI had the special I saw outside, shrimp, calamari, octopus in spaghetti w tomato sauce. I was surprised to have seen perfectly al dente noodles sitting in this beautiful yellow tomato sauce. The seafood was very fresh and tender through and through.\n\nDespite me having the special, the winner here today was- Shrimp taglionini(may have butchered spelling)! I dont normally do squid ink noodles, but wow. The sauce here was a perfect velvet texture with very bold cheesy taste, we were blown away.\n\nWe finished with, or rather I finished with Affagato caffe. My wife doesnt do coffee, but she had that gelato sitting on top. Perfect ending to a fantastic meal!", "author": "Devon O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "The food is always amazing!! And the staff are so nice. Especially Ellie!  She is so nice and has a great attitude.", "author": "Andie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "My girlfriend and I popped in for happy hour. Ellie was our server and she gave us some great recommendations on what we should order since it was our first time here. Her energy was warm and welcoming and made dining here an overall great experience.", "author": "Khali R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "This place has an amazing service and food. It's became our regular spot a few months ago, after we moved to this area. They have a different specials every day, which is soo tasty. The staff is always friendly, they even added us to the vip list. We came in for dinner yesterday and manager Julia gave us Christmas present from restaurant.", "author": "Yura B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Hosted a party here on rather short notice and the staff were very accommodating. I was able to bring party supplies and set up even with other customers in the vicinity. The food was outstanding and it ended up being ideal to have the party indoors as it turned out to be a rainy day. High ceilings and hip, industrial decor. Would happily come back and refer to friends.", "author": "S P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "My friends \u0026 I just ate here for dinner and our server was Ellie. It was her third day on the floor, but you couldn't even tell because she was AMAZING! So sweet and personable which just made our experience that much better. Our food was delicious and the service was incredible! Definitely would recommend this place to anyone in the Brooklyn area.", "author": "Jordan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Forno Rosso has been around for 4 years and they will remain in business for a long time with their quality pizza. My oh my, they have some excellent choices on the menu for personal pies. Anna was our waitress and she did a good job serving us, she was so friendly. My friend and I shared the Charcuterie \u0026 cheese platter- 4 cheeses and 4 meats. However, the bone I have to pick with that is technically it's only 3 meats. Speck, Mortadella and Salami. From my understanding, there was supposed to be imported prosciutto in there but it was just speck. Not a big deal, The platter was good, and the focaccia set the tone for how the pizza was gonna be. I did ask if the meats were imported and she said they were domestic at first and then changed what she said and mentioned that they were actually imported. I could tell from the taste of the Mortadella that it was not from Italy. It tasted a lot like bologna, and it was slicked to thick. The mortadella from Italy will typically has pistachios or peppercorns in it, it will taste more like pig and its always sliced more thin. The speck was imported though. We had the meatballs which were on the house! such a nice gesture by the staff, they were really good! My Amalfi breeze cocktail was excellent as well. It consisted of white rum, fresh basil and limoncello. Great combination and i've never had anything like it before, I would definitely order that again. After our cocktails, we both got glasses of the Nero D'avola which was great as well. Then the pizza's came...here comes the good part! We decided to order 3 of them, because we were starving and lets face it, theres so many options on the menu so when in doubt, always order more than you should so you can try as many pizza combos as possible. First of all, the Regina Margherita was top notch! the bufala mozz was creamy, but since the pizza's are cooked longer in that oven due to the 750 degree temp, the bufala was actually melted nicely on the dough and wasn't falling off the pizza so easily. Great crust, I'm unaware of the type of flour they use but man that dough was out of this world. The Forno Rosso pie is a MUST order. Ricotta stuffed crust!? Hello that's unheard of at most of these Neapolitan restaurants. So unique, it added another impeccable element to the pizza. This pizza already has, Cherry tomatoes, bufala mozz, prosciutto di parma, and fresh basil. The sweetness from the tomatoes, delicate, nutty taste from the prosciutto, and the creamy, milkiness from the bufala was heavenly in every aspect. It was extremely tough, but when it came down to it The provola/burrata and speck pizza was the winner. I have never had a pie like that before, everything worked so well together. The creaminess, soft texture from the burrata paired perfetly with the provola which is thicker and different in texture but combined with the smoky flavored speck (Imported from Alto Adige) and the char from the pizza, it was one of the best white pie's I've had in my lifetime. Let me tell you something, I've had I've had plenty of them through out my 26 year career as a pizza eater and this was as unique of a combo on a white pie that you'll ever have. 3 ingredients that all play such a significant role in their own form. \n\nThe dessert was also courtesy of the staff! They didn't need to do that, it was very generous of them. The fried dough with Nutella and strawberries along with the tiramisu were excellent. Tiramisu was nice and moist, soaked in espresso with the rich and creamy layer of mascarpone. It melted in my mouth. As a side note, I really admired the Viva Italia painting with the lady riding the vespa with every region in Italy written. I really loved that, it instantly brought me back to the cobblestone streets of Italia.\n\nMake no mistake about it, there's a lot of key elements that I look out for when I evaluate Italian restaurants. In our culture as Italians, it's about the overall dining experience. The presentation of the food, the atmosphere, the staff, the quality of ingredients, the decor, the pizza oven, the history, and the longevity. A lot of people will just go through the motions and have good food and thats satisfying enough for them. Which is absolutely fine, I'm not knocking them. For me however, it's about how you're treated and the little things that make you feel valued as a customer which ultimately leads to coming back again. I ask many questions, not to see how they respond and test them but more so because I am interested in many things that your everyday customer wont typically ask. This is my passion, my culture and I know good pizza when I have it. This isn't good pizza, it's GREAT pizza. The staff did a great job, and they had a very kind hostess who was from Calabria. The manager was working hard all night. He was very attentive and made sure every table was satisfied. I will be returning to Forno Rosso on a quest to try the pastas and many more pizzas!", "author": "Matteo T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-27", "description": "Took a chance on this place from Uber Eats after flying in from the D/FW area. Absolutely the best ravioli I have ever had!", "author": "Kylie M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}