{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Remember that time Alicia Keys sang \"THIS GIRL IS ON FIREEEEEE.\"\n\nI think what she meant to say way, \"FORNO ROSSO'S PIZZA IS ON FIREEEEEE.\"\n\nYou feel me?\n\n5 stars. \n\nJokes aside, (wasn't a joke doe) I had their Regina Margherita pie tonight which has buffalo mozzarella, their eggplant appetizer and their bruschetta.  If you're a garlic lover like me then you def gotta try the bruschetta.  The eggplant appetizer has the most DELICIOUS tomato sauce and the Regina with its soft, chewy, perfectly burnt thin crust is outstanding\n\nI love this place.", "author": "Alexandra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "The happy hour from 4p-7p has beer, wine and cocktails. It's a great deal, especially when paired with the diavola pizza! Huge venue that is perfect for big groups.", "author": "Rose S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "I can't believe it's taken me this long to review Forno Rosso--my absolute favorite pizza in Brooklyn! It's a cute little place with a warm industrial feel and tucked just off of Flatbush Ave. We love that it's never overly crowded here and the service is always prompt. They have some happy hour specials (no pizzas) that are a decent deal.\n\nThe main attraction here are the pizzas. Everything is excellent (we have tried pastas and salads and desserts) but the pizza is outstanding. We usually go for the traditional margherita and the one of a kind tartufata---a white pizza with mushrooms and truffle oil and is out of this world! Absolutely fresh and delicious!  We also enjoy the arugula salad--big and perfect to share, as well as the Nutella desserts.\n\nCould not more highly recommend a pizza spot!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "Very good pizzas and rustic Italian. A bit pricy  but good service. For the neighborhood that lacks a lot of options, this is a rare gem.", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Oh, what a gem! \nI did not expect to find such a nice Italian restaurant in this particular neighborhood. \nI enjoyed the ambience of this place. \nHomemade pastas, freshly baked bread and pizzas are to die for (I might understand why people don't like this pizza for a take-out---it's a super thin-crust yamminess that should be devoured right out of the brick oven and not schlepped around in a box for 15-20 miutes).\nBurrata and tomato salad are also worth mentioning. \nAny pasta on the menu is making me drool, but tagliolini (black shrimp tagliolini) are simply out of this world (cooked perfect al dente (and fresh of course: yeah, not like some places that freeze cooked pasta and then throw it in the hot water).\nDessert menu does not disappoint either no matter what your heart chooses.\nOne puzzling item on the menu though is salmon tartar. We did not risk to order it after the first time. I called it a \"cucumber and onion salad with a thought of salmon\"-not a well-balanced and weirdly combined dish: it came with scallions/onions (not in the description); and way too many cucumbers. \nAll 3 times that we visited the place, our server happened to be Mai. She was attentive, knowledgeable about the menu and fun to talk to. She even remembered our weird requests. :)", "author": "Taty B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Ate here 8/18/18. Excellent!!!! Service was superb and the food even better. Upscale and trendy. Mushroom pizza was great. Don't miss this Brooklyn gem.", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "The food was amazing and the service even better. In a busy Wednesday night, Rahel made us feel so comfortable. 10/10 would recommend", "author": "Chris K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Once you walk in, you'll smell the scent of oak wood which was really pleasant. Big open space and friendly servers. \n\nThey have a number of salads and anti-pasti on their menu but only two pasta dishes. The bolognese and the truffle mushroom. The latter was pretty good. \n\nThe star of their extensive list of pizzas was the truffle oil and mushroom pizza. Yeah, truffle oil is a sin but this worked really well with the pie. \n\nDefinitely one of the better places in the area, but that isn't saying much either.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Very good experience.  My husband chose this place to try.  Not a far walk from our hotel. We each ordered our own pizza and they were delicious. We didn't get dessert, but the couple next to us did. It looked great, but we passed Junior's and they have excellent cheesecake there. I had a cocktail called called the Italian Gimlet and it was the perfect amount of alcohol.", "author": "Yolanda L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "Walked in by 11:30, hostess said we could only order pizza but waiter( looked like the manager) was nice enough to let us order the full menu. To start calamari 10/10 was made perfectly Shrimp \u0026 avocado 10/10 was delish. Entrees were create your own pizza, lasagna 8/10 , truffled ravioli 8/10.  Desserts were truly authentically  made tiramisu 10/10 \u0026 cannoli 8/10", "author": "MG P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-17", "description": "I LOVE the food here. Have eaten in the restaurant several times with different groups of friends. Love the broccoli rabe, tartufata pizza, grilled octopus, bread served with olive oil, friendly service. It's also surprisingly kid-friendly, with high ceilings, plenty of toddlers dining with parents.\n\nDelivery not recommended.  On Wed May 17, 2017 I ordered food delivered to a place that was just 7 minutes' walk away from the restaurant. It was for a surprise birthday party.  To make sure they had enough time, I placed the order 1 hour and 15 minutes before we needed the food.  \n\nTo my great surprise, the delivery guy was *more than 20 minutes late.* I had been standing on the sidewalk in front of the building for 15 minutes trying to see a lost delivery guy.  When we finally located him, he had been just sitting inside a car on the same street, but for some reason two whole blocks away, just sitting there lost.  He hadn't even thought of getting out of the car to look for the correct building number, or maybe typing the address into Google Maps.   WOW. If I were the restaurant manager I would have immediately offered a discount to apologize for the delay, but no such luck.  I definitely won't be ordering delivery again!", "author": "Sophia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Amazing spot with really good quality authentic Italian food. Truffle ravioli were amazing - would melt in your mouth! \nTartufato pizza are to die for - thin crust and tastes great. We were pleasantly surprised to find this restaurant! Highly recommend!", "author": "Arthur C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-17", "description": "Two stars because the food is actually quite good. But save yourself and DO NOT ORDER DELIVERY! 2+hours and cold food arrives at your door. We ignored reviews on Seamless... don't make the same mistake. The restaurant was accommodating and refunded us entirely but based on reviews we've read, I don't think this was the first time this has happened.", "author": "Allison M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "This is my favorite Italian restaurant in downtown BK! It's perfect for a date, or a night out with friends. We took my roommate here for her birthday dinner and she was thrilled! \n\nThe ambiance is beautiful, and the food is absolutely incredible. I've been here at least 6x and haven't had a dish that I didn't like! I can't recommend this place enough!", "author": "Alexandra E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "The service is absolutely amazing at that place, Eduardo and Geoffrey were over the top, the unlimited pizza is fantastic, so is the bottomless brunch (I legit did not see the bottom of my glass once). I absolutely recommend this place!!", "author": "Bastien F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "The atmosphere of Forno Rosso is awesome. Very clean, casual place. Wait staff was very nice. \n\nFood was pretty good. Pizza dough is awesome, but wasn't the most amazing homemade pizza I'd say. The pasta dish was amazing though. The tortellini filled with veal was delicious. Definitely recommend. \n\nOverall, would recommend trying if you're in the area.", "author": "Kim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-30", "description": "Good pizza and very healthy servings. I couldn't finish a whole pizza after sharing an appetizer.\n\nService staff was also very nice. \n\nThey have a large open bar area with a large TV. Good spot to catch a game.", "author": "Seanté B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "We had a Pizza, a Lasagna and the black Pasta with Shrimps and some Appetizers... Everything including the service GREAT! Best Italian food in BK", "author": "Jay G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "Mai was the best server ever, highly recommend the ravioli truffle cream sauce and just when I thought it couldn't get any better then had fried dough Nutella desert", "author": "Caitlin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Came in on a Friday night and we were seated immediately for 2. The check-in on Yelp gives you a free drink (cocktail, wine, or beer) which was great!\n\nOur server, Luca, was very helpful and patient. The atmosphere is nice - music adds a nice touch and isn't too loud. \n\nThe pizza tastes great. Dough is soft and different from regular NY-styled pizza. You can't go wrong with any choice!", "author": "Catherine L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}