{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-18", "description": "Today was my 4th time eating dinner here. I travel from out of state for work. The food is consistantly delicious and the service is always above and beyond. We never feel rushed when we come after work and want to relax a little before ordering the main course. Great Happy Hour and relaxing atmosphere!! We will be back!!", "author": "Monica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Can we please talk about how much I love this place! I'm only upset because I didn't discover it sooner. The pizza is so so so good. I mean like you're in Rome kind of good. They have a brunch special with \"all you can eat\" pizza and trust me, you just want to keep eating it and eating it and eating it. Pizza with truffles and ricotta; with prosciutto and fresh parmesan; or a simply divine Margherita. Their meatballs are epic, moist and incredibly flavorful, and a marinara sauce you want to eat with a spoon, and a dollop of fresh ricotta on top. I had a chicken dish with mashed potatoes and brussels sprouts that could have used more truffle oil in the sauce, but I still ate the leftovers later and was happy to do so. However, the thing that takes the cake, is their amazing house Pinot Grigio! I mean I HATE Pinot Grigio, and it was amazing. They have a happy hour from 4 to 7 as well, so really, stop reading this and go eat!", "author": "Andrea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-13", "description": "Amazing food, great for kids and great for groups! Very friendly staff and a warm ambience. I'd definitely recommend.", "author": "J. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "One of my favorite Italian restaurants in downtown Brooklyn. Their squid ink pasta is delicious and I highly recommend that dish. Plus they have happy hour dishes as well which are great. Definitely order their fried calamari. Also, the bread they bake and serve is so tasty that you have to try it to understand it. Staff is friendly there especially the manager.", "author": "Christy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "Wow! Came out for pizza and a drink, but left with a favorite hangout. I highly recommend the food and drinks. Emily \u0026 Ellie will make you feel at home!", "author": "Paige M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-05", "description": "Yum. Yum. Yum. That is all. No wait, there's more....yum. Forno Rosso definitely surprises you with the quality of their food. Everything was delicious, from the salads (we ordered the caesar and the apple goat cheese), to the entrees. I had the ravioli and my plate was clean in .5 seconds. My friends enjoyed their entrees as well. The salmon especially one said was amazing. The staff is very kind here and our waiter in particular was the best. He was very attentive, kind, and fun. I would definitely return here even if the service hadn't been great because the food was that good.", "author": "Alysha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-30", "description": "This has to be the best place to grab a slice in DT BK. From the menu to the waitstaff (everything/everyone is a snack).\nThe buff one behind the bar was a real pearl.. he delivered my Negroni after hand crafting it with his strong hands.\nThe happy one with the smooth head took excellent care of us from start to finish. He's pretty funny too but don't tell him to his face or prepare to be read like a library book.\nWe will come again ;) and again ;)", "author": "Pistachio J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "The crust on the pizzas here are so doughy, thin and chewy. It's like naan pizza. SO good. Definitely recommend the pizza if you end up coming here. \n\nThe burrata here is amazing as well.\n\nGood happy hour deals.", "author": "Jane N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-29", "description": "Cozy restaurant in Downtown Brooklyn - gluten free pasta was delicious and service was pretty quick. They have a GF penne that you can switch out with most pasta dishes on their menu. Limoncello sorbet was also good!", "author": "Irene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-23", "description": "Food was great! Loved the pollo arrosto and the shrimp tagliolini! Our server Ellie was also very friendly. Such a great neighborhood gem!", "author": "Ting-Yan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "My new favorite Italian spot in the neighborhood.\n\nWent to Forno Rosso for the first time looking for late lunch. The staff was very welcoming and friendly. The place has a cozy and rustic style and a lot of natural light coming from the roof.\n\nWe had the cold cuts/cheese platter as antipasto, and bolognese lasagna and fried pizza I forgot the name but it is a signature pizza like margherita style, but really juice and tasty.\n\nFor dessert, I had the mojito panacotta and I can tell it was the best panacotta I have tasted so far. So rich in flavors and texture. The mojito mint kick is a PLUS...they also add some kind of guava and passion fruit sauce on top that it is to die for. I LOVED it!\n\nI would definitely come back to this restaurant when craving Italian food. Convenient location, nice menu, friendly people... and great lights that work for selfies ;-)", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "My awesome friend picked this place for dinner and she has amazing taste. The food was delish!!! We ordered the shrimp avocado salad \u0026 beets and arugula salad as appetizers to share. Both salads were light and flavorful. It was the perfect start to even better entrees. \n\nI had ordered the squid ink pasta with shrimp! It was delish. Pasta was cooked perfectly and the sauce was not overly salty. I enjoyed the sauce so much that I used the bread to dip the plate. There were plenty of shrimp and just overall a very tasty dish. \n\nI was also able to sample the truffle ravioli which was also very creamy and cooked to perfection.\n\nThe place was spacious, decor was dimly lit, and no wait on a Friday night. I'd definitely go back to try more food!!!", "author": "Ying L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "My hubby and I walked to Forno Rosso because it was close to our hotel and it was my birthday so we needed to celebrate!  We sat at the bar and were well taken care of by Pedro.  We started with the tuna tartar which was full of unexpected flavors like jalapenos, onions and avocado.  I could have ordered another plate of that and been very happy.  We ordered the Diavola pizza with salami for our main course.  The tomato sauce was extremely fresh and the dough was soft yet chewy.  Because it was my birthday, we were treated to Lemoncello shots and a Nutella dessert.  There are huge TV's over the bar, but the lighting and tables are perfect for a romantic dinner with the significant other.  We had a very memorable experience and Pedro helped make it a perfect birthday dinner!", "author": "Alyse H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "A quick bite, on a short vacation trip up to Brooklyn, Love me some pasta, you can reserve and make your own mix of spaghetti", "author": "Nicholas N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "AMAZING pizza and happy hour. $10 for a great, huge pizza with mushrooms , etc. Th beers are wonderful, happy hour from 4p-7pm. Just great!", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "I started out my experience here with Emily who was a tremendous help with the menu and great service! Only to finish the meal and drinks having so much fun and an amazing experience with Ellie and Lois who got me smiling and laughing out  had to stay for more drinks and food! I would absolutely come here again and again! 10/10 recommendation!!!", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Amazing food. Great atmosphere. Highly recommended. Had so much fun. The staff is incredible. Amazing experience. Food was fantastic. And honestly the cocktail list is to die for.", "author": "Pete C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Just had a special Mahi Mahi dish and it was a blast! With my regular gin martini with big fatty olives!! Can't be bad!!! Theresa and Julia made my day they are super welcoming! Definitely come back again and bring my friends! They have those high chair tables that are great for big groups.", "author": "João M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "Love this place! Our waitress Ellie was also great! She was so accommodating and friendly. Would recommend to any one", "author": "Nicola P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "I love the food here! Great service, and the food is consistently delicious!  Eggplant parmigiana and kale salad are my go to's! :)", "author": "Sarah H."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}