{"aggregateRating": {"reviewCount": 611, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "The food is disappointing. The pasta has a overwhelming flavor of beef. The brussle sprouts is way to sour. Can't believe I payed more than $30 for a meal like this, not to mention the server who basically ignores you. When I came out, I smell like I just cooked a steak by myself. I disliked this place so much that I got a Yelp account just it write a review on this place", "author": "Joy Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-29", "description": "Great staff, very attentive and all smiles. My wife and i had the Calzone funghi and Bianchi pizza. Calzone was dull, had very little on the inside. Bianchi pizza was tasty. The dessert made up for the dissatisfaction with my calzone, Mojito Pannacotta saved the day!", "author": "Jay A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "Great ambiance and delicious food.  Very helpful waiters including Daniel, the owner.  Hoping this excellent  neighbor resto does well.  They should get their liquor license soon too.", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "We ate here last Saturday.  The food was excellent! The Chef came out and spoke to us and welcomed us.  He epitomized warmth and customer service.  We had Branzino, pizza, pasta, salad.    Our family met here from different parts of the city, and I drove one hour to get to the location from upper Manhattan.  I was not disappointed.  I really like the bar as a \"go to \" location.  The fish was cooked perfectly, and the pizza crust was crispy and made me wish for a Forno Rosso in Upper Manhattan.", "author": "Evelyn J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "A very welcome addition to the neighborhood - nice space, warm service and good solid Italian food (with enough of a gourmet/foodie twist that it isn't just your run of the meal red-sauce place - the menu is more interesting than that). No, it isn't the best pizza in Brooklyn, but it is very solid, reliable, hits the spot, uses high-quality ingredients and is one of the very few restaurants of this ease and quality nearby. I've never had to wait for a table, but I've been glad to see a good buzzing crowd there the last few times I went.", "author": "Em S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-10", "description": "The food was amazing. We both got pasta dishes. Everything was a little overpriced for the amount of food you were getting except for the desert.  We got the Nutella fried dough and it was amazing!", "author": "Amanda N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "Stopped in for the first time last night.  The pizza was very good and wait staff/ownership did everything possible to make sure we enjoyed our first trip in.  The neighborhood really needs places like this and I am hoping they succeed!", "author": "Sam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "BEST PIZZA (taste/ambiance/value/service/location) in new york. And Im an authentic (not a culturally-ignorant hipster transplant) Italian New Yorker. The pizza, the artwork, the glowing aura of the wood-burning oven--it really is like being in REAL Italy; not romanticzed-Tuscan-tourist Italy. Forget Grimaldi's--that's tasteless american-style trash. Good pizza is a matter of national security to Italians, and nobody does it better than Neopolitans, and even though the owner isnt, the chef here is a sophisticated, experienced, authentic Neopolitan pizza-genius. Burratta, truffle, broccoli rabe, pie--yes, I'll marry you. Never thought I'd be able to describe dough as \"succulent\" till this. Everything else on the menu is a dream come true. The gelato?? I wasnt even able to speak; all I could do was moan in blissful surrender. This place rocks so much i didnt even care about cocktails or music or things I would ordinarily require going out to eat. Not only will you not regret it you will not be able to stay away!! Enjoy", "author": "Therese S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Fantastic!! I've been here several times and each time the service and food were spot on! Ask for Christian he's the best and will really recommend some great dishes!", "author": "Hotelier P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "Found this little gem while hungry after a meeting in Brooklyn for work. I have to say some of the best pizza I have had! It's a must visit again.", "author": "Mrym K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "Best pizza spot in Brookkyn! And the deserts are to die for. The service was amazing. I will definitely come here again.", "author": "Maine18 W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "Excellent food.  The pizza is perfect.  Friendly staff.  Nice, open, neighborhood feel.", "author": "Richard K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "Great service and great pizza. Beautiful space too- very romantic at night if it hadn't been the presence of the TV in the bar area.  If they get rid of the TV, I will come back and change the rating to 5!", "author": "Nina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Stayed in the area for a business trip and found this place on here. The food is absolutely amazing and the staff is VERY friendly and accommodating. Over the 4 days we were here, we ended up eating here twice. Highly recommended!", "author": "Marie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "Was so excited about the opening of this place and definitely we are not disappointed. Delicious pizza and appetizers!!! Love the decor and the atmosphere also. Will be back soon...", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "A much needed boost to the neighborhood! Pizza is AMAZING! Great decor, nice staff. Will be making many trips back.", "author": "Khaliah N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Great location. Food came out super fast. The booths in the middle of the restaurant  were a little tight but overall it was a nice experience.", "author": "Michelle J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "Great neighborhood Italian food! We have eaten here several times. It isnt too pricey, too fancy, or too casual for the neighborhood. The food is solid and the specials are special. I like the lasagna, but I usually go with the special. My husband love the pizza. Great place to have a drink and watch soccer if you are into that sort of thing...which I am.", "author": "B B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "Love, love, love this place.  The staff are fantastic and the food is to die for.  Authentic Italian food.  The fettuccine Bolognese that I had tonight was oh so delicious.  Everything that I have had has been a hit.  All of the salads are a great way to start any of their meals out and the portions are perfect.", "author": "Barbara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-16", "description": "Used to love this place - Happily ate here all the time - ordered take out and it WAS amazing ! What happened - Did they change owners or what ?  I came to order an early dinner take out. Arrived at 4pm to order 2 pizzas and the meatballs - oops they don't do meatballs anymore - ok some calamari then - oops its 4 o'clock and between 4 and 5 they only do pizzas and salads. UGH ! ok I'll have the kale salad and three pizzas   The Margherita, the Primavera and the Buratta.. I got home and the pizza's were awful - the Margherita had hardly any cheese - so saucy it was soggy. And the sauce tasted like tomato soup. The Primavera's crust was burnt black and literally had five leaves of arugula, tons of flavorless sliced grape tomatoes and once again dry with hardly any cheese. The Buratta had tiny little dots of pancetta, and once again handfuls of those flavorless dried out sliced grape tomatoes.( do they put those on everything now )\nOh and the kale salad - HAD NO KALE IN IT ! I was given a salad of baby lettuces and not even informed of the change. What happened to this place - they were so good and now I don't ever want to go back !\nOh and PLEASE someone get some bags with handles that fit the pizza boxes to take the take out home in. Walking home with three pizza boxes and a salad  down a busy windy street was no fun.", "author": "Kathy T."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Forno Rosso", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "327 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Fv-ciPGhDI0SsiXyz1dyRA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513800"}