{"aggregateRating": {"reviewCount": 64, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "This was my first Hot Chix experience. I ordered the pulled chicken sandwich and a side of macaroni and cheese. I'll start with the side and then move into the starring role. \n\nThe macaroni and cheese was good. I did feel that it was missing something, however. Maybe a sharper cheese, maybe just more salt, I can't be certain. I wasn't blown away. But, let's be honest - if you're going to review a chicken joint, you better be basing your review on the chicken. So here we go.\n\nYou can add things to the pulled chicken sandwich if you want, but I just slapped some bacon on there because I really couldn't help myself. The bun is thin, lightly toasted, and served warm. The additions (pickles, onions, lettuce, tomato) are served off to the side, which is appreciated. I left those bad boys off. \n\nThe chicken was excellent. Definitely hand-pulled. Nice, big chunks of chicken covered in the special sauce. Personally, the special sauce could stand to be a bit spicier, I think that would really pop it off. Otherwise, absolutely zero complaints. \n\nSolid 4/5, I'll be going back. Also, my wife got a baked potato, and gave it a thumbs-up!", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-24", "description": "Pretty good flame grilled chicken, the healthier alternative to fried chicken. Good ribs and burgers too! It's good that they offer brown rice as a side but their side salad was so small. It's pretty cold inside during the winter months and you will definitely smell like a bbq when you leave. Sorry I don't have photos, just videos.", "author": "Tony D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-25", "description": "Ugh. I wanted buffalo wings. The woman said they're just wings and they'd give me a choice of sauces. I ask how much: $6 for six wings,  $9 for nine. I order six. \n\nMy lunch was six \"Swanson\" breaded pieces. Soft and salty. So am I now! I should've went to a Chinese restaurant and bought four wings.", "author": "Rob B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-11", "description": "We ordered salad but the salad was not washed, very gritty.  The dressing was good.\nWe also order 1/4 chicken and a bacon cheese burger. It was not worth the money I paid.  It was not a quarter chicken but 2 very small pieces of chicken. And the hamburger was thin, cold and unappealing.  Both the \ncheese cake and mango mousse cake were too small.  We had never ordered from here before but we will not order from here again.", "author": "Rah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Just had the beef ribs OMG got the full for $20 so much meat had to take rest home wonderful service definitely coming back", "author": "Noorulhhuda S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "Hot Chix is an excellent spot for lunch. My biggest tip - call when you are about 10 minutes away so that it is ready for you when you arrive. Otherwise, the lunch lines are quite long and the restaurant is tiny and cramped. So the less amount of time I have to spend squeezed in there the better!\n\nI am a wrap lover so I have only tried their wraps so far. The Greek wrap was great. Their grilled chicken is so delicious and it was a huge portion. I was so full afterward it kept me satisfied for hours and hours. I've also had the BBQ chicken wrap but preferred the Greek. I have friends who swear by the Mediterranean wrap also so I am sure they are all tasty. Plus, for 7 dollars you just can't beat such a delicious, hearty meal!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Tasty Chicken At Just The Right Price.\n \nChicken is what they do best here and that is what I recommend you stick with.\nSides are avg. but they do the job. The portions are good.\n\nThey give a free soda with your order for their lunch special.\nPrices are reasonable.\nStaff are very friendly and always have a smile on.\n\nTake Out\nDelivery is usually pretty quick but if they are busy your food will take awhile, and more than likely come cold.\n\nEating In\nThe inside needs to be redone. At the very least a new coat of paint. \nI'm personally not a fan of the rap music videos playing on the old school tv with the horrid reception.  \n\nWhile there is a dive vibe here, the tasty food and value are why I come.\n\nIf you are looking for a tasty meal that will fill you up and is reasonably priced, Hot Chix delivers the goods.", "author": "colt s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "very tender roasted half chicken is sooo good.\nIt comes with fries and hot flat bread.\nclean restroom\n\nI'll have to try their gyro next.\nthis def be my stop for lunch at Fort Greene!!!", "author": "Rachel P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-09", "description": "Wow this place gave me the only stomach ache, it was about 9pm and I was looking for something good to eat, I was driving down dekalb when I seen chicken being grilled through their front window... I ordered Buffalo Wings and a Chicken Cesar Salad, both were gross and salty AF. The wings were super fatty and cold in the middle, when I bit into the wings you can tell that they were frozen and cooked frozen. I will never in 1 thousand years come here again after the crazy stomach discomfort that this food gave me. Peace!", "author": "Leo L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "I ordered the bbq chicken wrap (grilled chicken, American cheese, onions, lettuce, tomato \u0026 bbq sauce) for $7. My meal was delicious, fulfilling, and healthy. Very small space, limited seating. Given its proximity to The Brooklyn Hospital Center and Brooklyn Technical High School, it may be best to avoid the lunch and after school rush.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "Since the Pies-N-Thighs fiasco, we are still looking for bomb chicken, but I'm wary. This place is definitely a whole in the wall right across the street from Brooklyn Hospital. It's really a get your food to go place but we stayed since we were really hungry. We got the 9 piece chicken wings and some fries and they were solid. Typical NY Chinese food wings and fries.  Dirt cheap too, we paid $12 bucks for the whole meal.  No one slid the food across hubby's face so that was a plus. I'd come back and get some chicken to go. If your around these parts I'd go for it but don't waste your time traveling all the way over here.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-19", "description": "This place has great reviews and good pricing BUT I didn't experience anything like what I'm reading. The mac n cheese is straight from the box no flavor!! The baby back ribs, ALL FAT, and the sauce I was sent was HOT SAUCE not BBQ sauce! The fries dry \u0026 cold! I can't imagine anything being good after this encounter! 2 stars for the lemonade!", "author": "Tee P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Amazing chicken.  I read some of the other reviews.  I'd say if the place is called, Hot chix, stick to what they do best.  I can't speak about any of the other menu items.  the guys who work there are great.  Very nice.  The chicken was awesome.  If you're looking for grilled chicken on the bone with a ton of flavor , this place is on point.", "author": "Jared H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-24", "description": "I used to be a regular customer here ordering off of grub hub once a week. The delivery was fast so it was always my go to. However, after a few bad encounters with the delivery people I stopped ordering. Today I was in the mood for their ribs as I remember them to be chargrilled tasty and well done. I figured what the heck let me give them another shot. Boy I should have just stayed away! The ribs were disgusting and undercooked not like they used to be. I also asked for honey mustard instead of their signature sauce as it tastes weird to me and I got extra signature sauce but no honey mustard. To top it off the man that delivered my food was the rudest one I have ever come into contact with. He sealed the deal! Never again! The two stars is for the chicken which was well cooked and the horse string fries.", "author": "Christine M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-17", "description": "Mac and cheese is horrible, not even kraft they use something worse. The main dishes are okay , but the sides are terrible.", "author": "Samantha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "Went to visit a sik friend at Brooklyn Hospital. This place is across the street. I ordered the rib and chicken combo to go. Ummmm!!!! Yesssssss  its a little place but the food was awesome. The guy at the counter could have been a litttle  more pleasant  as he was greeting the customers. But i didnt go there to make friends i went to get food and the food was GOOD!!!", "author": "Monique B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "Pros: decent price (less than $10), free water/soda with lunch special, healthy (charbroiled chicken)\n\nCons: can be pricey to add extra sides ($2.50 each)\n\nThis spot is close to my university, but have never checked it out until recently. As their name suggests, their specialty is chicken. The chicken is charbroiled, moist, and very flavorful. I usually get the half chicken special, which comes with pita bread and your choice of 1 side dish for $9.25. If you're a student, they give you a free water or soda whenever you order a special. There's a small seating area if you choose to dine in, but I always take it to go.\n\nBeen going to this place a few times since I've discovered it. Very good place for lunch and relatively healthy. They also have ribs, sandwiches, and burritos available. Would recommend and would be back for more.\n\nProtip: If you and a friend both want the half chicken special, just order one full chicken special. It comes with 2 sides and pita bread, so you each get half a chicken, 1 side, and share half the pita bread. The meal is around $16, which means you each pay $8 and save around $1.25 compared to the original half chicken special", "author": "Ken C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "BE CAREFUL before you go there! In this restaurant you will have crackers left after rats, also if you'll order chicken soup, be ready it's not chicken soup - it's CARROT soup. Muslims!!! - this place cook chicken and pork together, it's not halal and everything they make is not clean. Be careful, there is a lot of infections where rats!!!", "author": "Dinara A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "I love this place.  The food is always delicious, the guys ho work there WORK HARD, and it is always easy to run in and pick up even though they deliver too!", "author": "Molly D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-07", "description": "If you work at Brooklyn Hospital, you're going to order from this place with your co-workers sooner or later. \n\nThe portions are big, it's cheap, and they specialize in grilled chicken (you're much less likely to get food coma) so not the worst decision you can make when it comes to take-out.\n\nThat being said, I wouldn't eat here if it wasn't for the proximity. Food isn't all that great. The chicken is dry and the burgers and fries get soggy real quick. Their mac and cheese is prob instant and microwaved out of a box.\n\nI wish I could recommend another place to eat if you're doing a rotation here, but I'm still exploring myself. Good luck!", "author": "Han Y."}], "servesCuisine": "Chicken Wings", "priceRange": "Under $10", "name": "Hot Chix", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "110 Dekalb Ave", "postalCode": "11205", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/kZsCnoazWnJzr3nclJIfmQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184511122"}