{"aggregateRating": {"reviewCount": 64, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "Pretty good for what it is.  It's clean and the food is good, not great.  One of the better quick, cheap bites in the area. It's clean and prices are pretty reasonable.\n\nDont understand the complaint about new management since it's pretty new, less that a year old I think.  \n\nThe whole ordering, paying, and pick-up system though is kind of a mess.", "author": "Brad K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-16", "description": "I wasn't going to even bother to review this place until I noticed someone here, not hard to find, relieing business over to that fn shit hole SmokeJinx, o I'm sorry Joint, well you must smoke a joint to be hungry Enuff to eat at that SmokeJoke, errr I mean Joint, my bad again. Look this place is no frills but it gets the job done and relatively cheaply especially when compared to that overprice JokeJoint thats blinding fort greenerz Smoking their wallets for subpar associated supermarket level food. I'd go here ANY day then tell people to go their! This is just ANOTHER example of fru fru hipster types with thir fake ass high brow attitudes against McDonaldy places in favor of wherever their friends happen to be waiting tables @ at the moment, and whoever they can find a micro brew. \nFuk u tight jean fedora wearerz!", "author": "Joe S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-03", "description": "I used to order from this place all the time on Seamless until they bumped up their minimum. It's nothing special, just nicely done rotisserie chicken and simple sides for a reasonable price. I would order the 1/2 chicken meal - which comes with pita and one side for $8 - and usually end up with some left over.  Delivery was always prompt and efficient and I'm in Crown Heights. Recommended.", "author": "Tim L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-01", "description": "Decent food, nothing spectacular.  Got the char grilled chicken sandwich,  it was dry, fries are sub-standard", "author": "Paul L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "Food is always hot n fresh.....never had anything bad from here! They deliver all over the area too!", "author": "Chris C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-31", "description": "Mediocre at best. Decided to try this place because after Hurricane Sandy, not much else was open. Got two lunch specials, the ribs and the 1/4 chicken. Both were flavored well, but the chicken was very DRY. The side mac and cheese was horrendous. The presentation was disgusting and so was the taste. It was like generic kraft mac with wayyyyy too much \"cheese sauce\". It was literally dripping from my fork. The meals also came with two homemade sauces. One was really good, the other, not so much. The pita bread was OK. Best part of the meal was the can of Nestea. Will not order again!", "author": "Marla B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "best hangover food around..\nthe grilled half chicken with spanish beans...ask for extra bbq sauce, nice", "author": "Teddy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "great place for a great price. healthier alternative to everything else around. friendly atmosphere.", "author": "Tony Tlt M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-18", "description": "The grilled chicken lacked flavor, and the coleslaw did not taste right.", "author": "Vas S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "Well priced quality food. I have always get the chicken sandwich, why bother with anything else?", "author": "Nick W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "i've walked by this place for months on my way home from work and finally stopped to pick up a chicken.  you know, to eat a little tonight and save some for a couple more meals.\n\nsome facts before i continue:\n1) i am a well-educated college graduate with 10 years experience in a fairly in-demand industry and still finding myself the poorest i've ever been in 30+ years of life.  \n2) i live alone.\n3) frequently, i will buy dinner in bulk to save a little for leftovers and am reminded of my sad state of being when i get home to open up the bag and find at least 2-3 extra sets of plastic silverware.\n\nso i fully intended to eat just a little tonight so i wouldn't have to think about my next 2 meals, but goddammit, the chicken was so tasty, the pita  so warm and fluffy, the tomato sauce a perfect blend of sweet and tangy... let's just say the cost per meal just went up on this \"whole chicken to go for $11.96\"", "author": "Joanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-13", "description": "The half chicken was perfect.  Not dry \u0026 not over seasoned.  Price was right for the portion. Will def visit again", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "This place makes excellent grilled chicken pitas. It qualifies as a destination place to me (I live in PLG and take the train to DeKalb once a week to go here). There isn't much seating, but whatever, their food is awesome.", "author": "Ted M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-26", "description": "I work in the area and this is hands down my favorite place to get lunch. The first time I came in, I found the item that has been my staple. it is grilled chicken on a pita with honey mustard. They also give quite a generous amount of fries and a drink with it. I always end up with leftovers and find that I really enjoy re-heating the rest of the sandwhich in the oven with melted cheese. I haven't decided yet if I prefer it more the first day or the second day. As a queen of leftovers, (most of which don't taste as good the second day), this is one of the highest compliments I can give!", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "Is it me or are the portions at hotchix just what the doctor ordered... seriously, for quite some time now I've ordered from these guys and the portions are consistent every time! love that!. Its also a great option for lunch considering that most of the other fast food spots on the block are pizzeria's. I normally don't make a happy plate when i eat @ hotchix so i have to ask for a take out box very single time. (their grilled chicken portions are delicious and large). Go check it out plus its very reasonably priced.", "author": "Uss T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-05", "description": "Chickens create horror movies about this place. But they can grill up some great yard bird.", "author": "Joey G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "I like this place. I go for one thing. That is the chicken. The sides are good but the chicken is seasoned extremely well. This is my go to. I would never sit and eat there so it's great for take out and delivery.", "author": "R. Amir J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-26", "description": "Listen, for a little around the way spot Hot Chix is the bomb. Yeah they have burgers and what not but you're coming to a chicken joint for one thing right? I mean you don't go to a steak joint and order fish. Anyhow my fave here is the half chicken special with steamed veggies or a salad. The chicken is always juicy and fresh and at certain times the portions are simply huge! They do from time to time give you some small ass pieces, but its not that big of a deal. Fries are meh, but doesn't kill the overall dish. Definitely a must try.", "author": "Sonny A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-05", "description": "Food was pretty decent, and service was a mixed bag.  All in all, it's a pretty good place for a quick and fairly tasty meal.  It gets super busy during lunch, so if you're planning on sitting there to eat, don't.  Just take out.", "author": "Kiran K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-01", "description": "This place was awesome until new management came in. They've made everything more expensive and give you a lot less. It's like Mr. Krabs from Spongebob Squarepants opened a chicken place. I overheard the employer blatantly lying to a woman about why prices increased, saying that lettuce went up from $18 per crate to $55 per crate, which is preposterous. Their cheapness borders on ridiculous. If you want grape leaves in a wrap, it's an extra dollar for two little grape leaves. The \"avocado salad\" has 2 tiny pieces of avocado. They also do not have a separate phone line for credit card transactions so if an employee is on the phone, you have to wait to pay with your card. One good thing is that they got rid of the rule that you must pay 50 cents per sauce. The food is satisfactory but going to an eatery that follows such a poor business model isn't worth it to me and many of the other patrons who came in when the old management was still there.", "author": "Alissa O."}], "servesCuisine": "Chicken Wings", "priceRange": "Under $10", "name": "Hot Chix", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "110 Dekalb Ave", "postalCode": "11205", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/kZsCnoazWnJzr3nclJIfmQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184511122"}