{"aggregateRating": {"reviewCount": 64, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-14", "description": "I went here a few times three years ago, back when I lived in Fort Greene and this was on my commute home from the DeKalb Ave subway.\n\nThis place is perfectly fine. Sometimes, due to the small space and the volume of people it gets, the wait can be long, but it's not awful.\n\nI've only ever gotten their chicken sandwich, or chicken salad. Both were fine- nothing to complain about, nothing to write home about.\n\nThey keep those butterflied roasted chickens in the window, maybe that's what you should go with, but what I got isn't what it takes to spark a following. It's a fine joint, but it's not something I'll crave.", "author": "Trey K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-02", "description": "We were hungry and got a few different things, all of which were pretty bad.\n\nThe chicken wings were crispy but small and *very* salty. The mac and cheese lacked any salt whatsoever. The half chicken was dry.   You know when you reheat chicken in a microwave a few times and it turns into cardboard? Yeah, like that. The ribs were meh.\n\nI wasn't expecting a mind blowing culinary experience but you'd think they'd be able to at least cook their chicken correctly. If recommend that you choose another place for chicken.", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-08", "description": "Maybe I was experiencing hunger blindness when I ordered this (when all you want is chicken and you search for chicken and order everything in sight) - but this was such a disappointment. Sadly, my hopes were high as I craved for a chicken fix. \n\nMy fries arrived soggy, my lemonade with no ice, my chicken dry and my honey mustard cup barely filled half way. For $13 I expected a bit more. Don't think I'll be ordering from here again. There is better take-out in the area.", "author": "Maia R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-09", "description": "Decent food and selection. Nice people. Very typical. Order, pay, pickup and go.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-01", "description": "I mean.... who are we kidding. It's chicken take out. Period. Don't get your hopes all up, and expect some 5-star quality chicken cause it's not. What it is, however, is quick food when you're craving something fried / meaty / edible. I'm a chicken nuggets girl (don't ask) so I typically get their chicken nuggets with french fries and believe me, it its the fried food craving spot. Nothing fancy, just satisfies a craving when it needs to be filled!\n\nOh, I took down a star because the delivery minimum isn't consistent across all the platforms. Sometimes it's $10, other times it's $15. Get it together HotChix!", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-29", "description": "I've picked up the chicken noodle soup that they offer several times, but the other day I decided to grab something for myself. I was immediately overwhelmed by the menu, because they had many options. I ended up settling on the 1/2 chicken option as chicken seems to be there specialty and it's the first thing seen in the window as you pass by. It came with pita bread (still not quite sure of why) and a side- I ordered the mixed vegetables, which ended up being a nice medley of perfectly cooked broccoli, carrots, cauliflower and green peas. Other options were rice (the menu doesn't say it but it's more of a yellow rice), French fries, mash potatoes and others.  \n\nI enjoyed my chicken especially with the side containers of their special sauce. \n\nIt seems like most people get delivery or just pick up to go, but a few tables and chairs are available on site as well for quick casual dining (no table service).", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-04", "description": "Meh is an overstatement. Plus, they use styrofoam for everything even if you eat in in the cold rickety dining area.", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "Maybe it's because I haven't had many other similar places such as Hot Chix, but I loved it.\n\nI stumbled upon this place while at Brooklyn, before a poetry recital at LIU. I went in because it just looked promising from the outside, and the menu looked cheap, so in I went.\n\nFirst off, the person at the register who took my order was very nice and courteous, spotting me a few cents I was fishing for exact change instead of having to break a dollar. He was also kind enough to change my order when I sat down and realized that wasn't what I had wanted.\n\nI got a basic Char-Grilled chicken wrap, with seasoned fries, and it all ended up being under $10. My friends got a BBQ Chicken wrap and a Gyro wrap, which both looked very appealing.\n\nI wasn't sure what to expect, they served it in pita (a very nice unique aspect) with all the lettuce, onions, and tomatoes on the side, with honey mustard (also very good), for full customization. When I took my first bite, the chicken was simply great. It was perfectly juicy and tender.\n\nI left very satisfied, and the fries were also very good.\n\nMy only complaint? I'm not a huge fan of Spanish TV.", "author": "Michael Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-10", "description": "The Grilled Chicken Ceasar Salad is DEELICIOUS. However their Mac and Cheese is terrible. My first time ordering lunch from here, I made a huge mistake of ordering a side of Mac, I asked the person on the phone, taking my order, how is it made, is it boxed or homemade? He said \"Ooooh it was featured in the daily news\"....so I took his word for it, to my dismay it was definetley boxed, didn't even taste like Velveeta mac and cheese, Idk what to call it. I just threw it out, not worth, $2.50 at all. Their charcoal broiled chicken was good though. \nOverall ill give them 3 stars.\nBUT ill give them 5 for their Ceasar salad....", "author": "Lola L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-12", "description": "Today was the first time ordering from Hot Chix and I chose the 1/2 chicken special with a side of mashed potatoes. The chicken was seasoned well and cooked thoroughly. I was however quite disappointed with the mashed potatoes. They obviously use potato flakes and not fresh potatoes. I was disappointed in this as I expected better from a chicken and ribs place.", "author": "Scott H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "I haven't been to the place but ordered through Seamless.\n\nIt. Was. Awesome! I got the 1/2 charcoal broiled chicken and have some leftover for lunch tomorrow. Chicken was great and not dry at all! Food was delivered quick and the potatoes and mac and cheese were super good too. Don't forget the pita that comes with it too, yum!", "author": "Caitlyn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-26", "description": "This place is BOMB! I've been eating here since Fall 2012. their service is on point, the food is great and the manager is friendly and professional!!\n\nMy favs:\nGrilled Chicken on Pita\nBacon Cheeseburger\n\n+they're on GrubHub", "author": "Shanequa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "One of the best eat's in NYC, The food is well prepared and the delivery service is on time. Great customer service as well!!!! I Love This Place!!!!", "author": "Alonzo J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-11", "description": "I like this spot.  Its fairly cheap, its good food and its fast.  That doesn't mean I would go out of my way to come here but it does mean that when im at Brooklyn Hospital and its lunchtime, there is a good chance youll catch me here.  Located directly in front of the hospital, its easy access to a fast lunch.  \n\nThis place is exactly like all the other chicken spots popping up everywhere with chicken sitting on a grill at the front of the store in the main window.", "author": "Nathan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "The food here is great, however, I am not a fan of the recent changes they've made regarding food.\n\nI am a student at Brooklyn Tech HS, so they give a special after school (only $5 for chicken tenders or wings, fries, and a drink! Amazing deal). Being that I'm a student, I really couldn't afford their food if it weren't for the special they offered. Before, when the restaurant first opened, the special consisted of three large tenders and some fries, similar to MCD fries, but now, we only get 2 tenders and the fries are much larger. Some may like potatoey fries, but I for one, DO NOT!\n\nFor working class citizens, I imagine that this is a very affordable place to grab a quick bite! I love the fact that they serve ribs, I am a huge lover of ribs, and I don't really have the time or patience to go to an actual restaurant to eat it every time I crave them.\n\nI'm not sure, but it seems as though they have a space in the back of their restaurant, maybe they should consider outdoor seating, since inside is so small and there are barely any tables! I really have no complaints about this place, they do take a while to give you you're order, but the meal is worth. If you're in the area and looking for a quick bite to eat, I highly recommend stopping here!", "author": "Cici C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-28", "description": "Their chicken is delicious, their sides are more than I can eat, and the meals come with a free drink. The wait isn't too bad at lunch, but if you only have 30 minutes you may have to scarf down your lunch. The staff is courteous, and they always have soccer playing on the TV. \n\nI always get the food to go, but the seating is limited and small, so just be aware. \n\nI've never used the bathroom so I'm not sure if they even have one. \n\nOtherwise, awesome!! \n\n1/2chicken with Spanish rice and their tomato sauce puree thing. \n\nOMG the tomato puree sauce is cool, refreshing, and wonderfully innovative!! SOOO Good!!", "author": "Vito P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "They have great grilled chicken!!! I go there quite often, and once went at 11AM when they opened.  Nothing beats freshly grilled chicken.  It was juice, hot and hits the spot when you are hungry.", "author": "Mimi Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "Ordered takeout from this joint.  Since Hot Chix specializes in making chicken, you'd think they would turn out some juicy, delicious birds.  I was extremely disappointed in my chicken simply due to how dry everything was, thankfully the dark meats were at least somewhat moist.  The fries that came with my half chicken were soggy to boot and I was a little bit confused as to why pita came with the order.  Although the prices were good, I don't think Hot Chix has made it into my list of acceptable delivery options when I need grub.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "I think I dropped by wallet in this place and forgot to pick it up.\n\nThis is my go-to-spot for lunch at least 2x a week. \n\nThe chicken sandwich, greek salad with chicken, and half chicken are my favorites. I also recommend the soup.\n\nSince I can't eat carbs as of late ----they'll likely be getting more of my business.\n\nAlso, it helps that they know me behind the counter. \n\nI never eat inside because I fear I'll end up smelling like whatever's on the grill. \n\nIf you plan on picking up I highly recommend calling ahead.", "author": "Liliya N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "Just get the delicious crispy chicken fingers and stringy mozz sticks. Really good. Honey mustard is great. I'd ask for extra tho. The delivery was sooooo fast.", "author": "Calee P."}], "servesCuisine": "Chicken Wings", "priceRange": "Under $10", "name": "Hot Chix", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "110 Dekalb Ave", "postalCode": "11205", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/kZsCnoazWnJzr3nclJIfmQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184511122"}