{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-29", "description": "what a difference a day makes! i was here the last week and as usual enjoyed my experience. however today, bam fest sunday, not really crowded, but the staff is clueless, rude, preoccupied on the phone texting at the hostess podium with the most unwelcoming attitude of unprofessionalism, slow service an intentional ignorance is sure death in the resturant business. Drink order in a resturant smaller than my living room took 15 minutes; now waiting 25 minutes for food! Supporting our businesses in a gentrifying area is very difficult with this level of bad service! Other customers sat or stood waiting just to be acknowledged, wait ing in frustration! Why? No logical reason other than pure incompetence. \n\nChanel, who claims to be the manager in charge of this fiasco, gave to little to late. \nHostess, short with tower of locs, seemed to be in a fog and have better things to do than be at BROOKLYN MOON. What a shame. Our standards have to improve! \n\nWhere is Amir???\n\n\nWho are these clueless diva staff people here sunday bam fest? \n\n\nhelp!!!!", "author": "JC B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-15", "description": "I would love to give 0 stars. I had a horrible experience. We had hard rice and there was soap in the water cups. The hostess was rude from our initial meeting. Once we sat down, she was sarcastic about our party size (we accidentally said 4 when there were 5). When our chase card was run in their POS system, Chase flagged the transaction as fraud. We then had another member from the party to swipe her Bank of America card and Bank of America also flagged the transaction as fraud. We also called our banks to verify the transaction was real. Once our banks opened up our accounts, they were both flagged as fraud again. The 7 month pregnant woman in our party was asked by a waitress with backpack to walk to a bank to get cash after we had been inconvenienced. We then asked the lethargic hostess with the dreads to speak to the owner. She rolled her eyes and never spoke to the owner. We watched to see if she would speak with him and she did not. We were told by the waitress with the backpack to figure it out. We explained that our banks (2 separate FDIC accredited banks) did not recognize the establishment. The staff was rude, the owner came to our table to take a chair for another party and did not come to ask what the issue was to remedy the situation. I advise no one come here.", "author": "Jordan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "Brooklyn Moon. ....Great location.great vibe. great wait staff.  The salmon caesar salad was ok. not enough salmon, not even 4oz of fish. the french fries were ok.  Services was great. Sarah was attentive to our needs. I will return. Happy hour is until 8. woohoo!  Brooklyn Lager was delicious as usual.", "author": "Genie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "Easily identified amongst the hustle and bustle of Brooklyn. From the moment we walked in we were greeted by the warmest smiles and the plant life surrounding the outside gave me a feel of authenticity in the palette adventure that was about to take place. There are about 6 different champagne and juice combinations offered at $1.00 a piece.....even better than bottomless prices at most places, you would agree I am sure. \n\nI had the BBQ Chicken wings (naked) with Mac and Cheese/Greens....someone's grandmother from down south is back there cooking - SHE HAS TO BE, the food was phenomenal without a need for any other seasoning. I would definitely go back for the eclectic decor, great table service and prices!", "author": "Hsia F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-21", "description": "Found one thing negative.  It's highly rude to rush paying customers out of their table because another party is waiting.  \n\nWe were at the table 1hr 30 mins, finished eating and we're talking while finishing our drinks.  The staff comes up and says another party has been waiting long, can you finish your drinks. Excuse me?  Isn't happy hour to hang, have drinks and socialize after a long day. \n\nI wasn't going to tip but he wasn't my waiter and that wasn't fair to her.  I was going to be petty and place another order of fries(their real good).lol", "author": "David M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "Loved my food. My server Sami was soo amazing. Great customer service everyone greeted us and checked on us. Everything she recommended was amazing and she sure know how to up sell cause there are soo many worthwhile things on the menu. And if u say something's good we're ordering it. \n\nWe ordered:\n\nJerk wings mmm spicy\nMussels\nFried whiting -great batter\nSpicy fries \nCollard greens --sooo good\nSpicy shrimp- great texture but not spicy \nMixed veggies \n\nDrinks we had that green drink and let me say I could taste the alcohol so two thumbs up for that.", "author": "Sharri J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Nice little spot.. I went here for happy hour on a Friday packed house but the wait wasn't long. 4$ HAPPY HOUR DRINKS and food was good!!! I got jerk wings and collard greens and my cousin here the spicy shrimp with bake mac and apple salad. Everything was great. Looking forward to going back :-)", "author": "Shanice M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "If you come to Brooklyn, you must check in to and experience this spot. Food is exquisite. The service and ownership is positively spirited. Brooklyn is complete with Brooklyn Moon Cafe.", "author": "Craig B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "Never a disappointment with the food and drinks. I  really like this place. The only downfall is the the service is a little slow. It took a while for our food to come out. And everytime we order drinks we were getting it one at a time. So while my friend is drinking her cosmo I am patiently waiting for my margarita. It would of been nice if we both could of enjoyed our drinks together. But besides that everything was great. Mac and cheese, fish and salmon burger was on point. And you can't beat $4 drinks during happy hours.", "author": "Deniece H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-12", "description": "The food is great, but the rude, loud ,drunk angry patrons means you're more likely to get hit in the head with a glass then have a peaceful enjoyable night out, because of the over served alcoholic drinks.", "author": "John Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-27", "description": "Will probably never return. I made my order and was charged almost $20 extra and was told it was because the online menu is totally wrong. I could understand that I didn't bring this to her attention until after she swiped my card but I assumed she would try to rectify the situation in some way. But no, I ordered two drinks after that and she promptly reminded me about that bill as well. \n\nEven with this mistake behind me I still wouldn't return. The roasted veggies are seriously disgusting and oily, and the crab cakes are sub par at best. Idk whose in the kitchen but I don't think they're Caribbean or southern judging by the taste of the food. However, I have 3 stars cuz the drinks were good and the people seemed nice.", "author": "Valerie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "Had a great time at this  place. the fish was amazing, drinks were large and awesome, and the staff was very friendly. Camille was a great bartender.", "author": "Dane B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "The service was horrible. We came I. At 4pm they told us the kitchen was closed and opened at 5. We ordered drinks. At 5 they then told us the kitchen opened at 5:30  then we observed a roach just crawling one the wall. After the food can out I was happy until I tasted it. The Mac and cheese was blah the fish had no flavor. The whole meal was just unappetizing. A waste of money. The only good thing was the drink swamp water", "author": "Umahlih E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-05", "description": "I gave this location three stars only because it took awhile for us to receive our food also it was very dark and the location other than that the food was great I got the jerk wings my daughter got the jerk chicken with a side of macaroni and cheese and my friend got the fish salad all was very tasty and good. Their apple salad is to die for very refreshing and good. A hip location that I would  definitely take my friends to.", "author": "Barbara F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "This place is decent for a place to chill and and unwind. I was visiting from Boston and the wait was long but once we got in the service was fast as far as drinks go. I had 2 mango mimosas and an orange mimosa. They were okay. I also ordered honey barbecue wings which were really good along with spicy fries. The fries werent spicy though. Overall its a cool place to come to kill time and talk to friends. But its not a place I NEED to be.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-16", "description": "I love the food I've sampled at Brooklyn Moon. My favorite dishes are the brooklyn crab cakes, roasted vegetables, collard greens and the fish.\n\nMy boyfriend had the curried mussels and said they looked more impressive than they tasted.\n\nThe price is right (compared to other restaurants in the area), the food is hearty and the portion size is generous.\n\nThat being said, the service can be pretty bad here. I have only ever been here with one other person and our party of two have had to wait for eons before being acknowledged and then light years before actually getting our food.  Also, I think they are supposed to seat you but no one is ever really there to greet us when we've ventured in, so we've always just seated ourselves. \n\nThey seem a little short staffed on the front and back of the house but then I eat my crab cakes and decide the wait and little annoyance is worth it.\n\nIf you come on a weekend night when it's crowded you will be sitting on top of someone else because the tables are very close together. Also, it can get pretty darn loud depending on the people at the bar or at the surrounding tables. Some people just have trouble using their inside voice, so what are you gonna do...", "author": "Camille H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "5 star food service and drinks. The vibe here is great. Definitely recommend trying the curry mussels and the sea water", "author": "Kato T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "What a hidden gem! Went for the music but left in love with the drinks and overall vibe. Seems like a great community spot. Order the \"male escort\" with coconut rum, it's fantastic! Also the service was very welcoming and the food looked good.", "author": "Raymond C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-23", "description": "Ok so I've been here for happy hour and brunch before. What I will say is that, yes I'm impressed with the $1.00 mimosas and the $14.95 brunch deal but my food wasn't seasoned and I feel so bad for saying that because I love this place. I ordered the fish and cheese grits and I will say everything was bland salt pepper and butter was needed for the grits and the fish had no seasoning at all. I sat in the \"garden\" which was a nice change. My cousin had the jerk wings and she also said it tasted different from her first time there. I'm not sure if they change chefs on the weekends but I need some seasoning on my food. I'm giving 3 stars because the hostess/waitress was amazing", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "BRUNCH HERE IS AMAZING!!! To say that the food is delicious is almost an understatemeny. The portion sizes are great, the food is seasoned well, and the prices are reasonable. Also, they have $1 dollar mimosas in different flavors such as mango, pineapple, and guava.\n\nThe restaurant is small and intimate with an homey/dope antique show vibe. The staff at this restaurant is nice and accomodating. Due to its size, it gets crowded fast on the weekends.\n\nIf you're ever in the area, try the chicken and waffles.", "author": "R C."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}