{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "I've been maybe four times now over the course of a few years, but the vibe is always warm and inviting. I most recently came this past Friday evening to the same chill, make yourself comfortable vibe. The waiters and bartender were friendly and made me feel welcome with my initial bar seating that transitioned to a table for two. \n\nI was kind of thrilled to see Banks beer in the mix, since I haven't seen that in a bar since a trip to Barbados or an island, so while I wasn't quite in a beer mood, I got it for nostalgia's sake. I don't recall the name of my cocktail but it tasted exactly as described: cranberry w. mango nectar and some spirit. It tasted light at first, but the alcohol was creeping at the bottom of the glass. \n\nHunger caught me, so I got a side of curried potato and laughed because instinct told me it'd come with the potato skins--consistent with Brooklyn Moon's almost-but not quite island offerings. \n\nOverall, cozy spot for a relaxed date or drinks and bites with friends. I'm sure I'll find my way here again sooner than later.", "author": "Racquel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Went here on a recommendation from a friend and really enjoyed the food- I had chicken and waffles and a few $1 mimosas. Thought the price was very reasonable.\n\nIt was a bit hot and cramped inside which made the experience a bit less enjoyable. At times, it took a long time to get our drinks/check.\n\nOverall, a fairly positive experience and I'd go back again.", "author": "Autumn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "This review is just based on the drinks i've had here (as they have no Vegan options available). Get The SEAWATER \u0026 Thank Me Later lol", "author": "Nic P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "I don't understand why this place has low reviews because I have been here a few times now and the food is always SO good! My favorites are the jerk chicken and mussels. For sides, the Mac and cheese and curried potatoes are out of this world delicious. The drinks on happy hour are at an unbeatable price. Honestly if you want decently priced, delicious Caribbean food, you've got to come eat here. It's a cozy little spot with awesome music and amazing food", "author": "Renuka J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-26", "description": "My experience here was pretty good. The wait staff and everybody else was amazing to our party. Little cozy restaurant. I had the dinner salmon salad that was sooooooooooo good. I'll def be back again. Spicy  just the way I like it. I didn't even need the dressing. Thank you", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-16", "description": "My friend and I went there on 2/15  for some drinks and appetizers. We arrived there at approximately 4pm and we're seated promptly and our waitress was very attentive. Our appetizers and drinks arrived without any fanfare or controversy. However,there was a change of shift while we were dining and the new waitress advised us that the table we were sitting at, are reserved for people that are dining. I thought that was rather rude and unprofessional considering that we already spent 80 dollars on food and drinks. We had another friend that arrived at Brooklyn Moon at approximately 6p,to join us for drinks.However, upon his arrival,the place was really crowded and we didn't receive attention from the new waitress except when she came over to tell us that we would have to move. So my friend decided to purchase the drinks at the bar. When my friend returned to our table with our drinks,we were then approached by a gentleman who claimed to be a manager. To our dismay,he was the accelerant to an already combustible and volatile situation. He just came over and rudely reinforced what the waitress told us about their dining policy at the table. So,we decided to finish up our drinks and leave the establishment. I believe we were disrespected and their approach to the situation was totally unacceptable. We were rushed out of the establishment so that they could accommodate their new customers. My friends and I decided to leave and we will never return to that place ever again. Since we work in the area, I will definitely tell my coworkers, family and friends to never at the Brooklyn Moon.", "author": "Troy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I can't say enough about Brooklyn Moon. The food and service always 5 stars.  My fav jerk wings Mac \u0026cheese and collard greens. The service always on point. Wish they used the AC more often during the summer but it's ok I will be order more drinks", "author": "Sidee F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-09", "description": "Does bad service out weigh good food? Sometimes, but In Brooklyn Moon's case it doesn't since the food seems to be going downhill. I've eaten here several times and ignored the bad service because I enjoyed the food. But the curry mussels and Mac and cheese have sadly taken a turn for the worse. \n\nDuring my visit today I was told there was a 25 minute wait for a party of two which is fine, but since there were 2 tables available I was confused. Upon asking about the open tables,I was told they only sit 3 people there which made no sense, since there were about 3 parties of 2 waiting and honestly what they were considering a table for 3 wasn't. It was a two topper. Either way they have lost me a customer. \n\nWhy would you wait for 3 customers who you don't know will come, if you have a few 2 party customers waiting for tables?", "author": "LaQuana C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-10", "description": "Racist cafe. Doesn't seat you if you look white Spanish. Calm yourself with your basic ass food.", "author": "Andrea Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "Great food, with mediocre service. My best friend and I were looking for a trendy, after-work spot with good food on a Friday night. I have heard good things about the Brooklyn Moon Cafe, so we headed straight there. We got there a little after 9pm and there was a 45 minute wait. We opted to wait so, the hostess took my number and sent a text when the table was ready. The restaurant is located centrally on Fulton street, so there are ample places to waste time or choose otherwise. \n\nIts a small place with dated decor. The walls were covered with mirrors and behind the bar were some type of shelves. I didn't understand what the theme was but an upgrade on the decor is much needed. As you dine or drink, you'll hear some classic reggae, surrounded by good food and a trendy crowd. Once we were seated, a young man introduced himself as our waiter. We asked for a few moments to view the menu and he obliged. At least 3-5 minutes later, a waitress dressed for the club, came over and asked if we were ready to order. My best friend (bf) and I, still trying to figure it out, began to ask questions about the menu. My bf really wanted to try a tilapia entree, so she asked \"how good is it?\". The waitress, a representative of this establishment said \"its ok, but it's not real fish\". Girl, no...just no. Don't say that. Not even Red Lobster would've admitted that. \nWe continued to ask questions, including an inquiry about the side offerings. The waitress pulled the menu from my bf, slid it across the table and began pointing to the selections with her nails. Unnecessary and felt like a sign of impatience. Finally we ordered, she walked away but she didn't write anything down. A minute later she came back to confirm parts of the order. \nFood came out quickly. The waiter brought our food and came back to check on us. We didn't see the waitress until we were barely done with our meal. By that time she was ready with the check.\n\nAside from that, the food is pretty good and priced reasonably. For starters, we had the jerk wings which were soooo darn delicious. They are spicy and by spicy, I mean there's a chance you might cry. But I like spice therefore, I loved it! For my entree, I had the fried whiting fillet with a side of Mac and cheese. Both of which were good but could've used some more flavor. They were cooked exceptionally well though. My bf had the grilled salmon and she loved it; even ended up being food home for her fiancé. Overall, I'd be back as I'm eager to try their brunch. 4 stars for good food. Would I recommend to others? yes...just be mindful of service.", "author": "Monique M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Brooklyn Moon Cafe is fantastic!!!! Just to give you an idea as to how truly cool this place is I will explain my experience from the beginning:\n\nI walked into Brooklyn Moon Cafe and really enjoyed the vibe. The music was wonderful which really put me in a relaxed and calming mood. I wanted to dance and began to sway to the smooth reggae tunes that emanated from the speakers.....The hostess was so friendly and told us that we would have a 25 minute wait and I gave her my cell phone number. We proceeded to go look into some neighborhood stores and I received a text 15 minutes later indicating that they were to seat us for dinner. \n\nBrooklyn Moon Cafe is such a cute eatery that consists of multiple small tables and a couple of larger tables in the back of the place. The place was crowded with people that were enjoying themselves as they dined on delicious looking plates of food and sipped on colorful beautiful looking cocktails. It was Happy Hour when we were seated for diner so we were able to have some less expensive cocktails. I thoroughly liked my Mango Margarita which was $ 4 so of course I had a 2nd one......I had the Fried Whiting entree with Macaroni + Cheese. The Fried Whiting was scrumptious and light and the Macaroni and Cheese was creamy and cheesy just the way I like it. The person that I was with mentioned that their crab cakes were good. We also ordered some of their season french fries which went well with our cocktails. Overall, the food was spectacular. \n\nThe waiter, busboy and waitress were attentive and ensured that we were provided with great customer service.  The staff at Brooklyn Moon Cafe were nice, made sure that were given additional things if needed (extra napkins, extra condiments etc) and exchanged pleasantries with us throughout the evening. \n\nAll in all, I look forward to coming back other evenings as it was advertised that they have Poetry and Jazz Nights. I also want to try other food on their menu as well as other cocktails such as their Rum Punch and signature beverages!!!", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-04", "description": "Horrible. Went here today with a friend and it was the slowest service I've ever experienced with a restaurant. When my friend and I arrived, we were seated quickly and immediately ordered our drinks. Our drinks arrived at the table next to us before the waiter realized those were our drinks. Okay, human error. That's fine. \n\nWhat was the ABSOLUTE WORST was the fact that after ordering our food, we waited wondering for an hour to what was taking so long with our food. Not once did our waitress check in with us to alert us about the delay but she seen us waiting. The hostess kept telling us that they're working on it.\n\nMind you, people who came in after us got their food, ate and was digesting while we were still waiting. At this point, my friend and I decided it was too long and were gonna leave. We alerted the hostess \u0026 a male waiter told us we were gonna get half off our food. We told him no it's okay we're leaving. After this, they decided to bring our food out but we turned it away. \n\nThe same waiter then told us we had to pay a dollar each for our mimosas. We told him we weren't paying anything because we were here for an hour and 15 mins with no food. The manager came out and apologized and said we didn't have to pay due to the inconvenience and we left. Wanted to try their food but never again.", "author": "Ayaa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "We sat down as soon as we arrived which was great and rarely happens in NY. We ordered our food and drinks no more than 5 minutes argue we sat down. The food took over an hour. In that time they took long to bring the 3rd drink i ordered, they didn't bother to say sorry or give any kind of apology for he long wait. My water glass was empty for at least 30 minutes. I had to ask the hostess for more water and when she came she didn't say anything until I asked where the food was (kindly of course) and then she said they just got a second chef so she'll Cheick in our our order. I watched her go to the back, talk to someone for 2 minutes then walk out with our food. The waffles were cold and the chicken was hot. It was as if they ran out of ch down and just got someone 5 minutes before I asked about our order. \n\nAfter finally finishing our food, they still took about 10 minutes after we finished to only be asked for our check. The woman took only one card off the table and told me I could add tip \"here\" (even though their establishment includes tip). I asked for everything to be split so she had to cancel the entire transaction then charge us again. My bank no longer recognized the business and didn't accept the charges. \n\nAll in all, very slow service, food is ok and the staff don't care because tip is included.", "author": "KD D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "First off service was super slow. Sat there for 20 mins before order was taken.  We ordered an appetizer that came after the meal. My grits were super  lumpy, and my wife found plastic in her Mac \u0026 cheese. Never again!", "author": "Javon E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "A great Fort Greene spot for grabbing a drink after work, or on the weekends. \n\nI've visited several times and the staff is always pleasant, welcoming, and relatively attentive (it can get a little busy). Any place with a happy hour running until 8pm is a-ok in my book! \n\nTry the calamari, crab cakes (really bites, as they are the same size as donut holes), and the Mac n cheese for starters.\n\nIf you're in Downtown Brooklyn and looking for a taste of local culture, this is a great spot to check out.", "author": "Courtney R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-27", "description": "I've been Manyyy times! And the service was bad. But today I decided to yelp about it smh. The first time I came here there was a fly in my salad... I figured it was a mishap and wanted to give it another try since it's a black owned spot and sometimes things happen. The next time I came the calamari was wayyyy salty. Even the waiter agreed that it was over seasoned but said they had a no return policy on food and drink . The following time the bartender had a horrible attitude and was arguing with a customer about the way a drink was made. Today not only are they out of half the stuff on the menu but I also ordered the salmon salad which came to the table\nGreasy and the lettuce was wilted  YUCK! I didn't even bother to send it back. I just prob won't come back. Unfortunately it's time\nTo keep it moving and find another place . I'm\nI'm the service industry so I try to give the benefit of the doubt but this spot has been  consistently disappointing", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-22", "description": "The food is amazing but who cares if the owner is misogynistic? How dare you speak to women with such a lack of respect and expect them to continue spending their money in your establishment???\n\nMy first experience with this man a few months ago was quickly resolved because he apologized for his tone. Today, he spoke to my table in such a nasty way because we were getting ready to switch our table without permission. Who cares what the reason is?  What's wrong with saying, \"sorry ladies but please wait to be seated.\"\n\nA group of ladies next to us heard what happened and told me they had a bad experience with him and his tone in the past. Not surprised. When I asked to speak to him outside you could tell I triggered a nerve. All I asked was why do you think it's necessary to speak to women like that?\n\nHis response:\n\n\"That's what you wanted to talk to me about? I don't have time for this. Have a good night.\"\n\nI was not rude or nasty at all. Unlike him, I'm able to have a conversation without disrespecting anyone or letting my emotions get the best of me. Brooklyn Moon is located in such a dope spot with great food and a great vibe. However, that's not enough. My parents don't speak to my 31 yr old self like that so I'm not about to accept that kind of treatment from anyone......especially a business owner!\n\nBased on a previous review I attached, this seems to be an ongoing problem. \n\nI'm good", "author": "Kahlia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-28", "description": "Went here for brunch last Saturday (only for the second time), and I realize I need to come here more often. $1 mimosas??!! And flavor options like mango and guava? Yeah I'm there. Oh yeah, the food is also good. I ordered fish and cheese grits. Not the best but good enough to enjoy with my drinks on a brunch date with bestie. \n\nCons? Well the bartender who was working seemed more interested in serving her friends at the other end of the bar than actually looking in our direction occasionally. Whenever she did finally come by, she seemed genuinely annoyed that she had to deal with us. That never sits well with me. Eventually a new bartender took over who was much more attentive, but the damage was already done to my impression.\n\nI'll come back, but next time I'll sit at a table and hope that gets me your customer service.", "author": "Garynn N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-27", "description": "LOL! Some of these 5 star ratings are quite questionable. Either people don't know any better or are friends of the management. There's no way I'd give this spot 5 stars or even 3. Luckily they didn't get 1. \n\n\nI came here a few weeks ago with a friend, and the ONLY reason why I'm giving it TWO stars, is because the hostess that I had was actually a sweetheart. Very talkative, welcoming and attentive. \n\nHOWEVER... the food was trash. Honestly. I could cook better and open up my own restaurant with my cooking, and make a killing if THIS is considered amazing food lol right...\n\nThe only reason why I even went to this place is because a friend RAVED about how great this spot was. (Maybe she went years ago when there was a different cook or something) because this time? Food was below subpar. (And obviously rushed)\n\nThe crab cakes were small, on a bed of skimpy lettuce (the same 'spring mix' I have in my fridge), the shrimp wasn't really seasoned, just overly SPICY.  The corn was OBVIOUSLY canned corn, no seasoning, no FLAVOR. The \"yams\" were \"blah\". (I took photos of the food, and I made it look good because I'm a photographer. So that comes natural.) But the food was seriously very mediocre.\n\nMy friend mentioned her so called peas and rice even tasted like boxed Zatarains rice you get from the super market. And I wouldn't be surprised if it was.\n\nThe two drinks I ordered were WEAK and over priced. $10 for a drink, you'd think you'd taste the alcohol right?... \n\nI ordered one thinking that maybe I just wasn't feeling the effects yet. I'm a drinker so I know when a drink is just so good that it'll creep up on you, or when a drink was just carelessly made. So I ordered ANOTHER thinking maybe the second time I'd get a better drink? WRONG. Second drink was WEAKER. I mean, really. I didn't feel anything. It was like drinking juice. Whoever was working the bar couldn't be a real bartender. There's NO way...\n\nThe quote on quote \"ambience\" was cute and all, but I still most definitely won't be coming back here, honestly. There's WAY too many awesome food spots out here for me to be giving a place I had a trash experience, a second chance. No thanks.\n\n\nLike I said, the only thing I can say I enjoyed about the place, was our server. Nice looking, tall, very friendly man (wish I knew his name) but he made my visit more worthwhile than the food.\n\nThat should tell you something...", "author": "Moh R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-07", "description": "I've been going here since they opened, to be honest I enjoyed it better then. The vibe was more laxed.. Although then and now my favoritr is still their drink called The Hater, when you go be sure ro ask for it.", "author": "Mayra S."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}