{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-21", "description": "Visited on a Saturday, lovely spot. Not much seating so there was a wait. (About 40 mins) Food was fresh. There's a great brunch menu. Food did take a while to come out about 1 hour 15 mins. 1.00 mimosas got me! With a extensive list of flavors! Parking is good however parking is 1 hour max 25cents per 15min. Great neighborhood. Spot is recommended. Just be prepared to wait on your food!", "author": "Tanisha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "Great Vibes\n\nLove coming to this spot after work for happy hour 2 for 1 specials. Their jerk wings is a must with the seasoned fries and apple salad, my fav every time I come here! Certain evenings they have live entertainment. Spot is very small and can get loud but everyone is in their own zone and vibe with one another.", "author": "Regine D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "its not the same. I have being going there for years, however, the service is terrible recently. This Friday the hostess refused to sit us up front.  There were several available tables.  Took us at the back to squeeze between two other little tables.  Also, it was usually hot, We left and went to Prospect Restaurant.", "author": "Gail P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-23", "description": "Good food, strong drinks, attractive staff, gets crowded but it feels so black people magic* that the crowd doesn't matter. Try the spicy fries, fried anything, the shrimp and jerk wings. The dollar mimosas and the sea water are amazing!", "author": "Tiffany B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-20", "description": "Nice atmosphere and friendly staff but sorry the food here is horrible. I definitely will not make a repeat visit. Like where is the seasoning?! Definitely not at this place. This might be a cool place to grab drinks and looks like it gets a bunch of locals like a neighborhood spot which is cool. Definitely avoid for dinner u will regret it.", "author": "Alice A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "Worst service ever! Servers always seems to be in the weeds even when the place is empty. I'm in the service industry as well so I have more tolerance for horrible service but this is the case every time I come. I wasn't greeted for about 20 minutes then when I was finally greeted he took an additional 20 to bring water and our drinks. There was maybe 10 customers outside of my party of 3 and some of that number was at the bar. Made no sense as to why the server moved so slow. He never even introduced himself so I can't even leave a name. I've only been to this establishment 3 times and had experience the same type of service each time. Only came because my uncle loves it so much, I don't know why, but tonight was my last night ever stepping foot in this place!", "author": "Tiara T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-11", "description": "This place is not for me...I like intimate establishments . Got here around 4pm on a Friday and waited for an hour for my homegirl. The decor does remind me of old Brooklyn spots, rustic, old, and chill. It was happy hour, the bartender was attentive. \nOnce my girl came and we got a seat, we ordered appetizers. My calamari was just OK, BUT I took it hoke and reheated it the next day and it was BOMB! \nMy friend had Mac n cheese and something else I forgot. The place got packed and loud very quick! Too much going on. The waiter took away my drink without asking if I was done. It's loud, tight, and not for me. \nIt was jazz night, but no one was paying the artist any mind. It was just too loud!\nNot sure if I'd be back!", "author": "Mitch. J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-17", "description": "The only reason I am writing this review is because of Ashely!  They messed up my order twice and Ashley, waitress/manager, reacted as if it was my fault.  \n\nMy appetizer came out after the main course.  The salmon avocado salad didn't have avocado.  When I said something about it each time she was just rude!\n\nMessage to Ashley... If you are not happy with this job move on.  Find something that will bring you joy... ...", "author": "Terry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "I always come here during happy hour and they have the best happy hour prices in all of Brooklyn! Decided to go for brunch and they got $1 mimosas. My server chanice was very attentive and patient. I will be back", "author": "Brian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Came here for brunch on Saturday for a first timer. I enjoyed myself to the extreme. Food was amazing drinks were even better $1 mimosa . WOW! Can't beat that . My waitress the one with the dreadlocs did a awesome job even though the table in front of me was very obnoxious and rude to her but hey at least I didn't have to experience that. OVER ALL I WILL BE COMING BACK AND HOPING FOR THE SAME PERSON WHO SERVED ME SATURDAY!", "author": "Ulesha V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Disappointed.  Although my party and I went in with intent to get drinks, appetizers and dinner, the wait was so long just for appetizers and drinks that that was all we ended up getting. Our wait was over an hour. Although I only intended to tip the waiter 15% for subpar service, there was already an 18% gratuity added to the check.  On top of that there was an option for a tip.  What?  I won't be going back.", "author": "DAWN F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-13", "description": "If it weren't for the hostess, Lanience I would completely roast this place. Shaniece the waitress, is extremely rude and over the top because she wanted to close out while I was still eating. She made me feel like I shouldn't of been there because she wanted to go home. The curry mussels I ordered, had fragments of shell all throughout the food and I literally almost choked on it several times. I doubt I will be back but thank god for the hostess because some of the people working here are extremely NASTY AND OVER THE TOP.", "author": "Rose C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-03", "description": "Been here almost 25 mins got my appetizer and still no drink. This is ridiculous.  Reminded the waiter and the helper about our 2 margaritas and nothing.", "author": "Call me f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "I haven't been here in a while, My friend invited me for a happy hour outing. We sat at the bar and Sade the bartender was amazing. She was friendly, informative and attentive. I will definitely be back. \n\nThanks Sade!", "author": "Dai A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-21", "description": "Came here last month on a whim.\nThe bartenders were pleasant, drinks well balanced. However the food we ordered were absolutely dreadful.\n\nI ordered  a Seawater, Jerk wings along with their mac and cheese. My sister ordered the seasoned fries. We couldn't believe how SALTY the food was. Accompanied by these dishes of what may have been marinated in sea water as well: this disturbing yet disappointingly familiar after taste of SEA-SONED SALT on EVERYTHING! \n\nJesus Christ and all his disciples you can't put Lawry's original on every dish. It was sprinkled on the damn season fries, an added \"garnish\" on the mac and cheese, perhaps even combined in the jerk sauce that the wings were tossed in.\n\nI'm an avid cook, traveler, foodie... I know the taste of seasoned salt. The reviews prior to walking in were the deciding factor for me giving this restaurant a chance, however I guess if you enjoy deeply salted food in addition to a devotion to Seasoned salt, this is your spot.\n\nDrinks were decent though.", "author": "Andie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "The Brooklyn crab cakes are pretty good, almost taste as good as the ones at Phillips Seafood in Baltimore, MD.  Other tasty dishes include-The grilled salmon or grilled tilapia with sweet plantains. \n\nMy favorite desserts are: The sweet potato pie or the Brooklyn banana bread, served warm.", "author": "Mac S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "The ambience here was really nice and the drinks were ON POINT! We had wings which was also very delicious. My favorite part was the live performances, it was amazing. A bit loud if you are looking for an intimate setting but it was a girl's night out for me! Would def go again!", "author": "Shawna E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-14", "description": "Yall just really lost it. The best food with a service that I never experienced before in my life. Me and my friend came in here about two weeks ago. Nobody greeted us or even said we be right with you when we walked in about 7-10 minutes after we sat ourselves down this guy comes to the table with two menus claiming he works there and put the menus down with a bag of weed. YES A BAG OF WEED. I proceed to ask him if he works there and he said yes so at his point I dont even know im just laughing. Then this other guy comes and tells us we have to get up we cant sit at a table for 4 when its just two of us. Now we all the way confused and he tells us to sit at a hightop table with one chair!!! Then him and my friend goes back and forward instead of handling it well he just starts arguing at this point I just asked him straight up if he was going to serve us or not. Then he says he is gonna get the owner that was working the kitchen fine get the owner. The owner passes by us two times but completely ignore us and yes I know you the owner because your picture is all over the internet.   INSTED OF ACTING LIKE THE OWNER YOU ARE, dealing with a bad situation you just run into the kitchen. At this point we are cancelling our other because we were afraid somebody was going to spit in our food. It makes me really sad because I loved the drinks and the food here but I cant support a business that does not care about costumer service", "author": "Patricia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-18", "description": "As far as weekend brunch goes, Brooklyn Moon is an underrated, quirky, and casual spot. Although it was pretty empty, decided to give it a try. We were pleasantly surprised with the level of service as well as the bottomless mimosas at $1 a glass with a brunch entree purchase. The flavors were Mango, Guava (my favorite), Pineapple, Grapefruit, and Cranberry...very sweet and worth the slight mimosa headache. The French Toast was decent, and was served with fresh fruit and berries.\n\nIf you're really looking to indulge, they serve mac \u0026 cheese at all hours, which was reasonably good. Overall, it was a comfortable place and alternative to typically trendy and crowded brunches.", "author": "Kaitlyn R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "I really wanted to like this place because it's Black owned. But damn the service was slow, server was rude and literally didn't give a shit plus the food was just not good. Salmon that's not fresh, and macaroni and cheese that completely bland. SO disappointing. I only gave them one star because the app doesn't allow zero stars.", "author": "D H."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}