{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-25", "description": "Love love love the $5 Anti-Bush lunch special.  The jerk chicken is spicy and flavorful and everything jerk chicken should be (I think - I'm from Texas, I should admit), the salmon burger is satisfying and delicious, their fries are seasoned to perfection, and their portions are generous.\n\nAs for service, the guy who's usually there isn't amazingly attentive, but I don't really have any complaints.  He keeps the water glass full, the Common and Marley pumpin on the sound system, and gets the food out quickly.  I'm low maintenance I guess.", "author": "Megan T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-02", "description": "This was probably the worst food I've ever eaten and the most unprofessional restaurant I've ever been served in. First off, the seats were torn up and looked shabby. Random groups of guys kept coming in to the restaurant to say hi to the chef or other people and they were so loud my mom and I couldn't even hear each other. At one point a guy who was sitting across from us ran out of the restaurant to yell at someone down the street before coming back in. The only other waiter in the place actually sat down at one of the tables and started texting. Our waitress seemed unsure about the menu items and specials which in turn, confused us. After getting our orders she went to chat up the table behind us for a good five minutes before putting in our order. The menus we recieved were also really shabby and gross looking. The plastic protector sheet was ripped and the paper looked as if water-and other drinks-had spilled on it multiple times.  My mom and I ordered the crab cakes, apple salad, big fish and grilled chicken sandwich.  The appetizer plates were chipped around the edges and the crab cakes were extremely salty. The apple salad was basically mixed greens, shredded green apples and honey mustard dressing which resulted in an overly sweet salad instead of a sweet and tangy mix. The so called \"spicy\" fries that I ordered with my sandwich were overly salty and had no spiciness to it at all. The chicken sandwich was just alright and the fish my mom had was bland and tasteless. I wouldn't come back to eat here even if someone paid me.", "author": "Elle D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-14", "description": "I enjoy Brooklyn Moon quite a bit. Its a cute little spot- great for a quiet night out with the girls. The food, drinks, and setting are nice and cozy.\n\nThe menu is quite affordable (including the $5 section) which includes a yummy whiting sandwich. The rest of the menu is also quite good.\n\nAs stated by other reviewers, the service can be dicey because they are not hugely staffed, but they're quite nice.\n\nIf you have free time and are looking for somewhere to hang out and enjoy good food, this is a good choice.", "author": "Stacey R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "Oh Brooklyn Moon I'm a fan of your food, but the service sucks, but dining here is a must. Oh Brooklyn Moon Oh Brooklyn Moon. Why does your service sucks?\n\nFirst time eating at this spot with a group of 8. A friend recommended us eating here. It was a Saturday afternoon and the restaurant was quite busy. \n\nThe Service:\nNot only we had to wait a while for a table but we had to keep reminding the hostess that we were still waiting for a table as she forgot that we even ask for a table. We waited forever for our food to come out. Only one person ordered an appetizer (the calamari is a must try with the spicy dipping sauce) and that also took forever to be brought out to our table.  We were terribly hungry. When we finished our meal, we must of ask the waitress for our check 3 times within a half hr of being done eating. We were ready dip out without paying since they were not concern about giving us our bill. We had to repeatedly ask for things.\n\nNow the Food Part:\nI ordered the BBQ chicken with mac \u0026cheese and roasted vegetables. Also what I love about this place is that the meals comes with 2 sides! Unlike the restaurant Nights of the Cookers which only gives you 1 side with your meal. Ugh the nerve of them!\n\n\nMac \u0026 Cheese---on point\n\nRoasted Vegetables--- on point, quite delicious (they were big in size, had to cut them in piece to fit in my mouth)\n\nBBQ chickenwas good, but it was more of grilled chicken pattie with sauce (I was expecting wings, thigh or a drumstick, something with a bone)\n\nCrab cakes------on point...its shaped in two big round balls\n\nCurry Potatoes----- I didn't like so much, just my personal taste.\n\nMy friend ordered the apple martini and it comes with shredded sliced granny apples. It looked delicious. And the rum punch I heard was good.\n\n\nSo go and eat...\nThe prices are just right.\nThe food is just right\nThe drinks are just right\nBut remember the service just aint right. Don't go hungry!", "author": "Esther A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-08", "description": "The food was tasty but the salmon was overcooked and my three sides (mac and cheese, greens, and yams) were NOT hot. Had to send the sides back to be heated in the microwave and that ruined the meal for me. Had almost finished the rest of my meal and the waitress had still not come back with my microwaved sides. She was busy serving others and i was just sitting there waiting. I had to get her attention and ask her to bring me my microwaves sides. Seriously Brooklyn Moon? I like my food piping hot. How difficult is it to keep sides hot? This is my biggest pet peeve with restaurants and unfortunately for Brooklyn Moon, a deal breaker. I will not be back.", "author": "Gypsy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-11", "description": "BROOKLYN WE HAVE A PROBLEM...Sand in my collard greens is unacceptable!!! WTF do I look like,  Kizzy..? (please see the show ROOTS to get that one) The food here is actually good, so I'm really surprised that I'm writing about it \u0026 it's way too many times for you to \"F\" up and I continue to say \"Here's My Money \u0026 Continue To Screw Me\" ....HOWEVER!!!! Someone in my party ordered the jerk chicken wings that came out w/a side order of feathers, \u0026 a slow a** waitress w/an attitude...REALLY...? I remember my first meal here back-n-da-day after a video shoot I did \u0026 it was great, but I wonder if they put extra care into my food because I was half naked shaking my a**...Hmm...Anyway this is unacceptable which really suxa** because it's around the corner from my home \u0026 I can get to it when I'm lazy \u0026 hungry, \u0026 they don't deliver...NO BUENO!!!!", "author": "Smithsonian G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-19", "description": "I kept giving Brooklyn Moon a try because I wanted to support a local business but the service was so terrible that I can't stomach it anymore. The waitress may bring your food after almost an hour of waiting and then you'll be lucky if can catch them 30 minutes later to remind them that they forgot your drink. \nI took my boyfriend on a date and the owner was playing Call Of Duty on PS3 or some other game console but had projected really huge on the wall. So during our dinner we were subjected to watching him slaughter people on his first person shooter. Romantic, eh? I asked the waitress would this be on all night and she basically said it wasn't going to change. \nReally unprofessional all the way around. The health department closing sealed the deal on me never going back.  Food was great but does it matter after all that.", "author": "D. C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-09", "description": "So... the 5 dollar meal (inspired by 9/11) is the bomb.\n\nThey have a pretty generous menu to choose from... and how dope is it to have comfort food that you can afford?\n\nFrom what I remember, service was slow, and it took quite a few minutes for us to even get a menu. \n\nMy friends shared a plate, so the portions are good sized.\n\nGo next door to Night of the Cookers for Apple Pie a la Mode for dessert!", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "3.5 stars... (4 for food)\n\nI was here on Sunday for lunch.  I ordered lots of spicy food which was very flavorful and did not disappoint. \n\nFor the two of us (gluttons), we ordered, fruit punch (I would never order fruit punch for fear of receiving a glass of hawaiian punch (basically my only experience with fruit punch - blech!), but after reading the reviews, I ordered a fruit punch. I was pleasantly surprised. It was great. I dont know how to describe it really, but it transported me back to the Caribbean (I just got back from a vacation in Grenada). Very nice and not too sweet. \n\nAnyway, the bf ordered a rum punch, which was also very good (basically the fruit punch with some rum). \n\nFor starters we had calamari and spicy shrimp. Both were cooked perfectly and not chewy at all. The spicy shrimp was indeed spicy and kind of reminded me of my mother's shrimp curry. \n\nWe also shared mac n cheese, and candied yams. They yams were a bit mushy for me, but I enjoyed the mac n cheese. Just cheesy enough for me.\n\nI had the curried mussels with curried potatoes, and rice n peas.  The mussels were excellent and HUGE. Also, they were green lipped mussels, which I had never had before, so that was kind of interesting.  One thing I did not like was that the other part of the shell of the mussel was removed. I didn't like this because then I just had to trust the restaurant that the mussel had opened on its own.  I am kind of paranoid about this because I definitely have had some dead mussels at various restaurants around BK.  Anyway, I crossed my fingers and hoped for the best. Everything was fine in the end. The curried potatoes (which I chose based on someone else's review)  were too salty for me. I enjoyed the rice n peas with the tomato style sauce on top.\n\nMy bf seemed to like his food, butI can't comment much about that since he doesnt say too much about food.\n\nSo that's the food. Onto the rest..\n\nThe place kind of a a deep fried smell about it. i was not really into that, or the decor of the place. There are these dingy looking purple curtains along one wall that are covering god only know what sort of ugliness behind it. But anyway, its not that much of an eyesore, I just wish this place had more of a clean and fresh look about it. Perhaps I am being overly negative, because the gray, wet weather outside, certainly did not help things.\n\nI would definitely give this place a try again. Also, I did not see any roaches (and I was on the look out!) and service was fairly prompt. We did not wait around and the owner (i think she was the owner) seemed very friendly.", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "This Fort Greene restaurant has community, soul, a surviving\nmenu that hails some great seafood entrees as well as meat and\nvegetarian-friendly fare.  Smoky and dim in ambiance, you\neither adore the atmosphere or are just there for the food.\n\nThe $5 Anti-Bush menu is an undeniable staple. You cannot\neat at this place without a taste of salmon burger or their jerk chicken.\nI would say to have a thick skin as their service is bi-polar-- either\nit is comforting and swift or they down right ignore you. You do not\nbecome a patron of Brooklyn Moon based on their waitstaff or\namicable personalities. You go because you are craving curried\nmussels, comfortable seating, a people of color setting, and\nyou probably have a meeting or an event to go to in the \nneighborhood.", "author": "kay b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-08", "description": "ABSOLUTELY AWFUL SERVICE!!! \nA friend and I wanted to catch up and decided to have dinner at Brooklyn Moon. When we got there about 2 or 3 tables were occupied; we were seated, given menus and water.  After about 20 minutes of being MIA and scrambling around, the waitress finally came to take our order.  We ordedr and off she went.  My friend and I were engulfed in conversation and did not realize that 30 minutes had passed and we were still waiting on our food.  We called for the waitress and she told us that the chef was working on it - ok we say - back to catching up. So...another 45 min pass and still no food. At this point we have waited 1 FULL HOUR \u0026 15 plus minutes - NO EXAGGERATION! We address the waitress, asking what the issue was...do you know what she says??? \"What did yall order again??\" . HUH?!! What did we order again!? She can't be serious!! We ask - wait? did you put our orders in? She says \"I dont think so...it must have gotten confused with another table...what do yall wanna have\".\nLonger story Trying to be short - we promptly  left and ate at \"Night of the Cookers\".\nBrooklyn Moon should be ashamed of themselves - I heard the food is tasty but they have to revamp the whole wait staff.  EPIC FAIL!", "author": "Iminspired L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-11", "description": "Went the other day for lunch..it was good..really cant complain...I ordered off the $5 special menu..which is a choice of an entree and a side. I had the turkey burger and fries and I also ordered the apple salad.\n\nTurkey burger was really good...juicy, nicely seasoned...came with a slice of a beefsteak tomato and greens!! The bun was a little low budget...kinda reminded me of the buns they would serve sloppy joes on in the grade school cafeteria\n\nFries - I will pass on this the next time...also reminded me on fries from grade school cafeteria\n\nApple Salad...GREAT...I truly enjoyed it...the serving size was huge!!\n\nThe service was not good..but not horrible...it was just there!!! I sat by the window because it was warm out that day...but while there all of a sudden it got really windy...so i asked if i coudl close the door...being that i was the only one in the restaurant...dude kinda gave me that stank eye..and tried to make nice..like ..\"oh its so beautiful outside\" I didnt feel like getting into it with him,....so i was like whatever...I will move to a table in the back..but truth b told..i shold not have had to move to a another table..damn dude shold have just closed the door...it was really windy.....aarrgghhh ..the nerve!!\n\nBut all in all...I will prolly go back for the $5 menu!", "author": "Bev G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-23", "description": "It's funny how this place is called a cafe since it's not been a cafe for the past oh 8 to 10 years according to the waitress.  Nonetheless, the place is great. Smoke Joint and 67 Burger were overcrowded so the boyfriend and I walked around the corner and stumbled into this place.  I'd never been there, so I always thought it was just a bar. \n\nLittle did I know we were in for a treat. \n\nWe just missed the $5 Anti-Bush menu, so we ordered from the regular menu. I had the fried tilapia w/ corn and rice and beans and he ordered the fried chicken w/ mac.  The tilapia was nicely breaded w/ cornmeal and hint of lemon. It was cooked perfectly - crunchy on the outside and flaky and moist when you bite in. The chicken was typical fried chicken fare but still very good.\n\nWe didn't order any alcohol but the guava lemonade and fruit punch were not too shabby. Service wasn't bad at all. I think it helped that we were the only ones eating dinner.\n\nI'll probably go again. Good portions for the price. I'll even ignore the cockroach that Koku mentioned ;)", "author": "Yvette C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-24", "description": "I loved my first trip to the Brooklyn Moon from start to finish, and I'll definitely be going back time and time again. \n\nThe cafe is dimly lit, with antiqued decor - lots of old lamps and drapes in a small, yet cozy, space. Our dining music was old school culture reggae coming from behind the bar. The waiter (who also doubled as the bartender on a slow Wednesday night) was friendly and courteous. He made me the best apple martini I've ever had! It was poured over thinly sliced strips of green apples (which was v. cool), and was strong, yet sweet and flavorful.\n\nI ordered the fried chicken breast, which came with two sides for $9.75. The chicken breast was off the hook! I was served a huge piece of chicken with heaping potions of mac \u0026 cheese and spicy fries. I usually don't like white meat, but it was extremely juicy, and not one bit greasy. It was extremely well seasoned - I knew from first sniff that it would taste fabulous. I tend to kill restaurant food with black pepper because I find it not to be flavorful enough, but that was not the case here! And it came with a bottle of Caribbean hot sauce! \n\nThe mac \u0026 cheese was good, though it could have used more cheese, and the spicy fries were seasoned, but not hot or peppery (again, not greasy, either). My friend had the three cheese ravioli, which was ok (and inexpensive... $3.95), but I'm not a ravioli person.\n\nThe bathroom was very clean, just like all of our eating utensils, plates, and glasses. The food, atmosphere, pricing, and cleanliness were all up to my standards. Overall, it was a great dining experience. \n\nClosed Mondays. Happy Hour from 4 to 8, Tuesday-Friday.\n\nUpdate: Forget about the chicken breast... don't sleep on the burgers on the anti-Bush menu, the curry potatoes, or the jerk wings (which are better than the jerk chicken for some mysterious reason).\n\nAlthough the food and atmosphere are still great, the service and drink quality have gotten worse. The usual waitress/barkeep is slow, doesn't check back often (like to refill water) and doesn't mix drinks very well. Play it safe and order wine or beer if she's around.", "author": "Anthonine P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-07", "description": "Closed by the DOHMH for an amazing 104 violation points on 4/29/2010.  (http://167.153.150.32/RI/web/detail.do?method=detail\u0026restaurantId=40534912\u0026inspectionDate=20100429)", "author": "Lucien V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-09", "description": "I went here twice. Once was to have drinks with a friend. Next was to a poetry event. I have a few problems with this spot. The bathroom door does not close entirely, and it looks like a bad thrift store. The girls working there are so busy they skip your orders. Overall its ok but not somewhere I plan to go back to. I ordered one Margarita and the entire night the waitress passed me by and never brought me my drink. Super duper disrespectful. The lighting is intimate, its quiet but the train is right underneath so you can hear it as it passes. Its really small not enough seating. Only good for a quick drink.", "author": "Marie Annick M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-23", "description": "I went here yesterday.  Loved the vibe..they had a movie playing.   Food was good and price was reasonable.  We will go back.\n\nOk so the food was good but the service was HORRIBLE.  I think the girl serving us didn't have a brain.", "author": "Courtney C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "The seawater was the best I've ever voluntarily or involuntarily swallowed.  The food was very good, although slightly over priced for the quality.  I got the crabcakes and was really impressed by the meatiness of them.  I was stuffed after finishing them with the apple salad and fries, but I guess you're paying for location when they cost $16 and jerk chicken is $15.  Let's remember that there's little hole-in-the-wall West Indian spots where you can get the same food for half that price.  Speaking of location, the decor in here was confused and slightly ironic; half tropical (\"bungalow\" styled bar area with palm and banana leaves hanging around), half colonial (oil paintings of European countrysides).  But it was dark and chill and the music was good so I guess that's all that matters.  The service was very good.  They also don't serve dessert...huge faux pas in my book, and I personally think Cake Man Raven could use some competition.", "author": "Ava R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-24", "description": "I've been here several times in the past few years. The food is pretty good; especially for the price. The roasted veggies are yummy, and so are the rice \u0026 peas, mac and cheese, salmon and the guava lemonade. Once when I went, we waited a really long time for our food but, in their defense, our party was crazy large (more than 10 people) and the waitress was very apologetic and attentive. And the taste of the food made up for our wait.", "author": "Janie Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-09", "description": "In short: Extremely slow with food; and when they bring the bill, the credit card tray has an AMEX logo on it...however, the restaurant doesn't accept AMEX. An absolulte mess.", "author": "Taj W."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}