{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "I want to give the 3.5 stars because the air conditioner was not on a 93 degree summer day! Hot but bearable for $1 mimosas and 12.95 brunch. How can you stay mad with those prices. Everyone loves their protein. We ordered jerk chicken, fried whiting, and fried chicken all three tasty. Macaroni and cheese while a hefty portion we have all had better. The overall experience was pretty good. Great place to brunch with friends.", "author": "Amma B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-25", "description": "Came in for drinks and sat at the bar on a Saturday afternoon. Vibe was great, bartender was friendly and efficient and drinks were strong (get the Male Escort)! On the strength on the bartender we returned for brunch - what a disappointment! I ordered chicken and waffles. The waffle was made out of pancake batter, yes I received a pancake in the shape of a waffle. Dry, crumbly and bland. All the food was bland. And we had to ask for salt - what is with these restaurants not putting salt and pepper out anymore? My companion had the fried whiting and cheese grits, both of which needed salt. I also agree with what someone else said that the food is just not seasoned well at all. The mimosas are a dollar and they're fine. I'd come back to enjoy the atmosphere at the bar but not to eat.", "author": "Melanie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Everytime I come it's a great experience. Brunch is $14  $1 mimosas till 4:30 and the staff is attentive", "author": "Brittney W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "I've been eating at Brooklyn moon for almost 15 years. The food is amazing, the drinks are delicious and the atmosphere feels like home. I always feel welcomed when I go. It is literally my favorite restaurant. When my friends and family ask me where I want to go to eat and I say the usual, they know it's brooklyn moon.", "author": "Revee J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "So far i've only had drinks and the jerk wings, but I already love this place. SO ready to try those $1 mimosas but more importantly, STRONG HAPPY HOUR DRINKS ALLLLLL NIGHT! done. nuff said.", "author": "Katurah T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-02", "description": "I have to first say I don't know of this place doesn't have an AC or they just don't turn it on. So, don't go there on a hot day, you may melt. I came here for brunch.  I got the fried chicken. It was okay but could have used more seasoning. The mimosas are cheap and good. I went once but haven't been back yet. With the amount of brunch spots in Brooklyn this one is not on the top of list. I wouldn't lemonade it completely. I may return to try them again.", "author": "Ayesha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "Brooklyn Moon is a great spot for brunch. The $1 Mimosas were vey well made and delicious, and you can't beat that price! The food was very well done, and seasoned very well. The only thing is it's not the best place if you're coming in large groups. Other than that,Great experience, and I would definitely return.", "author": "Nicolea W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "Great drinks--seawater was strong and good, great service without being overbearing. The server Alexis was very friendly and chatty. I tried the jerk wings and spicy fries. Servings are large for the cost. The jerk wings weren't the best I've had (ok not excellent), but the fries were tasty (and spicy). Nice little spot although they should invest in AC. It gets hot in there. Would def come back.", "author": "Mika A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-26", "description": "FIRST AND POSSIBLY LAST VISIT!!! \nI could not eat the meal that was ridiculously spicy, and the staff and management were less that courteous. When the Manger finally showed up, she was DOWN RIGHT RUDE AND UNPROFESSIONAL!!! Not offering to make a new dish or at least take a percentage off the bill. Her solution after she tossed the menu at me so I could re-read the description was \"we can bring you some lettuce\". I was willing to take the loss since I did eat two of the six shrimp, and a couple of croutons that weren't soaked in whatever hot sauce that was but management's foul temperament made me not want to. I've never had such an experience in a \"professional\" establishment.", "author": "ronald c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "I love this place,  I was looking for some soul food and found it here.  I came here around 11am on a Saturday and they had brunch.  I got the jerk chicken wings with homemade potatoes which was amazing.  It was a little spicy which I really enjoyed.  They also had $1 mimosa which by itself will keep me coming back here.  My friend got the french toast, I tried some of her food and it was also amazing! So soft and tasty that you don't even need syrup on anything else in it to like it.  \n\nThe service was great, the waitress was very friendly and accommodating.  \n\nI also like the set up in here, they have a sign by the bar area that says \"Do the right thing way.\"  Overall, I really enjoyed this place and would surely come back or recommend it to a friend.", "author": "May M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-30", "description": "Happy Hour was good... I order the Shrimp from the starters it only came with 5 shrimp and the service was terrible...I guess because they need more help but i would def say go for the happy hour and brunch", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Epic. Awesome. Groovy cool chill vibe. Doing the Caribbean justice. Bringing my south up north. This is one of NYC's finest.", "author": "JD S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "I stumbled across the place because of the music thumping. A fan of their $1 mimosas and the food in general. \n\nThe only suggestion I have is keeping the music to a level where I don't feel like I'm screaming at my guest. The music is what attracted me to the place. It was just a little too loud. \n\nGo eat and enjoy though. I'm coming back soon.", "author": "G A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-25", "description": "This restaurant had the worse customer service ever! I came for brunch on Saturday. When I arrived they said the kitchen was closed for one hour. So I said not a problem I'll order drinks while I wait. The host Lily tells me that seating is only for customers that are dining. Hmmm so I want to dine but your kitchen is closed and I'm willing to wait but you won't seat me because I'm not ordering food??? I had a 15 year old with me so we couldn't sit at the bar. So basically your telling me I can't walk into your restaurant. Okay. By the way we're having this conversation in the doorway while it's raining!! Terrible service won't be coming back ever!", "author": "Alexandra A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-22", "description": "A friend and I came here for dinner and it was decent. Upon arrival we were seated. We were not offered water or any sort of beverage while we mulled over the menu.\nAfter 15-20 minutes I hauled down a bus boy who brought us beverages asap. We ordered food. And the wait wasn't too bad.\n\nThe food was Delish. I had the spicy shrimp with rice and peas. It was a large serving. Oh and for an appetizer I got the turkey bacon rapped in plantain.\n\nOverall it was decent but I don't think I'll be back. Their service people need some training.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "I absolutely love this place, the vibe is so peaceful yet give you the feel of being in the city.  People from all walks of life comes there. And that lunch special is beyond amazing.", "author": "Starkeema G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-03", "description": "The manager was rude and disrespectful. She wore a head wrap and was head bopping and. Being disrespectful to the customers and comedian.  The manager 's information was asked and she denied providing the information.   As a manager we do hop that customer service is first however she was not concern or care.  She basically told me to have a \"seat at table \".", "author": "Castor T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "Took my mom here since we were out and about. Brunch was very good. I love the look and feel of this place. \n\nYou can't go with their fish or chicken. Very well season. $1.00 mimosa for brunch different flavor. \n\nThey also make great mix drinks. If you are ever in the area I recommend you try them out. Great group of people.", "author": "Natasha A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-22", "description": "Food was ok, drinks where strong so I'm not complaining about that. Small space with very little room and very loud mad it hard to even hear the waiter. Unless your sitting Infront of the AC like o was before asking to move because of the draft the restaurant is Hot a lil stuffy. Not sure if I would go back but it was cool for the time being", "author": "Krystal S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-28", "description": "Terrible slow service. Was seated right away. I went there with two other people for brunch on a Sunday. Took our drink orders and the waitress never came back to the floor. It was busy there but it's a small place n the waitress was no where on the floor. No other waitress came over to the table noticing we was seating there with empty tables. After twenty minutes of being ignored I flagged down a waiter. I would have left n not paid for drinks but the people I came with wanted to eat. After an hour from the time we sat down we finally got our food. It wasn't worth the wait. Basic food it wasn't bad but it wasn't good. I got fish n grits and my friends ordered chicken n waffles. The waiter that serviced us was on point n was trying his best to give great service after the girl disappeared, his name was Roshun and the other staff that helped him. Eventually the original waitress came back to the floor I didn't get her name but she looked like solange the singer. She never came to the table to apologize or even looked our way again, she did look down at our table to see if we had food and we didn't and she continued to pretend like we wasn't there. She continued to walk around the restaurant greeting the other customers. And when we was ready to pay the bill she awkwardly came to the table to get it but the other waitress picked it up first. That girl sucked I don't know her reason for leaving us hanging but I hope it was an emergency n not BS. This was back in November. A Tip to waiters n waitress if u see n empty table n customers seating there even if it's not your table ask the customer are you being serviced. It reflects badly on the whole staff and restaurant.", "author": "Tyseti S."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}