{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "This isn't just a cafe, it's a restaurant...a darn good one too! Through the years, I've watched Brooklyn Moon Cafe morph from a bar, into a joint for poetry slams to what it is now. I hope this is the final destination. I only spied the buffalo wings that my friend and her date ordered but I could tell from the picked clean bones, that they must have been good. My fried tilapia was crispy and nicely seasoned. I ordered it with some type of potato that was probably delicious but after my rum punch, who knows... The rum punch here is tasty and sweet-not at all strong tasting but it should come with a warning label. One minute, I was having an intelligent conversation with my friends. 5 minutes into my drink, I was talking too loud and banging on the table!  Low lights and a very smooth, lounge like atmosphere, make this an excellent first date spot especially if you're dating someone who doesn't know BK and you're trying to earn sexy points.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Great food and awesome drinks. The place is small and quaint. Service was attentive. They fill up fast but the meal is worth the crowd. I had a shrimp dish that came with curry potatoes that were delightful. The drinks were strong and worth the buck. Definitely planning on returning.", "author": "Tasha L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-06", "description": "When you pass it from the outside, it seems like it would be a good place to eat, but it really isn't.\n\nI've eaten here twice, the first time getting the fried chicken plate with a couple of sides....The fried chicken was just not good, plain and simple. Soggy and dry, worst combo....The apple salad has all the makings of what should be delicious until they decide to douse it in dressing.\n\nFigured I give it another shot (because I had a gift certificate for 1/2 off)....I got the Salmon which is overpriced at $17. It actually was not bad, pretty decently prepared but awfully small....The mac\u0026cheese that accompanied it was the most bland i've ever had, and the sprinkled on cayenne didn't do much to jazz it up.  The sweet corn was just an opened can of corn dumped on my plate. \n\nThe only noteworthy moment was the server. She was super nice and friendly and is the only reason I'm not giving 1 star. I would think of coming back for happy hour (which i've heard is very solid) but please, no food for me.", "author": "Collin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Nice atmosphere.  Drinks are strong... neo soul in the air..  Chilled with owner Mike. Kool dude. Service was great.", "author": "Don P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "The best happy hour in town! $4 margaritas and other cocktails! Need I say more? Well, I will. The food is also outstanding. The salmon burger and grilled salmon in particular. And their spicy fries are so good I've had dreams about them. My sister had the curry mussels and couldn't stop raving about them. Add in lovely waitstaff, a chilled vibe, and the dopest old school reggae and you've got a recipe for a restaurant that will quickly become one of your faves. I can't say enough about Brooklyn Moon. Check it out asap.", "author": "Tracy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-25", "description": "This place has always been a disappointment. Customer service is always horrible, the food is always hit or miss but this last time, I had a fish dish that made me sick for a MONTH!\n\nI suggest you NEVER go to this spot, ever.", "author": "Raquel R S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-14", "description": "I went here for the first time last night with a friend. Wasn't too crowded for a Friday night that was a big plus. Also happened to be an all night happy hr special so that was definitely a win!\n\nAs far as the food. I had the grilled tilapia with Mac and cheese and corn. Everything was good. My only complaint is that the food wasn't hot when it came out. \n\nThe service was good. The drinks were good. The menu has a lot of seafood options. I would like to go back and try some of the other entrees.", "author": "Zakiya A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "Wasn't expecting much out of this spot but the food was really good which surprised me and can't forget the $1 mimosas at brunch", "author": "Jade E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "If only this place was bigger... I really like this place. It's a nice place to just chill out with a friend or two. The food is really good. The drinks are amazing. The staff is super polite and very helpful. The place is clean! Parking can be a bit difficult, but worth waiting for. I'd absolutely recommend this place to anyone who is looking for a place to eat and drink comfortably while having a good conversation. Or if you want to grab a bite to eat before you head out to the club or a concert.", "author": "Troy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "Small place but hey! Food was delicious (dinner) and the drinks Whoa (very good served with Wrey \u0026 Nephew)", "author": "Michael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "I visited this restaurant last night with some homegirls, and we fell in love with this place. The food was amazing and the waitress was extremely pleasant. I ordered the honey BBQ wings and a side of Mac n cheese-- when I say phenomenal, the food was just that. I'd highly recommend this spot to others and can't wait to go back soon.", "author": "Ieshia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-12", "description": "The Brooklyn Moon is one of my favorite Brooklyn restaurants.  The crab cakes are very good and I wasn't disappointed with the portions. The waitresses are very personable and they went above and beyond in answering my questions.\nThe highlight of my visits to the Brooklyn Moon are the great selection of mixed drinks, which are very generous with the alcohol. It really does bring me back home.", "author": "Cheyney M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "I went to this place with my aunt and my mom. We had such a nice time. The drinks were good. The staff was happy and social , things went wrong but made the night fun and eventful. So much fun.", "author": "Locked L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-02", "description": "The drinks have my five star vote.  You will certainly get your money's worth there. GET THE 'SEA WATER'.  AMAAAAAAAAAAAAAZING.\n\nNow about the food.  Not bad. Nothing to write home about, but decent. My boyfriend loves the spicy shrimp and I usually order the fried chicken mac and cheese combo.\n\nThe service is great; very prompt and warm. I also love the ipod that they bump in the background.", "author": "Lady k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-07", "description": "I ate here last night with my Mom and had a really great experience. My mother and my little sister, unbeknowst to me, had been here several times but never told me about it, which I thought was very very mean! \n\nMy Mother first suggested Night of the Cookers in which I almost erupted in complete rage because that place is just awful and I refuse to ever step foot in there again! It exemplifies everything I hate about restaurants frequented by people of color. But Brooklyn Moon Cafe is my refuge now. \n\nSince it was a Wednesday night, the place wasn't that heavily populated but as soon as I walked in, I knew that I would enjoy the views at least. There was a bevy of beautiful brownness scattered throughout the restaurant. The waittress, who is obviously included in the bevy, seated us in a lighted area because my Mom has trouble seeing the menu in those darkly overtly sexual lit areas that seem to be typical of restaurants these days. We prefer to see our food! \n\nI have to say that the waitress was so attentive to our needs that I was extremely surprised. Actually both waittresses were, and there was a beautiful deeply ebony goddess that works there who i couldn't help but to be flabbergasted when she stopped by to chat and fill our waters....I mean my GOOD WORD, nearly fainted into my empty plate! \n\nOn to the food though, which is the most important of course...We went straight to main event and ordered entrees with two sides. \n\nMy dear Mom had the fried fish with red beans and rice, corn, and a small salad. I believe that all the meat entrees come on a bed of mixed greens. The fried fish was done very lightly with, what tasted like a corn meal crust. I'm typically not a fan of fried fish as I find them extremely fishy tasting at Southern/Soul food restaurants but this was so light and good. I didn't taste the red beans and rice or corn as I had my own entree to deal with but my Mom devoured her meal! \n\nI had the spicy shrimp with collard greens and mac and cheese, I know fat boy style! Ha! The shrimp had been drizzled with a sticky sauce but was done to perfection, I thought...not tough or overly sauteed. It tasted very fresh and, honestly, I was in shock. The collard greens were amazing and I wish that they would've given more because they were also not overtly salted...I didn't eve use vinegar which I normally do on them. The mac n cheese was definitely to my likening, being a lactard, I prefer a nice lightish mac and cheese and this was perfect for me. Overall, I was literally scrapping the plate for more food before my Mom was half way done with hers...but she's a slow eater anyway...or whatever, don't judge me! \n\nI forwent the alcohol because I was with my Mom but I did have a Guava Lemonade which was good but a little too sugary for my taste and speaking of, if you're diabetic, I recommend watching out for that...water and lemon will do you just fine! \n\nOverall, I had a very enjoyable meal, visually and flavorfully.", "author": "Quincy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-28", "description": "I've been twice so far. I enjoy the Happy Hour drink specials - great deal. Yesterday was the first time I ordered food. Decided on the Honey BBQ wings and a side of Mac \u0026 Cheese. The wings are seasoned/sauced nicely but could stand to be a little bit more tender. I like my wings to be succulent and falling off the bone. Their wings put up a little bit of a fight. \n\nThere was absolutely NO CHEESE in the \"Mac \u0026 Cheese.\" The flavor was decent enough but it was as dry as the Sahara Desert. Do better, Brooklyn Moon!\n\nDecent atmosphere. The wait staff was nice both visits. They could stand to change the music up. They literally play the exact same 80s iPod mix. I love 80s music but...mix it up a little!\n\nNice, clean, well stocked bathroom.\n\nBut seriously, please work on that dry a$$ Mac \u0026 Cheese!!!", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Cool bar...bartender guy who was there when I went was awesome...happy hour wine varietal selection is nice...also the jerk wings were good...crisp and nicely spiced...will be back...great atmosphere...", "author": "Milan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "The jerk chicken was very tasty- not too dry and nicely spiced. The waitresses were nice. I would have given 5 stars but there's no a/c and I'm a wimp.", "author": "Cindy A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-03", "description": "Doing a search for Soul Food in the downtown Brooklyn area. Happened upon Brooklyn Moon. I ordered fried chicken, Mac and cheese and peas and rice. \nThe fried Chicken isn't fried! It's  shake and bake!!! Really salty! So disappointed!\nMy friend ordered guava lemonade. Taste like lemonade mix and guava juice-- too sweet! Wanted to like it, but sorry won't be going back.", "author": "S P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-30", "description": "Always wanted to try the place. Went there with a party of 8 on a weekend afternoon. They had us waiting outside at first. It seemed like they would've forgot about us, had it not been for one of the persistent hounding of a friend.  Another round of  the food waiting when we were finally seated, this time close to an hour. By that time my stomach started chewing on itself and started to develop  a headache. One of us was tipsy since her drink came wayyyyyyy before any food. \n\nSince we were a group i got to sample everyone's food.  I had fried calamari. Since i was the only who ordered an appetizer everyone jumped like wolves on my plate.  I had honey BBQ honey wings with plantains and rice and beans. Honestly everything was good, even my friend's salmon salad.  Drinks were great. I really liked the rhum punch.\n\nI would've given them 4 stars but because of the service it had to go down 2 notches. Yes 2, because GOOD FOOD CAN NEVER EXCUSE BAD SERVICE.  It got so bad at one point that our waitress avoided any eye contact with us. Unacceptable! besides you wait so long you're not even REALLY  tasting the food.  I would not recommend going there on an empty stomach, which is a shame since they give you good portion sizes. Until they fix their horrible service you won't find me in there.", "author": "Annie T."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}