{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "Customer service was A1, the food was A1, the music was A1. \n\nMy two friends and I had the jerk chicken, the salmon, and the fried chicken and we each really enjoyed our meals. Overall it was just a great place to be. \n\nThe only downfall was that they didn't have some of the ingredients listed on the cocktails so we had to substitute or do without certain ingredients in out drinks. All 3 of our drinks were really strong which is usually a good thing but I wish they were just a bit more favorful.", "author": "Keri S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-28", "description": "If I can give this place a negative star I would, I have been coming to this establishment for years and although my spirit never took to the owner, I never engaged with him and that was fine. I've told many of my friends about this place over the years and in so doing it became one of their go to spots.\n   With that being said, the owner is a grotesque, reprehensible, disgusting, vile excuse for an owner/manager. Sunday my friends and I went after the rain subsided and got seated at a table, we waited for nearly 30 minutes before even getting water, nonetheless my friends and I didn't complain and were enjoying a lighthearted conversation. We ordered a round of drinks and fries, cool- no less than 8 minutes after receiving our drinks the owner comes out (not our original waiter which was suspicious) and begins lambasting my friends and I for not ordering bigger plates, like what!? That led into a back and forth, he grabbed menus, threw the receipt \u0026 grabbed our drinks off the table. We excused ourselves without paying. The laughable thing is the drink was $12 each which is around the same price as a full plate, there were 4 of us so had he some self control \u0026 couth, we more than likely would have ordered more rounds. He's worn, haggard, disgraceful \u0026 disrespectful and it shows. \n  I don't wish bad for people and I won't start here however it is time someone took that place off his hands and erects an establishment that knows how to reciprocate respect! \n\nThe imp needs to seek therapy, you're losing it \u0026 a\nMan your age should know how to separate personal life from business, it's spilling over and it's messy. It's a wonder you were so grossly understaffed. Anyway, There's better so, God Bless.", "author": "Pnutylah L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-28", "description": "I am thoroughly ticked and disappointed with the manager/owner for his unprofessional behavior.  There were 7 of us that came in on Sunday after a show. It was raining pretty hard and there was about a 30 minute wait which we were cool with.  We headed towards the back to get out of the way and have some drinks while we were waiting.  One of my friends pulled a chair closer to the group and the manager/owner went off on her saying that \"his partners would not like it if she fell off the chair so you can't use it.\"  We all were shocked in how he talked to our female friend, however we excused him.  Well not 5 minutes later, he goes off on a waiter dropping F bombs in front of us about other patrons so we decided that it was time to bounce.  As we were leaving, he started yelling and cursing at us for leaving!   He was saying some very ignorant things about the way we were dressed all while we were walking out and down the street.  It was absolutely horrible.  Needless to say, he has permanently lost at least 7 patrons that day as we will NEVER step foot back into that place.  \n\nMy advice to that man, seek help, clearly ya need it!!", "author": "Donna A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-26", "description": "Manager/Owner is completely unbalanced and screamed at us as we tried to come in from the rain where we'd been having drinks and find a table for dinner. He went on a tirade berating his waiter about having low covers and people having water and French fries (non of which happened)...\n\nHis financial woes are not mine - really didn't care to be screamed at. We'd also spent almost $100 on drinks as we were waiting for the kitchen to reopen for dinner. More\n\nToo bad because my sister loves the food but the service isn't worth it", "author": "K E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-02", "description": "A friend recommended that I go to Brooklyn moon \nDecided to give it a try and sorry to say I was very disappointed . \n\nThe staff was friendly, very welcoming upon entering, we were seated right away. \nIt wasn't a full house but because it's not a large space I felt as though it was. \n\nHad the crab cakes for starters. Very small and for the price I've had better. My main dish was the salmon with roasted vegetables. The salmon was way too salty for my taste and dry as hell, The roasted vegetables were not good. Too soft , over cooked, salty and brown ! I cldnt even tell which vegetable was which . The pictures I took tells it all!  It was BAD! Really BAD ! I couldn't eat it . \n\nHubby had the fish and chips. The coating of fish had a nice texture but the fish itself was bland. \nWaitress was nice ...pleasant and checked in periodically to make sure all was good. \nAs much as I would like to give this place another try I have to pass. Sorry but I have 2 stars, great location and pleasant sta", "author": "Demora F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-28", "description": "I won't return to this establishment. For some reason the owner chooses to take his frustrations out on black women although they're the main reason his restaurant has survived for all these years. There are tons of better options in the area, including La Caye.", "author": "Derrel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-23", "description": "I personally enjoy Brooklyn Moon for their brunch, however I came with some coworkers for happy hour. The drink prices were good but what I ordered .. I was not a fan of. I got margaritas (great! \u0026 a lot of flavors) but I also ordered a salmon burger that was very mushy. I didn't finish it and just ate the fries. I know everywhere makes it differently and maybe i should've asked for it to be cooked longer? Not sure- maybe I'm not hip to it but it's not my first salmon burger and that wasn't what I expected. Overall, I'd still go here for happy hour (just drinks or small apps) and brunch!", "author": "Felicia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "BY FAR THE BEST FOOD I HAVE EVER HAD AT BRUNCH! I cant explain how hard it is at times to find good food along with good drinks at brunch. This place is it!  I had the pleasure of having the jerk wings, mac and collard greens. Everything was great ..I mean amazing! ( i'm literally texting my GF now like can we go back this week) The jerk was made perfectly as if  someone smoked it in the back yard. lol  Very spicy like it should be. Mac was so tasty and the greens were nothing like I had before. They add an extra seasoning that other people don't but it ends up making them even more delicious. \nService is great. MY waiter was so cute and nice..he even was like are you sure you don't want to try our greens and look. lol great recommendation. The place is fairly small so it can be busy but they are attentive to everyone and made sure everyone was seated. \nMimosa are not bottomless but they are literally only 1.99 (overall pricing is great) and a great size. This is great for people that cant hang with unlimited lol   They offer three flavors and all are equally good. I just cant wait to come back!", "author": "Sade T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-04", "description": "Delicious food and a great recommendation for the train conductor. He said they are known for the macaroni and cheese. This is a very small restaurant but very quaint.", "author": "Steph S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-28", "description": "On Sunday I went here after Dance Africa and the Owner was an absolute piece of shit.\n\nHe slammed our food on the table, yelled at myself and friends, cursed us out for not ordering bigger plates, out his hands in our drinks, snatched the menus from our hands and then threw the receipt at us.\n\nIt was the most disgusting experience I've had in my entire life. He was in our faces yelling at us, it's was hurtful. I hope he goes out of business.", "author": "Tiffany M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-31", "description": "I went to brunch with a friend who lives in the city; the service was pretty good once we were let in. Apparently there was some sort of mix up with the time listed on the website and the time they actually open. I ordered the pineapple mimosa and fish and grits. The mimosa was pretty good but the waiter can back to say the grits were not ready and I had to order a different side dish. That was a bummer but I ordered the home fries instead. Overall the price was good, as well as the food. I'd go back on a future visit.", "author": "Cherish M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "Unfortunately, this place is no longer suitable. They won't seat you if your whole party is there UNLESS the hostess knows you.  2/3 of my party was there. We were waiting on one more. The woman that walked in seconds before us was also waiting for someone - he seats her. Then tells me he knows her and that's why he disregarded their policy and sat her even though her whole party hadn't arrived. \n\nThis policy is custom for a lot of restaurants and I get it, but if that's the policy, apply it to all. Don't be selective. And especially don't be selective in front of other customers and then tell them WHY you won't accommodate them. That's just bad business. \n\nLast straw for me.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-31", "description": "After enjoying Dance Afrika....My experience in Brooklyn Moon this past Sunday was absolutely disgusting.... I witnessed the restaurant owner, Mike Thompson be extremely disrespectful to a group of female customers.. He yelled at them for not ordering dinner...and dropped their food on the table... I was so annoyed .  His energy was awful... My friends and I left along with several others without ordering.  I don't recommend it nor will I be returning.  T. Moore", "author": "Tracey G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-31", "description": "Owner CRAZY DISRESPECTFUL! Was yelling, literally throwing food, and cursing at patrons! Was despicable behavior and will NEVER EVER Come back. As principle for how to treat people and respect and decency please do not support this business. Deplorable!", "author": "Jasmin N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "Today was by far the worse experience at Brooklyn moon.   Waited for 30 minutes until they opened and was the first to be seated but winded up leaving 45 minutes after with no food.   Everybody that was seated after received their food when my table ordered two Caesar salads and they were still saying 5 minutes.  Shame on them for lack of help.", "author": "Latrell P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-21", "description": "I came here on a Thursday night with my boyfriend and the service here was horrible. Remind you this is not my first time here which Made me very disappointed. There was no one at the door to greet or to give us a seat. We came to the bar to get a drink and order our food with the bartender who was very attentive to us. He gave us our drinks and told us he would get us a table which didn't happen so we decided to order the food to go and that took forever. So my boyfriend and I asked for a refund. We really wanted to seat and have dinner put everyone here bushed is off and totally ignore us especially the server. I will never come here again.", "author": "Alexander M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-29", "description": "Do not waste your time or money in this so called establishment. The manager, Mike, who was on duty Sunday 5/26/19 epitomized unprofessionalism.  He was rude and disrespectful. After belittling a group of women dressed in white, who decided to leave due to  his offensive verbal abuse, he followed us out of the restaurant hurling insults, calling us colonists. We were a party of 7 who were waiting to be seated for dinner. Spend your hard earned money ANYWHERE else but here!", "author": "Renee C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-25", "description": "The food is very cheap for NYC brunch. $15 meal and $1 mimosas for as long as you're still eating is a steal. And they let you get 2 at a time, which is nice.\n\nSeated as soon as we got there. However, we waited for our food for an hour. Then once we asked the status of our food, the hostess (not a server. Not even sure if I saw one the whole time I was here) brought our food out almost immediately. We both ordered chicken and waffles and the waffles were cold. The chicken are tenders.\n\nFinally comes the time to pay. The first server I saw all day asks us if we want to add gratuity and my friend did. That's when I saw that gratuity was already included in our bill. So we paid $16 in tip for our meals that were cold and not amazing. We immediately asked for a refund so we could not add additional tip because at that point, we would rather wait longer and have our money back.\n\nCheap, but not worth it.", "author": "Arielle Lana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "Have been frequently coming to this place for a few years now... Mostly for brunch.. Big fan of their wings.. Fried Whiting is excellent as well.. Dollar Mimosas are also a steal.. The Seawater is also another great drink option.. Live DJ playing classic hits..\n\nThey need to work on food consistency.. There were a couple occasions where the food wasn't up to par.. Mac n Cheese was bland and fried chicken wasn't great either..", "author": "Shashank C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-16", "description": "I liked coming here for brunch a couple years ago because of the $1 mimosas and the food was pretty good. I have gone sparingly since because the female staff have been intentionally rude and spoke to us as if we were bothering her when asking for basic things . She literally stared at us while we were eating and commented along side with her coworkers me and my guest as if we stole her man smh. Recently I went with a friend with an all male staff and they still was not worth my time and waited entirely to long and the food was only ok after waiting almost an hour. If you feel like you have time and money to waste on subpar service and ok food that is the place to be.", "author": "Sharise B."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}