{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-07", "description": "Brooklyn Moon Cafe has been my go-to Friday happy hour spot for about a year. The Ye Old Forte menu is such a bargain -- for only $5 ($10 with a happy hour drink) you get a choice of fried fish, salmon burger or chicken sandwich with fries or a salad.  And it's delicious.  But this past Friday I went with a friend and we waited nearly an hour and a half for our sandwiches and fries.  To make matters worse, we saw two tables who came in after us get their orders before us.  The waitress alternated between looking frazzled and non-chalant.  The table next to us got tired of waiting and left.  Nearly an hour into our wait, I had to signal for the waitress to come over, and I asked if there was a problem.  She responded that yes, something happened with one of the cooks.  I asked if we could be compensated for our lengthly wait with a round of drinks on the house or something.  Her literal response with a grimace was, \"I would love to compensate you, but all you really got was the special.\" Huh?  Well, she must have realized how tacky that sounded and came back after we finally got our food. She told us she took one of our meals off, so the bill would be $10.  That was appreciated.  But this experience tainted my impression of Brooklyn Moon. Usually, there is a cute and attentive waiter/bartender with curly hair and a welcoming smile.  Maybe we were there before his shift. But at this point, I'm not sure when or if I will go back.", "author": "Tracy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Just enjoyed another fine evening at this Brooklyn landmark bistro; the menu is varied, although not too many choices for the vegan diner. \nThe decor is classy, the music not overpowering,  and tonight my server was the charming Alexis. 5 stars all the way.", "author": "Nubian P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "I mean, you know what it is. One of the last spots in Fort Greene you can go to and still be surrounded by Black people. Food is good and the drinks well... how can I put this...\"it'll getcha drunk.\" I wouldn't recommend going here if you're starving, but that's not why you go here. You go here because it's cute and it reminds you of what Brooklyn used to look/feel like. The bathroom sitch is awkward but again, it's a small, homey place and yer not going there to pee. It's kind of like what Applebee's tries to be. 'Cept you can actually have a good time there, the food is on a different level, and the servers seem happy to be there. Plus, I live around the corner, so... just go! You can't even taste the alcohol in the very alcoholic drinks and the Mac and Cheese is solid.", "author": "Lanie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-01", "description": "This was my first time....but as you know first impression counts.   The place is small...vibes great....service very slow.  We had a few appetizers and drinks.  The drinks were great ...for the appetizer I enjoyed the calamari ( crisp and a zest of spice).  I am planning to re-visit and try other items on the menu...to see if my first impression will change.", "author": "Judith M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "On a hot, sunny day, Brooklyn Moon really makes you \"sweat\" while you wait for the food and while you eat, because there is no air conditioning in the restaurant. That really is the main reason why I am not giving this restaurant the extra star.  There are little things that I also did not like which was that the service was a bit slow in the beginning and that the menu was a little dirty.  The food did take a bit longer than usual to arrive.  The dishes were also a bit pricey.  However, the food really made you forget about the negatives.\n\nFor starters, we had ordered the honey BBQ and jerk chicken wings as well as the spicy shrimp.   They were all delicious but the best was the jerk chicken.  Be careful, the jerk chicken is pretty spicy.  Don't worry, there is big, glass, clear wine bottle filled with cold water for you to cool down your tongue as well as your sweaty self.\n\nNext, I had the grilled salmon with the apple salad.  The salmon was grilled just the way I always wanted it to be eaten.  Crispy on the outside and cook on the inside.  The apple salad was delicious.  The dressing was light, so it did not overpower the dish.  I really wished I had more of the salad.  Next time, I will order extra apple salad.  I also wished I ordered the spicy fries, but I was trying to be healthy.  However, when one of my colleagues offered her fries, I could not resist them.  They were so crispy and the spice was not too hot.  It was enough that you could at least enjoy the fries.\n\nI would definitely come back to Brooklyn Moon Cafe, but in the winter, where it is not so hot to eat a hot meal.  I also hope they changed their menu with cleaner sheets.  It does worry me that their menu is a little dirty because it makes me wonder the kitchen environment that the food is being cooked in.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "I love this place. The vibes are always amazing and the food is good. It is my go to spot when I am looking for a chill spot with good cocktails.", "author": "Britini W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "This place is great! The dollar Mimosas come in flavors like, pineapple, guava and mango. All brunch items are $13. The outdoor seating is small, but comfortable. Love the greens and the fish, the chicken is good as well, but the portion is a bit too much for one person. Can't really go wrong with Mac \u0026 cheese, and everything is served on a bed of spring mix so it doesn't feel too much like obesity. Great brunch spot for intimate or big groups.", "author": "Kerriann G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-15", "description": "I would give this spot 3.5. I just left there on a decent Friday night weather wise. Me and my date got seated as soon as we walked in. It's extremely small and tight. They have happy hour until 8. The margaritas are four dollars and they have different flavors, mango, pineapple, guava and regular. They also offer six dollar beers from the tap. We ordered fried fish and Mac and cheese. The food was decent nothing to die over. You get three pieces of fish, which is fried. It is seasoned but it's missing a little more season in my opinion. The Mac and cheese is regular. I'm a snob with it comes to that. The Mac here seems like it's made from scratch but it seems like a child made it. It's missing some ingredients. I will go back for brunch since I heard that's pretty good. Overall if your in the area I recommend stopping in.", "author": "T H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Great place for brunch ... The 1$ mimosas are a great deal ... The pineapple and mango mimosa are the best ... I had the chicken n' waffles dish and it was excellent ... The waffles was nice and fluffy ... It was one big waffle but very filling ... The chicken was boneless and it was very good as well ... I definitely want to come back and try their dinner as well ...  Service was a little slow but the place was packed ... I will definitely be back", "author": "Theodora N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "Came here on Sunday for brunch. It was great !!!  I ordered chicken and waffles and absolutely loved it.  The strips were well seasoned and the waffle was amazing.  Tasted my dates macaroni and loved it as well. On top of that they have dollar mimosas !!! Kind of small establishment but very enjoyable.", "author": "Mala H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-31", "description": "Food and drinks are great. \nThey have drinks that taste yummy but are super strong. \nIt's a little to intimate( as in with other guests)  on the busy days but worth it. if you don't like people you don't know in your plate, this might be a negative.\nI actually like the appetizers. \nI normally get the salmon and it's tasty \nThey could stand to increase the waitstaff.  Sometimes it seems as if there is only one true waitress with little untrained minions chasing behind them", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "The food was amazing! I had the jerk chicken, macaroni and cheese with fries! So yummy! \n\nI recommend for a cool atmosphere and great food and drinks!", "author": "Makeda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "This place made me love salmon burgers! The lunch special really helped Verizon emploees out while we were on strike. The waitresses are super cool. Thanks BMC for the introduction to grapefruit beer.", "author": "Brielle W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-23", "description": "Likes:\nThe vibe was nice\nThe seating was...um different but I was okay with that\nThe drinks were really good\nPrices were reasonable\n\nDislikes: \nCame here on A fri night, there were ppl waiting outside. My friend and I didn't know because when we walked in, the waitress just looked and walked away. She didn't inform us there was a wait or how long.\nWe went in and sat ourselves THEN she tells us ppl were waiting. OK fine...but she was RUDE. \nI would not recommend sitting in the back near what looks like benches. My a@@ was very upset about the seating. They're hard and there's nothing to support your back. \nWe ordered the wings...they were very chewy. HATED IT!\n\nOverall, it's an OK place to grab a quick drink with friends but not too many friends because this place is tight!", "author": "Nakia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Great location, Great owner, always great staff \u0026 atmosphere, I have always found the food average, Food is nothing to rant about or crave but I have never been disappointed as I have always gotten what I expected. Not a great Dinner place in my opinion but excellent for Brunch or just to grab a drink any time or day with or without friends. Been going there close to 20 years \u0026 was never ever disappointed in the food or service.", "author": "Andre E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "Favorite place to eat at in Fort Green.. Their jerk wings can be overly spicy though. The Mac is good... The waitress was nice enough to tell us when Happy hour was closing if we wanted to get more drinks in at an affordable price.", "author": "Junior S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-26", "description": "Let Me start off my sayin... I was Highly mislead by the show \"BLOOD , SWEAT \u0026 Heals\"!!!!!\nWatching that show, were there was a scene at yours truly \" Brooklyn Moon\" where the 2 cast members stated that the food was sooo delicious. It made my mouth water. So I go there last friday and order take out.\nMy order was simple.. Jerk chicken , rice and peas and a side of mac n cheese. Unbeknownst  to me , I wasted exactly $19.44. \nI get home and and at total disgust with my food.\nChicken- Burned completely..... Then the burned particles of my chicken is all over my \nRice- which happens to be dry \u0026 flaver-less with burnt ashes from the chicken. \nMac n cheese totally disgusting.....\nWASTE - OF -MY-DAMMM-MONEY!!!!!!!!!!! \nI WOULD HAVE NOT GIVEN ANY STAR BUT I HAD TO GIVE SOMETHING. \nWANNA WASTE YOUR MONEY GO THERE!!!!!\nI ACTUALLY DESERVE MY MoNEY BACK!!!!\n\nSINCERELY,\nVERY PISSED OFF CUSTOMER!!!!!", "author": "SofiYa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-10", "description": "Great food - Kinda small, but its ok. The Drinks are def on point! Go, chill, and have some food.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "The service was impeccable and super friendly. The servers were amazingly accommodating and our bartender Maya was a complete gem. \n\nI ordered the spicy shrimp with yams and it was the best spicy shrimp I have had in a long while because it was actually really spicy, which I LOVE. The yams provided the perfect balance to cool down my taste buds from the heat of the spicy shrimp, and their sweetness was just right. \n\nThey had a grapefruit beer that I tried and liked, and then I just had some vodka sodas to wash down all the goodness. \n\nAn absolute 5 star experience.", "author": "Cyrus P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "Great service and wonderful atmosphere. Decided to try a new place and ended up here. Customer service was amazing. I felt like I was at a 5 star restaurant. Food was also pretty good. This is a nice place to come relax, bring some friends and chat, or just have a casual outing. Overall great place!", "author": "DaJuan H."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}