{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-23", "description": "My friend brought me here because I'm visiting and wanted some great food. We have a table of 5. The service is awesome, but the food...not so much. The mac and cheese does not have any cheese. And the greens...well, they left much to be desired. And then, there was the roach that one of our party had to kill....DISAPPOINTING! And rather than comping ONE drink (that's all we asked for - only one free drink!), the management wanted to penalize the waiter, who was the positive part of the experience! Why penalize the waiter?!?!?! He did nothing wrong!", "author": "Michael J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Staff is friendly and accommodating. Food came out quickly and tasted great! Will definitely come again. I got Chicken and Waffles", "author": "Anita P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Enjoyed  a little late brunch  here. Prices are awesome only $14.95 and $1 extra for mimosa.The guava  flavor mimosa was spectacular, wished  it would  have been cold. Food wise I had fried  fish  and mac \u0026 cheese. It was great just under seasoned. The service  is slow but staff is really nice and accommodating. Just Beware they Automatically Add 18% Gratuity to your Tab.", "author": "Jackie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "Wanted to enjoy the last of the good weather , so gave Brooklyn Moon Cafe a chance. For starters I order the cat eggs , which I was not a fan of. Cat eggs consisted of turkey bacon wrapped in plantain. To much bacon not enough plantain , the plantains were not soft. My table entrees took a while to come , longest wait time I experience in a while. Despite the wait , my table enjoyed our meal. I ordered the fried chicken breast along with a side order of Mac n cheese and rice n peas. Grabbing the attention of my waiter was quit the task. I wouldn't mind revisiting Brooklyn Moon Cafe , however the service is poor, staff needs better time management skills. I requested the check for the table, and it took the waiter over 20 minutes to bring the check. I was expected better !", "author": "Maggie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Very nice location very clean and a great staff. Drinks reasonable and an awesome atmosphere with grown folks.", "author": "Cleveland B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-16", "description": "Sat 44 minutes and no one came to take my order. The hostess came by my table and asked if I knew what I wanted to order, I told her yes and she grabbed the menu and walked off. No one ever returned to take my order so I left. Don't come if your on an empty stomach.", "author": "Sherri D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "I love love love this place. It is small, it is BROWN and it is delicious.\n\nIn a world of Brooklyn gone mad and an over abundance of \" coffee shops and hip bars\" it is nice to be in a place that reminds you of all the culture and flavor the Brooklyn offers.\n\nTo be absolutely frank my appeal to this place was a combinations of all the brown faces seated and the live jazz playing in the background.\n\nThe place is small but the atmosphere is comforting and the service is good. \n\nBecause it is a smaller establishment the wait time for food is LONG but I will say there was no issues once we received our food.\n\nKeep doing your thing Brooklyn Moon !", "author": "Wanda W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Zero stars. Sigh, this place and most of their incompetent employees. The long Saturday afternoon my family visited (believe me, had they not teased us with food \"coming in just a moment\" we wouldn't have been there for two damn hours waiting to eat) the lady servers working were professional, but the cooks, the male waiter and busboy that came to our table had to have been on another freaking planet. \"Good service\" isn't being a chucklehead that jokes about why your appetizers hasn't been coming the last hour and a half, or pretending to give a damn when asking about a watered down drink you took an hour to bring, and then taking a half hour to bring an alcoholic beverage that you don't even have to make. Waste of time, waste of money, and even though I wasn't paying I was still pissed off for my late-lunch-turned-tapas companions. Do yourself a favor and give this place a pass.", "author": "Marquise F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "Updated review... the rum punch is disgusting. It taste like cheap red fruit punch/koolaid. The food is still good. But the drinks today was very very questionable. The waitress let us know they don't take drinks back. So be very careful with your drink choices.", "author": "C C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-09", "description": "Came here over the summer; second time there. The drinks are great but the food... not so much. I spiel this recommend the crab cakes.", "author": "Miranda E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "First time reviewing...but have visited a few times in the past.  Food.....very good.....drinks strong...pricing decent.   It's a place where anytime that you come , it remains consistent.   You won't have a bad time........if the service gets a little rough...  keep it mind. Small place. Usually very busy....but better than most and always consistent!!!!      IF YOU ARE CONSIDERING A SALAD.  SAVE YOUR MONEY.  A BED OF LETTUCE WITH CROUTONS AND BROKEN PIECES OF FISH IS NOT A SALAD", "author": "Derrick J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "I was surprised to stop here on Saturday at 3:45and they were still serving brunch. I was surprised. I was going to leave because originally I didn't want brunch food, but I'm glad I stayed. The food was great. I ordered the fish and grits and my family ordered the chicken and fries. Which was ahhhmaaaahzing! $1 Mimosa was just right. Will def be back again soon to this brooklyn gem. Service was great. Waitress was kind and attentive.", "author": "S C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "Came with my friend for Sunday brunch. Ordered the whiting, cheese grits, salad and a side of fries. Everything was flavorful. 1 dollar flavored mimosas, cant beat that. There was a dj that played R\u0026B. The bartender name was Mike. He was attentive, funny overall great customer service. I also tried one of the cocktails called sea water. Soooo good, rum based drink. Second time at  Brooklyn Moon. Love the vibe, I will be a returning customer.", "author": "Dessi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "Food is amazing here I had the curry mussels, Mac \u0026 cheese and candy yams; the drink of choice was the sea water .. Food was nice and hot food is pr.. it will sneak up on you .Sayief was our waiter very good customer service very attentive..small and intimate quaint setting.. can be a Little loud at time from the bar but keep in mind it's small . Came here on a Monday night .. cons: no ac just fans pros: but I forgot how hot it was because of the good food and customer service.", "author": "Saajidah R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-11", "description": "My rating is based on the accumulation​ of times I've eaten here (maybe about​ 4 or 5 times). My first experience here was really good. The mimosas were amazing and cheap, and the bartender was really nice and sociable. It was amazing seeing all the pretty girls with nnatural hair as the staff too. However, it​ seems like each following time I've​ come here the service just went down a little. This past time of coming here on Columbus Day weekend​​d, the service was just awful. We didnt have to wait for a seat which was amazing since we were there during peak brunch time, but our food took almost an hour to get to us and they forgot a couple items we had ordered AND our server got an attitude when we asked about the missing items as if we were bothering her for asking for the food WE ORDERED. And it wasn't​ just us but the lady next to us who was there by herself was waiting for crazy long too. I'd be a little more understanding if the place was super packed and​ we ordered a lot of​ food​ but I​ just simply don't​ understand how it could have taken so long. Also, they didn't​ have their regular menu out (which sucked) but rather a printed brunch menu that I'm assuming they only use during certain times of the day. My issue with this, other than it making our options ridiculously limiting,  is if there were so few items to choose from and everyone would have to get damn near the same thing, why would the food take that long?", "author": "Jazmyne D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "I kind of love this spot. The vibe and the atmosphere is always dope.  The drinks are super strong and the food is delicious.\n\nI've been continuously working my way through the menu.  The curry mussels are a must-have. First of all, they're huge!  I really wonder where they are finding mussels of that size from.  They come in a simple appetizer plate on a bed of greens which soak up the seasoning nicely or as a dish with an additional 4 (i think) and your choice of side. I'm partial to the macaroni and cheese.  The jerk chicken is very tasty but you can get equally as tasty jerk dinners from your local Brooklyn carry out for less.  It's good but it's not necessary to the average Brooklynite who may already have their preferred jerk spot in their respective neighborhood.  The crab cakes a delicious but they only come in 3s and you may not want to share.  The spicy shrimp is a standout appetizer that you actually can share.  It's perfect!  I tried the whiting off of my friend's plate.  It was cool to me but I don't really eat too many fish dishes so I don't have much of an opinion. She loved it though *shrugs*.\n\nNow to the drinks...they're the added selling point that would bring me  in here multiple times in the same week.  They're not the cheapest outside of Happy Hour which I always seem to miss (they've got great deals everyday) but they also aren't absurdly priced.  On top of that they're all very strong so it's worth it. I recommend the Seawater.  The Mango is also a nice.  \n\nI notice a number of reviews criticizing the service but I have yet to have had an issue.", "author": "Keilon L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-18", "description": "Very tiny inside, disorganized waiting system and terrible service! My friend from grad school recommended coming here for Sunday brunch last week after she had been to the restaurant about a year ago and we were both terribly disappointed. First off, there's no waiting area and the bartender with the dreads and the undercut is the rudest human being on the planet. Interacting with him and the confused hostess made me and my party reasonably decide to take our business elsewhere. It's sad to write a bad review for this place because I believe this place is black owned but there are wayyy better places to go in Brooklyn. I guess this place started off great and then went completely downhill. Don't even consider going!", "author": "Darlene M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-21", "description": "The food is great but the customer service leaves a lot to be desired. We had a waitress with short dreadlocks and a little eyeshadow. She was very inattentive and more concerned about her phone. No smile, no hello and certainly no thank you. I had to ask for everything, including a water refill. She should be replaced.", "author": "Tracy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-08", "description": "Would Give Zero if possible. \n\nStaff was rude; POS system crashed delaying our exit out. Not to mention the owner was very dismissive. \n\nThe hostess was lethargic; seemed a bit \"loopy\" , couldn't handle simple questions or tasks. Someone from my party had to send food back because there was an inedible item in it. \n\nDon't waste your time. 67 burger is right around the corner, Pink Tea Cup up the block. You'll have a MUCH better experience. \n\nTo add to it, I've recommended this place to my friends and each single one whose gone has had an issue. One bad night is maybe a coincidence. But several? Doesn't seem to be the customer.", "author": "d'onna w."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "The service was extremely horrible I waited 30 minutes from one drink from the bar and then a whole Another 40 minutes for my food i used my flashlight to check my food and while I was in the process of checking I noticed there was a smash flies all over the wall don't bother with this place", "author": "Soraya F."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}