{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-12", "description": "We when here the other day to meet some friends that swear by this place. I was skeptical about going once I read all these negative reviews and by the end of the meal I had wished I had suggested a different place. The place is crowded and small and could be cute if the got tables and chairs that fit in the restaurant, also I found the place to be loud with the music and other tables talking and found it had to hear the people at my table. We ordered a round of waters, which took about 15 mins to come, then I asked for their famous apple salad asap which came at a good speed and then the rest of the meal when down hill from there. Then it took one hour for our food to come out, and then when it did it was not even hot. I ordered the lobster pancake and there was about one crawfish tails worth of lobster in the cold mashed up potato pancake, the fish on top of the pancake was blackened and lacking favor. The roasted veggies on the side were either burnt or had too much tasteless blackened spice on it. Then we had to ask for the check twice, our friends picked up the bill but I think the price of the salad was over $10 and the lobster pancake around $17. By the end of the meal our friends were questioning about coming back to this place again. I will not go here again.", "author": "Aimee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-21", "description": "We stumbled upon this place on valentine's day. And I was so HAPPY we decided to try it out. The food was greattt. I had the fried chicken, mac \u0026 cheese and spicy french fries and it was all DELICIOUS. The chicken was hot like it just came of of the fryer. My friends had the salmon and bbq chicken and also enjoyed their meal. Though service was a bit slow, what can you expect from a hole in the wall, small restaurant. The waitresses were very friendly.", "author": "Stacey D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "This place has some solid and reasonably priced food. I had the spicy shrimp with apple salad and candied yams, which could easily pass for dessert. It wasn't exceptional, but good enough for me to maybe go back. There was lots of interesting contemporary art on the walls, and a really nice laid back vibe. My only gripe would be the drinks. I was in the mood for something sweet and fruity, but my drink honestly tasted like Hi-C. Way too syrupy. Otherwise, a nice taste of home for a southerner in Brooklyn.", "author": "Rainbow M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-09", "description": "Brooklyn Moon has been a restaurant staple on my roster for years now.  They recently did some reservations and althtough I don't understand the new decor for the life of me, it definitely looks a lot better.  Service has greatly improved over the years and the wait staff is always friendly and attentive, although due to being short-staffed at times, you may have to wait.  Now comes the best part - the food!  The food is tasty, portion size is generous and the prices are reasonable - what more can you ask for? Drinks are great and the ambiance is low-key.  Definitely worth a try as they have not disappointed me yet!", "author": "Natasha B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-12", "description": "I love it here. Nice place to hang with friends. Good food, nice atmosphere, nice music, and great drinks.", "author": "Raoul B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-16", "description": "Brooklyn or rather Fort Greene's best kept secret. With so many new style cuisine making its way into the area, I am proud to see Brooklyn Moon Cafe is still around. If this place ever lost its lease or was forced to move it would truly be a testament to the unfortunate gentrification of the neighborhood. Yes, service is not as one expects but it is very Brooklyn: Real people who care. \n\nI had my birthday there one year and it was amazing. Try it sometime! The brooklyn moon punch had everyone swooning for days.\n\nLove you Brooklyn Moon!", "author": "Honey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-16", "description": "First off the food is great menu is cheap and you cant beat the 2-1 happy hour drinks..Now for the bad news as otherwise stated,dont i repeat dont go thier extra hungry as you will be waiting awhile to get your food..But in the end its a perfect place to eat in Brooklyn....", "author": "Maurice W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-14", "description": "My favorite place to come if I can get there before 6PM Tues-Fri. That's because that is when they offer their $5 Anti-Bush menu. With a sandwich or main course and a side, it is some delicious home-cooking at a great price.\n\nThe service, as others have noted, is pretty bad. It is usually pretty empty in there when I go, but I still have to wait for a long time for water and the food. I am usually there with a good book though, so I don't mind the wait.", "author": "Just M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-16", "description": "I live down the block from BK moon, I'm not a reqular but have been there a few times. Love the ambiance of the place. I just went there last Sat for a pre mother's day dinner knowing every where would be packed on Sun. My BF and I sat near the door due to it was pretty crowded and it was a beautiful night so seating was fine. We order drinks, then our entree's. Drinks came right away and are resonably priced compared to some spots. We look around and notice everyone just has drinks on their table and no one is actually eating. After about 30mins or so we ask what is going on due to know one has any food on their table as if everyone ordered at the same time. The waitress apologizes and says they are a little backed up by the way she was really nice and gracious. The couple that came in right after us finished their drinks and got pissed and left due to the too long wait on the food. After almost an hour's wait our food finally arrives and I must say it was worth it. I had the crabby patty which was a nice sized crab cake on top of mash potatoes and it also came with the apple salad on the plate. My dish was delicious!! My BF had the talapia with plantains, his was also good but he preffered my dish after tasting and attempted to eat all of mines lol. If you are starving then this is not the place for you, but if you can hold out for the wait and have the drinks with some great convo it is well worth it.", "author": "Felicia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-26", "description": "Brooklyn Moon Cafe just bow out gracefully - this place is not for adults! the service is awful, the food is questionable (which took 45 minutes) and this place need a good scrubbing...I thought  i give them another try after the being closed for 104 violations. Well i tried! My Sunday night dinner was embarrassing to say the least. I had to apologize to my family and guest. Get it together or get off the stage.", "author": "andre m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-23", "description": "i been going to brooklyn moon cafe from the first day it opened its doors. i love this place. the food is always great. when i have friends in town they are like take me to brooklyn moon. and the owner is so nice he is a great guy. when he is there he always comes over to say hi. the staff is great to . but its the food i love the most . you really get a deal for your money . this is my place . everyone must try brooklyn moon cafe", "author": "Tanya H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-04", "description": "I started going here a couple of years ago. Generally the food was ok but the service was getting worse each time. I took a break and went back after almost a year of a hiatus! My experience in the past should have prepared me for the HORRIBLE service I received there this past Saturday nite.\n Got there and the restaurant was only about 25% occupied, initially a friendly waitress came over right away and took our orders. Then we had to wait 15 minutes for our drink orders to come (my first indication that I should have gotten the hell up outta there) mind you the 25% occupancy that were there already had their food and only needed their checks. So can someone tell me what the hell took them so long? Generally their drinks are spot on, Sat nite it wasn't all that. At this point the restaurant started to get full but I figured we're good cause we have already put in our orders. \nA half an hour later the other waitress (with a nasty attitude and a chip on her shoulder) came and told us some of the items that we ordered were no longer available. Silly us should have left at the this point if not for her attitude perhaps for the delay in relaying this information to us...but we figured the wait couldn't be too much longer and we was hongry! Boy were we wrong!\nThe straw that broke the camel's back was when we saw that people who came on average 10-20 minutes after us were gettin their orders (mind you the same things that we ordered). At this point hungry are not we decided to leave. Will someone explain to me the sense in the waitress-with-the-attitude bringing us a bill with all the items that we had ordered even through after an hour all we had were our drinks! She came over and said it shouldn't be too much longer! Are you freaking kidding me not only are you asking me 2 wait longer, the bill you brought me was wrong..Who hired this chick? What irked me is after we told her how unhappy we were with the service, in the most insincere voice she says that I hope y'all will come back. Why would we?\nThis place has soooo much potential, the location, the prices, the type of food and an adorable kid waiter who is super attentive. But please screen the waitress and let them know that they are in the customer service business and get food to your patrons in a timely fashion! I told all my friends who would go their occasionally and they too vowed not to go back due to similar experiences.", "author": "Candice B."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}