{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-13", "description": "Pensive art adorns the walls of this cozy spot and a steady stream of upbeat urban sound permeates the room. The flavors of collard greens, spiced mac, plaintain and a glass of chilled pineapple juice thrilled me. Cornbread was the only thing that was missing. Hopefully, it will be added some time soon.", "author": "A A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "The food here is delicious; portions are generous and the prices are quite reasonable. My favorite sides are the mac \u0026 cheese and the fries, and I always have a hard time choosing between the shrimp and the salmon because I love them both. The service is also great, Amir the host is always friendly and helpful.\n\nThe reason I'm taking a star off is because I went last night and the waitress with the bright red hair had an attitude (I never caught her name).  She belittled Amir in front of customers for something that was not his fault. When I came in, I told him that there would be three of us but that the other two were parking the car. He sat me at a table, gave me a menu, and said he would bring two more as soon as the other girls arrived. Not even 30 seconds after they walked in and sat down, the redhead took it upon herself to loudly admonish Amir for not bringing menus over. He tried to explain to her that he was about to, and she cut him off and continued to talk to him like he was a child. Totally not cool to do in front of customers, especially when we as customers weren't upset about it. I really hope that the manager speakers to her about this because it was quite uncomfortable to witness. She also didn't smile nor did she check on our table regularly.\n\nI'm a frequent diner at Brooklyn Moon, but moving forward I will not allow this woman to wait on me. I'll either request another waitress or dine elsewhere.", "author": "Mari G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "Absolutely an oasis for Black and other people of color in the desert of gentrification on Fulton Street. I love this place and have been a loyal customer since 2004.  The food is amazing, the prices are reasonable, the drinks are great. it is my comfort spot and on occasion you will see a celebrity or two.", "author": "Imani H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-22", "description": "Came here for happy hour earlier today.  Took us about 15 minutes to track down a waitress to place our order.  Average fries, plantains in turkey bacon and better jerk wings came 15 minutes later - but no drinks.  Including a draft beer that should have taken 2 minutes.  20 minutes later we finally got some watered down excuses for a margarita \u0026 a martini.  The worst part was that we watched two other tables that arrived after us get their drinks first.  No apologies from the waitress who clearly forgot to put our order in.   We just left and headed to Deniz across the street for round 2.  Much better drinks, worth full price after that debacle.  I will never go back.  Two stars only because of the jerk wings.", "author": "Laju D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "I really like the Brooklyn Moon Cafe.  A good friend who lives in the borough first made me aware of the restaurant.  I've gone back several times since.\n\nI like the feel of the place.  There is a wallpaper image of Julius Erving and Phil Jackson from their playing days, which is totally retro 1970s!  Another images is of young people on the subway from the late 1970s or early to mid-1980s.\n\nThe food is very good and the service is generally excellent.  I like the portions of food and the fact that it generally comes relatively quick.  I've order catfish and it's been very tasty whether broiled or fried.  The side dishes, which include macaroni \u0026 cheese, grits, and collard greens, come in nice portions.  It's enough to fill you up but not leave you stuffed.\n\nThe waiters are generally knowledgeable of the menu and the surrounding environs; I live in the Bronx, so having a waiter who can tell me where the subways are is very helpful.  They also know some of the local landmarks, like BAM.\n\nThe drinks are good as well.  The bar is always well-stocked with a variety of hard liquor, beer, and champagne.\n\nBrooklyn Moon seems to be a nice gathering for intellectual and entrepreneurial types.  The clientele is largely African American and African Caribbean, but really anybody would feel comfortable in the restaurant.  It's got a little bit of Greenwich Village and Harlem to go with its Ft. Greene surroundings.\n\nBrooklyn Moon is also a place where you can bring children or elders.  While most of the crowd tends to be in the late 20s to late 30s, a family with elementary school aged children or a couple in their 60s or 70s would not feel out of place.  Heck, I suspect that a couple in their 60s would know who took the Julius Erving and Phil Jackson photo!\n\nIf you're in downtown Brooklyn, check out Brooklyn Moon.  It's a slight walk from the Barclay Center, but probably worth it.", "author": "Ken S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "I went to Brooklyn Moon for the first time for my birthday at 7pm, December 8, 2011 and I had an amazing time. The ambiance was quirky-cool, reminded me of a restaurant I went to in Aruba - very low-key, low lighting, intimate, simple and cool.\n\nWe didn't have reservations, our table started with my best friend and I. We had appetizers, but I can't remember what they were (lol). I do remember I had the Big Fish, which was soooo good - fresh, flavorful and hot (I like my food damn-near scalding and this was good). My best friend had the fried chicken and she liked it too, I'm touch and go with fried chicken, but I still found it to be tasty. She ordered the infamous Saltwater drink and I WISH I did too, it was soooo good - even had swedish fish at the bottom! Later on my boyfriend and 3 other friends arrived and the waitress was really accommodating to our ever-expanding table. Everyone loved their dishes.\n\nWhat made my evening EXCEPTIONAL at Brooklyn Moon, was after my friends told the owner it was my birthday, they talked him into making me a desert - they DO NOT have a desert menu at Brooklyn Moon. The owner went out and BOUGHT the ingredients for the yummiest Bananas Foster I've ever had - I mean, how sweet and thoughtful was that, just above and beyond!!! He, the waitress and a few other folks came out and sang happy birthday to me, which brought tears to my eyes. Granted, I have a crazy group of friends that could talk someone into just about anything, but I couldn't believe they were able to pull this off with the owner, which means, he's just a frigging GREAT guy.\n\nI would go back, the end, period.", "author": "theresa l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "Good god. Perfection from start to finish - food was phenomenal, service was superior and the ambience was on point. Hiiiigggghhhlllly recommended!", "author": "R. B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "I've been coming here since 2004.  I love this place.  The service is iffy but generally ok.  The owner Mike is very nice and is almost always there.  You can tell by his signature green wagon parked on Fulton.\n\nThe decor could be a little nicer but its in BK and its cheap, so what do you want?", "author": "Darius B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-26", "description": "I went there to have my birthday bunch on 5/22/16, I made the brunch for 4pm. When we got there at 3:45pm the hostess said there was a table before us who will be having he last orders for brunch. Brunch is supposed to be over at 4:30pm however come to find out a half an hour later that one of the ovens were broken. We decided to stay until they served dinner, the manager didn't speak to us but kept communicating through the hostess which I though was unprofessional. They told us that the kitchen will be closed at 4-5pm, and then they said it will be open at 5:30pm and that all we can do is drink or come back later. We stayed since everyone came from different areas of NYC. When they took our drink order there weren't any guava lemonades, just seemed like everything was going wrong in there that day and everyone had an attitude when they should have been even more sincere and hospitable being that the oven was broken. Then when the waiter's shift was over he asked if we can pay the bill because he is leaving. Service over all was terrible the food was good however but not worth all of the commotion.", "author": "Michele G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-19", "description": "Buyer Beware! \n\nCame here with a friend on a Saturday for brunch and was immediately taken back by  the fact that absolutely no one was seated in the restaurant. Meanwhile, the restaurant to the left and to the right were overflowing with people.  My friend and I decided to stay and give the restaurant a try since it was recommended by a friend. We were (for the second time now) very surprised by the one page brunch menu which left ALOT to be desired. I ordered the whiting with waffle and a side of mac and cheese. My friend ordered the french toast entree with a side of cheese grits.  The food was HORRIBLE. The mac and cheese was definitely box macaroni and cheese-not even homemade and the grits.....we are still trying to figure out what the heck was that. The food had no taste and just seemed like a very sloppy put together meal. We were completely unfulfilled.  As a matter of fact, when I went home after just eating brunch, I ate again. If you are looking for outstanding food-don't bother with this place.  Oh, and they have the nerve to put an automatic gratuity on each bill (regardless of the number of guests in your party-in our case it was only 2 of us) of 18%. I don't mind paying any amount of gratuity, but the food better be damn good!  I wouldn't even rate this place one star.", "author": "Annie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-22", "description": "Unless they recently got new management, this is the worst customer service I have experienced in ages.  Mean, eye-rolling, unfocused, sucking teeth, forgetful and the wait is epic.  But the food is incredible!", "author": "Dee L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-11", "description": "I actually really love this place. Especially the anti Bush menu. $5 meal in that neighborhood is unheard of. The food is hella good to. \n\nBUT.\n\nTHE SERVICE IS AWFUL! It's really quite unacceptable that they think it's okay to treat people that way. You definitely CANNOT come to BK Moon if you're hungry. Forget about it. You will wait for at lest 45 min. before you food comes out. The waitstaff is rude and inattentive. They do the bare minimum.... if that. And yeah the food is good but by the time it gets to your table, you're sooo damn hungry, you scarf down the food without even tasting it. \n\nI love you BK Moon, but you have to fix this! I'm boycotting. My dollars ain't much but they still mine!", "author": "Marly P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-01", "description": "Love Brooklyn Moon!  The food is fusion between carribean \u0026 southern.  The service is slow but worth the wait.", "author": "lareina j."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-02", "description": "The Moon is an icon in Brooklyn.  It has been around since before Erikah Badu was doing open mikes.  Was one of the first places Jesicca Care Moore performed...I could go on.    I am a tiny bit annoyed by the harsh reviews.  This is a great place that I have loved for years...that  practically spawned the restaurant scene in Brooklyn.  O did I mention that it is actually run by Brooklynites...I know...INSANE!!!\nThe restaurant industry is tough\u0026they work really hard.", "author": "Dina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-27", "description": "The food is good, but the service sucks.  It's not that the waitress is unpleasant---it's just that she's decidedly neglectful.  Why is it that whenever I'm in there only one person is manning the bar and  tables?  I don't get it.  Either way, the $5 Anti-Bush menu is difficult to pass up. \n\nNice dimly lit atmosphere, a good lunch date place for sure, but I'd be remiss if I didn't mention the following...\n\nThe last time I was there, as I'm waiting on my food, I focus my eyes on the bar, and a HUGE waterbug is scaling the wall behind the Cuervo.  (I feel a bit guilty, like I'm not being completely fair by revealing this, but I'd want somebody to tell me if they saw a palm sized cockroach creeping around at one of their regular restaurants!!)  It freaked me out, because then I started to think what lies behind the kitchen curtains? What goes on back there?  \n\nWhen the food arrived, I ate it like the disgusting human being I am, but I haven't been back since.  What you don't know might not hurt you.  :(", "author": "Koku K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-10", "description": "Another nice little BOHO den,  with vintage lamps and neo soul bubbling on the system..  afros, dreads, beads and braids kinda client flow... and those who love em... \n\nThe Brooklyn Moon has a history too dating back to the mid to late 90's when it was on the map for being a poetry den for rising stars like Jessica Care Moore...\n\nSip the signiture Brooklyn Moon drink... and soak into some of the poetry/neo soul history of Forte Green..\n\nfinish your drink and go for the dinner special called the anti Bush menu..  5 bucks..  one entree..  one side..  can't do wrong before 7 p.m.\n\nsnag a booth by the door.. settle down.  you won't be stressed about when to pay up the bill.   nice for after work.. or  later evening pass through.\n\nI say.  go for the jerk chicken wings..  they are spicey.. and taste very much like real jerk chicken from Yard!...", "author": "greg j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-05", "description": "The food can certainly be good here. I particularly love the whiting, plantains, and mac and cheese. They also have a lemonade drink (strawberry, I think) that I've gotten every time I went. The wait can sometimes be a bit long depending on the day.  Unfortunately, I haven't been back for a while. The last time I went, there was an insect floating in my drink, which completely turned me off. The restaurant now appears to be closed for renovation.  Hopefully, if they reopen, that'll no longer be a problem.", "author": "Ana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "I've been to Brooklyn Moon about 4 times since 2008, and I am a huge fan. The portion sizes are great, so you leave fulfilled, but not struggling to walk and breathe. The first time I went, I got the Salmon Caesar Salad. Sounds simple, but it is anything but that. It features a very well seasoned grilled salmon filet, with avocado, grilled tomatoes, croutons, and some wonderful slices of garlic plantain, and a great parmesan dressing. It's filling and delicious. The Guava Lemonade is great (a bit sweet) and the Fruit Punch is very tropical-tasting and refreshing. Other great items on their menu: the fried calamari appetizer, collard greens (meatless, no vinegar), the rice and peas, and the candied yams. The candied yams taste of cloves, cinnamon, and they're not too sweet. The Big Fish is wonderfully prepared. It's stuffed with mashed potatoes and garlicky spinach. As for dishes that weren't that great: The mac n cheese is average, the crab cakes were...strange, and the fried whiting was kind of bland.\n\nAs for their cocktails, I've only had the seawater, which is electric blue, and has Swedish fish floating at the  bottom. It has several types of rum and pineapple juice in it. The only suggestion I have for this place is that they need some sort of complimentary dish (maybe plantain chips), bc the food takes a while to come out.", "author": "Sonjay M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-20", "description": "I will be back again! This place bubbles on the weekend. The food is so good and the drinks strong. Soul food at it's best is here. Bring a date or friends!!! You will enjoy Brooklyn Moon!!", "author": "Feygens S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-16", "description": "If u come for the regular restaurant hours, make sure you come with someone the ppl know. I always find them Unorganized and slow. I enjoy the jerk chicken wings, and mixed drinks... But I'm so frustrated by the time them come I often growl. But they're a piece of BK history", "author": "Oakland L."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}