{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-21", "description": "This restaurant shouldn't even get a star. First off, my friend and I went to this establishment for some drinks. My friend did not like her guava cosmo so she asked if she can get another drink because it did not taste good. The server said he can not switch out the drinks. So we then ask for the manager. He was extremely rude and possibly intoxicated. Had an attitude and cut us off. I will never ever come back to this establishment again . It's not worth coming back again.", "author": "Nae N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "This would have been a 5 star Review but the first time I came here I ordered the Blackened Tilapia and it was phenomenal but... I had to wait an hour and a half for it to come because the waitress/ bartender forgot  tell me that they were out of fish at the moment and waiting for more. \n\nThankfully my friends were really patient and  person in charge gave us complimentary drinks while we were dining. The customer service here is great and the food is so yummy. I just wish hey would do something about those teeny tiny round tables and get some proper air conditioning for the hot Brooklyn Summers but I'm happy to have another Soul food alternative now that Night at the Cookers seems to be closed.\n\nI'm a regular here because I love me some soul food. If you are looking for some excellent southern faire and an intimate atmosphere this is a great option", "author": "Abisola S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "The food, drinks, service \u0026 ambiance were great. Loved the D.J. I can't say anything bad about this place. Had the fried talapia with baked macaroni \u0026 collard greens... Really wanted to go in the kitchen \u0026 open mouth kiss the chef. See you guys again....", "author": "Tricia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-27", "description": "Okay lets start by saying I really wanted to give 4.5 stars but I cant. Anyways, Brooklyn Moon is really a little gem here in Brooklyn. My very first visit here was 3 weeks ago and i've literally been here every weekend since. My first visit I was brought by a friend for brunch. The brunch menu is really small but there is a lot of variety which is great. I decided to play it safe and get the Chicken \u0026 Waffle and a pineapple mimosa. The fact that the mimosas are $1 and they have multiple flavors truly makes them a 5 star restaurant in my book. The Chicken \u0026 Waffle meal was also amazing. \nThe next visit, I got the Honey BBQ wings, mac \u0026 cheese and greens. The Honey BBQ wings were AMAZING! They were cooked to perfection and the sauce was delicious. The greens and mac \u0026 cheese....not so much. I had to put hot sauce on my greens and there was really nothing I could do to make my mac \u0026 cheese taste better. I'm not a stickler on mac \u0026 cheese (I'll eat anybody's) but this one wasn't the best in my book (reason for .5 star).\nI went today and found out that brunch is only Saturday \u0026 Sunday but they have an amazing $10 lunch menu. Theres about 5 different sandwiches you can get (salmon burger, turkey burger, chicken sandwich to name a few) and you can choose salad, fries or rice \u0026 peas as your side. You also get to pick your choice of a drink (margarita, cosmo, etc) to compliment your meal. The Chicken Sandwich was great and my mango margarita was too.\n\nAll of the staff is friendly, the place is never crowded and the music is relaxing. It has a really homey feel to it and I'm going tomorrow for brunch =)", "author": "Bria T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-09", "description": "Great food loved the salmon and the drinks are pretty strong, nice low key atmosphere", "author": "Brittany B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-07", "description": "The food was amazing. I had the bbq wings and the sweet potatoes. It was great. My Girlfriend had the fried catfish. Can't say enough good things about this place. Good food and a really nice ambiance with good prices. I would defintly recommend this place.", "author": "Jon B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-17", "description": "I am too thru wit Brooklyn Moon Cafe. This used to be my go to place afterwork during happy hour for food and drinks. Now this is one of the last places i will visit. Don't get me wrong the food is decent, just not the items I had. And I'm writing this while Im still in the restaurant so you know Im not a happy customer. Anyway when i arrived it was still happy hour so we ordered $4 margaritas- they were weak (strike one) We ordered appetizers as well. They didn't have anymore calamari (strike two) so i substituted it for bbq wings with mac and cheese. The food arrived fairly fast I must say.  Now the wings were awesome! I ate them so fast I had sauce all over my fingers and face. But that mac and cheese (strike three!) That mac and cheese ( i added a pic) was so awful i wouldn't even serve it to a prisoner in solitary confinement. It tasted like box mac and cheese with no cheese. I seriously couldn't find any and I even took several bites searching for it smh. They even had the nerve to sprinkle a ton of paprika on it. Omg salty, and just bland ughhh. And I'm not a fan of this jazz music they have playing in the back of the \"cafe\" Im sorry BK Moon u have failed me, i wont be returning for a long time. Oh yea the owner Mike did not want to hear our concern he continued to talk to  a lady friend and brushed us off. Hmph! How Rude!!", "author": "Ronnie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "i absolutely LOVE Brooklyn Moon. i come here at least once a year. if i lived in Brooklyn or lived closer, i'd be here like once a week. it's a verrrry small restaurant with about 5 tables against the wall, a bar against the other wall and 2 of the small bar stool tables in the middle. they've changed up their look a few times in the past 4 years that I've been there and it keeps getting better. a big plus is that the bathroom is suuuper clean. now on to the food...\n\ni'm west indian so they'res nothing like authentic Caribbean home cooking. i am very picky about what Caribbean restaurants to go to so saying that i love Brooklyn Moon says a lot. the prices are beyond affordable. i went there last night for dinner with a friend and our bill total was $40. Food is cheap but alcoholic drinks are your average NYC prices. i absolutely LOVE their curry potatoes, fried plantains, crab cakes, mac n cheese and jerk chicken. keep in mind that they don't have a large menu. \n\nthe customer service has gotten a lot better over the years (it was never bad to begin with). the location is great because it's a couple blocks away from the atlantic ave station/barclays center. as long as this place stays in business, i'll always be a loyal customer.", "author": "Tiffany B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "Bustling, friendly, love the apple salad side. Nice servers.", "author": "Ina T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "OMG! Great food and $1 mimosas!!!!!!! I was invited for brunch with my girls and i was so blown away I went the next weekend with my boyfriend and he was also very pleased. One of my new favorite spots", "author": "ZaZa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Stoped by here for din din with friends yesterday evening. Loved it. First of all, the waitresses are just amazingly beautiful and very attentive. This is a grown man's spot right here lol good vibe, good music, and tasty food. Ordered the curry muscles for starters because our waitress recommended it (thank you by the way) , did not regret that at all.  After I was done scarfing that down, it was time for my order of grilled salmon, mixed veg, with mac and cheese. My Goodness, I never thought mixed vegetables would have such an effect on me. They were perfectly seasoned and cooked. I loved my meal, I left feeling like I got my money's worth. Very affordable, We definitely weren't expecting that. Another place you should venture into.", "author": "Joseph V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "I went to this establishment yesterday to catch up with my friends. The staff was friendly. The food we ordered came fairly quick. It was also very delicious. Mimosa's are $1 each. What can I say we had a great time. I would def go back :)", "author": "Patti E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Did someone say $1 mimosas!?!? It is no less than a small miracle that I waited a whole three hours to visit after hearing this news!  Honestly, even after checking a couple of sources, I was convinced that I was being duped.  But alas, I went, and there they were in all their one dollar glory!  And not just plain ol' OJ mimosas.  Mango, pineapple, guava, grapefruit, and cranberry.  Pick your pleasure.  Or pick them all because, hey, they're a buck each.\n\nHaving been sufficiently wowed by the drinks, I geared myself up to be disappointed by the food.  It was half empty at peak brunch time.  It couldn't possibly have good drinks and good food and not be packed wall-to-wall, right?  Wrong! I ordered the jerk chicken wings and collard greens.  Those wings were on point!  Enough spice to shake you up a little, let you know who's boss.  Delicious.  The greens were pretty good too.  The flavor was a little more peppery than what I'm used to, but I'm a fan.  One of my friends had the fish and cheese grits.  I'm a little biased against both since I'm not a big seafood person, and who the heck puts cheese on grits?!  But I tried both for posterity.  The fish was actually pretty good.  Give me some hot sauce and I could eat a whole plate.  I'm still gonna pass on the cheese grits. Grits should be served with butter and sugar. Yeah, I said it.  My other friend got the chicken and waffles.  Yes. Please. When I return-- and that will be very, very soon-- that's precisely what I'll be ordering.  Several well-spiced chicken tenders (but not the breading of traditional fried chicken) and a fluffy waffle.  Yum.  It was all I could do not to keep digging on his plate. \n\nOur waiter was charming and funny.  Everyone else was attentive as well.  An overall great experience.  I'm happy I found this gem.", "author": "Candis D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-30", "description": "We decided to try the spot because we read many good reviews about their food. OMG What a huge mistake and never again will I have dinner there. \nLet's start , the spot is very small which is not the issue , the issue is for some crazy reason they have a live band who plays extremely loud you can't even speak to waitress you have to sign and let her read your lips . The music is not bad it's just that they play percussion very loudly and the spot is very small. \nWe came in and got a table right away, we had to wait 25 min for water and a menu. When the waitress finally came to take our order she did apologize, she asked us what we wanted to drink and told us she will be back with the drinks. \nShe came back 15 minutes later without our drinks to take the food order. \nThe food came 30 minutes later, my friends have the tilapia and fries (3 nice size piece however not season well and deep in breading overcooked) and I have the spicy shrimp and mac and cheese (for a southern restaurant, I don't know who is cooking but definitely does not know how to make mac and cheese (no cheese was found lol) and the food was so oily gross. \nAnyway that's not the best part; she brings us out drink when we were almost done eating. The drinks were completely water down and we had to return them- Don't ask for a water refill at that restaurant...... \nTo be honest the place has potential but the lack of service amazes me, I won't blame the staff but the owner/manager of that spot. \nThe waitress was playing waitress, bartender and was cleaning the table, the busboy started the night by clearing table and by the time we left he was cleaning table, taking order, bringing out food and drink. And the bartender was well over his head seems so lost. \nOh and to end the night she took another 15 min to bring the check and gave it to us with an attitude = but I guess she was just overwhelm \nSo we spend 2 hours there, with one glass of water each, a headache from the music oily food and terrible service.", "author": "Myrisse D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "Tiny little restaurant with a great atmosphere and a friendly staff who is down to earth. My date and I stopped by this place for dinner and drinks before a show and were pleasantly surprised with how fun of an experience this was!", "author": "Cam L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "I've had better experiences at restaurants. I would have given two stars, but I'm adding an extra star for the decor and the service (both were good).  \n\nThe food tho? Not bad but not really good. I had the grilled salmon, which was as good as salmon can be without much seasoning, but needed some hot sauce to be OK. As for the roasted veggies - my fiance wondered out loud whether they were actually vegetables! LOL. They were indeed vegetables but we could not tell just by looking at them; they appeared to be a grouping of pieces of brown. If I can't tell the difference between the assortment of vegetables unless they're in my mouth, that's a problem - they were extremely over-seasoned! My fiance had the jerk chicken. He expected more for $13.95. I tried a little piece, and it had good jerk flavor but too much salt. \n\nThey got the plantains right. Those were good, but I'm not gonna go to any restaurant for the fried plantains (in my world, a basic run of the mill kind of dish).\n\nAdditionally, we were seated at a small round table in the middle of the restaurant which seemed fine for just us two, but the table was too small for our plates! We had to move the salt and pepper shakers out of the way for room enough for half the plates. I had to move away from the table just so the plate wouldn't be in my lap. To the management - please get bigger tables or smaller plates! \n\nI might try this place for brunch, but I'm in no rush to come back.", "author": "Patricia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-01", "description": "Soul food and soul presence in the heart of Fort Greene.\n\nCame here on a late afternoon to just relax and relax we did.  Place is small enough to feel intimate but large enough to accommodate a bigger party.  Entrees are affordable from $10 to $14 and come with two sides. We ordered the jerk chicken, fried chicken and fried whiting and shared the collard greens, mac n cheese, spicy fries.  Everything tasted fine but the fish and the mac n cheese stood out the most to me.  \n\nFriendly service, chill environment, and inexpensive food, stop by when you're in the mood for soul.", "author": "Mona L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "The food is decent. The drinks are nice. I had the chicken and waffle. The chicken was good, the waffle, was not spectacular but not bad. It has a nice atmosphere.", "author": "Keri P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-02", "description": "I came here for happy hour with my coworkers on a Thursday. They raved about this place. They loved the happy hour specials, and the jerk wings. I guess my standards for a Caribbean restaurant are different.\n\nThe decor has a very gentrified urban feel. Nothing about the decor shouts West Indian. The happy hour specials are beers are $4, 2 for 1 well drinks for $6 and martinis for $4 (I believe). I was surprised they had Banks beer, so I had to have one. Banks is a rarer Caribbean to find in a restaurant, including Caribbean restaurants. It's the beer of Barbados and Guyana. It's not very good, but there is a little nostalgia if you are from those countries, so you have to get one. I also ordered the rum and coke well drink special. Man, do they put a lot of rum in it. I am not a big white rum person, so I didn't like the drinks.\n\nEveryone has recommended I try the jerk wings. They tell me since I like spicy food, I would love these. The wings do taste good, but the jerk seasoning taste like the same jerk seasoning I use, which I buy at the supermarket. I actually make it spicier than the ones at Brooklyn Moon. I would rather have a jerk wings that have a unique taste and not be spicy than have generic tasting ones. Plus, they were pretty expensive for an appetizer, and didn't come with many. I did taste someone's curry potatoes, and I thought they were pretty solid.\n\nOverall, not impressed with Brooklyn Moon. I may go back to try other dishes to see if there is any authenticity.", "author": "Will D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-27", "description": "I emailed them referring to someone using my card and this is what the manager replied to me saying.. \nGo through your credit card company,..I'm the manager,I don't know what planet you are from, but on earth you go through the company that's processes the charge..I'm putting this in the hands of my friend who is the head of the fraud dept at the 88th..all emails will be forwarded to him..his name is Capt Forhkoff..good luck", "author": "Allison G."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}