{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-28", "description": "The food here is fine and the old fort Greene vibe is great in here but they have serious issues with how long things take. I'd ordered take out and they told me when it'd be ready, over half an hour afterwards they were still making excuses and didn't offer anything while I waited. Finally I asked if I could sit and they put me at a table that hadn't been bussed the whole time I was there. There were plenty of people working but no one seemed to be getting anything done. In the end we ate there because we didn't have time to bring the food home and get to the show we had tickets for. It was fine, but definitely not a place you want to go to if you're in any kind of rush and they didn't seem to realize or care that we got our food nearly an hour after it was supposed to be picked up.", "author": "Andros Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-03", "description": "I was invited out to eat with a friend, we arrived at eh restaurant at 8pm and placed orders for food and drinks at 8:15. I kid you not we did not receive our drinks until 8:40 pm and the food did not come out until 9:45 pm. I am sure it does not take an hour and 30 minutes to prepare jerk chicken with rice. The staff did not accommodate the inconvenience and said there was nothing they could do about it. I could not even enjoy the meal by the time it came out. There was no one checking in on us especially after grabbing the manager 2-3 times. I try my best to support small businesses but this is ridiculous, I will never go back to this location.", "author": "David O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "My friend and I came in on a Thursday evening around 6pm. She highly recommended this place based on their brunch so we decided to check out their dinner. \n\nWe were seated right away at a table by the window. Unfortunately, it was a very cold night and being right next to the window was very chilly even though the window was closed. Nonetheless our sever took our drink orders right away. We both ordered the Guava martini. I really enjoyed it and so did my friend even though she did mention it was a tad bit strong for her which depending on your taste could be a good or a bad thing. I loved it and only needed 2 to feel a good buzz. Another great thing about Brooklyn Moon is that the happy hour goes until 8pm! \n\nFor food I ordered the bbq chicken wings from the appetizer menu and a side of Mac and Cheese. The wings were packed with delicious flavor. Like seriously finger licking good! The Mac and cheese was also very good. \n\nAround 7:30 a screen was brought down in the back of the restaurant where they started playing a basketball game. I think this was the only screen in the place maybe 1 other tv; therefore this isn't the place to come if you are looking to watch multiple games or sporting events. But this is definitely a palace to come and enjoy good food and strong drinks with friends. The service was speedy and attentive. \n\nOverall, I'll definitely be back and recommend it to anyone in the area.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-11", "description": "Nice small place to grab a drink and socialize. Jerk chicken wings were good, Mac and cheese was okay. Happy hour drink specials are a good buy and last until 8pm.", "author": "P L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-13", "description": "Jerk wings were covered in tomatoes..returned the wings don't touch them I'm allergic to tomatoes.. I was told by owner I could get my money back or just another meal  never happened cause the \"Acting Manager\" Owners kid who doesn't know customer service well was rude total disrespectful for some food o never ate but paid for.. read ALL the reviews on yelp not the 1st ones go to the bottom of yelp page and read reviews not recommended ASAP. Place is whack '", "author": "Catina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-31", "description": "The food is decent. It's a good place to have a meal. However, they should improve their service by hiring more staff. They were friendly but seemed all over the place which was uncomfortable to watch and did not seem to get along too much with each other. A couple of staff members are very awkward too. Depending on when you go, sometimes it's just too loud. I recommend going during the week.", "author": "L M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-09", "description": "Went here the early part of the summer; second time. The drinks are great but the food... not so much. I definitely wouldnt recommend the crab cakes. \n\n\n\n(Updating my reviews from my other account, there seemed to be some technical difficulties. A mix up with my accounts. I originally reviewed this place months ago)", "author": "Tavia N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-28", "description": "Terrible Service it took 1 hour and 45 minutes to get served food. We happened to be celebrating and invited two friends to join us, who arrived an hour after us. Our friends were served food before us. We had to remind the waiter 2 times about our order. After the food arrived the sides were cold , I do not know how that was possible. We also asked for compensation for the wait and advised the manager to use their judgement. I have never visited a restaurant with such horrible customer service. I would not recommend, visit another Caribbean restaurant. I notified the manager I would be  leaving a bad review and they shrugged me off.", "author": "Kitan F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-30", "description": "Okay 2 stars?! Why? 1 star for the strong drinks and 1 for the food. The food just okay, the service was extremely slow, it was very dark and HOT inside. \n\nI went during HH. The sun was still shinning. We sat in the back and there were NO lights or windows (except for the storefront/curbside space and because of this sun illuminated 1/3 of the place). The rest was in the dark. AND it was HOT, I mean HOT As Balls. It was maybe 85 degrees outside and the kitchen in the center rear didn't help. So maybe 95 degrees inside? IDK The doors and storefront windows were open so the A.C. was OFF. WTF!? \n\nMy friends really wanted to try the food... so we did.\n- Calamari.... very good, spicy and seasoned, lightly breaded and tender. \n\n- Jerk chicken wings... Okay, too much char so a bit dry\n\n- mac and cheese... Okay, a bit oily and mildly spicy \n\n- Cat eggs... WTF?! that name just disturbs me.. but it was okay, a mildly ripe plantain wrapped in turkey bacon and deep fried. \n\n- Drinks... mixed drinks were strong and inexpensive but my friend had to wait 15 minutes for a beer and found out they were out, ordered another and 10 min later, they were out of that too!!! 5 min later he finally got a beer and it wasn't cold. \n\nI do not plan on going back. At best, I would order the calamari to go.", "author": "Kiki K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "The food here was good. I'm a big girl at heart so the portion size was alright. Not too much that I was left feeling the itis. All brunch plates cost $14.95 however the mimosas are $1?!! That's right! Just one dollar and there's roughly 3-4 flavors to switch from. Oh and they don't have a cut off limit. At least there was not one when I went. This place is small and cozy. It reminds me of the sweet chicks in willamsburg just smaller. The parking is typical NYC parking so bring cash for the meter, unless you get luckily and find street parking on the side street. You can also take the C- train but i forgot the stop. I think it's Lafayette ave but don't quote me. They do accept cards for my non-cash carrying lovers like myself. Overall, I would definitely go to this place again, but it wouldn't be in my top 5!", "author": "Erica B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-02", "description": "Headed to Brooklyn Moon for Saturday Brunch with friends and upon walking in, I immediately knew I was at the right spot.  The location was cosy, the wait staff was pleasant and it felt like a homey atmosphere.  We sat at the bar and let me tell you first hand, the bartender with the fabulous nails was amazing.  She was attentive and made our first round of mimosas quickly and homegirl did not skimp on the champagne.  The drinks flowed as did conversation; this bartender was a true delight.  \n\nAs far as the food, I would give the egg platter 5/10.  Everything looked great on the plate but my first bite into the eggs was eye-opening as I crunched on SHELL.  The last time I had a bite of eggs with the shell was when I was a kid and made them myself.  What happened chef!?!\n\nAside from my egg trauma, the seasoned potatoes (homefries) were tasty and the turkey bacon was equally satisfying.\n\nThere are other places to eat...go there.", "author": "René B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-25", "description": "We enjoyed ourselves, chicken had to be sent back, but my mother enjoyed her fish. Drinks were good", "author": "LaToya S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "This customer service at this place was unbelievably awful. I can't even believe this place is still in business. This one waitress in particular with dreadlocks and blue frosty eyeshadow approached me and my friend to reprimand us for sitting at a table without asking to be seated, which was crazy because another nicer waiter told me that I could sit anywhere. It was even more ridiculous for her to approach us being that only minutes before my friend and I were standing in the restaurant, she asked us if we were okay and I explicitly told her we were trying to figure out where to sit. \n\nShe was so rude that my friend and I decided to leave and as we were walking out she says \"toodles\". I seriously doubt this was a part of their training....\n\nI didn't eat the food but based on the dirtiness of the bar I was ready to leave even before that waitress decided to lose her senses on a beautiful Saturday afternoon.", "author": "Jordan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "omg the salmon Caesar Salad was amazing. It's not something I would typically order but my friend was raving about it so I had to give it a shot and I'm so happy I did! Cheese and dressing were served on the side which made it perfect!! Definitely on the spicy side so beware.", "author": "Monica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-22", "description": "Went for brunch and the food was very good. $2 mimosas who can beat that. The atmosphere is very relaxed and chill.", "author": "Audrey E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "Came here last Saturday afternoon to reunite with a group of friends over brunch and had a great time! While the service was pretty slow, we were in no rush so we were happy to relax and catch up with our mimosas (they are $1 each and you can get up to 5 before you finish your meal.) While you can order bacon and eggs, you should absolutely go for the fried fish or fried chicken and the delicious fries - waistline be damned. Also, the guava mimosas. \n\nThe atmosphere of Brooklyn Moon was very low-key and cozy, almost as if being a guest in someone's home, which was perfect for the occasion. I could see myself coming back here when in Fort Greene with friends who enjoy some Caribbean food in a relaxed atmosphere.", "author": "Ariella G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "Looking for a quick bite and after a recommendation, I decided to come to Brooklyn Moon Cafe. I got the jerk wings with mac and cheese and yams. Wasn't crazy about the yams but the highlights were the wings (15/10) and the mac and cheese. My friend recommended the Sea Water drink but it was just a bit too strong for me. Perhaps if I eaten something before trying the Sea Water, it might've worked out better in my favor. However, I did enjoy the food here and I would return for brunch.", "author": "Seven H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-23", "description": "For my first experience there, I thought my food was blah blah blah. The whiting was too deep fried and bland, the collard greens taste like they were soaked in cumin,  but the mac and cheese was alright but not great. The service was ok, and the mango martinis were horrible. Dont even try the cosmo, not worth the money.  I wanted to try the place, one time was enough for my liking.", "author": "Alisa J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-15", "description": "I stopped here on Friday night before going to a show at the Barclays.  The yelp reviews were good. The staff was very nice and attentive . The food was NOT so good. I had the fried chicken which was dry but has flavor. I also had the turkey wrapped in bacon (ok), yams (undercooked) sent them back. My brother had the apple salad which was good. My friend had the crab cakes (not good, costly for the size) ,mac and chs (bland, not tasty) collard greens (needed seasoning).. the vibe in the place is cool and cozy... The seawater seems to be the go to drink...The food is DEFINITELY not it", "author": "Cassandra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "I am firstly most pleased with the overall experience that I had upon stepping In the door. The staff greeted me right away and I was seated immediately! I ordered the Fish and Waffles which was nothing short of greatness. Would definitely recommend this cafe!", "author": "Sanchez M."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}