{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "Husband brought me here and I loved it. I even had two entrees that I did finish the drinks was ok but the food made up for it and the service was good will come again", "author": "Taleah B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-19", "description": "The service was deplorable, the food was lukewarm, and the flavoring was mediocre.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-10", "description": "Patron beware!!! My credit card number was stolen and used at this establishment with 2 transactions within seconds of one and other for over $300 dollars after the restaurants' hours of business.  In my opinion this is an INSIDE JOB.  Called the owner and he hung up on me. I would not recommend using anything but cash or just finding another restaurant to go to that is not run by thieves.", "author": "Ally C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-30", "description": "I read all the reviews and eager to eat here. However one star is being nice. The staff was great but the food was beyond less to be desire.... It was not fresh, tasted like can or boxed food... Horrible is being nice.", "author": "April J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "First time here and I love this place...the food is good and the service is great and was greeted with a smile and warm welcome....if you Brooklyn this is a place you want to stop and have drinks and food", "author": "Jack K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "Every time that I am in Brooklyn, I eat at the Brooklyn Moon Cafe. This is by far the best spot in Brooklyn! I have never had a bad meal there. Sometimes the service is a little slow, but that's okay because the food is always the absolute best!\nThe apple salad- Slammin! The salmon- Slammin! The candy yams- Slammin! \nI have been in love with this place since the Summer of 2000 and will continue to be a  loyal supporter. Thanks for good food, good vibes, and an all around positive experience.", "author": "Philly C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-15", "description": "The atmosphere is really nice.  Its a small and cozy spot that just feels fun and live.  This was my first time there for Sunday Brunch.  My friend and I both ordered the fish with grits.  Not good at all.  for the price, we received 3 strips of whiting (amounts to one and a half whiting), which was fried in burnt oil and flavorless.  Well it tasted like burnt oil.  When my order first came out, the fish was very dark, sitting on a bed of greens.  I immediately knew it was burnt, but thought maybe it was fried in wheat.  nah, it was burnt.  Sent it back, and a slightly lighter order came out.  Whiting, which is a very cheap fish, with no nutritional value is usually very light fish, when cooked right, can be good.  But not my or my friends order.  The grits had more cheese that hominy and absolutely NO SALT.  I think serving someone salt-less grits should be against the law or at least taboo.  It is very difficult to add flavor to grits after the fact.  The mimosas were really good.  This is a place to visit, just do not order the fish, grits or anything fried as the grease was working overtime.", "author": "Nette N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Came here on a Wednesday and there was a live jazz band! I ordered the spicy shrimp w/plantains and the mango cocktail (I can't remember the name of the actual drink). Both were great! The drink was $10 in a huge glass and definitely not watered down. The shrimp was flavorful and plantains were cooked perfectly. My friend had the jerk wings which were spicy but good and the mac n cheese which wasn't anything great. Overall from the service to food it was a great experience. Would definitely recommend.", "author": "Laser S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-31", "description": "I'm writing this review on here to express my unpleasant experience,once again, about this place due to the fact that the owner didn't even have the decency to come out and speak to us in person. My boyfriend and I have been dining at this restaurant for the past 5 years on and off. KEY WORDS \"ON and OFF\" specifically because we believe in giving people chances and because in fact we really like the food here, but tonight was the last straw.\n\nAfter almost a year of not going to this place, we were in the neighborhood and decided to give it a try. BIG FUCKING MISTAKE!! we first come in,the staff as always so incompetent. we sat at the bar, \"placed our order\" with one of the bartenders. 15 minutes,25minutes passed. Now over 30 minutes later I asked the bartender where  is our food she tells me she will check on it. Doesn't get back to me, I have to remind her again about our food. I over hear the manager telling her that she never put our order through. Then the manager comes to us with the story that they're kitchen was backed up when I clearly heard her telling the bartender she didnt put the order in. I asked to speak to the owner.... He's in a meeting!...yea ok, right after you were lighting up the candles,and replenishing the ice at the bar and the kitchen is \"backed up\" and you're in a meeting. \n\nNow, before going in, I had just mentioned to my boyfriend if he really want it to try this place.. with the owner right in front of us tying up his bicycle by the curb. YOU JUST FUCKING HEARD ME DOUBTING YOUR BUSINESS, yet you still have the audacity of just dismissing us the way you did tonight! ARE YOU FUCKING SERIOUS! WHO THE FUCK DOES THAT!! HOW ARE YOU ABLE TO RUN YOUR BUSINESS LIKE THAT. YOU KNOW EXACTLY WHO WE ARE, AND FOR THE PAST 10 YEARS YOU'VE BEEN AN ASSHOLE, AND I'M PRETTY SURE YOU'RE GOING TO CONTINUE TO BE AN ASSHOLE FOR THE REST OF YOUR LIFE. NOT A GOOD LOOK FOR YOU. IT DOESNT MATTER HOW MANY TIMES YOU REMODEL AND CHANGE UP YOUR PLACE, IT SUCKS,YOU'RE FULL OF CRAP AND ONE DAY YOU'RE BUSINESS WILL SUFFER. \n\nWE'RE SOOO DONE WITH THIS PLACE. YOU COULD BE THE ONLY RESTAURANT OPEN IN NEW YORK AND I WILL FUCKING MOVE TO ANOTHER STATE JUST TO NOT GO HERE... YOU CAN BE THE ONLY RESTAURANT IN THE COUNTRY AND I WILL STILL MOVE TO ANOTHER COUNTRY JUST TO NOT DINE HERE......", "author": "Gerardine h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-14", "description": "I prefer their dinner over brunch. I came for brunch and was not at all impressed with the French toast. I've also had better luck at the bar than a table as far as service goes. While at a table, not once did the server check to see if anything was needed during the meal and we had to ask for our check. Indifferent about returning, would need a good enough why as in a friend already there and asking me to meet them, I probably wouldn't return on my own.", "author": "Desi M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-15", "description": "This place is definitely nothing to write home about. I ate here this past Saturday with a friend. Reasonable prices, roughly $50 for 2 meals and a few drinks. \n\nI had the grilled tilapia, mac n cheese, and collards. I'd say the food was edible, but there was never a moment when I thought, \"mm...this is good.\" I didn't think the food was seasoned properly. But, coming from the south, I tend to be a harsh critic on anything \"southern style.\"\n\nIf you're wandering the area and are looking for good happy hour specials and a chill environment to mingle with friends then this place is a decent option. However, I'd never actually make plans to eat here again...there are just much better tasting options in the immediate area.", "author": "Alexis C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "Came here yesterday and really enjoyed the service.  The food was great, and the drinks were strong.  The ambiance was great.  Sometimes it took little too long to get the waiter and waitresses attention, but when we did get there attention all requests were handled perfectly.  I will definitely visit this restaurant again.", "author": "Cliffton E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-15", "description": "I've been here a couple of times...Overall the food is decent but the service needs a wakeup call. I remember going there in the summer time and the AC wasn't on. They had abt 2 heavy duty fans which was ok i guess...However, the place was kind of empty yet the waiter put us right in front of the fan. very awkward....we asked for a diff table and there was some hesitation as if there was gonna be a slew of ppl coming to dine :-/...\nThe wait for the food can get ridiculous...however if you are planning to go, eat somn b4 u get there lol...dead wrong but hey it is what it is.\n\nFood has been on point everytime I went and the drinks are pretty good too....perhaps they need to replace the waiters/servers. and the decor can use an upgrade as well.", "author": "Lyn D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "Literally come here at least 4x a month. The food is good. Its black owned and they are more than accommodating. I recommend the spicy shrimp, apple salad, and fried whiting.I also love their GREENS!", "author": "Morgan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "So 11 of us are looking for a place to get a bite to eat on a Friday night after 10pm...We wanted to stay in the neighborhood but it turns out that many of the Bed Stuy spots were about to close and/or were to crowded to accommodate all of us at one table so we looked Downtown Brooklyn and decided on Brooklyn Moon Cafe. It turns out they had enough room for all of us and they stayed open late (as it should be on a Friday night).\n\nThe service was good: our servers had smiles, nice personalities and were pretty attentive LOVE that...the ONLY downside was that we had to endure a bit of a wait for our food but when the food finally came....it made up for that long wait! BROOKLYN MOON CAFE HAS GOOOOD FOOD!!!!! I had the whole trout stuffed with spinach and garlic mashed potatoes- Nothing but glorious! My friends had Tilapia with lobster pancakes, salmon, yams, collard greens (they know how to make great greens y'all), jerk wings and barbecue wings (which we all agreed would be even greater if mixed together: jerk wings with barbecue sauce), fried chicken, corn, mac n' cheese (the mac n cheese was just so- so) seasoned french fries, shrimp, and crab cakes (my friend really didn't enjoy her crab cakes but she loved my trout).\n\nThe drinks were good with a decent price and I must say that overall we had a great time. They allowed us to be loud and enjoy ourselves (just like the customers at the bar) and treated us kindly. The only reason why they don't get 5 stars is because they have no dessert menu. Now you would think my greedy butt wouldn't want dessert after everything we ate but I needed a little sweet to follow. Just a little sumthin sumthin! Maybe some petit fours, fruit, a cookie, a brownie, sorbet - SOMETHING! LOLOL Something to finish up and balance out all of that wonderful savory goodness!\n\nOh well, I recommend you go, bring a few friends (maybe even 10), eat some great food, have some drinks and a good laugh or two. It's the perfect spot for it.\n\nEnjoy! :)", "author": "Tami B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Brooklyn Moon is incredible and I highly recommend it. I have had it on two occasions and both were amazing experiences. Personally I love all things spicy, so when I saw they had spicy macaroni \u0026 cheese as well as spicy fries I immediately fell in love. The restaurant is a little small but you still have your own space. The vibe is chill, cool, \u0026 welcoming almost as if everyone is family. So if you ever find yourself in Brooklyn and in need of a great meal take your taste buds to the moon @ Brooklyn Moon!", "author": "Brantley C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-31", "description": "I came here for Saturday brunch which was pretty good. We had chicken and waffles which I enjoyed. However, the service was a little on the slow side.", "author": "Lynnie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "This is a very trendy, inexpensive yet effective place for brunch. I thoroughly enjoyed the food and the $1 mimosa's you can't beat that with a bat.", "author": "Azareal M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "I'm a fan because the price is oh so right. The brunch food is ok. I had the eggs and home fries option which was filling and yet not overbearing which I appreciate. Mimosas were great but only because I don't think they charged us for them! In any event the waiter got an extra tip because of it so it worked itself out. \n\nThe staff was nice and personable which made this a great girls brunch spot or even a place to kick it with the significant other.", "author": "Melissa J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-24", "description": "Awesome whiting fish sandwich. Awesomeness was within this sandwich. My goodness it was blessed. It was like the pope himself blessed this sandwich. This sandwich... Oh my goodness. \n\nIt was seasoned to perfection. It was fried to perfection. Now I didn't appreciate the size of the sandwich. Cause size definitely matters to me in regards to food. But the tastiness of the sandwich made up for it. The flakiness of the fish was on point. \n\nThe curry potatos were excellent. They were seasoned extremely well. \n\nI sampled the French fries and they were great. They were thin and seemed like they were doubled fried to golden brown perfection. \n\nThe service on the other hand wasn't that great. Our waitress took too long with acknowledging us when we needed some items.", "author": "Michael N."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}