{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "My last experience here was MUCH better. I arrived on a random Tues late night and the place was empty. Cha ching! It didn't stay empty for very long but at least we were able to put in our orders ahead of everyone else. Wait time = less than 15 min!!!! And, service was perfect. \n\nInstead of ordering starters, I ordered the Vege platter (choice of 3 sides) - Apple Salad, Mac \u0026 Cheese, and Roasted Vegetables. All delicious and all devoured.\n\nThe restaurant was out of the Big Fish that day which made me really upset. But, I settled on the Lobster Pancake and my companion ordered the Jerk Chicken.  Both entrees were huge and delicious.\n\nI'm def. coming back before it gets nice out (usually when my appetite starts slowing down) but I'm worried that this fantastic experience will be ruined by the norm of slow service.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-14", "description": "Pretty ok spot. Cool, laid back people.\n\nWent on a hot day, and it was HOT INSIDE here, too. Did they forget to pay the ac (energy) bill?\n\nFood wasn't great, but it wasn't bad either. Prices were reasonable. Service was a little slow, but ok.\n\nCredit card machine wasn't working the day we went, so everyone had to visit the ATM down the block, which was inconvenient.\n\nI'd go back if I were in the area, didn't want to break the bank, and wanted a decent meal amongst cool folks.", "author": "Adrienne T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-07", "description": "This place was really cool!! I just went here for the first time last night and I LOVED it!! YUM YUM!! I had a Godiva Liqueur with my veggie plate. WOW!! It was a perfect finishing touch to a great meal. Small but fun!! High recommend this spot.", "author": "Monique T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-23", "description": "I use to go to this place when it first opened up. It was very nice clean and the vibe was right not to mention the food. Fast forward to today the place looks tore down the high back both was falling apart. The back of the seat had torne fabric. \nNext the food we got the fish can you say taste like a cardboard box. I don't know what happen maybe a box fell on the plate but it was nasty as hell. When we told the owner Mike about the fish he seem to be lost. Mind you he was the chef YIKES...\nI would never eat at this place ever", "author": "Saana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-09", "description": "A year ago I would have given this 4 stars, but I dined there recently and the experience left much to be desired. \n\nThe food was great and large portions are served, my issue with this place from the first time I have been there is their small menu. A lot of there dishes are shell fish which I am allergic to so this limits me to a handful of menu options. \n\nIn addition, the service is pretty lame and inconsistent. Good luck having someone  refill your water or ask you if you need a second drink when you finish your first. \n\nAnother issue is the ambiance. I don't know what they did with the lighting but it's bad. They have two track lights that are on the wall and not only flood the place with an unattractive light, but are also blinding. I remember when it was a nice dark and sexy place, but not anymore. \n\nThe drinks are ok and there are quite a few other places to check out and visit so the location is good as well.'\n\nOh yea, another vibe killer was when a uniform cop entered to order some take out, which I didn't know they did. He then proceeded to pace around the restaurant from the entrance to the bar, then made an announcement to everyone in the place that everything was ok and he hoped that he wasn't making people nervous by pacing around. What a classless move. Why didn't management tell him to sit and relax the bar?", "author": "Sid S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "I love this spot! The food is wonderful, happy hour specials are great and customer service is great. I've visited this location 3x's and tried something new every time and enjoyed it, the mac and cheese is my fave.", "author": "M J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-19", "description": "Uh I tried and I tried to love this place because I believe in supporting small businesses but THIS PLACE!!! \n    Where do I begin??? Hmmmm ok it's a Sunday night my three friends and I are in the Forte Greene area looking for a place to celebrate our friends birthday. Nothing to extravagant drinks and food was all we needed. After going to a few places we ended up at Brooklyn Moon Cafe...\n   First off let me start by saying we weren't greeted at the door... Noooo we were more like greeted by an opening door and a guy bum rushing by us nearly pushing us down. Secondly we stood in the middle of the venue for about a minute without being greeted or seated. We had to ask to be seated ARE YOU KIDDING ME! \n   Finally we were seated... But how are we supposed to order anything without menus!? Oh let me not forget we sat at the table with empty glasses... Water boy had a pitcher he got to everyone's table but  just seemed not to be able to make his way over to us.\n   Yet again sat for a few minutes before  WE had to get the waitresses attention to get menus! Now I'm just biting my lip so I won't READ everyone in there! (Oh by the way the owner was there and saw everything happening). So we finally get some menus but they are disgusting I mean mildew forming, plastic ripping, corners rusting DISGUSTING! \n   We sat there 5 mins no one I mean NO ONE! Came to our table to take drinks or our food orders. After that I couldn't deal we left... We put our coats and left and ended up in Williamsburg to Brooklyn Bowl! A great way to end a horrible night of the \"customer service\" we received at Brooklyn Moon Cafe! \n   To sum this all up the establishment is HORRIBLE! I won't waste my time ever again like this. Don't waste your time! Keep it moving.", "author": "Evaleen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "ONe of my favorite go to places for over 15 years! The guava Lemonade is sweet, but delicious! The Spicy fries are the absolute best, you will not find them anywhere else! \nI love everything and especially the $5 menu!!! I usually order on the phone if i'm on the ay home and cannot dine in, I run in grab my order and pay! It's always ready on time, hot delicious and hits the spot without making a dent in your wallet! The Chicken salad (Fried Fulton or Grilled Fulton) is soooo Yummy too! One of my favorites! The grilled salmon- YUM!  No one else makes an Apple Salad like Mike the owner and his brother Henry!!! It's a special place with good memories for me. Oh yes Good drinks too!", "author": "Stacy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "DELICIOUS fried chicken and waffles! Especially enjoyed it with the mimosas! Great vibe, fun area!", "author": "Blair C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-28", "description": "Hmm.. how many things can make me not want to return to a place... and Brooklyn Moon actually did it. I happen to try out this location with a group of friends on Saturday, and what a mistake it was. \n\nWaiter service was all right, but usually one can not get full on just drinking water along, need to nosh after an entire afternoon of walking around the steaming hot Coney Island Boardwalk. There is good conversation, it was the wait for the food and then when the food came, that sets off my rage. It took an hour after placing our order, for the food to come, and it was burnt.   \n\nI ordered a Salmon Burger, and it brings to my mind a horrible experience of a Veggie Burger that I had. I couldn't even taste if the salmon was salmon really. The only thing I enjoyed about my meal was Plantain,, and it is pretty difficult to mess this up. .  \n\nThen I overheard that an acquaintance had to ask for four different dishes for the restaurant to finally have it. What kinda restaurant is it to not have the food that is on their menu. Pretty bad. \n\nMy other friend had a soft shell crab, shrimp salad.. and that salad was so salty, that she was like how much sodium can one get in a meal. \n\nI know how much a restaurant would slap an obligatory grattitude tip for parties over 6, and with our party being 9 people. There was a $22 waiter fee... and I was pretty annoyed with the service, but we ended up paying. So that's that.   \n\nSo yes in spite of this being my first experience in this part of the neighborhood.. this place will never see my business again.", "author": "Linda Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-06", "description": "I wanted to give this place as many stars as I could only because the service was good. Other than that though, I probably won't be back. The bar was closed when we ate here (not that it mattered tooooo much). My boyfriend ordered the lobster pancake and a side of plantains and I ordered a salad with a side of sweet corn. The salad was less than ideal - it was closer to roasted vegetables and seasoned plantains than a leafy salad like I expected. The corn tasted like it was canned. I wouldn't be as hard on the food if it wasn't so pricey. The side of plantains, however, were really good and I'm not sure about the lobster pancake. It was an OK meal in a fix, but if I had the choice I probably won't come back here. Decor was mediocre but the small \"garden\" out front was a nice touch.", "author": "Alyssa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "I came here for brunch two sunday's ago.  The food was good. I just wish the tables weren't so close together.", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "Let me say that I am absolutely in love with the soft shell crab, shrimp salad. It's soooo good. I get it with the dressing and the cheese on the side, because if you add to much it can be very salty. I love this dish, because it's savory, sweet and crunchy. It has sweet plantains, soft shell crab as well as shrimp, and the Cesar salad dressing is one of the bests I ever had.  I recently visited on a busy Saturday night, and I think that my salad could have been better, because the greens were a little puny and wilted, but the flavor was on point!\n\nI actually like the ambiance, dim lighting and fabric draping at the door. The service could be better at times, but I am usually engaged in deep conversations and I know how to get the server's attention when I need to.  I have recently seen a couple argue with a bar attendant who forgot to bring a drink and who may have accidentally forgot to place a food order.\n~They need to hire more folks for the weekends.  \n\nOverall, I will continue to frequent the place, because I love the food. And the honey bbq wings are excellent!", "author": "Rica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-01", "description": "I love this place!!! My friends and I came here for lunch and we will most likely be back. The Lobster Pattie I had which wasn't a lobster at all but wonderfully seasoned Talapia on a bed of garlic mashed potatoes with a bit of lobster cooked into the potatoes. My friend had the Jerk chicken with the mac \u0026 cheese and plantains; also cooked to perfection. With Island Reggae in the background, drinks on the table and an attentive hostess with an inviting chef, this is definitely a great place to be...", "author": "Antoineta M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-09", "description": "The worst thing you can do for a pescatarian foodie on her 30 min lunch break is mess up her food. Not just her food, but her SALAD. How could one mess up a salad you ask? Don't worry, I'll tell you. Now make sure you follow the directions step by step... \n#1 Place hot salty salmon and stewed tomatoes on top of romaine lettuce \n#2 Accompany them with BJ's (yes Berkley \u0026 Jensen... the membership warehouse retail store) croutons and mushy, yet breaded fried plantains  .... \nWhat do you ask... how do you make it even better ....?\nYou charge \nSIXTEEN DOLLARS for it!!!! \nYes $15.74 is what I paid for a slop of wilted lettuce, generic croutons and salty (probably frozen) Salmon.\n0_o... my expression exactly. \nDoesn't sound appetizing huh? \nThis was my first time here and WILL be my last. What really grinds my gears is this salad seems as if it had no thought behind it. Someone simply threw a bunch of stuff in a Styrofoam container with lettuce and called it a salad. \n\nI'm completely disgusted!\n\n::slaps my friend that recommended them::\n\nOh on the positive the wait staff was cute and nice ! lol", "author": "Innocence D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-10", "description": "I just finished reading the reviews for this restaurant I was surprised that it got such good reviews after it was such a terrible experience for us. My coworkers and I decided to go here to celebrate a coworker's birthday.  As soon as we walked in the place was empty it was during lunch so we did not anticipate that it would be full. The place was very dingy and looked dirty. We tried to sit at one of the booths and the booth's seats and back cushion were torn up.  They were broken to the point where you could not sit comfortably on it. We then sat at a small table in the back. My coworker ordered the turkey burger lunch special and they said they were out of it. SO she ordered the jerked chicken lunch special instead. I got the grilled chicken sandwich, the other coworker got a salmon sandwich and the last one ordered fried whiting sandwich. \n\nWe ordered BBQ chicken wings for an appetizer. When we got the chicken wings they still had some feathers on them. The entrees took forever to come out. Two people came way after we did and their food came out before ours, which we did not understand why. The waitress was terrible she did not explain the long wait nor did she try and see if we needed a drink or water. When the food finally came it was terrible. The grilled chicken was disgusting and it was raw in the middle. My coworker had to send back her jerked chicken because it still had tons of feathers on it.  All of the food did not have good seasoning or taste. This place is over priced for the food you get and the overall atmosphere is terrible. The seats were torn the lighting was terrible. The bathroom was disgusting the paint was peeling and everything was dirty. \nPLEASE SAVE YOUR MONEY AND EAT ELSEWHERE....", "author": "Eunice C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-17", "description": "BROOKLYN MOON.......... I love the food, it is tasty \u0026 satisfying. The major issue that I had with this place and the reason I'm yet to return.. I went in one night after work to do take out... and the Saloon Doors were open leading to the kitchen, I had a view of the kitchen area.. HOT DAMN!!!!! I had second thoughts about eating from this place.. I saw nasty goo on the walls.. the floor looked nasty.. I felt like this place absolutely had a rat infestation or roaches. That serious bothered me. They say \" see not, know not\" they really need to be a little more sanitary. but the food.. the ambience in the dinning area.. I'd give 2 thumbs up.", "author": "Dre D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-12", "description": "This is the cutest little diner/cafe ever. The people here are always pleasant and the food is so good. I especially enjoy the crab cake and plantains. This is also the place to go if you like alcohol heavy drinks. Believe me they are not stingy in that sense.  The only reason I didn't give them 5 stars is because you'll be waiting awhile before you get your food. nevertheless, this is one of my go to places in Brooklyn.", "author": "Nika C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-09", "description": "Food was amazing!!! However the service was Blah!...All of the waiters and waitresses were huddled up by the bar chatting and gossiping while I was there with a friend/  playing personal ipods and whatnot... Felt no need to tip because there was no service...They were clearly acting this way due to lack of management for the day. The dress code was non existent just as the professionalism. :/", "author": "Rashantee L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-06", "description": "Brooklyn Moon! \n\nI am so Brooklyn, and I love this place, the food is excellent! There's a $5 menu, can't beat that, but outside of that the menu is still pretty cheap. \nNow while I love this place, and make my way there as much as I can, here's a few things I should warn you about. Don't go to Brooklyn Moon if you are STARVING or very HUNGRY, they're short staffed, and your server is also the bartender who made your drink. If you're lucky, you'll go on a night where they have 2 servers. \n\nBut once your food arrives, all is forgiven. The Honey BBQ wings, are finger lick'n good, Crab Cakes are seasoned just right and the curry-potatoes one of their signature sides are excellent. You get great food for cheap to moderate prices, nothing on the menu is over $20. \n\nBK Moon (what i call it) is a great spot with some kinks to work out. They can hire me if they want ;)", "author": "Charise S."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}