{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "My staple. Great food great staff and awesome vibe. Owner is really personable and speaks to all his customers. Best place in Brooklyn.", "author": "Marc J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "I went with a group of (6). It's a little spot so the space was kind of tight. The vibe was nice. I had the whiting dinner with Mac \u0026 Cheese (So Yummy). We didn't have any alcohol as we already had enough prior to coming. The food was great it was a little crowded but the wait was not long roughly around 20 mins. I would definitely return for some drinks and good food.", "author": "Chanee G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-25", "description": "Overall Brooklyn Moon Cafe is a solid venue with great drinks and a tasty menu.  The only fly in the milk for me is the inconsistent service and the lack of concern when brought to the attention of management. The happy hour special is attractive yet meaningless if the staff is going to take a long time to bring your drinks.  I actually came before a shift change and had the fortune and misfortune of dealing with two waiters. I was fortunate in that my first waiter was very attentive  polite and funny. In contrast, the waiter who took over after him was the exact opposite: inattentive, angry, and arrogant.  It did not make for a pleasant experience. He was slow to take orders for drinks and was generally inattentive and defensive--which is always a dangerous combination.", "author": "Kimberly T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-23", "description": "The drinks were not well mixed. The food needs taste adjustment. The Mac and Cheese did not meet my expectations. The jerk chicken was under cooked. When I elected to let the waitress know that its a 4 out of 10 experience. Her response suprisingly was \"but you ate it all\", the response I kept to myself was \"I was hungry and if I have to pay for it I will eat it\". \n\nWhen we communicated the margarita taste the response was \"we cant refund it\". Take the chance if you are ready for \"Go To\" \"Happening\" Place", "author": "Lenny M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "Came here with a colleague on a Thursday around 6pm. Was on the crowded side, so sat at the bar.  Jerk chicken and rice peas was decent, though the chicken was a little more dry than I was used to. I do like.the fact they dont drown your food in sauce though and you could select how much sauce you want to put on your food. My boy had the jerk wings, but it looked more like bbq. He enjoyed it, but visually it wasn't the most appealing.  The happy hour prices are pretty good so you can definitely leave full with drinks and food for a decent price. Apparently, brunch gets really crowded so a work evening is probably better if you don't want to deal with waiting!", "author": "Jay R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "The ambiance isn't anything to write home about but the food is a burst a deliciousness and the drinks are very strong. I ordered the jerk chicken with rice and peas, and it was the best jerk chicken I've ever enjoyed. It wasn't over seasoned, the chicken was moist and there was a flavorful spicy dipping sauce on the side to add an additional kick. The portion sizes are huge so bring your appetite! For my drink, I ordered the red rum. You only need one to feel a buzz. \n\nThe bill was very reasonable too. The food and drink was less than $25. Looking for delicious food, at a reasonable price and convenient to public transportation? Check out Brooklyn Moon Cafe. You won't be sorry.", "author": "Kelechi O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-09", "description": "Soooo I frequent Brooklyn moon at least a few times a month, and noticed in February the taste and quality of the food was inconsistent. But it's close to home and $4 drinks for happy hour so I still go occasionally. \n \nToday I stopped by with a friend and requested a table for 2. We were told there was a 25 minute wait. There were 2 other parties of 2 waiting, so I assumed they would be given the open tables... NOPE. After about 10mins of waiting we all collectively decided to ask about the two open tables, and were told they were for parties of 3.... How Sway?!? 1st of all they were 2 tops, closely situated between other tables. And if you have several parties of two waiting, wouldn't you just seat them, instead of holding tables for parties of 3 that don't exist?!? \n\nBetween the inconsistent food, bad service and seating policy, I'm disappointed with my recent experiences at Brooklyn Moon.", "author": "Sheka H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "After my terrible experience and being upset that I didn't take a picture of the fruitfly in my drink or the dirt in my ice.... I did however go on their inspection rating for nycdoh. Although they received an a, here are the things they were cited on..... Flies..... Improper handling of food....a number of things..... Needless to say, bad housekeeping along with very bad   Management and rudeness and lack of care, I won't be back!!!!\nI've duplicated the jerk wings and seawater in my very own clean kitchen....", "author": "evangeline j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "A friend and I went to this spot on the strength that I couldn't be bothered with the shenanigans taking place at a nearby restaurant.\n\nThe food here was pretty darn good, very darn filling, and yea the food was great.\n\nThe drinks were priced well, and though tasty not too strong.\n\nThe service was kind of slow and there was a mix-up with our appetizer order which was quickly resolved. The servers were friendly and well-mannered despite this.\n\nThe bathroom was a nice size and had all the necessary toiletries but that thang was not clean enough, at all. \n\nThe band that was playing was really good but I don't think they fit the vibe of the afterwork food and drinks scene.\n\nI'd come back but on a less crowded day.", "author": "Shana H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "Ive been here 3 times over the years and the first time mimosas were on point the last few times no. Seems like they upgraded the food which is fantastic and downgraded the champagne. My cousin is a chef and she approved. Get the Guava mimosa only cuz the others taste like Tang!  The cheese grits r the best Ive ever had and Im from the south! Music isnt too loud either and perfect to groove in ur seat and carry a convo! Theres no room to dance tho!", "author": "Trudy D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-04", "description": "Horrible experience. Walked in at 1:50 on a Sunday for brunch. Was told there was a 30 minute wait. After an hour plus of waiting and seeing parties being seated, we had to leave. They tried to charge automatic gratuity on drinks we ordered at the bar. Overall save your time. Try to support Black owned businesses but there a lot wrong here that went bad.", "author": "Paris T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "My girls and I came here 1 Sunday to catch up on brunch. I wasn't blown away by the service but the food was good. My fried chicken and waffles were flavorful but the I know I can make better mac n cheese. \n\nThe big seller were the cheap prices: 3.5 stars", "author": "Jenya W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "This is me and my girls' go-to place for good, strong drinks and yummy food. I always order the Fried whiting with a side of Mac and Cheese and I am NEVER disappointed. I love the ambiance and they're usually playing my favorite neo-soul jams in the background. My favorite drink is the Iron horse, it's good but proceed with caution! It sneaks up on you.\n\nThe crowd here whenever I come is 25-30 aged black professionals and it's a pretty friendly environment if you're going out for girl's night or even as a date with someone. \n\nThe price is reasonable here too--I'll have to try brunch, I've heard nothing but great things about the $1 mimosas.", "author": "Karen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "I visited this restaurant today (1/21/18) on the suggestion of my sorority sister for one of our \"catch up\" brunch sessions.  Fulton and Flatbush Avenues are known for their many great food offerings and this happened to be one I was unfamiliar with so I was looking forward to seeing how they stacked up. I must say In the food department I was not disappointed. The menu is rather limited, offering fried chicken, fried fish or jerk wings to be paired with your choice of side (spicy fries,Mac and cheese, greens, salad, grits) or Chicken and waffles, an egg dish or pancakes (I believe) for the great price of $14.95. And that pretty much rounds out the menu. I decided on the fried fish with cheese grits and a side of Mac and Cheese (bc I mean who can say no to Mac and Cheese!!) My sis got the fried fish with mac and cheese since they were out of fries.  The fish was cooked perfectly. The seasoning and breading was spot on! The Mac and Cheese wasn't the typical M\u0026C, there were some spices added to it and probably paprika for coloring. Very delicious. The cheese grits were nice and cheesy but lacked flavor so that was a bit disappointing. I can't talk about brunch without mentioning the drinks, so this place has mimosas for $1! Grapefruit, mango, pineapple, guava and orange flavors. The only thing is they will cut you off after about an hour. Or after a certain number of drinks, which ever comes first I suppose.  Not to worry though, they don't skimp on the champagne!  Now as far as the ambiance, I love the decor around the place. If you didn't know if this place was black owned, well the decor will give it away. It is a small place and they surely packed it with as many tables as they possibly could, which I'm never a fan of. Some of the furniture can stand to be replaced. They have a \"lounge area\" as they call it in the back but it's pretty small as well but still cute. They also have a small place for a DJ. Large parties beware and definitely plan to call ahead and make reservations. Sooooo...Though it may not be the boozy brunch most people indulge in and enjoy it's still a great deal with tasty food just be prepared to be nice and snugged.", "author": "Katerra B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "@eat24 @yelpnyc #foodporn I LOVE this place! It's has a small setting for those romantic nights and it also have a great atmosphere. If you desire to listen to soothing mellow tunes during your stay and eat tasty food; I would say do not hesitate to visit this establishment. Did I forget to mention the $1 mimosa's? Yup, it cost only $1 and it taste refreshing.\n\nSo what are my favorite dishes when I visit this Resturant? I have to say the Mac \u0026 Cheese and chicken \u0026 waffles. I know there are probably many other selections to choose from the menu, but I wanted to try something recommended by my waiter. I am truly happy with his selection. Scanning around I have noticed there's a mini stage for performances. I had to confirm if this is true. The manager have explained and confirmed it's accurate. So I decided to re-visit and experience something different. I can say I had a wonderful time. My recommendation is to reach out to them and see what on their plate regarding special events. \n\nI would give the 5 stars by far. My ratings can change if experience a change in customer service.", "author": "Wilkie J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-06", "description": "I was having pretty bad day and craving for a fried chicken.\nI got a fried chicken with mac \u0026 cheese, duh.\nThe dish itself shocked me in the face in every possible way.\n\nOne boneless breast + side part over few greens, mac \u0026 cheese.\nThe meat was VERY DRY, TASTELESS. The batter was badly grainy, also dry and chemical-taste-seasoned. \n\nMac \u0026 cheese was soooooo mushy that I thought it was a weird flour soup.\nThe service was pretty dry too, no one asked me how the dish was, no one was paying attention to my empty glass of water, not even offering HOT SAUCE. For real?\n\nAnd guess what? $16 including tax. It just ruined my dinner so hard and I had to get some piece from Crown Fried Chicken place.\n\nHappy hour menu looks pretty good and I appreciate boneless part. \nHowever, I will never ever visit this place again. And I think they shouldn't say themselves Southern, or train chefs and kitchen staffs from the basic. It is really hard to cook bad fried food what so ever.", "author": "KwangHoon H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "Jerk wings are amazing.  Also had the collard greens which were okay.  Nice intimate setting.  Nice date spot.  Pretty good service.  Some weird regulars at the bar.", "author": "Royce W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "Nice spot for brunch where you can have a nice meal, some libation and good conversation. The staff is very friendly and you can't beat the $1.00 mimosas included with Sunday brunch. We had a good time together. .... One last thought..and they flavor the mimosas.,yes", "author": "Nory H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-25", "description": "UPDATE: Went back for my birthday and got really bad food poisoning shortly after. My experience was the complete opposite from the first time; the chicken was definitely frozen and the drinks were bad. The sides were dry and tasteless.\n\nLegit felt like a fool after raving about this place to my man, and when we finally go, it's nothing that I spoke of. ALL SET.", "author": "Tokyo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-09", "description": "I came across Brooklyn Moon Cafe while I was walking and just knew I had to visit one day! I went there with my boyfriend last weekend around 1pm with no reservations and we were seated right away at one of the high-top round tables. Wish the door of the restaurant was closed due to the chilly temps outside, but I understood why they kept it open. The vibe of the restaurant was very warm and just made you feel right at home. The food is very affordable and the food is solid! I ordered the catfish and mac and cheese and it came with a side salad as well. We also indulged in the $1 mimosas (which came in so many great flavors, mango, pineapple, guava and cranberry!). I think this is certainly a staple in the community and it is so nice to see a black-owned restaurant in such a bustling area of Brooklyn!", "author": "Alexis S."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}