{"aggregateRating": {"reviewCount": 332, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-08", "description": "I met some friends at this establishment, for Sunday brunch and a birthday celebration. The price of the brunch options and it's selections, were the only plus from my dining experience. The SERVICE was piss poor, to say the least. With an extensive background in hospitality management, this was one of the worst dining experiences I've ever had.\n\nAfter being seated a minute and having a couple rounds of mimosas, I finally placed my order. Once my food arrived, about halfway through completion, the server comes and informs me that I could only have one more round at the special price after I had completed my meal. For me, the final round wasn't the issue. The fact that she waited until I had nearly consumed my entire meal, to tell me this....was the problem. She comes back to the table and informs us that the \"MANAGER\" said we could have two more rounds after our meal, rather than one. I felt the proper steps of service would have been, to inform me upon seating me. As I'm eating, I ordered a mimosa. When the server brings me my drink, I commence to place my lips on the glass and noticed I could feel something on my lips (that wasn't the glass alone). I raised my drink up to the light, only to discover lipstick on it. I hadn't saw it prior, because of the color of my drink. When I informed the server, she nonchalantly apologized and replaced my drink in a plastic cup, per my request. In addition to my experiences, the server crossed up two of my friends orders. There was one of each item on the their plates that belonged on the other. When the mistake was brought to the servers attention, she replied, \"Well y'all just gone have to figure it out.\" She never offered to right the wrong nor apologize for the inconvenience. I completely understand the restaurant was busy and mistakes happen. However, I feel there was no genuine care or concern about the number of service failures I and my friends experienced.\n\nFinally, upon receiving my check, I noticed gratuity was included. I asked to speak with the \"MANAGER,\" as I tip based on the level of service I receive and clearly this service warranted not one red cent of gratuity. The young lady at the door informed me there was no \"MANAGER\" there. I then asked, well who was the \"MANAGER\" that authorized the second round after our meal. She just kind of looked at me crazy and said, there is no \"MANAGER\" here. As i'm speaking to her, I notice a gentleman in a baseball cap, standing right behind me. After recognizing that speaking to her was pointless, I proceeded to the bar to pay my bill. As I walk away, I hear the gentleman in the baseball cap ask, \"What was the issue\" Unbeknownst to me, he was the owner/\"MANAGER\". I found this out by asking the bartender, where had the manager gone. She pointed to the gentleman and said, \"That's the owner right there.\" Not only was the service and my experience horrible, but the employee blatantly lied to my face. After asking the owner if I could speak with him, he basically blew me off and told me that they replaced my glass that had lipstick on it and there was nothing he could discount or remove from my bill. It's funny people say, \"Support black owned business\" when we are the absolute worst when it comes to customer service. I didn't ask for anything free. I simply wanted the gratuity removed or some sort of discount, as a form of service recovery for the multiple service failures I and my friends experienced. \nI will NEVER dine here again and neither will my friends. I wouldn't recommend this place to my worst enemy.", "author": "Greginald S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "On a Sunday brunch all the cafes in Fort Greene are packed out so.Iwas lucky to find a couple of bar seats here. Good prices and mild mimosas for a $1 with brunch BUT a limited menu and too loud music for a small crowded  space. One plus is the turkey \"bacon\" which I generally avoid, was palatable -", "author": "Sokari E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-09", "description": "I've been wondering why I haven't stepped into this establishment when I frequent this area often. Whether it's bar hopping or grabbing quick bites from the other restaurants here I've had to pass by this place thousands of times and I have never gone in. \nMy girlfriend is always raving about their cheap and cheerful brunch where they offer $1 mimosas. I would prefer if they were just included with the meal but hey for a $1, that's ok too. So while debating where we should head for Saturday brunch, my girlfriend decided to mention this place yet again... fine! I will try it. No worries right?\n\nWe missed brunch! We are late for everything so that was expected but we sat down and I looked at the menu prices and was ok that we missed brunch. The regular menu prices are cheap and cheerful as well so why not? \nI ordered a drink. Really unsure about the mixture that they offered for the ingredients I thought I would try it. The drink was suppose to use gold rum but it had a very distinct after taste that put me in the mind of wray and nephew. Definitely not gold rim. I am a rum drinker. So I asked my waitress if I could exchange for another drink and was quickly advised that they don't allow refunds. This however wasn't a request for a refund but simply to trade out for something I could actually swallow. The drink was pretty bad. The rums they mixed together didn't go well with each other. After getting another employee involved they were able to accommodate me but it did make for an uncomfortable moment until a decision was made. \nNow on to the food. We were asked every 12 seconds if we were ready to order. Some may appreciate the attentiveness but as an indecisive foodie it made me nervous and just ended up getting the first thing I looked at on the menu. I had the spicy shrimp with Mac and cheese. The shrimp were rubbery and the mac and cheese taste as if it was warmed over from the night before. My girlfriends had the fried whiting and the salmon Cesar salad. The whiting dish... I watched my girlfriend douse it with salt in hopes for more flavor;however I didn't think it was that bad. The salmon salad was covered with heavily seasoned sweet plantains. Interesting to say the least. \nI can honestly say it wasn't an expensive meal and o suppose we got what we paid for so we needed to just be ok with it. Maybe their speciality is the jerk chicken so maybe we should have went that route. \nHalf way into our meals we were greeted by a large cockroach on the wall. They had the windows open so I'm going to say this is probably where this came from. However, one of the girls came to kill the roach and walked away like nothing happened. No empathy, no apology... nothing. Just blank stares. \nMaybe the night lacked a true manager. I'm going to say this that was it but I think my first experience will be my last. \nI know this place has been here for years and I would love to see it get better. Maybe they are ok with being mediocre. I'm not interested. \n\nThe stars go for the one guy that showed in his facial expressions that he didn't know what to do or say. Poor", "author": "Talia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "The food was DELICIOUS, yes I had to type the word delicious in caps, it was just that good.\nThe fish was OMG good, fried to perfection and the batter they used to make this fish was ...read on\nhttp://activities-eatsandtravels.blogspot.com/2015/02/brunch-brooklyn-moon-cafe.html?m=1", "author": "Ron F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "This spot was small but casual with a warm ambience and amazing prices ! Brunch entrees were $15 each with $1 mimosas ! The waffles were warm and sweet with crispy fried delicious chicken ! Best relaxed brunch ever !", "author": "Ali A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "$1.00 mimosas.  I could leave it at that.... BUT the food is tasty and the atmosphere is great.  Had the fried whiting, fried chicken, grits and Mac and cheese washed down with countless mimosas on a Sunday afternoon all was enjoyable. Chicken was especially well seasoned and crispy.   Our server was a lot of fun and we appreciated her enthusiasm and humor.  Check this place out you will not be disappointed.", "author": "Paula S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "I loved the drinks, I had. I didn't stay too long, I'd consider going back.", "author": "Priscila C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Good food, good vibes (although certainly not the place for intimate conversations) and strong drinks!", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "I really enjoyed the few starters we got here but I agree with the 3.5 star rating because service was a bit off. My party of 4 showed up close to 10 on a rainy Thursday evening and with plenty of tables to spare, the hostess/whoever greeted us was nervous about giving us a table because we only planned on getting drinks. She ultimately gave us the table but told us we'd have to move if it got busy. Seeing as how it was raining and they were closing up at 10:30, I don't think there was any need for that.\n\nOnce we sat down, our appetites got the better of us so we ordered food as well---jerk chicken wings and spicy fries to be exact. The wings, 7 per order, were cooked perfectly and well spiced, and the meat was melt-of-the-bone tender. The fries, which were more spiced than spicy, were addicting thanks to whatever spices they were coated in and their accompanying Caribbean ketchup. It was also a pretty sizable plate of fries.\n\nIn terms of drinks, I ordered the Red Rum. It was tasty but small. The denser mango nectar sits on the bottom of the cup and doesn't mix well so I kinda sipped the rum/red wine and mango in a silly up and down motion. I also had a sip of someone else's grapefruit beer. That was delish.", "author": "Christina F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-25", "description": "I came here this evening and received the worst service...My date and I ordered two drinks after we had to flag a waitress.  My date ordered a Heineken, and I a mixed drink. The 1st waitress walked away. I received my drink from a second waitress. And she asked my date is this all you ordered. We explained he ordered a Heineken, mind you this is 20 mins later. The 2nd waitress says we don't have Heineken. So he orders another drink a pineapple with vodka...we wait another 20 mins. NO Drink...we decided to leave they come to table and say wait you have to pay for the drinks...for both which included the second drink we never received. I didn't even drink the first waiting for his. We try to support black businesses always but the service here was ridiculous.", "author": "Ericka S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-26", "description": "This is now one of my happy-hour spots.\n\nA short trek from my job in metro tech, just across from the C train, and down the block from Habana. This place, which never caught my eye before, stood out to me like a flaming shot of Cuero.\n\nWalked in, gabbed a stool at the bar and ordered a screwdriver. The bartended (Charles) saw the \"long day\" look on my face and made the screwdriver with extra screw. My man (Denzel voice). Chilled there for a while and enjoyed the happy hour drinks...something called \"sea water\" almost put me on my ass, almost.\n\nThe jerk wings were pretty good but there could have been something else on the plate, like a dipping sauce or something. The fries are the kind you like. You know, the ones that aren't too crispy but aren't soggy either, with just the right amount of seasoning...yup it was deff a good choice.\n\nAll in all, try the happy hour AND the food.\n\nCash and Credit accepted.....oh yea go during happy hour, I might be there :o)", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "Wow.  The food is excellent, the prices are beyond fair and the portions are very generous.   Signature drinks are really different and really delicious.\nBMC has been around for quite a while and is a legend.  The super-nice owner has a really really super-nice and very attractive staff.\nThe atmosphere is Brooklyn chic with a good-looking clientele, bohemian creative types it seems.  Not a bad place to hang around if you're single.\nSometimes live music and a once-a-month comedy show rounds out the whole package.  If I lived closer, I'd be in this place every day.", "author": "Chilly P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Baby when I tell you we found a treasure! After a hard drinking night we decided to try something new. After walking past this gem for sooo long, we finally decided to step in and it WAS NOT A MISTAKE! The food! The service! The FOOD, again! Sooo tasty, so amazing. There were a lot of silent moments because it would be utterly disrespectful to the food to carry on any form of a conversation! We had the pleasure of being serviced by ALEXIS! What a beauty! She was so sweet and attentive! She listened, she joked and truly showed us that our business was appreciated! \n\nLong story short, THIS IS THE PLACE TO BE! See you guys next weekend! \n\nPs 14.95 for brunch and 1 dollar mimosas, can't beat it! :)", "author": "Shay B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "I haven't been here in a while, only cause its seemed to have gotten super busy all the time which is great for the business but not so great for a regular patron! But  I decided to stop by on a Monday and It happened to be on a comedy night. I had The rum punch  which was on point and I Ordered the jerk chicken with roasted vegetables! The jerk chicken was good but the roasted veggies were pretty damn great!!! They were seasoned extremely well and cooked perfectly. The comedy night is a great idea but they may need funnier comedians. I give them credit for having enough heart to get on stage and follow their dreams though!", "author": "Manny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Soul food as well as Caribbean. The jerk chicken is insane. Or try anything fried with mac and collard greens. I could drink the hot sauce by itself. \n\nAnd they have music and comedy on some nights too. Check this original Brooklyn spot for the real deal!", "author": "Hunter P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "I dined in one night and had a good time. The food was yummy, the drinks were good, and the waiter was the highlight of the experience. He complimented us, he was quick, and not overly attentive but just a genuine person. The decor was cool. Dress casual and bring a friend. I love the middle high seats. The drink selection is large. The place was diverse. Great for groups who like to have fun at their table and enjoy good vibes.", "author": "K_nyc B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-16", "description": "Where do I start we didn't get served until 30 mins later. The fact we had to wait 30 mins I missed the chance to get s burger. Really ? She said it ended 30 mins ago ..... I asked if there's some type of Curtesy I mean it's all a turkey burger. Anyway I had to order the fried whiting the season fries. It was okay.... Like I said I didn't really want that to begin with. Keep in mind my friend and I ordered drinks it didn't come until an hour later mines took another 20 mins for a watered down drink. The bus boy was a waiter when we came in I didn't seem him fill up my glass with water. I was definitely thirsty the whole time. The service is no good. They try but it's only a bus boy and a waitress. Doing everything .... It would've been nice to have that turkey burger. I will not not come back especially because of that .", "author": "Kashiro W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "I went to Brooklyn Moon for their weekend brunch, and everybody knows brunch should equal unlimited mimosas! Here they have $1 mimosas in many different flavors, that definitely get the job done just as well as any of the bottomless options out there for an even better price. \n\nTo eat I had the Chicken \u0026 Waffles. The portion size was great and the chicken was well seasoned. The only downfall is their menu is limited, but I'm sure you can find something on there for the sake of those $1 mimosas.\n\n I will definitely be back here and look forward to trying other dishes on the menu.", "author": "Allison C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "Went there last night with my girl to watch the super bowl and have a few drinks but after I saw the menu I decided 2 tried the spicy shrimp with Mac and cheese and my girl d bbq spicy wings with Mac and cheese. \nMac and cheese was so tasteful,  very cheesy both of us just loved it\nWings and shrimp: well seasoned. It was spicy but not too overwhelmed.  It was just \"deliciously perfect\". \nDrinks: was great not too strong but just enough to make a girl happy ( Hennessey /ginger ale, margaritas)\nAnd d staff was very friendly. \nI will b back :).", "author": "Dinah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-25", "description": "4.25 stars!\n\nWhat a difference interior design and a change in staff make!  I came to Brooklyn Moon a few years ago and the food was delicious but the service was horrible.  I met a dear friend there again on Friday evening and was presently surprised with the changes.  \n\nAfter a long work week, I made a beeline for the bar and ordered a Brooklyn moon (light and dark rum, fruit juice, etc).  We also ordered a few sea breezes and shots of rum. We had the jerk chicken wings to start, then my friend had grilled tilapia and I indulged in the fried chicken, mac and cheese and yams.  Everything came out in an orderly fashion and was absolutely delicious.  We cleaned our plates. I wanted to try dessert but was entirely too full due to the large portions.\n\nThe service was impeccable.  Our server, Ketty, was attentive and checked on us regularly.  Our busboy, Amir, was really sweet and kept our water glasses full, table clean and tea candle lit (which we kept blowing out accidentally. lol).\nThe restaurant got really packed and loud around 7:30 and it became difficult to have conversation with people next to you. Ah well, still a good place to hang out.\n\nI'm glad I gave Brooklyn Moon a 2nd chance, they've redeemed themselves.", "author": "Erin A."}], "servesCuisine": "Southern", "priceRange": "$11-30", "name": "Brooklyn Moon Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "745 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iW420-1Jcw9gMTP2alnxKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557149"}