{"aggregateRating": {"reviewCount": 19, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-25", "description": "I stumbled upon this place while in route to my favorite stop for açaí bowls that is just around the corner. Though I did not get an açaí bowl (not sure they even make them), I ended up getting their Berry Berry smoothie and it was delicious! I will definitely be back.", "author": "Shakira W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "This is my number one spot for smoothies and natural juices.\nI visit this place almost everyday.\n\nCustomer service is excellent, and you always leave feeling good. The store also had a rewards card if you purchase juices frequently, the card gets stamped and eventually you get a free drink.\n\nTry their wheatgrass with turmeric, ginger and cayenne pepper shot. \n\nThey also have a great selection of healthy bars and salads in the back.", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "Clean and bright.\n\nWe tried a few juices and smoothies. There were not bad. all were kinda smooth and sweet. Im not sure about the \"detox\" part but it did go in tasty. Prices were ok, they were around the $5-7 range for juice/smoothies.\n\nIn the back, it looked like a sandwich shop with some snacks a bodega would sell. \n\nStaff were friendly and really wanted to know all the types of things they sold and the membership cards they had. The down side was they kinda didnt know how to explain what or how some of the drinks were made.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-20", "description": "Today at 7:30 in the morning that filipino asian looking guy he doesn't know how to make a bacon egg n n n cheese sandwich. I was waiting til 11am to finally eat it n guess what i see no ketchup no mayo (thats lubricant for sandwich that shud b a standard everywhere) i suffer from stomach acid from time to time but stilll he dont know how to cook bacon making me wait forever in there took him like 15-25 mins to make a damn sandwich when i open the damn sandwich it was black bacon. That's how badly fried it was. Don't ever get your breakfast from here. They charged me $3.50 not bad but for me to get fucking stomach acid from his lack of knowledge on how to cook the bacon right what a damn shame! If i could i would of made it better myself! What a shame!", "author": "Viva V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "I don't really understand some of the bad reviews, I actually like this place enough to come back during the school year - but definitely this is a hit-or-miss for some people.\n\nThe employees that work here are always friendly to me, and the guy at the counter likes to make jokes and laugh but sometimes it goes over my head, lol. But he doesn't seem like a bad guy. \n\nThe juices are great and I keep going just to get the free one on my juice card. The smoothies disappointed me because they sometimes tasted too bland or too watery, so I stopped getting them. The juices I got were never bad though. I personally enjoy the Arctic Zen and some Beet one.\n\nAnd yes, there are some people I trust to make my juice more than other employees, but the juices actually turn out good for me no matter who makes em. I'm glad this place is around and hope it stays for a while, this is a much healthier alternative to the bubble tea and Starbucks  and etc. scattered around the area.", "author": "Corinna Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "I am updating this review because the man at the checkout counter continuously tried to get me to go drinking with him and made other inappropriate comments. The food is good but this is very unprofessional and makes me not want to come back.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-07", "description": "The only thing this place does right is the detox drinks and the snacks... If you order any sandwiches.. Or breakfast items or anything from the grill its complete trash...I caught the guy trying to add stale dried out cheese on my sandwich", "author": "Auty B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "I've came here 3 times and i love it!\n\nI usually get the grilled chicken wrap  which is $6, like omg that's so cheap I'm used to paying 9-10$ in midtown. Anyways they also sell really good smoothies, I've only had the pina colada flavor but my friend ordered a green one that was super yummy and sweet!", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "This is my absolute new favourite go to juice place. From the first time I tried their green machine I was addicted!! Also, every single time I go their juice and service are consistently good. It's surprisingly hard in the city (or maybe it's just me) to find such a good smoothie/deli with reasonable prices, big portions, and fresh fruit but they've done it!\n\n Honestly I really hope it becomes those low key infamous hole-in-the-wall places because this place is such a feel good place I can't rave about it enough. If you're on some kind of juice diet and want to drink only orange fruit/veggies, if you're sick and need a hot honey ginger tea, they've got it. The colour also comes out surprisingly beautiful bit maybe I'm just biased towards green juice (faves are green machine and green tropical blast)\n\nTldr; you must travel to this small downtown brooklyn corner and try it if you love a good JUICE OR SMOOTHIE", "author": "Rose L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-02", "description": "This place offers smoothies along with wraps and breakfast items. In addition, the majority of staff are hardworking and customer-catering. Unfortunately, one employee who was working thought that it would be okay to persistently make advances on a customer who was clearly appalled by the inappropriate behavior. This is completely unacceptable, and has resulted in me giving this place 1 star.", "author": "Rob C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "Update April 7:\n\nTL;DR - The new girl at the juice bar is rude and made the wrong order and when I asked about it got upset and insisted I didn't know what I was talking about.\n\nOk we've been going to this place consistently for about a month now. Between my roommate and I we've probably gotten close to 15 cups of smoothies and juices in that time and they've all been great. The lady who'd always been making the juice and smoothie that entire month has been so incredibly sweet and gets our order right every time (we also usually get one of the pre-set combinations straight of the menu) and we've loved it hence we kept going back. It had been come our go-to pick-me-up.\n\nBUT YESTERDAY (warning: long rant ahead) when I went to get juice, it was a new girl w reddish hair? which I'd never seen at the juice bar before. I wanted to try out a new combination (I always get the Arctic Zen) so I ordered the Kale Immunity (Kale, Carrot, Apple, Orange, Lemon). The girl repeated my order back at me correctly, and I saw her pick up and cut up a couple of carrots and apples and start to juice them, so I went back to texting a friend about plans later in the evening. About a few moments later, the girl held up a piece of ginger and asked me if that amount was ok. I was distracted and it looked fine to me so I just said sure that's fine. She juiced that and poured out all the juice into a cup and it was only when she handed me a drink (which was a murky orangey brown-ish color) did I pause because that did not look at all like the green I expected my KALE drink to be. I looked at my drink and back at the menu and asked her if this was Kale Immunity, and she said YES very indignantly. I asked why it wasn't green at all and she said it was cos the Kale didn't have much juice and waved a piece of Kale at me. I looked again at the drink menu then it hit me that ginger was not part of the Kale Immunity fruit list AND it looked suspiciously like she made me the Ginger Sparks drink (Carrot Apple Ginger), so I asked 'but you put ginger in the drink and it's not part of Kale Immunity..?' And she got angry and insisted that it was indeed Kale Immunity and that ginger was part of the fruit list for that (it isn't) and that she'd made it exactly right. At this point I was upset and tired, I'd just wanted to clarify and I'd been really polite to her but I didn't want to cause a scene because I genuinely really liked everyone else that I had met there, so I took the drink and just paid for it. The guy at the cashier was rly nice as usual, so that made me a little less upset. And to be honest I would've just been fine and taken the wrongly made drink anyway without a fuss (because these things happen and their juices are pretty nice anyway) if she'd just said she'd accidentally made it wrong and told me what it actually was instead of getting pissed at me for trying to clarify my confusion. I went home and tried the juice and the fruits were delicious as usual but it was DEFINITELY not Kale Immunity at all cos it was just sweet and spicy (the ginger) and there was no slight tang of the orange/lemon which all other smoothies/juice combinations that I've had with either of those had. I was having such a good day and this encounter and her rudeness really ruined my day.\n\nIt makes me so upset that I had such a bad experience and I'm never going back again if it's this girl at the counter even tho I rly rly love this place. Would definitely go in a heartbeat the original lady that was there the first month is the one making the juice. 0/5 stars for my experience yesterday, only giving it 3/5 cos of all the amazing experiences I've had before that.\n\nUpdate April 7 (2):\nWe walked past the juice bar today in the PM and it was the original lady (w the bun) on shift!! We got the Kale Immunity this time AND IT WAS GREEN w a hint of brown DEFINITELY NOT THE ORANGY-BROWN from yesterday, AND SLIGHTLY TANGY and so so delicious. I FEEL VINDICATED.", "author": "Andrea N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "The smoothies are all ice!! \nWorst smoothies I've ever had. Came here twice, hoping the first smoothie was a fluke but both times were terrible. Smoothie was mostly ice instead of fruit and other ingredients. Pretty gross. Don't bother.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "The smoothies barely have any ingredients put into them, just a little piece of broccoli, few spinach leaves, milk with majority ice. One whole banana was put in there but the consistency didn't come out well.", "author": "Amit P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Best place in the area especially if you work in the area and are attempting to somewhat eat healthy", "author": "Ronald G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-18", "description": "The smoothie was less than desired. Had no taste and hardly any fruit. It was mostly milk and ice. I guess that's why I was asked repeatedly if I wanted sugar or honey. I wouldn't return. Hawa around the corner has better tasting all natural smoothies.", "author": "Kaysha F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "For a variety of quick bite meals that you'll enjoy!!!!\nTheir juice bar is amazing as well.", "author": "Jalal A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Great juices and smoothies, pretty cool deli/grill in the back, and an impressive selection of groceries and convenience goods. The prices are pretty unbeatable, especially for the grill. The staff is also very friendly and accommodating.", "author": "Paul L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Great customer service. I'm in love with the Purple Beets.  Every fruit in the world. Dieter heaven. They offer you a card which they stamp after your purchase and after the 6th one they give you the 7th one free.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Great place! \nHas a wide variety of sandwiches and juices.\nThere smoothies and shakes are one of the best I've had in a while!\nAmazing place!", "author": "Ahmed A."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Go Detox Juice Bar Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "398 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/E4W1-cV0qjnpEGY6ZdHQcA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963696"}