{"aggregateRating": {"reviewCount": 10, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-03", "description": "Excellent food, especially the Spanish food!  Service is excellent, and they deliver!", "author": "Alexis W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-07", "description": "If you want cancer here's the place to go, you'll ask for a very healthy sandwich and wind up with a chipotle mayo covered roll with turkey, I would have been better off choking on my $10. And the diarrhea that follows is life altering, bring your baby wipes...", "author": "Nicholas D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "A reasonably well stocked deli. It was clean and the workers were professional. There was a decent amount of space, which is not guaranteed in a deli. Prices are pretty standard, $4 for a naked juice, $3.50 for a muscle milk.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-06", "description": "This place opened up recently and although it is no frills, it does make this stretch of Dekalb look nicer. This part of Dekalb is right across from Brooklyn Hospital Center, so it is pretty important that some food establishments around here stay open for 24 hours. \n\nI have been known to roam the streets late at night. Like a cat perhaps looking for a piece of fish, I found this place one night. It is very well lit and it carries all your typical bodega items.\n\nThey also have a deli and you can order salads, sandwiches, burgers, fries, etc.\n\nThis place comes in handy when everything else on Fulton St is closed at 3AM. Thanks for saving my life...a few times already!", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "This place has a great selection! \nHowever caution! They're slow when they get busy and they tend to screw up the orders when busy. (although it is under new mgmt so I haven't had a problem since!) \nNot bad screw up, just like for example instead of eggplant, they gave me marinated mushrooms. And I said no cheese and they add cheese. \n\nI like this place, it's cheaper than the bagel store with more selection. Just time consuming.", "author": "Vito P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-29", "description": "I like you Green Bites! The staff is always friendly, it's really clean, they sell my new favorite ginger ale, make tasty sandwiches and always seem to have a few fresh fruit cups available for sale. A notch above the average bodega, but...I don't think they sell beer, which I believe is an important bodega item. Had to take away a point for that.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "Clean space; nice food @ good price.", "author": "Izzy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "i love the salads at this deli, they make it any way you want !", "author": "Rose R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-10", "description": "I love this place. The prices are more than reasonable and the portions are generous. The food is ok and like others have stated, it's Halal so no pork :'( , but the prices and the very friendly staff keep my coming back....on an almost daily basis.", "author": "Louis F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-27", "description": "I'm surprised I haven't reviewed this place sooner...this is a great deli which is on my street. I may be a bit biased because I live literally 2 blocks from here and frequent it often. but they are very CLEAN inside, the prices are very reasonable, and the people who work there are extremely nice. My only gripe is that they dont serve any pork products which prevents me from getting an italian sub or anything with pork. On the bright side, they have a menu with 30 or so sandwiches (all made with boars head), all reallyt good, all their ingredients are fresh, and you can have a large sub for less than $6. They also have a lot of good drinks, and sell tobacco products if you smoke. One time I didnt have cash and they spotted me until the next day (although I am a regular). I think they should deliver and they would do 10x better, but I don't mind walking next door.", "author": "AJ K."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Greene Bites", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "116 Dekalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/wqNqzumU28Zsuhrk85PXJA/ls.jpg", "@type": "Restaurant", "telephone": "+17185224455"}