{"aggregateRating": {"reviewCount": 61, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Do you happen to be in beautiful Brooklyn Heights and are looking for an awesome vibe, great atmosphere, and a friendly bartender? Look no further than The Binc. My husband and I have become regular patrons of this wonderful establishment. They have an incredible menu with delicious cocktails that will leave you wanting to try the entire menu. And if you're looking for something completely unique, Jonathan or Tom will craft you a concoction that will leave your senses tingling. Great tapas selection to curb any snack desires. Highly recommended. You will most certainly not be disappointed.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "I love everything about The Binc -- creative, tasty cocktails, delicious food, professional service and a welcoming vibe. Also, the lighting is great; it's very romantic and sexy and slightly Miami-esque. Look closely for fun Tiki gear sprinkled around the bar and ask your bartender for a Tiki special drink -- that's what I always get and they make some really delicious concoctions. Bring friends, bring your mom, bring a date!", "author": "Christina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Amazing cocktails.  Deviations from the classics.  The perfect neighborhood bar that is not quite a neighborhood bar.  Makes me want to move to the area.  Love the decor and ambiance.  Intimate without being stuffy. Good job.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Took a few out of town friends to visit Brooklyn Bridge Park and the Promenade. Came here to grab a bite and some drinks afterwards.\n\nI got a Manhattan, it tasted very good and strong. The ladies ordered a specialty Binc Bowl, it had a beautiful presentation as well as taste. Not too sweet, not too strong.\n\nFood was on point as well: truffle fries, meat and cheese plates, also got an order of the salmon poke.", "author": "Xunnan f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Really cool place. Table seating for maybe 20-30 people. Lots of room at the bar and store front window area. \n\nNice place to grab some light food and drinks after work or for a date.\n\nCozy \u0026 elegant atmosphere.\n\nService was really amazing, friendly, attentive, super helpful with picking our food, drinks, wine etc.\n\nThe burger and calamari were fantastic!!!! \n\nWill definitely be returning !", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "LOVE this bar. Super cute inside. Bartender so friendly and attentive and the cocktails are amazing!! And strong!! I had the FALL OF ROEBLING delicious! And my friend had an old fashioned which was also v good. I see this becoming my local.", "author": "pamela b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Just arrived in Brooklyn this afternoon and was planning our night. Just wanted dinner, maybe a drink, and then go back and rest up. Had pizza at Julianas (really good) and picked this bar on the way back because it was close to our hotel and had some good yelp reviews, even though there were only six total reviews. Coming here ended up being the best decision of the day.\n\nThe establishment opened pretty recently, so it was a pretty slow Tuesday night there, but that made the experience that much better. Our bartender, Jonathan, was the most amazing ever. The menu had some interesting cocktails, but it also had the option to have the bartender make one for you. This is where Jonathan shines. He talks you through what your preferences are, such as alcohol type, strength, and flavors. From there he concocts a custom made drink based on your preferences. Not only were the drinks amazing, he was also really friendly and both passionate and knowledgeable about his craft. My fiancee and I ended up staying there a couple hours more than we originally planned, just conversing with Jonathan and a few other patrons, and having him come up with a variety of unique drinks.\n\nNot sure why this place has so few reviews but there needs to be more bars like this, and i wish it were in my hometown of LA. If and when we are ever back in Brooklyn again we will be sure to visit this gem.", "author": "Kenzo O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-30", "description": "I've only tried the cocktails so this review is for that. I've been twice. I had a stirred, boozy drink and a shaken one. Both were balenced, though nothing incredible.  I enjoyed the stirred one the most.  However, I took a star off due to the happy hour. Now according to the sign it was buy 2, second drink half off. However the bartender says it is buy 2 drinks get second drink 2 dollars off. He repeated it twice. Now maybe he just got confused. Still if it's on the sign that is outside you would think he would know. I didn't like that. Especially since it was 10 minutes before happy hour ended. So overall I'll give them another try but if you go there for happy hour make sure you ask. Don't just believe the sign.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Great bar, with even better bartenders! This is the perfect bar to grab a classy drink and quality food without all of the pretentious nonsense that other NYC haunts make you endure. Drink mixer extraordinaire Richard not only concocts a mean cocktail, but he is a total delight - he is hilarious, but also has a natural gift for anticipating his guests' needs/wants.", "author": "Courtney A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "The drinks are truly delicious and change every season. I tend to get the cheese board and charcuterie, both of which are delicious. It's a must needed addition to the neighborhood and a great spot for a small group to catch up over drinks.", "author": "Kathleen W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "A beautiful little gem that is a welcome addition to the neighborhood.  BK Heights is lacking in good cocktail bars and this place is comfortable, romantic, never too crowded, with wonderful drinks.  I love coming here on a low-key evening as it's just a few blocks away and never disappoints.", "author": "Camille G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Great cocktail bar in Brooklyn Heights. Our bartender Peter was amazing! it was crowded for a Monday which already says a lot about this place. The cocktails were delicious, the service was great. Haven't tried the food here yet but I'll be coming back to check those items out.", "author": "Patricia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "I've been in New York two nights and have gone both nights. Flank steak the first night was excellent. Burger the second night was just as good.", "author": "Jt P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Very cool place with even better food. We had most of the things on their menu and were wowed. Excellent kitchen", "author": "Tom D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "A nicely varied cocktail menu and a bar tender enthusiastic about going off menu - and Thomas delivered when asked to do so.  The vibe was classic cocktail bar, blending well into the neighborhood, for those tired of the speakeasy trope and just in the mood for a good drink.", "author": "Matt K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "This place is great. It has an 20s vibe to it, dimly lit and romantic but would also go alone for a drink too to relax. Great cocktails. I would come here all the time if I lived here.", "author": "Allison H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-03", "description": "Cool thanks for promptly providing me with a menu and water at my seat, and then ignoring me for 20 minutes. The water was great though. (Bonus star for previous good experiences.)", "author": "TJ L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Phenomenal atmosphere! Phenomenal drink mixes! Phenomenal time for my 40th birthday!! Thanks guys!!", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "The bartender was friendly and had good suggestions. Our drinks were great.  I liked the homie, yet elegant vibe. We went on a week night, it was chill and enjoyable.", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "Nicely spaced bar, well-mixed drinks.  The only thing is that this place sort of functions as a restaurant, and there were a lot of kids while I was there, which felt a little odd in a sort of lounge-y bar space.  I fully acknowledge how curmudgeonly I sound by complaining about kids in a bar.", "author": "Jonathan R."}], "servesCuisine": "Tapas/Small Plates", "priceRange": "$11-30", "name": "The Binc", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/8pPiSk-aNrcIGDYz2NqDkg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}