{"aggregateRating": {"reviewCount": 61, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Small and cozy place with interesting cocktails!! \nWe literally ordered all their cocktails.. My favorite was Pacific Crest Trail which was jalapeño infused tequila drink and Fiona apple which is a bourbon based drink.\nTheir Midnight oil drink was quite interesting.. it actually had Wasabi and Ginger!!! Can you believe that!!!\nWe also ordered their garlic fries which was yummy!! Its a small place so can get quite full..however we were 10 people on a Saturday evening and got ample seats to sit.", "author": "Jillika I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-19", "description": "We've lived around the corner from Binc for the past few years and decided to try their \"famous\" Binc Burger. Unfortuantely, we were both disappointed (we've had our fair share of NYC burgers). \n\nThe bar and atmosphere is awesome. Dark, cozy, romantic date spot. We sat at the bar and service was spot-on. Their artichoke appetizer was delicious (but very small portion). \n\nAnywho, let's go back the Binc Burger. The burger was quite dry and under-seasoned, the bun was way too doughy for the thin beef patty, while the fancy cheese they used didn't seem to add anything to the experience. Could've used some acidity, if you don't mind be being a pretentious burger snob. I was just expecting more considering how patrons and the establishment seem to showcase the shit out of this burger. \n\nOn the first bite, one can immediately tell that the beef quality is nothing up to par with the likes of Brindle Room (East Village) or even two8two (Cobble Hill) or Long Island Bar (also on Atlantic) which are in the area. If you're looking to eat a delicious burger, head to those spots! \n\nAlso, all burgers at a place like this should include a side of fries. Don't charge extra. They were good though. \n\nCome for the atmosphere and drinks. Nothing more. \n\nGood night.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-27", "description": "Four stars on the food and five stars on the ambience and drinks here - the epitome of a sweet, intimate and cool spot to come for a date or hangout with a friend that you know will be filled with juicy relationship details and life ponderings. \n\nHad a crispy Peroni at the marble bar and we split the sriracha wings, fries with garlic and Parmesan, and quinoa-asparagus bowl. \n\nAll were very good - not groundbreaking but great compliments to feeling tipsy. The wings were the standout and tasted like sesame chicken at a Chinese restaurant which was satisfying with my beer! I'm not dying to go back but I'd definitely come back for a last-min get together.", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-15", "description": "Great place for happy hour in the neighborhood. The cocktails and bar food are great. Perfect for one person or a group. Have a bit of patience, service is good but can take a while.", "author": "Jimmy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "I stopped in for drinks on Halloween and had a great time. They had decorated the whole bar and it had a spooky vibe. I tried a few cocktails off their special menu and really enjoyed them. Nicole the bartender was super helpful in describing the drinks. One of them was a take on a Trinidad sour which I didn't know existed, but using some pumpkin related ingredient. It was one of the most interesting drinks I've ever had and absolutely delicious. \n\nI also got the chance to try some of the food. I ordered a burger, medium rare, which came out perfectly cooked and delicious. I got about half way through until my girlfriend arrived and gobbled up the rest, remarking on how good it was. We also went with the meat and cheese plate which we liked. I would 100% recommend asking for extra bread because you're going to need it. It was pretty dark so I couldn't tell exactly what the cheese were but there was a salty probably Italian cheese, a milder cheese, and something what was definitely goat or sheep's milk based. The meats looked like some sopresta and maybe speck or prosciutto. Overall a solid meat and cheese plate for $21. \n\nI'll definitely be back here in the future. From the other reviews it sounds like I need to make sure to hip up happy hour, $8 for a cocktail here is a bargain.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Fun cocktail bar with pretty good happy hour deals.\n\n$8 basic cocktails until 7:30 and $4 Gansett bottles (didn't even know that was a thing).\n\nThe Manhattan was great and strong. The Vodka Southside was simple but delicious. Our bartender Nicole was awesome.\n\nThey share a bathroom with Bevacco and there are only two, so if it's busy, it might be a bit of a wait.\n\nAlso the last Tuesday of the month is Tiki Tuesday!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-15", "description": "There is one great bartender left. As as a tourist to Brooklyn when a group of thugs who think they are tough because they have strength in numbers are regulars you have to question why go to such a place.\n\nVery disappointed that the local \"workers\" in the area are wannabe gangsters who have something to prove. Grow up children and this includes the owners. Know your clientele.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "This spot is PERFECT for date night. Low lighting, music is at a low volume, booths \u0026 bar seating. All around divine.\n\nI had the Raspberry Road. It was perfection.\nMy companion found a really delicious mezcal-based drink.\nThey have a lot of beer and wine offerings.\nAll the drinks were tasty and they were served in fun glasses with pretty garnishes.\n\nEmployees were attentive without being overbearing and seemed like they were always up for a good conversation or an encouraging word in regards to the menu.\n\nDrinks on the menu were $14. Allowing the bartender to make you a surprise drink (you choose the liquor and then let them go to town) runs $15. They may also have small plates?\n\nThis place is the jam. Good drinks, great service, AND it's steps away from the A/C train so you don't have to stumble home very far. Check it out!", "author": "Hannah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "They have interesting cocktails, intimate ambiance. Overall, chill and quiet place for an romantic evening.", "author": "Anna Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "This is a cozy spot (love the lighting) with a generous happy hour- $8 cocktails every day til 7:30. They also serve my favorite beer right now the Forever Ever IPA. But what pushed this review to a 5 were the fries with garlic aioli. They were so delicious- and I've had many a fry in my day! Service was top notch. My only recommendation would be to make the bathrooms gender neutral so there are two options for everyone instead of one.", "author": "Aly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-02", "description": "I come here for the sweet happy hour. Vodka drink with mint doesn't sound fancy or special, but it finds a way to be exactly that. All other drinks on happy hour awesome as well. Also have had the power boy which was fantastic, but if you need a \"light\" snack for the group, the fries are massive and close to best fries I've had at s restaurant. Well worth it. HH till 7:30! Score!", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-15", "description": "Lovely little bar! It's perfectly cozy with dim lighting and friendly service. Our party of three shared a charcuterie board and a great bottle of prosecco for a decadent late night treat. Would go back for another relaxing, low-key night.", "author": "Yasmin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "Came here on a Friday night and they had few drinks on their happy hour menu ($8 drinks) so I got a Manhattan, which was made well. \n\nFor food, we got the sirarcha hot wings, they were really good and not spicy like they sound. Overall, they were flavored well.\n\nWe also got the mac and cheese, which was good but nothing extra ordinary.\n\nThe place is small and cozy, I loved it!\n\nOur server was friendly and quick.\n\nDefinitely recommend this place for some drinks and tapas/small plates.", "author": "Simran A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "Hit up the binc on a Wednesday night to find ourselves in an incident location with great ambience. They have a wide variety of drinks selections including some great craft beer. Bartender/mixologist knows his stuff and is quite friendly. Had the binc burger and the wings both were excellent definitely a great spot if you're in the neighborhood.", "author": "Suzanne F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "Went in with the wife and received amazing service from the single waiter, even though the place was jammed packed. Cocktails were amazing and you have to have their burger. Juicy and super tasty.", "author": "Juan Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Great spot for cocktails and food! \nI loved the vibe and decor. It was cool being able to go up to the bar and have a waitress so there was never a shortage of drinks. \nEverything tasted great and got me sufficiently buzzed for not so much money . \n\nThese restrooms were amazing !!! It was a pleasure to relieve some bladder stress in there .", "author": "Garbiel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "The wait staff is a1, atmosphere is cool dimly lit hipster vibe. Happy hour is 8 dollars.\nThe drinks are well crafted, but the food *shrugs*... Stay for the fries", "author": "Ian L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-26", "description": "I was staying in Brooklyn for one night and was grabbing drinks with a friend, so she suggested checking out The Binc before eating dinner. I was asking the bartender what they recommended on the menu and they actually made a custom made cocktail based off my likes/dislikes. It turned out great and even my friend's Hatchet Jack was made perfectly. I then ordered the Isla Calavera and was surprised how smooth it went down for a tequila drink. We also shared a Hatchet Jack that had a complex taste, but worked really well in the end.\n\nThe way the bar is setup is great to have a conversation with another person, so we ended up staying longer and that started to cut into my dinner. I ordered the pastrami tacos and cheese plate, but was completely let down by both. The pastrami tacos had a strange aftertaste while the cheeses included on the plate were a bit harder than we would have liked. I would have given this place 4 stars if it wasn't for the food, but I'd come back for the cocktails if I'm in the area.", "author": "Jay R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "This cocktail bar has a list of cocktails that will interest any fan of mixed drinks. The menu is short but well presented. This is not a large place but with a 1920's feel is most refreshing.", "author": "Peter L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "It's not a speakeasy - it's a bar - but the drinks they make are very, very good.  We had recently tried Le Boudoir, which was a little disappointing, so we were happy to have good drinks with more substance and balance.  And the fact they have happy hour drink list till 730 on Saturday was a pleasant surprise.   \n\nWe ordered from their happy-hour drink menu ($8), and my favorite was their version of Manhattan.  And for our 2nd round, we ordered from their regular drink menu and they were all very good. \n\nSince it's a bar, it can get too loud to have conversations since there's background music and all other noises bounce around off the hard surfaces.  \nAnd their fries are no good.  Very soft and soggy.  But the drinks?  Yay!", "author": "Harue J."}], "servesCuisine": "Tapas/Small Plates", "priceRange": "$11-30", "name": "The Binc", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/8pPiSk-aNrcIGDYz2NqDkg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}