{"aggregateRating": {"reviewCount": 135, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "I am VERY happy to say that you are back to being as awesome as you always were The last few orders were on Point! Thank you for taking your customers opinions seriously. I really do hope you stay around for a VERY long time to come.\nWe have people that come to our house and say... \"Hey, can we order from Fatty Daddy!?\" One of them says she starts craving your Fish Tacos as soon as she knows she's coming to visit me, lol!\nThank you again guys... xoxox", "author": "Gia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "I got the Al Pastor burrito and it was amazing! Comes with a soda/bottle of water as well (not listed on menu so it was a nice surprise!)\nMy friends got a steak quesadilla and chicken burrito and both loved their food.\nWell priced, (a chipotle burrito would have cost the same if not more since I would have had to get the drink separately).\nGood selection, has vegetarian options (salads).\nGreat for casual dining.\nWill come back again!", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "A tiny place with a laidback feel where the only thing missing is a bar. \n\nTaking full advantage of their lunch menu, I got a grilled chicken, stew chicken, and grilled fish taco. I didn't prefer one over the other because they were all greatly seasoned, not dry, and very well proportioned. \n\nI guess they don't get a lot of business because the cashier watched Twitch in addition to taking my order but aside from that, I didn't mind paying $12 for three tacos that came with a drink.", "author": "Leilani G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-05", "description": "I was on the hunt for churros, I didn't find any here but what I did find was delicious tacos from Fatty Daddy Taco. The menu is small, so is the space, but the flavors were bold and delicious. We tried almost every taco on the menu (it's a small menu ok), our favorite was definitely the grilled fish taco. These are not your small little taco truck bites, they're bigger in size and comes with salad toppings outside of cilantro like you would find in traditional spots. Come between 11-4 and catch the lunch specials. We'll be back for sure.", "author": "Florence V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-31", "description": "They really fill up your taco or burrito! There's a lot of flavor in the food and it blends together really well. Me and my friends ordered takeout and all the containers and bags were so neat! Our food didn't turn over nor did our drinks because they package it in a very organized manner and also tight as well. The tacos are a regular size btw, but very stuffed.", "author": "Catherine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "Everything you want in a taco spot. Low-key, good food, not too expensive. Awesome music! \nDefinitely a must go to in the neighborhood!", "author": "Darryl P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "I spend a fair amount of time at bars on Smith Street. Mostly because (1) I live right off Smith Street, and (2) I like to drink alcohol.\n\nFatty Daddy is conveniently located directly between the bars I spend my time and my home where I unfortunately do not have hot and tasty burritos waiting for me. \n\nNow I can't prove that Fatty Daddy scouted me out before opening their second location right here, but if my suspicions are correct, it was a brilliant business plan...because when I am stumbling home from a bar at an embarrassingly early hour, chances are I will need to shovel something into my fat face.\n\nFatty Daddy provides the fatty, cheesy, unhealthily loaded and greasy gutbomb I need in either burrito or quesadilla form, and they are extremely efficient. \n\nWhen they are on their game, not only can you be walking out their door with your burrito in under 10 minutes (that's if you didn't have the drunken foresight to order ahead of time as you leave the bar), but they will put your sour cream and guac inside the quesadilla itself, which is really just a more efficient way to get all this fat into daddy's mouth.\n\nPlus, if you (just a for-instance here) want to hide the fact that you stuffed an entire burrito into your face from your wife, you can probably eat it on the walk home...but not if you have to apply guacamole and sour cream to your food as you go. \n____________\n\nUnrelated thought: I would like to propose we give beans a new nickname. The\"musical fruit\" moniker is outdated; let's call them the \"thing that makes it smell like things have died inside me.\"", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "This is a nice little local taco spot, I made it for the lunch special with was a grilled chicken quesadilla and a drink for 10$. Its not bad, also the portion size of the quesadilla is actually pretty big, it filled me up. The restaurant itself isnt too big but for a quick bite you can eat there. Next on the list is to actually try a taco, I saw someone with it and it looks delicious!", "author": "Duvesh N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-28", "description": "Good tacos to takeout. Good guacamole as well. Place is small inside but If your planning to eat there can make do.", "author": "Luisa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-13", "description": "WOW! Just wow! I have never been a big fan of this cuisine of food but they have made me a believer! I usually go on wicked food binges and thanks to ubereats I came across this gem! I ordered a steak burrito which was absolutely filling, steak tasted beautiful and savory, and just enough salsa verde where it didn't take away from the other ingredients but was just enough. I also ordered a chicken quesadilla which was AMAZING! The quesadilla was thick full of meat and full of cheese and you can taste the seasoning of the chicken perfectly! Lastly I ordered three chicken tacos I'm not a fan of the tortilla chip itself but once again it was filled perfectly to capacity where not one ingredient overshadowed the other. Im hoping consistency is a strong suit because I WILL BE BACK! Easily five stars!", "author": "Veronica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-24", "description": "The grilled fish tacos from here are yummy and filling.  I ordered a side of rice which is also yummy and had to take the rest of it along with my second taco to go... the only thing I will say is that the fish taco was a bit salty but was still good and I wish they had shrimp tacos on the menu.  The guacamole is also delicious but the chips were bland.  Also the prices are great, you get a lot for your buck.", "author": "Jillian B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "Their steak bowl puts the likes of Chipotle to shame. Fresh, delicious, great portion, and good prices.", "author": "Ilia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-21", "description": "I'm always on the lookout for good tacos. Unfortunately, I'm going to have to keep looking.\n\nI ordered three tacos and they all had something off about them.\n\nThe chorizo was WAY too salty. The al pastor was not really al pastor, as it didn't have the typical accoutrements (in fact, they dress all their tacos the same), and didn't taste like it ever touched a flame. The spicy stewed chicken was the best of the three, but I've had better spicy chicken tacos.\n\nTortillas were really dry as well, but at least the portion sizes were pretty big, especially for the price.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "One of my favorite lunch ordering spots in Brooklyn! \nFood is extremely tasty and fresh \nThe steak burrito, taco and quesadilla are delicious \nThe chips and salsa always make my day when I order for lunch nice and tangy. \nThe prices are affordable have gone up recently but will continue to order from them because of the quality of food I am receiving. \nOne thing I really dislike are their delivery guys they are rude and inconsiderate. They think that I am waiting at the door for their deliveries. The office that I work for is on the 18th floor and as a nurse I am always busy running around, I can't just drop everything because they can't wait 5 minutes. They have actually yelled at me on the phone and because of this I have limited the amount of tips I give. Besides this minor detail I definitely recommend this restaurant and thank them for being on time for the most part.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-31", "description": "I pass this place all the time since I live in the 'hood and thought it's about time I tried it!\n\nLoves:\n+ Grilled fish is cooked well\n+ Quesadilla is filling in and of itself\n+ Owner/manager (?) was not trying to oversell me at the counter\n+ Credit cards accepted\n\nFor some fast casual Mexican food, this place certainly checked the box! It's not ~the best I ever had~ (someone cue Drake) but it's a good option around. :)", "author": "Connie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "Just ate the best torta here that I've ever had. I sat next to the door which doesn't close properly and let in lots of cold air but WHO CARES when the food is that good! They also played some killer jams: Squeeze, Big Star, Captain Beefheart. Awesome Possum.", "author": "Rich W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-08", "description": "The food here is good \u0026 the prices are not too expensive. Their burritos are huge \u0026 tasty. Their tacos are very good also. U eat their for lunch from time to time. The service is fast and you can eat in they have a very small eat in area. But over all it's pretty good, I would recommend this place if you in the area.", "author": "Benji D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-03", "description": "Guy at the counter was on his phone, didn't look up. I said \"Hello\", he half-heartedly wrote down my order and then went back to texting... I had my credit card out to pay and he still texted... I said \"Hello? Do I need to pay? What should I do now?\" and he snapped back that I don't need to pay until after I get my food but fiiiiiiiine he'll ring me up now. I could not have been more of a burden on this dude as he searched for the perfect emoji to text whoever. How was I supposed to know the \"rules\"? I was standing there like a normal person doing a normal thing: trying to pay for my food and he disappeared me. He was a snappy emo bro who seemed like he despised the entire situation. His coworker was doing most of the heavy lifting of handing out orders while he texted more, head down. Quesadilla was fine, but the experience left a bad taste in my mouth.", "author": "Anto F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "Lunch specials will save your coins! The girl who takes the orders isn't very pleasant bring your patience because she's short with attitude. I ordered the rice and bean burrito with a soda ($11.38). The burritos are largely portioned for the price you pay. Lacks flavor just add all the sauces on the table. Very filling!", "author": "Uneak H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "They have the worst customer service ever!!! This place deserves no stars....I ordered a steak torta with chips and salsa during lunch and the guy at the counter took down my order and over charged me. Then made a comment \"its only $2.00.\" Really? He eventually refunded me the money. After waiting 15 minutes, they handed me the food in a bag that was stapled. I walked back to my office and there was no chips or salsa inside the bag, just the torta. I ran back to Fatty Daddy and told them that they forgot the chips and salsa. They gave it to me and did not even apologize. Went back to the office, to enjoy my steak torta and realized they gave me chicken instead of steak. I was so pissst...smh\nI took my co-worker, who was her first time there and saw the experience and said that based on the customer service, she won't order food from this place anymore..", "author": "Alex R."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Fatty Daddy Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "152 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ImyLPfRtVQ20CP-1bYp1Fg/ls.jpg", "@type": "Restaurant", "telephone": "+19292959361"}