{"aggregateRating": {"reviewCount": 135, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "Spicy Stewed Chicken Burrito is definitely fat and where's it's at ! We found this gem on our way to domino park. Looking for something good but fulfilling. They were having a special where you can get a burrrito and a soda for around 10 dollars. I was expected a nice burrito and got a great one! The size of the burrito is huge and this burrito was definitely juicy. The cashier was nice and let me know I wouldn't regret getting it. He was right. I loved the option we had to sit by the window and took some of my burrito to go. I definitely recommend you eating here. Oh be aware that the lady taking you're order may be a little rude but don't let her ruin your great experience. I didn't.", "author": "Reid M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "My friend and I got the grilled fish tacos (the sauce was too spicy, but otherwise ok; there was a decent-sized fish in there) and the best cheese quesadilla I've ever had in my life. I don't usually like flour tortillas, but these probably had a good amount of butter in them, so they were flaky and crispy, and remained equally delicious the next day when I had leftovers for breakfast. I don't know what they put in it, but I could probably eat those quesadillas every day.\n\nI'd lived in Southern California for a bit, so ever since then, I've been on a lookout for fish tacos that can rival what I had on the West Coast. I'm still looking.", "author": "Peggy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-11", "description": "Great tacos.  Some of the better I have had on the east coast and definitely the best in the neighborhood", "author": "James L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Nah, these aren't your typical tiny street tacos. These are flour tortillas laden with generous heaps of whatever meat you got. While the flavors weren't out of this world, it was still good. And if you're looking for a quick fix on your taco / burrito cravings, this place will do it right.\n\nWe got the carne asada and pastor and the meat wasn't dry but it definitely wasn't super juicy.  Our friend got the chips with guacamole, and the guacamole was on point too!  The taco's size is large though, and as a result, I was fine with two tacos. Great for those of you that want the most bang for your buck!\n\nOne more thing for you hot sauce heads: They had the green El Yucateco hot sauce, which was a favorite of mine at an old taco joint back in California, so props for that!", "author": "Paul B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "I deftly underestimated Fatty Daddy Taco at first--how hard is it to make a decent taco? Then I experimented with a few of the other taco joints in the neighborhood. NOPE--Fatty Daddy tops them all. \n\nThe unassuming storefront can either deter or encourage you--either way, don't bother going anywhere else to satisfy your taco craving. Fatty Daddy Taco is always delicious, moist, and best bang for your buck in these parts. I always love a good steak quesadilla and fish tacos--and Fatty Daddy has some of the best. Whether I just want a quick meal, or I'm on my way to Trader Joe's on my Sunday errands, I always have time to stop at Fatty Daddy. Definitely keep that good stuff comin'.", "author": "Josephine Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-11", "description": "Ive always walked past this place, and finally decided to go in yesterday. Service was good. Food was eh. Chorizo had little to no flavor. Tasted as if there was no seasoning at all. As much as I wanted to like this place, it's a big no for me.", "author": "Monique J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "Customer service was great and I felt very comfortable dining at this place. The name was obviously what attracted me to dine here. \nThey have a lunch special, but honestly, I don't see a point in it since it's only a couple of cents cheaper than the actual food items, if you purchase them separately. \nI got two fish tacos and a water bottle for $9.75; super pricey!!! But, the flavors and taste are all there!!", "author": "Cynthia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-01", "description": "I ordered cheese quesadilla's and they are made with yellow American cheese????  Not happy at all. Grilled chicken taco's are ok nothing to scream about, mines are better. Will not be ordering from them again", "author": "Paula D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Had a couple of tacos--fish and al pastor. Both were pretty good and service was quick. Cashiers were super nice and they accept cards. Not as good as Burrito Deli, but hey, it's in my neighborhood and is a billion times better than the now-defunct OMG Taco.\n\nI'd go back, definitely. Give me some of that sweet, sweet taco action.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-20", "description": "Good food, but they use way way too much packaging. Instead of wrapping a burrito in a piece of foil and a small paper bag, which I can hold in my hand. it gets a tin foil container with plastic lid, inside a gigantic bag. I don't want to carry my lunch in a huge shopping bag.", "author": "John K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-29", "description": "Ordered Grilled Fish Taco and Spicy Stewed Taco Lunch Special.\n\nThe grilled fish Taco was really well made however the Stewed Chicken was not up to my flavour standard . Had a bit of odd flavouring and smell for sure will not order it again however this place is good for Grilled Fish Taco and might eat here again when in the neighborhood.\n\nSCORE\n\nFlavour: 3\nPresentation: 3\nAuthenticity: 4\nPortions: 4\nCleanliness: 3\nSpeed of Service: 4\nValue for Money: 3", "author": "Umer A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-18", "description": "$4.5 for a non-authentic taco is not worth it. Save your money for the real tacos w/ cilantro and onion.", "author": "Danny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "This is easily my favorite neighborhood Mexican spot. The portions are generous, the guacamole is killer and the delivery is always so quick and it's FREE. I've never been disappointed with anything on their and that is rare for me to say.", "author": "Sterling E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Love the fish tacos \nFreshest ingredients\nDelicious guacamole and really yummy rice and beans", "author": "Tess G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "They forgot my order, weren't that busy. Not the best experience at all for my first time. Got a chicken burrito, nothing special.", "author": "Miles K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Thoroughly enjoy the food here! Great spot to stop in and have a quick dinner or lunch, and people watch while sitting at the windows. \n\nOne of the best fish tacos I've had in a long time. Portabella is also delicious and the al pastor. Employees are extremely pleasant and welcoming - all around a good experience and would highly recommend to folks to check out!", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Amazing unbelievable this location is really good I would give it a six star not like the one on 9th street the rice is fluffy the burrito is made to perfection they really care about how a burrito comes out every time I'm in the neighborhood it's a must for me to stop here", "author": "Yair M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "Used to be, the burritos here were reliably good..and the delivery fast (which is to be expected when you live 6 blocks away). But lately, there have been problems. The last time I ordered, the steak in my burrito was tough and impossible to chew. And the delivery took an hour. And they forgot to include the hot sauce we requested...which made the grisly meat in the burrito even less palatable. Sad to see a good place go down hill..I sincerely hope that's not what's going on here. Very disappointing.", "author": "Brandy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "My friend and I ordered tacos and burrito to share and boy was it good!!  definitely coming back.", "author": "Sally H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Love this place. We only get takeout, but the food is fresh and delicious and the service is great. Highly recommend.", "author": "Les A."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Fatty Daddy Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "152 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ImyLPfRtVQ20CP-1bYp1Fg/ls.jpg", "@type": "Restaurant", "telephone": "+19292959361"}