{"aggregateRating": {"reviewCount": 135, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "If anyone ever asked me what's the best thing I've ever ate, the answer would be simple. Grilled Chicken Torta.  Foodgasmic, its the most delicious,sandwich that I ever had. Thank you. You gotta big fat fan here!", "author": "Carlos C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-10", "description": "This place is ok enough, it's pretty basic. The chips and salsa tasted like they just came from the grocery store and the black beans tasted like they just came out of the can with no seasoning or anything. It wasn't bad, it just tasted like something I could make myself easily at home with ingredients from Trader Joes. With Dos Toros, Buddy's Burritos and Lobo nearby I wouldn't find myself here again. It's pretty small and there isn't anything that exciting to draw me back. Nothing horrible, just nothing standout either. meh.", "author": "Angelique L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Love the fish \u0026 chorizo tacos and the guac is on point.", "author": "Kay E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-07", "description": "As a San Diego native who grew up eating good, inexpensive Mexican food, I was excited to try Fatty Daddy when it opened last year. After several visits, I am writing to say that this place is a big disappointment. The grilled chicken, chicken fajitas, and steak fajitas are all quite dry and make for an almost inedible torta. The 'grilled steak' is nothing like the carne asada I expected, and it is very telling that the most frequently ordered item is a simple cheese quesadilla. Service is chaotic and disorganized (a 'help wanted' sign is permanently affixed to the storefront), and seating is extremely cramped and limited. Ultimately, Fatty Daddy may be the best Mexican option on Smith Street right now, but that's kind of like being the best baseball team in Finland -- it doesn't mean much. AVOID", "author": "Dan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "INCREDIBLE fish tacos! I was with a large group of people from out of state and came here solely because of the Yelp reviews. So glad we did. Everyone loves everything they got! Great vibe and great little hole in the wall place! You'll be glad you came!", "author": "Landon V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Yum! This place is so good. Simple, fresh Mexican food. The portions are huge- so huge sometimes I don't order from here if I'm trying to be portion control conscious. The rice is white basmati type which is a bit odd for Mexican, but honestly it works. Only ordered in from here, but atmosphere seems cute and very casual.  Definitely a must try!", "author": "Jasyn L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-18", "description": "The taco was good but the quesadilla was strictly average. Love the ambience and decor though.", "author": "Nilanjana B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "Had a veggie burrito and got very sick soon after.  That is my main reason for writing this review.  However, even if I had not gotten sick, I would not have returned.  Burrito was just average, nothing great about it.  They charge extra to add guac, and they even charge for sour cream!  A big tub of sour cream must cost them hardly anything, yet they have to charge customers a dollar for a tiny cup.  Anything to make a buck, it seems.  No homemade  salsa like most other places, but they had an assortment of bottled hot sauces.  Big disappointment.", "author": "N N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "Had to tell the guy at the counter my order about 4 times, and he wasn't especially nice about it. I think there were issues with the register or something. Anyway, food itself was fine. I ordered a side of rice and it was just plain white rice, not mexican rice, which is what I had expected. Prices are okay. Considering the prevalence of taco joints like this in the neighborhood (OMG taco, Oaxaca), I wanted it to be excellent or set itself apart in some way.", "author": "Alison G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "I ordered the lunch special which was 2 tacos and a drink for $7.45. Tacos are filling for me personally, but you may need to side. I thought the sides were all a bit expensive. $6 for chips and guacamole and $6 for rice and beans I feel is way too expensive, but I guess it's all about the location. I added guac on both tacos and my bill came out to $10 and change which I thought was a tad ridiculously, especially when the guac was not out of this world and nobody told me they charge for guac per taco. The flavor was good, and the atmosphere was nice. Decor very fun, the the guy at the register was very very sweet. The girl could definitely smile more! All in all, I had a good experience!", "author": "Bree R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "High quality for good price. Had a delish chicken taco for $3.21 including tax. Didn't expect to have fresh guac, piping hot fresh chicken and soft warm tortilla. Really good. Can't wait to try rest of menu.", "author": "Y L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "I was visiting friends in Cobble Hill last night and stopped at Fatty Daddy Taco before heading back into Manhattan. I had the chicken quesadilla, I had to write and let other patrons know it was one of the best quesadilla's I've had in years! The chicken was delicious, it had the just the right amount of cheese. It was cooked to perfection and plated beautifully with the side of guac, salsa and sour cream that I also ordered.", "author": "Anita P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-27", "description": "I was so excited to try fatty daddy but I was sadly let down after trying it. First of all is wasn't cheap, a burrito is close to 9 bucks and guacamole and a small bag of chips was close to 7 dollars (!). The people who worked there were nice however and the guacamole was certainly the star of the show (I think it's the best thing they have there). But the burritos were gross. In particular the long grain white rice had no flavor and just didn't taste right in a burrito. And the burrito was large but only because they put soooo much rice in it. I might as well have ordered a rice burrito bc there was a complete lack of other items in the burrito. All in all, I won't go back as there are so many better burrito options in the area, that are cheaper and have flavor.", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-05", "description": "I really really really wish this place was even OK. It's very close to where I live and I've given it probably half a dozen chances to do anything but suck. It has failed each time. Horrible service. The food is a pathetic attempt at Mexican (or maybe LA?) taqueria fare. Avoid.", "author": "Jeffrey W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-05", "description": "They could use some help with a person who can calculate the bill right and have a better customer service. They got my order mixed up (I ordered 3 chicken taco, five steak taco, 2 fish taco and chips \u0026 salsa but I got 3 chicken, 6 steak, 1 fish taco and fish \u0026 chips instead and they forgot 3 sodas that came with the specials so i went back). i should be the one who should be annoyed with their sloppiness but it ended up they accused me trying to get money out of them! They overcharged my bill by almost $8. The guy at the counter insisted that the amount was right initially and my son got embarrassed and I had my ride waiting so i left but when i went back to pick up sodas that they forgot, i asked how much the order should be and a different person at the counter told me it was around $37. I mentioned to them that I was overcharged and they told me to bring the receipt. When I went back with my receipt, a young woman who seemed to be a manager and was visibly upset (shaking hands), told me that I should have brought their itemized receipt WHICH THEY DIDN'T GIVE! She accused me that I am omitting items that made up to $47! Who in the world would go back two times to try to clarify the bill??? \n\nThis is absolutely appalling customer service. I was one who got overcharged, got my order mixed up and three times, they undermined their customer and accused me for defrauding them. The whole thing robbed me of my appetite and I will never support this shop.", "author": "Y A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "I think the food is delicious but they need to figure another way to deliver burritos. A hot burrito in an aluminum container makes the burrito steam and the wrap soggy. Hopefully they'll read this and look into other options. \n\nHave ordered delivery probably about half a dozen times since you guys opened on Smith. Again, love the food -- it's just the tortilla could use some love in an oven for a few minutes to crisp slightly?", "author": "Andrew G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "WE LOVE THE FISH TACOS!!  Yum.\n\nPeople at the counter vary from super nice to self-important hipster youth.  This is  a Cobble Hill/Boerum Hill taco shop ---be warm and friendly.\n\nAsk to have them with guacamole.  Some of the meat tacos can be dry and need more sauce/crema. The rice/beans with cheese is a nice side dish.\n\nPeople at the counter vary from super nice to self-important hipster youth.  This is  a Cobble Hill/Boerum Hill taco shop ---be warm and friendly.", "author": "MIranda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-29", "description": "I like spicy, and my kids can handle a little bit of heat, but the chicken (not even the stewed) had both of them in tears with their fingers in their mouths. I wouldn't expect a kids burrito to be THAT spicy without some sort of note on the menu. They ate cereal for dinner instead.", "author": "Sarah V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "So bland... tacos had very little flavor and the salsa tasted like ketchup. It tastes like something you'd find at a chain restaurant. Really disappointing.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-28", "description": "This is some of the worst food and service I have ever received at the hands of a human being. I would have rather been served a pile of steaming shit from a baboon barking in my face. This place, without a doubt, is definitively the worst place I have ever eaten (and hopefully will ever eat).", "author": "Matthew S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Fatty Daddy Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "152 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ImyLPfRtVQ20CP-1bYp1Fg/ls.jpg", "@type": "Restaurant", "telephone": "+19292959361"}