{"aggregateRating": {"reviewCount": 135, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "A-freakingmazing lol food is delish! Great portion. Definitely order again. Love love the al pastor and grilled chicken taco.", "author": "Edlyn V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "At long last! I've been to the Fatty Daddy in Park Slope but have been waiting forever for a great taco joint to open closer to me. Very similar idea, and they nail it. I've already had the steak tacos and the spicy stewed chicken burrito -- both top-notch -- and my kids have devoured the al pastor tacos and chicken quesadilla. And they are tough customers, let me tell you...\n\nWe've taken out, and eaten there -- both times food came quickly and service was great. These are folks who love what they do and it shows. Really happy they're here.", "author": "Stacy B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-07", "description": "Please get tacos somewhere else! The carne asada is not that great and I would say it's pretty mediocre compared to other places I've been.", "author": "Rocío M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-10", "description": "New to the area and was looking for a reliable Mexican spot. Probably would have given 3.5-4 stars based on my initial meal, but my left overs grossed me out. I ordered two chicken quesadillas, a side of chips and a side of spicy salsa. When it first was delivered, it was a pretty large portion and the chips and salsa were great. The salsa was pretty spicy so if you don't like spicy, you should get regular heat. The quesadillas tasted good, nothing amazing, but good solid quesadilla. When I went to eat my leftovers the next day, I bit into a HUGE piece of bone. The bone was probably the length of my pinky finger. It grossed me out and I couldn't finish the rest of my leftovers after that. I don't want to have to worry about having bones in my chicken so I'm not sure if I would order from here again :-( Maybe I will stay away from anything that may potentially have bones in it because the prices were reasonable and the portions were big.", "author": "Isabella S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "It is a good taco. Is it amazing? No it is not. Will you get a smile? Definitely. They make good tacos here. And for Brooklyn they are good. For California, they would be ok. I actually liked here the grilled fish tacos. First time I prefer it over the steak or the chicken. Flour tortilla is a must, and a touch of spice and lemon. I think I will come back if I will be in the area.", "author": "Maike B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-05", "description": "Fast delivery of a tepid burrito.\nI'll file this one under 'mixed emotions'. \n¯\\_(ツ)_/¯", "author": "D Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Best fish tacos! Fresh and flavor is always consistent. Staff is very nice. Location is small but cute. Recommend!", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-02", "description": "PSA: Wypipo stop recommending Mexican grub spots\nFatty Daddy Taco is not Mexican food. Had it yesterday and it was the most bland, dry, unauthentic \"burrito\" ever. Salt was the only seasoning they used. The pico de gallo was just plain lettuce and tomato. \n\nThe spicy stew chicken was NOT spicy at all or even stew chicken SMH", "author": "Demi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "Good food but I hate that they don't have a bathroom and encourage you to use Starbucks bathroom :( I love the rice \u0026 beans with cheese, fish tacos and quesadillas. They have a decent lunch special. Would definitely come more if they were more dining in friendly- I don't particularly like Mexican food take out. Overall a great place for a quick taco", "author": "Rose M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-06", "description": "WORST RESTAURANT ON SMITH STREET \n\nHow are these guys even still open? First of all, my food took 30 minutes to come out, and when it finally did, I had to send it back because they got my order wrong. 45 minutes later, my food is not out. I wait 13 more minutes, and my food comes out. The tortilla tasted so bland and stale that I might have guessed it was cardboard if I had a blindfold on. When I tasted the chicken, it was so chewy and rubbery that I couldn't even chew it. And there was bones in it! Possibly the worst eating experience of my life. ONLY ONE STAR!!", "author": "Jj T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "I usually go to the Fatty Daddy's on 9th street, but I was having a  bar crawl with some friends and we were in this area and I know that this place never disappoints.  It's the perfect spot for good, fast mexican food, priced well with great service.  I got the chips and guac for the first time, and they were AWESOME. The chips were crispy and salty, just how I like them.  It's a good thing this place is a little bit of a walk from me, or else I'd be here every single day.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-26", "description": "When I heard the owners of Layla jones pizza was opening a taco place on Smith St. I was interested, since LJones pizza is very good. But their attempt at Mexican was bit average, not bad, not great. \n\nI had a $8 Rice/bean burrito, which was very basic, and a $4 Fish taco which lack flavor (in fact the doubled corn tortilla was the strongest flavor). \n\nOne clue that reminded me that they weren't too authentic was that didn't sell Horchata (google it, it's awesome).", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "Pretty good tacos! I have gotten the portabella mushroom tacos and the quesadillas here and both are pretty good! Nothing too fancy but they hit the spot. They're guacamole is really delicious! The rice and beans tend to be a little dry but are pretty good. I wish you could choose brown rice. My friend got the fish tacos and she loved them. This is a great spot to order from. Delivery is usually pretty fast. Prices are very reasonable.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Nice and tender carnitas taco. Very quick and efficient service and great turnaround for a quick lunch. The guac was nothing to write home about but the fish and carnitas tacos were great.", "author": "nina s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-22", "description": "I'm sorry to write a negative review (and I wanted to give it one star, but can't bear being that harsh), but I feel that this sort of utter mediocrity needs to stop in Boerum Hill.  I understand Fatty Daddy is owned by Layla Jones, a great place and neighborhood institution that I have loved for 10 years, which makes it all the more sad to say how much I disliked this.   \n\nIt's not so much that the food quality horrible, its that it obvious the owners are devoid of ANY effort in making an attempt to understand what Mexican food is about before they opportunistically took this location (which once was a decent bar).   I get the feeling that they thought \"hey, people like Mexican food...It seems easy and we can make some money.\" \n\nI've been a few times, just to see if I'd see some signs of effort, but each time the food was painfully thoughtless.  My first meal there kinda summed it up.  My burrito consisted of some super bland, cold-ish Chorizo, plain BASMATI rice (huh?), some chopped tomato, some chopped romaine lettuce, and the most sorry black beans ever that had absolutely no flavor and tasted as if they were sprinkled in right from the Goya tin.  Surrounding this lifeless innards was a massive tortilla that was not even given a touch of heat...again, tasted right from the package. \n\nIs it really that hard to learn how rice is prepared in a Mexican food tradition, is taking the time to cook and flavor beans?  (only black beans on offer, FYI, not pinot beans as would seem a logical addition)\n\nNo, I didn't get poisoned, and its not the end of the world, but its a very sad state of affairs when such effortless food is being offered.  \n\nMaybe people don't care and are happy to spend money for this, but Mexican food is an amazing, glorious, and flavorful thing  -  I'd love it for Fatty Daddy to bother to learn what it's actually all about.  It's not too late!  That rent can't be cheap, and with this level of food, it's not going to last without improvements.", "author": "Asparagus t."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "Recently ordered take-out and got their fish tacos. Delicious and big enough that I was full with just two. The chipotle sauce they use on the tacos was amazing. Wish they delivered to my location. Will be back to try more dishes.", "author": "shana l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Excellent tacos in the neighborhood! Two tacos is filling enough for a meal. Steak tacos without lettuce is the best thing on the menu!", "author": "Miriam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "This place is still awesome. \n\nJust keep in mind: if you're in a hurry the burritos come out very quickly but tacos can take a while, - especially the fish tacos. The fish tacos are fresh and crispy and very worth it if you don't mind the long wait (15-20 minutes).", "author": "Sam Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "A friend and I just had tacos and burritos from here, and they were wonderful! Fresh, flavorful, and made with excellent presentation, even for takeout. Very cool space and pleasant service!", "author": "Yetunde E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Stopped in for fish and chicken tacos.  They were quick and delicious.  Great flavors, lime, cabbage and the meat was well marinated.", "author": "Chris H."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Fatty Daddy Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "152 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ImyLPfRtVQ20CP-1bYp1Fg/ls.jpg", "@type": "Restaurant", "telephone": "+19292959361"}