{"aggregateRating": {"reviewCount": 135, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "5 stars because I have been 3x and different reasons.  1. Lunch. Yummy quick and fresh. 2. Kid wanted Mexican food. I said I'm not bringing Chipotle to babysitting. Try this. Success and 3. Lots of hungry kids home. Fast and fresh and delicious. \n\nIn Brooklyn you rarely get 1 of 3 of these. No wonder other places are dropping like flies. This place is a winner. We will be back and back and order and order.", "author": "Kate S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-12", "description": "Update: This place has gone downhill since my first review. I can only assume the owner handed the operations over to a Burger King manager. The food has gotten downright nasty at times and the staff (which is constantly turning over) is disinterested and somewhat rude at times. No longer worth a visit -- too many better options in the area. \n\nMmmmmm. The chicken quesadilla has the perfect amount of spice and flavor and big chicken chunks to feed both me and my son. The staff is always friendly and the food comes quick. Thank you Fatty Daddy!", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "I was on my way to rite aid and I was Really in the mood for something quick and then I saw the sign and I couldn't resist I love Mexican food so I figured I give it a shot very decent prices quick and friendly service definitely coming back here the chicken bowl was amazeballs! But I can't give it 5 stars because the amount of chicken they put in my eyes wasn't worth 5 stars but the food was good.", "author": "Allen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Oh what's not to like! Great taco. Chill atmosphere. Fair prices and nice staff. I like both their tacos and burritos. Go with tacos if you want more variety, and have a burrito when you just want to fall into a food coma afterwards. Admit it, you have those days too. :) \n\nMy favorite here is the steak. Steak tacos, steak burritos. Both amazing. Be sure to grab extra hot sauce if you are doing takeout. They would ask if you wanted any hot sauce and then only give you one pack per taco. It's not their fault really. Apparently there are humans among us who wouldn't have hot sauce with their tacos. I was shocked and lost for speech when I heard it. Anyway, because of that, if you are a hot sauce fan like me, just ask for extras. \n\nBack to the food. Everything is great about it. Fresh. Delicious. Be sure to squeeze that lime juice on your tacos. It  perks up the flavors and rounds out the flavors nicely. Excellent joint. The best in the hood of its kind. You'll love it.", "author": "Xin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "I've eaten at a number of burrito places since my original review of Fatty Daddy (Smith Street location) and I always find myself saying the same thing after eating someone else's burrito: Fatty Daddy's is better. I stick to the 9th Street location, though ;)", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "I had the chorizo bowl.  Best bowl I ever had.  Truly awesome.  Next visit the portobello bowl.  Yummy! Thumbs up x 10!!!", "author": "Vilma T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "The food was amazing. I never had a quesadilla like this one in a long while. The quesadilla was quite filling and i'm 6'2, 230lbs, and I was full. It tasted out of this world. I can only imagine how the other food would taste, but i'm going back for the quesadilla again.", "author": "Tyrone W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "The steak burrito is amazing it was my first time and they made a great first impression the steak amazingly tender, which shows the quality of the meat, the burrito was huge and the price was good. I eagerly anticipate returning soon.", "author": "Miikeila H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "Great service and atmosphere. The food was delicious, inexpensive and you'll definitely have leftovers. Steak burrito, al pastor and the portabello burrito were all enjoyed by our group. Happy to have fast Mexican again on Smith street.", "author": "Jay H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "This place was actually pretty tasty! I mean it's not Chipotle, but let's be honest, nothing beats Chipotle!!! HUGE portions, well seasoned and sweet and accommodating staff. The wait was kinda long and I wish they had tabasco, but other than that we were pretty satisfied!", "author": "Kisha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Such a great find! Got the guac, steak quesadilla, and fish and steak tacos and all were really good. Reasonable prices and legit food will definitely be returning.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Hands down the BEST guacamole and Vegetarian Tortilla Soup ever.", "author": "Simone P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "Fatty Daddy is so delicious! I love to pick up from here and my order is always ready in no time. The chicken tacos are so yummy and inexpensive, all the ingredients always taste so fresh. Love the double layered corn tortillas :)", "author": "Gabriela D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Good prices, better food. A few small tables. I had the fish burrito. Nice array of hot sauces to choose from. Appreciated the eco friendly reusable silverware, wish more restaurants would do that. Lots of Mexican options in the area but this one was just right. Also tried the steak burrito bowl and that tasted amazing as well. Would definitely recommend this place. I'll be back.", "author": "Simon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "I couldn't make sense to how or why their food tasted so damn good. I got the chicken torta and it was the best $8 I've ever spent.", "author": "Sertac A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-05", "description": "I try not to gush too much on reviews. As in my opinion it shows a lack of refined tonality and taste when it comes to good eating. I have tried this new taco joint on Smith Street, and will hold off on further comments till I've had a few turns at the wheel. I will say, they make a nice guac and the beans are seasoned, a rarity in these cut rate Mex restaurants that typically cheapen the cuisine to the basest common denominator and expect the populace to feed on their trash.", "author": "Gif A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-15", "description": "I had the chicken tacos, didn't blow me away. It's fresh that's a plus. They move a little slow for me.", "author": "Isaiah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "After hanging out in Manhattan for the day, we wanted to have dinner in Brooklyn. We decided to try this place after Yelping the area. This is a pretty cute place. We decided to share 4 tacos between the 3 of us. We ordered Chorizo taco, grilled fish taco, grill portobello taco and picadillo taco. Daughter thought that the picadillo and chorizo tacos were spicy but loved it and thought it was great. The fish and portobello tacos were great as well. We also ordered chips and guacamole and loved it. Chips were multigrain and seemed like it was freshly fried because the tacos were also the same consistency. I love this place because there was a sign that encourages customers to ask about possible allergens in the food. Daughter's allergic to peanuts and the owner reassured us that there weren't any peanut ingredients in their food. Service was very friendly. Will definitely return to try other items on the menu!", "author": "L W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-27", "description": "The burrito bowls are great...so are their burritos. These are the only two items that I've had with 4 orders/purchases. Fresh food, tasty, well priced, and large enough to split into two meals, etc. However, I must say David O., the owner/or manager, I'm not sure, is a very unpleasant person. My last visit there sealed the deal. I will not be returning due to his demeanor and curt attitude. Acts as if customers are trying to get something for less/nothing.  He is rude. He is thankless to most customers.  He brings the overall experience down a notch or two. Otherwise, I'd give this place a higher star rating. Only way to deal with such things is to bring your business elsewhere. Ah well.  I know  others who are not returning due to similar experiences. There are so many choices along Smith and Court Street you'd think they'd appreciate their customers more.", "author": "J D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "Well... My husband is a full blown Mexicano and absolutely loves this spot!! Born and raised in Carroll Gardens, this 2nd business is most definitely welcomed :)", "author": "Brooklynite L."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Fatty Daddy Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "152 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ImyLPfRtVQ20CP-1bYp1Fg/ls.jpg", "@type": "Restaurant", "telephone": "+19292959361"}