{"aggregateRating": {"reviewCount": 135, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "best tacos i've had in ny! \n¡delicioso!", "author": "Stacey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "I had the Mexican chopped salad with chicken. It is what you would expect from a fast food Mexican place. Also had the guacamole with chips and was good. I would recommend this place if you are looking for take out.", "author": "Guliz U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "The food was sooo delicious and full of flavor. I had a grilled chicken burrito and my wife had the grilled chicken burrito bowl w/sour cream...Loved it!", "author": "Bobby H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-15", "description": "Pretty mediocre. Fish burrito is $10 (!) and was decent. Steak taco was decent. Spicy stewed chicken taco was bland. Chips were $4 but huge. At least the tacos were large, but this place is expensive for being bland.", "author": "Wook M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "Ate here for the first time last night. Honestly the best burrito that I'd ever had. I'm never going to chipotle again. 4/5 because I wish the food got to us a little faster", "author": "Andria N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "Whoa, that double meat steak burrito that my friend Rupert (name changed for anonymity, you know how it is) accidentally seamless'ed to my apartment, that was delicious!", "author": "Justin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-04", "description": "I'm really upset, my friend and I came in and got the same order and my burrito was so small, yet her's was huge! Idk it just feels inconsistent. The orders were given back to back.", "author": "Steph O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Whenever I come into the city I stop to enjoy their wonderful selection at their other location. Now they have a location that is close to where my family resides. The food is just as good and the service is impeccable. I highly recommend the grilled chicken quesadilla.", "author": "Glenn S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-24", "description": "Mediocre at best.  I had 3 different tacos and the rice and beans nothing stood out or distinguished itself at all.  OMG had much better food but It looks like Fat Daddy drove them out of business too bad.  Guess I will need to shop around for a new taco place.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "I am a huge Mexican food fan! And this place has it done the best way possible! Food is on point! I had a burrito!!  And the staff is cool too, friendly people. Enviroment is also a cool, relaxed place. Nice and chill. I highly recommend this place!", "author": "Gil D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-24", "description": "This place is Way overrated. Lived in Cali and been to Mexico many times. I'm not saying I'm and expert but food is just OK. Oaxaca is worse... I don't even think they grill the meat on the premises. Best place by far is Bodega  type place Fast \u0026 Fresh Burrito on Hoyt at Atlantic. It's real mexicans making real mexican food. It has an authentic backyard area in the summer.  I do wish the other 2 places would up their game.", "author": "jay b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "Excellent tacos, better than most Manhattan restaurants. Fresh ingredients and worth 1.50 for the guacamole.   The Vegetarian Tortilla soup could use a few veggies: tomatoes, etc.", "author": "Consumer M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "Get it for lunch so often i wanted to rate them. Pretty good taco joint. Tacos are on point!", "author": "Dan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "Super tasty, the fish and beef tacos especially. Just wish the tortillas were slightly grilled or something.", "author": "Liz V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "I love this place! My kids and I order from here ALL the time. The restaurant is adorable, clean and organized. The delivery is always on time and fresh! Make sure to try the fish tacos, grilled steak burrito and Babe's Rice \u0026 Beans with cheese. Just writing this makes my mouth water...go you'll be happy you did!", "author": "Ilisa C."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Fatty Daddy Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "152 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ImyLPfRtVQ20CP-1bYp1Fg/ls.jpg", "@type": "Restaurant", "telephone": "+19292959361"}