{"aggregateRating": {"reviewCount": 135, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "On a rainy night, there is nothing better than stopping in to Fatty Daddy for my favorite Mexican food.  I opted for the chicken burrito while my wife went with the fish tacos, nothing like sharing.  The staff is always friendly and adds to the experience.\n\nWe will be back soon !", "author": "Andrew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Usually when I visit a taco place I'm pretty indifferent about their food. Usually it's pretty much similar tasting and I can't even remember the last time I had exceptional food from a place similar to this.\n\nThis was that one exceptional place. I had a steak burrito and my friend ordered 3 different tacos. The burrito was GIGANTIC. I don't even know how they rolled that thing up. It wasn't just the size that impressed me, it was really the flavors that I was blown away by. The tacos were just on point, especially the fish taco. The chips and guac were no different. Definitely top 3 guacs I've ever had. \n\nSuper fast service, friendly and welcoming staff. Absolutely recommend this place to others and I will continue to revisit.", "author": "Ian G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "I've only ever tried the Fish Tacos at Fatty Daddy and that is likely the way it will stay.  A fish taco needs three simple things to pass the taco test:  be grilled (never fried), solid sauce and a flavorful taco shell.  I've had at least 50 of these fuckers and have enjoyed every bite.  \n\nI also enjoy the music they play, which does not affect the rating but is worth noting.", "author": "Adam H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-23", "description": "I ordered three burrito steak bowls for my family, it was so salty it's inedible. I threw it out and left, I don't want my family's sodium level to sky rocket", "author": "Tiffany M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Honestly, I'm confused why this place is rated less than 4 stars! When I'm craving fish tacos (weekly basis), this is my go to spot. Two tacos come out to $9 and some change which isn't the cheapest but also not the worst considering I definitely get full off of it.\n\nThe fish tacos come on two soft corn tortillas. The fish is seasoned and pan fried. On top they put on crunchy cabbage, radishes and this flipping delicious red creamy sauce that probably adds 300 calories to the meal, but I'm okay with it because it tastes so good. I always get this to go and they serve a couple of lime slices on the side and some Cholula hot sauce packets.\n\nFood is made to order and comes out fast. As a former San Diego gal, I think this is the closest I get to the San Diego fish tacos I used to eat every Tuesday. Come here and you will definitely get  your taco fix!!", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "This place is my favorite taco spot. Let me tell you why. The tacos are very flavorful and they have a good selection of tacos like, beef, shrimp, chicken. (Can't find shrimp everywhere, don't know why). The prices are fair and the portions are good too. I got beef and chicken tacos and the guacamole and chips. Ugh! Such crack!", "author": "Salma H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "Fat Daddy can make me a taco anytime!\nCame here for the lunch special (they have several but I chose two tacos and a drink) and split some chips and salsa.  \nEverything was more or less Baja style, no mole or tomatillo with more fresh herbs and ingredients and less sauce, which is my fav! \nGood Mexican in the NYC area, or possibly even tri-state, is hard to come by-I'm glad I can walk to this location!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "Sooooo Delicious every time I get food here\nMy favorite grilled fish Torta and there vegetable tortilla soup Yummy", "author": "Jacqueline M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-10", "description": "The burritos here are well worth the price but the taste is just average. I got the grilled steak burrito and the best way to describe it, like others have already stated, is like the size (and weight) of a brick. It was almost 9pm and I was starving but I wasn't able to finish the whole thing because it was such a big portion. However, I also got bored of the taste of it about halfway through. It was really bland because there was no sauce and had very little cheese in it. Had to add some of their hot sauce just to give it some flavor. Another thing: we placed our order for pickup online via seamless and got a confirmation from the site but when we arrived at the restaurant 30 mins later they said that the order wasn't ready yet?? I'm going to give them the benefit of the doubt and say that there was a glitch with the system but 30+ mins for a 6-item order for pickup at 9pm is kind of ridiculous.", "author": "Kevin E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Quesadilla was fantastic!! Was in the neighborhood looking for something new to try. And this small shop caught my eyes.\nFresh chicken quesadilla was so hot that I almost dropped the 2nd half even though I spent more than 7 minutes on the first half already. The part has less stuffing was crunchy, and the opposite was so cheesy good. Some salsa on the side for refreshment between bites.\nShould ask for adding some jalapeño inside next time.", "author": "Nathan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-27", "description": "Amazing food. Rude-as-hell service. REALLY unnecessary. The shit always comes from the top - someone needs some therapy methinks", "author": "Richard C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "This place is so good. Fish tacos \u0026 al pastor all day every day. I've lived in the neighborhood for 3 weeks and have been here 5 times. It's a great price point, and the tacos are flavorful and fresh. Great for a quick bite and the casual ambiance with open windows makes it nice to eat there or opt for take away. Thank you Fatty Daddy!", "author": "Allison P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Came on a Sunday night. Delish vegan rice and bean burrito, chips and guac, a fish taco for my friend for under $30. Friendly counter service, they bring the food to your table. We snuck in a few beers, too.", "author": "David G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-25", "description": "Fatty Daddy\nNY: BK: Cobble Hill\n2pm Sunday 23rd April 2016\nThree and Half Stars\n\nI have been to the Park Slope location and it was unbelievably delicious.  This new location was good but not at the same level. The place is cool looking. The wait staff was friendly. There is enough seating for a dozen people. I ordered three Tacos: Al Pastor, Carne Asada, and Chorizo. The food took a little bit but not too bad.  The Al Pastor was tasty, but the meat lacked in a deep nuanced flavor.  The Carne Asada was again cooked well but again didn't strike my tongue with anything special. The chorizo was crumbly, quasi cold, and not very appetizing.  Its weird that all three of my tacos had the same lettuce and bland green salsa.  I think I will just go back to the other location.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "I order Fatty Daddy all the time and am never disappointed. The tacos are amazing (steak and fish are my favorite), and I love the burrito bowl. Their salads are also top-notch. The people who work there are also super nice and very accommodating.", "author": "Blair B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "The tacos are dope. I highly recommend the grilled fish taco, and eat it last cause it's the best. I also got an al pastor, which was great. Four stars cause seating is limited and no cerveza, but would def recommend to a friend and go again!", "author": "Roxanne J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-03", "description": "Have gotten takeout a few times from here and the food is always amazing with succulent meats. I'm normally not a big quesadilla fan but their chicken one is superb. Only complaint is one time I was kept waiting as they forgot to call my order for a good half hour.", "author": "Turandot Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "I love pretty much everything in the menu. This the second fatty daddy taco location to open in Brooklyn. The original is in park slope and I  can tell you this place will not disappoint.\nThese folks bring that California Mexican style to New York  with incredible taste and heat to make you come back for more. I'm a huge fan of the fish tacos and the chicken burrito.", "author": "Edgar B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Food was very delicious, and service was good! We didn't have a long wait!\nOrdered and devoured Chips /Salsa, grilled fish taco, grilled steak taco, picadillo burrito, grilled steak bowl spicy stew chicken bowl and one kid's grilled chicken taco!! Very yummy and good value!! Will definitely visit again!!", "author": "A L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "I was so impressed by this burrito! Delivery was early and the burrito was bomb. I got the grilled Picadillo filling and it was so tasty and properly spread throughout the entirety of the tortilla. They have FREE DELIVERY and a min. order of $8!!! You can't beat that. The lunch special came with the burrito and a soda, I'll definitely be ordering again.", "author": "Chelsea S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Fatty Daddy Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "152 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ImyLPfRtVQ20CP-1bYp1Fg/ls.jpg", "@type": "Restaurant", "telephone": "+19292959361"}