{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-04", "description": "Good selection of sandwiches, salads, pasta salad, made-to-order sandwiches, breakfast sandwiches, etc. Good desserts...I like the strawberry shortcake. Friendly staff. The only problem I have with this place is the price. If they brought everything down by 50 cents to $1 it would be awesome....", "author": "John H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "Seemed a little overpriced, therefore only 4 stars. Their signature sandwiches ranged from 6.95 to ~9.00.\n\nGet something with roast turkey in it. I just got the cranberry park, and it was possibly the best turkey I've ever had.", "author": "S K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-02", "description": "oh.my.god.  so my apt was a half block from l\u0026h.  i didn't cook back then so thank christ for this place.  i'd stumble home exhausted from work (or stumble home exhausted from bourbon) and pick up the essentials:  sliced fresh pineapple, something from ben \u0026 jerrys, honey nut cheerios.   they also make solidly delicious sandwiches for those days you can't ignore the siren song of the promenade.\n\n(baked goods?  yes please.  also divine!)", "author": "Nic F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-11", "description": "I use Lassen and Hennings frequently for catering. Their staff is always helpful and courteous. Tamika and Rebeka are always very professional and a delight to work with. Deliveries have been consistently on time. The food always looks amazing and is always fresh. I never have to worry about the quality when I order from them. I can also be confident that what ever I order, it will taste amazing. So far we've ordered continental breakfasts, fruit and cookie platters, orzo salad, sandwiches and wraps - all perfect! The team here looks forward to meetings because of Lassen \u0026 Hennigs.", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-13", "description": "Got catering from this place for a house party of 30 guests.  Delivery was prompt and the packaging was perfect.  Nothing was missed in the order except the tarter sauce for the crap cakes.  We got the presidential buffet which was a remarkably good deal at $18/head and a lot of variety/options.  The food was just okay, nothing to write home about, and pretty much in line with what we expected for stuff made it bulk - some things were too salty or overcooked.  That being said, it was plentiful and thus no one went home hungry.  Seems like the guests were satisfied, or they just didn't want to complain.  My review is that the food was not bad but not great.  I suppose you pay for what you get!", "author": "Anna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-14", "description": "Not having tried anything but their incredible cupcakes, I don't feel like I can give a full 5/5.  However, their red velvet cupcakes are absolutely incredible.  I got a few minis in addition to the full size ones just so I can nosh.  And just so I didn't keep a narrow view, I got a few oreo vanilla cupcakes as well.  Can't say enough about how great the cupcakes are, and I have tried more than a few cupcake places.  Stop in and get a cupcake.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-05", "description": "Lassen and Hennings is a gracious cheap date night spot. On a nice evening, go to this ordinary looking deli with extraordinary food. The Thanksgiving Day sandwich (I think it has a different name, but you get the point: turkey, stuffing, cranberry sauce) is the best sandwich out there. I die and am reborn every time I eat it. Get your food, pick up an iced tea, get something from the bakery section (the cheesecakes are surprisingly good), and head down to the Brooklyn promenade. Find an empty bench for you and your date, enjoy your delicious food as you watch the sunset over downtown Manhattan and the Statue of Liberty.", "author": "Yianni G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-26", "description": "As a vegetarian, I'm a big fan of the tabouleh and hummus wrap. Their prices can be a little bit high, but I really think its reasonable for the quality. I'm not a fan of bakery items usually, but theirs look really awesome. I've heard the red velvet cupcakes are the best ever.", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-10", "description": "once upon a time in a strange land called brooklyn heights, i ventured into a storybook village deli to buy sweet provisions for the weary knights of the unlucky table. it was a tidy place and the strawberries on the strawberry cream cake sparkled like a sweet sunny day in the meadow yonder. the bread pudding reminded me of a vermeer and all that was missing was a kind maiden to pour a glass of cider.\nthen a gloomy cloud settled over the apathetic countenance of the counterproductive counterman. i inquired about the bread pudding that was neatly ensconced in a cellophane wrapper with the following label:\nLASSEN \u0026 HENNINGS\nBread Pudding\nSELL BY : 11/21/09\nQNT/QTY       UNIT PRICE   TOTAL PRICE\n     1                 $1.50                 $1.50\ninnocently, i asked if it was plain bread pudding, ( the middle unlucky has life threatening allergies), and there were NO ingredients listed, which in a bakery/ deli is not surprising, however, his response to my question was simply unacceptable. \"i don't know, i don't make them.\"\n(please refer to the above label)\nif it has your name on it, and you sell it, it would behoove you to know.\nDUH! DUH! DUH!\nstill i purchased the bread pudding, et al. and the cashier was very nice.\ncake 4 stars\nsparkling charming little store 5 stars\ncinnamon \"lady fingers\" were burly and twinkie shaped-not lady-like at all and tasted like a drake's cake 2.5 stars\nbread pudding 3.5 stars and those w/ allergies beware NUT ALERT!\ncounterproductive man 0, ZERO, no stars.", "author": "bridget e."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "The picture of the black and white cookie got me interested, so I stopped by Lassen \u0026 Hennings recently. It was very good. I not only got a cookie but also a pretty good turkey sandwich. The bread tasted fresh, which I always thought was the most important part of a good sandwich. The pickle was crispy and they piled on the meat. Mmm!", "author": "Carol M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-09", "description": "i first heard of this place from my coworker when she came in with RED VELVET cupcakes from this spot. let me tell you, these are hands down the best red velvet cupcakes ever. i ONLY get red velvets here because they are moist and the cream cheese frosting is made just the right way. my birthday cake as well as my sister's came from lassen and hennigs. no need to guess the flavor of the cake--- yes it was red velvet for both. recently, i had their green velvet cake that they made in honor of the jets playing one weekend, TO DIE FOR!!!! i love these red velvets!!!! please teach me how to make them!", "author": "Linda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-11", "description": "While I can see their grab and go pre-prepared food selection is a little overpriced, their sandwiches are totally reasonable and absolutely delicious. And they have the best cannoli in the vicinity, hands down!", "author": "caitlin o."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Lassen \u0026 Hennigs", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SYmX40mrZcjorGyNEQByWw/ls.jpg", "@type": "Restaurant", "telephone": "+17188756272"}