{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "Amazing baked goods, cakes, and treats! Good prepared foods and solid coffee. The owner I've seen is always scowling and speaking brusquely to his employees, which is why I can't give 5 stars. Otherwise, a great neighborhood spot!", "author": "Emily G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "I was on my way to the park and ran across this deli which was perfect since I needed to grab some lunch. I was having a difficult time deciding since there are so many options. The gentleman at the counter gave me some suggestions but I ended up with the Caprese sandwhich with roasted peppers. It was good but not amazing, I should probably chose one of the more popular sandwiches.  They have an amazing assortment of cakes also and various prepared salads. I looked for potato salad but didn't see any. That was a bummer because I was in the mood for some NY potato salad. \n\nA great place to grab some lunch and sit in the park and eat.", "author": "Dorene M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Lansen and Hennings is a deli and then it's a little more. They offer healthy lunch options ranging from salads with a ton of options for toppings to sandwiches, wraps and ready to eat hot food. Everything is made the moment you order it so it's not left sitting out or soggy. The place is clean and sanitary looking, the shelves are always stocked and appearances are up kept. There's also a huge desert section with different types of Italian cookies, cakes and pastries. If you're looking for a drink to have with your lunch try the ginger lemonade; it's really good but you must love ginger; who doesn't love ginger lol.", "author": "Justin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "if you fancy a quick sandwich made from fresh ingredients, look no further than lassen and hennigs. I usually opt for one of their chicken salad wraps, but tried the DUMBO wrap during my most recent visit. Chicken and mango- what a tasty meal! Although I find lassen and bennigs to be a tad pricey (~$8), it's nice to have a reliable quick meal in the area.", "author": "Steph G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-08", "description": "I came here every weekend to get bagels and coffee, I think the bagels here are the best in Brooklyn Heights, the rest of the deli food is OK, the cakes are pretty good but its the bagels that kept me going back.  \n\nOn more than one occasion I have hard the manager be rude and aggressive to the staff there.  This weekend I was shocked by how nasty, aggressive and mean the manager was to the staff, shouting and throwing things in the kitchen so I have deiced to get my bagels elsewhere now, I can't give my money each week to someone that is that horrible to staff, really not necessary.", "author": "Erin F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "Recently bought a coconut custard pie from here to serve at a dinner party. It was way too eggy and the texture was comparable to a Japanese omelet. It honestly tasted like someone had made a quiche and added sugar instead of salt. None of my guests finished their slice and I was so embarrassed.", "author": "Sevi K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Bought a strawberry short cake for my moms birthday here a last minute buy and she said it was great.\n\nGood for moms .\n\nThat's a plus in my book", "author": "Anika G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-14", "description": "An absolute joke and quite possibly the worst establishment I've ever encountered. The staff was unresponsive, rude, and their $9.50 turkey sandwiches (after tax) are the size of my fist. And they used a sliced CROISSANT as bread! It couldn't hold the turkey at all. Dude's don't know what they're doing back there. \n\nThe restaurants and delis in BK Heights are ALL grossly overpriced for the crap they sell. Lassen \u0026 Hennigs is THE WORST possible place to walk in to. Literally, a living HELL. Go to Blimpie or Subway instead. \n\nUnless you want to break the band on a 5-bite sandwich, avoid this place at all costs.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "I go there with my dad a lot.  It is an old place but it's awesome.  They really cover my sweet tooth, with lots of cupcakes and cookies to choose from.  The sandwiches are pure goodness as well.", "author": "Reed M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "We're on vacation and stumbled on this gem. Fresh baked good, sandwiches, salads, and lots of drinks and fresh foods to go. There's no place to sit but it's a short walk to anywhere to sit and watch the world go by.  It definitely feels like a NYC kind of place. Great find.", "author": "Hilary H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-28", "description": "The Lassen \u0026 Hennigs egg \u0026 cheese is the best breakfast sandwich in the neighborhood. I don't know why they make it better than any other deli around but the egg is soft and not overcooked while the cheese is just melted enough without being too gooey. I lean towards the turkey sausage for the meat if I get one but the bacon and ham are both fine as well. You can tell the deli man that you want salt and pepper when you order, but 9 times out of 10 he'll ask you again anyway.\n\nThe lunch sandwiches are adequate, if a bit pricey. The macaroni salad and a few other deli counter items are very nice as well, but overall L\u0026H is the kind of place where you find a couple of things that they do very well and you go there just for those things. For me, that's usually a breakfast sandwich and either an iced coffee or an Arnold Palmer from the self-serve iced tea and lemonade. The iced cappuccino can be very good most of the time but oddly bitter at times so I've been sticking to my own iced coffee concoction lately.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-05", "description": "Stop paying so much for ok cake in fancy boxes.  Their red velvet is so good, rich and creamy, you will want to slap your mama.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-08", "description": "Brought a small salad and 4 very small bite size pastries for $17;  please, get a grip and give me a freaking break. Smh. Complete waste. Dessert was below average and nothing to rant and rave about. The salad, ehhhh,  wish i would have stuck with Subway across the street. \n\nCashier was a nice girl and the place is clean. Thats all I got on them.", "author": "Mo D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Best cakes you can get! Fresh, delicious, and beautiful. I buy all my cakes from here. The strawberry short and red velvet is the way to go. Their cakes are always consistent and service is great. Really amazing cakes and staff.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-30", "description": "I love their Chicken Noodle Soup. They have a special soup and half a sandwich. Awesome! The Red Velvet Cupcakes are too die for. The frosting is made from rich cream cheese and the cake is super moist.  Its a semi sad day when I can't get to them for their chicken noodle soup. I usually purchase on a Sunday its quieter than weekday. \n\nThis review counts twice as I am a cake decorator so I know good cake.", "author": "Kayisha T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "Where can you go for\n- breakfast\n- coffee\n- a healthy lunch and \n- bakery fresh desserts  ????\n\nLassen \u0026 Hennigs!! I've always wondered what the name means--perhaps the last name of two owners? I come here quite often since it's right by my work. I come here to grab a sausage, egg and cheese on a roll along with some iced coffee for breakfast. (Coffee is so so but good to get when I need a break from Starbucks). Then I head over to the fridge section to grab lunch for later. I can choose salads or sandwiches but I always end up getting an awesome premade meal whether it be gnocchi or jambalaya or salmon with broccoli rabe. I can just throw it in the microwave later and voila lunch is served! If I'm craving dessert I can grab a slice of red velvet cake or chocolate mousse or cupcakes!! This place has an endless variety of food!! The service is up to par. You are acknowledged and helped quickly especially if the owner(?) is working inside.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Lassen \u0026 Hennigs caters my work holiday parties. So when it came time for my fiance and I to look for a caterer for our wedding, Lassen \u0026 Hennigs made the top 3. Other companies made it difficult to gather information, either playing phone tag for days or weeks, going through numerous \"courting\" emails to just get accurate pricing information, or being seeped in the wedding industrial complex. Lassen \u0026 Hennigs had all the information laid out on their website, no hidden fees. We didn't even have to do a tasting because we knew the quality of the food was delicious and healthy. $15 pp for 2 entrees, pasta, salad and rolls. We chose salmon, fried chicken, mac and cheese, pasta with veg and pesto, kale and brussel sprout salad (my favorite) and red Peruvian quinoa. Many guests complimenting on the food! Tamika was down-to-earth and super helpful on the phone when I placed the order. Delivery charge was surprisingly affordable. The delivery person was efficient and wonderful in setting up our buffet stations. I also love that they are a long established Brooklyn company.", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "I was there yesterday for the first time and ordered 1/2 pound of assorted little cookies ( of my choice) , one big hamantash and a coffee. Hamantash was delicious - soft and fresh.  \nThe cookies tasted like grandmothers holiday  kitchen. Coffee  was good too. I will be back.", "author": "Dani O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-14", "description": "Definitely overpriced. The cake slices are not good....Very disappointed with the cakes... Some of the pastries are good though. I will go there from time to time for some salmon or chicken if I am too lazy to cook.", "author": "Sean W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "The cupcake wars of NYC have heaten up. With this place, the title of best cupcake in the city seems like it should go to, whatever place that you ate most recently. \n\nI bought 20 red velvet cupcakes for a party, then these cakes were simply the bomb. It's hard to explain, but they were really good. The frosting is nice, thick and cream cheesy, and the best part is, I feel sorry for the people who left them on the table when they went home. I am very glad I scooped these things up.\n\nThe best part is, the lasting appeal. A week later, down to my last cupcake, and the cake is still soft and smooth as ever.", "author": "renje g."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Lassen \u0026 Hennigs", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SYmX40mrZcjorGyNEQByWw/ls.jpg", "@type": "Restaurant", "telephone": "+17188756272"}