{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-31", "description": "I was very unimpressed by their \"famous\" black and white cookie. Maybe it's a preference thing, but I like a better ratio of crispy outside to cakey inside. This one was like eating a slightly denser, flattened cupcake....Absolutely no crisp at all!? It was waaaaay to cakey. Really thick. Not sure if I got the wrong thing?? It says \"black and white cookie\" on the box. The frosting is pretty good -- creamy, not hardened, which I liked, but again, it was a bit too reminiscent of a cupcake than a cookie.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "Lassen Hennings holding down Montague Street since 1939!!! when I worked across the street, I used to come here to get lunch/coffee... etc. All I can tell you is \nthis place makes me hungry! Most importantly, any place that offers chocolate milk as a staple in their coffee fixings bar will get 5 stars from me!  I love the store front! You don't see this old school signage anymore. Do yourself a favor: if you want a coffee don't go to the Starbucks 15 feet away, go here and get a taste of an more authentic NY.", "author": "Alison P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-25", "description": "A bit intimidating, when  you first walk in.\nHad the red velvet cupcake.\nI've had better, but it was a good quality baked item.\nWill go back to check out the other offerings one day.", "author": "S A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "I don't generally like to comment on other people's reviews, but WHAT? That guy got free cookies? This is an outrage.\n\nIndignant as I am right now, I still love Lassen \u0026 Hennings. It's the kind of deli that you don't find anywhere but NYC. Everything is of extremely high quality; I've rarely seen the prepared food in the display cases look so good (pasta/potato/egg salads too, and I'm not even a fan these).\n\nWhile I waited for the rotating, extremely efficient counterguys to get to me, I ran into a friend of mine. He is apparently a regular here, so I asked what was good. He said, \"Everything. It just depends what you like.\" \n\nThat's spot on. This isn't a place famous for one particular sandwich; rather, all their ingredients are high-quality, so if you have a favorite flavor combination, you're going to enjoy it here. \n\nOut of their large selection of signature sandwiches, I went with the Knickerbocker: bacon, chicken cutlet, muenster, lettuce and tomato. Obviously I added BBQ sauce. This sandwich was actually beautiful; clearly made by a professional. Most importantly, it was delicious, and there's no chance I won't come back soon.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "I stopped in with a coworker based on Yelp reviews while in the area on business.  I got the Roslyn Heights and it was awesome!  Everything from the pastrami to the bread to the temperature was perfect.  She got something along the lines of an Italian hero and raved about it as well.  We were in a hurry so we didn't get anything from the bakery but the desserts looked fantastic.  The service is great and the prices are reasonable given the quality.  I'll definitely go back.", "author": "George F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "Love the bacon egg and cheese sandwich. It's amazing on the croissant too!  Quick friendly staff and lots of delicious bakery treats. The beverage options are endless from fresh squeezed orange juice to coffee to beer! The cutest deli with a complete food bar for lunch and dinner. The carrot cake is AMAZING. If you are in the area definitely stop by for anything. All of it is amazing.", "author": "Tabitha S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "I have lived in the neighborhood for five years now. Every day that has passed has seen this Deli's quality plummet.  The sandwiches are not very tasty and the staff doesn't know how to take or remember an order.  I have officially eaten the last bad sandwich that I didn't order from this place.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-10", "description": "Just got a sandwich and the bread was so stale the edges were as hard as a rock. I have used Land H for over 30 years ,even their catering. Their food was always good. But I have seen this place go down hill over the last 10 years or so and even stopped using their catering sevices. Now with this stale bread sandwich I will not go back. So sad this is a local business who I would love to support them. but not after this , which its the last straw.", "author": "Giselle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-29", "description": "I was wandering around the area and used Yelp to search for a sandwich (I know, so lazy). But I got lucky and picked Lassen \u0026 Hennigs in the Heights. Prices were high but felt standard for the neighborhood. My sandwich was delicious and hit the spot, and I got to enjoy it on the promenade. Watch out for strollers and random children running around this place. I was even given a loyalty card so I can return and drink more of their ginger-lemon ice tea (so good!).", "author": "Chey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "Delicious butter cookies! At $16.99 per pound, it's kind of  steep but we're in Brooklyn Heights so what can you expect. They are quite tasty so that's how I justify purchasing cookies almost every week.\n\nI work in the neighborhood so I've tried their soups, salads, sandwiches, bagels, prepared foods and everything has been satisfactory. The staff is friendly and is always helpful. People walk in and know each other's names, that's how you know this place is doing something right.", "author": "S C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-01", "description": "This review is only for the chocolate mousse. It's a good portion and good mousse, but nothing spectacular. If I wanted mousse and I happened to be there, I might get it again, but I wouldn't go out of my way.\n\nI will say that there are some staff members who are very friendly and knowledgeable, and others who are very grumpy. \n\nI would probably go back to try one of their chocolate cakes - I believe they have three different ones.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-07", "description": "We had ordered in a group and there was an order for 2 Jackson Heights sandwiches in that order along with other sandwiches. Instead what we got was Heavyweight sandwich with rye bread. Whoever took the order ended up entering the wrong item. We accepted to keep the wrong item. But the sandwich was probably the worst I have ever tasted. It was just dry, tasteless and not worth the $7.50 they charge for this. I will never order from this place again.", "author": "Bennison S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-21", "description": "Red Velvet Chocolate Chip Cookies are so delicious. Soft and chewy....simply amazing white chocolate \u0026 macadamia.", "author": "Valencia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "I got a smoothie with a friend here.  It had blueberry, strawberry, and banana...and it was great!  Granted, it was like $5, but it was delicious.  I am going to visit.  It is awesome.  The lady who helped me make the smoothie was really nice also.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-25", "description": "You can't just walk by this place and blatantly ignore what's in their cake window display.  It's like walking past a sex shop and pretending it's not there.  \n\nYes it is there....who you kidding window shopping?!  You feel like a perv now don't you?!  You peeping Tom!\n\nThen you walk inside after thinking over to yourself that you won't commit and buy something.\n\nPastries, cookies, cakes, and baby cupcakes dazzle your eyes to your left while a modest frozen food section is reserved on the right.  The quick, friendly and readily available staff are great and get you in and out of there before you even realize what you walked out with.  \n\nI bought the mini red velvet cupcakes and wasn't all too pleased with the very apparent cream cheese icing.  I wasn't very happy about that, but other things I've tried from here are really quite delightful.  Worth it - even just for a free show ;)", "author": "Jaclyn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "Best black and white cookie I've ever had. It's not even a cookie it's like a cupcake. Always fresh and the price is great. Never tried their sandwiches but I hear they're delicious. The place is clean and the workers are friendly. As for the location, who doesn't love a walk down Montague? :)", "author": "Angela C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-25", "description": "This used to be my favorite salad/sandwich joint in NYC, but they has seriously gone downhill in just the past year. I used to order from them ALL the time - but something changed and the employees or quality of the food just isn't what it used to be.\n\nI.e. today I went to pick up a salad - pretty standard - and this was pretty abysmal. I used to love how they were generous with each ingredient - but when I asked the lady to add some extra artichokes she rolled her eyes. I also added portables mushrooms and they were disgustingly salty. No meat in my salad and it was overpriced. \n\nSad - but I guess nothing good can last forever.", "author": "Heather F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "I love this place usually. I've taken away one star for their bread quality. It's hit or miss...today I bought a European baguette...it felt hard I asked if it was made today, the lady said yes but it was not. I've spent enough time in Europe to recognise old bread. Disappointing. But on a lighter side the cakes are delicious. Great red velvet especially the slab rather than the cake. Also love the chocy mousse. My husband loves the rice pud. And they always give my son a complimentary sprinkley cookie. Nice crew as well as good food. Shame about the bread.", "author": "Jen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-25", "description": "Three words: Red Velvet Cake.\n\nMind you, not the cupcakes - those aren't nearly as moist and delicious.  In fact the cupcakes are borderline bad here.  But the red velvet cake slices and, if there's a special occasion, whole red velvet cakes made to order, are TO DIE FOR.  I think they are by and far the best red velvet cake I've ever tasted in my life.  \n\nThe cookies are also good - the packages of day-old chocolate chip cookies are a steal.  \n\nAs for the hot food, it's pretty good depending on what you get.  The hot wings were great the first time I got them, and mediocre the second time.  And the sides are hit or miss, though I highly recommend the caprese salad.  \n\nBut the only thing that really keeps me coming back is the red velvet cake.  Have I repeated myself enough?  \n\nRED VELVET CAKE. Try it.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-14", "description": "I've gotten different cakes here and they were good. My favorite is the red velvet cake though. I like how the frosting and cake isn't overly sweet. Also the cake is moist so that's a plus.  It's perfect for my taste buds. I've also tried the tiramisu, strawberry shortcake, and carrot cake. They were ok. They weren't the best I've had. I would only come back for the red velvet cake though.", "author": "Samantha K."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Lassen \u0026 Hennigs", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SYmX40mrZcjorGyNEQByWw/ls.jpg", "@type": "Restaurant", "telephone": "+17188756272"}