{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "The bakery here is really great.  Everything looks so yummy.  I ended up buying about half a pound of the butter cookies which were delicious and tasted freshly made.  Also, the older woman behind the counter was very sweet like a Jewish grandmother.  She gave me two extra cookies without charging! Have to go back here and try the other baked goods.  The mini cupcakes looked very tempting.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-05", "description": "Knickerbocker, no tomato: Not just a description of Shirley Temple after her operation.  \r\n\r\nAnymore.\r\n\r\nEat it.  \r\n\r\nLive it.\r\n\r\nPLUS, you can buy Boylan Cane Cola in glass bottles here: the greatest soda known to man and Missing Link.\r\n\r\n(And the name of the place is Lassen \u0026 Hennigs, but keech.)", "author": "Craig K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "I love this place.  If you go here, which you should, try the \"uglies\".", "author": "Ronald F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-23", "description": "I had almost forgotten how much I love good sandwiches until I tried this place for the first time a couple of weeks ago.  Since then, I keep thinking about going back.  They have a number of specialty sandwiches on the menu, but you can also make your own.  I've had several of their subs so far and each one has been delicious.  The bread is always fresh.\n\nWhile I wait for my sub, I like to stroll around and peruse their prepared foods and baked goods.  It's important to note that the store itself is nice and clean.  I have resisted their cookies so far but don't expect that to last very long.", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-30", "description": "Very expensive and they seem to always mess up my  uncomplicated sandwich order.\n\nHowever, they have some decent prepared food like pastas and salads.\nWorth it if you have the money to spend.\n\nJust beware of ordering a sandwich from there.  Speak SLOW...and maybe check it before you go!", "author": "Dean R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "The cakes and pies here are pretty good. Also the catered food is also good. My fav. on a hot summer's day is their cold homemade ice tea", "author": "Andre K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-21", "description": "I love this place. Great Egg Sandwiches! Great Coffee! Great Deli Sandwiches! Their pre-made foods are also awesome.  This is a must go for me!", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-25", "description": "Best salads in freshness and price in the area. If you have time come here instead of Court Order. The dressing options are more limited, but still worth it.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "An institution.   Montague street has changed a lot but Lassen \u0026 Hennings has hardly changed at all (and that's a good thing).  \nTrue, it is on the pricey side.  Hot Bagels next door is a better value.  But the food here is a step above, especially the sandwiches and ready-made foods, and you can still get lunch for under $10.  \nThe beverage case carries an almost amusingly large selection.", "author": "Kate T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "Every neighborhood in America should have a place like this.  Quality prepared food with fresh ingredients.  Their salads and sandwiches are delicious and filling.  Their cake is divine.  My favorite was the the red velvet, but really, who can go wrong with red velvet?  \n\nIt is a solid grab and go lunch place.  I've ordered from them for work meetings as well and everyone has always been satisfied with their lunch.  They are very flexible with substitutions and modifications and, if they get the order wrong, they redeliver right away.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "Very good sandwiches.  Very fresh and friendly.  Iced coffee is not bad.  Black \u0026 White's are no good.  -1 for price.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-09", "description": "I am all for the mom's and pop's.  Do love me a cup of joe from starbucks, but this place is great.  Coffee is good, reasonably priced.  Clean and people are friendly.  Always nice to have options other than Starbucks ( which BTW is next door).", "author": "M F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "Love love love this place! The people are always extremely friendly and courteous. The sandwiches are always fresh tasting. The baked goods look amazing. I can't believe it took me so long to discover this Brooklyn Heights treasure!", "author": "Kate P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-20", "description": "It's incredible that a company with such a history puts such little energy into customer service. They screwed up a very simple order, then said they would correct it and never showed up. The same thing happened the next day and it took them 90 minutes to correct their mistake. Never ordering from this over-priced schlock house again.", "author": "A B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-10", "description": "Jury duty always feels like a pain and always seems to come upon you at the most inconvenient times. However, finding Lassen \u0026 Hennigs on one of my two days of jury duty was like finding a special treat. After living in three states since I turned 18 and became a registered voter, I had never been selected for jury duty. That has all changed now. After one year of living in Brooklyn, they found me and as part of my civic duty, I spent two days at the Brooklyn Supreme Court down the street. \n\nOn my one hour lunch break, I wandered into this lovely little deli after the Yelp app on my phone seemed to point out that it was one of the best choices in the area. I was not disappointed! I had the Knickerbocker Sandwich which was delicious. The tomatoes and the chicken were so perfectly sliced and then so delicately stacked on my sandwich. It was a beautiful thing. \n\nI also had the rice pudding after finding out that they were out of bread pudding. It was definitely one of the tastiest rice puddings that I have ever experienced. It wasn't as good as my grandmother's rice pudding but that is pretty hard to beat. \n\nIt's too bad that I don't have to do jury duty again for another 8 years. Now, I'm going to have to find other reasons to be in this area at lunch time!", "author": "Carlie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-01", "description": "As a local who's lived 5 minutes away got to say I'm not a big fan.  Mostly over rated by loaded stay at home moms who can afford to pay jacked up prices for a slightly better than average salad at best.  The food just isn't that great for the gourmet prices they charge.  Best thing is the deserts, but homemade is still better.", "author": "Rob K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-26", "description": "i love this place. it is way too expensive but if i'm in a good mood, and it's a nice day, i like to get an iced coffee and a delicious treat to share with my boyfriend on the promenade. we like sharing the insanely decadent and heavy red velvet cake. \n\nsandwiches and wraps are overpriced but good, but again, the main reason we go here is the treats and the proximity to the prom. \n\nalso- everyone that works and shops here seems to be very nice. \n\nwould give 5 stars if it was a little cheaper.", "author": "nina h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-22", "description": "great sandwiches\ngood prepared food\nrad staff\nwhen i live in BH this was my local deli spot\ni'm not a big deesert person but i make an exception for them. delicious", "author": "kiki b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-01", "description": "I first wrote a really scathing review for this place because I was really angry that they messed up my sandwich to the point where it was not edible and I literally hadn't eaten all day... I ordered in because I don't think I could have made it to the nearest food establishment or grocery store. That said, they really don't deserve 1 star because whoever makes their sandwiches can't read and/or understand english. They also keep forgetting straws which makes drinking my large iced coffees kind of difficult. Their delivery is kind of sloppy, once I had someone call and say they were out of whatever flavored something or other, but usually they'll just give you whatever muffin despite the fact that you ordered something else. That's really my fault, though because 1) I probably shouldn't be eating any sort of baked anything and 2) If I do east some sort of baked, fattening something or other, I should walk there and back.\n\nAnyway, Lassen \u0026amp; Hennigs is a really great gourmet deli and has a really awesome selection of everything, especially if you want to grab something to eat later (like a sandwich or a salad) or a dessert. They have a fantastic selection of prepared meals. The coffee is excellent and if I didn't work at Starbucks, I would totally tell you to go there rather than Sbux which is basically next door. \n\nIf you like croissants, go there. Their filled croissants are incredible. Like France. \n\nSo, I'm sorry Lassen \u0026amp; Hennigs. Hopefully I can order delivery from you again and you won't spit in my food.", "author": "Haley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-22", "description": "Going to a deli is never really my idea of an amazing lunch experience, but this is probably the best deli I have ever been to.  The reason is that most usually have a funky smell, substandard food, and so-so service.  No Lassen \u0026 Hennings.  I am a little bit obsessed with the Cranberry Park on a whole wheat roll which consists of turkey, cranberry sauce, and stuffing.  Many other places try to pull off such a combination, but Lassen gets the ratio just right.\n\nThey strangely enough have a pretty big selection of vegan options as well, and the desserts look pretty delicious although I haven't tried one yet.  This place is better than its little sister Court Order, and probably better than any deli in the immediate area or miles away.", "author": "Daniel C."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Lassen \u0026 Hennigs", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SYmX40mrZcjorGyNEQByWw/ls.jpg", "@type": "Restaurant", "telephone": "+17188756272"}