{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "Consistently fresh and declicious food all the time. I love this spot. \n\nThe prepared food is wonderful and healthilly made... I love the Grilled Chicken strips and their various packaged salads. \n\nSlightly pricier than your average deli but not as bad as WholeFoods, and certainly not as bad as Forager's down the hill... \n\nSpeaking of which... Owners- open one in Dumbo pretty please! :)", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Great soups, fantastic sandwiches, and a consistent deli counter serving freshly made meatballs, chicken marsala, grilled salmon, pork loin, the best mac and cheese you can get, you name it!  Their cupcakes and desserts are beautiful too.  I cater all of my parties from them, and they have never let me down in over 25 years.  Run by Thomas and Chris, with Lincoln at their side, and one is always on hand. Highly recommend you stop in.", "author": "Fern F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-25", "description": "I once dreamed that I spent $2.25 on a Snapple Antioxidant Water.  Then I woke up on the floor of Lassen and Hennig's.\n\nWhen I think of neighborhood \"institutions,\" I think of old stationery stores like JoMell's (now the wine store next to the building with the anchor out front).  When I think of Lassen \u0026 Hennig's, I think of decent sandwiches, semi-offputting prepared food, and overpriced past-prime fruit.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "I can only rate the bakery because I haven't purchased anything from the deli. I love their bakery and buy regularly from here, but their Red Velvet Cake's frosting on my last purchase was very disappointing. It was very stiff in texture and didn't taste freshly made. However, the cake itself was very moist and good.", "author": "C. G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-24", "description": "The food is decent but some of people that work there are really nasty. This girl Theresa was rushing me to order because she has thing to do (I was getting cookies for my son one of each so she had to weigt them separate) I ignored her rude tone of the voice and just smiled to her, turned around to get myself some coffee and I see her chatting with her co-worker for the next 10 minutes. I had bad experiences before    with people at the sandwich section and I just have one tip for you guys salted butter should never be used on a cinnamon raisin bagel. I know this place is busy during the lunch time but please I know there was at least 6 workers behind the counter and 2 at the registers I should not have bad experience every time I go there so this was my last time.", "author": "Daria V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-03", "description": "Okay... would take the one star away now if I could. Had also reviewed on Delivery.com because what they delivered to me was just such garbage. Got a call from Delivery.com today, telling me that the manager at Lassen and Hennigs is upset with the review that I wrote because nothing was wrong with the cupcakes. This is a complete and total fabrication, or else this guy knows nothing about old food and food sanitation.. either way, not good for a food business. The manager wanted me to remove the review in exchange for a 15 dollar Delivery.com gift card. So... I won't be using Delivery.com again since their reviews are apparently for sale and sure as heck won't ever be ordering from Lassen and Hennings.", "author": "Jane R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-07", "description": "I'm so over this place.  I used them for catering only so I can't testify to anything else.  Their catering is extremely overpriced for what you get and there are so many better options around the area.  The food was good, but it certainly wasn't anything to write home about.  They also messed up the billing for our order and double-billed credit cards on two separate days for the same order.  Their catering department's organization is kind of a mess.  I won't be using them again.", "author": "Meg C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "i tried the bk bridge sandwich for lunch once while in the area at court. the sandwich was aboslutely delicious and made me want more. they pack it up and make it a heaping of meats and it's not sloppily done. you will definitely find yourself falling into a food coma after eating such a large sandwich. i'd love to try the other sandwiches one day", "author": "Sasha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-05", "description": "CUPCAKES!!  They have the best red velvets I have ever tasted.  \n\nMy office used to buy bagels for parties.  Sort of ordinary.  Now we buy a selection of L\u0026H mini cupcakes - maybe 75% reds and a mix of the rest - and things have perked up considerable.\n\nSometimes we get two RVs and go next door to CoffeeBucks for a caffeine fix.  Yummy-Perfection.  \n\nPeople behind the counter and at the register have always been super polite.", "author": "Jim S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-30", "description": "Great Deli and Bakery selection!", "author": "Kenna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-13", "description": "This deli is above and beyond a regular place where you salads,\nsandwiches, etc... they have awesome selections of very fresh and \nreasonably priced food.\n\nThey take credit cards, and if you are in a rush just browse the premade\nfood section for a whole array of wraps, sandwiches, salads, side dishes\nand some main dishes.\n\nAll of the employees have been friendly and I feel lucky to hop outside\nand enjoy lunch on the promenade!!", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-23", "description": "I must start by saying their food is very quality and their selection is wide. I eat there often for lunch as I work in the area. My only gripe is the owner/manager. I will walk in and see him talking very poorly to his workers and it awkward to me and rude. I am going to stop going there.", "author": "A R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-08", "description": "Lassen and Henning used to be THE gourmet deli in the Heights, however the quality of their food has deteriorated dramatically in the last year or so.  After today's  inedible chicken wrap (the chicken pieces were rubbery and/ or dried out), I will no longer order from there.  For the prices they charge...they should have much better quality control.  Luckily there are a number of other and better lunch options in the area.   Sorry L\u0026H but your menu is off my desk and in the garbage.", "author": "J.S. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-08", "description": "My favorite deli in Brooklyn Heights! Located a few doors down from the historic Hotel Bossert. I love the Knickerbocker sandwich - wow...it is so good. Breaded chicken with melted muenster on a roll. So tasty!", "author": "Xiao Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-23", "description": "If it wasn't so overpriced, it would be a fair place to get lunch. I don't know why I keep coming back here - it's really aesthetically pleasing. But no more. Seriously. It isn't that good, but I feel like I need to eat all of it because I paid so much. Delis shouldn't make you have negative feelings like that.", "author": "Yana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "Great catering service.  Employees are very friendly.  Large food selection.  Desserts are to die for.  Salads are also a plus.", "author": "Lorrie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-15", "description": "Declining quality, small portions, overpriced Food.  I've been going to this place since I moved to the neighborhood five years ago.  The quality of the Food has declined in the past 18 months, portions are smaller and prices are higher.   Staff are generally unfriendly and have messed up a simple order at least 6 times in the past 3 months.   Pastries and cakes are low quality and full of sugar.  Entemanns is better in my opinion.    I'm done going to this place.   There are better options in the Neighborhood.", "author": "Mitch B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-14", "description": "The staff is so friendly here. Great place to pick up a ready-to-go meal. Had the herb crusted chicken that they actually heated up for me in-store. They do chicken right.", "author": "William H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "Great selection of easy to prepare or already prepared foods, and the best part is they are all healthy! Great catering service too, always on time and with a set of supplies to accompany the yummy platters.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-20", "description": "The only thing I've eaten there - so far - is their bread pudding, and it was delicious (I'm an admitted bread pudding obsessive, so trust me on this one).  The other reason for the five stars is due to the wonderful counter service (extremely friendly \u0026 helpful) and the fantastic selection.  A friend of mine who works in that neighborhood told me their rice pudding is also delicious.", "author": "Susan L."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Lassen \u0026 Hennigs", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SYmX40mrZcjorGyNEQByWw/ls.jpg", "@type": "Restaurant", "telephone": "+17188756272"}