{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "Delicious!!! Great place to pick up something sweet or a quick bite. I've had Their strawberry short cake in the past and it is amazing!!!! I tried the rainbow cookie and it is also good. It has a cake-like consistency.", "author": "Celeste V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-11", "description": "Lassen \u0026 Hennings is a great little deli/bakery/catering establishment in the heart of Brooklyn Heights aka Montague Street. I love going in here just to look at the selection of yummy sweets that they have in full display. I love a good fruit tart! \n\nThey also have pies, eclairs, cakes and other goodies available for purchase. I've been meaning to buy a peach pie from them... mmm pie. The sandwich counter is my favorite thing here. Some people argue that it is a little pricey (I don't think so?) but for the quality I don't care. They are 10 million times better than a 5 dollar Subway foot long at 7 dollars so I will happily pay it. Plus they are so filling that you can eat half now and save the other half for later when you come home after a night of debauchery or first thing when you wake up after a night of debauchery. They use fresh and quality ingredients and don't skimp on quantity. \n\nSo far I have gotten the Botanical Garden (mozzarella veggie sandwich), the Heavyweight (pastrami on rye), and the Flushing Heights (Italian meats with cheese). All three were delicious! If you love Italian cold cuts, the Flushing Heights is the way to go. I have daydreams about that sandwich... seriously.\n\nI highly recommend coming here for a little treat or sandwich.", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-10", "description": "In typical BK fashion, L\u0026H offers a large selection of items from a variety of purveyors in their bakery/deli hybrid configuration. On my visit, the staff was extremely overwhelmed (by a pretty darn small volume of customers) but borderline friendly, except when I asked for a bag larger than one that snugly fit my 3 small items. I snagged an uber-fresh blackberry tart, a moist and flavorful red velvet mini cupcake, and an un-thrilling Ugly (cheesecake top w/ choc cake bottom studded w/ choc chips) for a fairly steep $6.25. If I was starving and worked next-door every day of the year, I'd consider a return, but I won't make another attempt to stop in otherwise.", "author": "George C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-07", "description": "Stopped in to pick up some pastries on New Years Day and was glad they were open!  Good food and quick service!", "author": "Chelsea F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-22", "description": "For the past 3 months, every other Tuesday I have been treated to lunch @ Lassen and Hennings.... \n\nAMAZING.", "author": "Beautiful Badass E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-20", "description": "I thought the sandwiches would be really good based on the reviews and the  fact that this place is always crowded, however I found the sandwiches very average, even worse the baked goods were a tad stale tasting. All in all it reminded me of a Winn Dixie Deli, with the appearance of a higher end establishment.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-30", "description": "We do a good amount of catering through Lassen \u0026 Hennigs because of its proximity to the office and also because of its freshness and deliciousness.  We just did a cupcake thing the other day, and I'm still thinking about the cute little key lime cupcake I had.  This place is great!", "author": "Hope M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-07", "description": "Had the blueberry short cake.  Plenty of fresh blueberries and fluffily whipped cream.  The cake was light and tasty!I personally like my cake a little more moist.  I am  willing to try it again sometime.... We will see!", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "So I found out the night before that I d be spending the entire next day in this neighborhood for work, so what better preparation to do than to scout yelp for food options.\n\nLassen and Hennig appeared near the top of the list.  People's descriptions of the sandwiches sealed the deal- of all the Brooklyn Heights choices, I was going to grace this one with my presence.\n\nI decide on a sandwich made of chicken, mozzarella, and tomatoes.  The side dishes didn't look all that great, but there was a decent selection of non-greasy chips.  I also grabbed a vanilla custard on the way out.\n\nThe sandwich was good, but I was expecting better.  Maybe my hopes were too high because of all you bloody yelp fanatics. But the custard? Damn!  It was so damn good, I had to turn down my car radio to avoid stimulus overload.  It was like what my mom used to make for me before I became a fat kid and she cut me off from desserts.  I will go back to Lassen and Hennig whenever I want flashbacks of dessert-scarfing fatassery as a child and my 1988 crush on Cyndi Lauper.", "author": "Karim Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-20", "description": "Food is pretty good here, but the service is just terrible.  The people behind the deli counter are mean - they don't listen to your order and then yell at you when you tell them it has been made wrong.  Even when there is a long line, they take forever to take orders and make you feel bad for making them actually work.  I've honestly don't understand how they make a simple experience of ordering a breakfast sandwich so terrible, but they sure have figured it out.  I've seen what looks like the manager be mean at those employees, so maybe it's a learned behavior.  All and all, not worth it.", "author": "M M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "The store has a well-deserved reputation for fresh baked items, and also features coffees, teas and prepared food. A good spot to buy takeout lunch, or to cater an event or pick up an exquisite cake.", "author": "Carolyn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "I feel like my review needs a little refresher, especially since I have been averaging about 3.4 visits per week for the past couple of months. The sandwiches are phenomenal and as previously stated, they will not make you feel like you just ate for two at lunch.\n\nMy go-to sandwiches are The Pierrepont (roast turkey, the real kind, right off the actual turkey, bacon, lettuce, mayo on a roll) and Cranberry Park (roast turkey, hot stuffing, cranberry sauce on a roll). They have tons of fresh salads every day (potato, macaroni, etc.), as well as a whole row of prepared foods on the other side that all look good.\n\nFull bakery with almost everything imaginable. For desserts, the carrot cake is very good, as is the cheesecake. Also, the coconut pie is better than the coconut cake. The fruit tarts are also pretty nice. What? Dessert is not a problem for me, I just go here a lot!\n\nThere is a trick to ordering here though as there is no line or number system. You enter and stay to your left and go to the back area. When crowded, I survey the crowd and look who is inching toward the glass. They will always call next. At that point, I take a look around and if everyone who was there when I got there does not move, I step in and order. Sometimes people are slow on the trigger here and you just need to step in and order or you will be there a while even with their efficient staff behind the counter.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-04", "description": "I went past Lassen \u0026 Hennigs and, like peter d. I was attracted into the store by the attractive window displays and, once inside, I got samples for myself, family and friends. \n\nI got samples of the cannoli, carrot cake, the red velvet, Napoleons and cookies.\n\nMy Mom and I really liked the red velvet cake, although it was a bit dense and rich and we alone couldn't finish a slice. From now on, we will just stick with the red velvet cupcakes. My friend said the carrot cake (which I am going to have to get a whole slice of to try myself) was good the icing was sweet, but really good, but he said the cake was a bit dry. Everyone I shared the cannolis with liked them, no one had a single negative thing to say.  The Napoleons and cookies - I need to get more reviews, but overall, I am a fan of L\u0026H, and I know people say it is pricey, but if it is pricey for a reason, then that is also OK.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-01", "description": "The catering department has its hits ...and misses.  I know better than to order any of the beef dishes.  On the other hand, their chicken and sun dried lasagna is really delicious as are all their other pasta dishes.  L\u0026H does a very nice job of providing everything you need for a party at your home or office: sternos, chafing dishes, cutlery and napkins.  You can even hire staff to serve the food and tend bar.  The regular fare is outstanding.  My favorite is the Cranberry Park.  Basically it is Thanksgiving on a roll: turkey, stuffing and cranberry sauce.  Relly excellent Tiramisu cake.  It is better than Veniero's in the East Village.  I do have one big complaint - please get rid of that cranky old lady with the glasses and hair on her chin. She is surly and mean, nothing like the rest of staff.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "My experiences at Lassen \u0026 Hennings have been mainly on breakfast/bruchtimes so i can speak less for their sandwiches and lunch food. Still, I would argue their egg and cheese sandwiches are the best in the area (though not the cheapest). I also love that they have a great self serve coffee/tea bar where you can choose from a selection of hot and cold drinks including flavored and unflavored coffee, tea, pink lemonade, and regular lemonade. quick, easy, and yum.", "author": "Mary M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-13", "description": "This is a great deli in a great neighboorhood. I just finished yoga a couple doors down and I was on the prowl for a delicious, nutricious lunch. I stumbled in here like a drunk and left happy like a drunk ;-)\nEverything in here looks so yummy, I was ogling a few mini cupcakes and salivating over the cookies. I wandered to the back where they had a few soup cauldrons lined up! My favorite! I love soup and being that it was a bit cold today and I felt under the weather, I knew I had found lunch ;-) They had veggie chili, cream of asparagus, butternut squash, split pea, chicken noodle, and lentil. I was caught in a dilemma. Oh no! I had to choose. I liked all of them. I finally settled on the veggie chili and I was not let down! It was the best veggie chili ever, chockful of sqash, potatoes, chickpeas, lentils with just the right amout of spice and tomatoes! I also bought some Cadbury chocolate bars, the Flake and Twirl, which can be hard to find outside of the UK. \nI will have to come back and try a sandwich. The line was way too long and I didn't have the patience. But...thats a good sign when the place is swarming with people!", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-11", "description": "Can I just tell you that this place has some of the best cheesecake in New York. Yeah, that's right, a little deli has the excellent excellent cheesecake. It's all in the crust. I like the cheese part a tad firmer, but it tastes fabulous. The crust is PERFECT. Just go here, get some, and get back to me. It's so much better than all of the other places I've been to in NYC that claim to have the best - especially Junior's (the most over-rated cheesecake ever). I really just can't believe it! I even \"tried\" it over and over and over again just to reassure myself that it's true.... it is.\n\nThis really is a 5-star gourmet deli, and what's funny is that it's so very basic for a gourmet deli. But I like that L\u0026H is more old-fashioned - and it's not one of those salad bar places - or flashy, expensive bougie gourmet delis like Garden of Eden. It's kind of no-frills, but the food is really good, and has all the frills for what it costs. Not only that, their yummy take-away food is so much more AFFORDABLE than most of the other gourmet spots that have popped up over the past decade, in my opinion. \n\nWhat's cool is how you can get something here, and take it over to the promenade and have yourself a nice, cheap meal with a lot of ambiance\nI hear this place has been here forever, and has always been good. The staff seems comfortable in their service ettiquette and jobs which always bodes well for customers, I think cuz when people hate their jobs they take it out on you. Here they are really low-key here, yet happy to help you. (I hate when minimum wage staff seems like they received lashings in the back before greeting the public - addressing you with those wide scared eyes like they've been scared into submission-helpfulness by some nasty boss in the back. It makes me feel like an aider-and-abetter of oppression). (But then again I hate shitty Duane Reade type service, too) They are chill without being lax here. \n\nI STILL am not over the fact that they have cheesecake that is so close to being perfect at a freakin deli for $4.25!!", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "Great sandwiches an wonderful beverage selection. The employees are very nice and helpful. The perfect local deli/bakery.", "author": "Harry M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-20", "description": "I am a breakfast lover who seldom eats in the morning. Therefore, any restaurant that serves breakfast throughout the day will generally earn at least two stars in my book.\n\nAnd this place is GOOD! Breakfast basics plus a huge salad menu (no fewer than 28 varieties), wraps, sandwiches, and desserts--and delivery is prompt and correct. I love this place so much I just may break the cardinal rule and venture beyond the three-block radius of my apartment to eat there instead of calling for delivery. \n\n...they're four blocks away.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-14", "description": "The deli counter is good- their sandwiches are tasty BUT very expensive. \nMy problem is with the baked goods- cakes, cupcakes, croissants, etc, are TERRIBLE. I have purchased a few cakes there for special occasions, the cake is dry and the frosting is cheap, too sugary and thin and just made poorly. The cupcakes are the same. And with Crumbs right across the street I don't know who still buys their cupcakes anyway.  I will go out of my way to One Girl Cookie for example to spend a little more on an amazing cake any day. Why can't they get an in house baker or at least get an outside Brooklyn based bakery to make their things? I have read that people like the red velvet and to be fair I have not had that kind here. But I've had several varieties, chocolate, mocha, vanilla.", "author": "Cecilia R."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Lassen \u0026 Hennigs", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SYmX40mrZcjorGyNEQByWw/ls.jpg", "@type": "Restaurant", "telephone": "+17188756272"}