{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-11", "description": "I prefer to grab breakfast further down the block at Montague Street Bagels, but I always come to Lassen \u0026 Hennigs for my iced coffee. Everything is self-served but what I appreciate the most is the diversity of milks/creamers. In fact, I believe Lassen \u0026 Hennigs is the only place around that offers oat milk as a dairy alternative. I'd love if they offer agave as well, but I'll take what I can get! \n\nTheir pre-packaged lunch options, including salads, pasta, and sandwiches are pretty decent as well! You'd also be a fool if you passed on their many, many dessert/baked goods (strategically placed around the store).", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-28", "description": "Years ago, I learned that the best way to ensure I have a good time at parties I host in my home is not to cook. My ideal caterer would provide food that: can be eaten in one hand while holding a drink in the other hand; does not require heating; and freezes beautifully. After trying several establishments, Lassen \u0026 Hennigs has proven to be the most reliable. Their online menu offers variety and is easy to navigate. On the rare occasion when something goes wrong, their customer service is impressive. For example, I always order Lassen \u0026 Hennigs' mini latkes because my guests invariably rave about them. The last time I had a party, only one of the three platters of the mini latkes were delivered. Given it was Sunday on Memorial Day weekend, I wasn't surprised that I got Lassen \u0026 Hennigs' voicemail when I called. Mohammed Soleiman, the kind man who delivered the food, immediately called Lassen \u0026 Hennigs on my behalf, got through, alerted them to the missing platters, rushed back to the store, and delivered the beloved mini latkes in no time. Thanks, Mohammed!", "author": "Marcela L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "My job can be quite taxing and when people are appreciative they typically will just give verbal thanks and a hug but this time a client sent us something we all know and love, FOOD!\n\nSometimes it is so busy at my job that no one gets to sit down and eat a full meal which leads to very unhealthy diets and stress. Unexpectedly I show up to the office and there was a huge box full of pastas, sandwiches, salads, cakes oh my!  We read the attached card and it was from a client who was showing their appreciation. As we pored over the box's contents I was super impressed, L\u0026H had thought of everything, they had even included ICE......ICE!  I thought L\u0026H was some fancy ordering company but I did not know it was a local deli in Brooklyn.  \n\nThere was so much food for everyone and that day we dined like royalty. Everything was so delicious from the pastas to the different choices of cakes.  The company had even included serving cutlery, how thoughtful was that?\n\nI have yet to visit this deli but I can assure you that they are top notch to use for catering and if you would feel so obliged please feel free to send ME some more of that good loving in the form of a turkey and cheese sandwich. \n\n-FIN", "author": "Ariel S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "It's great to see L\u0026H still around after all these years. I was first introduced to it 20 years ago when I first interned in New York and found it to be the quintessential, all-purpose New York deli against which I measured all others.\n\nOn a recent visit, I found things to be as well-stocked as ever, although many of the prepared items (sandwiches, entrees) were slightly overpriced for what they were. Perhaps the best thing about L\u0026H these days is its exquisite, extensive case of pastries and baked goods. Its deli fare might still be a step up from others in the immediate area, so at least it's still a default go-to if you live or work nearby.", "author": "Vincent L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-06", "description": "Randomly found this spot and it was the cookies that pulled me in! Yum! A nice assortment of delicious baked goods!", "author": "Neil G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-15", "description": "Disappointing. Over the last 20 years I would to go to L\u0026H a lot but in the last few months just didn't get there. I wen today and order my usual the Cranberry park. They used a premade sandwich form the deli display refrigerator. The turkey, stuffing and cranberry sauce were already on the bread. You could see the cranberry sauce had dried out. All they did was heat it and made it even drier. I liked it when the meat was cut fresh and everything was put together while you waited.", "author": "KENNETH W. C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "Breakfast, lunch and prepared dinner items to go. This establishment has been around for years and it works well in BK Heights.\nI love their bakery items and various beverages such as Red Zinger tea and Ginger-Lemon.\nSolid spot for various cravings.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Lassen \u0026 Hennings is a great little deli with many healthy food options - offering both pre-packaged and freshly made sandwiches, salads and sweets. Grab a tasty lunch for less then $15 (including drink), and enjoy it on a bench on the Promenade with views of Manhattan for a perfect lunch in Brooklyn.", "author": "Zsuzsa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "I cannot say enough about this place with a wide variety of foods from sandwiches to wraps, soups and salads. They are also known for their freshly baked goodies tgat you can smell a mile away. I look forward to winter knowing that i can cozy up to a nice bowl of soup.", "author": "Almaria B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "I come here whenever I can to get some sweets. The muffins are always perfectly moist and the m\u0026m cookies are exactly how they should be. Everyone is usually very nice and attentive to your needs.", "author": "Courtney C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "I have, for many years, taken out prepared foods from Lassen \u0026 Hennigs.  I had not, until recently, had the occasion to use their catering services.  I was having brunch for a large number of old friends and wanted everything to be perfect.\nAlthough I did the main courses myself, I relied on L\u0026H to do some of the fancier platters for me.  The platter of lox was beautiful and, although I do not eat lox, I was told that it was just about the best ever.\nThe highlight of my table though was the fresh fruit platter.  It was a work of art, a true masterpiece.  There was plenty of fresh fruit but the display was incredible.\nI will definitely use L\u0026H again when I entertain and, perhaps, use them to do the entire job so I can relax more.", "author": "Chisono I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Ok, full disclosure...I am a chocoholic with no plans on EVER recovering. So for my birthday, my hubby treated me to a cake from his one of his favorite bakeries. Given my unfamiliarity with the menu, I walked in to explore the options and report back with my decision. After consulting with a staffer who had insider knowledge, I opted for the all chocolate layer cake - boy was it good to the last crumb and worth every penny. I was initially intimidated at first, thinking that i had finally met my match because it was definitely overflowing with chocolatey goodness. I mean it was moist, soft, and not too sweet (no need to call the dentist). In the less than 72 hours that this cake lived in our house, we had this cake for breakfast and dessert. Even the photo I posted on Instagram had my followers drooling for a slice. I will absolutely come back for more sweet treats.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-20", "description": "Update: found a fly in my salad. Not going back. Every time I'm apprehensive I'll find a \"bonus\" in my food. Gross\n\nIt's been steadily been going downhill. The employees (cashiers, salad lady) are very sweet but the sandwich guys are slow and disorganized. The deli section is a mess and the food doesn't look very fresh. The salmon and chicken are dry and look days old. Once I had a tossed salad and it had a gross hair inside! Disgusting! Lassen has been an institution for ages but they have to get it together if they want to stay in the business and be competitive.", "author": "nina s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "My friend just brought me 2 pieces of pie from this place.  THAT's LOVE.  More people should consider the gift of pie.\n\nAnd THIS pie is good pie.  Those who know me know I love me some pie.  THIS is spectacular pie.  If you're coming in from Brooklyn can you pick me up a slice of cherry?\n\nThanks.", "author": "Scotty W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "All I know is, that Red velvet cake aint nothing but the devil!!! Now I am sinner! Help me LORD!!! I am over here speaking in tongues and dancing with devil!!! No one should ever make a cake that d--n \nGOOD!!!", "author": "Twamish L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Once again, Lassen and Hennigs catered a family party, and the food was outstanding! Everything was beautifully presented, and they were careful to remember even the most minute details.  Mohammed Solomon,  chef, personally delivered the feast. Thank you, Chris!", "author": "Nancy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-19", "description": "Lassen \u0026 Hennigs is a nice, mid-sized deli shop in the heart of Downtown Brooklyn. \n\nMy company and I have ordered food from here endless amount of times. I must admit the catered food we've ordered before has had it's up's and down's. I have also picked up birthday cakes from Lassen \u0026 Hennigs as well too. They have a wide variety of cakes to choose from and are very moist. \n\nI've tried their Waldorf wrap and it is phenomenal! It is hands down, over the top, the best wrap I've ever had. I've had a Waldorf salad before, but a Waldorf salad rolled together in a wrap is a whole different level here. There was chicken, walnuts, sliced apples, raisins, celery, and mayo rolled into the wrap. I love that they add big slices/chunks of apple. It adds a nice crunchiness and sweetness to the wrap. The celery adds a nice crunch to it too! It's a very light, simple, and super filling wrap. \n\nI'm starting to enjoy the food at Lassen \u0026 Hennigs very much. Although it is about 8-10 blocks away from my office, I still enjoy taking a nice walk over to the other side of Downtown Brooklyn for some yummy food.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-25", "description": "The first time I went into Lassen \u0026 Hennigs I left disappointed.  You see, I went in for the sole purpose of picking up one of their famous black/white cookies* and they had run out.  Ugh.  So you better believe next time I was in the neighborhood I popped in to check the cookie case.  AH!  A full case of cookies!  Including several of the black/white.\n\nThe cookie ran me a whopping $2.95 but I had read in multiple reviews \u0026 foodie articles that L\u0026H b/w cookie was one of the best in the city.  \n\nI've got to tell you - this shop is fantastic.  So. Many. Delicious. Looking. Baked. Treats.  Oh my.  Butttttt it's not the best b/w cookie I've had.  Size - good.  Frosting - sweet \u0026 creamy \u0026 overall lovely.  Cookie - a bit dry.  So I guess you could say the second time I left a little disappointed too.  :-/\n\nI'm not giving up on L\u0026H, I will be back, there are after all about 50+ varieties of desserts to try and they've got some delicious looking sandwiches.   I'm positive my next visit will be more successful.  Until then... \n\n-----------------------------------------------\n\n*To some of you crazy kids- these cookies might be called \"half moons\"", "author": "Alyssa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "Lassen and Hennings has to be the best deli shop in Brooklyn.  They offer sandwiches, hot dishes, to-go food choices, hot and cold drinks, candies, and soups.\n\nI'm so glad that we found this deli.  I ordered The Majestic sandwich, which was Virginia Ham, proschuitto, salami, sweet salami, tomatoes, lettuce, provolone cheese.  Well made, delicious, and TASTY!   it was perhaps the best pick of items among the four of us!  Loved it!   Grade:  A!\n\nWe also got a side offering of the Peruvian Shrimp Salad.  Like a shrimp ceviche made with celery, bell peppers, and onions, marinated in citrus.  Delish!  Grade:  A!\n\nFor my drink, I had the Sugar Cane Grape Soda.  OMG DELICIOUS!   Grade A!\n\nFriendly service people, great selection, delicious food!\n\nFood Grade:  A!\nService Grade:  A-\nWorth the Money Grade:  A-\nOverall Impression Grade:  A-", "author": "Marko C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Lassen \u0026 Hennings is the reason I'm struggling to fit into my skirt today. (Fine, not really. But I need to blame somebody that isn't me!)\n\nStopped by in search of a gourmet cake and cookies for a small work party and was overwhelmed with the chocolatey options. The cakes here certainly aren't cheap, but they're worth it. \n\nMy office loved the decadent chocolate cake. The Italian butter cookies were also a hit (they offer them pre-wrapped in pretty paper which is very convenient). \n\nWill be back for my next work occasion!", "author": "Shannon G."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Lassen \u0026 Hennigs", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SYmX40mrZcjorGyNEQByWw/ls.jpg", "@type": "Restaurant", "telephone": "+17188756272"}