{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Best cannoli!!!! I love the small miniatures of there desserts.  It's the perfect size for a nibble or to try a few.  Their butter cookies were great as well and very light.", "author": "Morgan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-22", "description": "I am so upset. I have been going to Lassen and Hennigs since I was a little girl and today I found a fly in prepackaged salad :(. I have tried really hard to stay loyal to Lassen.. but to honest their food has become lack luster and boring. Their prices are outrageous and there is really nothing that special about any of it. I hope that they improve and fast.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Dear Interested Shoppers \u0026 neighbors:\n\nI must once again sing the praises of Lassen \u0026 Hennigs!!!  The shop continuously serves  wonderful products and I feel very lucky to have them as my \"go to\" place for not only everyday items but specialty products for holidays.  \n\nThe managers, workers and everyone associated with the store are always very professional, the food is always fresh, and in general the service is spot on!\n\nThank you for your helpfulness and patience: it means a lot to me!\n\nSincerely,\n\nLois Ellen Schwartz\nA very happy customer", "author": "Lois S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Go here whenever I'm in the area and get the exact same thing everytime. Fresh turkey on a roll with lettuce, tomato, mayo, salt n pepper and oil and vinegar  w/ a ginger strawberry lemonade.  And every time is like the first time eating this sandwich it's always good never fails. A bit on the pricey side $10 sandwich but no deli meat can ever compare so idc. Yummy in my tummy!", "author": "Shainice L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-06", "description": "I pass by this place sometimes for work and see all the amazing baked goods. One day I decided to pop in and I got some of the fresh guacamole. Worst mistake ever!! ): I got food poisoned!!! Spent the entire night hugging a toilet! Now I've never had anything else from this place but it's definitely left a bad taste in my mouth. (Pun intended) sorry Lassen and Hennings, too pricey and you got me sick", "author": "Braxton B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-28", "description": "My review is based strictly on one thing only, so please keep that in mind...\n\nI ordered a Strawberry shortcake for an office party today, AND WE KILLED IT. It was delicious. Such an unassuming place to buy a cake, however that's right up there with Veniero's in my book. Soft, moist cake, perfectly sweet, ripe and fresh strawberries, whipped cream frosting that was light and fluffy and not at all overly sweet. All day coworkers have been coming to my desk to find out where the cake came from. We will def be getting all of our cakes from there from now on...\n\nCustomer service was sweet as pie to boot.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-17", "description": "Lassen \u0026 Hennigs' is an upmarket little deli in the quaint little neighborhood of Brooklyn Heights. It has a mouthwatering range of desserts and sandwiches with inventive, quirky names. I got a Heavyweight, which is a hot pastrami on rye sandwich and my boyfriend got a Majestic Court, which has three different types of meat on a sandwich with cheese, lettuce and tomato. They had ran out of hero bread and replaced it with a baguette.\n\nThe sandwiches were good enough to eat while looking over the Manhattan skyline; the rye on my Heavyweight was lightly toasted and the portion of pastrami was generous. I found the prices a little prohibitive, though: the average price of a sandwich was $6.95 before taxes and it wasn't even a huge Katz-esque one.\n\nI might come here again if I were walking around Brooklyn Heights, but there are a ton of other places to check out and it's not necessarily a come-back place.", "author": "Jin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-02", "description": "I occasionally would go here for my croissant fix. Their baked products are good, but the setup/customer service is terrible.\n\nOn my last visit, I waited in the makeshift line while the people ahead all ordered sandwiches (I wish I could just grab the croissant myself, but it's behind the counter). Finally it was my turn, but one of the employees took the order of the person behind me. So now I stepped right up and made it clear that I needed help. The next employee started taking the order of the person 2 places behind me, and I interjected. He stares at me blankly. Goes back to taking the other guys order. I reiterate that I need helpd and ask if I have done something wrong. Nobody looks at me. I leave. Write bad review.", "author": "Tom P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "Lassen and Hennigs was everything I was looking for when I moved into Brooklyn Heights, all cutely wrapped into one shop with friendly service and a great selection.  They have an extensive selection of premade foods, and if you're like me and normally cringe at the decomposing  tubs of coleslaw and potato salad, prepare to be pleasantly surprised.  They have a MUCH greater selection than just the normal fill-in-the-blank salad, and all of the ingredients they use are fresh.  I've gotten an awesome tomato/avocado/onion salad, but they have entrees and soups to go as well-- all just as delicious as the next.  They have a make-your-own salad option too, with many different add ins.\n\nAlso, I feel like I should require a 12 step program for how much I'm addicted to iced tea.  They have various flavors constantly brewed in the back, and I can get an overly large cup as well as dispense my own perfect ice amount!  Sometimes, it's the small things that make a shop truly great, and in this case, many many small things.\n\nCome here for a good sandwich, grab n go delicacies, and to support a neighborhood favorite.", "author": "Des M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "their cheese cake is great! You will get into it so easily. And good place to pick up a quick lunch box.", "author": "Larry W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "Great food. Very clean. Super friendly. \n\nLove it.\n\nAs for Mo D's review below...clearly she has something against them b/c her picture shows the unit price of $16.99 and the weight of what she bought, .19lbs, so she paid like $3.20. Notice how the actual price is cut off to the right? Rude.", "author": "J. T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-16", "description": "As i was walking by, i was strangely craving some butter cookies, so I had stopped in to look at the variety they had.  I do not normally purchase butter cookies when I have not previously read reviews about a place but I decided to give them a try.  It was okay.  \n\nThe woman who served me was quick and kept thinking I was done with my purchase until I had asked for more items.  I am not sure about their other stuff since they seem to have a lot more in that store.  I had only tried the cookies as I sit here and type on yelp.  They are decent.  I think I've had better though...\n\nI'm not sure if I would recommend this place... It's like any delicatessen in the city (or rather the ones in midtown)... but this place does have a variety of things?", "author": "Teresa T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-14", "description": "Was in the neighborhood on a Thursday night and figured I' d surprise my husband and kids with some pastries.. .. Eclairs  were mushy yet tough, chocolate cheese cake cupcake was dry and bleh. The lemon bar was so sweet it was uneatable,,cannoli cream was just ok with an uncrispy  shell??Overall everything except the red velvet cake pastry tasted old or stale..very disappointing..,and at over $18 bucks for all of them kind of pissed me off....I won't be back...I'll definitely  stick to the italian bakeries in Bensonhurst....no contest!!!", "author": "Patricia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "I can't really speak for the other items here but the red velvet cake was pretty damn good. This is coming from someone that has eaten Cake Man Raven's legendary red cakey goodness. If you like lots of cream cheese icing then it's for you. Talk about heavy. I had to take a nap after eating it. I would never feed this to kids because they would be bouncing all over the walls from the richness and they would have to take a time out. Yeah. It's that good. \n\nLike a junkie, I will keep coming back. Got to give this place the once-over.", "author": "Evan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-14", "description": "Was robbed of $2.50 + tax for a whole wheat bagel with cream cheese, which I wouldn't have minded paying if they had tofu cream cheese. Going to Garden of Eden next time for the $2 bagel!", "author": "Adrienne Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "I haven't been inside this shop (YET). But this past weekend my mother bought a strawberry shortcake from the bakery for my birthday and it was literally the best strawberry shortcake I've ever had. The cream inside the cake was so light, and not tooth-hurtingly sweet like most cakes. My mother and her coworkers rave about their red velvet and carrot cakes as well. The next time I'm in Brooklyn, I definitely need to stop by and check this place out.", "author": "Steph E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-02", "description": "recently purchased a red velvet cake for a family members birthday, it was pretty good not super sweet as I am use to..", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-19", "description": "I hate bell peppers and this place puts them on almost EVERYTHING. It's the first thing I smell when I walk inside. Just wrecks the taste of all those dishes that look delicious if it weren't for those bell peppers.\n\nThey do, however, make terrific sandwiches. Get the sandwiches then run.", "author": "J. B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "I was a bit disappointed to see that this is just a place you get some food to go and that there isn't anywhere to sit and enjoy one of their sandwiches. They have an upstairs that's rented as a catering hall which I think should be a seating area when the place isn't rented out but they don't do that. \n\nThe place is very clean and the people are super nice. The dessert selection was fantastic and everything looked fresh and tasty (and from my experience...is). They have a station for custom salads and a station for custom yogurt parfaits which I thought was a nice touch. \n\nThe sandwiches are great including all the traditional ones and their signature creations. Everything is a tad pricier than it probably should be (like a regular turkey and cheese sandwich on a roll is $7.50). They also squeeze out all the money they can out of customers by doing things like selling their slices of pie by weight so each piece is priced slightly different from the last instead of just sticking with a fixed price. \n\nEither way the place is great and Montague St is one of Brooklyn Heights' biggest gems.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-16", "description": "Lassen \u0026 Hennigs is an efficient, straightforward variety-type store in the neighborhood. Their bakery (makes?) some wonderful breads, cakes, and cookies. It's nice to have a solid, medium-to-high quality option on dull Montague. \n\nOrdered egg sandwiches - acceptable, vaguely funky-tasting meat. Picked up some fruit salad - oooooh, moldy blueberry...won't be back for fruit salad. It happens, but uh...left an impression. Stick with yummy cookies.", "author": "Steve M."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Lassen \u0026 Hennigs", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SYmX40mrZcjorGyNEQByWw/ls.jpg", "@type": "Restaurant", "telephone": "+17188756272"}