{"aggregateRating": {"reviewCount": 95, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-12", "description": "This was the WORST place to go. Despite many co workers telling me that tio pio has previously made them sick before, I took the trip there to see what it was all about. I ordered a number 1 which was a half chicken with plantains and white rice with beans. As soon as I finished my food, I ran to the bathroom and puked twice. Please avoid this place at all costs!", "author": "Anna H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-07", "description": "My co-workers have been raving about the new opening of Tio Pio and how great their chicken is so I decided to try it out last week for lunch. The food here is moderate, definitely not inexpensive although I wish it was.\n\nI went to grab lunch at Tio Pio around 1pm and the line wasn't as long as I thought it 'd be. The decor is simple, nothing very fancy or extravagant and the staff here are friendly. Most of the food is pre-made, you just order what you want and it's ready to eat.\n\nI ordered the white rice with 1/4 chicken, plantains, and beans. I really enjoyed the plantains. I don't eat them a lot, but it sure is yummy. The beans were extremely tasty. The chicken was grilled just right. The rice had an aromatic taste to it. I think next time I will go for the yellow rice instead.\n\nIf you want tasty Spanish/Latin American food, Tio Pio is the place to be. I think I will return to Tio Pio because I do have an interest in Spanish food and they've got empanadas, something I've been wanting to try for the longest time!", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "My go-to for a fast and cheap lunch near my office. $5.75 for a decent half chicken is hard to beat.", "author": "Justin H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-30", "description": "Worst food ever , I asked for a hot ham and cheese sandwich and the guy just heat up after it was done and forgot the cheese just to charged me 13 dollars", "author": "Juana M F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "One of my fav spots in Brooklyn to grab a quick bite to eat..they have a huge selection of toppings for salads, fish, rice and beans, chicken, ox tails and vegetables.", "author": "Carolyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "Love this place! I stay close by for work regularly and have made this place my go to breakfast spot! They have fresh made juice which is amazing and really cheap! As for breakfast I've gotten the oatmeal, made my own yogurt parfait, and latest obsession is the breakfast burrito which is eggs, roasted chicken, guacamole, lettuce, tomato and cheddar cheese- it is out of this world! They also have a variety of omelets and other wraps and salads to choose from. Staff is super friendly and I love how affordable everything is! A must try local spot in Brooklyn!", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-29", "description": "Not a bad little Spanish style restaurant in downtown Brooklyn.  A decent sized selection of hot foods and sides.  I had a pork chop, yellow rice, corn and a bottle of water for $10.  You can't beat that.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-30", "description": "The food here has always been a hit or miss , but recently I went in and ordered cheesecake from them. As I'm eating the cheesecake it was tasting a little old and when I flipped the piece upside down I found mold on the bottom.  I'll never be eating here again. Please be aware of what you eat.  My money was refunded to me but I'll never go back.", "author": "Rachel A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-26", "description": "I usually get breakfast at a few places in the morning, Tio Pio being one of them.  The prices are pretty reasonable and the food is just ok.  Now and again, I'll get some egg shell pieces in my sandwich.  This morning I got an over toasted roll they tried to save for my sandwich.  It would have taken another minute to fix the issue and re-toast a new bread but they didn't.  Probably would have given two stars, but the cashier is good.  She's quick and knows what she's doing.", "author": "Karl Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Had breakfast here and it was delicious. I highly recommend their cafe con leche (coffee with milk)--- it reminded me a lot of home.", "author": "Seeohme M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "It has been so hard for me to find a location near the metro tech center area with affordable options and great service...then I found Tio Pio. I've experienced it at different times - during peak lunch time hours and after 5pm. When I went after 5pm, the food tasted kinda dry but when I went at like 2 pm, the food was just right.\n\nI never regret spending money on my meal ($9!) Depending on the server, they may or may not try to be slick and give you small portions. If I leave and my container of food feels light, something is wrong. On a good day, my favorite employees are working at the hot food station and they always hook me up. The chicken tastes like it was taken right off the grill...so good! \n\nI love to have options and Tio Pio has plenty of them. The cake display looks really good too. No matter how long the line is, they move pretty fast so don't let that scare you away from walking in. I give this restaurant a solid 4 stars!", "author": "Xavier Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "Love it here!  I have been waiting for them to reopen.  The location looks fresh and I would be more likely to spend my lunch break there now then before.  \n\nThe food is great.  The salmon is my go-to when counting calories, but everything I've sampled is good.  The greens, choices of chicken and rice with beans are all good choices and the portions are big enough to eat in two days.", "author": "Reesa A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-23", "description": "What can be said about this place? Yes. I remember. Forgettable. I'll stop right here.", "author": "Gif A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-13", "description": "NOTE: 3.5 Stars\n\nI would like to give this place another try. I came here during lunch and it was a madhouse. Took me a bit of time to order, get my food and leave. The food was pretty good once I finally got to eating it. I got the oxtails with rice and beans. All very tasty and I was promptly half asleep at my desk after eating it. A sign of a good meal is sleepiness and lack of focus on work for the rest of the afternoon. \n\nWill have to give this place another try for dinner. The lunch rush was chaotic. I didn't feel like I was getting much of a deal as my food ended up being almost $13 dollars. Everything around the Metrotech area is overpriced as hell for no reason but I guess with so many patrons they can charge a premium. Staff was very friendly and tried to get things moving as quickly as they could despite the long line. If you do not want hot food they had a salad bar available. Honestly there are better places to get a salad in the area especially right down the street. \n\nOverall I really enjoyed the food and the dream I had while napping afterwards was pretty hilarious.", "author": "Eric R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-15", "description": "I think the food is okay. I enjoy the oxtails. I'll eat here once in a blue, only because it is very close to my job. I would give it two \u0026 a half stars, but my boyfriend refuses, his comment to follow........\n\nIs there a rating below zero? Because that's what I would rate this place. The food is a crime to taste buds; bland but at the same time taste horrible. I ate here twice, the first time I had fried Tilapia with the worst tasting Mac \u0026 Cheese I've experienced in 29 years. The second time was Salmon, that I'm sure was fished from the dankest, dirtiest most vile recesses of the East River to taste as bad as it did. I couldn't stomach more than two bites. I put it in the work fridge to disappear into the land of forgotten lunches for all time. I wouldn't recommend this place to anyone, when there are so many good soup kitchens to get canned okra or other such undesirable goods collected by rambunctious second graders during thanksgiving season. In the end we're forced to give it a one because we cant give it any lower.", "author": "J A M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-15", "description": "Food was dry as if it was there for a long time. It didn't have any taste. Bad service \u0026 it was expensive. Terrible experience!", "author": "Juan T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-01", "description": "Not sure how ANYONE can give this place more than one star...Not authentic and food has NO FLAVOR it is EXTREMELY BLAND.  Anyone giving this place more than two stars must not know what real latino food taste like!!!", "author": "Enidm1273 .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-30", "description": "It's 6am and I decided to give this place a chance. I've seen it during normal hours and never gave it a shot. \nWalked in and it was busy with construction workers, which is understandable. The staff seemed friendly and I ordered an egg white with turkey and tomato on a TOASTED roll. Got the roll and it was tasty, as tasty as egg white and turkey can be I imagine. BUT THE ROLL WASN'T TOASTED. Something so simple and it was too early to start messing up orders. \n\nI'll give them another try at getting it right and a chance at some other things before getting another star but 3 is all I can do right now.  Place is clean despite the B rating. But it was 6am also!!", "author": "Tony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "I love my mom, but Tio Pio makes better ribs. And rice and beans. And broccoli. Would eat here every day if I had the funds.", "author": "Behlor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-03", "description": "If youre downtown brooklyn then you need to try this spot at least once. \n\nThis place has the best spanish food I've tasted in Brooklyn...this location at least. They pile on food into your container and they charge a reasonable rate for it. You can easily share one plate between two people. \n\nPlace is always clean and staff are super quick (i think they can see the hunger in your eyes). With any meal you get I suggest you pay the extra buck and get the \"green sauce\", it adds something new to your already amazing meal.\n\nThey accept cards (credit $10 min and debit $6 min) but of course they prefer cash.", "author": "Quincy T."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "Tio Pio", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9zlFTZZvWOByNC4uzNC2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188753097"}