{"aggregateRating": {"reviewCount": 95, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "Every time I come in here, I immediately feel stoned and also like I'm in California. I don't really know what's going on, but I like it.", "author": "Yana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-10", "description": "Lots of selections and very awesome desserts. The beef stew was pretty good.", "author": "Oscar A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-14", "description": "Generous portions, great prices, make SURE you get the green sauce when you're paying for food.", "author": "Wilbur Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-16", "description": "I visit here often when I went in today I had a person help me that never has I had to put him in his place.I ordered beef stew and he tried to fill the whole plate up with the rice as I watched him put the beef cubes in the plate there was six pieces I asked him how much the order was he said ten dollars I looked at him like he was insane.I said you are gonna have to put more beef in there he said look its deep and I said there is six pieces of beef he said I put more I charge more needless to say I didnt pay more.where do pp get off doing stuff like this?", "author": "Tracy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-20", "description": "A Very good latin restaurant; Quality with Quantity.  Everyday you will be able to get your choice of meat with 2 sides in a very affordable range of 6-10 dollars.\n\nDepending on what day you go there will be different sides available such as Stewed Okra (which is delicious), Yucca, platanos, A variety of rices and pasta, beans dishes, salads, fresh fruits in conjunction with choice of protein.\n\nFried Chicken, Grilled Chicken, Chicken Cutlet, Rotisserie run you 6 with 2 sides.  All of them are quite delicious.  I'd advise against the cutlet at it is the most average of all of the chicken dishes available. The rotisserie and grilled are succelent and full of flavor.  ANd they give tremendous portions either 2 pieces fried, or about 1 1/2 chicken breasts otherwise.\n\nOne of the most underrated dishes in food history Pernil (puerto rican pork shoulder) runs you at 7.  The pernil is usually quite succelent but there are days where it is a little on the dry side.  I would look at it first before you get it...but it doesn't dissappoint when it is moist as it has the \"Falling off the bone\" texture.  It is Easily the most flavorful dish here to point where i must reiterate how criminally slept on this dish is\n\nThe fishes/seafood are a little more expensive as i believe the salmon with 2 sides is 9.  Grilled Shrimp or Fried Fish is the fare here, and it isn't bad at all.\n\nYou should get your food with the green hot sauce...which is excellent, not too spicy and extremely flavorful.  Pretty much this place is perfect.  They took the opposite approach to food.   Cheap and Delicious...(which is why there is always long lines at lunchtime).", "author": "Ken Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-12", "description": "I am not sure if we went on a bad day but the chicken was dry, the whole plate ( 1/2 chicken, rice, plantain) was cold after few minutes. Not impressed at all, we ate because we were hungry. 2 stars because we liked their chocolate chip cookies otherwise, 1 star for me.", "author": "Yumi I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-29", "description": "I went there on a Sunday afternoon and while it wasn't busy the guy serving me seemed to have much more important things going on. Food was ok, price was a bit steep...maybe it was just a bad day.", "author": "Octavia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-16", "description": "Best lunch spot I found in the area! Great fresh food with a variety of options. Their chicken in the bomb, but don't pass up their excellent empanadas. They are baked to crusty perfection, and while all of the varieties are great, the pork had me coming back to order some for home! I'm in this area for jury duty, but the jury is out on whether I'll find a better lunchtime meal in BK!", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "I used to work in downtown Brooklyn, and it was a TREAT to know that 5 days a week, up to two times a day, I could go to TP and enjoy a meal. from the time you touch the block, the aroma of home-cooked food smacks you in the face. \n\nbreakfast sandwiches are ALWAYS fresh, and they seem to move pretty quickly, one person taking orders, one on the grill, two cashiers, handling coffee/tea. and you can watch them preparing lunch for the afternoon! Everything, fried chicken, rotisserie chicken, pernil (which is the BEST IVE EVER HAD) chicken cutlet, grilled shrimp/salmon, and about 10 different sides to choose from. \n\nWith the exception of pricey seafood platters (around 12 bucks) all the food here is reasonably priced, and fresh. Easily the best food you'll get downtown brooklyn, if you're looking for that fresh, latin cuisine.", "author": "I G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-16", "description": "Very friendly, stayed open late for us. Food was tasty, cooked to order, and reasonably priced. Had the pork, a nice sized brger, plaintains that weren't too sweet like some places, and decent flan.", "author": "Deirdre R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-22", "description": "The prices just went up.  $12 for salmon with a side of rice and a small side of salad.  The rotisserie chicken and the Pernil (pork) are very good and more reasonably priced.  I think the green sauce is too hot, but some people may like.  I loved the spinach and carrot salad as a side (and I don't even fancy spinach!).  Also, it can get pretty crowded around lunch time and there isn't a lot of seating space available.", "author": "Parent N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-21", "description": "this place have gotten better, because in the past there food would always send me to the restroom!!! ugh dont get me wrong a few things would be good but othere things would taste like nothing. i dont know if its the oil or I dont know but never going bac. hope they get better. looks can be deceiving.", "author": "Redgem M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "I heard about Tio Pip through a friend and decided to try it because I work right at Metrotech. Their food is pretty damn good, but it is definitely not something you want to eat everyday. Watch out for your waistline. \nWell, I have to be honest, I would definitely enjoy gaining weight if most of the weight had been acquired here at Tio. They're food is starchy but delicious. Their mac and cheese is very good, as well as their pernil and rotisserie chicken. My three favorite dishes here are the pernil, the pernil and the pernil. It's soft and flavorful although it might be a bit salty for some tastes. \nThe service is great. The food is prepared very quickly and you can definitely be in and out of Tio Pio in 5 minutes. I would never eat in here, as the environment and decor are both a little tacky, but I don't think most people who eat there care. Even if I were to stay. the food is definitely worth the crappy environment. Usually I order from grubhub(they always suggest a 30 minute pickup time) and within 20 minutes I can be back at the office eating. \nI'd recommend Tio Pio to anyone who likes large portions or soul food. I would also recommend Tio to anyone who smokes weed because I'm sure the experience would be amazing. \nAll in all, hats off to Tio Pio for good food, reasonable prices and great portions.", "author": "Damiane N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-17", "description": "no complaints here, like everyone said the food is delicious--lots of options---cheap and huge portions. when i used to work in downtown bk i used to always get the roasted chicken, pasta with alfredo sauce and some yellow rice for 6$ and i could never ever finish it.", "author": "Sam B."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "Tio Pio", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9zlFTZZvWOByNC4uzNC2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188753097"}