{"aggregateRating": {"reviewCount": 95, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "What a sick joke! I've been waiting for this day to come. I was up till 1:00am debating if I should have the chicken or the pernil. I've been anxious for a week to come here and finally the day came... only to find out it is now closed due to a fire. LITERALLY, it has been one week since the last person to review this place. 12 reviews done before me.. I must be unlucky 13.\n\nI settled for Chinese take out. This makes me a sad panda.\n\nTo Tio Pio: Come back with the same old food and same prices please! I will be waiting for the day you reopen! I hope everyone came out safe and in good health!\n\nRumor has it Tio Pio is back in business at this location! Time to check it out!!!", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-04", "description": "It's just okay. A bit on the pricey side, but you get a lot of food. Food is kinda mediocre though so I don't think it is worth the large portion size. The green sauce is nothing like \"Pio Pio\"s sauce so don't expect that either. I don't think I need to go back.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "I work in downtown BK and not familiar with this area and what foods are near by. But with the help of seamless web I found this place and I am beyond pleased with food. I ordered the pernil (roast pork) white rice and an avacado salad which was absolutely delicious!!!  For the price the quality was beyond my expectations. The pio tio sauce was so good! I honestly can say i had no complaints. The portion size is enough for 2 ppl to share. Highly recommend", "author": "Latrisha G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-27", "description": "Being in a hurry and not hungry for anything in particular, I decided to give this place a try.  I have previously been to Pio Pio and other Colombian restaurants and I haven't had a problem with those.  The advertisement and decor choices seems to suggest that both restaurants have similar parentage.    The place is medium sized with some tables and stools on the window facing the outside.  The decor is fairly colorful and vibrant.  \n\nI saw that they had a special on a Cuban sandwich with fries and lemonade, so I went with that.  I thought the combination was strange but I decided to give it a try.  The price seemed fair for the meal.  The sandwich could have been better, if for example instead of throwing a whole pickle cut into quarters they could have made vertical cuts into slices.  The bread used was not as fresh as it could have been, but they did a good job pressing the sandwich.  They were fairly generous with the pork, which is always appreciated.  Overall they had a good general idea of what the sandwich was supposed to be (and not supposed to be - I have been to some places that put lettuce and tomato in the sandwich and they have the nerve to call it a Cuban sandwich).  As for the fries, they were fairly stale and most likely reheated.  It would have probably been in their best interest to just offer chips as it would be a better combo.  Finally, the lemonade was quite refreshing not overly sweet as most things are nowadays but not bitter either.  It was just the right balance.  Overall, it was average:  the food wasn't amazing but it wasn't terrible either, their portions were fairly generous, from what can be seen the workers are fairly hygienic and the place seems clean, some of their food is dry (ie; fries) but it is kind of expected.", "author": "Gabriel O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "unexpectedly surprised by the great service and food, plus good price\nI've always walked by it,, but tried this place last Saturday for the first time.\n\nhad half chicken with salad, a soup came with it. their green sauce is really good.\nI will definitely go back to this place whenever I crave for the rotisserie chicken!", "author": "Grace C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-27", "description": "Good food; one of the best lunch spots in the area. --\n\nI frequent this place often for lunch. I have always been very happy with the food.  I usually get the grilled chicken with veggies, broccoli, and streamed vegetables which comes to about $8 (1 meat and two sides). The price is cheap when you factor in the size of the portions.\n\nWhen I don't want the large portions or to have a lunch over $8, I usually opt for a pint of their split pea soup or lentils soup (when they have it). The pint is definitely enough to fill me up because their soups are more on the hearty side. This route also seems to be the cheapest because they're soups are roughly $3.50 for a pint of what I would say, is good quality soup.\n\nI get that portions are large, but I don't need them to be large. I'd rather there be a smaller portion option that costs less. Until that changes, the soup is good enough on daily basis and I'll splurge once in a while on the meal.  Would be four stars if such options existed.", "author": "M R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "Split pea soup is great.  Ask for the green sauce at check out.  Pork is very tender.", "author": "Ted S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-07", "description": "It's a pretty decent place. Price isn't bad. I actually highly recommend getting the salads from this place, they're fairly inexpensive and, if you're a meat lover like I am, they're generous with the chicken they put. Otherwise, this place is pretty standard.", "author": "Sherief M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Great for breakfast platters and wide Lunch selection. It has a home kitchen ambiance, love the service and quality of food. Prefer it over metro cafe and Au ban pain experience.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-24", "description": "This is my go-to spot in Brooklyn Heights for food.  I eat here about 3-4 times a week.  I usually don't get home from work until about 8:30-9 PM and Brooklyn Heights likes to shut down early so in fairness I don't have too many options.\n\nThis place gives you crazy large portions, good food, and friendly service.  Green sauce is a must!  I do get confused as sometimes they offer me free soup and sometimes they don't - not sure what qualifies me some days.\n\nLarge menu of options from breakfast to dinner, salad to hot foods.\n\nNothing fancy but always yummy!", "author": "Jen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "Amazing spanish food. Best plce in downtown brooklyn. This is my everyday place. Love their mashed potatoes with fish meal just amazing", "author": "Jani S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "Work in the area and come here for the Cuban Sandwich.  It is the best I've ever had. Loaded with tender pork with crispy flavorful skin and some pieces of juicy fat. I always get it to go and the bread is never soggy when I open it up. Not cheap for $8.50 but you def get your moneys worth. The place gets pretty packed during lunch and feels grimey which is why I always get to go but they def serve up good quality food.", "author": "Phuong P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "Tio pio is has good chicken but they didn't heat it, so it was kind of cold. Good veggies and mash potatoes. Good seating and friendly staff.", "author": "Hudson K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "Consistent good quality latin takeout. Small sitting area with tvs. They also have a good selection of deserts.", "author": "Gabriel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-04", "description": "Limited are those who work/go to school in the Metrotech area in regards to viable lunch options. Of course there is Luciano's, Metro Cafe, Au Bon Pain, Five Guys, and Wok 'N Roll (really bad) all within the Metrotech courtyard, but if one dares to venture beyond the confines of the courtyard they will find themselves in heaven... if heaven was a bounty of Spanish food served piping hot and spilling out the sides of styrofoam containers.\n\nTio Pio doesn't skimp. In fact one of my biggest complaints is that they give way too much food. The roast chicken is always fresh and moist and the sides (so many to choose from!) are all pretty good themselves. Personally, I love their pico de gallo on top of grilled chicken on a bed of greens. \n\nBreakfast is cheap, fast, and delicious.\n\nPlenty of seating both indoors and out. Coming in before noon is your best bet as the food is freshest and the lines are nonexistent. Don't forget to save room for dessert... their pastries are great.\n\n*Accepts credit ($10 min) and debit ($6 min) cards.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "Not bad but I wouldn't go out of my way to get some Tio Pio. I ordered the #1 priced at $7.75 which came with 1/4 chicken, white rice, beans and a side of plantains. It is definitely a lot of starch. The chicken was juicy and moist and I surprisingly loved the plantains (absolutely hate them everywhere else I've tried them so it's significant). I wish the green sauce that a few other yelpers mentioned had more heat and less of a creamy texture. The beans were a little bland and the rice was clumpy but not enough to make me dislike either one. All in all A-OK.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-01", "description": "Veggie burrito was good. Mac and cheese was ok (a bit bland, but better with that tasty green sauce).  Service was attentive and overall friendly staff experience.  Just what we needed before a shopping spree in downtown bkln.", "author": "J H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "Pretty decent rotisserie chicken and affordable for takeout", "author": "Chi J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "Great food.  Fast service.  Would call it to notch.  But it fills the need to eat.", "author": "Jovan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "This review is only for the cakes....\n\nI went there a few weeks ago for a snack, before going to the movies across the street.  The staff was friendly considering they were closing and let me run in really quick for a bite.  The strawberry shortcake is divine, as is the oreo cookie cake.  I will be back again to sample the other food, because of their patience and courtesy.", "author": "Cassandra S."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "Tio Pio", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9zlFTZZvWOByNC4uzNC2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188753097"}