{"aggregateRating": {"reviewCount": 95, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-28", "description": "Everyone knows and expects inflated food prices due to corporate buildings in the surrounding area but this place is a great deal for the amount of food you get. The typical meal deal is your choice of protein ranging from rotisserie chicken to pernil to fried fish fillets and 2 sides ranging from rice to plantains to salad. If that's not what you want, they have a decent sized salad bar with all the fixings. The seating area is not built for comfort but speed. You get your food, you sit down, you eat, you get out.\n\nI walked up to the counter and was immediately served. I chose pernil aka slow roasted pork with plantains and Mac and cheese.  The pernil was a nice mix of fatty and lean with crunchy skin seasoned well and not too salty. The Mac and cheese was aldente and not over cooked with enough cheese without it feeling too greasy. The plantains were a little under fried so it was a bit firmer than I prefer but wasn't too bad. I started getting full 3/4 way through but powered through and joined the clean plate club.\n\nIf you're in the area and want a good portion of delicious food at a very good price, this is the place for you.", "author": "Louis C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-18", "description": "Racist!!!!!! Towards other Spanish and black people. I  spent money at this establishment and the employees from the food area refused to provide me with the code to use the bathroom because I could not find my receipt. Knowingly I had paid for my  food there and a worker was trying to force a paying customer to walk to the register and get a receipt. I than personally refused to go back because they knew I am eating something from Tio Pio during lunch break downtown Brooklyn. I felt belittled as a paying customer I was embarrassed. I would never go back in this place and spend another dollar. To think I was treated like a second class citizen by second class citizens.", "author": "Kearny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "My g2 for a quick empanada (cheese is good). I've had their feta and spinach omelette platter and the french toast is made different than what I'm used to buuuut it's yummy. Also must try the burrito loco! It's way under rated. The workers are friendly and give great service.", "author": "Ezer K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-17", "description": "I used to go to school and work near this place and randomly gave this place a try. Good thing I did because I enjoyed my meal on lunch break.  Boy I wished I went here sooner the food is decent and with good portions. I would usually get a meal with the Tres (or 3 which is actually written on the sign  if you look for it lol)  Leches cake. This would last me lunch and dinner. They have enough seating for you to enjoy your meal. I don't sit in the restaurant because there is always space in the break room or on campus. If I would want to get away from everybody sitting there would be a great idea though. Unless if I'm in the area and in for a craving I would come here other wise I just keep it going. \n\nI have never had their breakfast. I've been told though by my old coworkers that it was affordable and good as well.\n\nThe servers are nice and engaging. When I used to frequent there I would always exsprience good service. Honestly the last time I was there was about a month ago and it was pretty consistent from the old working days. \n\nFor anyone, who in the downtown area everyday and is looking for something filling and affordable, this place is for you. Honestly filled up and the meal may last you for another meal. You can't beat that.", "author": "Diane D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-03", "description": "Ordered delivery from here .\nYou get what you pay for in this place 8 dollars for pernil rice beans and sweet plantains . Good amount of food for 8 bucks but quality was not good . \nOkay at best . Rice was hard . Sweet plantains were not good quality got lots of fat with my pernil. \nBeans on the other hand were great with very good flavor .\nI would order again because of the price but next time I'm going with a the grilled chicken instead of the pernil", "author": "Greg K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-23", "description": "Cheap, fast and huge portions at Tio Pio. There is a salad line and a hot food line. I was served right away - in and out (take-out) in five minutes. Many different meat and fish options with typical Spanish sides (rices, plantains, beans etc). \n\nLunch came to $9.25 with tax for 1/4 rotisserie chicken with 3 sides - I got spinach, yuca and Spanish rice. Food was fine - chicken had good flavor but was somewhat dry. Rice was great while yuca and spinach were just mediocre. I was certainly full after (couldn't even finish it all), so I would recommend for a quick, inexpensive lunch in Downtown Brooklyn.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Ordered over a dozen breakfasts to go for a work event occurring early in the AM. Their food was plentiful, delicious, well packed and service was so polite and positive.", "author": "J H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "MMMMMMMMM!!!\n\nThis place is SO GOOD! We've eaten here twice since we've been in town and it was great for lunch and breakfast. There are so many choices, including hot Latin entrées, big salads, pastries and smoothies. \n\nI'll probably eat there tomorrow. Oh, the chicken enchiladas were not great.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-02", "description": "I found this gem after a long morning of errands and am so happy I did. You can get custom salads, juice/smoothies or a platter of delicious Spanish food. If you're a picky eater like me than I highly recommend this place as you can pick and choose as much as you'd like :-)\n\nBeing the only Spanish food place in the area other than Sophie's which is most definitely pricier, I can definitely foresee long lines at certain times of the day. But at 3 o'clock on this beautiful Saturday, the place isn't all that busy.", "author": "Shakira W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-12", "description": "My friend Ordered breakfast this morning and it was horrible.  The pancakes tasted of old grilled food. The eggs were not cooked to compketion and the bacon reeked of grease.  I myself ordered an empanada and wasn't pleased with the texture nor flavors. I recall going to tio pio during my collegiate days at Poly and also being a little dissapointed in the food.  Get better!", "author": "Asiah C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-07", "description": "I have bought breakfast from here for many years but I refuse to pay the ridiculous price increases. There is no way a sandwich that cost me $5.75 on Friday should jump to $6.80 on Monday. You should at least warn your customers of the increase. They just sprung the new price on me at the counter. I won't eat here anymore. This is the most expensive breakfast spot downtown. Many other options available.", "author": "Tahj W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "A co-worker introduced me to this place 2 weeks ago and I've been a regular ever since.  I love it!  The atmosphere in the restaurant is lively.  But the selection of food takes the cake!  Anything from an empenada (sp?), to a salad bar, to a sandwich, to your selection of a hot meal (variety of rices, vegetables and meats).  For lunch you can get rice, 2 sides and one meat for $8.00.  And the portions are huge.  I never finish all in one sitting, so I save the remaining food for the next day.  Which is $4 for lunch each day.  Not bad.\n\nOverall Rating: B+", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-29", "description": "Not too bad, but definitely not the best ever.  The Tio Pio spinach wrap came with grilled chicken, zucchini, carrots, avocados, and the avocado based Tio Pio hot sauce.  I had a bone in my chicken that I had to remove, but otherwise the food was serviceable.  A bit on the bland side for my taste, but the namesake sauce kicked things up a notch.  All in all, this is a place to fill your belly with food to tide you over for a much more amazing meal ahead.  I'll pass this by next time and just skip to the good stuff!", "author": "Ed C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-28", "description": "Lunch time today was my first time ordering food from here. My co-worker recommended this  restaurant to me.\n\nI had a taste for soup and salad. I ordered at the salad bar. They do have a wide variety of different salad toppings and different types of greens.\n\nI ordered Romaine with onions, 1 egg, bacon bits, carrots with balsamic vinaigrette dressing. The dressing tasted like nothing. It just made my salad moist / wet /taste like something was on there, but dressing had no flavor of any kind.\n\nAlso ordered chicken noodle soup. It tastes like the same chicken noodle soup that the Chinese restaurants (take out) serve. Nothing special. Bland not much flavor.\n\nThe good thing about the meal was that the portions were a nice size and I was full at work all day. Was not hungry at all. So that was good.\n\nThe customer service was not friendly, but I suppose what can you expect with a take-out spot, right?\n\nWill I order take out from here again? No, there are plenty of options down town Brooklyn. But thanks.\n\nOh, almost forgot to mention that my order was $10.89.", "author": "Tiffany G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-27", "description": "Received our order, but it was missing a few things!!! No ketchup, no mayo, no pickles and no salad dressing!! Sandwich was suppose to have fried onions but came with way too many raw onions and not enough lettuce and no tomatoes!!! Lettuce in salad looked wet and soggy!!! Obviously they don't care about their customers!! Won't be ordering from this place again!!", "author": "J B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "So good. I recommend the chicken and amazing sides. Prices are reasonable but drinks are too expensive. The restaurant get super packed during lunch time and so I only ordered take outs so far.", "author": "Ann W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Literally just finished my gluten free bagel with butter  from here. Have to say, it was not your average gluten free bagel. I've noticed stores that do not specialise in gluten free food will use pre-made bagels (i.e. fresh \u0026 co) but no way were these pre-bought from another business. This bagel was SO thick and flavoursome I honestly got worried that it was a wheat bagel. Plus, they only charge 50 CENTS extra for a gluten free bagel!!!\n\nIf I had any concerns, it would be that they were pretty stingy with the  butter. Having said that, a gluten free THICK bagel for under $4 is a rarity in NYC and I'll definitely be going to this place again.", "author": "Anika F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "This location is great!  They have a variety of options ranging from breakfast items including bagels, muffins, pastries and hot food to a salad station and hot food for lunches. The coffee is fresh and hot. The service is also friendly. Definitely recommend!", "author": "Cortney W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "I love coming here for lunch, service is fast and portions are generous for the price. This is a great little spot for a quick bite when you only have 30 minutes for break", "author": "Denny B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-04", "description": "You come here because you want to splurge on calories. \n\nDo yourself a favor and skip that salad bar - their chicken is dry and the veggies are just sub-par.\n\nGet in the hot-meal line... I always go for the rice and beans, as well as mac and cheese... Actually, I think those are the only two sides Ive gotten there. Ive had the oxtail and the roast pork - both are greasy and salty, but oh, so delicioso.", "author": "Heather H."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "Tio Pio", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9zlFTZZvWOByNC4uzNC2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188753097"}