{"aggregateRating": {"reviewCount": 95, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-18", "description": "my change was short $10 . I spoke to owner,  he was extremely nasty and rude. Carlos the owner/ manager \"told me it's my fault and maybe I mysteriously dropped the $10 where ever I came from\" . I asked Carlos , does he feel he has a responsibility to his customers to make sure their change is given correctly : \"He stated No\" . I'm going to post a notice in my metrotech building and send an inter office email to discourage anybody to buy food from that restaurant !", "author": "Kerry Ann B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-27", "description": "Yum.\n\n-Beef Stew Speciality\n-Mac and Cheese\n-Rice\n-Tres Leches (Strawberry Cheesecake)\n-Lemonade", "author": "James W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-07", "description": "The portions are indeed generous.  If it's your first time, then stick with items that are next to impossible to screw up.  During my first visit, I ordered lemon chicken, steamed mixed vegetables, and Spanish rice.\n\nThe Spanish rice was a bland, but I wasn't expecting anything authentic when it's being served out of a warming tray.\n\nThe steamed mixed vegetables weren't overcooked and unseasoned--just how I like it.\n\nThe lemon chicken was exactly that--lemony.  There were even a couple of capers in the mix.\n\nI've also had the beans and rice (also bland) and the pulled pork (needs hot sauce).\n\nSeating is cramped, but if you wait long enough a table will open up eventually.\n\nI'm not sure if this place is cash only, but I've only paid with cash here and I've only seen other customers pay with cash.\n\nThe food is decent and pricing is fine.  You should expect to pay $8-$10 for a hot combo meal.\n\nSave me a seat...", "author": "Nino R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-15", "description": "The breakfast is completely awful. Nasty burnt eggs and bacon. Ugh! I will never eat here again.", "author": "Marz D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "I liked the food very much. The place is clean and organized. It's not very big but there is room to eat in. I had the oxtails,rice and beans with plantains. My co- worker had  the grilled Shrimp with Alfredo pasta and steamed broccoli. We both cleaned our plates. The only thing missing was a slice of cheese cake, they didn't have any. The staff were friendly. I will definitely eat there again.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-14", "description": "Sooooo I was really looking forward to eating my lunch from Tio Pio until I opened the container to find three medium sized turd looking plantains in my plate. wtf?? why the hell would you give that to someone? While I understand it's the \"lunch hour rush\" I'm sure its not something that was overlooked.", "author": "Nicci g."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-19", "description": "I got the rotisserie chicken from here last night and was not impressed with it at all. Rather than sitting inside the rotisserie oven, the chicken was already cut up and on a steamer table.  Latin style rotisserie chickens are usually very flavorful and moist, but this one was super dry and bland.  I think my supermarket sells better tasting chickens than this place and for much cheaper.  I definitely won't be going back.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "Everything I had here was really good. Chicken ,fish , pork chops with rice n beans n some avocado can never go wrong", "author": "Nick C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-19", "description": "I was extremely disgusted by this place. The coffee tasted like the coffee machine was not cleaned properly, the turkey bacon was improperly cooked, and for two western omelets, I was charged 20 dollars. This place relies on its brand and not the quality. Two thumbs down!!!", "author": "Justin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-19", "description": "Service is less than stellar but tolerable. Just an 'ok' lunch place, nothing noteworthy or special. Prices are about the same for the area. I'm having a hard time writing anything good about the food.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-26", "description": "Looks good on the outside - but be cautioned.  The food is hit or miss and the pricing is arbitrary.  No prices are posted and when you ask how much something is they give you a hard time - it seems like they make up the prices depending on what suits them.  I've left food at the counter more than once because they jack up the price when you get to the register.  It is also cold in the front dining area during winter. Don't bother", "author": "Carl E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-08", "description": "This might be a restaurant first...I ordered a soup for takeout, it was handed to a cashier who packaged it up for me and I gave her my credit card.  She said, \"$6 minimum\" so I showed her the single dollar bill in my wallet.  Then...wait for it...she unpacked my soup and wouldn't let me buy it!", "author": "Jeremy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Go to spot at lunch time !!! Great choices in their buffet bar and great price at that. Plus that hot green sauce fits great with the grilled chicken.", "author": "Eddy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-30", "description": "Good spot for lunch if you work in the area. The selection is wide and the prices are more reasonable than their competitor, Court Order which is located a few blocks north. I specifically enjoy their salads, which can be priced $2-3 less than comparable ones are at Court Order.", "author": "Jake P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-07", "description": "Love this place. If you want some hearty Spanish food for relatively cheap price, then this is your joint. I always get the Cuban Delux for 9 bucks and the home made lemondae. Altogether 12 bucks and the Cuban Delux is large enough to be comfortably shared by 2 people. I couldn't eat it all on my own! \n\nDecor is so so but screw that; this place is meant to get your food, eat and scoot. Anyplace you sit, you get a great view of the outside world.", "author": "Lars Lars P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-16", "description": "Absolutely true anecdote: I used to live near here, so I went to this place the day it opened. I ordered a grilled cheese because I love grilled cheese. The guy looked at me, and then at his coworker, and then back at me, and indicated that he didn't understand. \"A grilled cheese\", I said. \"You know, a grilled cheese sandwich?\" \n\nHe had a two-minute long conversation in Spanish with the coworker, who seemed to be explaining to him what a grilled cheese was. He then proceeded to remove a single slice of American cheese from a package, place it directly on the grill, and stared at it as it bubbled and became stuck to the grill. He then scooped it up with a spatula, wiped it on a piece of bread, and presented it to me proudly. Hilarious. And terrible. I do not recommend this place.", "author": "Molly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-17", "description": "I used to work over there and the lunch options in the Downtown Brooklyn/Fulton Street area are severely limited.  This place is AMAZING!  I could seriously live on a quarter chicken with rice, beans and plantains ($6.50).  It is super delicious and the portions are huge!  The rub/seasoning on the chicken is so tasty and the chicken is always moist and tender.  The rice and beans would make my day.  Do yourself a favor and ask for some \"green sauce\" on the side and pour it over everything, if you like a spicy kick.  I also loved the Tio Pio wrap which is sauteed zucchini, avocado and the rotisserie chicken.  I would say one of the worst things about leaving that job was having to leave Tio Pio. \n\nAlso, please don't be intimidated when you walk in and see the long line wrapped around the place, they move things real quick.", "author": "Chrissy E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "I like the fruit section because they have variety of fruits with yogurt and granola. I like their desserts as well", "author": "Almula K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-02", "description": "Food was very fresh well made . I got take out ,they were very fast and evrything tasted good! I got the chicken dish with plantains n salsa and telapia with rice .the price is $9.50 n $10+ ..so I think for the type of food they are serving price should not be more than $8.. !", "author": "Foring A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-23", "description": "A serviceable Domini-peruv-ish steam table spot. Rice and beans were not as good as most places, but the portion of pernil I got with my order was huge. Would have liked more skin though.", "author": "Christopher R."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "Tio Pio", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9zlFTZZvWOByNC4uzNC2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188753097"}