{"aggregateRating": {"reviewCount": 8, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-15", "description": "It's hard to share this place because it is a hidden gem I want to keep to myself! It's right inside the hotel with a secret patio that leads to an outdoor bar. Getting here is like a fun maze. Every time I'm here, I have to eat the apple tart with vanilla ice cream for dessert. I dare you to try their quirky soups! I had the cauliflower and white chocolate soup. Deliciously unexpected! As is the avocado soup. \nWARNING: if you try the jalapeño infused tequila mixed with homemade strawberry juice, you may just need to book a room in the hotel.", "author": "Yvonne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-02", "description": "A great addition to this ever changing area of BK! Opened in Sept 2018, it seems that they are really working hard and committed to make this restaurant and the food a  staple and favorite in the community for a long time to come.\n\nThe ambiance is very modern but also has a warm romantic feel, definitely a great place for a first date or happy hour with friends too. Loved that their menu was southern soul food concentrated and didn't have a bunch of random items just to fill the pages. Our server and the bussing staff were all really nice and accommodating. One of our dishes came out severely overdone and when we asked them to please take it back they were more than happy to oblige. The shrimp and grits had a subtle interesting twist with unsweetened coconut flakes added to the creamy grits. Their waffle was on point but as beautifully the chicken was fried to a golden crisp, it lacked seasoning. The ribs were fall off the bone tender and the crab cakes were beautifully pan fried with actually crab meat in them and thankfully NOT heavily filled in. And you must order their house made apple tart!!\n\nThey have some kinks to work out for some of their dishes but overall it was a great time, will definitely be back soon!", "author": "Jenn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-04", "description": "My family and I decided to have brunch last Saturday at Ashland. Latoya and I had the smoked salmon eggs benedict, Tariq \u0026 Elijah had a Chicken sandwich, and Jalen had french toast with scrambled eggs. Our bartender was attentive and courteous. Everyone cleaned their plates - food was delicious. All of it. \n\nMinus 1 star for having the audacity to charge $15 for a 2.5oz pour of Grand Marnier. In the 17 years that I have been drinking GM, I have never paid that much for it.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "Can't say enough about this place!  Just celebrated my daughter's wedding weekend and hosted three events at Ashland. The manager Kim was so accommodating and easy to work with. We hosted 50 people for a sit down rehearsal dinner on Friday, an after party at the bar on Saturday night and a 40 person buffet brunch on Sunday. Food was amazing, service was impeccable and Kim even kept the restaurant open (they normally close at 11) for our after party.  Conveniently located in the hotel where our wedding guests were staying made it very easy to crawl, I mean walk to our rooms at the end of the evening.  I would highly recommend Ashland and especially working with Kim. She made a very tense situation seamless  by offering her suggestions and expertise. Thanks Kim. You rock!", "author": "T V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "What a find and connected by an indoor corridor to our hotel! We came in at the low time of 3:00 pm and had a great lunch of seared salmon, Meyer lemons, roasted beets and potatoes. It was all well-seasoned and fresh.  Fast, friendly service.  Also excellent playlist: Hendrix, Stones, The Who.  Talkin bout my generation.\nYes, we will come back.", "author": "Susan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "The food, wine, and cocktails offered here are superb.  This is such a great local spot. The bar in the courtyard during the summer is awesome! Also, the Ashland Burger is delicious! Just order it!", "author": "Lace D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "The service was outstanding. Brian was very attentive to our needs. I had a chicken sandwich with avocado. The presentation was great and it was filling. The sweet potato fries were shared by 3 of us and loved by all. Kim made sure were taken care of -- Thank you Ashland!", "author": "Alicia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-20", "description": "Great food, super friendly servers and the manager Kim is so nice! It's a great place for a group of you don't want a noisy restaurant!", "author": "Sarah K."}], "servesCuisine": "American (New)", "priceRange": null, "name": "Ashland", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Tillary St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/OfqsVs82SpcsLxekmxZrCA/ls.jpg", "@type": "Restaurant", "telephone": "+17188758800"}