{"aggregateRating": {"reviewCount": 132, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "Love their spicy chicken with beans. Dont miss the fried plantains, and yes you gotta add that special green sauce to get the kick !", "author": "Sunder S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-30", "description": "First of all, be aware that they automatically add gratuity (approx. 10% regardless of party size...it was only two of us). Make sure you look at your check before adding more gratuity (as you should since the norm is 15-20%). With that out of the way, the hubby and I stopped in for 2 cubanos today. Service was fine. Food was fine. Honestly not much to rave about. The pork in the sandwiches was really dry...which is a bummer because that should be the star of the sandwich. The pickles were paper thin so they added no flavor or texture. The bread was ok. Overall it was an okay sandwich. The hubby opted for the sandwich combo that came with rice, beans and a drink. The rice and beans were fine...especially covered in the awesome green sauce that sits upon each table. The restaurant was clean, brightly lit and service was pretty good. All in all, we didn't leave hating it but don't think we will return.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "A lot of food for a low price.  The most expensive item on the menu is like $11 and it was delicious.  I ordered the garlic shrimp special.  Very flavorful.  Their green sauce on the side was amazing.  It was a delivery order and it arrived in like 15 minutes.  Definitely will be ordering from them again.", "author": "Tom F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-07", "description": "I am a huge fan of Sophie's, love their steak and peppers and chicken breast. It's too bad this place gives the chain a bad name the place is dirty bad customer service people don't speak English and the food is worse then deli food. I ordered a chicken breast with onions and peppers it was disgustingly dry. I'm gonna stick with the ones in Manhattan they know Cuban food, save your money don't go to this place", "author": "Zee S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "The spicy chicken was delicious! Don't forget the green sauce!", "author": "Rachel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "Very yummy Cuban food! Tried it for the first time at my aunt's house today in Brooklyn ( I'm visiting from NJ) and was pleasantly surprised by the deliciousness of all of our dishes. To-die-for papa rellenas and delicious rice and beans. Prices are affordable and lots of menu choices to choose from. Will definitely order from again next time I'm in Brooklyn :) Thanks for the tasty dinner, Sophie's!", "author": "Amanda G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "I don't know what to say.....I went in for a Cuban and ended up eating one of the best sandwiches ever..... I had the pernil with a twist which was recomened to me by the hot waiter. It really was amazing.........IM going back today", "author": "Jason S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-10", "description": "Every Sophie's have great food. The chicken soup and stews are very flavorful", "author": "Oscar A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-30", "description": "cheap simple cuban?\nbrooklyn franchise-like menu\nwould stop here again\n\nThis place sort of has the atmosphere of central American fast food: clean and creepy.  While you're inside, even with table service, you wonder, \"Am I at McDonalds or Chipotle or KFC?\" I don't know... and that's why it's creepy!  Regardless, my aunts and I decided that their giveaway empanadas to people in line for Brooklyn Tabernacle was enough to get us to walk in.  \n\nWe were greeted very nicely, and sat right away.  The server was quite positive and helpful as we really know nothing about Cuban food.  I think they make some nice chicken and probably will serve plantains.  I was not disappointed, and I definitely had some good chicken and fried plantains.  Delish.  \n\nIf you're looking for somethin decent, fast, cheap, and kind of exotic.  Sophie's is perfect.  Big portions too.  Splitting may be a good plan.", "author": "Paige C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-02", "description": "I love Cuban food. The food at this place is just okay. It's not great, but okay. The first time I ordered from them, the breaded chicken was overcooked, but edible. I ordered from them again hoping it would be better.  I ordered online at 12:14 and was given a delivery time of 12:44pm. The food arrived at 1:40pm, and it was cold and dry. While waiting an hour and a half for my lunch, I called the restaurant, and they weren't very helpful or apologetic. When I said that I wouldn't order from them again, they said \"Fine\" and hung up on me. I only accepted the food when it arrived because I had pre-paid for it online. Never again.", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-22", "description": "Quick, tasty, good-sized portions, reasonably priced. They have changing daily specials--I had the oxtails with yellow rice and sweet plantains", "author": "Sue W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "Love Sophie's food -- no, its not the BEST cuban you'll ever find in the city, but the quality is consistently good and the quantity is generous.  And the green sauce . . . you could pour it over a phone-book and I'd eat it.  And while I might love Habana Outpost more, Sophie's does actually have a better Cuban sandwich.  Sorry, Habana.\n\nI also need to should out the owners and managers, who were very responsive when we had a bad experience there recently.  We bought a Groupon, and went in the very next day to get our food.  Apparently one of the servers didn't know how to handle it, and instead of just saying that, he was very rude to my wife and wouldn't let her use the coupon.  She left feeling very insulted and furious, and despite our long time love of Sophies, we considered not going back.  However, I decided to use the \"Contact Us\" link on the website, and the next day received a call back from the owner apologizing and offering us a complementary meal.  When I went in later that week to take him up on the offer, the manager (who had been off the night when we went in before) was there, and went out of his way to make sure we left satisfied.  I'm not a reviewer, I don't have a food blog, and I don't drop a lot of cash when I show up, so this was just great customer service -- they seemed honestly concerned that we have a good experience, and they kept us as customers.", "author": "Chris V."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Sophie’s Cuban Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "27 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i89viUrI5M4S8IMjzLLU9A/ls.jpg", "@type": "Restaurant", "telephone": "+17182430911"}