{"aggregateRating": {"reviewCount": 132, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Food was great. Ordered to go from the buffet. The maduros are a must. Thought it was pricey but the amount was pretty big so indeed it deserves only one $.", "author": "Ilan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-09", "description": "Was my first meal in New York City. I had the Cuban sandwich and the guava empanada. The empanada was great (tangy and sweet) - the sandwich was alright but tasted a bit dry. I expected better but it was a decent meal. Their green sauce is fantastic.", "author": "Kriti P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-09", "description": "When I saw that a Sophie's was coming to BK I was the happiest chocolate chip!\n\nI love this place. It's fast food but it's actually really good. My staple is the Milanesa de pollo.. breaded chicken sandwich. So yummy... But then you gotta put the green sauce on and it's a party in your mouth!!!  Add some platanos and you got a full meal.\n\nI really find myself in trouble once a week b/c I can't walk by w/o getting something. But then i just walk for at least 3 miles so I don't feel guilty :-)", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "Much not need be said about this place, everything is incredible and you can't go wrong. The portions for the plates are massive which is always a plus and the service is quick quick quick. Is it the hippest looking place around? No but the food is great and you're there to eat.", "author": "Alexander T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Absolutely cheap, delicious and dependable Cuban food. This is a perfect lunch spot. Cuban sandwich and Moro ( mixed seasoned black bean rice) are standouts.", "author": "michelle h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "First time at Sophie's, stumbled on this gem by accident, a little $$$ , food is real good in my opinion, worth the price, staff seems friendly, look forward to my next visit", "author": "derrick u."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "Quick service very affordable enough food to fill ya and the taste was great!! So much flavor great little spot, will def check this place out again and again", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-16", "description": "A sometimes adequate option especially for delivery when in the barren wastelands of some BK neighborhoods like Dumbo.\n\nI've had the Roast Pork and the Fried Pork Chunks. Both are quite dry and sometimes I question their authenticity. Am I eating juicy, fatty pork or am I eating slices of dried tree bark foraged from the great Redwood Forest? Their overly saucy Ground Beef Stew needs no description and as for sandwiches I can only vouch for the mediocrity of the Cuban Sandwich that lacked much flavor and could be compared to a pair of old Dominos pizza crusts with a few slices of meat in between. Sides are less memorable than the mains.\n\nThe lack of care given to the cooking gives popularity to Sophie's Green Sauce which has to be added to every bite much like curry has to be added to poor quality meats or lime has to chase a cheap shot of rubbing alcohol tequila. \n\nPlus 1 star for large portions and consistency. \n\nYou may ask: Why do You keep ordering? Well...if food in Dumbo wasn't so terrible or could at least do better than -3 stars, there would not be a need to order anymore. And besides, some of us require balance in our lives. Like an undesirably grueling workout may have to follow a night of heavy drinking, a meal at Sophies may have to follow a night at Per Se.", "author": "Davis K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "Solid downtown BK Sophie's with your standard fare from the chain.", "author": "George C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-19", "description": "This is for the baked chicken with white rice.  The chicken tasted like gasoline fumes and the white rice was undercooked.  I do not recommend this dish.", "author": "Ho S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "Huge variety, clean, friendly.    Combo deal is awesome pick from over 10 sandwiches with a drink and huge portion rice and beans!!!!!  $10.49!!    You can split it with someone, if you are not famished.", "author": "HungryMan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "This place is a staple in the diet of the average Brooklyn Law School students. Amazing home cooked food, pretty fair prices and fast delivery. Definetely reccommend the pernil and the chivo guisado. \n\nThank you Sophie's for keeping me alive during finals!", "author": "Nathalia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "This place deserves 5 stars. I have never been to the restaraunt but I always order online. First off the food is really really good best Spanish food I have ever tasted. They give you 2 sides which is amazing cause most places only let you choose 1. I always get the shredded beef stew with yellow rice and salad and it comes out perfect. The meal is excellent I love that when I make a order it comes so fast like less than 30 mins. Really looking forward to going here one day and dining in.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-26", "description": "Tried this place for lunch for the first time today because I'd heard great things. The food was good, but I doubt that I'll be visiting this place again anytime soon. The customer service sucked. \n\nI ordered my food to go, but seeing how it was hot out I decided to eat in the restaurant. ALL 15 or so tables were EMPTY, so I grabbed a small 2 seater table. The manager promptly came over and said that since I ordered my food to go I wasn't allowed to sit at any of the tables. He said that I could sit in the back of the restaurant by the kitchen at this barstool area.\n\nI don't think it would've bothered so much if I wasn't LITERALLY the ONLY customer at the time. It wasn't like I hadn't just spent my money there. It wasn't like I was using up much needed table space. I don't know... just rubbed me the wrong way.", "author": "Tavaria R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-23", "description": "Let's face it. No matter how many times I say I'm going to start cooking more at home, I realize that it takes way too much work and way too much time and I mean, if I buy groceries and end up wasting them anyway... then I mean, what's the point?\n\nAnywho, Sophie's is sometimes my go to spot for a filling dinner when I'm in the mood for one (which is always). I've only ever had the shrimp in garlic sauce which is by far my favorite (and probably something I could cook at home... I digress). Now, caveat, I've only ordered delivery but delivery is always super fast, and the food is super hot. And, I don't know about you but for $12, I can get AT LEAST 2 meals out of all the food. I call that value in NYC, don't you?", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Deliciously great cuban food at Sophies Cuban Cuisine. I have been to two so far and each is great.", "author": "Pablo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "I order lunch here frequently. I get the shrimp with garlic sauce with yellow rice, yum!  The green sauce is amazing and delivery is always speedy.  Five stars if the pernil had some skin.", "author": "Yeemei C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Love coming here for some great Cuban food. Decent ambiance, great locations you can't miss it.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-30", "description": "I love the roast pork with rice and beans, I could always use more plantains on the side. So sweet and delicious, need one in my neighborhood.", "author": "Tanisha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-30", "description": "Sweet fried plantains is where it's at.\nI got the spicy chicken which wasn't really spicy but it was still good.\nFair price.", "author": "Iman R."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Sophie’s Cuban Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "27 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i89viUrI5M4S8IMjzLLU9A/ls.jpg", "@type": "Restaurant", "telephone": "+17182430911"}