{"aggregateRating": {"reviewCount": 132, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-22", "description": "The Sophie's in Tribeca taste a little better but it's still good. Their empanadas are always bomb af! My favorite is the chicken because I don't eat red meat, but all of them are GOOD! Also -- definitely try it with their hot sauce (I always get the green one) but try them all.\n\nI also had the yellow rice, black beans, and chicken. It was good but the chicken could've been seasoned more  My food HAS TO have flavor or I don't want it! Lol for this plate \u0026 2 empanadas I paid $17 ‍ a little pricey but what are you going to do? Lol", "author": "Tee H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-22", "description": "Black bean rice was drenched with pernil juice and flavor for the 1 meat lunch special with a side of maduros and a piece of tostone. Requisite, flavorful, well known joint.", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-30", "description": "So I had conflicting emotions about this place. I ordered a beef empanada which was amazing but the customer service was eh. They were not pleasant and friendly! My coworker asked what the prices were and instead of informing her she told her to look at the menu. If you ask me, it's a little unprofessional. Would I go here again, probably but I wouldn't recommend people to go.", "author": "Erica B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-09", "description": "A word to the wise: don't come here on a Sunday night. The staff are completely careless. This is my neighborhood go-to spot and because I do love the food, I am always going to be completely honest. Monday through Friday the staff are excellent. The guy who mans the cash register in the evenings is AWESOME. Please hire more people like him. But on Sundays for some reason the service deteriorates substantially. Today in particular the girl left my tiny container of rice and beans half empty and then carelessly threw my container of garlic shrimp upside down in the bag causing it to spill everywhere. So disappointing. For $15 all I expect is a full container of rice \u0026 beans and for the  cashier to be even a tiny bit careful in packing my food to go. On Sundays? Don't expect any of that. :(", "author": "Kathryn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "Good place, good choices. We had some pernil, vegetables, and croquettes. The portion sizes are huge! We wound up taking half to go and probably could have split one order.\n\nThe counter staff were very nice, quick \u0026 efficient. This place has a lot of tables (unlike some of the other locations) so we were able to get a seat at lunch time. \n\nIf we're in the neighborhood we'll stop in again!", "author": "Adele P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-14", "description": "Nice spot for some authentic Cuban cuisine. Great options. I tried their chicken sandwich which was pressed I believe. I felt the chicken was a bit dry on the inside, however they give you all the green sauce you want with your own bottle on the table. Deena my server was awesome, very attentive and great personality.", "author": "Travis L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-24", "description": "The food overall is good, but today I ordered the Special sandwich, soup and soda special. Sandwich was ok, but the Chicken soup they gave me was really really bad. It was literally chicken skin and oil. After spending 10 minutes of trying to spoon all the oil out, I just gave up and threw it out. \n\nBeen back since last review and I ordered the same Lunch special and the sandwich was good as usual and the soup was way better.  Will go back again.", "author": "Gary L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-19", "description": "The food is good but the staff are RUDE especially Nelson or Kelson whatever his name is. A person who is in the Customer Service field I find this establishment needs to step up their game with their customer service. As a paying customer I felt unwanted and that to me all they want is my money only.", "author": "Tania G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "They were really good before but are now even better.  They offer a HUGE portion of steamed vegetables with their spicy chicken, as well as delicious sides of chick peas, beans with avocado and rice.  The chicken was fresh, tender, hot and the perfect level of spicy.  The wait was short even though they were crowded during lunchtime.\n\nCan't go wrong coming here!", "author": "Jonathan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-21", "description": "Whoever runs this establishment needs to make sure all of your staff is on the same page when it comes to pricing and what you can get regarding a small and large meal, the 2 times I've visited Sophie's cuban cuisine at this location, I have a gotten a small spicy grilled chicken with rice and beans and sweet plantains as my 2 sides with no upcharge, each time I go I ask the same question will the rice and beans count as 2 sides for the small and get told no. \nNow today I go into the restaurant to order the same thing I always get and I am told now that the rice and beans equals 2 sides and that it has always been like this.. since when ??? Not when I have visited. This really pissed me off and I honestly won't be back.", "author": "Teshanee C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-08", "description": "I wish I would have taken a picture of my horrible food.  $17 for lunch and I had to throw out my food.  Oxtails dry and tough the tostones was so horrible!  How could that be possible but they were half cooked and greasy!  The location in Manhattan is so much better!  I will never eat here again!  High priced and", "author": "Precious J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-30", "description": "Nice sizeable portions of rice and beans.", "author": "Jacqueline K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-13", "description": "Food is consistently good but I'm finding it hard to justify paying $2.99 for an empanada.", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "We have ordered delivery from this place via seamless in Brooklyn multiple times and they have always sent us great food, accurately and promptly. They even added something extra last minute to our last delivery order based on our request, which is sometimes difficult when a third-party delivery service is involved.. They are a little place with a lot of work and a small amount of time to do it in and they get it done and right. Can't ask for much more in their context.", "author": "Sophea R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-09", "description": "Terrible place to eat they are Cuban want to be\nNever going to be owners are not even from Cuba, I am a Cuban born and I know what Cuban food it's all about!!! terrible terrible terrible food \nI Do Not recommend this place to eat at all..", "author": "George G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-01", "description": "HIRE BETTER PEOPLE AT THIS LOCATION. ANGRY GREMLINS WORK HERE. I LOVE Sophie's Cuban and it's a treat every time I stop by one so I was thrilled when this place opened nearby! And although the food was great, the service was HORRIBLE. I guess they thought my tan boyfriend wouldn't understand their Spanish but he did. And he understood what they were saying about him and many of the other patrons waiting to order. Rude as hell.\n\nMy boyfriend and two other customers were standing out of the line to look at the menu and get their orders together. Once the people in line were done ordering, the emplie kept saying \"Next, Next\" but no on was ready to order yet nor was anyone standing on the line. The employees barked at us to hurry up because they have phone orders and once my boyfriend was ready to order they literally looked past him! Ignored him! Asked someone behind him for their order and the guy pointed to my boyfriend and said \"He's next. He's trying to order.\" The lady gave an attitude and we had to explain to her that when people walk into a restaurant, they need a second to look at the menu. Just because you're busy at work doesn't mean your work stress should be rushing and stressing others. They apologized at the register for the attitude but that's not enough once you've already had a temper tantrum towards customers from behind the counter. Too little, too late.", "author": "Margo R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-23", "description": "Ordered delivery from this Sophie's. They only delivered half the food. I called the restaurant and let them know and they said they would deliver the missing items shortly. After waiting 40 mins I called back to again to let them know I would just prefer a refund. I was refused and told \"I had already received the food.\" Whoever answers their phone is a terrible person. Don't order from this location!", "author": "Scott M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-19", "description": "I've come here a few times for lunch. Portion sizes here are definitely generous.. food for days. Lunch specials comes with an entree and your choice of 3 sides. My go-to sides are usually the sweet plantains, which are absolutely delicious as always, black beans, and yellow rice. I tried the white beans with avocado once, I didn't really like it. The rice is a hit or miss. Sometimes it's very soggy, other times it's good. I also tried a few of the entrees, the only one I liked is prob the baked chicken. The baked chicken was juicy and flavorful. If you want a quick filling meal, I would recommend this place.", "author": "Susanna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "The best rice and beans, ever! I had today at this location one of their combo no. 2 with rice beans and two empanadas for $9.99.\nThe empanadas were delicious; I had a beef and a spinach one, and I the meat one was definitely my favorite, amazing. Rice and beans was incredible. I highly suggest this easy going restaurant in downtown Brooklyn for a good and satisfactory meal.", "author": "Martina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-05", "description": "I found myself with time to kill and hungry for lunch, so I decided to check out Sophie's for a Cuban sandwich. I figured four stars on Yelp and it's a sandwich, so should be pretty easy and good. I wasn't wrong entirely, but I was most certainly disappointed. \n\nThe line was long on a weekday afternoon, but it moved quickly. Most people seemed to be ordering from the buffet style already, but a few people got sandwiches as well. \n\nThe bread was good. The condiments were fine. But the pork, the pork was unnecessarily dry and that is unforgivable, especially since the sandwich alone plus tax cost ten dollars and change. I was not pleased. Thank goodness for the green sauce. That sauce was absolutely amazing! \n\nNeedless to say, I will not be returning here again. If the prices were better, I'd come back to try something else on the menu, slathered in green sauce of course. But they aren't and there are other tasty options around.", "author": "Maria M."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Sophie’s Cuban Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "27 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i89viUrI5M4S8IMjzLLU9A/ls.jpg", "@type": "Restaurant", "telephone": "+17182430911"}