{"aggregateRating": {"reviewCount": 132, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "Love this place! \n\nWhether I'm ordering take-out or dining in, the food is always fresh and delicious and I'm never waiting more than 5 minutes for my order. I'm pescatarian, so I can't speak of the other items, but I tend to order either the fried fish (delicious!) or the salmon (my favorite!) I just wish that Sophie's would consider adding more vegetarian options to their sides menu, as opposed to the standard salad. \n\nSpeaking of sides, my favs are the rice and beans and the plantain options. If you get the plantains, ask for the green sauce. What's in it? I don't know, but it's spicy and addictive.", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-08", "description": "This place gives me heart burn - and I'm latina! It must be all the grease they use... \n\nThe rice is oily, the chicken is dry and the green sauce is hardly authentic. The empanadas are skimpy with the meat. Come on! Only plus side is the meals are huge portions.\n\nIf you're looking for good Latin food - Cuban Food, go somewhere else. It's cheap, yes, but I prefer good food and cheap, not food that's mediocre and cheap. Pass!", "author": "Maia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-06", "description": "Stopped by here for lunch with my little one, I had first experienced Sophie's Cuban Cuisine while pregnant with my little one and that was 5 years ago. The taste of the food has changed in my opinion. All in all we enjoyed our lunch and the atmosphere.", "author": "Vonye B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-02", "description": "The empanadas were good the chicken much better than the beef. My first visit here the staff were a bit blah when asking for their opinions and not outgoing but the chicken empanadas and green sauce made up for it. Haven't tried anything else yet but I'll be back for that green sauce it's insanely good.", "author": "Gigi P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "Stopped in for a quick, inexpensive Cuban sandwich and had a delightful experience. The sandwich was delicious and came out very quickly, and the fried plantains were huge and great. The server and all of the staff were super nice and helpful, and the price was very reasonable. Great place for a quick bite to eat", "author": "Kyle D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-23", "description": "Let me keep it simple. \n\nThe food and portions are decent.  The menu is exciting with what appear to be lots of tasty options. The look of the restaurant does not match the \"Cuban\" feel you would expect it looks more like a Checkers, but the Cuban art pieces on the wall were nice. The servers were friendly. Their natural fruit juicers are a definite plus.  I tasted the one my husband was having and it was tasty. The food is good. \n\n\nWhere it didn't go so well was in the bill.  The food was decently priced, I would have come out to about $19.50, EXCEPT that they included their own gratuity. \n\n*_*\n\nUmm, excuse me? \n\nIsn't that up to the customer to determine? Our bill came out to about $23 with their included gratuity. My husband got upset because he was paying with his card and had already put the same gratuity amount in cash on the table not realizing that gratuity had been included on the bill, something they did not point out. \n\nWe're not going back, because it was just a cocky, weird, and forward thing to impose on customers.  We come into to enjoy your food, support your restaurant and your telling us how much to tip on an table for 2? This is understandable, I guess, on a table for 8 at a hipper spot, but during lunch hour, on a lunch special, for a 20 minute sit down, in Downtown Brooklyn? \n\nCome on?", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "Whenever you order food on a rainy night you expect the delivery to take forever and this was definitely not the case. I was pleasantly surprised when my food arrived so quickly. I had the shrimp with rice and beans. It was really tasty but some of the shrimp had the dreaded black line in it still. My bf had the pork and it was delicious. If you are looking for some quick Cuban food this place is definitely worth a shot. I would most likely go with the pork the next time we order from this spot.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "Two Words....\n\nMad Good!!!!\n\n\nGreat service, great food!!!", "author": "Danielle J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-27", "description": "Woohoo!\n\nThey handled a large order for my company of 15 different and semi-complicated orders well! Everything was clearly labeled and at least I can vouch for what I ordered, the ropa vieja was delicious. \n\nThey forgot 1 order and very very quickly brought it over. Props. I appreciate when you own your mistakes, especially in the customer service industry. (4 vs. 3 star difference) \n\nWe will be ordering from them again. I grew up in South Florida and I appreciate some good Cuban food!", "author": "Andres D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-13", "description": "Lord!! Two bites into my sandwich and I had tivpause and write a review! A Cuban sandwich I'd among my favorite thing in the world and this one is among the best...tender and flavorful.   I will be back every time I come to the area!!!", "author": "A D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Get their stewed oxtail and tostones aka plantains fried \nVery good !!!", "author": "Bella B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-10", "description": "The WORST experience ordering out I've ever had. My order was simple. Two sandwiches and Ropa Vieja with a side of avacado and maduros. The first problem was the deliver took way too long. An hour plus. By the time my food got here, it was cold and my plate was leaking. The portion size was ridiculous, too small to enjoy. Then, they send me beans, instead of my maduros. I call them to try and rectify their mistake, and I get a combative response. It took 5 minutes of back and forth banter to convince them that they never sent the side that I ordered. Nevermind sending me a side of beans, with no rice. Then the sandwiches were SALTY, and yhe french fries soggy and cold. Disgusting food and nasty customer service. Sophies ruined my dinner, and I will NEVER order from here again. You want authentic spanish food in the neighborhood? Call \"El nuevo portal\", or \"El Cibao\" on smith street.", "author": "Jen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-02", "description": "The rice and beans are delicious. As are the empanadas (beef and veggie are my faves). The maduros aren't syrupy sweet and cooked perfect and the aji verde is AMAZING and packs a lot of heat. The soup is a little salty and I find them to be a little pricey, but very good. Service also turns to sh*t during lunch time. Everyone behind the counter is preparing delivery orders and there's often a bit of a wait. Great overall!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "Oh how I crave Cuban food.  I had their Pernil (pulled pork), Grilled chicken, and their shrimp dish which actually may be their best dish.  What I liked most about those dishes was that it didn't seem overly oily or salty while still maintaining all the natural juices/flavor.  I usually get it with white or yellow rice and beans or sweet plantains.  It's a great neighborhood place if you need to pick up a fast meal for lunch or dinner.  It comes with their signature green sauce for those of you who like spicy.  It's not something I could eat everyday, but really hits the spot if you want a hearty meal.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "Food was excellent and really affordable. Came here around midday on a Friday and the staff was attentive and nice.", "author": "Nia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "There food is really good, fried pork chunks are awesome with yellow rice, love the green hot sauce!!!lol", "author": "Steph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-10", "description": "Sophie's is one of the best Latin, semi-fast food, chain restaurants around. I eat here during lunch time hours when corner cart cuisine just won't do. Today's roast pork (pernil), with white rice and black beans lunch special, was tender, tasty and served to me in a really big portion. This restaurant has it all-chicken, pork, fish, fried, doughy goodies filled with extra goodies, rice with or without beans. This ain't gourmet cooking but it beats a hot dog.  Clean, comfortable setting. Bottle of green sauce on every table. Use it on everything.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "This is the best Cuban cuisine ever! The green sauce though! It's delicious. Wished there was a Sophie's in Atlanta; I would be there everyday!", "author": "Sheila W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "Amazing cuban food. Definitely try the Pernil with rice and beans and sweet plantains. Also the green sauce is amazing, a must add. I'll definitely be back again!", "author": "Ali E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "I worked across the street from Sophie's for a semester, and it was the go-to for all my coworkers who wanted to order lunch and get it delivered.  And after my first lunch at the office, I had to agree with them--Sophie's offers a ton of food at reasonable prices, and it's all satisfying.  \n\nEach day has its own special, which all look good, but mostly I would get the spicy grilled chicken with two sides.  Their tostones are delicious and pair wonderfully with the omnipresent green sauce, mmm.  I've gotten their salmon too, and it's a bit dry, but that's to be expected from a cafeteria-style restaurant that serves fish from a hot buffet.    \n\nFor quick delivery and cheap, huge portions, order from Sophies!", "author": "Maeve C."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Sophie’s Cuban Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "27 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i89viUrI5M4S8IMjzLLU9A/ls.jpg", "@type": "Restaurant", "telephone": "+17182430911"}