{"aggregateRating": {"reviewCount": 132, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-27", "description": "I usually enjoy Sophie's but today I'm even more unsettled because I specifically asked for extra gravy on my rice and when I received it there was not an ounce of gravy in anything in my plate. The chicken? dry, the carrots? hard and barely cooked. Very dissatisfied.", "author": "Kevin W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-22", "description": "I live in the neighborhood and I was shocked at the 2 times I wanted to order. The manager at the time named Marlon was completely rude over the phone. Without apologizing to what was done or said.I'm completely shocked", "author": "Adeline T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "Sophie's is decent cuban food if the craving hits and you want something quick and straightforward. The food itself is fine. Not the best cuban i've had, but it's decent. The meat tends to be a little dry. I usually order the cuban sandwich or the pernil plate (comes with two sides). The plates are around 11.99 during lunch. The dinner prices are the same. Don't miss out on the spicy green sauce!", "author": "Stef S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "I recently had a craving for Cuban comfort food so I decided to take a short walk to Sophie's Cuban Cuisine during a lunch break at work. \n\nIt's quite spacious and has a decent amount of seating if you want to eat here. There's an array of menu items to choose from, but I decided to have one of their daily specials - Beef Stew with 2 sides (Yellow Rice and Fried Sweet Plantains). The total for my lunch was $9.99. Expensive for a lunch? Yes, but they give you a heck lot of food.\n\nThe Beef Stew was a little dry, but meaty. It could have used more sauce to make it moist. There was a tremendous amount of yellow rice. It was tasty and was seasoned just right. Fried Sweet Plantains - love them! Not too sweet and moist. It was a heck a lot of food that I was unable to finish the meal so I had leftovers for dinner. \n\nIt's good to know there's an authentic Cuban restaurant just steps from my office and that I can get good and hearty Cuban food in minutes. The sandwiches sound delicious and tempting. I also saw there's Spanish coffee on their menu and I would like to try that too. I will definitely be back to try those.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "I've loved Cuban food ever since I first tried it when I attended college in FL. I've been reluctant to try any Cuban places in the city because I'm afraid it won't measure up the Cuban food I've had in FL. \n\nThis place is pretty up there. I tried the roast pork with yellow rice and sweet plantains. Everything was flavorful. I was extremely impressed with the rice. It seemed like either they put some of the juice from the pork onto the rice or it must've just flowed over because the rice was really flavorful. The pork was tender. And the plantains were soft and sweet. Definitely very comparable to the place I went to in FL.\n\nService was great too. Everyone was polite. It was one of those quick dining experiences but even then, I was given full attention by several servers. \n\nA little pricey but it's NY so I can't really complain. At least they were generous with the portions.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Very delicious food. Definitely love the way they cook. Very good chicken and the rice and beans are great. Would definitely recommend it.", "author": "Ricardo G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-24", "description": "The inside was really clean. The workers were friendly. There were tables and chairs available to sit and eat the food.\n\nI had a baked chicken sandwich. I'm a type of person who  is willing to spend money on food. The sandwich cost $10.33 which is really expensive for bread, chicken, mayo and onions. But I love good food (4.6 on Yelp) so I bought it. The sandwich came with a \"free\" empanada. \n\nThe sandwich was neatly made. I was able to divide it without anything spilling out from it. It gets an A for its presentation. The only problem I had with the sandwich was that I didn't like the taste of it. I didn't like the curry flavor. The store should have said \"Curry Bake Chicken.\" The empanadas were too moist. There was too much sauce inside.", "author": "Kadia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-05", "description": "I have the same emotional response to Cuban sandwiches as many people have to pizza. There's no such thing as a bad slice/sandwich. \n\nSophie's is a chain, it serves up mounds of greasy pork and densely packed sammies. If you are a bear of a man or would like to buy three days worth of food at once- it's an economical greasy spoon. Not a choice for a \"light\" lunch. Expect a line in the middle of the day.\n\nI go Cuban with extra pickles. Cheese on ham on ham. It's not the best Cuban: They can be a tad chintzy on the cheese and I slather extra pickles on, but it's an alright Cuban. You will undeniably feel slightly ill once you scarf it down but it does the trick without having to travel to a Cuban neighborhood somewhere in Union, New Jersey.", "author": "Alexandra G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-20", "description": "I love Sophie's Cuban Cuisine and I'm pretty familiar with the franchise\n\nThe service at this particular brand needs some improvement, I was mostly disappointed that I ordered a Cubano (their signature sandwich) and asked for NO CHEESE at all, and I still received cheese and was charged an extra dollar for it.\n\nIt's okay to make mistakes, but I believe this branch needs to be more careful when taking orders....", "author": "Jelani R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-29", "description": "I went for an early dinner during the week with two young friends. Grim faced servers behind tubs of food. We ate in but food jammed into unattractive plastic containers. Average rice and beans plus not at all freshly cooked plantains. The yucca was plentiful and ok, though. Empanadas were disgusting. Their green sauce was boring. It too served in more plastic. The only smiling face we saw there was from the woman who told us that the restaurant was soon to close. All in all: not a very pleasant experience and not inexpensive.", "author": "James C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "I love Sophies food. \nTheir chicken soup is great. I also love their spicy chicken with veg. And rice with beans. \nSpicy and tasty \n2 thumbs up..; )", "author": "T. B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-04", "description": "Lapin loves this place. Every single time he is in the area, he somehow or another ends up with a bag full of food from this store. He loves the pernil with rice and beans. I have tried a couple of things from here and I prefer the empanadas with tons of green sauce. While, this is a favorite place of our to stop for a snack or dinner, the service is always lacking. The waiters and servers are almost always rude and so cheap with the green sauce. Seriously, if I order fried chicken with rice and beans and three empanada, one little tub of green sauce is not going to do. If buy the green sauce separately, they give you in a foam cup (the price always changes) which spills before you even leave.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "I might have a slight addiction to Sophie's since I've gone there twice this week.  A little pricey, but the portions are huge, the service is quick, and the food is DELICIOUS.  Planning to be a very frequent customer.", "author": "Danielle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "I have not had Cuban cuisine as often, but Sophie's came highly recommended by my colleagues. I ordered an entree, which comes with sides for $10.99. The breaded chicken was a huge, satisfactory piece along with green salad and fried green plantain. I was definitely impressed by the rich flavors of my meal. I definitely applaud their efficient delivery.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "THEE BEST IN CUBAN CUISINE!!  The food is amazing and affordable (affordable enough to sit and have lunch) everything off the menu is amazing. If you're looking for amazing cuban food this is definitely the place!", "author": "Jah D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-16", "description": "Staple lunch choice for downtown Brooklyn. You cannot go wrong with their staple cubano sandwich and don't forget the green sauce. Today I opted for their salad which wasn't a bad deal but left a bit to be desired. The roast pork was awesome and get the white beans and guacamole, so good.", "author": "Jason S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Not bad at all.  I stopped by for lunch and had a #1 combination, which was the sandwich with soup or sides.  I had the Cuban sandwich and had sides of rice and beans.  It was about $12 and a very fair amount of food.  The food was tasty and delicious.  One of the better Cuban sandwiches that I've had too.  The place was clean and it was relatively quick service.  No complaints and I'd probably go back again.", "author": "Richard L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-29", "description": "This place has a real Tio-Pio kinda feel....no bueno.\n\nWent ere for lunch with a friend and we wanted to dine there so the logical thing to do was go get the food and grab a table right? Wrong! You have to sit and wait to be served (during the lunch rush). Which means the likelihood of getting back to work on time becomes impossible.\n\nSo we grabbed seats and waited 15mins for a waiter to come over, don't blame him, it was super crowded. Again, it would have made a lot more sense to get the food ourselves. So we finally get our food and it was bland. I'm not gourmet chef but I can season and prepare a great meal like the best of them and this meal was completely tasteless. I ordered the spicy chicken and I guess they thought by having sweet peppers on it it'll automatically be spicy. So I asked, \"why isn't this spicy?' to which the waiter replied, \"You have to use the green sauce.\"\n\nSo wait, my spicy chicken is just regular chicken unless I ADMINISTER THE SPICE? Hmmm.\n\nAmbiance: 3/5 (especially at night)\nFood: 1/5\nService: 3/5\nLocation: 5/5\nGetting to location: 5/5 \nPrice: 2/5\n\nCash and credit (upwards of $10)", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "I walked in on a Thursday around 4:40pm looking for something to take home for dinner.\nThe Place was clean, empty and with a few people waiting for their orders to be cooked.\nI went right up to the counter, since all the food is on display and then menu is on top.\nJust point and order and pay and leave. Quick and simple.\nI will be back again with a Groupon this time. I saw the woman in front of me use it.\n\nI got the two sets of \"Everyday Special\" that comes with a choice of meat or fish and two sides.\n\nA set of the Salmon special with a side of fries and orange rice. (It's my first time eating Cuban food so I don't know what it is called. ($11)\n\nA set of fried fish (two pieces) with sides of moro rice (black/purple rice) and Salad. ($9)\n\nThey only had 7 sides including the plantain which I'm not a fan of so if you are picky or not too sure of what to get for sides, just stick to the four sides that I ordered above.\n\nThe food is alot, they fill it to the top.\n\nPlus I got the Passionfruit Shake, it was a bit sour for my taste. I will try the steak sandwiches and beef patty next time.\n\nThis is a gem in this neighborhood.\n\nThe only bad thing is that they don't open saturdays :(\nBut yes to business on Sundays.", "author": "Ilene E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-09", "description": "There was a takeout option and a to stay option and my friend and I decided to stay and eat our sandwiches for lunch. The restaurant was extremely empty but it may have just been because it was pouring rain the day we went. The food wasn't what I expected but it was okay but I wouldn't say it was very delicious. It was average at best, don't expect a lot. The service was minimal but they were nice. My friend wanted an extra pickle slice but was told it would be an extra dollar when the first slice was very thing and small.", "author": "Noa I."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Sophie’s Cuban Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "27 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i89viUrI5M4S8IMjzLLU9A/ls.jpg", "@type": "Restaurant", "telephone": "+17182430911"}