{"aggregateRating": {"reviewCount": 132, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "I've only ever gotten delivery from here but I really like this place.\nFood comes when they say it will and is always hot.\nI come from a Puerto Rican family so I basically can't resist pernil every time I see it on a menu (which thankfully isn't often-it's pork so it's bad for you)-anywaaaay, I always order the pernil with yellow rice, platanos maduros (these are sweet but they have salty ones-tostones-as well) and a side of avocado...it's great here! Everything tastes fresh and well seasoned. They also have Cuban classics like ropa vieja here which I hear is very good.\nOverall, this is some good comfort food done in a Hispano-Cuban style-I probably order from here once a month and love it!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "Came here for lunch break from jury duty and I found myself on a massive line. It's one of those places where all the food were pre-made and you just order what you like. They had three type of rice yellow rice, white rice or moro (rice with black beans). Then you pick your choice of meat include pernil, ropa vieja, oxtail, chicken, or fish. Most of the meals contain two sides with choices of steam veggies, maduros, plaintains, avocado, yucca or salad. I chose moro, pernil with sides of maduros and avocado. It was delicious and full of flavor and a really large portion. I end up eating it for two more meals and it taste even better the day after surprisingly. I was too full for dessert but I was always check out what they have, which includes tres leches cake, rice pudding, and guava cheese empanada.", "author": "Ann S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "Great food here, but some food lacks flavor. Great portion but prices could be pricey. Will try their lunch specials one day.", "author": "Laura F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "Very good place, pretty good service.\n\nBUT DONT TIP THEM . Even for. Two person table they try and sneak in a device chRge. We never noticed and always been charged.\n\nI would still come back again for sure. Food is worth it.", "author": "Dmitry D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Good food, chicken was a little dry but still good. The restaurant was cozy and nice. The service could use a make over, some customer service classes are in order. Over all an ok experience. Would revisit in hopes of a different experience lots of potential there.", "author": "Shu J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Loved the excellent customer service and delicious food!! They're quick and super friendly! Good price for the great taste and selection. Made my trip to Brooklyn that much better :)", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "One of my favorite go to lunch spots! The lunch specials are affordable and potions are huge! Cuban pork is definitely my go to here. It's cooked perfectly and flavor is on point with the balanced meat and fat ratio. Plantains and black beans with avocado are the perfect sides to go along as well. Lunch crowd can be long but service is fast and friendly!", "author": "Ye T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "My boss introduced me to Sophie's. It was indeed a pleasant surprise to have so many options for this non pork, beef eater. The first visit I had the turkey, rice, and beans. I tried my luck at their flan, as was sold. However, I only liked it because it was firm - I soon learned all flan is not created equal. \n\nDuring my most recent visit, I enjoyed the shrimp and was once again thoroughly satisfied. \n\nSophie's is definitely a winner.", "author": "Jeanene B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-31", "description": "Sophie's Cuban Cuisine is known to me for their restaurants in Manhattan. I happened to be in the neighborhood and decided to stop by this one in downtown Brooklyn. Service is great, but the food is not up to par. Yes, they give you a lot of chicken and rice, but the flavor is lacking. Don't think I will be back!", "author": "Amy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "This place was so good! So unassuming as well. All food is already prepared and they have table service so it comes out really fast but it tastes fresh. I have the dark meat chicken with yellow rice and root vegetables. Loved it", "author": "Marna H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-11", "description": "1 star for overall experience.\n\nThe lamest restaurant in United States in my opinion. \n\nFoods look old and not fresh. \n\nAfter seeing all the food, you cannot order at the cashier direct. \nYou need to seat down and be served by waiter in a basic looking diner shop. \n\nAfter eating, a surprise will enfold! 15% forced gratuity for a basically nonexistent service. \nWhy would I need someone to bring my food from the food already cooked and presented there many hours ago? \nI ordered spicy chicken and it is non spicy at all. Might as well give me pork right. \n\nVery ridiculous place I would say.\nWill never go there again.", "author": "Am T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-18", "description": "Decided to try here as it is a 30 second walk from my office. I used their online ordering system to place an order for steak with onions and 2 complementary sides of yellow rice and fries. I was told to pick up after 20 minutes, but the food was already ready for me when I arrived 15 minutes after ordering. Yay for fast service!\n\nI worried that they had forgotten to include sauces for my steak and fries, but when I opened the bag I saw that they had given me generous amounts of ketchup and their special, slightly spicy green sauce. \n\nThe food wasn't anything particularly special. I did like how thin and non-chewy the steak was, and I also did appreciate the onion's thickness, but otherwise, the dish was just as you would expect a dish of steak + onions + yellow rice + fries to be. Not anything less, and not anything more. The portions are generous though, so even though you are paying $10 for a basic meal you can cook at home for less, you'll at least feel satisfied and full. I will be back though, to try their famous pernil dish:)", "author": "Gahee L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-20", "description": "Great Cuban Sandwich! 3 stars.  Not Cuban owners but specialize in Cuban cuisine. I have had all that's on their menu.  Missing more cumin and more garlic in their recipes", "author": "Chris P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "Pretty neat place with good food, at least from what I ate. I had a turkey sandwich and one chicken and beef empanadas. The turkey sandwich is pretty good. Having empanadas for the first time I definitely liked the chicken empanada. I wasn't a fan of the beef because they put green olives in it.\n\nI also loved the green sauce that they give you. It's spicy and sweet, awesome for the sandwich or the empanadas.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-25", "description": "I feel mixed about my experiences at Sophie's Cuban.\n\nFive stars: really fast delivery, inexpensive, massive portions, the green sauce served on the side is ADDICTIVE, the maduros (sweet plantains) were excellent, and the ropa vieja entree was incredibly flavorful.\n\nHowever, the other entrees I have tried in the past were not nearly as good. The pernil was watery and bland. It doesn't  come with any crispy skin, it's just the pulled meat. Not a huge fan. I've also had the shrimp in garlic sauce. The sauce is good but the shrimp were tiny, overcooked, and chewy. The side salad was lacking too, and was a bowl of watery lettuce. \n\nDon't get me wrong - for some inexpensive, quick Cuban food and piled plates of rice and beans...this place hits the spot. But I would stick to the ropa vieja in the future.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-18", "description": "Today I placed  a order for delivery. The man who took my order was so disrespectful. He was rushing me, told me he's busy but I had give him 3 orders. I asked him for green sauce for each of my order. He responded with I give you 20. I asked for the empanadas combo he told me they don't have that which he was lying. I felt uncomfortable! With his attudite that my coworker had to step in and finish the orders. Who wants to order from them and deal with attudite. You need better staff and show you customers some kindness and respect esp when they been ordering from you a long time", "author": "Jennifer E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-29", "description": "The food is decent but unreasonably expensive! 3 pieces of sweet plantains -$1.50  an 8oz cup\nof sweet plantains $3.04. Think I was more appalled that they charged by the piece of plantain. Obviously this restaurant is paying for the high rents downtown Brooklyn, but c'mon!! If you want great tasting Spanish food, hit Bushwick and hit a local Dominican restaurant. Trust me, more bang for your buck.", "author": "E G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "The food is always good had the salmon salad with avocado and plantain and it was delicious.  They are stingy with green sauce which is delicious and I miss the waiting staff.  Aside from that a good lunch spot.", "author": "Carlos C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-05", "description": "Cubano black beans done right are The Business. Pairs perfectly with their amarillo rice. Pollo al horno is cheeto coloured and suspect. I'm sure it's delicious and I'm just wary of frankenfood but it's not like this place serves free range non gmo chicken- right? \n\nSalt fish and cassava are pretty good. Excellent moro de guandules; moist and delicious on its own. \n\nOxtail isn't caramelized brown the way Trinis and Jamaicans do, but Hispanics add olives for a kick  in the gravy. They don't trim the extra fat either but it's pretty addictive even though it's the devil.\n\nSay no to their flan and the rest of desserts. Half arsed sugar traps. \n\nThey serve sour sop! Yum! They call it guanabana and its worth discovering for those unfamiliar with its soursweet flavour.", "author": "Hadiza A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Very nice Cuban sandwich and their soup was savory. Their combo is a really good deal; you get a soup and bottle of water for only $2.50 more.\n     Right now (10/24/17), they're celebrating their 20th year by giving customers free food; come in today for a free empanada or tomorrow for a potato ball stuffed with meat.   \n     For a really good meal and great service in a clean space you can't go wrong with Sophie's Cuban Cuisine. Enjoy.", "author": "Edwin R."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Sophie’s Cuban Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "27 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i89viUrI5M4S8IMjzLLU9A/ls.jpg", "@type": "Restaurant", "telephone": "+17182430911"}