{"aggregateRating": {"reviewCount": 132, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "What can I say?  The food is so good, I bring it back to NJ.  I love the fact they deliver and you can order online.", "author": "Tracey L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "After a few disappointing delivery experiences with another cuban restaurant, I decided to give Sophie's a try.  I  ordered their turkey cubano (as opposed to the pork cubano), which arrived within 45 minutes of ordering.  The size of the sandwich is smaller and slightly more expensive than other places in the area, but I enjoyed my sandwich nonetheless.  I will definitely be ordering from Sophie's again.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "Consistently awesome. Green sauce is pure magic. Great place for a quick lunch. Did I mention the Green Sauce. Best fast food joint around.", "author": "Bianca G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "Came here for dinner. The Pernil with a twist is a staple. The plaintains with their special green sauce (you have to add the sauce to anything you order) make it. I thought I would only eat half, but it was so good that I had to finish the whole thing.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-13", "description": "I know Sophie's is somewhat legendary, but my first trip was just last week, and I'll definitely be going back. This is juicy, flavorful, stick-to-your-ribs Cuban* fare, and I recommend getting the Pernil with a Twist sandwich. Delicious roast pork, pickles, plantains... it was gone before I knew it. And then I was stuffed, because it was a VERY filling sandwich,\n\nThe staff was super helpful and friendly, offering suggestions as to what my friend and I should order. Next time, we're going to split the lunch special, which includes a sandwich and two of the delicious looking sides, for only 8 or 9 bucks. A deal!", "author": "Claire M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "I first became acquainted with empanadas through Colombian joints. On a recent trip to Miami, I discovered the Cuban empanadas and ever since I've been on a quest to find Cuban empanadas: not Argentinian, not effin' Colombian, but Cuban. You know? Castro, the embargo...yada yada yada. \nThis Sophie's is conveniently located walking distance from where I live, and while I have never eaten on site, I normally have food delivered to me. \n1. They never messed up an order.\n2. Food is filling, hearty and great.\n3. Picadillo, is made like a picadillo should be made.\n4. The soups have big whole chunks of meat. Other places are stingy with the meat and fill their soups and plates with crap loads of rice or yuka or potatos. Sophie doesn't do that shit. They have meat, no fluff or cheap tricks. \n5. Croquetas and empanadas are my favorite for a \"just right\" breakfast. The empanadas are filled with picadillo, which is meat and olives in a beef broth condiment, all enveloped in a perfectly crunchy non greasy crust.", "author": "Dullua C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-01", "description": "Ordered from here a few weeks ago, fast deliver but the food was lacking. The food was so dry and salty the I couldn't eat it. I tossed it out and ordered Chinese.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-18", "description": "I think my expectations for this place were very high, but I was kinda disappointed. I got the oxtails, which are usually a signature dish in a lot of restaurants, and they were so bland. Not just bland but almost all fat, and very little meat. \n\nAnd to make it worse, I got it to-go and sat down at a table to taste it before I headed out, and I was rudely told by the server that the section was only for dine-in and I had to sit at the bar. I understand that might be the policy, but knowing how to deliver a message is very important in customer service.\n\nI will not be going back. There are cheaper tastier alternatives, and they probably wont be chains.", "author": "Imani P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "Great Cuban food!! Also, great environment with good salsa music. Being a Latin girl, it really brought me home. I would definitely come back here.", "author": "Katherine R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-22", "description": "Food is good, portions are enormous, and prices are reasonable. Ambiance is very fast-food-like. I understand it's a chain store so I don't blame them, but that's the reason I'm not giving it four stars.", "author": "Audrey L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-05", "description": "Ordered from Seamless-the delivery took much longer than expected, but I think that was Seemless' fault.\n\nGot the goat stew and pork sandwich with plantains. The sandwich was excellent, would definitely get it again. Goat stew came with two sides-we got sweet and green plantains, the green plantains with the green sauce are excellent. Chicken empanada and cassava with pork with pretty good too.\n\nThis place was inexpensive and we got a lot of food.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "I haven't had a full meal here, just the empanadas and I love them. They are stuffed with flavor and meat. Both the beef and chicken empanadas were tasty. Please be sure to taste the green sauce, it has a good spice in it.", "author": "Dorothy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "I grew up eating Cuban food in Miami so I have some experience in judging this place. I had the chicken cutlet sandwich and beans and rice as a side, everything was delicious, I finished it all and the staff and owner were very nice. The place is clean simply laid out, highly recommended for those that like Cuban food.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "Delicious Pernil with a Twist! Get it!! And extra Green Sauce, it'll make your day! :)", "author": "Walbania M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Wow!  From the moment I walked in I felt I was back in Miami. That was the closest I could get to getting great traditional Cuban Food. Pernil, arroz Moro and Yucca. Excellent. Can't go wrong.", "author": "H P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "I don't expect much out of this neighborhood's selection when it comes to food and tend to try new things around all the time and usually get full but rarely satisfied. Stumbled upon Sophie's menu by accident and so glad I did! Delicious fresh tasting food, rich coffee, friendly service and quick delivery. Will be ordering again!", "author": "Anastasia V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "My favorite lunch delivery place in Brooklyn Heights.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-15", "description": "Delicious food at amazing prices! Their link special is great: a sandwich combo work rice and beans and a beverage for only 8.99! And SOOO much food! Lunch AND dinner! I got the breaded chicken sandwich with yellow rice and beans. So much goodness! I will definitely be returning for the lunch deals.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-18", "description": "Sauce for tostones was super salty (otherwise they were good). Shrimp in Garlic sauce was delicious. Limited veggie options (as most Cuban food). Solid spot in the area.", "author": "N S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-18", "description": "We ordered two cuban sandwiches and an order of tostones for lunch today. It seemed like a simple enough order for a Sunday afternoon, but for some reason, it took an hour and twenty minutes for our food to be delivered. After waiting 45 minutes, we called, and they told us they needed a few more minutes. After waiting an hour and 15 minutes we called and they said it was on the way.\n\nWhen the food arrived it was barely warm, and the bread was a little soggy. The pork was very dry, the pickle, somehow, bland, but with the addition of the sauces, the sandwiches were \"okay.\" Neither of us bothered  finishing them, even though we were still hungry. \n\nThis is not a good place to order from when you're hungry. Unfortunately, that's when we order food, so we won't be ordering from here again.", "author": "Jill K."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Sophie’s Cuban Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "27 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i89viUrI5M4S8IMjzLLU9A/ls.jpg", "@type": "Restaurant", "telephone": "+17182430911"}