{"aggregateRating": {"reviewCount": 84, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-20", "description": "Despite the somewhat \"cheesy\" store front signage and name, I really like this place.  It's my local pizza go-to.   \n\nSuper friendly staff, great pizza (tasty sauce and delicious crust), and they offer the affordable combo that fewer and fewer pizza places have these days:  $5 for a soda and two cheese slices.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "really fast delivery from seamless!!\n\nslices of pizza are convenient and delicious!! their style is like a cross between thicker, little kid style pizza, and thin new york pizza. it's really very good.\n\nthe chicken tenders and fries were delicious, as was the chicken parm sub.\n\nhighly recommend it if you're tired from work, hungry, and want some good fast, consistently good take out.", "author": "Justin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-25", "description": "This is now our go-to place to order a pie. None of the other pizzerias in the area are as consistent.\n\nThe quality of the ingredients is good, the staff is very friendly, the prices are reasonable. Nothing fancy. \n\nSome of the other reviews bother me. Honestly, if you want a salad, don't go to a run-of-the-mill pizza place. There are a bazillion fantastic pizza places in Brooklyn who will serve a mediocre salad. Also, when you go in somewhere for a slice, you have to figure that some of the slices have been sitting around for awhile and choose accordingly.", "author": "Theresa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-29", "description": "Pronto is my go-to neighborhood spot for easy slices and pasta. Their specialty slices are a MUST! (Try the Buffalo Chicken, BBQ chicken or the Chicken Bacon Ranch -- all very delicious, and hearty! one slice is enough to fill you up!) Also worth mentioning is their Chicken Florentine entree with spaghetti, which is a favorite of mine (i don't want to know how many calories is in it, but it is TASTY!) I would not suggest ordering their standard pizza pies; they aren't bad, but just aren't very memorable -- i think that may be the reason for some of the less-positive reviews -- but their specialty pizzas are the best around! and their delivery service is great", "author": "Whitney G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-06", "description": "We felt a little bad going to Pronto because we're pretty loyal Reginella customers...and now, we feel really bad because we pretty much wasted $13.\n\nI think this might be my 1st 1 star review, but I literally could not believe that they would try to pass this stuff off as \"authentic\" Italian food. \n\nWe ordered a salad, a slice with sausage, and a pepperoni roll. \nThe house salad came with dressing that was clearly from a bottle and a pretty dismal smattering of greens. Yummm...iceburg lettuce and an under-ripe tomato slice. \nThe slice of sausage pizza looked a kid's plastic toy, and tasted pretty similar. \nThe pepperoni roll tasted like it was made in a factory and re-heated. \nI could go on...but I won't because I already feel mean. \nI will say that Reginella and My Little are both far better, and we won't be heading back to Pronto.", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-27", "description": "1st time going there, customer service was great and so was the food. After going there for a 2nd time and the 3rd, I notice one of the guys who was dealing with my order, was touching my food with no gloves, which I thought was normal until I also notice that he was also a cashier dealing with money. There wasn't a sink in the front. He didn't wash his hands and who knew how long he's been doing that throughout the day. I was so disgusted!!! Sorry Pronto, no more. You wont see me there again.", "author": "Gege H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-18", "description": "Chicken Francese Pan Pizza was pretty good, but it seems like it could be great.  Chicken was a little dry, but the crust was spongy in a good way.  Definitely going to order again.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "some of the best delivery pizza in the neighborhood. The penne vodka and philly cheesesteak pizzas are awesome. They deliver really fast and the delivery men are always nice. They have a bunch of different styles of pizza", "author": "GUY W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-29", "description": "My primary purpose for being in  the area is that I needed to make a trip to trader joes. I had just finished a moderately intense cardio session at the gym, so I was in dire need of  carbs to reboot, especially since I knew I would need the energy to browse the delightfully priced aisles of TJ's.  I decided to indulge in one of my favorite forms of carb consumption--pizza! Believe me, I too see the irony in following a workout with pizza, but hey--I enjoy being an outlier ;)\n\nAs much as I enjoy an authentic new york cheese slice, I do like a specialty slice from time to time. Yesterday, was one of those times. I did not know exactly what I was looking for, but Pronto sure was not short of options. I also noticed the place was a decent size and looked pretty well kept up and clean (which is a lot more than I can say for some of the hole in the wall pizzerias that NYC is so full of!). There are several stools that line wall if you plan to stay as well as a couple of tables in the back. \n\nWhen I walked in I was immediately greeted. As a matter of fact, in a span of 2 minutes, I think I was asked if I was being served by 3 other people--talk about good customer service! lol :); My eyes went into a frenzy looking over the choices. There were more traditional slices such as grandma slices and margherita, but then again,  there were also meatlover slices, vegetable slices,  and penne vodka pizza (which is next on my list to try). I also admiitedly laid eyes on some less tempting choices such as the buffalo chicken pizaa  *shutter*. When I However, I decided to go with the grilled chicken pizza...It was a no sauce slice--just fresh mozzarella, diced tomatoes, grilled chicken, and basil. It was a really good slice and although the ingredients were fresh, I did add some parm and garlic to kick up the flavor. Quick tip: you have to ask they guys behind the counter for parm because they keep those shakers in the fridge.", "author": "Cassandra B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Very friendly people, excellent food and best pizza in brooklyn! I would definitely recommend my friends and family to eat here.", "author": "Adem B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-01", "description": "Anyone that says anything bad about this spot is either crazy or not ordering the right thing. \n\nWe always get the margherita pizza with spinach and mushrooms. BEST pizza since Italy, seriously. Anytime I have visitors from out of town and we order this pizza, they always say its the best pizza they've ever had. I've never had just a regular slice from there so I can't really speak on it..but I believe they use a different crust and different sauce for the margherita. \n\nAlso the specialty slices are really good, I either get the vegetable or the grilled chicken, tomato and onion or sometimes the chicken and broccoli. All very good.", "author": "Alexis B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-28", "description": "Sad to say that I think this is probably the best pizza in the Cobble / Boerum Hill area (with the obvious exception of Sam's).  How can it be, in an area with such strong Italian roots?   \n\nWhen I lived in the Heights, I used to wonder why people always fawned over Fascati, which I really liked, but that I didn't think was anything particularly special.  Now I'd kill for a Fascati in this neighborhood.\n\nThis pizza really is pretty good.  Their more basic slices have good enough flavor, but what sets them apart is how crispy and thin the crust is.  They actually do a pretty nice job.\n\nThe other area where they excel is their specialty slices.  Don't get me wrong - I'm something of a purist, and kind of look down my nose a little at these kind of slices.  But, that BBQ chicken pizza is hard not to try, and hard not to like.  I'm sorry, but it's tasty.  And despite the fact that it's a pretty thick slice (which it needs to be to support all that sauce and those toppings), it's still very crispy.\n\nI don't eat a ton of pizza, but I've tried just about every other place in the area, looking for that great local Brooklyn slice.  And other than the Grandma slice at My Little..., and other than Sam's (which doesn't have slices), I haven't found it.  This place, by default, has become the place I think of first.", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-06", "description": "I was craving for some penne alla vodka.  I was skeptical that a pizza place would but be good, but for $9, I was willing to try it out.  It turned out that the pasta was slightly overcooked, but it was well seasoned and extra saucy - which I like.  The portion size was huge and I wasn't able to finish it.  I had enough leftovers for a full lunch the next day.  I'm definitely going back to try their other items!", "author": "Judith M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-28", "description": "I tried this place for the first and last time this past Friday night.  We ordered two whole wheat pies and a 2 liter of Diet Pepsi through grub hub and the order came in about 30 minutes.  Unfortunately the timing was the best part of the order.  First we realized they had sent us a Sierra Mist instead of a Diet Pepsi, so I called them and told them of the mistake.  Instead of apoligizing and fixing the order, the guy who answered the phone told me he was very busy, that I was actually outside of his delivery range so it would be a pain for him to send the right soda over, and that I should just drink what I got.  As someone who works in a service industry, this was pure blaspheme, and I ended the call already knowing this would be my last order from Pronto.\n\nTHEN we opened the pizza boxes; it was supposed to be two regular cheese pizzas on whole wheat crust but it looked more like a haphazard margerita pizza.  Only 1/2-2/3 of the pies had cheese onthem and the rest was covered in a cheap marinara sauce.  It was almost like someone had thrown a few slices of cheese on top of the sauce and said \"fuck it\" before throwing it in the oven.  The group I was with tried eating some of it but it was just bad and we couldn't get very far.  Not wanting to deal with the fellow from the first time, I called grubhub and the guy who answered the phone called Pronto Pizza on my behalf to see if there was anything they could do since we were totally dissatisfied with our order.  Grubhub called back and told me that Prono Pizza refused to refund anything or amend the order in anyway and asked that grubhub pohibited me from ordering there again.  He was also apparently unable to define their delivery parameters despite continuning to claim they were inaccurate.  \n\nBad service + bad pizza = actually I'm pretty bad at math but basically don't order from this place.", "author": "Benjamin K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-28", "description": "I really wanted to give Pronto a better score and it does get a \"5\" for being very friendly and accomodating but, alas, the pizza just did not meet my expectations.  To be fair, however, other members of my family pronounced it \"good.\"  Why didnt I like it?  The crust was way too flabby.  No golden color or crunch.  it just bent.  We had three types of pie: the margherita, BBQ chicken and meatballs.  The chicken was the best of the 3 toppings because it was smokey and sweet all at once.  The meatballs were fine but not very seasoned.  The margherita pizza, made with fresh mozzerella, was flat and boring tasting.  Not crazy about the big round slices of fresh tomatoes.  We also had the rice balls thinking they would be crispy.  Very tasty but smothered with cheese.  I am still partial to My Little and Fascati if aiming for \"regular\" parlor style pizza.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-17", "description": "This place is good because the pizza style is different than anywhere in the neighborhood. Is it the best? No. But it is tasty original and full of toppings. More of a thicker style slice but not exactly deep dish.", "author": "Zach K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-17", "description": "I heart the vodka sauce pizza.  I get it like a once a week, and will continue to do so for the foreseeable future.", "author": "Don M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "My mother came for a visit from California. Having just moved to Downtown Brooklyn, I didn't really know where to turn to get her some decent 'NY style' pizza. Perhaps our pizza tastes are 'unsophisticated' (likely, as we dont eat it much!) and perhaps we were just really hungry, but we got a plain pepperoni pie from Pronto and were THRILLED with it. Slightly spongy-yet-crusty crust, delicious tomato sauce, zesty pepperoni. Can't wait to go back.", "author": "Cindy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-29", "description": "The pizza's delicious, service is great, and highly recommended if you want to avoid the long line at My Little Pizzeria just across the street.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "Came here yesterday after leaving the gym.  My only point of reference for pies in the area is My Little . . . I got a standard pepperoni slice, which was $3, a little more than My Little charges.  It tasted no better, no worse, than My Little.  Only slightly more doughy.  However, Pronto is likely to become my spot.  The place seems MUCH cleaner, and they don't have the \"evidence of mice/vermin dropping\" that My Little does (check out the NYC restaurant website - see for yourself) .  That is enough to turn me off from My Little completely. Pronto is a perfectly fine substitute, and just a quarter or so more expensive.", "author": "A E."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Pronto Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ImzDE9xxPnKcG4dkcFZvnA/ls.jpg", "@type": "Restaurant", "telephone": "+17185222225"}