{"aggregateRating": {"reviewCount": 84, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "Quick Service, good pizza. Great place if you're trying to get a simple quick slice and go", "author": "Gissell V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Pretty good place and they are situated *right* across from Trader Joe's, so if you're in the mood for pizza after a grocery store run, you got your spot.\n\n1. I like their garlic knots! $1.50 for five little ones with a side of sauce.\n2. Deep dish slices are $4.25 and BIG. I had a grilled chx with peppers and it was good. A few slices look meh but most are fine. They have one with penne pasta which looks appetizing but I mean #carbcity!\n3. Cards accepted when spending $5+.\n\nWhile the place is small, they've got two four-top tables and lots of stool seating. Seems like lots of orders are for delivery, so the staff is busy during peak times but you'll still get a seat if you're keen! :)", "author": "Connie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-05", "description": "Yep, definitely 3 stars.\n\n$5.50 for two of the scorchingly hottest slices I've ever had and the flattest orange soda ever. Seriously, I took the slices to go, and could barely hold onto the bag. Double up on plates, guys.\n\nThat said, the plain slices are big and adequately cheesy. Probably wouldn't go back when I'm sober.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "I always order in pizza from here - timely and delicious! The garlic knots are also great, would definitely recommended!", "author": "Carly G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-16", "description": "I got a grilled chicken and tomato slice for $4.25 and a beef patty with cheese for $3.50. The beef patty was pretty good I mean it's hard to mess up sneed patty. \nThe pizza on the other hand was COLD AND HARD and it's such a disappointment because that's my favorite pizza. \nYOU CAN EVEN SEE IN THE PICTURE HOW COLD THE SLICE WAS. \nIt's bad enough that it was hard but it was so cold it made it taste even worse. I forced myself however to eat it because I paid damn near $5 for it but I just couldn't. I threw the rest away. Attached is a picture of the pizza after I forced myself to consume it.", "author": "Lola C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-15", "description": "I came into Pronto Pizza with my son and he ordered a plain cheese slice for me and a barbecue chicken slice for himself. He assisted by a gentlemen and everything was fine. Pizza was good. It went bad once my son went to the register and asked for another slice. The young girl that assisted him was very rude and loud. We asked for our month back that he already paid for the slice and left. She didn't seem to care. I've often orderedfrom Pronto. Nope. Not anymore.", "author": "Latoya D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "Two more orders from Pronto Pizza later and I am really, really liking this pizza. I've called in a couple whole pizzas to-go at this point and it's always pretty quick (fitting with the name), and they ALWAYS send out a great pizza.\n\nThe sauce is super unique and unlike any other I've found in the area so far - tons of flavor, definitely not an out-of-the-jar scenario. The crust is also really good, not too, too thin but not thick enough to take away from the rest of the pizza.\n\nThe prices are good as well. Will definitely be back in the near future!", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-18", "description": "Got a slice of Sicilian good crust flavored even though they burnt it. Robust sauce lil spice. Average cheese and pepperoni", "author": "Daniel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Amazing Pizza and buffalo chicken and Pasta and ... and I can certainly go one. \nOne of our  favourite places for staff appreciation. \nAlways fabulous service.", "author": "Lin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "Pizza was nothing but bread.\nI went through a peculiar situation at this place. I decided to go to this place because its the first one I saw on the road. I am an uber driver, I ordered my slice and drink. I was eating it sitting down and DID NOT see anything out of the ordinary. There were pies on the counter, people working there like a regular pizza parlor. It was my first time at this place so of course I DO NOT know their hours. It was 10:57pm so I decided to use the restroom before I continued working. I came out the bathroom at 11:01pm and there was nobody at the place. IT WAS PITCH BLACK. I thought it was a joke or something but when I headed to the front door, IT WAS FKNG LOCKED. I didn't know what to do so I dialed 911 to at least make a report. The operator thought I was joking and almost hunger up on me. She finally made the report and sent someone to the location. I didn't want anyone to this that I was trying to rob the place or something. I found the light switch and next to the register I saw a list of phone numbers. I immediately started dialing every single number to see if anyone knew the owner so he could come get me out. Finally someone answered and I explained the situation and of course she thought I was joking as well but I had to explain in details so could believe me. She was the owner's daughter. She called her father to drive from Staten Island to Downtown BK to ope the freaking door. Cops came, made the report and literally were cracking up at mu situation. Of Course I started cracking up myself because im the only one that this happens to. \n\nWhen the owner came, he came with an attitude, like it was my freaking fault his staff don't have the decency of checking the bathrooms before locking up the place to make sure there is nobody left behind. He started telling me that it it my fault for not leaving before 11pm. Like I should know their hours of operation. Its my first time in this area and at this place. I didn't want to argue with the old man so I just gave my info to the cops so they could make the report and look at the cameras to know that I didn't steal anything nor did anything to the place. \n\nPoor experience with the owner. at least he could've been more apologetic and emphasize with the situation and say something like Im sorry my staff locked you inside, but he came out blasting like its my fault he had to come all the way from Staten Island. \n\nWould never go back to this place", "author": "Andy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-16", "description": "These guys have some different types of pizza and at a great price. I got the typical Brooklyn cheese slice and a grilled chicken fettuccine Alfredo slice and both were good. That and a drink for $8? Um...yes please. The girl working the counter was also super friendly and helpful in explaining all the types of slices they had (even though they were about to close).", "author": "Tim G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "I love this place! I order here at least 1 time every 2 weeks. Always earlier than they say they'll be and the pizza is always hot and fresh. \n\nVery impressed with how 'pronto' they actually are!", "author": "Samantha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "I see all the negative reviews on here and I got to say, I actually really like this pizza place.\n\nPronto Pizza serves both thin crust and thick crust pizza. The pizza with toppings are the thicker crust (pan pizza) while the classic pizza is the thinner crust.\n\nSome of the options are Chicken Broccoli, Meat Lovers, Penne Vodka, Hawaiian, Bbq,  Chicken Bacon Ranch, Whole Wheat, etc.\n\nThey also have Garlic Knots, Calzones, Soups, Salads, Appetizers, Hero's, Rolls \u0026 Wraps.\n\n-What I've tried-\nWhole Wheat Pizza : 4/5\nRegular Pizza : 5/5\n\nThe classic slice was so good even though it was so simple. It had the perfect crust to cheese to tomato sauce ratio and even without all the seasonings, the flavor was on pointe.\n\nThe wheat slice actually had decent flavor and is worth trying out if you can't eat regular pizza bread but I personally wouldn't order again. The way they put the cheese and tomato sauce isn't like the classic pizza by the way and I just didn't like the flavor of the dough itself.\n\nService is prompt and very friendly. One of the girls that works there seems to be the owner's family and is very nice.\n\nOverall, I can't resist this place if I'm in the area. Check it out !", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-24", "description": "The worst!  After waiting an hour for my food, they get the order wrong. We just moved so all plates and cups are in boxes. I wrote on my online order to deliver plates and cups AND I called TWICE to remind them to deliver plates and cups. Guess what they didn't bring?\n\nI ordered 2 sodas, received one. Ordered a thin crust and got regular crust. I call them because clearly we need the plates to eat. She's going to say \"are you sure the didn't deliver plates?\" Told her to ask the delivery guy when he returned if there were any plates or cups. Smh\n\nYou'd think they'd try to get a $60 order right!  Smh\n\nNever ordering from them again.  There are a lot of other pizzerias in the area. They have to be better.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "I would like to compliment Pronto Pizza, because they are correctly named! Every time I order delivery to my apartment way down in DUMBO, they are super quick! Sometimes, I get my pizza within 30 minutes of when I order it. They are always nice and accommodating over the phone. \nI usually stick with a cheese pie, pepperoni pie and once in a while I throw some mozzarella sticks or garlic knots in there. Everything is fairly priced, the pepperoni pie I ordered was $18. With free, delivery, you can't beat it. Their pizza is tasty and not too thick or heavy. They have a nice doughy crust that is perfect for dipping in the marinara left over from your garlic knots or mozz sticks.", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-22", "description": "I'm over this place- completely will never order from here again. The delivery tonight was absolutely unacceptable. My usual order is a Grandma Specialty Pizza Pie and a Minestrone Soup. It was the 2nd time in the same month that my minestrone soup was delivered with 25% of it spilled all over the bag it was packed in and all over the top of my pizza box (see uploaded photos). I don't understand why their chef can't close a soup lid properly where it can't rip through the paper bag it comes in. Or, maybe the business should order better soup containers with stronger lids. I order from here so frequently because I love the Grandma Specialty ($18) and I love the Minestrone Soup ($5). I looked over the past receipts for the month of November and I spent over $150 ordering from here (just for myself)! \n\nAnother time that I ordered from here, they accidentally delivered a lentil soup instead of a minestrone soup. I'm not usually the type of guy to send something back to the kitchen, especially if it was a delivery order. But, I really don't like lentil. And, if I'm paying $5 + tax + tip for a cup of soup then I expect it to be a soup that I can actually eat. So, I ended up calling the restaurant to let them know that the soup order was wrong. And, the guy over the phone (let's call him \"the boss\") told me that I ordered lentil soup and not minestrone soup. And, I was looking at my Seamless receipt, and it said minestrone soup. \"The boss\" did not take responsibility that it was completely his mistake and would not own up to it. He had to ask me what my address was. If he knew (allegedly) which delivery this was pertaining to then why would he say that I ordered a lentil soup when he didn't even know what order I was referring to? Before I got off the phone with \"the boss,\" I asked him if I should return the soup to the delivery guy. He said \"no, keep it.\"\n\nSo, the delivery guy arrives with the minestrone soup and hands it over to me. The delivery guy tells me that \"the boss wants the other soup back.\" This is why I refer to the guy on the phone as \"the boss.\" If he's the boss, then he has to fix his attitude with customers. I gave the delivery guy the lentil soup and sent him on his merry way. I will absolutely miss the Grandma Specialty Pizza, but I refuse to support this business until they apologize and own up to their mishaps.", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "I love this little pizza shop! Here's my list of reasons why: \n\n1. The Grandma slice. Possibly the best $3.50 anyone could ever spend. The tomato sauce is seasoned to perfection and the crust is perfect-not too hard and not too soft. \n\n2. Variety. Not just your average pepperoni or cheese- that's too boring. This place has flavors!! (And they all look delish!) \n\n3. The people. There is a very sweet lady who works here. If she ever reads this, I want you to know you really set the bar and make my experience every time! \n \n4. Location. It's right across from a trader joes and everything else you could possibly (not)need when you shouldn't be spending money. \n\nThe prices here are reasonable $3.50 for the specialty slices (the grandma at least, that could vary) and $2.50 for the regular slices. They have a lunch time deal 2 regular slices \u0026 a soda for $5.50. They also have seating- it's limited tho. Very neat and clean. They offer wholewheat and gluten free. Oh and they deliver. Really doesn't get any better.", "author": "Marniqua C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-04", "description": "Service here is HORRIBLE... Delivery service is ... ATROCIOUS...WHEN AND IF the food is delivered it is cold soggy and greasy....then the reply you get when you call? Sorry you got your food that's all I can do...REALLY? How unprofessional, and greedy can this place get?  How sad is it when a so called restaurant can get by with making a mockery of customer service? Do I believe the customer is always right? No I do not...but this was wrong on so many levels....one star because I HAD to give them something... stay away..there is better pizza and food elsewhere in the city", "author": "Grammy B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-02", "description": "Fast delivery with reasonable prices with a ton of options, but the quality is really bad. Stay away from their very mediocre pizza and soggy salads. Their chicken wings and sandwiches are okay.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "I order from here so much I deserve a stake in the pizzeria. I love more so I'm he Carroll Gardens area. I can speak for true Chicken Parm, Shrimp Parm, Eggplant Rollantini and a lot of the menu. The sauce here is pretty good. My mom always orders be chicken roll and on only like one occasion was it delivered cooler than wanted but again that was one occasion. The food here is good. It's not an Italian restaurant, it's a pizzeria that makes good take out dishes. I've had the meatballs and Calamari and they are enjoyable too. The minestrone soup taste like it was made fresh. I like the fact I can order the dinners with a salad especially those who are trying to lose weight, the salads have roasted peppers, olives, cucumbers and tomatoes(that's an awesome side salad for a meal. You're lucky if you get carrots and tomatos at some places.\n\nThe prices are reasonable for what you get and they are in delivery apps, which is also a plus in my opinion.", "author": "Matty R."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Pronto Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ImzDE9xxPnKcG4dkcFZvnA/ls.jpg", "@type": "Restaurant", "telephone": "+17185222225"}