{"aggregateRating": {"reviewCount": 84, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-27", "description": "This was the worst pizza I have ever eaten. The restaurant has no business being in Brooklyn! Also, the owner was extremely rude. I will never be back and will make sure to tell everyone I know about my experience.", "author": "Hollie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-06", "description": "I love everything about this places , great customer services , fresh hot pizza and very tasty , actually it's the best pizza I ever had , you must try the grill chicken pizza omgz it's the best , tasty pizza with lots of fresh Vegetable ...... \n\nHard working employees , clean and super friendly, \nWill always recommend this place..", "author": "Sparkles L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-01", "description": "We had Delivery problems, I'll get that out of the way first.  30-40 minutes was 80 minutes and then unfortunately they delivered us a slice of white pizza instead of a whole Pizza pie. \nNeedless to say my hungry friends were no amused. I called and complained, and they were very apologetic, and delivered the new pizza in about 20 minutes. \nOn to the food, the white pizza was just average, but I'm not a huge fan of the non tomato sauce pizza. \nMy pan single slice with garlic and mushroom was fabulous, - so many mushrooms I could not believe it. It was one of the tastiest pizza slices I have had in a while.  \n\nThe caesar salad was pretty average, the dressing did seem like out of a supermarket, but I guess I was not expecting that much.  Hey the croutons were good! \nI would definitely come back to the actual pizza parlor, but be a little wary of delivery.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-09", "description": "Delivery service was within the 30-45 minute window, and the food was nice and hot. There was a little too much garlic in the Shrimp Scampi, but overall I enjoyed my meal.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-04", "description": "One of the employees was completely rude to us. My friends and I were enjoying a slice and having a conversation. We shared a couple of laughs and I don't think we were being obnoxiously loud, especially since other people were having conversations amongst themselves. No customers in the pizzeria complained to us about being loud, but the owner turned towards us and said \"Guys, that's enough! C'mon!\" We were actually getting up to leave. I'm sorry, but last time I checked, it was perfectly acceptable to laugh with friends while enjoying some pizza. Also, the pizza wasn't that great. It was decent. Definitely not coming back here. Not worth it.", "author": "Alan R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-07", "description": "Just ordered and boy am I disappointed. Spent $30 on a pizza and I'm pretty sure the meat was not exactly up to code. Within 5 minutes I was hugging my toilet bowl as if we were old pals. If you like your pizza with a side of stomach bile, place that order!", "author": "Darlene H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-05", "description": "I ordered mushrooms and ground beef and the Mushrooms were canned and the beef looked like someone vomited a day old bolognaise sauce all over the pizza pie. Needless to say I couldn't eat a slice. But I tried. And it wasn't good. Which says something because I had a hangover and was specifically looking to eat something greasy and bad. Shameful looking pizza .. That's for sure.", "author": "Sousan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Honestly the best pizza around! Great staff, friendly, respectful and they'll take care of you. My family eats here every week and its definitely worth it. They have fast delivery which is a big plus. If you havent tried them i highly recommend you to try their pizza!", "author": "Vigan P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-17", "description": "i'm only leaving this review because i am so f-cking angry! i've been craving cheesy, crusty, yummy, flaky pizza all day... after a long day's work, my first misstep was perusing the pronto menu. with decent reviews i decided to go ahead and order.  how the f-ck do you send someone cold pizza? when they order extra cheese? but to add insult to injury, i get a cold pizza with a burnt crust. \n\nfuck you guys!!!\n\npronto must be an april fool's joke. and it ain't funny!!!! i really fucking hate you guys right now!! completely ruined my day!!\n\n16 bux, 6 slices, pure garbage, your choice.", "author": "Nikki F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "The pizza is ok but they defiantly they over  heat it. Got to tell them to take it out. Tried their whole wheat it was pretty bad and crunchy the crust broke in half. Not the best place for pizza especially in Brooklyn the capital of pizza. But really enjoyed the chicken roll probably should of gotten a regular since everyone was getting it", "author": "Brandon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "Very good pizza. This is a \"stop by and grab some slices.\" The cheese is probably the best, as the other pizzas are a slightly thicket crust style, which isn't my preference. Great service, love the staff.", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "Love their Sicilian pizza so soft and cheesy", "author": "Emmarose S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-08", "description": "Bad food, bad service. \n\nThey have coupons in the menu, and I saw one that read: \"Buy 2 Entrees, Get a 2 liter soda free.\" So when I asked Don Corleone (old-school Italian dude) about the deal, he told me that an entree is something that costs at least $15, and that our $10 meals didn't suffice. Well, well, well. Forget the entree then, just gimme a vegetarian stromboli and an Italian sausage. Disgusting. Both of them. How about a Pepsi? They can't mess that up, right? Wrong. Don grabbed a plastic cup and filled it up about 3/4 of the way, and sloppily put on a lid and gave it to me. \"Here's ya freakin' Pepsi, jag-off.\" Okay, he didn't really say that, but he might as well have. \n\nBad experience. This is the type of joint where I wouldn't be surprised if they spat in someone's food because they don't like to waste more than 10 seconds per customer. Keep it movin!", "author": "Joey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "Very solid plain and pepperoni slices (large too). Wide variety of specialty slices like buffalo chicken, chicken bacon ranch, chicken Alfredo, chicken Caesar, meat lovers, penne vodka, Hawaiian, veggie, margherita, and others. The specialty slices have a different, thicker crust (closer to greek style) than the regular ones which makes sense because of the heavy toppings. Come here for consistency and slice variety.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "Several people on here have disparaged buffalo chicken pizza. The method here is not quite what I was familiar with from having lived in Rochester (where Pontillo's makes a great version) but it is intriguing. Here the crust is crispier, they use some kind of cream sauce drizled on top, there is not much (any?) mozzarella, but the chicken is just right and the whole thing tastes real good. \n\nthe BBQ chicken is also really good, in fact I may prefer it. Sweet, smoky and a little spicy. The mixed vegetable is also good, piled high with flavorful vegetables (sauteed mush, broccoli, olives, etc). All these pies are semi-deep-dish in format.\n\nMy favorite this is the spinach roll, which is made well. My wife likes their spaghetti bolognese, but then she just loves spaghetti so her bar may be low there. \n\nthey could stand to up their game with the simpler slices. The plain is decent, but the white and margherita need some work. (the opposite of My Little Pizzeria, where the simple slices are decent but there's nothing else available; I wish Pronto would steal the fresh basil as a free topping example from their competitors, though)\n\neither way, the staff is extra-friendly, they have soccer on TV at most times, and it's perfectly placed for stopping in, ordering take out, stepping across to the Brooklyn wine exchange to get something to wash down that pizza, and then coming back to pick up the food.", "author": "Josef K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Owner is adorable, family owned, great little pizza place!  Get the penne vodka slice!", "author": "Jaime G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "So great!\n\nWith 25 minutes to while away before a reading at BookCourt, my friend and I swept into here, not even very hungry but knowing that we would be just a bit later.\n\nSome of the wackier slices here included what was apparently caesar salad on pizza dough (gross, what a defilement of pizza!) and buffalo chicken with squiggles of cream dressing all over it, and one with a bunch of pomodoro PASTA on it - penne.\n\nI was immediately drawn to the two more tomato-rich options; the margarita, and a lone slice of whole wheat pizza. I'd had a slice of whole wheat in the city before, and it sucked. I wish I could remember where...somewhere near the UN. Anyway, I decided to give it a go here because it looked flat and crispy. It was three dollars and deLICIOUS. As I chewed, I could feel the fiber going down like a good back scratch, cleaning out my insides. Sorry if that sounds gross. Anyway, the point is that I sensed it was good for me; a novel sensation while inhaling a piece of pizza. \n\nI would have gotten another one right away, but we didn't have time to wait for a new pie to come out, so I had the margarita with fat steak tomato slices on them. This one was $3.50, and when it came out of the reheating oven, the cheese was stretchy and almost sweet with freshness. I enjoyed chewing a mouthful while still connected to my slice by a fat thread of cheese, spiked with pepper flakes and oregano. \n\nChasing it all down with my cup of tapwater, we got up to go. \"Thank you so much, it was delicious!\" I shouted at the team of a young guy and an older man. \"Thank you! Have a nice night,\" the man shouted. \"Goodbye, sweetie!!\" The young one said. Sweetie! So bold, so New York pizza!! As I waddled out the door, he added, \"See you again!\" \n\nI didn't have to say anything, but just gave a cool \"guy nod.\" They'll totally see me again. Hope they'll recognize me, though, because I might look different by then (fattttt).\n\nOutside, I gushed, \"That was SOOOO good! Why was that so good?!? Why did I like that SO much??\"\n\nFriend: \"I don't know.\" (Clutching stomach) \"Geez, I hope the buffalo slice wasn't a mistake.\" \n\nMe: \"I think it was the tomato sauce...\"\n\nExeunt.", "author": "Jia J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-28", "description": "Pizza spots are a dime a dozen in NYC, which is part of why I laugh when people from other towns say, \"New York pizza is great, isn't it?\" Actually, yes, when it's made well, it is great, just like pies I've found in out of the way places like Niagara Falls, Ontario or Santo Domingo, Dominican Republic, but nine times out of ten, pizza anywhere is just average. And that's Pronto Pizza for you. This place is okay, but nothing special. \n\nI can find the same slice, same price at many other establishments throughout the city.", "author": "Clayton A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-05", "description": "Based on one delivery of a plain pie and house salad. \n\nThe pie arrived quickly and hot (not always a given).  It looked good, smelled good, had a great texture but was oddly flavorless.  It didn't taste bad, it just didn't taste like much at all.  The iceberg based salad was adequate but, once again, the oil and red vinegar dressing was oddly bland.", "author": "Swami D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-28", "description": "Downtown Brooklyn and the Atlantic Avenue corridor around BK Heights and Cobble Hill really lack quality pizza.  I'm not a big fan of Reginella, Wi-Pie, or My Little.  It's all Fascati for me and unfortunately, it's a bit of a walk.\n\nSo, I was a bit excited to find out that another pizzeria was opening up.  To be honest I was a bit skeptical of this place -- the marquee outside just screamed mediocre chain pizza or something like that.  Although as it turns out, they have a sister location in Midwood on Ave R and Nostrand.\n\nI walk into Pronto Pizza, still quite skeptical, for their grand opening.  I take a look at the pizzas and to my surprise, they actually look pretty good!  The marinara, vodka sauce, grandma, and margherita all caught my eye.  \n\nI ended up grabbing a slice of the margherita, which had fresh mozzarella, some pretty good tomato sauce, and actual freshly sliced tomatoes -- something you don't see too often in New York.  These weren't sun-dried tomatoes, but freshly sliced ones covered with a bit of tomato sauce.  It's something my mom actually loves -- she complained to me about the lack of pizza places that offer fresh tomatoes as pizza toppings on a recent visit to NYC.  Overall the slice was actually very tasty.  My one gripe is that it cost $3.50, which is a bit too steep.\n\nThe one slice that really put me off from the display was the Philly Cheesesteak slice, with what appeared to be some cold and droopy American cheese over the steak.  In fact that's one of my main issues with pizza places like this -- reheated slices, especially when you have so many different slices, you're bound to get an old one.  It wasn't so much an issue today since Pronto was so busy.  There were some other slices too that well...I'm not so sure about - BBQ Chicken and Buffalo Chicken.  \n\nThe space is a bit small.  There are a few tables way in the back and then some counter seats.\n\nOverall, the place looks like a winner.  They also offer subs, rolls, and calzones and other typical offerings (garlic knots, wings, etc).  Whole pizzas range in price from 14 bucks for a plain to 20 for the specialty pies.  They deliver from 10am to 11pm.  I'll definitely be back to try out that vodka sauce slice though.", "author": "Victor S."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Pronto Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ImzDE9xxPnKcG4dkcFZvnA/ls.jpg", "@type": "Restaurant", "telephone": "+17185222225"}