{"aggregateRating": {"reviewCount": 84, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-28", "description": "This is exactly what a local pizza joint should be.  When I'm not up for the schlep to the always crowded Lucali, a take out pie from Pronto hits the spot.  I'm partial to their excellent margarita, but their regular pie hits the spot as well.  They're reasonably priced, fresh, and the guys that work there are both efficient and nice.  There's little seating, so it's really a takeout spot, but for takeout/delivery it's great.", "author": "Adria L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "Got a \"margherita\" pizza. It wasn't terrible, but had a comically small quantity of fresh basil on it. I think it was about two leaves, torn into lots of small pieces. The cheese and crust were alright, but come on.", "author": "David S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-03", "description": "We ordered a whole wheat pizza from here and it was disgusting. The use cheap sauce and barely put any on the pizza. The crust, if you could call it that was hard and felt like it had been frozen and not made fresh. Overall it was a horrible.", "author": "Haley M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-01", "description": "Felt sick after their mozzarella sticks, garlic bread, and pizza. And these are 3 of my favorite foods. Having tried this place on 2 separate occasions and having sampled three main italian foods, it's needless to say I won't be coming back.", "author": "H L."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Pronto Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ImzDE9xxPnKcG4dkcFZvnA/ls.jpg", "@type": "Restaurant", "telephone": "+17185222225"}