{"aggregateRating": {"reviewCount": 84, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-01", "description": "I ordered two regular slices and an order of garlic knots for around $8.00. It satisfied my craving but I like my pizza a little more crispy than chewy. The garlic knots were very tiny but  tasty! \nOkay the only thing I didn't like was this place is a little disorganized. The two people who ordered  almost the same thing as me got their food first and I was waiting for quite a bit of time. However, the people are quite friendly and do work really quickly.", "author": "Israt A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-21", "description": "Last time I'm going to order from this place. Baked ziti and Penne ala vodka tasted flavorless. Chicken rolls came burned and they were extremely small. Unsatisfied with this place.", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "This was the worst pizza I have ever had. I'm not even a picky eater and this was hard to get down. The cheese tastes like plastic. There is no flavor. Very low quality ingredients. This is the first pizza I've ever hated. Very disappointing.", "author": "Sterling E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "My favorite pizzeria in my neighborhood. Every since I was kid we went to my little pizzeria but once pronto came i had to try it and the taste of their dough made the switch easy. I love the bacon ranch pizza it's amazing. Soft doughy crust perfection. \nThe staff behind the counter are really helpful they're the reason I tried the bacon ranch (my new favorite). Love it!", "author": "yolanda c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Delicious pizza, and super fast service. The pizza crust is crunchy and airy, and they nailed the cheese blend. Had the cheese pizza (excellent), Grandma's pizza (delicious), and loaded veggie pizza (delightful). They also accommodated our special request for plain buttered spaghetti for the kids, and gave us bread and butter to go with it. \n\nNote: we ate at the place, not delivery, so the pizza was fresh off the tray. They have a few tables way in back. It was perfect for a fast lunch on the way to Governor's Island.", "author": "Mark B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Literally the best place in nyc! You can taste the freshness and for the prices it's unbelievably cheap I suggest this to everyone and they fall in love also #1 place in all nyc...and its not just the pizza they make the best pasta especially the penne vodka with grilled chicken best penne I ever had", "author": "Mark Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "If you're looking for classic thick crust Brooklyn style pizza, this is the place. Order whatever topping you want by the slice. This is an old-fashionex family run pizza parlor. You\"'ll get a warm greeting and a smile every week once you become a regular. And you'll eat well!", "author": "Rich K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-28", "description": "The key (I think) to delivery is to order on a Friday or Saturday evening. I've managed to get the best quality pizza and wings on those nights (vs. others).\n\nMy go-to fave is the Sicilian with pepperoni. Oh-so-good.\n\nThe wings though. What happened?! The first time I ordered them, the wings were un-bbq-ed, super crispy and the buffalo sauce came on the side. I was in heaven. For some reason, they stopped doing that. Please, please bring it back.\n\nOh and the mini garlic knots are puffy bites of perfection.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "One of the best classic slice pizza I had in Manhattan. Nothing fancy but it delivers! Great crust! Staff is also very nice and friendly. Would definitely recommend", "author": "Rudolph C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-05", "description": "I was walking along Atlantic and I realized I needed some food in me. Pronto. No seriously, I actually thought that word. Lo and behold, Pronto Pizza was right in front of me. It was my density.*\n\nThe place was actually pretty packed for 3 pm on a weekday, which always bodes well for the food (high turnover = fresh pies). I'm a sucker for BBQ chicken in all its forms, so after waiting my turn (the service was not as pronto as one would hope), I asked the guy to throw a slice in the oven.**\n\nIt popped out a few minutes later, and I was pleasantly surprised. The BBQ chicken was fresh and tender (although the crust was a little too far on the crunchy side of crisp), and a drizzle of ranch dressing never hurt anyone. At $3.75, it was a solid lunch, and it hit the spot. I'd do it again. \n____________\n\n*Hello, McFly.\n**Pizza purists, don't judge me.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-21", "description": "I have never been so grossed out. I ordered Buffalo wings and fries from this place because I've had good experiences with their Staten Island location. Apparently Brooklyn isn't the same. The wings I had ordered look as if they had been fried for 10 hours straight and taste as if they were fried for 20. The barely there sauce is completely oily, looks and tastes unappetizing. I called the place to complain and instead got yelled at by some rude man who told me I was \"the only person to ever complain about their wings. In 7 years of business I never get no complain\" proceeded to yell at me before hanging up on me. Completely rude and unprofessional. I will DEFINITELY not be returning and honestly I should probably call the health department to inspect the place.", "author": "Lena V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-29", "description": "Lame pizza in a neighborhood full of great places. The three pizzas we ordered were mostly crust. It was more like eating bread with cheese than pizza.", "author": "John K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-17", "description": "Ordered slice of buffalo chicken, Sicilian \u0026 order of garlic knots. The pizzas came out cold and gave me diarrhea in the morning. #SAD", "author": "Fatih C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "Ordered the meat ball parm and the chicken cutlet parm from grub hub, DELICIOUS old school sandwich, a very satisfied first time customer, I look forward to my next visit,", "author": "derrick u."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-06", "description": "I thought my regular pizza slice was average.  Nothing spectacular.  Even bland most likely due to the lack of flavor from the whole wheat flour used.  (Granted, I am not used to eating whole wheat anything.)  There was a 3-5 minute wait, and I was helped immediately. There is some indoor seating, yet it is not made for large groups.  I do love that they have multiple people working behind the counter, so it sped the service.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "....Nice Place....Great Food.....TV and Bathroom available, too....!!!!......2016'......:)", "author": "hellen f."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-09", "description": "They never ask for your name when they take your order the phone. They don't give you an estimated delivery time and they don't tell you the cost until they arrive with the wrong order. And they'll get rude and defensive when you suggest this could have been avoided had they told you your total beforehand. \"I'm sorry.  $40 for one pizza?  I don't think that's the right order. \"\n\nAnd their gluten free pizza isn't even good enough to make it worth the hassle.  If you don't get toppings it's a complete waste.", "author": "Jillian R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "All food here is more or less average. However, prices on the menu are lower then at check out. When I questioned the discrepancy, was told prices changed 4 months ago but the menus are old and they won't reorder new updated prices menu until these run out. Bad business in my opinion. Plenty other pizza spots in this neighborhood.", "author": "Felix K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-05", "description": "RIPOFF!!!! Extremely high prices for extremely low quality. BEWARE of the gluten free pizza...I didn't ask the prices before hand-I didn't think I had too...but it was $16.00 just for cheese!!! Only 13 inch. I added mushrooms (which were canned) and jalapeño (awful as well) and my order ended up being $24.00 with tax!!!!  And a frozen pizza would of been better. Live and learn.", "author": "Natasha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-08", "description": "I tried the whole wheat pizza crust.  It was thin and crispy.   The mozzarella was fresh. It made me feel that I made a healthy choice for lunch.   The slice of whole wheat pizza was $3 but they have a special of two regular slices and a soda for $5 if you are looking for a deal.", "author": "Dawn D."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Pronto Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ImzDE9xxPnKcG4dkcFZvnA/ls.jpg", "@type": "Restaurant", "telephone": "+17185222225"}