{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-09", "description": "Ok place for lunch. Lunch special is affordable, 3 rolls of sushi-your choice for a little under 12 bucks. Plus miso soup and salad. The rolls didn't have enough flavor. Fish seemed fresh. I couldn't distinguish the flavor between the spicy tuna and the spicy salmon. The shrimp tempura roll was not rolled tight enough, everything fell out when I tried to lift up a piece.", "author": "Susanna L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-09", "description": "This is second (and last) time I've ordered delivery from here. I decided to give it another go and look past the sloppy presentation of my rolls the first time around. I wasn't shocked when it happened again. However after making it through a couple of my rolls, I almost cracked my tooth on something in my spicy tuna roll. Looks like the tine of a plastic fork but who knows. Done and done with this place.", "author": "tina m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "Busy around lunch hour , other than that pretty easy to get a table quickly . It's a medium sized place with a friendly staff. I went to the college a few blocks away and whenever I was in the mood for Japanese , I came here . \nMy first time coming out of my comfort zone with sushi was here , I got the dynamite roll which was oh so delicious . The Dynamite roll consisted of crab meat and avocado and a spicy mayo sauce . My mouth waters as reminisce about it .", "author": "Meka S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-19", "description": "Disgusting sushi.  This is not the first time the food looked like this.  Salmon roll is practically white, with all fat and no fish... and I mean chunks of solid fat.  eel cucumber looks and taste horrible, not fresh at all.", "author": "Amy Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "Decided to just pop in and try the place since I pass by all the time. I was unfortunately very disappointed. \nWe got the Yakisoba dinner box and the \"sunny\" roll. The noodles were somehow flavorless and the sunny roll basically just tasted like rice since the roll was 60%+ just rice. I ended up just picking the salmon and tuna off the top of the roll and leaving the rest. \nThe only reason it isn't one star is because of the server, who was attentive.", "author": "Char H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Amazing sushi. I really love the service. They serve fresh fruit after your meal. It's very calming and tranquil. I usually order shrimp tempora or the valentina roll.", "author": "Brianna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Awesome ! Five stars and the staff is so kind and authentic! Sushi is fresh and delicious.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "It's my second time going to nanatori and I have to say that both times was equally a great time. The food was amazing. Everything was done in such a well organized manner and I just loved that. However, I felt the wait time was a little bit longer than usual but then It came to me that it took some time to prepare the dish not only for my table but the others, so I didn't mind it.", "author": "Shannon M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-02", "description": "Worst spicy tuna hand rolls I've ever had. Had to suffer through my lunch as the entire staff shouted back and forth in Japanese because of some delivery snafu. Watched my tuna rolls sit there for ten minutes before she brought them over.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-29", "description": "Came here for a lunch with a friend.. we both ordered the sashimi lunch. For $13, it comes with a salad and soup - I was full on those two items before the fish even made it to me!\n\nYou also get a side of rice (white or brown) - my friend opted for brown and I nixed the rice altogether (yeah I know.. Im the only Asian that doesnt like rice).\n\nMy fish seemed fresh: I had 3 pieces of tuna, salmon, white tuna (which was sinewy), and snapper(?) or hamachi (?).... quite fresh and delightful... I ended up giving a few pieces to my friend because it was simply too much for me to fit in my stomach.\n\nAll in all - great service (water glasses were promptly re-filled throughout the meal) and the check was brought after we finished - perfect for a rush-y lunch on a weekday!", "author": "Heather H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-26", "description": "I come here sometimes. I hate their salad. One slice of cucumber with iceberg lettuce smothered in somewhat edible ginger dressing, does not make a salad.\nToday, I had the sashimi and like another yelper said, it was thick cuts of fish, fresh. I had their sushi in the past and I always felt it was missing flavor. Not terrible, but not the best stuff I ever had. The service is always prompt but avoid eating inside for lunch unless you want to sit on top of each other. Cheap prices for lunch, and gluten free soy sauce for your celiacs out there.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-21", "description": "The food tastes good and the service is great, and I have been ordering from this place for a while.  However, I ordered today and had food poisoning from it.", "author": "Megan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Delicious!  We love the spicey tuna with avocado!", "author": "Julie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-31", "description": "Looking for a healthier meal option, I opted to try this eatery located one flight up from street level. Small restaurant with a few patrons towards late afternoon. Loved the mini-waterfall that enhances the decor and the chefs who cook the meals in the middle of the dining area. Our server was kick on his feet - walking over our menus, taking our orders, replenishing our water glasses without delay. Though the menu has a significant emphasis on sushi, I opted not to explore this time. Instead, I ordered the chicken teriyaki with brown rice and salad ($12.95). Kudos on the presentation - a huge white dish designed with a small enclosure for the brown rice and flat surface for the meat and salad to be placed side by side. The fruit served towards the end of your meal is refreshing. Great experience.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "Tiny but awesome.  Had the chicken teriyaki lunch box here which was filling without making me sick.  Not sure if it's one of those attorney hangouts for lunchtime but I could see this place being one.  I definitely didn't feel self-conscious or overdressed here.  Glad I was able to discover this place \u0026 would go back.", "author": "Monica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Love the aesthetic of the restaurant, the service was fast and nice, the food was delicious and the Lunch box is a great deal. Would come again", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-17", "description": "Lunchtime review only:\nI really want to like this place, but multiple visits have just inevitably ended in disappointment. Bland flavored sushi in tiny rolls. Same prices as Ani, but really lacks value. Generally easy in-and-out if you're in the area and need a quick bite of sushi, but it's Duane-Reade-esque in the quality, and this is assuming they don't forget to put your ticket into the kitchen.\n\nService is somewhat friendly, but they cram people into this place like tourists in Times Square, so they're frequently overwhelmed and really just take your order and give you your check.\n\nThey have forgotten our order several times now, whereas Ani Sushi down the street has been great every time and a way better value. Nothing special here.", "author": "Mathias Charles U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "I come here often during my lunch break and during the lunch hour - even though it does get busy - i can always, surprisingly get a seat. The host \u0026 waiters are super friendly too! As for the food? DELISH! I always get the lunch specials: 2 Sushi Rolls for $8.50 - brown rice is an option too! The lunch boxes and bento boxes are great as well. Especially love the Salmon! Another cool thing about this place is location. It's a few blocks away from the Brooklyn promenade and awesome views of East River/Brooklyn Bridge/Downtown Manhattan.", "author": "Maria Myraine Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "I like this restaurant very much. It has a lively atmosphere and the food is delicious. I especially like the salmon sashimi and dancing eel roll. But I always try something new every time. Live scallop was special for me tonight.", "author": "Eva L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-07", "description": "Instead of usually heading out to Chipotle or Shake Shack, my friends and I decided to be adventurous and head for Nanatori. It's further down Chipotle, where some more little restaurants and boutiques are located. When we entered, the environment was a typical Japanese restaurant that was run by Chinese people. We were seated at the window, which was literally right next a couple of living plants with dust. Cool.\n\n\nI ordered the curry with chicken. I felt there was more sauce than potatoes and meat. The rice was not enough, and I found it funny that they gave me sushi rice to nom on. The curry was actually pretty good! The salad was good too. The miso soup was mediocre. We also ordered a \"Sex in the Lobby Roll,\" and aside from its silly name, it was pretty darn good. Try it.\n\n\nI would come agaaaaaaaain.", "author": "Ling M."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Nanatori Japanese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2xSAGP58vGI9HexDkC_w3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185225555"}