{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-26", "description": "This restaurant is your run of the mill Japanese restaurant - and I don't mean that in a bad way. The food is quite good. \nI ordered the teriyaki steak bento lunch special. It came with a lot of food. The steak was delicious and the miso soup was great too. Everything came out to $15. \nThe wait staff was incredibly polite and helpful too!", "author": "Brendan E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "I like this place not because of the sushi that they serve, but the lunch special lunch box that they do. I personally would not recommend the sushi here because they do taste bland for some reason.\n\nNow the lunch box. This is a meal where you get six pieces for Cali roll, choice of brown or white rice, a protein (I default to salmon teriyaki), and gyoza or shumai. All of this costs around 12 bucks. Its filling, you get a variety of items to eat, and a bang for your buck!", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-12", "description": "I normally stay clear of sushi places that are run by Chinese people (I'm Chinese) because they tend to be a fusion of all kinds of Asian cuisines.  I came in Nanatori for lunch with a friend who really wanted to have Japanese and this place is across from my office so we decided to give it a shot.  My hesitations were confirmed when I got my teriyaki salmon bento box lunch.  The rice on the Cali roll that is included with my lunch box was kind of al dente (not in a good way) and my salmon teriyaki was mostly onions.  I found the food to be super salty and overall just not good.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "I have ordered from here many times and each time this place is consistently awesome. I ordered this Friday with a coworker and they completely messed up my friends order, but hey, my lunch roll was perfect how can I fault them?! \n\nAlso, great job on the spicy mayo. Not a lot of places nail it but you guys put the perfect amount of spicy.", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "Good, fast fresh and large portions reasonably priced nothing more to say. The rolls and salad were full of fish ordered for one was enough for 5!", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "This has to be my favorite place I go to every Wednesday! Their roll specials or Nantori bento box is affordable and gives you so much food! If you are a sushi lover their special rolls are the best! Very pleased with the freshness of the sushi never had a bad one!", "author": "Milena M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "I go here for lunch at times is best to sit in then to order to go service is very pleasant and I always order their whimsical is so good.", "author": "siomara a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Great place ,delicious food and amazing staff !\nI've been here many times and will be returning again", "author": "Darina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-18", "description": "I enjoy having lunch/ dinner here. Food is fresh, service excellent. After meal it's a short walk to Brooklyn heights promenade. It's small and cozy. I could hear myself think and enjoy every bite.", "author": "Mart M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-11", "description": "Came in on a quiet Saturday night. I used to work nearby and would see this place but never went in. Ordered the Valentina \u0026 Dynamite Roll. I have to say it was good except they use wayyyyy too much sauce. I like mayo but it was smothered in it. \n\nTo wash away the heavy sauce taste out my mouth, I took a sip of my water and observed my glass had a piece of old crusty food on it. I was grossed out. Mistakes happen but silverware and glassware should be inspected before it goes out to the customer. I'm just saying.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-17", "description": "Used to be great many years ago where you can't even get in at night with lines out the door.  Now although the portion is huge. I don't even know what I'm eating anymore. The white tuna is probably shark meat as it does not have the texture that comes with buttery white tuna.  More like white chunk of unknown fish.  That does not taste good st all.  Even the bright red tuna tastes like rubber.  The only decent raw fish left is the salmon.\nOnly reason I gave it a two star is because their cooked lunch still tastes slightly more decent. Such as their teriyaki and beef steak, when cooked right. \nTwo thumbs down.", "author": "Jenny Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Sushi, reasonable price. Most meals come with miso soup \u0026 salad. I would recommend it! They have delicious chicken teriyaki!!! Too die for!!!", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "Love this place, friendly staff, great food always leave happy. Tuna martini and the wasabi tuna dumplings are amazing.", "author": "Lissette V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-04", "description": "I have eaten here many times over years. It was more personable under former owner, Shirley. Food has down down hill recently. My most chicken teriyaki tasted like rubber", "author": "Dolores B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-31", "description": "seriously can you right the food in english because i have no clue what im ordering be for real i dont want to guess what im eating just write it in english thats itttt", "author": "Bunning P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-17", "description": "Stopped by this place on a Thursday evening. The place is deserving of its 3 and a half stars on yelp. The service, food and menu is at best mediocre and at worst mediocre. \n\nI had the shrimp dumping and chicken udon noodles. Both dishes were lacking in flavor.\n\nThe service was up and down they took a while to come get our order but the food was out quickly. The same goes for the check, took a while getting us the check.\n\nThe place itself has ample seating, we were seated in the back section. The staff kept coming in waves and sat by us and had their dinner. \n\nI doubt I'd come back here.", "author": "Subodh M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-18", "description": "I was in Brooklyn for a meeting at the Courthouse. It had been quite a few years since I've been here, but stopped by for lunch.  Hot tea on a cold winter day was welcoming.  The service was prompt (incredibly prompt!).  While I would have rather had 2 pieces of 6 different types of fish, instead of 3 pieces of 4 different fish, what was on my plate was very fresh.\n\nI also appreciated the thick cuts of fish.\n\nThe salmon was salmon (snore-- the most boring of sushi), the yellowtail melted wonderfully (chewing hardly necessary), the tuna and white tuna were very good and fresh.  The miso was miso-so (I don't know if I've ever been wowed by miso) and the dressing on the salad was oddly like Russian dressing without the relish.  Weird.   \n\nWhat was particularly nice was that my waiter waited until I was ready to eat the fish before bringing out the rice, so the rice would stay hot.\n\nThe price was right, though.  Rochester sushi prices in NYC!!!!  The lunch was $11.25.", "author": "David C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-09", "description": "I ordered through Seamless for dinner. The food got delivered in the time expected. \n\nI ordered the regular hand rolls of 6 pieces. Each roll came out to be about $6. Kinda expensive for the quality of sushi in my opinion.\n\nThe food tastes decent and was filling. But I did not like that they use so much food coloring. The fish looks very unnatural and very artificial. The spicy tuna rolls were a bright orange-red, and the spicy salmon rolls were a bright orange. The only roll that wasn't colored was the yellowtail scallion roll. It looked like what you'd expect fish to look like. It tastes good too if you don't mind the taste of scallion too much. \n\nMy friend didn't want his salad and miso soup. Other reviewers are writing that the salad is horrible. I personally don't mind the iceberg lettuce with ginger dressing. I think it is refreshing and hydrating. It is bland and won't taste like the green salads you're used to, but it is a good palate cleanser. The miso soup was as expected. However, I think that it had less sodium than other restaurants I've been to. Sometimes watering down is good. \n\nI would probably order from somewhere else for raw fish sushi. Not a big fan of the food coloring.", "author": "Bennet G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-12", "description": "I ordered the 3 roll special , that included soup and salad . Overall the food was good , however the Hand Rolls were mediocre . The rice on all three of my roll was over cooked . Service was prompt , prices are reasonable .", "author": "Azzurdee S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-16", "description": "I didn't like the sushi here at all. To start, it was kind of warm which I found gross. The Sushi roll was very mushy too and was flavorless, even spicy tuna. The eel roll was a let down. It had an awful gooey light brown sauce that was slimy. I hope Nanatori steps ups their game. With so many sushi choices, they fell flat. I will not go back.", "author": "Feather A."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Nanatori Japanese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2xSAGP58vGI9HexDkC_w3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185225555"}