{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "Went there for lunch and had a lunch special. The sweet potato and cucumber and avocado rolls were great. Avocado was very fresh. I highly recommend.", "author": "Brandi F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-13", "description": "I am never in this hood, not that theres anything wrong with it.  Just never there.\nI was around taking a trip with my buddy running an errand, saw they had ramen so we went in to check it out, sadly they do not have a lunch ramen deal so I check the other stuff.  \n\nI felt a bit rushed so I got the chicken tampura with brown rice.  They very quickly brought me a bowl of miso soup which is one of my favorites (decent, not great) a small salad (mostly iceburg, one slice of cucumber) with this orange ginger dressing.  Wasn't a huge fan.\n\nShortly there after I got my box(hehe box) with 3 pieces of chicken, brown rice, One piece of broccoli, and One baby carrot.  And and and and More of that salad I loved so much.  The chicken is the same as any other tampura chicken, the brown rice was loose and very disappointing cause I didnt want to be the \"white guy\" who needs a fork. And I didn't bother with my two sad lonely looking veggies nor that salad.\n\nService was pleasant, place looked clean.  I would go back and try their ramen if I was around again.  Their pricing for lunch is great so if you work around there go on in.", "author": "Ben F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "Stopped here with a friend after a visit to Crumbs. Service was attentive. Sushi was good. (I had the Zen Roll and Crazy Tuna Roll) and the bathroom was clean. Can't really ask for more than that.", "author": "Jess E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "I went here again after passing my licensing exam to grab a bite and wow that was freaking amazing. The cook was really friendly and chatted with me since I was alone and asked me if liked the food. The roll I had mango, and crab meat. It was amazing. I will definitely return here again and again if I am in the area.", "author": "Patricia V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-23", "description": "I was in the Brooklyn heights area for jury duty I was looking around and managed to find this nicely decorated place which seem crowded but I went anyways since I was craving some sushi. I went in and got seated right away. The waitress was super friendly. She came back several times to refill my water and ask if I was ok. \n\nThe lunch specials are reasonably priced and great portions. I ordered the salmon teriyaki special it came with brown rice, veggies, soup and a salad. not bad for $9.50. I would definitely come back again...", "author": "Yanel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-11", "description": "Nanatori is a good \"Go To\" Japanese spot. It isn't the best but they have pretty good service and the environment is pleasant. The drinks are well priced and the portions are satisfying. Like the other reviewers said, you won't find any extraordinary here, just your run of the mill sushi spot.\nKeeps me grounded.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "Happy staff makes me happy.\n\nI walked into Nanatori and was greeted with so much cheer I thought that maybe I'd won something. I sat myself down and proceeded to order from the bento box menu. When I was done, I had shumai, rice, seaweed salad, a second salad with that delicious carrot dressing, a spicy tuna roll, miso soup and chicken katsu in front of me. It was all delicious and fresh. The sushi was decent, the rice was a good texture. Miso soup was standard fare but thankfully, not clear like some places. The portion was great and when I was finished, I was stuffed.\n\nThe highlight of my meal was the drink I had made with sake, plum wine, and cranberry juice. I could probably drink a gallon of that stuff. I don't know how well I'd function after doing so, but I could do it.\n\nI think I caught them on bizarro music day, though. I walked in, and Backstreet Boys was playing. Whatever, no big deal. That song ends and it's followed by...more Backstreet Boys. Turns out they were playing an entire album start to finish. Sad faces. I think I came in on the tail end of the album since only 3 songs played before it switched to an old Britney Spears album in its entirety. I'm sure that if you're with company, you might not notice this, but I was solo, so I definitely did. \n\nThat oddity aside, I enjoyed my meal here.", "author": "DeShaun C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Great sushi and good teriyaki. Been a neighborhood staple and very nice workers", "author": "Andrew F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-21", "description": "Let me just start by saying that people who criticize restaurants due to their own subjective opinions and likes just don't understand the purpose of eating out.  Opinions such as a place being 'to crowded' or 'over priced' or even better - 'the food was too salty' are a waste of time to read.  I spend 50 hours a week managing a restaurant and when I go out to eat I want to enjoy myself.  These are how yelp reviews should read......\n\nI went to Nanatori Sushi with my wife for lunch.  We ordered food and received service.  I was pleased at the value I received in direct correlation to the amount of money I spent compared to the amount and quality (solely based on my own opinion) of food I received.  I enjoyed my visit and I will be back.*\n\n* The affirmative statement of my, and only mine alone, intentions to return were based on my core principal that if a restaurant meets my minimal- self imposed threshold of satisfaction during a visit they are eligible to be a place where I could visit in the future.  \n\n\n\nVery important note about service-  Nobody interprets good versus bad service the same way-  Just to make sure that EVERYONE is on the same page- when you go to a restaurant you receive service.  Your own opinion is pointless.  If more explanation is needed...let me know\n\nAlso Important- specific details about what you ordered are not necessary......as once again......we all have different tastes.  Don't waste my time.  Restaurants have that all figured out already- it is called a menu.\n\nI didn't go to SUNY Buffalo and major in English ( I think that is obvious from my grammar above) but I do have a Culinary Arts Degree.  Any questions about food costs, liquor costs, labor cost, management controllables etc. please ask me- it might help you understand why you received the service you received, the food you ate and the check you paid.  In the long run it might help you enjoy your dining experiences more!\n\n\nP.S. - a couple of obviously statements that people have the possibility to find entertaining make forums like this more easy to digest are appreciative", "author": "Biscuit N Booze D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "Good sushi in a glamorous atmopshere.\n\nI like the warm dark room a half story above scenic Montague Street. Like most places on the block, I think they do a big lunch business, which accounts for the slightly mellow-harshing neon-puff-pen specials board and radio soundtrack. But the dinner environment is pretty sedate due to the tone set by the dark colors of the room and the medium size crowds.\n\nI've only had sushi there, but it's great \u0026 I keep coming back for it. The chefs are fun and talkative, and the servers are knowledgeable about the food. I particularly enjoyed the \"B\u0026W Roll\" recently. They go more all-out with presentation that many other sushi spots--sometimes the plate looks like a mini department store window, with twigs arranged to resemble barren trees, or even a color changing disco LED light square hidden under a plate of sashimi, hidden in crushed ice.", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-01", "description": "This is one of my go-to places for dinner in the area. I really like the space there, feels friendly and clean and intimate. They often play 90s music, and so busting out into Backstreet Boys in the middle of dinner is pretty great. It's really fairly priced, for the area and the quality of the food.\n\nThe service is ALWAYS great. I'll agree that it's not the best sushi I've had but it's really serviceable when I've got a craving for some seaweed, rice, and soy sauce. For good quality fish, you'll rather go elsewhere. For sushi that fills the sushi need, this'll do. They have a long list of pretty crazy specialty rolls, for quite cheap. ($8-$10). Their generic sushi - spicy tuna and everything in its league -- is pricier than I would have expected, comparatively. ($7-$8) I've never tried these. However, the beauty of this place is the EXTENSIVE menu. It just goes on and on and on, with awesome variety and great \"combo\" type deals. Great for tempura of every kind you could hope for, udon, and katsu of several varieties.\n\nTwo must haves here are the miso soup (miso soup rights my world) and tempura fried red bean ice cream. Two people can easily dine here for $35, including tip. They never rush you and they're open to 10:30 most nights and 11:30 on the weekend, making it a great place to come with friends and just chow.", "author": "A S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-17", "description": "Went here for lunch when I was in the area for work the other day. The lunch specials are not bad but I recommend ordering either the bento boxes or the sushi rolls. The unagi don is disappointing since they don't give you enough eel..", "author": "Ryna D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "A solid three stars for the food. it's not the best sushi place in the area; it's not the worst. \n\nAn extra star for the fact that you can place an order anytime, even up to a few minutes before closing, and the food will be at your door within ten minutes. I haven't actually eaten in the restaurant itself--with such speedy delivery, why bother?", "author": "Michele W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-01", "description": "This place is super small and gets packed during the weekday lunch rush. I'm always willing to wait for a table during that time because I know the food is going to be good. Their lunch specials are very reasonable, Pork Kastu Don with soup or salad for $8, they are a little heavy handed with the sauce but it comes with fresh mixed veggies and your choice of brown or white rice. $7 for 2 rolls which my friend and I always share with our entrees. \n\nGreat i just made myself hungry and I'm emailing my coworker if we can go to Nanatori for lunch! Go you wont be disappointed.", "author": "Tassamai S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-12", "description": "The food is very basic, nothing out of the ordinary \u0026 because of its size and location the place can get pretty uncomfortably crowded. The first time I went, my sushi was good, but fell apart.  Second (\u0026 last) time,  I got the worst case of food poising I've ever had from their salmon bento lunch box.  I have no plans to visit again.", "author": "Heidy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "This place is located in Brooklyn Heights around several other popular eateries.  I was looking for a good sushi place one day and after googling local places I found the address to Migita. However, when I went out to buy lunch at Migita I couldn't find it. I ended up hesitantly entering Nanatori.  I'm a fan of Lichee Nut so I felt weird going in Nanatori like if I was betraying Lichee Nut or something, even though they are different types of food all together lol.\n\nI ordered the basic California roll and a Salmon Tempura roll off the lunch special. I was very pleased with the dish!  The food tastes fresh and delicious. I was skeptical at  first but very satisfied after finishing my meal. The atmosphere was a little dark and drab for me.  \n\nThe following week I returned with my boyfriend for lunch.  Eating in is a very nice experience nicer than I thought it would be cus its so darn dark in there.  The man I believe is the manager is constantly supervising the restaurant and ensuring that the customers are happy. Often filling in the role of waiter to make sure drinks, appetizers and such arrive speedily. I really appreciate that, because it shows care for the \nestablishment and its customers.\n\nI like the plates they use, the service is friendly, professional and quick.  My boyfriend's Combo box was very tasty and the presentation was nice. My sushi was fresh and great, as usual.\nThe bathroom has to be one of the freshest, best smelling, and tidy bathrooms I've ever went to in a restaurant. I liked that a lot too. \n\nI do not recommend the tempura ice cream though, the one we ordered was barely fried. \n\nOverall, I'm a fan of this place", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-09", "description": "Went to this restaurant at around 4PM. There were maybe two other people eating. \nHere are the pros and the cons:\n\nPros:\ngood spicy salmon roll. Good agedashi tofu. decent salmon roll. \n\nfood came out pretty fast \n\n....that's about it\n\nCons:\nAfter we decided what to order, we waited several minutes before we had to ask the sushi chef to send someone over. He notified the waitresses immediately, and they STILL sat around for a few minutes before one made her way over to us. Keep in mind that there were only three tables occupied, including ours. On top of this, our waitress was super unfriendly. And nobody ever came to refill our waters, even though 2 out of the three in my party had a completely empty glass.\n\nI ordered the Pork Katsu Don, and it was one of the least authentic I've ever had. Usually the meat is embedded in eggs with other stuff like onions, but this time it looked like they plopped the meat and some vegetables onto rice with a fried egg. It was pretty sloppy. \n\nOverall, the food here was decent. I think I might have been more lenient if the service wasn't so crappy.", "author": "Natalie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "Our favorite Japanese restaurant in the neighborhood.  I tried it out when we saw the google offer last year, and have been back numerous times for their lunch special.  10.45 for 3 rolls (or 12 pieces of fresh sashimi), salad, and soup is a great deal.  You leave satisfied and the service is good.  It is consistent and can't complain.\n\nOn a side note, they've stopped playing the cycle of boy bands from the 90s since our first visit which was a nice trip down memory lane...Yes, I'm a sap.", "author": "Simon C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-10", "description": "Good place to grab a quick lunch. The place is a mad house during the peak lunch time hours because of all the office buildings in the area. They turn the tables over quick and so you will get a table. Its crazy how much sushi is being served, delivered and taken out. Its a good thing cause you know its all fresh. Good lunch deals and choices. I like the three roll lunch with soup and salad. Its nothing spectacular but very solid food served fast. These guys are rolling sushi non stop for hours its that busy. Solid choice for a pleasant, quick and comfortable lunch.", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-12", "description": "So let me preface this with I had food poisoning here once.... Even after all that, I don't hold it against them. It was over two years ago. Eating raw bivalves is always a little risky, and I knew one day or later I would have to suffer the consequences. I mean, do people realize how dangerous eating raw oysters or scallops can be? Pamela Anderson needs to steer clear of those....\n\nNanatori is still my go to sushi place in the Heights. It's a small second floor restaurant on the bustling street of Montague. The sushi is good albeit not great and the prices are pretty decent for the neighborhood. They also have brown rice as an option and use rice vinegar, unlike Iron Chef (which is a few blocks away). Once a week my aunt and I order delivery from Nanatori; we are big fans of the spicy tuna rolls, the shrimp tempura and the Alaska roll (salmon, avocado and cucumber), all with brown rice. I do miss white rice though... thank goodness the brown rice versions at Nanatori are tasty otherwise it would be hard for me to stick to it! \n\nOverall, would I come here to drop a lot of dough on a date if I wanted great quality sushi? No, but for a cheap weekday meal, it hits the spot.", "author": "Leslie D."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Nanatori Japanese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2xSAGP58vGI9HexDkC_w3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185225555"}