{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-16", "description": "Perhaps I'm not the best person to review a sushi place seeing as how I don't eat raw sushi. I stick to sweet potato, cucumber or asparagus rolls. All of which are pretty solid here. The lunch special is a great value, and the ginger salad dressing is great!", "author": "Rianna G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-15", "description": "food is not good but servers are really nice! decoration and atmosphere is nice too. might come back for desert but not for the food. prices are not bad for brooklyn heights. service was really fast! and it is by the subway station so if you are in a hurry it is good to go.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "The tuna is great.  Some of my favorite.  Fresh and delicious both times I've tried it.  The sashimi and spicy tuna were both great.  There is a nice big menu, lots of Japanese American classics, and some items you don't see a lot, which is exciting.  During lunch last week they were playing the Spice World album on repeat.  Spice World is a short album, and I've been trying to eat slower, so I heard it 2.5 times.  That really isn't acceptable.  But the service and the ambiance is otherwise great.", "author": "Emily M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "Update to mention that in addition to their super-prompt delivery, the dine-in experience is lovely too.  The atmosphere is sort of zen-cozy with dark wood, spare decor, and warm lighting.  Excellent, quick service and very friendly staff.  And, as with the take-out and delivery, the food is just delicious.  The Ikura sushi with optional raw quail egg is one of my new favorite things, and the Tamago is also yummy and a bit unusual.  I'm so glad to have found this spot!", "author": "Katie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-09", "description": "it's my first time trying this restaurant though passed by several times, I have to admit I've made a wrong decision. \n1. staff: not friendly at all, never saw a smile the moment I stepped in till I left. Left unattended for long time even there were only a few tables of customers. I asked the bill but never came back to pick up till I asked for a change.\n2. food: I ordered chicken curry with rice\nI have to say I have never seen this dish served like this: curry chicken over a large pasta plate, rice in a bowl. Am I supposed to spoon the curry into the bowl? both items should b served on the same plate with rice on the side so u can mix it. When I asked for a plate they gave me a salad bowl, I said I needed a plate, they they gave me a small side plate, so I gave up. \nJapanese curry is supposed to be mild spicy but the curry here is killing me, never tried such a spicy Japanese curry anywhere in the world\nI'm a flight attendant flying around the globe, n I hv never tried such a terrible Japanese restaurant.\nIf u think the food here is good, I'd say u'd never tried better before.\nFINALLY I got the answer y it's such a crap. All staff speak mandarin. even the chef r NOT JAPANESE.", "author": "Meichel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-31", "description": "This is a wonderful lil spot on Montague. They deliver PROMPTLY might I add and the delivery man is nice. The sushi is always fresh, they don't mess up my order and the place is spacious if you want to sit in for lunch or dinner. Thumbs up!!", "author": "r b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-28", "description": "I came upon this place during my lunch break from jury duty, so it isn't exactly something I seeked out. It's pretty standard sushi with Manhattan prices. The miso soup tasted like miso soup \u0026 so forth. The greens looked fresh, that's always a plus. The tempura'd items were pretty good as well, though it's kind of hard to screw up fried stuff. Not bad for a juror's lunch.", "author": "Jeff T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-16", "description": "Order food for pickup and and the Tuna rolls were awful never going back again. The Tuna Rolls tasted like old fish.", "author": "Victor R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-08", "description": "This is my new sushi lunch place!  I came a little after 1:00 and the place was filled with a line out the door.  We told them we had an hour, and they were very quick.  The miso was your generic-lunch-special-from-a-sushi-place miso and the salad, while iceburg, the dressing was good. I got the eel avocado roll and the spicy salmon.  Definite points for freshness and I liked the tempura in the spicy salmon, but there was nothing spicy about it.  I want to try the Yakiudon next time!", "author": "Liz M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "I have ordered from them 2-3 times (never been to the actual restaurant).  The delivery was always pretty fast (under 30 minutes) even for very large orders.  As far as the fish, it was very fresh which is my main concern when it comes to sushi.   After constantly ordering from Osaka and Hana Cafe, I think I found a replacement.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-28", "description": "PLEASE GO HERE!!!!Me and my fiance went here to eat for dinner. We had the teriyaki chicken, with brown rice, california roll, beef dumplings, cucumber and avocado rolls, miso soup, salad with sesame dressing, green tea ice cream and strawberry mochi.  It was very filling, the service was quick and it was very delicious. We prefer this over Tenda. The prices are very affordable.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "I have been going here for many years but now there are sushi places in Clinton Hill so I have not gone much lately... OK so I was in the Heights, stopped in and nothing has changed. I always get the Chriashi  in any sushi place.  It was large assortment of good quality fish not all loaded up with fake crab and egg and the servers where friendly and attentive. The prices are reasonable and the drinks are potent.  Lovely date spot, 4 stars.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "This place is surprisingly good and reasonably priced for Brooklyn Heights.  I go here every now and then both for lunch and dinner and it's for sure good sushi.  I usually get the bento box combo for dinner which comes with (if I remember correctly) gyoza or shumai, sushi, chicken teriaki, and maybe something else.  Anyway it's all good, best Japanese food I've found in the area and with a good selection of rolls not at manhattan prices.  Fairly cozy set up, not the worst for a casual date.  Try it!", "author": "Rob K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-18", "description": "When I first walked into Nanatori I was expecting it to be larger but it was a cute little Restaurant. I came about 20 after the opened so it was too many people there yet. So I had a soup but I can't remember the name of it, I think it's the soup they give with every meal if you don't choose the salad anyways it was pretty good and it had seaweed In it which I never tired before. As an appetizer I had the California Rolls and Shrimp Tempura at first I didn't like it but after I got use to the taste I found it to be really good, by the time I got home I was craving some more. I can't remember what the name of my main course was but it was good as well. Overall I really liked Nanatori and it wasn't really expensive at all which is always a plus.", "author": "Brenda-Cleo S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-08", "description": "The good:\n\nIt's a \"better\" sushi place, not a budget sushi place.  You can always tell because they will either compete on price on the basic items, or try to offer more things and compete on quality and variety (though they can go overboard, as I will explain later).  The quality of the raw fish and sushi rice is good -- the rice is seasoned correctly and also fresh and the right texture, none of this overboiled limp rice that you so often see at low end places, or long grain which no Japanese will absolutely EVER put in sushi, and will often refuse to eat altogether -- and better than the budget places in the neighborhood.  Also, the first time I was here, I ordered uni -- which is amazingly good when it is fresh and amazingly bad when it is not, the waitress took my order to the sushi chefs, talked to them a while, and came back and told me that \"we do have it today but it could be better, so the chef recommends that you order something else\" -- putting my enjoyment before their profits.  How often do you see that!  Kudos for the integrity and service!  Another place would have jumped at the chance to offload some very expensive uni that is past its prime.  So, the service also can't be beat.\n\nIt also has good cooked dishes.  I've had a few and enjoyed the broiled cod the best.\n\nThe bad:\n\nSo, the two stars...  For me, two stars is already pretty good, and I tend to be especially hard on the Japanese and Chinese food places since I lived for many years in Taiwan and have also lived in Japan for a few years, have traveled extensively in China, and so am a bit spoiled for those styles.  Besides, to me it would really have been 2.5 stars, since this place is slightly better than the bargain places in the area, and has excellent service.\n\nI would have rounded up, except that the place smells of stale frying grease -- it's not their fault, but there it is.  It comes from the American-Chinese place downstairs, and permeates and surrounds the entire restaurant.  You smell it walking up the stairs, you smell it the entire time you're eating, and you smell it on your clothes when you go home.  It doesn't bother some people but it bothers the hell out of me, and I gave them every chance, going back a few times at different hours to see if there was a time at which the grease smell is not so prominent.  Turns out that since the restaurant downstairs keeps pretty much the same hours that these guys do, there is just no escaping it.\n\nOther than that, its menu seems a little *too* large -- they offer stuff that normally would never be offered together in one establishment, for example sushi, soba, yakisoba, udon, yaki udon, etc.  I don't even bother with the noodle dishes because I know that these would rarely be ordered and so must be made from bottled tsuyu stock (for the soup noodles) or dried flavoring powder (for the yaki i.e. pan fried noodles), which I would be better off making at home for pennies with almost no effort using the same exact ingredients, that I can buy at an Asian grocery.  As much as I appreciate the effort to offer variety, I would rather that they didn't have the option than to list it just because they can, rather than a product they are proud to offer their customers.\n\nThe conclusion:\n\nSo, they're not real authentic, and the place smells like frying grease, but they offer pretty good food.  If you don't mind the grease smell, it's a two and a half star place.", "author": "Frank L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "This sushi is fresh and good.  And they have a soup, salad, and three roll lunch for $10!  No wonder this place is always packed!  Best lunch deals in downtown Brooklyn BY FAR.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-11", "description": "Nice Japanese place. I've been there a few times and have greatly enjoyed their sushi, soups, desserts and entrees. I really like the look of the place. Its price is the only factor that limits me from going there more often.", "author": "Jose C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-30", "description": "Nanatori surpised me with it's fresh and well-sized sushi rolls, a generous portion of pickled ginger, a bonus section of veggies, and just-ok miso soup (but they give more than Migita down the street).  Decent spicy tuna (just-shy-of-perfect spice level) and eel-avocado rolls, but what was up with the unsightly layer of oil in the salad dressing (it tasted fine after I skimmed the oil)?!  For $8, it's a 2-roll sushi deal comparable to Migita and Tenda, but I think they have a nicer atmosphere if you're eating in.  Just avoid the area in the middle of the restaurant where people wait for their pick-up orders; it seems to get chaotic.  Solid 3 stars.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-09", "description": "Are you a chicken teriyaki fan like me? they have one of the best chicken teriyaki's i have had in a long time.  great atmosphere, great service.  great food.  enjoy.", "author": "cary s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-24", "description": "The miso soup tasted like the pre-packaged mixes instead of something they actually prepared in the kitchen. That was a bit disappointing.\n\nThe sushi is pretty good and they offer a large selection on the menu. The service is also good, we were checked on frequently to make sure everything was good and any requests we had were filled promptly.\n\nNot a bad place to stop for a dinner! The prices seemed fairly reasonable for a sushi stop as well.", "author": "Jason H."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Nanatori Japanese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2xSAGP58vGI9HexDkC_w3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185225555"}