{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-29", "description": "I had to come back here and review this place again, because I am practically glowing right now.\n\nSo, I took my mom here for her birthday tonight. Not only was our sushi and teriyaki delicious and the staff very friendly and attentive, but they gave my mom free ice cream, and a freakin' musical flower candle thing, and sang to her. And took our picture for their wall. And they really meant it all. Smiling the whole time, and they were just generally very caring and compassionate. We felt like family.\n\nI love this place. If I didn't live all the way in Flatlands I'd come here every day. CUSTOMER SERVICE IS EVERYTHING. Oh, and tasty food.", "author": "Krystal L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-25", "description": "I have gone to school and worked in the Brooklyn heights area for over five years and throughout that time have frequented nanatori occasionally. Every time it is average at best but still a cheapish lunch for the area. This time I ordered beef teriyaki for pick up and went back to work. Upon opening it the beef was so raw I could have sworn I heard it moo for help. I called and the manager did the right thing and had a delivery man bring me a new one fully cooked. However. This delivery person was so rude that he had to come deliver it and demanded a tip at which point I pointed out he wouldn't be delivering it if the restaurant hasn't ended up to begin with. Overall a frustrating experience for mediocre food. Probably won't be going back. I suggest you do the same.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-02", "description": "Visited the area during a temp work assignment and decided to stop in for lunch on Monday. Had some miso soup, and shumai followed by delicious salmon terriyaki, rice, and a fresh salad with the AMAZING ginger dressing! It was so good, I had to order dinner to take home with me the same night!! Definitely plan to visit here as often as I can!!!", "author": "Charisse R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "great food quality! I will deff be coming back here since i work around the area. I usually have lunch specials and its always around $15 for a good amount of sashimi followed by the Miso soup and a salas with finger dressing. For a lunch special its pretty delicious. Came here once to have dinner with a friend after work it was pretty good as well, except for the server who seemed impacient anytime she was asked a question about the menu. Thats is why I prefer to do take outs, but it deserves the 4 stars because of food quality and price.", "author": "Mel S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-05", "description": "They're okay. I've been here for the salmon roll, cucumber roll and salad and I have to say it's not that special especially compared to the sushi place on Clark which is a few blocks away. I feel that the prices do not reflect the food quality; they should be lower since it's not anything to write home about. If you work in the area or you're in the area for lunch the bento box is good deal. I don't like how dim it is inside but there is a huge eel in a fish tank that will occupy you so you don't look impatient as you wait for your food because they definitely take their time.", "author": "Shanora S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-27", "description": "Good food, not the best I have ever had.  I think the service is prompt and very good.  I had three or four people checking on me every now and again, but not too crowdy.  I had the mixed yakisoba Bento box with shumai and a spicy tuna roll.  It also came with rice, soup and a salad for $17.95.  The prices are very good here and I will come back next time I am in town.", "author": "Jeramy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-02", "description": "Not as much people as usual, maybe because of the competitor down the street? But, it is good for me to have a nice environment .", "author": "C K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "My favorite spot for Bento Box lunch, their Sushi is great as well. Decent prices with great service.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-25", "description": "This place is crowded all the time, what's the reason I have no idea. The sushi is a joke. Its not fresh and the staff are rude.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "I went here to celebrate my friend's birthday.   We got 18 sushi rolls for under $20. We shared the plate.\n\nI love the fact that they give you pieces of chicken to munch before they bring out your meal. And after they give you a little dessert. The dessert was orange and pineapple pieces.\n\nThe strawberry soda was good too. It wasn't too sweet.\n\nOverall it was a nice dining experience.", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-07", "description": "Came here to pick up something for lunch.  The sushi rolls are okay, but nothing spectacular.  The prices are okay and the staff are friendly.  Other than them giving me a shrimp avocado roll instead of the eel avocado roll i ordered, everything else was good.  I'll probably come again.", "author": "Yeemei C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-28", "description": "What is there to say except the place is a solid lunch joint: very good lunch deals (3 rolls + soup + salad for $9.99!) - the food itself is always solid, no complaints.  Non-sushi dishes are similarly reliable - chicken katsu tastes the way fried chicken cutlet should taste, nothing wrong with that!\n\nYou want lunch - check the place out, would I travel from anywhere to come here? Probably not.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-10", "description": "I really was surprised at how disappointing this restaurant was.  The reviews here on Yelp are primarily positive, so while at a conference in Brooklyn a colleague and I ventured to Nanatori.  \n\nI always like to start with positives.\n- multiple beer choices\n- nice people\n- not crowded on a weeknight\n- pretty fast service\n\nNot so positive\n- seats not very comfortable\n- overall the quality and freshness of the food was totally disappointing. For instance\n- the unagi had much less flavor than is typical\n- the spicy tuna rolls were soppy and too mayonaisey.  yuck\n- the sashimi was not well chilled\n- the tuna was a little mushy\n\noverall the experience was below average. \nsorry.", "author": "Donna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-10", "description": "Went here for a date and ordered the Crazy Monster Roll and the Dynamite Roll.  Both were delicious, large and beautiful.  The Monster was deep fried to perfection and I would have liked to have ordered more but it turned out my date rarely ate fish and had \"already eaten too much that day.\"  I cannot really review what she ate because she ordered the most plain things on the menu (she was rather plain as well).\n\nAlso got the seaweed salad which was very good, but it's also hard to screw up. My only complaint is that the stone cups they served the tea in conducted so much heat I had to wait ten minutes for them to cool down before I could pick up the cup.  \n\nWill go back here again when I'm in the area.  Will not see the woman again.", "author": "Mike H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "my roommate and i were so hungry and we ordered delivery and they came really fast to deliver our food. 10/10 orgasmic food eating here once a week.", "author": "Alice L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-04", "description": "Came here for dinner with a coworker. Food was good. Ordered the crab meat ravioli but it wasnt a ravioli it was more like a crab ragoon bc it was fried. It wasnt bad just misleading. The sushi was good. Ordered the tango roll and my coworker got the sunny roll. Service wasnt the best. There was a lack of attention.", "author": "Beatrice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "Love Love this place! The waiters are polite and patient. They did not rush us when it was time to close. They even ask us if we wanted anything else. The food was awesome! It was the first time I finish a bowl of ramen with chopsticks! :)", "author": "Christal A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-20", "description": "3-stars for the food.  It's just another sushi joint in Brooklyn.\n\nWhere they really win me over though is the delivery.  It takes literally 15 minutes from when I place my order, until I receive.  Furthermore, the delivery guys here are ridiculously nice, I mean you can totally read it in their body language, and these guys are just all around great guys.  5-stars for that.  \n\n****", "author": "Minh L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-25", "description": "If you work in the Brooklyn Heights area, this is a handy lunch spot.  They offer all sorts of weekday lunch specials, and you can get out of there for under ten bucks and half an hour of your time.\n\nI ordered two rolls, and I was happily surprised to learn that soup and salad came with the lunch special.  The miso is average, and they have a tasty peanut ginger dressing on the salad (a little too much, but it was still quite good).\n\nThe fish was fresh (I had both salmon and tuna), and they offer a choice of white or brown rice in their sushi rolls.  However, the nori was chewy and made me gag a little.  No problem, though, the rolls are just as tasty when they're disassembled.  Next time, I'll go for sashimi.  A solid three stars.", "author": "Carly D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-11", "description": "Nice place for sushi if you are in the area. Service is prompt and the sushi is fresh. Lunch specials are decent and a good place for a sit down lunch.", "author": "Cynthia M."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Nanatori Japanese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2xSAGP58vGI9HexDkC_w3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185225555"}