{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-21", "description": "Decent place. Friendly staff (the waitress called me sweetheart and I giggled). The sushi is mediocre...nothing special. It hits the spot when I'm craving non supermarket sushi but too broke to go to a fancy place. The lunch specials are really affordable.", "author": "Azizah A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "I frequent Nanatori at least once a month during the school year when I attend St.Francis for my monthly district meetings. \n\nThey have a lunch special and you won't be spending more than $15. It's pretty crowded around lunchtime but the turn around is quick.\n\nThe staff are friendly for the most part", "author": "Lola O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-18", "description": "Wow. Chicken is not edible. It tastes and smells like plastic and makes you wanna gag. I don't know why the food has changed but this is the second time I've ordered the chicken teriyaki to get this mess. I just wasted money since I'm throwing out this \"lunch\" pronto. Ugh.", "author": "lena p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Shout out to the staff at Nanatori. My daughter loves and looks forward to going to this place. She had a group of her friends join her to celebrate her birthday and they treated her like a little princess. Our family has been frequenting this establishment for years! We highly recommend this restaurant, especially if you love sushi.", "author": "Nyasha N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "This is a pretty solid sushi spot in BK Heights. Nothing spectacular, but good, cheap sushi. Lunch specials here are the best value for $10, lots of specialty rolls and cheap wine ($6/glass).", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-04", "description": "The eel roll was pretty awful, maybe the worst I've ever had. They also got my saba order wrong but I don't mind if the service struggles. Just don't go here if you want a good affordable meal. You'll just get an affordable one.", "author": "David H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-20", "description": "Don't get me wrong I love fast service, but I ordered the house box for lunch special and it came out way to quickly. It seems as if it was ready and waiting for someone to order it. The shrimp seemed like it was cooked and just under a heat lamp because it was very dry the sauce was cold and the vegetables too. And the rice seemed to be a little dry as if it was out ready to go for awhile. The only thing that seemed fresh was the California roll and shumai. First time eating here and not that good of an experience", "author": "Nat K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-08", "description": "Good selection in terms of specialty rolls. The White Pearl was delicious - and it's hard to find good rolls with scallop. The miso was very seaweed heavy and the salad was watery. Otherwise the chicken katsu was good. Of the sushi places on the block it stacks up nicely", "author": "Kiefer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "great food. I like their special rolls. small location but it it very cosy. the food is always fresh and delicious.  I've never had complaints from this place", "author": "Tariq C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "This is the right place for buying special rolls sushi... Most of the special rolls here is really good... My favorite food in this honey sandwich, it's a sushi shaped like sandwich. Their bento is good but the side dish, especially miso soup is not really good. I don't really recommend to buy fresh sushi though for me I don't like it, but maybe it's because I mostly order for delivery.", "author": "Edwin E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-24", "description": "I've been here multiple times for both dinner and lunch since my work is not too far. I've done delivery and sat in for sushi at this place. \nFirst off the place is cute but be careful what time you decide to go in because it is small and does get pretty packed. The staff are pretty friendly but since it's so small and so busy, every time I would ask for something I would have to ask multiple times which gets annoying. \nNow for the food, the food is pretty good. The rolls are small and overall similar to many sushi places I've been to but something keeps me coming back. \nSo if you're looking to grab a quick bite to eat and it's sushi you're having a crave for. Hit up Nanatori.", "author": "Braxton B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-09", "description": "Always hits the spot, but that is because it is sushi. To be honest, it is good but not especially great sushi. There are a lot of options, but it is never all that filling (a stupid complaint considering it is sushi) and some of the roles, although tasty, are pedestrian. They do make sushi though, so that is a huge plus! However, unless you are craving sushi and this is the only place around, I wouldn't go out of my way to swing by here, it is pretty MOR and not doing anything exceptional value-wise.", "author": "Max T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "Sushi was very good! Cute place and saki was very good. Have to try Tuna flower appetizer. Very fresh and amazing!!!", "author": "Ronnie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "Delicious. Price was reasonable. The presentation was nice. Each time I go there is a different special to try. Tonight was the aji fish appetizer. It was good and presentation was nice. Definitely a do again.", "author": "Jane E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-23", "description": "The ambience was comfy, service was good. I had chirashi, tuna and white tuna not as fresh, sushi rice was too sour. disappointed.", "author": "Eque L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-22", "description": "Suckered me in w/ an $8 sandwich board lunch menu.  It definitely did the trick.  Just what I needed for a decent price (which i swear is impossible to find in NY).\nIf you're looking for QUALITY japanese food, this definitely isn't the spot for you, but if you're just looking for something decent for a decent rate... come check it out", "author": "Ken T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "Best Japanese food tasted ever! Good was amazing had salmon rolls and tuna rolls and it was tasty!", "author": "Orlando R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Today I enjoyed the Montague Roll..I was a little hesitant at first to try a sushi roll with mango in it o_O but the taste actually blended nicely with the lobster salad and piece of salmon. I've been here numerous times in the past and have no complaints! The spicy Tuna Roll is pretty good too. It's very hard to screw up sushi lol expect a good meal!", "author": "Kadeem C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-27", "description": "It had been a few months since I'd eaten sushi, so I was excited when my boyfriend brought me here for lunch. I thought hey this will be a great chance to show off my (which ended up not to be) superb chopstick skills! He is a regular there and raved about how good the sushi is, and was right..\n\nOur meal started off with soup and salad and the sushi came shortly after.\n I had 2 rolls- smoked salmon with creamed cheese, and the Alaskan(raw salmon w/ avocado).\n\nOur appetizer was fried shrimp shumai. So good, next time I will order my own!\n\nI had to take away one star, because the otherwise very polite waiter disappeared on us. For about 10-15 minutes he was nowhere to be seen, so I had to wait to ask for another drink. We saw him waltz back into the restaurant from somewhere outside..Hmm smoke break?", "author": "Chrisi G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-10", "description": "came here for lunch.\n\ngot the chirashi lunch, it came with soup + salad. started with salad, in the middle of eating it, waiter asks if I'm done with the soup. there was no line, the table was not filled with anything else, so didnt understanding what the rush was about (because she asked more than once as i was eating my salad).\n\nok, chirashi lunch comes, the raw fish was at room temperature, dare i even say warm + did not taste good. some pieces were pretty chewy + i eventually had to give in to wrestling with it in my mouth. \n\ndon't think i will be returning.", "author": "Cassie L."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Nanatori Japanese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2xSAGP58vGI9HexDkC_w3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185225555"}