{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Love this place! Valentine roll is my favorite but during lunch special I get the two spicy tuna rolls, miso soup, and salad which is a steal! Fish is fresh, service is good, and prices aren't bad!", "author": "Lynnette V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-02", "description": "Where shall I begin? The flies on the soy sauce container? The gristly salmon skin roll with the texture of jerky? The tiny pebble (?) in the crust on the age tofu? The mealy yakko tofu? Salmon roll wasn't rolled properly. Futomaki was supermarket quality. Friendly staff though.", "author": "Beth P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-22", "description": "I ordered the sushi lunch special to go and it was ready in about 5 minutes. Prices are also fair especially for the location. I don't recommend any raw rolls here. The fish tasted fishy and old. The veggie rolls were really good- both the mushroom roll and sweet potato rolls were delicious. If you're looking for veggie rolls or any cooked rolls this place will do, but steer clear of anything raw.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-26", "description": "Are you ready to have your mind blown by the freshest, most incredible sushi that has ever hit your lips? \n\nThat's cool. But I don't think it's going to happen here. \n\nNanatori is pretty solid, but it's not going to shock and/or amaze with its quality. They do some decently priced lunch specials, including a 2-roll special with miso soup and salad that'll run you around $9 ($12 with tax and tip). It's satisfying, yet standard fare. Except the salad, which was actually sad, colorless water masquerading as lettuce. I suppose that is somewhat mind-blowing.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-29", "description": "Came here with 5 other people after school for lunch.  When we came in we were welcomed and accommodated very quickly.\n\nThe decor is simple but nice.  Nothing to gordy and over the top.  I think simple is always best anyway \n\nWe ordered our food and was given miso soup and salad.  The food did not take long to come.  I ordered the sushi and sashimi lunch special.  The presentation of the food was lovely.  The taste was decent at best.  It did taste fresh but nothing noteworthy.  I did not care for the sticky rice at all.  \n\nThe service was really nice and when I left I was satisfied even though I didn't love the food.", "author": "Laura C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "Loving my new Brooklyn post-deposition lunch spot!  Only a couple blocks from the courthouse, this is a terrific place.  It's really cute  and intimate (although noticeably slanted), super clean, and really really fast if you don't have a lot of time. Service is rather cold, but efficient and not at all rude. \n\nMost importantly, the cuisine is quite delicious. In particular, I love their salmon sushi, chicken tempura (perfect), and miso soup.  Great value too.\n\n... and now my mouth is watering!", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-08", "description": "This place is really basic. The location is all it has going for its self. Sit by the window and enjoy the view. The food was typical of a sushi place and nothing special about the ambiance or decor.(fresh sliced orange and canned pineapple, smh) \n\nService is quick and they give you free fruit at the end if your meal so I guess that's your silver lining! \n\nP.S. The restroom is clean!  #itsthelittlethings", "author": "Mo D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-04", "description": "Everything is plain there is not much flavor the California roll is blah like no taste; Kano salad was okay and the salad was very dry with only lettuce \u0026 dressing which was thick; pork katsu was really good though the waiter could have been better at explaining it wasn't a bento box.", "author": "Sofia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-07", "description": "So I decided to give this place while I was in a rush and had to grab a quick bite for lunch\n\nFunny store.. I ended up ordering the wrong thing on the menu.. and as most of you foodie's you probably done so at least once in your life. I wanted to order the Nantori Roll and I ended up with the Nanatori House Box.. THE BEST THING I EVER TASTED!!!, It had a bit of everything. Miso Soup, California Rolls, Brown Rice \u0026 Fried Gyoza. I will return to this place.. LOVE IT LOVE IT LOVE IT\n\nOnly negative I had was the employee's could smile more.. didn't have that warm feel!", "author": "Jelani R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "no matter how many times i eat in or get food delivered. This place is always the best!\njust wish it was a bit bigger bc at times it can get crowded.", "author": "Preet K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "I'm a fan! The sushi here isn't anything amazing but the serving sizes are huge and the prices are right. \n\nI came here with the Boyfriend for lunch while he was on jury duty (lucky bastard only had to go one day and he didn't even get called in for anything). We've eaten in the area before but we wanted something cheap and close to the court houses. \n\nNanatori offers a special lunch menu that ranges from ~$8-$12. You can choose from Bento Boxes, Teriyaki Lunch Sets, Sushi Roll Sets (2 rolls or 3 rolls) and Sashimi Sets. Like your typical Japanese restaurant, all sets from with soup and salad. \n\nI opted for the Sashimi Lunch Set, which features 12 pieces of assorted sashimi with a bowl of rice for $12. The fish portions were huge and tasted pretty fresh. I guess the high turnover rate of tables ensures that the fish is used up. The only complaint I had was the hot bowl of rice that I received. I've never eaten sashimi with hot rice before... \n\nWe also got ice cream to share between the two of us. For less than $3, we got two big scoops of ice cream with whipped cream. I've gotten less scoops for more money in other Japanese restaurants so they get an extra star from me because of that!", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "Terrible donburi. i dont know about their suchi, but if ur looking for a warm bowl of rice, this is definitely not the place to go", "author": "Leo Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "The worst service of any Japanese restaurant in the neighborhood. Total assholes screwed up our order and left us standing for two hours without calling us. They use \"Beyond Menu\" as an order service. I have never heard of it. Go to Iron Chef or Ki Sushi or Chance or Kogane if you want good service in Brooklyn Heights. We have ordered huge platters from Nanatori for parties before and they were good enough. Now they totally messed up.  The party is over! Don't order from them if you expect your food to be delivered on time. Another Montague St. restaurant going out of business!", "author": "Ben R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Stopped in while on vacation, service was amazing and the food was awesome, definitely would come back again!!!", "author": "Cristina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Love Nanatori!  We had a large order delivered and everyone thing was amazing and on time.  We ordered the Zen roll, the spider roll, what n roll and tri color roll.  All very tasty, fresh and beautiful.", "author": "Marion M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "One of my favorite Japanese local spots. I've been coming here since my college days at St Francis. It's not super fancy but the staff is super attentive, the restroom is clean and the fish is fresh! Try the \"yama\" roll its delish and my favorite drink here is the \"nanatori dream\" - friday nights at 8pm this place gets packed", "author": "Tameeka B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-28", "description": "Nanatori is one of the best sushi places in the area that consistently delivers a good meal in a speedy fashion.\n\nIt's a popular lunch spot and for good reason. The 3 roll special for under $10 is a steal especially when you consider the how fresh the fish is and that you get fairly large rolls. The spicy tuna in particular is really delicious here. \n\nService here is all about getting the job done in an efficient and speedy manner so while they are not the most hospitable, the service staff do their job well. I had takeout this last time and they got our food to us in the same speedy manner. My friend and I ordered different 3-roll specials which we shared http://www.yelp.com/biz_photos/A_pEWrmdOmOuppwSZOlCBA?select=yckGbpV1ftvzHKv1pE_imQ (variety is king!) and thoroughly enjoyed. The quality wasn't any less than eating in the restaurant and they made an effort to pack everything, including the soup and salad, really nicely. \n\nNanatori is hard to beat for a good sushi lunch for both the price, and the deliciousness that you get.", "author": "Jon L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-07", "description": "Today was my first time trying this restaurant. I am not amazed. I ordered a lunch box which was about 875 and it was very tiny. I was served one piece of broccoli one baby carrot. I ordered a fish teriyaki lunchbox but the fish was drenched in the teriyaki sauce and it tasted very salty. The fish was also very crispy that I was having a hard time cutting, I was served with no knife. My waiter payed no attention to me until another waiter assisted me. I will not return I have other options as far as Japanese that are way better. Nevertheless I still left a small tip. I used the bathroom which was very clean and I left. The miso soup with decent and the salad was very small. This lunchbox is not fulfilling, but the neighborhood is very nice.", "author": "Marie Annick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Amazing food. Love their lunch special! California rolls and their chicken curry are my fav!!!", "author": "Elana G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "I work in the area and ordered lunch from here one day and was a very happy camper.\n\nthey have terrific lunch specials which include 2 sushi rolls, soup, and salad and free delivery.\n\nI tried the philadelphia roll and an eel avocado roll. They were both delicious and fresh.\n\nI will definitely order lunch from here again", "author": "Arielle S."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Nanatori Japanese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2xSAGP58vGI9HexDkC_w3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185225555"}