{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-25", "description": "This is amazing sushi. Never use soy Sauce\nAnd always fresh.  Love the shrimp shoe my\nAnd the sushi is so big and taste", "author": "Alex D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-07", "description": "A little pricey and nothing too special. I had the salmon bento lunch box it was a good size serving. It came with brown rice, california roll ,vegetables(frozen in the bag kind), fried gyoza , a salad and the salmon. The bento box was $10.45\nThere are two pros however 1) they substitute white rice for brown rice and 2) There salmon teriyaki skin was very crispy.\nBut overall very typical , nice place to go on a lunch break but no need to go out of your way to come here.", "author": "Sony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "I work in the neighborhood and often order lunch to go from Nanatori. They have an awesome lunch special. Two rolls for $8.45. The two rolls also comes with a soup AND a salad. It's a great price for a sizable lunch in this neighborhood. The soup is a miso soup that comes in a plastic pint sized container and it's like miso soup from any other sushi restaurant. The salad comes with a ginger dressing. I always order two eel avocado rolls. I love eel and I don't eat raw fish so this is the most logical order choice for me. The rolls are tasty. The orders are made quick. The staff is friendly and will help you with whatever you ask for.\n\nIt's a good lunch choice.", "author": "S C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "I really like this place, the sushi pizza is awesome, I order from here about once a week. They have this awesome thing called sushi pizza (not what it sounds like) it's a fried tortilla, topped with some Japanese guacamole type mix, finished of with spicy tuna. It's freaking Amazing\n\nI also like the sex In the lobby roll (hate the name) its awesome. \n\nStaff are ok once they get to know you, it's pretty basic of a place but I think the sushi is 5 star", "author": "Katie J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-07", "description": "*** \u0026 1/2 stars.\n\nI mainly come here for lunch special. Their bento box is pretty good deal. I don't particularly like their rolls as they are  bland. Sushi and sashimi are OK but not great. Had noodles once and they were not good. Basically, another OK place in the area that caters to the lunch crowd.", "author": "Namik G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-30", "description": "Solid sushi option in my workplace vacinity - check. Fast service - check. Great prices - check. \n\nMy work friend and I were actually on our way to Tenda Sushi a couple weeks ago, but found this place first and decided to give it a try, since the prices and options were comparable and the restaurant was busy but not crowded. We opted for take out - the $8.95 two-roll lunch special - and were literally in and out in time to have a good 20 min of our lunch break left when we returned to the office (mind you we work about a 15 min walk away, in the downtown district). \n\nToday we actually decided to stay and eat, since the service was so fast. It was actually ridiculously fast once we sat down - our server was all business, and was right on top of everything. The only thing that took a bit long was waiting to get the check back after we gave her our cards... but otherwise everything was good and we got back to work only 15 min late *wink* due to our own laziness really lol. \n\nThis is a solid sushi option. I recommend the spicy tuna roll, and definitely get the lunch special if you're here in the afternoon. I'm glad Nanatori is within walking distance from work - it's a nice boring-day treat. :)", "author": "Elishevah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "Last night was my second time going to Nanatori and I was impressed again. The food is great. The servers are friendly and accurate. I had the tofu teriyaki, it was delicious. All around great sushi bar that does not disappoint.", "author": "Courtnay G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-04", "description": "yeah.....NO.\nordered lunch box. i'm still STARVING. 5 little teriyaki shrimp, one scoop of rice, ONE piece of broccoli (not kidding...), ONE baby carrot!\nmystery soup that i didn't eat. doesn't say on menu what it is.\nboring iceberg salad. not even the green part of the lettuce. no garnishing, sucky orange dressing. didn't eat that either.\n\njust threw away the menu. had been keeping it for a while waiting to try this place.\n\n$12 (with delivery tip) for \"lunch\" and still starving? no thanks.", "author": "Marie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-19", "description": "Food is good, but service is awful and it continues to decline...  If you are a vegetarian their vegetarian rolls are delicious!", "author": "Claudia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "I came in on July 4th with 2 other friends.  It was extremely busy after the fireworks, as to be expected.  We were still seated within 10 minutes and served in a timely matter as well.  The food was amazing and again we didn't have to wait long at all!  From the tofu app to the amazing cuts of hamachi sashimi.  Overall I had one of the best sushi dinners that I had ever had the pleasure of enjoying.  The staff was also welcoming and attentive.", "author": "Amber E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-23", "description": "Some of the best sushi I've had around here. Their special rolls are amazing, and the staff is so friendly.", "author": "Garynn N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Favorite sushi place for lunch- their chicken teryaki is also pretty good. It can get crowded during lunch hours so it usually takes about 30 mins for your food to be served. If you go for dinner it is completely empty. The waitresses tend to rush you which is annoying. But I do recommend the food!", "author": "Maria R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-05", "description": "The 2-Star rating description of \"Meh. I've experienced better\" perfectly describes by experience at Nantori. It was a conveniently located sushi spot that we stopped off on our way to a party. The service was good and the decor was ok, but nothing to rave over.\n\nAs far as the actual sushi, I have definitely had better. The shrimp tempura completely fell apart. The Philly tasted weird and not exactly fresh.\n\nIf you could go somewhere else, do so. If you're in the area, you should probably go somewhere else, unless you're really REALLY craving sushi. Otherwise, I say you're better off skipping this place.", "author": "Pavel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "This is my favorite sushi restaurant to eat at, must try's are the miso soup, beef nagamoci, fried tempura ice cream, and the eel rows. Prices are decent, and it's only a few blocks away from the promenade where you can sit, feel the breeze, see the Brooklyn bridge and watch boats, you can even see the Statue of Liberty.", "author": "Skye R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "I love sushi and Japanese food!  Nanatori gives me the fix I need sometimes.  There is a really HAPPY server there that makes smile on sight...He is just so happy!  Yes he screws up my order sometimes but his charisma makes up for it.\n\nI haven't had a roll here that I didnt love.  The beef Negamaki is bangin'!  The miso soup is never as hot as I would like, but 2 out of 3 aint bad....and that happy server of theirs will keep me coming back.", "author": "sarah e."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "My favorite roll here is the Montague roll.  Service is prompt and friendly. My first time ordering food I was   hungry and in a rush. Owen recognized this and was quick to help.", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "Whether you have it delivered or sit in, the sushi is amongst the freshest you'll find in Brooklyn if you don't want to dent your bank account.  My friends and I dine here frequently, and we never regret it.  Their lunch special price is a couple of dollars cheaper than other Japanese establishments in the area, but the quality and decor are excellent.  My only gripe is that some of their staff can be quite sassy, yet it always makes me chuckle.  Visit! You won't regret it!", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-15", "description": "This review is based on a seamless order. I'll give them 1/2 a star for food and 1/2 a star for punctuality. The delivery guy was super rude! My fiancé gave him a $3 tip and the guy flipped put and cursed at my fiancé.  I'm sorry, didn't know he was a douche, I would've given him $0. Never ordering from here again.", "author": "Stellie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-18", "description": "Below average sushi. Even the eel sauce was bad (overwhelmingly sweet). If you're in the neighborhood, go to Ani Sushi on the same block, much better quality sushi.", "author": "Cristina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-24", "description": "This place has good prices for an easy take-out monday night dinner.  I live around the block and by the time I walk to the place, my order is ready and delicious.  I'm a vegetarian, and they have a few veg. rolls-- and they are all great.   Especially the sweet potato roll.  It's served warm with this delicious sauce drizzled on them.  \n\nFor the moment, this is where I go when I want sushi in BK heights.", "author": "Johnny A."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Nanatori Japanese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2xSAGP58vGI9HexDkC_w3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185225555"}