{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "Lunch roll special was good quality. I would go again if I found myself in the neighborhood.", "author": "Nick L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-29", "description": "Been here a few times and everything was tasty and  fresh. However I have to update my review as last night we ordered and had a speciality roll ( the Eiffel Tower Roll), the spicy King crab inside was quite fishy (Old!)  tasting, really disappointing and ruined the whole roll, and definitely affected my overall opinion of the place.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-03", "description": "This place is a well oiled machine.  Service is fast and thorough.  The atmosphere is busy and the food is decent!", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "Good neighborhood sushi place, great for a quick lunch on Montague or delivery. The rolls are fresh, the service with a smile and everything delicious and satisfying. My only piece of advice: if you are taking out food at lunchtime, call ahead. It's chaos at lunchtime.", "author": "Shira R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "Great little place on Montague St. to get a quick sushi fix. I love the ambiance and the service is excellent. I've never had a bad experience here. The servers are very attentive and are always available when you need them. One thing I did notice was the playlist of 90's pop songs(backstreet boys, nsync etc)which is funny. Overall great place. Love their shrimp gyoza, shrimp tempura roll and green tea ice cream. Definitely would recommend!", "author": "Karma C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "This place used to be my favorite sushi restaurant a few years ago until its management changed. Now it is just a conveniently located OK sushi place.", "author": "Gelena R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "My friend and i stopped in here, our first sushi stop since moving into the area. Our waitress was extremely sweet and helpful. \n\nThe sushi was very good and FRESH. When ordering from the sushi rolls you get 6 good sized rolls, presented nicely altogether. If you order a specialty roll, you only get one (which I found fairly over-priced, as in other good sushi places you got at least 2), so for example I ordered Unagi, there was one roll for $3-$4 which is a bit much to me. Otherwise the food is really good, just a bit over-priced for the portion depending on what you order.\n\nMy friend loved the Tempura Cheesecake for dessert, which for around $5 gave 2 portions. Looked great \u0026 clean.", "author": "Amie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "Generally the food is very good. The one noticeable issue is that the sushi is sometimes not that good if you go early. Other than that it is a great restaurant with really nice employees.", "author": "Harry M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-11", "description": "I come here occasionally for their lunch specials. On the last  visit, I was disappointed by the customer service. After I ordered, they asked me to sit down and wait for my order to be completed. I waited...and waited. Finally I stood up with the *what is going on?* face and they brought over my food alway bagged and sitting on the counter. Other than that, the food is always fresh and tasty.", "author": "Maria T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-25", "description": "Nanatori is a good sushi spot.  The service at the restaurant is good and the delivery service is super-quick.  This is not the best sushi I have ever had, but it is good and worth going to if you are in the neighborhood.\n\nThe menu is solid with your usual options and some nice special rolls.  The single pieces of sushi are small and the rice is possibly made by the rice-ball machine sometimes, but the fish is always fresh and well proportioned to the rice.\n\nThe rolls are generous and the prices are very reasonable at Nanatori.  The sushi deluxe (9 pieces and a spicy tuna roll) is about $17 and is a lot of food and comes with a soup or salad option.\n\nAs far as ambience goes, it is not the most attractive or trendy sushi spot, but it does the trick.  There is one table in the window that looks out onto Montague street so you can people watch while your food is being prepared.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-11", "description": "It's safe to say I qualify as a regular here.  \n\nGreat sushi...the Red Dragon Roll is a must try.\n\nGreat service.\n\nClean and comfortable.", "author": "Analia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-13", "description": "Good deals for lunch. Where in manhattan can you get $9.95 3 rolls of sushi (your choice) or other bento box combos for similar dollars? \n\nReasonable is a great way to describe it. If you work in Brooklyn, and/or you love Montague street, it's a great place. Clearly the best Japanese in brooklyn heights.\n\nOverall small digs. Has regular decor fitting a Japanese restaurant. I don't venture off the menu though, because the one time I did, I had a Udon soup noodle. Though piping hot with properly blanched vegetables, the dish had that broth just did not make me want to continue eating.", "author": "Brian P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-15", "description": "so we stopped by this restaurant because my friend was craving japanese curry. ... ok, DON'T order that if you are looking for the Japanese apple-sweetness type curry. their curry was more indian style on the spicy side. \nI had pork katsu don and that was a bit too sweet for my taste. it really just not authentic Japanese food. \nmaybe their rolls are better and we just missed out cuz we didn't order any of those. However, i appreciate the choice of brown rice or white rice.", "author": "Ai L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-22", "description": "To be honest I am really surprised by the great reviews this place gets on yelp.  The sushi was pretty mediocre.  The oshinko was the not good and drenched in food coloring as was the ginger.  Both our shumai and oshinko had maraschino cherries with them which was bizarre. I don't know much about sake, but I drink it often, and the house sake here definitely smelled really weird in a bad way... \n\nAll that said, I did finish all my food, and the sake (no surprise there), so I suppose I can't complain TOO much, but this was the worst sushi I've had in a while.", "author": "Nat J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-20", "description": "I know everyone is raving about their lunch, which I agree is pretty off the charts. But I'm here to say that their dinner ain't half bad either. It always surprises me that this place is emptier than a strip club at 3:30pm during prime time dinner hours. But all the more room for me, I guess. \n\nLet's start with their Kani Su appetizer. It's crab meat with vinegar, served with cucumbers and heaping serving of wasabi that will make you cough for days. Consider your sinuses cleared. The crab meat is delicious. \n\nThey also have very fresh sashimi, although, I'm not very crazy about their Ikura (unfortunate, because that's usually my staple sushi/sashimi order). Nothing really compares to real Russian red caviar. But as far as the rest goes, get the Salmon and try some Mackerel. \n\nAlso, the sake isn't very expensive so do get drunk.", "author": "Olga B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-20", "description": "This is a great place to go. First is open on Sundays, when many other sushi places do not open in this area. When you get in they serve you fast. They greet you with a sampler of a plate, which tasted extremely good. \n\nI ordered some gyozas that were really good. My Sushi sashimi plater was assorted and very well presented. It was great, and instead of coming with a California roll as usual it came with their spicy tuna roll, which is great. \n\nPrice wise this place is standard for any sushi place. \n\nI totally recommend to check this place out.", "author": "Marcos R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "This place was really a surprise!  For some reason I've always gone down to Leechy Nut and never gone upstairs to try Nanatori.  \n\nThe atmosphere is clean and friendly.  The staff was very helpful and filled my water class at least 5 times (don't judge... it's CRAZY hot in NYC in July!).  \n\nI got the lunch special ($7.95) spicy chicken teriyaki with salad, brown rice, veggies, and miso soup.  The sauce was fresh and delicious, not too sweet ... not too spicy.  But even better, the chicken was chunks of white meat (my guess, chicken breast).  While it was a tad dry, I was happy to see real quality meat.  \n\nI'm not a big fan of sushi, but my colleague said it was great.  And the curry chicken was also very good, but a bit too runny.  \n\nAll in all, this is definitely the best Japanese food I've had in Brooklyn Heights.  \n\nExpect to pay about $12.00 with tax and tip for lunch.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-17", "description": "Got the lunch special box with soup, gyoza and salmon teriyaki. Everything here seems fried, including gyoza (which I'm prety sure are supposed to be steamed). Everything was fine, the staff was friendly, and the price was right, but I won't be coming back.", "author": "Sam F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-16", "description": "Generally, I am a big fan of the sushi lunch specials I can find in Brooklyn.  Mura, Toro, Hana, all delicious.  So when I saw high scores for Nanatori, I was eager to try it.  My mistake.  My chirashi lunch special was mediocre at best.  The so-called \"fresh\" fish I've seen mentioned in reviews was bland, all the pieces tasted the same.  And tuna was a shade of transparent brown-maroon that I've never seen before.  On top of that, my soup arrived lukewarm, and the salad was so freezer-burned from being overly refrigerated, I couldn't touch it.  Never again.", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-28", "description": "My friend and I were really hungry after doing some serious consignment shopping.\n\nPlace hit the spot for cheap (hence the 4th star). The had some strong wasabi, which was awesome! The Spicy tuna rolls and tempura roll were good, but just good.\n\nThe miso soup was a generic one.\n\nAlong with the price the seaweed salad was out of this world. \n\nThe beer was expensive for a bottle $6....really?", "author": "Harri S."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Nanatori Japanese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2xSAGP58vGI9HexDkC_w3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185225555"}