{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-11", "description": "This is a great neighborhood sushi place. I love sitting in front by the windows, having the deluxe sushi entree and a glass of wine. \nThe miso soup isn't my favorite (teeny-tiny bits of tofu) but the sushi is good for the price point and the pinot grigio isn't too bad either. \nI haven't tried any of the rolls yet,  but there's a rather extensive and creative list.\nIf you're in the neighborhood and craving sushi, Nanatori is a good bet and priced slightly more competitively than other places nearby.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-16", "description": "Japanese cuisine run by Chinese chefs and staff.\n\nWhy does that matter?\n\nI lived in Japan and had curry almost every day, so I know Japanese curry.  The Japanese use curry beautifully; it's a part of their culture, just as much as curry is a part of Indian and Thai culture.  The Japanese have made curry their own and perfected it.  One of the best curry dishes you'll find in just about any restaurant in Tokyo is curry with tonkatsu (or some kind of katsu).\n\nI sit down and see tonkatsu on the menu.  I also see curry on the menu.  So I ask the waiter for curry and tonkatsu.  He gives me a \"Huh??\" and I look up.  That's when I noticed he's not Japanese.  In my experience, Japanese cuisine cooked by non-Japanese people tends to suck, but I'm pressed for time and just order \"curry and beef\".\n\nIt was very poor.  It had a Szechuan type heat (Japanese curry does not have this kind of heat) but to make matters worse, it wasn't very flavorful.  It didn't taste like much of anything.\n\nHonestly?  Go to an Asian market store and buy yourself an imported box of Japanese curry, like this:\n\nhttps://1.bp.blogspot.com/-ITsZTUt_6bg/Wp6w2btUX4I/AAAAAAAAJwQ/aGAtDyIDTfgN2zSgY3k6HnBZRx_ZLHDhwCLcBGAs/s1600/6tag_110218-151922.jpg\n\nThis is authentic Japanese curry.  You'll be much happier with it.\n\nThat said, the service is fast and friendly here.  Perhaps the sushi and other dishes are better; all I had is the curry.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-20", "description": "MY GO TO SUSHI! \n\nService +\nPrice +\nQuality +\nTiming +\nTake out +\nDelivery +\n\nThe only reason I gave them a 4 star is that I had 1 poor experience there where it was sour rice and it gave me a belly ache. I love the rolls and the sashimi. They have great portion size from other places that I eat the Salmon don.", "author": "Evan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "I've been in the neighborhood for 11 years now and Nanatori has been there just as long as I have! So, we've become good old friends over the years. There aren't a lot of sushi options in the Downtown Brooklyn/Fort Greene area. Cumulatively, there's about 6 and Nanatori is superior to all of them. \n\nI usually get delivery, and on occasion eat in. Until 4PM, they've got a lunch special with 2 rolls for $9 and 3 for $12, which comes with soup + salad. I love the eel \u0026 avocado, Philadelphia, and spicy tuna rolls. As some other reviews have mentioned, they do pack on more rice than product, but I've found that to be the case whenever you get the lunch special at any sushi spot. Still, the rolls are fresh and filling!\n\nThe restaurant itself is cute and cozy. It can sit maybe a max of 40 guests. Whenever I've dined in, service staff is attentive and friendly, and constantly refills water glasses. Once, I placed an order for pick up but something came up so I couldn't come to pick it up until 4 hours later. They made me a whole new fresh batch of sushi instead of handing me what I ordered 4 hours earlier. I really appreciated that they went above and beyond!", "author": "Ruby S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-06", "description": "Came here on Wensday at 12pm and got the 2 roll lunch special which comes with a soup and a salad. I also got a green tea. They have really great green tea and miso soup. The sushi is definitely lacking. The spicy tuna was a vibrant pink color and didnt look natural or appetizing at all. The salmon roll was pretty much all rice and lacked flavor. The seats were so close together. Would not go back.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "I order sushi \u0026 sashimi and shrimp, vegetable tempura. It's soooooo yummy! And the price is friendly, worth to visit again and again", "author": "Isabelle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-27", "description": "Host was very friendly, the veggies that came with the steak teriyaki was cold. I didn't like the lettuce in the salmon tempora sushi  but overall good.", "author": "Sandreshia J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "I went fairly basic and ordered an eel and avocado roll and spicy tuna. \n\nBoth were good and left me happy. It's not mind blowing but I was content. \n\nMy friend also ordered the chicken skewers with veggies and it was good.", "author": "Valerie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "This spot is well known amongst the locals. They've been here for a while and I see why. The sushi was delicious and the soup great! I was such a large portion. I enjoyed the dimly lit ambiance and at night there's parking available. Recommended if looking for sushi in Brooklyn and the soup was not overly salty.", "author": "Tanisha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "A neighborhood staple for fresh and super fast delicious sushi rolls!  They have a great lunch special for rolls, so definitely check that out if you're hungry for sushi and a great deal.  Ordering online is fast and easy.  Orders and pick-ups have always been a breeze - friendly, fast, fresh \u0026 delicious!", "author": "Sara S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-03", "description": "I stopped in for a couple quick sushi rolls and they were very mediocre. The tuna roll was truly the blandest tuna roll I've eaten in recent memory. Sad because the place is cozy and the service is really friendly and attentive! Maybe their cooked dishes are better, though I doubt I'll be back again.", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-24", "description": "One of my favorite Japanese restaurants in Brooklyn Heights. Can't go wrong with the shrimp shumai, popcorn shrimp, and age tofu for appetizers and Alaskan roll afterwards. Went on a Saturday evening around 5pm and it wasn't that busy.", "author": "Alina J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "The best sushi spot in NYC is in Brooklyn. All the special rolls deserves 5 stars.", "author": "Andrea S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-10", "description": "I've eaten here a handful of times.\nSolid, average and seemingly fresh would be the words used to describe it.\n\nThey have lunch specials until about 4 pm. Two roll special (not chef's style) including miso soup and salad runs at $9.50. There's also a 3 roll special for a few bucks more.\n\nI enjoyed the salmon skin salad---a first for me. At $7.95, it was a good sized portion with a lot of good flavors going on. I also happen to like the crispness of salmon skin, Japanese style.\n\nIn other words, when on Montague Street and craving Japanese, Nanatori is a pretty good choice that will at least satisfy you.\nNot wow factor or super memorable, but good enough.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Was greeted by friendly staff...seated and orders were taken right away.\nOrdered soup and spring rolls for starters. \nI had the salmon teriyaki and hub had shrimp teriyaki wth brown rice and veggies Food was great! Everything was tasty and they were very attentive...checking periodically..,refilling glasses and making sure all is good. I will definitely return again. \nNot expensive ,quick service , and tasty food !", "author": "Demora F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-08", "description": "Came here for lunch today and really enjoyed it. I had the roll lunch special and thought the salmon spicy roll was really good. The shrimp tempura was good also but nothing extraordinary. Overall, very good price for the food.", "author": "Leslie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-20", "description": "I was not in this restaurant for 8 years and have to admit,that this place is not as good as before,service is sucks,food is much worse than before.", "author": "Alex Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-25", "description": "I really wanted to like this place, have given it 2 goes since moving to the area. Approx 2 months ago, had the sashimi, went it came out, all the fish was dry. Went last week, ordered the shrimp rolls. They were pathetic, the tiniest piece of shrimp, then padded out with iceberg lettuce, a smidge of avocado, and rice. Utterly tasteless. I can't believe they feel ok about sending that out to a table", "author": "Nik W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-10", "description": "Great food for the price.  $9 lunch special gets your two rolls, soup, and salad.  The rolls are big and the salad dressing was tasty.  I work in lower Manhattan and this place is one subway stop downtown into Brooklyn Heights.  The restaurant was packed for lunch and the staff was kind and courteous.", "author": "Jillian S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-05", "description": "There aren't many sushi places around this area, so it gets pretty busy by lunch time. I can't believe I've been to this place this many times. The food is not very good. The rolls are 60% rice and not much other ingredients. The miso soup is watery and the salad has like 2 drops of dressing. At least the food is fresh. Decor is not bad. Service is standard.", "author": "Alicia C."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Nanatori Japanese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2xSAGP58vGI9HexDkC_w3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185225555"}