{"aggregateRating": {"reviewCount": 60, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "The churro ice cream sandwiches are out of this world. The best thing I had all day at smorgasbord. The warm deliciousness of the churro with the cinnamon and sugar go together perfectly with the coolness of the ice cream. Definitely a must have dessert.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-29", "description": "I was so excited to try this after watching a video from facebook and seeing it at Smorgasburg. Since most vendors were cash only, I had to be super selective and decided this one was a must try. I ordered the peanut butter and roasted banana ice cream churro sandwich. The churros were not warm and crunchy. The amount of ice cream was minimal and just tasted like vanilla.", "author": "Canny F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-03", "description": "Great tasting churros fried fresh when you order them.  We tried the tuff churros with passion fruit.  The filling was good but too bad it was too watery and it all fell out.  We also got churros with chocolate dip.  That was good and we enjoyed it.  The churros were crispy and not greasy at all.  For 19.00 it was expensive but it's the city so I understand.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-04", "description": "We tried their churros at Smorgasburg in Prospect Park. The churros were sweet and crispy, but I wished they were served hotter and with chocolate sauce instead of nutella which has high viscosity. One of my favorite parts of eating churros is dipping the hot churro into a chocolate or caramel sauce and trying to eat it before the sauce drips.", "author": "Joseph T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "The churros were fresh, crunchy and delicious. Decent priced at $6 for five. The Nutella wasn't real though, or it had been watered down.", "author": "Tara R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-31", "description": "Don't waste your money!\n\nSo I went to the Dekalb Market Hall with some colleagues and ordered a dulce de leche churro. It took forever and then I realized each order has 3 churros per order. As the guy is filling the first churro, I asked if one of them could be filled with s'mores. I asked the guy and the other gentleman who took my order also told him what I requested. As i saw him pick up the 3rd churro, i started shaking my head and saying, \"no, don't fill it.\" The guy visibly shook his head and started filling the last churro with dulce de leche even though it would have been easy for him to pick up the s'mores bag to fill the last churro. The gentleman who took my order even looked dejected at the rudeness. The guy then hands the churros to me so I asked him to please wrap it up because I was going outside with it. He puts the churros on the table and a female employee had to wrap them up in a box for me. If I wasn't with my co-workers, I would have asked for my money back out of principle. He was extremely rude and unaccommodating even though it would have been no inconvenience to him. Even my coworkers said he was rude and messed up for continuing to fill the last churro even after his own coworker and I asked for a different flavor. As for the churros: they were ok, nothing special. They were way too small for $7. Never going back there!", "author": "Celina F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-18", "description": "I went to their Union Square location last week. Let me start off this review by saying the churros ARE good. I got the churros rellenos with nutella. The low star review are for two reasons. First reason being I paid over $7 and all I got were three mini little tiny churros. I had never visited this business prior to this trip so I didn't know that they would have been so tiny. Very disappointing because it would have been more worth it if it came with at least 4 for $7 especially for the size. They're not even full sized churros. Second reason being I ordered nutella and waited as they made it...except they gave me caramel instead. By this point, it had to have been at least 5 min and it was freezing weather. I told them I had actually ordered nutella so then they said oh and they'll re make it. Fast forward another 5-6 minutes later, I got my nutella churros rellenos.. I was frozen by this point and sensible business etiquette for this mishap would have been to at least give me one more mini churro or something to make up for the wait and also giving me the wrong order...", "author": "Samantha W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "So I decided to treat my daughter to the food market inside of Albee Square Mall today. And I came across Dulcinea!!!! I purchased 3 Churros filled with Nutella,  Smores and Dulche De Leche...yummy yummy yummy...The 3 we purchased never made it home and so we ended up getting 6 more that actually made it home... Can't wait to go back!", "author": "Deidre D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-13", "description": "I went to the Dekalb Market Hall location and the cashier argued with another worker because she'd rather me cancel my order than get salted caramel sauce.\n\nI asked the cashier if they made smaller orders and she said NO! I asked what sauce the churro came with and she said chocolate. I guess it's my fault that I do not eat chocolate. After purchasing I decided that I couldn't eat churros with a sauce that I wasn't able to eat. I asked her if there was time to cancel the churros order. The woman cooking inquired about why I wanted to cancel the order. I explained that I didn't want the chocolate sauce but wanted the caramel instead.\n\nTHIS CASHIER ARGUED FOR 3-5 MINUTES OVER $1 BECAUSE THE OTHER WOMAN WAS WILLING TO GIVE IT TO ME. DUE TO MY ANGER I THREW FOUR QUARTERS ON THE COUNTER. \n(I didn't want the woman getting in trouble for being willing to help me out). I watched as  people left the line because of her hold up over getting a different sauce. NEVER AGAIN!", "author": "Laure D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-25", "description": "Visit them at the Soho Smorgasburg. The line was very long and it is not because the food is good, it is because there is only one girl behind the counter and she is extremely slow. She takes five people orders and then make them wait for the order as if she is in Starbucks except there is no barista and she then stop at the sixth person and then go help the first five customers. All of the churros were stale and not fresh whatsoever. It is like eating garbage, they need to add more help or stop selling these cardboards to people.", "author": "Evans E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "Great warm freshly made Churros and chocolate in Columbus Circle holiday market! $6 for 5 Churros and they have $2 water bottles. They also have tables nearby to enjoy!", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "Terrible. I went to the Broadway Bites location and they double charged me for an item. Tried to convince me otherwise. Gave us the wrong donut, which was boxed but thankfully we noticed because we had to wait so long for our churros. Then while waiting to ask for the correct donut they told us they were no longer making churros. This was at 3pm so not sure how they ran out of churros. \n\nThe apple/dulce donut was just really dry bread and tasted stale. This place is a joke and I honestly feel like they intentionally double charged. If you're popping by Broadway bites watch them.", "author": "Allie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Those stuffed churros were so good!!  Well worth the $7 !! could only imagine how much they pay in rent there", "author": "Tyler D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "The dulce de leche churros are delicicious!! The dulce de leche is thick and creamy and the churros are perfectly crunchy.", "author": "Deniece M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-17", "description": "After visiting Colombus market and being cold, what's better than some chocolate and churros, therefore, we decided to give this place a try. Three dulce de leche stuffed churros were $7.50, and the hot chocolate about $6. The churros were good and freshly made. However, the Spanish hot chocolate killed the experience. It tasted like straight pure melted chocolate, watered down a bit. It didn't have that milk regular hot chocolate taste. I had two sips and threw the cup in the nearest trash can. It was so ew to my stomach.", "author": "Rosio G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-16", "description": "Total rip off. Enticed to try their churro ice cream sandwich by their photos. Don't bother. The smallest churro ever with the tiniest scoop of ice cream for $7. Sure the churro was good but the ice cream was awful. I could taste and see chunks of ice in it. Totally not worth buying.", "author": "Prima Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-19", "description": "I love churros but I was disappointed by the very  overpriced Dulcinea churros. They charge you $7.75 for 3 small churros that had almost no filling inside. I went back to show the girl that my churros were mostly empty and after rilling her eyes she  gave me a little Dulce de Leche in a cup... I gave her back the churros and I asked for my money back... NEVER, EVER again", "author": "T P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "The churros are the best!! Soft inside and crunchy outside and different flavors... Dulce de leche the best. There are many options there but I absolutely recommend the  empanada... Delicious!!", "author": "Pati S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-27", "description": "Overpriced, but good quality desserts.  We were in NYC and found ourselves in Bryant Park on Christmas day.  We decided to go against our better judgment and join the slow moving line to get some churros and hot chocolate, and I'm so glad I did.  We ordered the hot chocolate and churros rellenos stuffed with dulce de leche.  2 hot chocolates and three stuffed churros was a whopping $19, but as an occasional indulgence, its so worth it.  The line was unbearably slow, but that may be because they make the churros to order.  The hot chocolate is not piping hot, but its delicious and so decadent.  It tastes like melted dark chocolate, and its not overly sweet.  The churros though...they were so good!! We got them stuffed with dulce de leche.  The churros were not greasy and had a lightness and crispness to them, which paired well with the decadent dulce de leche.  They are not sprinkled with cinnamon, which I think is fine, but keep that in mine if you have an expectation of what churros should taste like. Overall, Id recommend, and its worth the long wait and exorbitant prices.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "A real disappointment... A Luke warm(at best) churro with no cinnamon and a rude woman behind the counter.", "author": "Chrissy O."}], "servesCuisine": "Spanish", "priceRange": "Under $10", "name": "Dulcinea Churros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W Brooklyn Ny 11201", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/whRZiFEbHL2QZs7_-UoZ5A/ls.jpg", "@type": "Restaurant", "telephone": "+17186224050"}