{"aggregateRating": {"reviewCount": 60, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "This is a review for their churro ice cream sandwich. Note: It was not available at this location when I went; it was only available at their stand at Smorgasburg in Prospect Park.\nThis ice cream sandwich is to die for. The churros give it a perfect crunch and chew, and it's balanced perfectly by the vegan ice cream in the middle. It's a bit pricey ($9 if I recall correctly), but I would get another one in a heartbeat.", "author": "Nate C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Wow best Churros I've had in Manhattan. Tried Dulcinea NYC at The Bryant Park Holiday Shops. The prices are decent and I was so satisfied after finishing my little snack. I ordered the Nutella Churros and what a beautiful flavor experience in my mouth! The churros are pipping hot, freshly made, covered in sugar and served with your choice of dipping sauce. A perfect snack to share or go ahead and be selfish...you earned it lol!! I definitely recommend everyone tries these perfect churros. I also ordered the Spanish Hot Chocolate which was absolutely perfect. I have never tried Spanish Hot Chocolate so I wasn't sure what to expect. The cup was hot, not an overly chocolate flavor but it honestly hit the the spot and kept me warm during a freezing cold day in December in Manhattan! I will definitely seek this place out next time I'm in Manhattan because the churros were just that good!!", "author": "Shannon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "[DEKALB MARKET HALL]\nI was seduced. I never stood a chance. I'd never had churros before tonight and I guess that makes me a \"churr-gin\".  But when they brought this hot sugar dusted stack of sticks with molten hot Spanish chocolate sauce... Perfect crispiness and amazing simple flavor. ...I was done. Are you kidding with this. Oh...yes... I will sin again. And mind you I didn't touch a simple pudding filled item behind the glass...  my diabetes is acting up.", "author": "Reshard R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "Delicious! The churros were perfect - not dried out or undercooked, coated in exactly the right amount of sugar and cinnamon. And wow, that cider... Yum! Perfect treat at the end of Thanksgiving day.", "author": "Ruthanne R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-06", "description": "Pretty awful spot.  I tried the chicken empanada and the regular churros.  Both were stale and barely warm.  Just terrible.  Safe your mouth and your money.", "author": "Andrew F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-01", "description": "I stopped here to pick up dessert to bring to a friend's house and ordered an stuffed churros with dulce de leche and another order of churros stuffed with Nutella. I later learned they had completely screwed up my order and didn't give me the flavors I had ordered. This place is disorganized and honestly not at all worth the money...you can probably find better quality churros somewhere else where they will actually get your order right!", "author": "Natalie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-10", "description": "I came across Dulcinea Churros while shopping at Trader Joe's. I was looking for some dessert and came across their fill-in churros. The lady wasn't super helpful in answering questions about them, but I proceeded to order them anyway. I got the regular cream (forgot actual name) and the dulce de leche. Both were mediocre at best. The filling was too sweet for my liking.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Two word: unicorn churro!!!! I don't care how macho you think you are; you need this in your life ASAP. It's amazing. Great service and service and other tasty treat abound, defiantly one of the best sweet spots in the market. But seriously, get down with that unicorn churro, dawg.", "author": "Charles A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "Picture this, you're in the city walking towards the Bank of America winter markets in Bryant Park and all of a sudden you realize you can't move your fingers or your toes. They've become numb with walking from the sheer cold breeze that hits your face the way cold waves splash into and disappear at the coastline. You peruse through all of the viable food options and after grabbing a quick bite to eat, your heart and body are still not satisfied, still requires more warmth. One of my friends suggested churros. You could smell the churros and the hot chocolate around and we all agreed that was a power move. My friend ended up ordering the churros and the hot chocolate and it came with  5 churros with $6. These warm churros were enjoyable on a freezing day like that day. Dipping it into hot chocolate was a good move and reminded me of the visit to Spain, rich, warming your body from the inside out. The experience at Dulcinea was pretty dulce, I wouldn't mind coming back again, the churros were airy and delightful, weren't that greasy or sugary but just nice. I recommend this place for sweet tooth and even if you don't have one, I'm sure you'll enjoy this place. I'm down to try some of their churros rellenos. Next time, next time. Anyways, I look forward to eating here more in the future.", "author": "Raphael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "I had these churros at smorgasburg in Williamsburg. These are the best churros I have ever eaten. I've never had such a crispy churro before. All the churros I've had were always crispy on the outside with a soft doughy center but these were crispy throughout. The dolce de leche dipping sauce made it just that much better. You guys need to open a store up. I will be there on your opening day.", "author": "Kenny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Their churros are really good! My friend and I shared their churro sundae. It was really just a sundae with churros in it. It was definitely not aesthetically pleasing because it just looked like a sundae with fingers coming out but nonetheless, it tasted really good.", "author": "Axl-Rose A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "Dulcinea in NYC is in my opinion better than Churro Borough in LA. Dulcinea churros are smoking hot and has that sugared top that is very authentic, light and fluffy. In comparison to Churro Borough churros sandwich which were served on flatter, and for lack of better words drink coaster shaped churros. The Churros Rellenos are churros stuffed with: dulce de leche, peanut butter or nutella. The serving size is 3, so I suggest trying one of each. Only advice is to sample the four ice creams served with the Churro sandwich, because two flavors did have a freezer burn taste to it, but the staff at Dulcinea will replace your ice cream", "author": "Shelaine S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "It's the holiday season which means winter markets are all over nyc! We went to check out Union Square market a couple weeks ago and came across these stuffed churros. They were HEAVEN. My husband and I shared one, and immediately got back in line for another. \n\nLast night we ventured off to Bryant Park to wander their holiday shops and saw the churro stand. We were so excited and hopped in line. We waited about ten minutes but didn't mind one bit. It was cold and decided while ordering to get hot chocolate. One for us, and one for our friends.\n\nThe \"hot\" chocolate was luke warm at best and in a small paper cup. A few minutes after eating, my husband told me he paid 24$ total for 4 churros and 2 hot chocolates. The churros were 3 for 7.50 and 2.50 for the extra. That's 10$ for the churros. Which meant we must have spent 14$ on TWO hot chocolates. I was in disbelief and ran over to double check. There was no price for the HC so I asked and sure enough, that small cup of luke warm hot coco was 6.50$. I was so bothered by this. If there wasn't only one person working and a massive line, I would have asked for a refund. \n\nDulcinea Churros, if you're going to charge me 6.50 for a cup of hot coco, put the price on the board like the rest of your items, and for heaven sake, serve it hot.", "author": "Whitney P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-04", "description": "Loved the churro ice cream sandwich (Blueberry Crème Fraîche) action although thought having Nutella slathered on the churros were a bit much on the sugar (and I'm a big sweet tooth person, I asked for the ones that had the least amount of Nutella...)! I also ate them separately which they were really good on their own too! Hoping to try the Unicorn Ice Cream one next!", "author": "Kelly K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "This spot is inside the Dekalb Market Hall downtown Brooklyn. It's a small booth that cranks out some very tasty churros. My GF and I stumbled upon this place on one of our random outings. My GF order the salted Carmel ice cream churro sandwich which included Nutella. The flavor of ice cream wasn't that great but the churro was amazingly crispy and sweet on the outside and soft on the inside. Maybe with a different flavored ice cream I would have enjoyed it more. We also order traditional churros with warm chocolate dipping sauce. I'm not a huge chocolate fan so I could have done without it but again, THE CHURRO was awesome!", "author": "Dominic A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Best place for churros and desserts... my favorite place to go as long as I'm in the area the churros rellenos and the berlinas are and will always be my favorite thing in the entire world. I love Dulcinea", "author": "Mariana G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "Good service and pretty good churros. 5 churros for $6 is a good price and they give you the chocolate dipping sauce, however it was kinda more of a liquid form that how it usually is.", "author": "Annie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "It's a shame that employees of this establishment are very shady and added a $1 tip without my acknowledgment and authorization. I purchased a carrot cake and a donut and went to Trader Joe's to shop for groceries. I realized after going through my receipt that there was a $1 charge that I most certainly did not authorize. I don't think the cashier did anything special to warrant a $1 tip without my knowledge. I realized that I did not sign a signature for the transaction and When I went to confront them, the female Hispanic cashier who was not the person who served me wasn't helpful and honestly could care less. She seemed to just brush it off and said \"I can't help you.\" A Spanish man who I assume does the food prepping because he was wearing a white uniform was the person manning the cashier at the time of purchase who decided to add a tip to himself. This is honestly unacceptable and I am unable to trust this business. I will never visit this establishment and will learn to always check my receipts. \n\nSTAY AWAY FROM THIS SHADY ESTABLISHMENT!!", "author": "Laura C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Their Churros with Dulce de leche filling is Amazing!!!!!! So bomb! Very nice crew too. I spoked to Sherley she saw my excitement n recommended the churros with filling. The best", "author": "Razel R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-14", "description": "I ordered from this place at the Bryant Park Holiday Market and waited almost 25 minutes in the freezing cold for an order of churros! The churros were amazing! But the level of service and how slow they are was not good. There were about 14 orders ahead of me. Everyone around me was upset \u0026 didn't think it would take almost half an hour to get an order of churros.", "author": "Jamie C."}], "servesCuisine": "Spanish", "priceRange": "Under $10", "name": "Dulcinea Churros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W Brooklyn Ny 11201", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/whRZiFEbHL2QZs7_-UoZ5A/ls.jpg", "@type": "Restaurant", "telephone": "+17186224050"}