{"aggregateRating": {"reviewCount": 60, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "Over the past year, my favorite dessert has become churros! After going to Mexico last year, I developed a love for the sweet and saw a stand while in Dekalb Market Mall.\n\nI saw there were a variety of stuffed churro flavors and I know, based on my past experiences with sauces, what to choose. I ended up with a Creme Brûlée, Dulce De Leche, and Peanut Butter. The best one was the Dulce De Leche (a classic) and the Creme Brûlée was very good. Not a fan of the Peanut Butter Flavor. They had Nutella as another flavor too.", "author": "Armand R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-01", "description": "So I came back some time later to ask for a replacement cinnabon of the dry one I had weeks ago. First I said awhile then I corrected myself stating \"actually 2 weeks ago\" and showed a picture of my purchase. Mr. Joseph balked at the time frame. Stated he needed to check with Diana the manager and came back minutes later shaking his head and a look of \"quite obviously\". \n\nHe stated no, too long ago. Then I asked \"well, when would be ok?\" \n\nHe stated \"the same day\". Well, I didn't eat it there and reside in a different borough but just happened to be here again. And have the Big Cahones to ask an establishment to fix what went wrong 2 weeks ago. No they can't. \n\nIt was worth a shot to know who stands behind their product and faith in customer service.", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-06", "description": "Have you walked by and spotted these long, golden doughnuts, dusted with sugar and more? \n\nThese churros are Dulcinea's calling card, but they aren't all they've got at the stand. They've got creme brulee and PB\u0026J doughnuts, sweet breads (not to be confused with sweetbreads - think banana bread and lemon loaves), horchata, empanadas and more. I have yet to try the empanadas because if I'm going to eat an empanada I'm not going for the baked variety, but everything else has been solid. \n\nThe churros are the star of the show though. \n\nThey've got the classics served with chocolate dipping sauce, as well as some filled with dulce de leche or nutella. If you're feeling really frisky though, try a churro ice cream sandwich. It's doughnuts and ice cream. Can't be bad. And the ones that initially caught your eye by the register? Don't worry, those stale ones just for show; they'll fry yours fresh to order.\n\nLike many a vendor, Dulcinea started out at Smorgasburg, and opened up a permanent location here. It's an excellent sweet end to a culinary tour of this fine basement of edibles, so check them out.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "Okay! I'm gunna assume that Dulcinea isn't rated higher due to their empanadas (which I have NOT tried) .. and the ONLY reason I'm assuming that is because I HAVE HAD their churros and they're delicious !\n\nOn the outside they are so perfectly crunchy! \nI've honestly never had a churro textured so perfectly .. Other churros that I've had are usually too soggy, or too oily.. or too something.. or not enough something! But not these! \nLike I said, the outside has the perfect amount of crunch and the inside has the perfect amount of goopy goodness! \n\nI've tasted their regular churros with dulce de leche dipping sauce and Nutella dipping sauce! \nBoth were delicious! \n\nI've also had their Churro ice cream sandwich and that was another hit!! \nSalted caramel ice cream with dulce de leche sandwiched between two delicious churros with some Oreo crumbles on the side and powdered sugar on top... it was so good!!! \nAnd the ice cream was delicious !! \n\nWhat I really want to go back and try are their warm stuffed donuts! They have a variety of flavors like Nutella, creme brûlée, and PB\u0026J!! And Omg. They look so good!!  \nI'm literally switching between this review and their pictures on Instagram and it makes me want to run to New York right this second!... \nPouring rain and all! \n\nI'd definitely recommend the churros from Dulcinea.. and don't really understand why their rating is not higher .. but I will definitely be back to try those delicious looking donuts.. and some more of those perfectly crunchy churros : P", "author": "Ashley M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-09", "description": "My husband was sold as soon as he saw dulce de leche on the menu. He said the dough was not too crunch or crispy, pretty soft and that there was a generous amount of filling inside. It is a little pricey but the flavor is worth it.", "author": "Nelly A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "This spot sells empanadas, churros and stuff donuts. I ordered these: One with Dulce de Leche (Caramel) and other with Creme Brûlée. The dough is soft and it comes with sugar, is very good. I liked more the caramel one. Has better flavor than Creme Brûlée. I had a better expectation with it  but it was ok. The price is 4$ each one. \n----------------------------\n@elmanudominguez \nFood + Entertainment in NY", "author": "Manuel Alejandro D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-25", "description": "I tried the churros rellenos dulce de leche. Unfortunately it was sickly sweet and not nearly worth the $8 I paid for it.", "author": "Safo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-14", "description": "I came to Dekalb Market for the first time and was wandering around for some dessert and found this place. I wanted to try it all but narrowed it down to the 3 churros filled with 5 filling options. I ended up getting the creme brulee, dulce de leche and nutella. They made them fresh while I waited and boy was it worth the wait! These were the best churros I have ever had! The cakes and doughnuts looked phenomenal, but alas I could only eat so much. Cannot wait to come here again. But might just end up getting the dulce de leche and nutella churros again.", "author": "Kami S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "As we wound down a food crawl in BK, we stopped at Dekalb Market Hall. After dinner, my son and I stopped at Dulcinea for churros (for him) and chocolate cake (for me). He really liked his churros and I ended up taking the vast majority of my cake home because I was so stuffed already. The good news is that it kept very well and was just as good the next day (note: when I got home, I put it into an airtight glass container). The cake was dense, rich, \u0026 heavy (in weight) but not overly sugary-sweet. In fact, it took me 2 days to polish it off because it was so substantial. It's hard to find cake this rich \u0026 chocolatey without being too sweet. As much as I liked it at first, I liked it even more after taking it home. It goes great with a good coffee or a glass of milk.", "author": "Godley V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "Recently they added empanadas, including a pork belly and mac and cheese option. So while grabbing paella from the attached paella shack I grabbed one of each.\n\nThe dough? The wrapper? The empanada shell was excellent. Good filling to shell ratio. I grabbed some of their BBQ and chimichurri sauce on the side as well.\n\nThe pork belly was a shredded pork opposed to my expected slab of belly on the inside. Was not overwhelming​ in flavor or richness (fattiness). The chimichurri added a nice balance to the richness there though and the BBQ enhanced it.\n\nThe mac and cheese was good although not authentic I'm guessing. (My wife was upset they didn't have guava and cheese which to her is the OG empanada.)​ \n\nThe dulce de leche donut I grabbed for the next morning held up well and had a chewy crust with a not overwhelmingly sweet filling. Would have for breakfast again.\n\nThis is a good spot to grab empanada​ app and post-meal​ dessert in one stop.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-12", "description": "Awful customer service. Tried to buy an empanada for around $4-5 bucks, she informed me that it was cash only unless you spend $6 or more. She had already served the empanada on the plate, when I informed her that I only had a card with me, she just picked up the empanada with her hand and placed it right back into the warmer. Bad business practices, bad customer service, and unsanitary. There's plenty of other places around, save yourself and go elsewhere!", "author": "Joe K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Churros why not!?! Perfect churros even better. \nWe decided to try a few things at the Dekalb Market last week. We closed out our food journey with churros for dessert. They were delicious, airy, not greasy, not overly sweet, just perfect. They were accompanied by either semi sweet chocolate sauce sauce, or dulce de leche dipping sauce. We decided on both and just paid the extra charge. I believe it was about $6-$7 for 5,  totally worth it and completely shareable. I recommend you give it a try if you have a sweet tooth, or even if you don't they are yummy. They also sell a bunch of other treats which I will try next time.", "author": "Millie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "I've had Dulcinea Churros twice as far as I could remember. Once at the Dekalb Market Hall and once again yesterday at the newly-opened for the season Bank of America Winter Markets at Bryant Park. I'd say there nothing special about churros because they're just simply sweetened fried dough. \nThe only way you can serve them differently is with various types of dips, syrups and ice cream. Maybe hot chocolate or coffee? \n\nThe churros that they offer here at Dulcinea are pretty reasonably priced. I purchased the 5 churros for $6 option and shared amongst my 2 other friends. We had the option of choosing one dip so we all opted for the Nutella. We all went on an unseasonably warm 70 degree October day, but I think these warm churros would be more enjoyable on a chilly evening. \n\nOverall, my experiences at Dulcinea weren't bad. The churros that they offer here would be a great grab-and-go snack for any sweet tooth.", "author": "Henry T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-21", "description": "I stopped by here since my friend and I were craving churros. We were still reminiscing our time in Mexico when we had our churros and it was piping hot filled with chocolate and condensed milk (dulce de leche). \n\nWe got the chocolate churros filled churros here and it was not good. The churros and fillings were not freshly made. The fillings came from a churned machine that has probably been sitting there for a while and the filling had a thick consistency like nutella. It was definitely not molten hot chocolate sauce.\n\nI'd pass on this place if I were you. I would actually recommend the churros at Sweet Churros (near K-town). Their churros are freshly made.", "author": "Teresa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-22", "description": "Best hot chocolate at the Columbus Circle holiday market!", "author": "Samuel L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "I stopped here for baked empanadas while dining at the Dekalb Market. I actually thought they were quite tasty and I would come again, but they weren't like anything to totally rave about. They also serve churros here, which did look good, but I already had my eyes set on ice cream from another establishment and that's what I ended up getting full on. :)", "author": "Shar M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Churros Ice Cream sandwich... enough said!!! I got the churro Ice cream sandwich with salted caramel ice cream, dulce de leche and rainbow sprinkles and yes it was as delicious as it sounds. Their is a reason why this place has a ridiculous line at smorgasburg and rightfully so their churros and ice cream sandwiches are a must!", "author": "Paul G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-02", "description": "Review based on Bryant park location\n\nFirst of all, the smoke ventilation is non existent and while you wait online you will be covered in smoke and smell like oil from the fryer.  \n\nNext, I was expecting more - flavor was a bit bland and didn't seem like they could handle the large volume of customer traffic.  The Nutella sauce was nearly not enough for the massive churros and they packed it so awkwardly in the container that we dropped one on the floor while pulling another out to eat.  \n\nGood at best, but nothing special.", "author": "Billy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "I'm at the DeKalb Market walking by every booth, like a lion looking at antelope grazing peacefully. \n\nThere in the distance I see Dulcinea Churros. Now churros is just an easy scooby snack. If I'm in the Bronx, I'm hitting up the churro lady with the push cart. That's just a given. \n\nI slide by as a read the sign: 3 Churros stuffed with various fillings.\n\nBe still my heart\n\nI smile at the beautiful lady and ask for my three churros to be stuffed with nutella, peanut butter and finally dulce de leche. When you ask for \"Dulce de Leche\" you have to make it sound all sexy like how Marcela Valladolid says it. When I pronounce it, I sound like a rube from Brooklyn. Stuff one with pass the dutchie! \n\nAfter it was all stuffed with goodness, I found a quite spot to enjoy my churro bootie. Man oh man.. The peanut butter is silky smooth! Nutella is off the chain but third churro has all the charm. The dulce de leche stuffed churro is what dreams are made from, its sooooooo addictive!\n\nIf you want to have a great treat, grab a few of these stuff churros from Dulcinea Churros.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "First time going there and have to say great place, very welcoming, will be making the trip back downtown BK again to go here.", "author": "Adriane B."}], "servesCuisine": "Spanish", "priceRange": "Under $10", "name": "Dulcinea Churros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W Brooklyn Ny 11201", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/whRZiFEbHL2QZs7_-UoZ5A/ls.jpg", "@type": "Restaurant", "telephone": "+17186224050"}