{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "My friends and I were staying in Brooklyn for a weekend trip to NYC and found Two 8 Two from their great Yelp reviews and they did not disappoint. We were seated promptly and our waitress was so nice. I was in the midst of wicked hangover which required fries and a Bloody Mary and they were able to supply on both accounts. I had the signature burger with the peppers/special sauce and it was so good! The fries were great and the Bloody Mary was good but could have been spicier and in tall glass. All in though, no real complaints. Next time, I would like to be able to try some of the beers as their draft line up looked pretty good. I would def. recommend this spot to anyone visiting Brooklyn as a good lunch spot or a place to kick off a night on the town.", "author": "Elizabeth S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-16", "description": "Two8Two burger was delicious especially if you like peppers, which I DO! Only downside is the burger was a bit pricey considering it was a little small and didn't come with french fries or any kind of side. Which for $10 I feel like they could at least throw me a gourmet pickle. It was definitely worth it and the burger is made with all fresh ingredients, it's not greasy at all. But I wouldn't say this is the best burger I've had and I'll continue searching for my favorite brooklyn burger spot.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-14", "description": "As good a burger as anywhere else in the country. The bun is soft, the meat is moist and the sauce has a nice flavor. The optional additions such as egg and bacon are perfect too and the beer selection is good. I particularly like the Peak Organic Ale here.\n\nIt's as good as \"the shack\", better than Five Guys and beats the shit out of most pub burgers in NYC.\n\nI like to come and sit at the bar and get lunch here. The bar always plays nice old school mo-town music that's chilled out. Not such a big fan of the restaurant area at the back - a bit sterile so I sit at the bar.  This place is now a regular spot for me. Love it!", "author": "Dave F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-27", "description": "I was looking for a good place to eat and decided to try this based on the reveiws. I also decided for something different...I loved the pablano buger, it was loaded with roasted pepper and cheese and there sauce...juicy...delicious...my mouth waters thinking about it. Not typical burger for me. I also had their lemonade and it was a really simple lite drink...not sweet and overpowering with lemon. Overall the place is cozy...the staff was nice. I will be going back.", "author": "Cynthia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "Burger was great after eating and drinking at another establishment. I asked for a medium burger and it came a little well done. Nevertheless it was solid and I would come back again. Onions and thousand island dressing are a nice touch.", "author": "Rich S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "I'm a sucker for a great burger, and this place has several. Love the breakfast burger and the 2eight2 burger. Finally tried this place after seeing good reviews in Time Out NY, and glad I did. Will definitely return, and I highly recommend to any burger lover.", "author": "Lily W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "I love this place. It isn't super loud and is very inviting. You need to get the Greek fries. This place has a good burger, you can actually taste the meat itself with all of the other things it comes with. The drinks may not look big but they will hit you. I would definitely come back.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-03", "description": "Been here twice. Love the burger and fries. BUT, found a long hair in the meat my second visit. can't bring myself to go back.", "author": "Emmanuel I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-07", "description": "Seriously. The. Best. Burger. I've. Ever. Had. Wish it were closer.", "author": "rosalind p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "My favorite burger bar in brooklyn, incredibly tasty burgers, delicious buttered and toasty buns - good/varied draft selection - great service and prices are reasonable for the quality of food / drinks. Picnic tables out back are a hit in the warmer months.  I'm a fan.", "author": "Sandy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "We went here last night with Harold, sat at the bar and ate and drank.  I had the pub burger.  It was so good that I stood up and cheered afterwards.  Perfect!", "author": "Ernesto P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "Cute place, great turkey burger. I like the two8two sauce. Next time I'm in Brooklyn I'll go back.", "author": "Erika D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "Not sure if this is a popular or well known establishment, but i sure hope it isn't so that I can consider this place my low key go to spot! I've been a fiend for a good burger the last 2 weeks, but due to bad timing and a hectic schedule, the opportunity of a good burger has eluded me. It's been so bad that I felt like a crackhead dying for a fix of good burger when I was at wedding out of all places! Fortunately for me, fate was on my side on this day and I was able to try the Pub burger from Two 8 Two. I'm not going to say it's the 'best burger' I've had since everyone's pallets and preference differs, but I would just say that the burgers here are worthy of a try. Hopefully you will enjoy this place as much as I did.", "author": "Rich W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-07", "description": "What a juicy burger. yummy!!! Ordered the burger with cheddar and onions . The meat was seasoned and perfectly cooked. Will def come back when i want a great burger.", "author": "Olena P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-04", "description": "Phenomenal hamburgers. Maybe the best hamburger I've ever eaten. Certainly the best in the neighborhood. Great service, excellent food, reasonable price. Very nice!", "author": "Todd P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "I love this place but I can't go in the winter because it always makes my clothing (and thus jacket) smell like burger forever until washed. Would definitely get an extra star if they figured their ventilation out...\n\n(yes, that may seem ridiculous, but go there and you shall see.)", "author": "Benjamin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-14", "description": "Great burgers for a much more reasonable price than all of the local \"gourmet\" burger places, along with a solid beer selection. All of the meat for the burgers is fresh sourced from one of my favorite butcher shops in the Cobble Hill area, Paisano's. Pretty much can't beat that in my book. If you are looking for a burger and a beer in the area, this is a great spot for it", "author": "Patrick F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "Love this place!  Bartenders so cute and soooo funny!!! Great music.....and way better than that bitch on Jay Street!!", "author": "Robin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "Heard about their burgers and have been wanting to try them for a while --- why I waited so long I'll never know.  Burgers were great, fresh and cooked perfectly.  Normally I'm a purist, preferring just ketchup but went with their house sauce and was very pleased.  Drinks were also good and it's always great to be able to sit outside.  Definitely going back.", "author": "Andrew F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-28", "description": "Went here last night with my wife to watch the Gator game and had the best experience. The menu was affordable, the staff was awesome, and the food was amazing. The two8two burger was out of this world. The poblano peppers provided the perfect little kick and the below poster was right, the sauce was very reminiscent of In-N-Out's. Just awesome. My wife had the turkey burger which I tasted and found to be one of the more flavorful tb's that I've ever had. The sweet potato fries were also tasty and extremely crispy. The bartender, Erin, was super cool and so was the owner Billy. If you love burgers, great beer, and a laid back atmosphere this is the place to go. Cobble Hill/Boerum Hill/Carroll Gardens finally has that great burger place that it's been missing and if you live anywhere in the Tristate area you should definitely go! I can't wait to try this again.", "author": "Jason R."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}