{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "This place can definitely give any other burger joint a run for their money. Perfectly cooked burgers with exceptional sides, every time! \n\nIt's a medium sized space with the bar in front, tables in the rear, and a lovely garden area out back for warm weather dining and drinking. It starts to get very busy around happy hour and dinner time. The service is consistently speedy and attentive. \n\nI'm not quite sure the 1st time I ever had a lamb burger but every time I have the lamb burger here it feels like the very 1st time. I crave it often. This burger is the juiciest and most flavor bursting burger I've ever had in my life. The tzatziki sauce compliments the flavorful burger perfectly. The sides are awesome as well. The Greek fries which are topped with feta cheese are excellent! Next time I'm in I want to try the chili cheese fries.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-25", "description": "Well.. a friend and I visited this place to catch up and grab a bite. We walked in around 5pm on a Thursday evening, place was pretty empty (except for the bar seating).. we were seated in the very back of the restaurant, which almost kinda looked like somebody's living room. \n\nDecor: It's alright, it has more of a \"homey\" feel to it, almost like you're in somebody's house; it can feel like your basic run-of-the-mill pub/bar to grab a beer and a good burger. \n\nFood: We both ended up getting the classic two8two burger as recommended by a lot of yelp reviews. The burger was cooked well, the toppings were on point but I guess my only complaint was that the size was a little dinky! It also doesn't come with fries either, you have to order all sides separately. We ordered a side of greek fries which were just OK; it was essentially just regular fries topped with some cubed feta cheese (not melted or any kind of sauce on top). Next time, I'd probably opt for regular fries.\n\nService: decent.. seemed very rushed to get us out of there. \n\nOverall, we didn't order any drinks this time we went, but might be a place to come after work with some friends to grab a beer.", "author": "James L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "You can come for drinks, you can come for dinner, or can come for both!  There is a nice bar with decent taps at the front, and a quiet dining room in the back, this place will fit whatever party you come here with.  We opted to be in the back so we can sit down and eat across from one another.  We were surprised to see 3 families with small children already situated in the back even though we just passed about 6 people drinking at the bar.  This is already a good sign!\n\nWe didn't take very long looking at the menu at went with their signature burger, Greek fries, and blackened chicken sandwich.  The signature burger came in at a good price and just the right size, topped with poblano chiles, cheddar and their own sauce.  The burger looked delicious, smelled amazing, and (luckily) tasted fantastic!  Since the burgers don't come with sides, we shared a Greek fries order and was also thrilled at its flavor, crispiness, and perfect seasoning.\n\nOne of us didn't feel like burger night so I ordered the blackened chicken sandwich topped with bacon, cheddar, and their sauce.  This, too, was another surprise in flavor and presentation.  The pictures really don't do it justice as the sandwich came out hot and enticing.  The chicken was not dry at all, nor was it greasy.  The bacon was crispy and their signature sauce just tied the whole sandwich together so well.  \n\nThere isn't much to complain about at this restaurant, everyone should give it a try when you're in the area for a nice, tasty burger.", "author": "Leila L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-05", "description": "PROS: Interesting beer selection, TVs @ the bar, good \u0026 interesting selection of toppings for the burgers, staff is super friendly. Cons: my 2nd visit \u0026 there was some issues with medium rare both times, Two 8 Two sauce contained mustard  (just not for me), both times I had to stand and get staff. On the first time: dining area was empty but there was a pretty significant game(so understandable) and the 2nd time it was pretty busy ( so posibly reasonable as well).\nBut overall the burgers were mediocre and there are top many other great places. Too bad: great location and the game. It's you not me. Dang!", "author": "Me 2."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "Totally killer. We had the breakfast burger, half and half, the two8two burger, and an extra special burger filled with bits of greatest, awesome, and bacon. This place makes me feel like a unicorn floating across the alps, with wizards shooting blasts of neon light to guide my landing on the rainbow road to flavor heaven where I'll be blessed with more two8two (and an indispensable supply of Macallan 18).", "author": "David F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "I'd like to make note that my vegetarian girlfriend asked our server if the \" garden dog \" was a veggie dog and she said \" pretty much\". HOWEVER, it was quite the opposite.... it was a hot dog made of beef with VEGGIES on it.... not the same thing at all. THE FOOD WAS GOOD. The service was poor. Server took the order and I don't think she ever came back, at the end a gentlemen took over and got us our check and cleaned up the table.", "author": "Smith J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "If you're looking for a quaint bar with a great beer selection and delicious boozy milkshakes, an absolutely amazing, tasty yet reasonably priced burger, in a neighborhood gem, this is the place. This place always satisfies. The burgers really are delicious.", "author": "Craig .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Cute burger spot. Enjoyed the Billy burger  with jalapeño Margarita the first time and the Pub burger the second time I've been here. If you enjoy milkshakes do not order one here, they're not great. If weather permits, there's outdoor seating. I'm not a beer person, but I heard there's a good craft selection.", "author": "Tatiana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "We came for a quick bite while running some errands. Great burgers for the price; we got the two8two and the veggie, both were delicious with great patties. Definitely want to come back and try their beers next time. Service was quick and friendly, but we did wait a little for the food since everything was freshly made.", "author": "Stephanie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-09", "description": "I have ridden past this place innumerable times on the way home from Trader Joe's and always promise myself that I'm going to stop by one day.  That day finally came.  \n\nI had the Billy burger, Greek fries, and a beer.  All were solid.  My burger was nice and juicy.  I do wish it had a sturdier bun. By the end, I had to use a knife and fork.  The fries were pretty good.  I must admit that when I saw someone else eating them, i thought they were blue cheese fries, so my impression was probably tainted by my disappointment upon realizing that the cheese was actually feta.  I might have been more impressed had I not been so excited about the prospect of blue cheese fries.\n\nThe presentation of the food was underwhelming.  Nothing looked particularly appetizing.  Just food thrown haphazardly only plate.  I think I expected a bit more in terms of that.\n\nService was okay.  Took a while for the bartender to tear himself away from his cell phone and realize I might want to see a menu, but once he did, he was friendly and attentive.\n\nThere are a couple of small TVs showing games, so it's a chill space to keep up without immersing yourself in an all out sports bar.", "author": "Candis D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Love this place . Have been here numerous of times- burgers are perfect every time! The billy burger is my favorite... nachos are great as well.", "author": "Jess R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "Went to Two 8 Two with a friend that lives in the neighborhood last night and it was Excellent!!! We both ordered hamburgers and it was one of the best burgers I've had in awhile. It was cooked perfectly and the bun was toasted, which made it taste so much better! \n\nAlso, after finding this place on Yelp, I noticed that the Greek Fries were popular so we decided to have an order. They were delicious and so different! The feta cheese on top was so yummy and they also had some oregano on them. We did also order onion rings, which weren't amazing, but maybe it was just because the fries were SO much better. \n\nTwo 8 Two is a great neighborhood spot! It was very reasonable and I would love to visit again when I'm back in BK.", "author": "Alexa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "Loved the burgers here! The billy burger and the two 8 two burger were both great. Juicy burgers with sweet buns and the two 8 two sauce are the perfect combo. Disappointed that the server didn't mention that it costs 50 cents for extra two 8 two sauce. We found out when our bill came. Would have appreciated being told ahead of time. The burgers are so good! We will be returning!", "author": "Leslie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "turkey burger was delicious, would order it again. We were seated outside  at the picnic style tables, the weather was nice, mixed drinks were poor, not strong at all.", "author": "Kerry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Went here for the second time on Saturday. I got a breakfast burger and a mimosa. The burger was cooked perfectly as was the egg.\nThey do get crowded fast, so have some patience it is worth it!", "author": "Lauren A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "This place hit the spot after a long day at work. I just wanted an easy veggie burger and I found it. For how basic it was, I would have expected a lower price or at least for it to come with fries, but it was still worth it. Got greek fries on the side which were doused in oil. It was just what I wanted that night but at any other time I would have found that annoying. The vibe I was getting was after work bar for service people. Casual staples. Wasn't bad, but I wont be running back.", "author": "Bea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "This place was such an unexpected and delightful find thanks to Yelp!!  Honestly, based on the name and outside appearance, I probably would have NEVER gone in, but truly, the burger was incredible.  Don't be deceived.  This place deserves your business.  \n\nFirst, our server was spectacular.  She was so kind and convinced me, quite rightly, to get a strawberry milkshake.  It was delicious.  A tiny bit on the medicine-flavor side, BUT not bad by any means.  \n\nThen came the burger which was perfectly cooked and a delicious piece of meat.  The cheese, lettuce, and bun were all delightfully chosen, and I couldn't help but wonder how long they'd spent choosing the items that they did.  \n\nIn terms of atmosphere, it wasn't great.  Felt a bit cheap and thrown together, but we were comfortable at our table (not squeezed in like we are at other places in New York City).  It looked like there was some outdoor seating and a nice beer selection, but we didn't experience either of those.  \n\nOverall, GREAT.  Can't wait to go again next time I'm in the neighborhood!", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "I was looking for a place we could reserve for a large group (25-30 people) with an outdoor space, while not having to put money down up front. The fella suggested Two8Two, and we made the reservation for a Saturday night in late June.\n\nThank you, Two8Two, for a great evening. With a group that size we were able to reserve the entire backyard (four regular picnic tables) and it was nice being able to mingle and have the full space without having to share seats with other parties*. The evening started a little inauspiciously: the space wasn't yet ready at our 6PM reservation time; we got out there closer to 6:15PM. However, after staying until about 11:30, that 15 minutes seemed inconsequential!\n\nOther than one instant in which the waitstaff brought out several burgers and weren't sure who had ordered them, the whole team handled our large group (and our copious orders of burgers, cocktails and beer) with aplomb. They stopped by often enough to take new drink orders and bus tables but didn't get in the way. We kept everything on one tab, and after 5 hours of 20+ people drinking, the tab all checked out (which, in my mind, was a minor miracle).\n\nIf you are looking for an outdoor space for a group, consider having your get-together here. The prices are reasonable, there is enough variety for everyone (as long as they like burgers, but who doesn't? Even as a vegetarian I get to enjoy their veg burger), and the drink menu is well-rounded.\n\n*Other parties: I'm genuinely sorry we had the whole backyard if you had come to the restaurant to sit outside.", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Several years and visits after a Yelp Elite Event here, two8two is basically the same. The bar is ok. The burgers unique and tasty.\n\nWe stopped by recently during happy hour. Although the bar doesn't offer a variety of happy hour cocktails, the Cuzco Fizz with Pisco, St Germaine elderflower, lime juice and sour cherries was refreshing!\n\nThe host was cool and said we could sit at the bar or a table. He didn't mind that we ended up doing both as after drinks we decided five of us eating at a table would be nicer for convo.\n\nThe burgers weren't the biggest in the world, but big enough. My regular two8two Burger had cheddar cheese, secret two8two sauce, and awesome roasted poblano chiles which really made the burger stand out. Plus I added bacon. Greasy and soggy bottom but how could it not be? Yum! Too bad I didn't get tomatoes and lettuce. I just assumed they came with the burger, but the waiter never asked if I wanted them. So mention when ordering.\n\nWe had different fries orders to share and the Greek fries with feta cheese and oregano went first. So delicious!\n\nWe'll probably be back in the Summer when the outdoor patio is warmer.\n\nP.S. My eagle eye spotted numerous outlets to recharge dead iPhones. D'oh for forgetting my cord!", "author": "Jerry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Honestly the best burger I have ever had. Perfect size, perfectly cooked, amazing toppings. Great fries. Very decently priced. Best burger in NYC.", "author": "Alexis F."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}