{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "To be perfectly honest, I just inhaled an order of their chili cheese dog and chili cheese fries in my car, outside of the restaurant. I was craving one so bad but it was getting late and I didn't want to be THAT person. So I ordered it to go. I got there 15 minutes later than they said it would be done and it was still piping hot. When I opened this glorious to go container that contained my hot dog, the angels sang. This hot dog was seriously a meal in itself. They did not skimp out on the toppings and definitely looked and tasted like they make the chili themselves. It was so effing delicious. One of the best chili cheese dogs I have ever had. Maybe the best in fact. To really drive home the chili and cheese factor, I complimented it with the fries which were also fantastic. Perfect amount of cheese and chili on them. Such an unexpected amazing meal. I will be thinking about this meal for weeks. \n\n\nUPDATE: Second date with this place (two days later on a Friday night) was just as good as the first. I think we really have a connection. Got a mojito to start, always good. And a lemonade with dinner. None of that from concentrate shit. Ordered another chili cheese dog because I couldn't stay away and an order of onion rings. Both made me melt. Got the two8two sauce with the onion rings, highly recommend. Boyfriend got the veggie burger and really enjoyed it as well. He is a vegetarian so he can be pretty critical of them. But he said it was a good veggie burger in all dimensions. Think we're going to start going steady with this place.", "author": "Lux A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "Bad service! I came here at 2:30 PM alone and there was no customer service to speak of. Food was ok, but vegitarian selection could be much better.", "author": "Cyree J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-19", "description": "If you are looking for a delicious burger, this is your spot. While other burger places have up to two full pages of burger options(peanut butter, really?), two8two Burger keeps it simple and tasty. \n\nThe burgers are medium sized, so you don't get a complete gut bomb. The signature, the two8two Burger, is hard to beat, topped with dark, green poblanos, cheddar cheese and two8two sauce(mayo based and thousand island-like). \n\nApparently they get their meat from the venerable Los Paisano's around the corner on Smith. According to TimeOut New York, it's a proprietary blend of chuck, brisket and short rib delivered twice daily.\n\nThey also apparently buck up for New Mexican Hatch chiles. I thought they were too spicy for poblanos, so the Hatch designation would make sense.\n\nThe Shickhaus hot dogs are also quite good, and a two8two version like the burger is available.\n\nWe shared the nachos to start, made with beef, beans, cheddar cheese and tasty homemade tortilla chips.\n\nYou can find better french fries than at two8two, although their fries are fine. We'll have to try the Chili Cheese Fries or the Greek Fries(topped with feta and oregano) the next time, or even the onion rings.\n\nAll-in-all, a great burger, solid beer selection and excellent service.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "Wish I could give more stars but by the end you will understand ...\nWe come in its empty , great so we are seated immediately \u0026 we order . I ordered the billy with a fried egg \u0026 my bf ordered the breakfast burger . My burger comes out and the middle of the egg isn't cooked , so I had to ask the server ( Joel with the beard ) to fry it . That annoyed me in itself because who assumes how people want their egg done . So my bf \u0026 I finish eating it was good and the food came up to 35.93\u0026 we gave him 40$ , so he said u want change or no ? We said no it's ok but he goes no I will give u back change . So we are confused but we take the 4$ back since he said he will bring change \u0026 we  walk out , sure enough he follows and says that was rude I will serve u guys again though .... Wait what pause lol did he really just refuse the tip and then ask for it back . So we tell him he misunderstood that we said keep the change he goes no that's nothing that's how servers make a living that's not right ( how could he assume we weren't going to give more ?\u0026 why is your rent my responsibility ??)) not only was he not attentive but not warm or engaging so u get what u deserve ,Joel get a new job bottom line is we won't be coming back here !!", "author": "Christine D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Greek fries and the classic cheeseburger medium rare is all you need. So simple and filling, the best basic burger I've had since Minetta Tavern, but even better and at a better price.\nGreat lunch specials and happy hour!", "author": "Jenny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "Music is good, environment as well, food (burgers are just amazing, the meat is high very high quality) and beer super good, bartenders... could be much better.... nevertheless, after a Bee's knees everything looks much better  try the cocktails!", "author": "Jacob F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "I rarely eat hamburgers, but the other night we drove by this place for the millionth time and decided to try it. So glad we did! Although the burgers aren't huge, they are so rich and delicious that they end up being just the right size.  Highly recommended!", "author": "Laura M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "My favorite Burger in Brooklyn!  \n\nAt Two 8 Two, the bread to meat ratio is perfect. The burger is oozing with meat juice and when combined with the special sauce and grilled onions it is just perfection.\n\nAt $8 for the Billy Burger which is what I order every time, you can't go wrong.  In fact I'm salivating as I write this.\n\nI've tried the Greek and Chili Cheese Fries - stick with the basic classic Fries as a side, thats all you need, the rest are nothing special.", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "The best burger I've had in years! I heard about this place from a friend, looked it up \u0026 the menu immediately won me over. I had the breakfast (turkey) burger \u0026 it was finger licking mmm mmm GOOD!!! The egg on it, the sauteed onions, the bun, the TWO8TWO sauce....everything! Its hard to find a place that serves a superb turkey burger. Well I don't have to look any further. I also had a side of the greek fries. Nothing spectacular although very good. Just fries sessoned w/oregano \u0026 crumbles of feta cheese. My friend ordered onion rings \u0026 they were great....crunchy in a sweet batter. The service was wonderful from entry to exit. The ambience was awesome for 4:30 in the afternoon. I'm already anxious to go back!", "author": "Purpose T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-21", "description": "While my wife and daughter got their hair done nearby, I decided to wander into this spot to kill some time. Good was ok. Had a burger. Bartender was unattentive the entire time. Big no-no in this guy's book. Headed over to a watering hole nearby for better service.", "author": "Cesar A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-20", "description": "Delicious burger and fries.  No delivery and they don't answer the phone if you try to call it in. The wait is pretty long to pick up the food.  BUT it's really good - try the veggie burger and fries!\n\nJust a head's up - if you want an early dinner, say 6 or 7pm, the place is filled with loud kids, babies and families.  Wait until 8 or 9pm and it's more of a bar atmosphere with adults.", "author": "Ariberry A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-09", "description": "Midweek, moderately busy.\nSeemed understaffed. Was seemingly invisible. No acknowledgement from bartender when I sat down, or as others were served who came up to the bar minutes later. I wasn't in a hurry, but annoyed nonetheless w/ what was either drama or play acting between tender and waiter. I've tended bar before, was taught to keep my eyes up to let people know I knew they were there. This guy didn't. I decided against another drink, but had to wait another 5 minutes to even ask for a check. Sloppy service, inattentive and off putting. They lost a customer tonight.", "author": "Lynn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "Friday nights are the perfect time for a burger, wouldn't you agree? After using my new favorite tool, yelp.com, I decided to test the waters at what Yelpers concluded was the best burger joint in Brooklyn. After a nice walk through the neighborhood, Alex and I arrived at Two8Two Burger. In the front of the restaurant there is a beautiful dimly lit bar. As you continue to the back of the restaurant, there are tables of Brooklynites enjoying these fantastic burgers. In the very back ofTwo8Two Burger there is a cozy outside patio with umbrellas and picnic tables. We decided to sit outside and enjoy the late night crisp air.\n\nThe menu is short and sweet. It consists of mouthwatering burgers, uniquely topped hot dogs, Greek salad, nachos and a few sandwiches. They also have a full bar with eight beers on tap and over ten specialty cocktails. Check out the full menu here.\n\nDuring our visit, naturally, I had to try their most popular burger: Two8Two Burger. This hamburger is topped with roasted poblano chilies, cheddar cheese and the special two8two sauce. Needless to say, it was phenomenal and my Yelpers hit the nail right on the head with this one. Alex ate the Pub Burger: 9oz hamburger with grilled onions, cheddar cheese, bacon and two8two sauce. We also shared some Greek fries topped with feta and oregano. Best fries of my life!\n\nTwo8Two Burger is located at 282 Atlantic Ave. in Brooklyn. They are open daily from 12pm-12am to satisfy all your burger cravings. Nothing on the menu is over $12, so feel free to treat yourself. So next time you want to eat like the Brooklynites do, head on over to Two8Two Burger and enjoy!", "author": "Olivia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "This is now one of my favorite burgers in Brooklyn. Boom. Got the pub burger. It was big. Their two 8 two sauce is much like In-and-out burger sauce, and that's a good thing. The buns were just the right size (not too big, in other words). I also got the fries with feta and rosemary. Great.\n\nAlso the place has a great pubbish atmosphere, with some quality beers on tap. So check it out!", "author": "Jason G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "After walking the Brooklyn bridge on a hot day my boyfriend and I stopped in for a couple of drinks. We sat outside where there's a small patio with picnic tables. \n\nWe both ordered the blood orange margaritas and they were delicious. The perfect balance of tequila, sweet, and sour! We didn't order food but the couple next to us both ordered burgers and they looked delicious. We'll definitely be back!", "author": "Brittany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-01", "description": "4.5 stars...\n\nTwo 8 Two is one of the latest spots to jump on the burger band wagon that's taken NYC by storm in the last several years and in Cobble Hill area specifically in the last year when Two 8 Two, Moo Burger, 5 Guys, and Shake Shack all opened up within the general area. That's on top of all the non exclusive burgers places that already existed in the neighborhood. I knew this burger place had to be special if it expected to compete in this market. Turns out it is. In addition to the great food, they serve almost exclusively micro brews (most are $6), and have a small back patio.\n\nI had the Billy Burger ($7.50) which was topped with sautéed red onions and cheddar and a side of sweet potato fries ($4). Here they don't ask you how you want your burger cooked because they're assuming you want medium unless you ask otherwise which I didn't mind as medium was perfect. The burger was as flavorful and as tender as can be. They went a little overboard with the onions but it was easy enough taking a few off. All the burgers come on a delicious slightly toasted potato roll which is big points in my book. The sweet potato fries were also phenomenal, no complaints there.\n\nAs others have mentioned, the burgers here are kind of small. Not slider small, but about an inch smaller than you'd normally get elsewhere. I personally thought the smaller size was good but didn't love that the prices were more indicative of a larger burger. If they chopped $1-1.50 off everything on their menu I would give them a resounding 5 stars and I'd probably be there every week. Regardless it was a great burger and  I'll probably be back in the near future.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "The lunch special here is awesome. $8.00 for burger and fries. \nI get the breakfast burger because I'm apparently weird and love egg on my burger. The staff is pretty good and attentive. My burger comes out just how I like it. Medium. \nThey don't take long with the food either so I can run in for lunch.\nThey have a nice back area for outside eating, When it doesn't rain.", "author": "Nelson A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "Two8two bar is my new go-to spot before a concert at Barclays.  This is the type of low key neighborhood bar everyone wishes they had in their hood.  The staff is super nice (but not in that fake way), they have some great drink specials, and the prices won't break the bank too much.\n\nI've only been here during the fall/winter months, but I hear they have a pretty sweet garden in the back.  Inside it's a typical pub, dark wood err'thang but very clean with a nice layout.  The one thing I don't appreciate is that the bathroom doors have no markings on them.  The first time I came here I really had to go, so imagine my frustration when I had to tackle a server to point me to the nearest water closet.  Now if I would have pissed myself in the middle of the bar I would have been the bad guy though, right?  This world can be so cruel.\n\nI'm a big fan of the happy hour here. If you have happen to swing by on a day where the bourbon limeade is one of the specials, get that shit.  It's super tart and delicious, and after your 10th one it really start to sneak up on you.  The sides aren't the best I've ever had, but they definitely get the job done.  I'm partial to the onion rings and the sweet potato fries, and always make sure to ask for extra two8two sauce on the side because that stuff is crack.  Their entree menu mainly consists of burgers that are comparable in size to Shake Shack, and they're quite tasty.  However, I recommend the thicker (than a snicker) pub burger.  It comes topped with grilled onions, cheddar cheese, bacon and that tangy two8two sauce.  Basically a cure for cancer between two buns.", "author": "Joel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "Tasty food, great customer service. Good place to come hang out with friends or a date night.", "author": "Alexandria B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-18", "description": "Being a newbie to the neighborhood, I was having a hard time finding a place to have lunch one day. For some odd reason, nothing in the area seemed appealing, and whatever did seem interesting turned out to be insanely busy (it was a Sunday afternoon, after all). \n\nThis place doesn't really scream \"prime burger joint\" as you walk in because of the bar. It seemed to be a favorite in the area because it seemed a little busy on Sunday afternoon. It wasn't a big deal, though, because towards the back of the restaurant, there are several tables and even a backyard. It was dim, but well lit from natural lighting. \n\nBefore looking at the menu, I prepared myself for the guilt I would feel all week from eating a bar cheeseburger (Carbs, carbs, fat, deliciousness!), however, I was surprised that they offered a healthier option called the two8two protein burger. The burger may look small when you get it, but it's satisfying. \n\nWhenever I feel like indulging, I'll definitely come back.", "author": "Adriane C."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}