{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "The burger? Goooood. The onion rings? Goooood. The fries? Goooood.\n\nEverything we ordered was solid. I got the Billy Burger, a rich patty with cheddar cheese, onions, two 8 two sauce. What is that two 8 two sauce, by the way? That stuff is delicious. I should have asked if I could have had it for the fries. The onion rings are thick and crispy, and the fries are awesome--thin, crispy but thick enough to have a real potato-y bite.\n\nI ordered a bourbon limeade for $9. It was a pretty basic cocktail but it tasted delicious. I never thought of that combination. Will have to immediately go make my own.\n\nBut before I do, I'll just say, this is a really solid place to hit up on Atlantic Ave. In some ways, it's pretty inexpensive (burgers are well priced albeit small but fries have to be ordered extra, drinks are in the normal range but two are priced at $5 for happy hour), in other ways it feels a little divey but maybe that's the charm.\n\nDefinitely a solid place if you are looking for a burger in Cobble Hill area.", "author": "Maria W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-02", "description": "I had heard there was a lovely outdoor space and that the burgers were pretty good, so my friends and I decided to come here for lunch on a Friday. It was surprisingly busy for a week day. We sat outside; it's small but nice. They have string lights up, which I imagine are lovely at night. \n\nThere are many different burger options on the menu. My friend settled on the half \u0026 half and really really enjoyed it. There were only 2 vegetarian options: a veggie burger that was soy based and a grilled cheese. I did not want to have the soy based veggie burger because of the soy, so I went with the grilled cheese with tomato. This was very boring and I could have easily made a better one at home. The fries were fine but truly nothing special. \n\nI think this place probably does a good meat based burger but vegetarians should skip this place.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "I was told by the bartender that the burgers were freshly made and it was good. I was so hungry so I tried. Omg was it perfect?! It was beyond perfect. \n\nI added a fried egg on a turkey burger for the first time and It was the best turkey burger I ever had. The fries was also freshly cut and tasty. The service was good. The staff had great energy that added a touch of a first time great experience! Thanks!", "author": "Sarah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Just In from San Diego and stopped in to see my uncle who took me to an amazing bar n burger place. Jake was our server where we sat for hours to k", "author": "Carla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "Great casual spot to grab a bite to eat and a drink and just hang out! The two8two burger is my favorite burger here. Surprisingly the poblano peppers were not spicy what so ever but definitely added a lot of flavor!", "author": "Katerina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "Arrived here at just about 7pm. \n\nTwo 8 two is a casual bar \u0026 dine joint with a clean friendly atmosphere.\n\nChose the bar seating area and ordered the Billy Burger (8.5$) along with fries (3.5$) and a soda ,\n\nThe burger is made out of a near perfect hand pressed meat pattie bought from a local around the corner butcher Los Paisanos which if you are local to the neighborhood is a great butcher shop with some of the best choice of beef.\n\nThis burger is undoubtedly the best burger in the neighborhood and quite well be some of the best burgers in NYC, served with a juicy medium cook along with flavourful special sauce and grilled onions, served over a butter toasted bun.\n\nA must visit if you in the area.", "author": "Umer A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "In the exploration of the Flatbush neighborhood which I need to do more. My friend and I wanted a nice burger for dinner. Two8Two seems to fit the bill.\n\nThe restaurant was pretty full the night we went. The wood rustic interior lends to the burger eating but acoustically was a bit loud. We opted to sit outside in the nice garden and where it wasn't as noisy.\n\nThe burger was excellent and cooked as ordered - medium. The bun was toasted and a side of Ketchup. Both of us were satisfied campers with beer in hand. \n\nFriendly service, neighborhood restaurant that put out a solid hamburger. This is what I'm talking about.", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Love this place!\nAfter I pick up my son from his camp we eat here. My favorite is the Billy burger with a side of Greek fries and a pomegranate margarita. My little guy loves the chilly dogs. The Greek salad is delicious. It's Nice inside and they also have an outdoor area.", "author": "Emanuel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "Two8two Burger\nNY Brooklyn Cobble Hill\n1pm Wednesday 6th May 2015\nFour Stars\n\nThis is a no sense bar and burger place. The $8 Burger and Fries Lunch Special caught my eye but I decided on getting the 1/2 Beef and 1/2 bacon burger ($11.5) and Sweet Potato Fries ($4.5). The burger was simple. A regular white bun straight out of a grocery store bag. The tightly packed patty was cooked a perfect medium and oozed with flavor and fat that slickly covered my fingers and the plate. The melty cheese and mayo rounded out the flavors of the not so spicy poblano chilies. The sweet potato fries were plentiful, nicely cooked, with a neutral seasoning. It is definitely shareable. \n\nThe service was great. He was friendly, quick, and everything a waiter should be. He even brought me some seltzer to remove the stain on my tie. \n\nLunch time: in and out within 20 minutes = unbelievable.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "Nice spot for lunch with a full bar and decent amount of tables. It's rarely ever super crowded so there's never a wait for a table and the food comes out quick.\n\nI often get the lamb burger which is fresh ground and seasoned with spices and topped with house made tzatziki (white sauce), paired with fries. It's delicious and filling too. On days in he summer when I'm not that hungry I'll grab a BLT that ones with \"two8two\" sauce on it, idk what's in that stuff but it's so good.\n\nI've tried several drinks on the menu also. They run a margarita special during happy hour; classic margarita on the rocks for $6, it's pretty solid. Some of my other favorites are the \"Jalapeño margarita\" which has a nice kick to it if you like spicy drinks, \"Across Smith Street\" which is a decently strong bourbon cocktail and for the lighter days when seeking something refreshing the \"Bourbon limeade\" I'd recommend.", "author": "Justin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "Had the Billy Burger.  and  Brooklyn Lager \nBartender suggested the beer and hit the mark. Good choice indeed. Also, was helpful with directions to the bridge.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "This is a great place to grab some food and drinks. I had the breakfast hamburger and a jalepeño margarita. The hamburger was good but I think the margarita was overpriced for the little amount they gave me. Also, the margarita didn't taste as great as I hoped it to be. However, I would definitely come again because the customer service was great. The bartenders were extremely friendly.", "author": "Melinda E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Pretty good food. Greek salad with blackened chicken was good. Decent atmosphere. Ben, our bartender, was attentive and super friendly. Will be back.", "author": "C. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "The Breakfast Burger (Hamburger with fried egg, cheddar cheese, bacon and two8two sauce) is quite delicious and hits the spot (who doesn't like a fried egg running over their burger, folks?), especially when there's beer involved on a weekend evening. The service has always been solid. However, I still can't get over the fact that one has to pay separately for fries or onion rings. It's otherwise hard to justify the prices for what are otherwise good, but not special burgers. With so many good burger spots in the city, it's hard to justify coming here more than occasionally, unless you have some sort of nostalgia.", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Wait staff are nice and friendly Food was served hot.  I had a turkey burger that was delicious with sweet potatoes that were hot and not oily. Just perfect for what I had.  But why are there no warm drinks like coffee or tea? Okay not to put any frowns on the great food that is being served with smiles and the goal to please. Great place, staff, and food.  See you again!", "author": "Patty Ann M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Pretty good burger place.   Great patio area in the back.  Can't complain good food, service and beer. I had the two 8 two burger with fries.  It's good if you like spicy.", "author": "Kari B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-14", "description": "The burgers are top notch, but I HATE when places advertise lunch specials only to have you go in and realize that the lunch special sucks. There's an $8 hamburger and fries special posted on the board outside. When we were seated we learned that it wasn't their regular hamburger and side of fries, but a SMALLER side of fries. So annoying. Why do that? It just makes me mad! Let us have our $1.50 savings that you tempted us into you restaurant with.\n\nCheapskate rant aside, the burgers are good, but you have to pay for each additional topping (ok, I guess rant not over). Small space. Bar setting. They DO have high chairs though!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-20", "description": "Simple ,family friendly and nice. We went here for a frugal family night out of burgers. The combinations are appetizing and I love the breakfast burger. This is a simple burger joint. Not too many choices but food is good. The fries are nice and crispy but I would suggest just getting the fries don't get it with topping in my opinion they taste bad with the toppings.", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "Burgers were really good! Service was great as well. They have a patio to eat outside which is nice when we are having good weather.", "author": "Tamara L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "My co workers and I came here for a quick bite to eat. We had the 50-50 burger, lamb burger, and not Greek and regular fries. The 50-50 burger was one of the best burgers we have ever had...... From anywhere! The food came out fast and hot. This was my second time having the lamb burger so I am obviously a fan.\nOne item that I didn't understand was the Greek fries. These are French fries covered with crumbled feta cheese and oregano. The fries pick up the oregano flavor..... But the crumbled feta just falls off the fries when you pick them up. I think maybe they would be a little easier to eat if the cheese was slightly melted. \nThere was a good lunch special of a $8 burger with fries and $4 pints of Firestone pils.....\nAll in all a solid burger place", "author": "Kevin R."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}