{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-06", "description": "This place is pretty good. I have had the pub burger(med rare) which had really good flavor and I have had the two 8 two protein burger both the turkey and the bee are good. Everything was cooked to order and the fries were good. The two 8 two sauce is addictive. \n\nSince the small burgers are really sliders you can't order them medium rare but they are still juicy. \n\nIt is a good option when in the area.", "author": "Jack Straw S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "If you want a burger in Brooklyn you must go here!! Excelle post basketball game burger and dog. Amazing onion rings and fantastic sweet potato fries. I'd hugely recommend the pub burger, crisp bacon oozing cheese and delicious burger sauce!", "author": "Alex G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-22", "description": "After failing to find a different restaurant I decided to settle on this burger place.  I was completely surprised about how amazing and magical this small burger bar turned out to be!  \n\nAll of the other reviews were right about the special sauce. I think they pour it out of the holy grail onto the burgers!  \n\nI also ordered fries and they were fresh and delicious!", "author": "Leslie J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-20", "description": "Burgers were good. I think they were cooked in butter. WILD juicy. \n\nSkip the turkey burger though. Go hard or go home.", "author": "Jess S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "Amazing place! I actually had a get together there and proposed to my fiance with family and friends present. Management was very accommodating in allowing my large group of people there use the back patio for free! The service was very good, waiters took care of everyone.\nThe food: burgers were delicious and their fries were tasty as well. Everyone at my party raved about all the various burgers they ordered.\nDecent happy hour drinks as well.\n\nI would recommend this bar for its food and service", "author": "Mick E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Burger, burger, burger. Such a delicious burger! My boyfriend and I loved our burgers here. We stopped in on a not so busy day and it was just so relaxing and quick serviced. We got exactly what we wanted, cooked exactly how we wanted. We also shared some chili cheese fries. They were great but then they got really soggy and sad (our fault, lesson learned to stuff our mouths quicker).", "author": "Ani Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-26", "description": "Excellent food, great beer choices, fantastic people.  \n\nYou want a tasty burger?  Order the all-in pub burger.  Maybe get some onion rings with that, too. For the trifecta, wash it down with a pint of Stone's Oaked Arrogant Ale.\n\nIf you don't want a burger, they have alternatives that are also good.  But you should really get the burger, because Two 8 Two has the burger down to a science.  The meat comes fresh from the butcher shop down the street and the cooks know what they're doing.  My family and I have been coming to this place on a weekly basis for a couple of years now, and not once has a burger been anything but perfect.\n\nBeyond the food, the Two 8 Two folks are awesome.  I don't go out much, but when I want a beer (or two) after a long day, this is where I belly up.  The owner is often at the bar greeting people, and his staff are great people.  \n\nFive stars, six if I could.", "author": "Phil S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "Quite likely the best burger I've ever had.  Went with a group of 10, and that was the general consensus. We were in town from all over the country-- many from DC where there's a burger place on every other corner.\n\nI kept is basic-- bun, bread, cheese.  The beef truly melted in my mouth.  It was so good, I had a second (which I don't think I've ever done).  They're not huge, but so, so tasty.", "author": "Jim S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "As of now, the best burger I've ever had. Easily. Their burgers are cooked Medium by default unless you tell them otherwise. The meat is tender and seasoned well. I can especially say this about the Lamb Burger....arguably my favorite. The 282 Burger, the Billy Burger, and the 50/50 burger....you just can't go wrong. Not only that, they had a whiskey special one day....which just spoke to my heart. Go. NOW!", "author": "Steven M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "Great burger.  Had the breakfast burger.  Small but fills you up.  Definitely recommend it.  Sweet potato fries were also great!  Gets crowded and rightfully so.  \n\nThe burger itself was actually pretty incredible.  Perfect melted cheese, perfectly cooked beef.  The bacon on the burger is probably the best bacon I've ever tasted on a burger.  The egg is the perfect ending to the burger toppings and the mix of the two8two sauce is great with it.  Just writing the review of the burger makes me want to have another breakfast burger right now.", "author": "Zachary D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "Still going strong!  This place is now our destination burger place.  The prices are AMAZING and the quality is top-notch.  The bartenders and waiters are quite friendly and very good.", "author": "O U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "I will gladly pay you in hugs for a Two 8 Two burger today. This place strikes a nice balance between burger joint and classy bar. Besides a simple lineup of tasty burgers they sport a very nice beer list as well (if you have a porter you are doing it right). I saw a lot of kids wandering around inside so I guess it's a family favorite too when dad's off the wagon again. \n\nIf it's your first time get the Two 8 Two burger which has a bold and slightly smoky flavor I have yet to find in another burger due to the roasted poblano they slip into the burger.\n\nThe decor is fancy-lookin and warm enough here for a casual dinner date too. Play your cards right and you might be slipping her your poblano later that night hermano.", "author": "Raphael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-24", "description": "282, I hate you.. and I love you at the same time.\n\nI'm a pretty hefty eater and I can easily demolish two of these burgers. You hurt my wallet.. but god dammit the burger is amazing. \n\nThe beef is amazingly fresh, there is something absolutely magical about the freshness of their burger meat that NO PLACE has ever been able to replicate. \n\nI usually get the Breakfast Burger as my usual but I've tried the 282 Burger and the Billy Burger which are both decent.You'd be surprised that their greek fries are pretty good too.\n\n282 is better than Shake Shack which is better than Five Guys. All of which are around the general area. If you need a burger joint.. go to 282.", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "Delicious hamburgers. Got the Two8Two Burger once and the plain burger the other ... the plain one is so good (the Two8Two Burger's toppings masked some of the beefiness of the patty). One of the tastiest hamburgers that I've ever had.", "author": "Timothy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "This is hands down the best burger place in the area and quite possibly has the most delicious burgers I have ever had.  I always go with the Billy Burger but if you are particularly hungry, go for the Pub Burger.  The fries are also really tasty and I even had the nachos once and was pleasantly surprised.  Once you pair the great food with a nice beer selection, that's five stars in my mind.  Also, if you want a little desert, they have $3 ice cream sandwiches.", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-09", "description": "Great lunch spot if you happen to be on the downtown Brooklyn area. Good burger and beer selection plus free WiFi to boot. Service is attentive and friendly.", "author": "Steve S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "Having crossed the harrowing paths of the tourist-clogged Brooklyn Bridge and strolled for hours down innumerable blocks my majestic spouse and I came to a consensus: we were hungry. With a birthday celebrations worth of drinking ahead it seemed prudent to ignore the offerings of tapas spots and insufficiently heartu vegan fare. So we opted for the optimal step one of an evening spent quaffing with friends: a hearty burger.\n\nIn supremely convenient fashion we were seated immediately at the periphery of the dining area. The ambiance is comfortable upscale pub. I particularly delighted in their quirky wallpaper. In an age of excessively large burgers and mandatory sides of french fries, Two 8 Two offers a solo burger that is manageable yet satisfying. Of course, fries are available as well as delicious onion rings. The burgers  can be ordered with the standard accoutrements; sauteed mushrooms, onions, etc. The \"meat and potatoes\" of the burger world, though in truth the meat and potatoes of the burger world are beef patties and french fries. I digress. Most of the burgers come topped with poblano chilies which are an enjoyable twist in both taste and texture. \n\nFor those craving an extra dollop of decadence they offer the \"50/50\" burger. Half ground beef, half bacon. If you're of the blasphemous order that says bacon is overrated, don't get this. But if you LOVE bacon, this is a fantastic decision. Not only is the juicy, salty, nitrogen rich flavor spread evenly throughout, but you also get the crispy bacon-edge texture in literally every bite, no matter how miniscule.\n\nTo top it all off, a meal for two without drinks came to around $30 with tip, making Two 8 Two a satisfying value.", "author": "Will M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-04", "description": "I could have sworn I reviewed this place. \n\nWent here on a date (and no, not the guy I usually write about) on a Saturday night. It was empty. That should have been the first sign. But it was an off night, the week before Memorial Day, and I had already had a couple drinks, so why not? Besides, one of the Yelp guys I know always talks about this place, so obviously I needed to try it. \n\nI got the Breakfast Burger. It was great, a good, fun burger which had so much potential to be the best thing ever: eggs, bacon, and beef. Here's the issue: I asked for the burger to be rare. By rare I mean I wanted to see blood.  I also asked for it rare knowing that it would come out medium rare - so I would avoid it being overcooked. There is no point in eating red meat unless it still moos. You might disagree but if you do, you are hardly an American and hardly know anything about food. \n\nAnyway, so my burger was overcooked, but my date's was perfect. I almost asked him to switch to see if they fucked up the order. But, they didn't. Just mine. I couldn't complain because it was still a decent burger even if not cooked to my desired temperature. But it was so cheap that complaining didn't matter. This isn't the Spotted Pig, you don't really get to be a snob at Two 8 Two.\n\nThey have an awesome beer list - just freaking awesome - and the onion rings are awesome - huge, fried, and perfect.\n\nI might go back to see if they can fix the burger. 3 stars for everything else - great space, great ambiance, great beer list, great onion rings, and an okay burger.", "author": "Brianne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "Burgers in their garden... What could be better? Had the turkey burger which was seasoned well and had yummy sauce on it. Will be back especially for lunch special.", "author": "Alisa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "I will keep this review short and sweet as there is not need for extra fluff.  This place has Absolutely AMAZING Burgers.  They only have a few options, but they are all awesome.  My go to is the Breakfast burger which has a fried egg, bacon and cheddar on a juicy patty.  They only have craft beers on tap which could be a good thing or bad thing but overall the place great.  Wait staff is pretty nice, a bit hipster but cool.  I would go here every day if I could.", "author": "Mark G."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}