{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-04", "description": "It makes me so sad,\nWhen I should be so glad,\nTo give 282 a high score,\nTheir burgers are ace,\nStick those yum fries in my face,\nI should have left wanting much more,\n\nBut there is an evil that lurks,\nIn the form of rude jerks,\nA disease with a powerful punch,\nIt's sarcastic and rude,\nLambasting and crude,\nWearing black skinny jeans,\nGot a hunch?\n\nA Brooklyn epidemic,\nA trend, a pandemic,\nIt's awkward, unprofessional and weird\nWe have all seen it move,\nPretend to be smooth,\nIt's the curse of the server with a beard. \n\nIf he has a beard,\nAnd you want this raw or that seared,\nHe will snarl and make you feel small,\nHe will cut off your hair,\nKick you right off your chair,\nAnd to the bathroom will force you to crawl,\n\nThe server clean shaven,\nOffers light and safe haven,\nCompared to the beard working here,\nHand that guy a razor,\nRemove that aggressive tongue laser,\nAnd a pleasant experience could appear.", "author": "Lu W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-15", "description": "\"You think it's weird, right?\" the manager demanded. \n\"No,\" I said.\n\"No,\" my friend said.\n\"It's a little weird,\" my other friend offered.\n\"It's weird, right?\" the manager asked again. \"For a burger place to not have barbecue sauce, right? We have ketchup. We have sriracha mayo. We have honey mustard. But it's weird, right? No barbecue sauce.\"", "author": "Jeremy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-14", "description": "I had high hopes for this place but I just thought it lacked a couple of things. First  the food seemed to take a really long time and it didn't seem too busy,  but I could be wrong. The next was for the price NO fries and the burger was pretty small. I got the breakfast burger which if you get it ask for the egg sunny side up or over medium. Mine was cooked hard so no drippy yolk which in my opinion really makes the difference.\n\nAlso I got the blood mary which was good just didn't seem worth the 10 dollars.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-19", "description": "The food was great. I ordered a breakfast burger and Greek fries. Wow. Flavor was incredible. The staff at the bar and on the floor ruin this place. They are more interested in chatting with themselves than interacting with the patrons. They make you feel like there is an inside joke that excludes you. I sat an observed this for some time. They are more interested in their own click than you. My suggestion come for the food leave because of the staff.", "author": "Kyle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "Met my friend there for early dinner... had a really simple burger very flavorful with a side of onion rings which in my opinion were too crispy ..not big on beer but ordered the blend cider, that was pretty good. Cool spot for something quick and easy ...there were a lot of people around 5-30 and 6 ...as a visitor in town seems like a ideal place", "author": "Karina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "Everything is fresh and yummy. We just tried lunch across the street at boomwich, and it was so lousy that we came over here. We would definitely come again. Everything fresh and yummy. \n\nGreek fries are great (feta, oregano, oil on top of those yummy fries with raw edges)\n\nGreek salad is good, and the burger with cheddar \u0026 and egg is yummy too.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Love their burgers! The place is super low key with a cool, chill vibe...exactly what you want in a burger joint. I love the simple pre-set burgers on the menu they're exactly what you would put together were you building them on your own so it takes alot of the thinking and headache of instruction out. (I personally hate going to places where I have to detail every aspect of what I want in my food....). The Two 8 two sauce is sweet and delicious in every bite so make sure they smother it on. My favorite item on the menu is actually the blackened chicken sandwich which comes on their basic soft bun. I remove the lettuce and tomato and get cheddar, pablano peppers and two 8 two sace..  delicious! Don't let them sell you on the Greek fries though, they're not great and unnecessary jazz up perfectly crisp fries...", "author": "Maria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "With a bar in the front, a cozy dining area in the back, and a solid burger menu to boot, Two 8 Two was an easy dinner choice for my girlfriend and I last night. It was a little awkward when three of my students and their families showed up at the neighboring tables at the same time our cocktails arrived, but a few sips in, I managed to forget about them. She ordered the Cuzco Fizz, which was strong and tart enough to cause our lips to pucker after every sip. My own drink, the Across Smith Street, was just as strong but sweetened with the help of a splash of pineapple juice. Not long after, our burgers were ready. She'd gone with the two8two burger figuring \"anytime a restaurant puts its own name into an entree, it must be good\". Though a little small for my taste, it was a decked out burger with roasted chiles, cheese, and a dribble of their signature sauce. My own choice, the veggie burger, arrived with an unusual presentation. Apparently, the patty was too big for the bun so they cut it up into slices and stacked them on top of each other which made for a pretty tall burger once the tomatoes and lettuce were added. I was already mentally drafting notes about the erratic presentation but it was all squelched by the first bite. \n\nThis was a damn fine burger. \n\nThe patty had been nicely seared on the grill so there was a delightful crunch with each bite, and I have no idea what they put into that signature two8two sauce but it was tasty and reminded me of the sauce slathered in Big Macs...in the best way possible. Along with their thin-cut, skin-on french fries, this was a truly good meal. And if I can say that about the vegetarian burger, I'm sure they know their way around their meat options too. \n\nService was spot on, with our waiter checking on us neither too much or too little and topping off our water glasses whenever they ran low. The only drawback I can think of is that pickles do not come with your burger, and asking for them will get you two spears of pickles and cost you an extra 50 cents, as will as extra lettuce and tomato. But, folks, this is Brooklyn Heights, where even breathing the air will cost you something. Other than that, we enjoyed a great meal here and would definitely return again.", "author": "Jane I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "\"You shall never find a more wretched hive of scum and villainy.\"\n\nThe best place for swill in Cobble Hill.", "author": "L A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "For a first timer in the city found this spot on Yelp and it didn't disappoint.  Visited in the late afternoon /early evening hours.  Staff very friendly.  Sat at the bar and had Arlo as our server  and bartender.  He was awesome! The food came out in a timely manner and the food was great! Will come back again on the next visit.  Thanks for a good experience.", "author": "Jordan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Thanks TJ for making us feel like locals. See you next time we are in town. \nBreakfast burger! Yes!!\nGood music, friendly patrons.", "author": "Robert D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "Having recently moved to Brooklyn, I was out exploring. Came across this place and decided to check it out. It is apparently a pretty popular spot, but luckily not too busy around lunch (even though it is a holiday).\n\nI decided on the lamb burger, because I had not had one in a while. The promise of tzatziki was too much. If I had one complaint, it was that the burger was a bit over done despite asking for it medium. The tzatziki was perfect, providing just enough tang and moisture.  The fries were satisfyingly addicting. I also liked that the staff were friendly and attentive, entertaining my I-just-moved-to-Brooklyn questions, and being super helpful, which made for a great first day here. \n\nAnother meal needs to happen here, and soon!", "author": "Sarah-jo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Have been there twice in the last month...burgers are phenomenal! Try the poblano pepper topping if that's up your alley, it was yummy. Good date spot. The shakes and fries are great too.", "author": "Lisette R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-12", "description": "Food was pretty but the service was horrible. I went on a not too busy Saturday evening. Ordered burgers and fries and drinks. The drinks NEVER CAME. REPEAT..the drinks NEVER CAME ! I didn't say anything to see if it would appear on the check and sure enough they did. They were nice enough to remove the drinks and give on order for free. The busboy that cleared the tables was ridiculously lazy. We had to hand him each plate. Food is good service is really bad.", "author": "Raine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "The turkey burgers are fairly simple yet delicious, and priced right. They carry a decent number of beers on tap and the bar staff are friendly. Great neighborhood spot for grabbing food and watching a game.", "author": "Kaveh P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-04", "description": "I've been meaning to come here for a long time. I actually made my way over after Hurricane/Superstorm Sandy. It was packed since it was one of a few food places open on the block. Food service also took out bit longer than usual, at least according to the bartender.\n\nI ordered the signature burger. I must say, the meat was good, but it was a bit on the small side. The chilies on top made it a little bit slimy and only added incremental flavor to it. Also, for $9, it came with no fries on the side, which was a little bit disappointing. They also only give you ketchup in tiny cups.\n\nI also tried the sweet potato fries. They were a little soggy and could use more spice.\n\nAll in all, I would return to give them another shot when it's normal. It's a great atmosphere and I would try one of their other burgers.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Absolutely delicious burgers!\nI had the billy burger (fried onions, cheddar, house sauce) and sweet potato fries. Husband had the breakfast burger and fries. We were blown away by how great the food is.\n\nVery straightforward and inexpensive. If I wasn't pregnant I would have loved to sample some craft cocktails!\n\nService was fast and effective. Our waters were refilled multiple times! All in all a great dining experience!", "author": "Nina G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-07", "description": "Burgers sucked  I also felt rushed. I won't be going back. Try the burger club, if you don't mind traveling and are looking for a really good burger.", "author": "Jen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Come here all the time-- it is super convenient to where I live. The food is always fresh and the service is always really quick and great.", "author": "Halle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "Its was a cold, wet miserable night, but well worth getting drenched to re-visit. \nMy second visit and was not disappointed . Great pub burgers and cocktails. \nThe protein burger was fantastic, and is now my preferred way of serving home-made burgers.\nThere is something about the texture of beef in NY that is different to Australian beef and its something that I enjoy each time I   head back to NY.\nHis Lordship had the lamb burger and we all indulged in a side of fries.\nThe cocktail menu is varied and presented well. The white wine needs to be chilled. Apparently they hadn't put the wine in the fridge until late in the afternoon.\nThe quality of food is consistently good excellent value for money.\nWill be on my to do list again.", "author": "Susi R."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}