{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "What a great burger!\n\nI wasn't hugely optimistic about this place for some reason (why am I so skeptical all the time?) but I had a hankerin' for a beer and a burger one weekend afternoon and moseyed on in. I do like the wooden bar -- it's just an inviting place to belly on up and enjoy your burger and suds. There's table seating in the back for the families and groups.\n\nSo, I ordered a strong IPA (good, medium sized beer list), a Two 8 Two burger, and a side of fries. The bartender was very friendly, took my order right away, and even though she was bs-ing with the waitstaff a lot, it wasn't annoying at all for whatever reason. I managed to get in a decent jab myself. No hard feelings?\n\nOK, so the food. When the burger arrived, I probably raised my eyebrows. It looked really good. The Two 8 Two burger has a hash of charred chiles, onions, and a savory sauce of some kind on the patty, with a bit of well melted cheddar acting as a kind of adhesive in between. It's not one of those freakishly large hamburgers, which is a big plus for me. You won't walk out wanting to kill yourself or cut the thing out of your belly with a knife.\n\nThe beef patty, cooked to the requested medium, is actually fairly interesting. They obviously are very gentle when forming it, as it is pleasingly delicate -- almost crumbly, but not quite. I hope they don't neglect this technique, because it really makes the burger. They say they get daily deliveries of the ground beef from local butcher shop Los Paisanos, a personal favorite of mine.\n\nThe roasted chiles and onions on the Two 8 Two burger work really well with the cheddar cheese, and don't make things soggy or anything like that. The mild heat is very pleasing and it's a great alternative to your standard lettuce-tomato-onion combo, which I actually plan to order next time, just because I reckon they do that right, too.\n\nThe bun is a standard hamburger bun. NOT brioche. Why in the hell do people use brioche for hamburgers? Use a hamburger bun. Two 8 Two understands this, and they've selected a mighty fine hamburger bun to use.\n\nI guess some people aren't hot on the fancy fry toppings offered. I feel little sympathy, and it's a pity they're even on the menu. The only acceptable topping for fries is salt. (Unless you live in San Diego or Montreal.) I got the regular fries and they were really good. They are clearly made from fresh potatoes, fried in clean oil (I'm actually kind of sensitive to the oil stuff is fried in -- I can tell if it's old and nasty), and amply salted. They give you more than you should finish, but I let it slide, because I'm not the biggest dude and the cook may not have had the chance to eyeball me before cooking my portion.\n\nAll in all, this is my burger joint in the neighborhood, and I've tried them all. It's really casual, the seating choices (bar, seating area, garden) are comprehensive, their burger is just terrific, the beer list is typically good for this neighborhood, and the service (at least the two times I've been there now) has been quite fast.", "author": "Jeffrey W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-19", "description": "It's a very very messy burger but it's pretty good. It almost reminds me of a sloppy joe and I kind of wished I got more than one napkin.   The burgers are also on the smaller side and reminded me a bit of shake shack (which isn't a bad thing) but I didn't get the feeling that I am eating a high end gourmet burger - which has been the case with some of the other new places in the 'hood.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-17", "description": "Delicious burgers day or night with french fries that seem to be laced with nicotine. I've stopped here for a quick late lunch and for happy hour and have been very pleased by some satisfying burgers. At first, I felt like the burger looked small. But it was more than enough. I've had the Billy Burger with bacon as well as Two-8-Two. Try them all and try them often.", "author": "Christine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "Awesome spot.  Simple menu done right along with a nice upscale bar atmoshpere.  282 burger awesome.  Shikhaus dogs were awesome too.  I dont think I've had them anywhere else in NYC.  We sat outside in the garden.  Great picnic tables.  Only downside to finding this place is my bigger waistline... food is that good and Im going back on a regular basis.", "author": "adam d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "Really good burgers.  I love burgers since I worked at a burger place for 6 years and am pretty picky when it comes to them.  I got the signature burger and it was amazing.  Perfectly cooked (most burger places over cook them) and just the right amount of spice with the peppers.  My only complaint is that the bun gets soaked through very quickly so it completely falls apart by the third bite.  I had a bite of the hot dog also and that was very good as well.  I like the ambiance and the servers are very nice.", "author": "Mason S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-09", "description": "Really good and juicy burgers and a good atmosphere.  The onion rings are outstanding and they have a good beer selection.  I generally get the burger with the 2-8-2 sauce and hot peppers, although that plus onion rings plus bites of friends' fries plus beer equals way too full.", "author": "Nikolai S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-07", "description": "This place is the perfect Beer and Burger spot. My boyfriend and I stopped in last Friday and were taken care of by a great staff from start to finish. The atmosphere was comfortable and the food - amazing. One of the servers accidentally dropped no more than two fries on the floor when bringing them to our table and brought us over a whole other plate of fries to make up for it! Great service and delicious food. We'll be back :)", "author": "T. K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "As random as my life is, I stumbled into this place after getting frozen yogurt w/ amigos on Sunday night. I was initially brought in by a sign that said, \"Lamb Burger\". Unfortunately, there weren't any left and I was very upset. In addition, they also ran out of stout. Thankfully, a very kind and witty bartender Melissa (Tijo) apologized for the innconvience and suggested grabbing the Egg - Bacon Burger and a solid IPA. I agreed and decided to go w/ the flow. Few minutes later after 2-3 great conversations w/ our super cool bartender Melissa we ended up getting our food. The burger was AMAZING!!! Definitely in my top three burger spots in BK! I'd recommend it to anybody. Customer service is also genuine and helpful.", "author": "Jason K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-04", "description": "My husband took me here today because he tried it for his first time last night and loved it.  I really liked my billy burger that i ordered!  The sweet potato fries were really good too.  And the staff were really nice and friendly.  We will be there a lot... =)", "author": "Peggy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "Super-tasty burgers! My husband and I both ordered the two8two burger medium rare, cheddar cheese, roasted poblano peppers, with a yummy, spicy mayo type sauce on a soft, toasted egg or potato bun.  Orgasmic.  We had chills. Sweet potato fries were delish - can't wait to try their hot dogs and onion rings.  Great service, very friendly.  Looking forward to hangin' in the back garden on a warm night!", "author": "Darolyn G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "Yummm, really good burgers, I had a veggie burger, my husband had a breakfast burger, I think it was called. It had bacon and a fried egg on it. Both were delicious. Like others have said the atmosphere is a little lacking. The walls are bare, but I can understand since it is a brand new place. We also split an order of sweet potato fries and regular fries. Everything was really good. It's not cash only! (yay)", "author": "Teresa F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-22", "description": "I can't review it well for the burgers, as I am on my Veggie/Vegan flow. However, my boyfriend seemed to enjoy his beef and my veggie burger was fresh and delicious, nothing too complicated that makes other restaurant veg burgers gross. and mmmm the the *Sauce* and *grilled onions.*\n\nMy only complaint was that I asked the waiter if he liked the fries, and how great are they? and he replied \"I like them a lot, and they're popular.\" Now although they were cooked very well, I found them boring: no crinkly extra crispy shape a la shake shack, no seasoning that you can find on some amazing shoe strings. and just the ketchup on the side... Next time, mayo. Even if it is a dairy-cheat.\n\nAlso, and this is to all burger joints in the NYC, if you're not gonna give me an extra thick slice of cheddar, offer me something stronger,(pepperjack?goat?) or offer me something simpler (perfectlymeltyamerican?). The extra dollar isn't worth cheese that is nonexistent in the flavor profile of perfectpatty, specialsauce, uniquebun, and optional L/T. Thanks.", "author": "Jill R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-05", "description": "Good eats, atmosphere, nice beer selection/full bar, def a step up from your average diner or sports bar. My go to Brooklyn burger spot.", "author": "David L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-08", "description": "Price is nice.  Classic burger's a burger.  Nothing amaze.  Actually felt kinda tired.  I like a nice glass of deep ruby red wine with my burger.  I know it's more a beer joint, but yeah. Stay away from the cab. But there's pickles!  Location's easy for downtown Brooklynites looking for casual dining on a lazy Sunday.", "author": "Jumma M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-04", "description": "Popped in here with my picky eater son Alex mainly because they had a kids Menu, which was hard to find round the corner on Smith. I wanted a cold good beer, which is very easy to find in that hood. O was pleased with the beer selection, the atmosphere, although it was a little too generic for my tastes. I had the turkey burger with their special sauce and it was very tasty. The fries, which came with my son's grilled cheese, were perfect. Wasn't happy with the shredded lettuce sitting next to my burger (???), but I had little to complain about. Walked out of there having spent only $25 including tip to feed me and my kid. And I had a crisp Sixpoint Bengali Tiger IPA to boot. Recommended!", "author": "Erik P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "Wow, so good.  One of the best burgers I've ever had (never had those kinds of peppers on a burger before, and did it ever work).  Just great, nice spot a bit away from crowd Smith, nice little patio out back.  We got lucky because we came mid day on a weekday and it was quiet, but this was a great find.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-25", "description": "I have been meaning to try this place for awhile.  Well, I am glad I finally did! The burger was excellent!  I have gone to many places that tout their great burgers or have a great reputation, Two 8 Two has them all beat!  I have already gone back a second time to make sure the first time wasn't a fluke, it wasn't.  When I want to go out for a burger now, Two 8 Two will be my first choice.  Brought a California friend who always raves about In and Out Burger and her response after the first bite was 'Oh My God, it's delicious'. The service was also prompt and friendly and the prices were definitely fair for the quality being served up. The fries were also excellent, both the regular fries and the sweet potato fries...I haven't tried the Chili Cheese Fries yet, but I am sure I will in the near future.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "Yum!  BoCoCa has lots of burger options, but this is the best.  Delicious burgers, good beer and a nice garden.", "author": "Virginia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "solid burger and a good bar.  not worth making a special trip for, but a good neighborhood place.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "went here based on yelp recommendations, and boy was i glad i did. the billy burger is fantastic, has so much flavor. the patty was oh so juicy, fresh, and flavorful. i'm a fan! it is a bit on the small side, but with a side of sweet potato fries and a beer, it made for a nice president's day lunch", "author": "Gennady K."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}