{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "Was ok. While I am not really a burger person, the selection seemed good. I got the nachos which were soggy enough to need a fork. The burgers were served wrong... Ie they switched those who wanted well and rare, which of course was not caught till after bite, and the med wells were all well done was the consensus. However! However! They did let us order happy hr drinks 5 after the bell did toll, so that was nice. Good place. Mixed bag, tasted good but service was a bit scruffy.", "author": "B. A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "A bit pricey but worth it. I'm a firm believer in getting what you pay for. The price you pay includes a comfy atmosphere , great staff and a delicious burger.  Did I mention the greek fries?? The best!  Even the leftovers I brought home kept well and still had loads of flavor and taste even after being microwaved.", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "Two 8 Two is exactly what this part of Brooklyn needs and deserves. We don't need another boutique or baby shop or pet shop (no thanks, PetsMart, even though I have a dog) or 'artisinal' whatever shop. We need a burger and beer shop! And we have a stellar one now!\n\nThe burgers are excellent, all of them that I've tried, and all cooked to perfection (you don't have to specify 'medium', 'medium-rare', etc., and there's a beauty to that). So are the hot dogs. So are the nachos, fries (not so much the Greek fries, mind you) and onion rings. Great beer selection and brilliant cocktails/spirits/mixed drinks.\n\nI would suggest sitting and ordering at the bar, though, as the table service can be inconsistent (save the most dedicated and conscientious bus service). Also, no pickles, hello? Plus, if you do the maths, you save a few bucks by ordering the basic burger and adding toppings a la carte instead of splashing out on the 'Pub Burger', which is delicious nevertheless.\n\nFinally, yes, decor. It feels a bit too much like a place that's just opened after having ordered all its furniture and decor from a restaurant-supply catalogue. I second the other reviewer's note: where's the character and charm? You get it from the staff behind the bar (and the stellar busperson) and the food itself, but it could use some more local, aesthetic flavor.\n\nIn all, I'm Two Hundred and 82 time sold on Two 8 Two!", "author": "Niall B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-03", "description": "mehhhh\n\nThe portions are small.. I live right next to moo burger and they offer a better portion for almost the same price.\n\nThe burger was good though.. no complaints about that...\n\nI don't know if I will be making the trip to two 8 two anytime soon...", "author": "Sera A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "One of the best burgers I've had, hands down. The staff are always friendly and the service is quick and efficient. Outdoor patio is great for a nice afternoon or evening...prices are also great and more than reasonable. Make sure you douse anything you get in their signature 282 sauce.", "author": "Mike R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-17", "description": "Awesome burger! The two 8 two sauce is very similar to In-N-Out Burger which was awesome. The beer selection is perfect. The outdoor patio in back will become a regular haunt for me this summer and fall. You can get a burger fries and a beer for $15. Can't beat that in my mind. I would put this burger up against Corner Bistro, Shake Shack, and the rest of the front runners. Really, an awesome spot. I can't wait to go back.\n\nThe design of the bar itself is cool too. Good tunes playing, nice hardwood and earth tones. Everything is done very well. GO THERE!", "author": "Tim M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-18", "description": "The food was great. The atmosphere was awesome.  Sadly, the service was horrible. The servers had an awful attitude after the kitchen messed up the order and actively tried to persuade our table to accept a burger we didn't order. There was no apology, no offer to fix the mishap. After placing the request for the original order the server had an awful demeanor, as well as the audacity to drop off the check at a table of 6 with the words \"don't worry guys, I already added the tip into the bill.\" NEVER GOING BACK TO THIS HOLE IN THE WALL.", "author": "Christopher V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Came back as the burgers are so addictive: go for the 282 burger or the billy burger. The Greek salad is a great side to share for the table too.\nStaff was very helpful and attentive to all our small requests! Great to have in the hood.", "author": "Nif R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-24", "description": "It will do.  Their house burger is quite good and not just a rehash of other burgers available around town.", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-18", "description": "I have to say I'm surprised all these reviews are so positive. Yes, my billy burger was pretty tasty. my fiance went for the two8two burger - which is 9 bucks - and ate it in three bites. It's not that he was starving, they're really THAT small. And for $9 bucks, did his burger come with fries or a salad? NOPE. A little bread plate with a little yummy burger - which would be totally cool if it wasn't so overpriced. \n\nmy fiance put it nicely when we got real burgers a week later at Black Swan - \"a good burger shouldn't fit in your mouth.\" plus Black Swan throws in a huge chinese take-out container of fries. for the same price.\n\nAlso, the drinks. $10 for well rum and a mix of watered-down juices - called \"rum punch\" - tasted like something you'd make from whatever you found in your dorm room back in the day on the way out to homecoming. Not tasty, not worth $10. And that was his drink. I got a glass of the Alamos Malbec for $9 - which coincidentally is the same price as a bottle anywhere else.\n\ni promise we're not cheap - we go out a lot - this place just isn't offering the goods for the money. we won't be back.", "author": "Jody W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-01", "description": "I live nearby and have been meaning to come here for some time -- at least to try the burger.  I believe I went here on opening night just for a quick beer and liked the vibe.  Finally got around to trying the Two 8 Two burger.  Well, I pick it up and it breaks in two.  Yeah.  I had to settle with eating it with a fork and knife.  I mean, I know the ingredients are quality but I just wasn't super impressed with it.  It was just a decent burger.  Kinda wished the bun was a bit more flavorful too - as opposed to your very typical hamburger bun.  This is Cobble Hill / Carroll Gardens.  There are a bunch of excellent bakeries here for good bread.  The patties come from Paesano down on Smith.  So they do know the neighborhood!\n\nI'd definitely come here for some pints, since the tap list is good and the vibe at the bar and in the back patio is excellent.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "Best burgers ever! I always get the Billy burger with bacon. The flavor is always consistent (been here over 15 times).. the burger is very juicy and juicy. The Bloody Mary is also very delicious.. highly recommend if you are craving a burger :)", "author": "Linda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "It's our favorite burger in Brooklyn.  It's excellent. The meat and bun are perfect.  Full and juicy without feeling greasy.  Incredibly beefy.  Fries good.  But it's about the burger.  They use the Paisano's burger blend (I think) which we make on the grill all the time.  But it's better here.", "author": "David W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "I waffled between giving Two 8 Two three stars or four...but then I had a salivary flashback to the flavor of my hamburger, and went with four.\n\nThe concept behind Two 8 Two is great; An upscale bar vibe with good beer and wine selection, creative cocktails, AND a simple but tasty burger menu. Yes, the food was really good -- I had a small Greek salad, which was par for the course, and a hamburger with grilled onions. For some reason, I expected the burger to be larger -- but that's probably an American \"portion size issue\" -- but the beef was extremely well-seasoned and cooked to perfection. \n\nMaybe because we were there on a Tuesday night, but I found the place lacking in energy and ambiance. Even though it is a nice, clean, friendly spot...I wasn't compelled to sit back, relax, and enjoy a few hours of drinks after my meal. That said...the burger was awesome, and I'd love to try another one on a Friday night when there's more of a hum in the air.", "author": "Katie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "Very solid burgers. Other than the differentiating facet of poblano peppers (which work pretty naturally as an accompaniment), they're more along the lines the slimmer, simpler style you might find at Resto than the cholesterol bombs that are in vogue at Henry Public, etc. \n\nRefreshingly, the restaurant is also less pretentious than most of its competitors. Neither the waiters nor the clientele had muttonchops. You can get in and out of there pretty fast. It's not a big production.\n\nThey do have some kinks to work out. The place is so new that it literally had that woody \"new apartment smell\". Heat needed to be turned down. The dining area in the back needs more in the way of decor.\n\nMore importantly, the menu is VERY limited for the time being, which is a little bit of a problem because the burgers are svelte enough that a hungry traveler will probably want an appetizer of some kind. But they're supposedly adding more options soon.", "author": "Nate S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Get the two8two burger med-rare. Onion rings, side of mayo. The best burger I've ever had. Was in Brooklyn for a day and I'm a burger snob... this made me have an out of body experience. No words. Wow.", "author": "Chadwick V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "Great burgers that are interesting without trying too hard and a nice, discreet cadre of draft beers.  For phase one of a brand new place, they're really firing on all cylinders.  Can't wait to see what happens next; I'll be first in line for the brunch menu this weekend.\n\nReally fun vibe - it's like being around old friends but at a nice bar/restaurant instead of your living room.  Bartenders and wait staff are good folk - fun and attentive.\n\nI'm a local and it's a genuine treat to find a new favorite hangout.  The area in general has a lot of different choices for all kinds of sensibilities, but this is a rare find where it's hard to feel out of place.", "author": "Tom C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "This place just recently flagged on my food radar.  And it probably would never have if I weren't playing around with my mobile Yelp app.\n \nHow I discovered it? Is irrelevant.  What matters is I did, with my short review.\n \nRestaurant.  In itself, average in appearance.  Nothing really stands out, and nothing offends you.  Well, maybe except the feeling of knowing it will be a quick meal with no reason for sticking around.  \n \nThe two friends I came with all ordered the Two8Two burger.  This burger of theirs is simply finger lickin good.  Perfectly cooked, well seasoned on its own, but with Poblano peppers on top, drizzled with their special Two8Two sauce...you momentarily lose your breath as your taste buds climax...repeatedly! It was that good.\n\nHands down, I consider this as one of the best burgers I've had in my past. But at $9 a pop, you get a small patty on a small bun with zero sides. My friend not caring about his cholesterol levels had to order seconds.\n\nPersonally speaking, I would rather pay $10-$13 dollars for a larger patty and a side of fries or salad.  This should work out in their profit margins.\n\nOther highlights are their Spicy Bloody Mary with bacon salt covering the glass rim.  Be careful with the heat and your throat locking up.  Otherwise, it's a damn good drink.\n\nI'm pretty certain that anyone who tries his or her burger will leave very satisfied.", "author": "Alen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "I am a burger fanatic, so when I heard about Two 8 Two (what a great name), I hopped on the A train and headed to Atlantic Ave. I wished I lived closer to Two 8 Two to make it a regular haunt for me. Our waitress was friendly and our food came out quickly. My burger was juicy and well seasoned, and I was happy to find they use shredded lettuce--what fun and how crunchy. I see Two 8 Two as a great beer and burger place/bar, and they seem to be busy every time I walk by.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-01", "description": "At first I wasn't going to do a review of this place seeing as I'm not a burger eater and I stick to veggie and turkey burgers.  However many people are raving about the turkey burger so now I feel somewhat entitled to an opinion.  And that opinion is that it's just okay.  No complaints really, but I get the same quality out of the turkey burger at goodburger... and the fries are better there too.  I'd go back to this place for sure... but only because it's one of those neutral low key no fuss spots you'd go to to hang out with people.  They had great drinks and a nice atmosphere and good prices.", "author": "Ajay R."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}