{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-12", "description": "Burger was really delicious, but super small. I got the Billy Burger. There is another burger on the menu that is exactly the same but with bacon, and it's $5 extra. If you just ask for that with bacon, it's not $5. \n\nWine was not good, but I guess that's what I get for ordering wine from a burger joint. \n\nOur waiter was not particularly friendly, at all.\n\nWould go back if I was in the area.", "author": "Pook V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "Two thumbs up  We came here last night craving burgers and were not disappointed. I had the Pub Burger w/out the two 8 two sauce and my boyfriend had the 50/50. The food was tasty, burgers cooked perfectly \u0026 great fries. My only complaint is that the tables need to be reconfigured, I could have sat in my neighbors lap. Great local spot we'll be back for more!", "author": "SK H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-06", "description": "The burgers were good BUT they are about the size of a White Castle burger.   Little expensive .... 2 burgers - 2 sides -2 beers .... $55.00!!!!!!!", "author": "Anita M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-30", "description": "I'm a fan! \n\nFYI- only been here once, but this is a first impression review. \n\nMy burger was delicious and not a bad price ($7 for a Billy Burger- cheddar cheese, grilled onions and two8two sauce). Twas a bit small for my liking and I ate it so fast I don't really remember the two8two sauce. :( I also tried the fries with feta and oregano (thanks  Jason G). I do think the fries should have a melted cheese (the feta was good but a little strange/dry in my opinion) or some type of hot sauce added. Overall- great meal. \n\nThe burger and ambiance in this place reminded me a lot of the burgers at Plan B Burger Bar in CT (shout out to the Valley!). It also reminded me a bit of Five Guys (which is always a wonderful compliment). \n\nBy now we know I'm a nice reviewer and I tend to give 4-5 stars because I'm typically easily pleased, like to write about positive experiences and like to praise rather than rant and rave (there you go Anthony P). So I'm giving it 4 stars just because I don't like how fries weren't included. \n\nBut- they had Hennepin on tap! This is still a very exciting thing for a CT girl. I know it's everywhere in NYC but I actually have never seen Hennepin on tap in CT, so this is still a novelty for me. $7 for Hennepin also seems like a lot to me but again, I'm a CT girl newly transplanted to BK.", "author": "Paige N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "best burger in Brooklyn. we rediscovered this place a few months ago and haven't looked back since. everything is perfect, every time - from the cook and juiciness of the meat to the toasted-on-the-inside-but-not-on-the-outside bun. the poblano peppers and 282 sauce are absolutely amazing and seal the deal every time. I recommend the 282 burger and the Billy burger.\n\nbest of all the staff is friendly and accommodating, and service is excellent. grateful for this neighborhood joint.", "author": "Barbara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "Finally found a burger place in the neighborhood that is just as good (if not better) and more reasonably priced than Bareburger! \nA+ on the food and prices", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-27", "description": "Came here last night for a late night dinner/snack and some drinks. Bartender got the drink order right. Mine was easy (beer) but my friend's is a bit more complicated and sometimes the bartenders don't really get it. \n\nDecided to start with the fries (easy order) while deciding what else to get. The fries came with a side of mayo as asked for. Many times they forget that. And I don't know if it was because I hadn't eaten all day, but the were delish!  My friend thought so too. I ordered the billy burger and my friend had a grilled cheese with poblano peppers. They came out promptly. The burger was perfectly cooked. The grilled onions were cartelized nicely. It really was what I wanted. My friend even commented how I devoured the burger. I did leave a couple bites for my friend to try and it was agreed that the burger was awesome!  I didn't try the grilled cheese but in the time it was finished in guessing it was pretty good as well. \n\nDefinitely coming back. Although the crowd was an interesting mix...", "author": "Deb W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-23", "description": "To be fair, I don't eat meat.  I came here with a friend that was in the mood for a hamburger.  I ordered what might be the one item on the menu that didn't have meat, a grilled cheese sandwich.  And to be fair, I'm a bit of a snob when it comes to my  grilled cheese.  It doesn't have to be fancy, but it has to be good.  Unfortunately what was presented to me the first time was cold and congealed.  I was going to just suck it up and eat it, but the bartender heard me say to my friend that it was cold.  He said he'd take care of it.  I'm always weary about returning food, especially in a place I'm not familiar with.  But eventually a warmed sandwich came out.  It was ok.  The bread was not crisp, and it really had no taste.  \nI'd suggest sticking to beer here as the mixed drinks seems a bit watered down.  \nOverall, an ok place but I won't be schleping back to Brooklyn just to go there.", "author": "T K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "Food was great! I ordered the 50/50 and it was perfect. I got grilled onions on my burger as well. Their 282 sauce..make sure to get extra on the side, perfect french fry dip!", "author": "Raina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "Cute place -- went here on a Saturday afternoon, not too crowded and there's a patio out back to enjoy the spring weather. The burger was okay (a little greasy) but the sweet potato fries were on point. Also definitely get the blood orange margarita, delicious and only $9.", "author": "Aneta M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "Fantastic burgers! The Breakfast Burger was perfectly prepared and incredibly tasty. The service was great, the atmosphere was comfortable and the beer was fresh. What a meal!", "author": "George F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Had the 50/50 burger and girlfriend had lamb and we each throughly enjoyed each bite. Chili cheese fries were a solid addition as well. Went here again on a Friday just the other night and had a great meal at the bar with a great choice of beers on hand.", "author": "Blake R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "The 50/50 Burgers is awesome and the Breakfast Burger was quite good surprisingly.The chilli fries was a nice addition too.", "author": "Sleepy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "I went here on an off day (Xmas Eve), and in the late afternoon, so it was sort of empty but I ended up running into an acquaintance anyway, which was a good omen.\n\nThe bloody mary I ordered with my burger was interesting - pretty briny with a lil' pickle and all - and I mostly enjoyed it, but the Veggie Burger was off the chain.  Firstly, you MUST get it with the sauteed onions as that really makes the burger pop. The patty that they used isn't one I usually enjoy - it was all veggie and no soy - but the way they prepared it made me lop it all up. The Two 8 Two sauce is another must. It's not vegan, though why would you expect it to be in a burger spot.  The fries are pretty good too - we got the sweet potato ones.  \n\nThe space is very nice too, very comfortable and even homey feeling.  You'll enjoy your time at this spot -- it's definitely worth checking out.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-20", "description": "Lovely room but very noisy. Good deals on drinks. My lamb burger not rare as ordered and missing onions. Good fries.", "author": "chris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-13", "description": "Fantastic! Exactly what you would expect from a burger place. We have been here a few times, and each time it's great! Great beer and drink selection. The 50/50 burger is so juicy and has a great taste it, especially with the poblano on it. The Billy Burger is perfectly cooked- not too big so you don't feel gross after. And the thin sliced grilled onions are a perfect touch. The Greek fries are not too oily and perfectly spiced. It's the kind of place you keep going back to!!", "author": "Mimi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "Had the 50/50 burger medium  well as recommended. It's really good. Side dish. The sweet potato fries. And the burger is not huge. It's well portioned. Greeeeaaaaaatttt.", "author": "Fitzroy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "Very friendly staff.\n\nGood selection of beer.\n\nSimple menu, affordable pricing.\n\nOnly con is small portions...", "author": "Andi V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-19", "description": "Not bad, but certainly not great. \nThe veggie burger is mediocre and they only have yellow mustard. Yellow mustard? What the fuck is this, the 3rd world?!\nThe burger is on a grocery store bun and lacks pizzaz -- this is something I could make at home. \nGo to Bareburger or Building on Bond if you're in the hood. This place is ok, but certainly not worth a trip out of your way.", "author": "Brian R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "as long as you're cool with eating across the street from a jail, this is cheeseburger paradise. the sauce is the best secret sauce I've had and the waiters are on point. they have a cute little outdoor area and a bathroom. the fries are big enough for two. I am still thinking about this burger", "author": "Kelsey W."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}