{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-11", "description": "Came with a group for a quick bite. Casual setting, family friendly restaurant with a bar. Wasn't too hungry so I decided to split an order of nachos with my cousin. The $11 nachos was an $11 cold mess. $11 of disappointment. It seemed as if the nachos were made first, sat on the kitchen counter until the rest of my group's food finished and was brought out all at once. The unattractive dish was placed in front of us. From the cold cheddar cheese, tortilla chips in a combination of both stale and soggy, poor distribution of the beef, to the thin layer of salsa or pico de gallo (couldn't identify)...should have ordered the protein burger. I watched my co-worker enjoy it. Another thing, the hyper waiters would constantly bug us by refilling our waters, even immediately after I took my first sip. I wish my first experience at two eight two was as exciting as people recommended.", "author": "Anthony S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "Well that was fast. Place used to be good when it first opened now it is gross. True the burger and fries are OK but everything else on the menu is disgusting. Onion rings were freezer burned and the milkshake was so sugary I couldn't even take a second sip.\n\nAlso it is just dirty. The tables, if you dare to peek in the kitchen and bathrooms. Ick.\n\nSad because I'm always routing for the local places but this place is being mismanaged.", "author": "Bridget S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-25", "description": "Arrived around 10pm. Visiting from out of town and saw good reviews, lets just say they did not even hit any expectations. We had the worst server ever, we had a better connection with the busser. Ordered burgers and one of my family members asked for a medium well and it turned out to be rare. We waited and waited and our server never came to check on our meal so we flagged down a host and had him remake it, by the time she got it we were all finished and her burger was missing half the egg. Very disappointed.\n\nBesides the service, the burgers were very small and did not offer the best flavor. All around bad experience.", "author": "Sarina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Best burger in town! So delicious and the bun was toasted to perfection!", "author": "Jasmine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "The family and I wanted to get something to eat quick and this place was right around the corner from Petsmart. I was concerned that it wouldn't be kids friendly - WRONG.\n\nSuper kids friendly. At 6pm, almost all the tables were filled with kids of all ages. babies in car seat to tots to older kids. Sweet potatoes fries were a hit with my little tot. delicious burgers and greek fries. \n\nit's half pub/restaurant so my only comment was that the music was loud[er] but it didn't bother me too much as a mom.", "author": "Nancy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Great bartenders. Love the boozy milkshakes - made with rum or bourbon. The are great, especially with cheese on them. Their burgers are tasty \u0026 affordable.", "author": "Steph G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-11", "description": "As the guy at the next table said, \"it's a hot dog and a hamburger... how long can it take\"? This, with the place at maybe half capacity. Well, folks, the answer is around 45 minutes. Which makes absolutely no sense in a restaurant with under a dozen items, all of them being burgers or hot dogs. And the place wasn't even half full. So that was our last time there.\n\nWe were there prior but we never got to try the food. Even though it was full, after an hour and a half of not getting our food and politely alerting our waiter that we needed to be out in an hour and a half from start to finish, we left. In all that time, we never got our food. The waiter was barely apologetic. Like this happens frequently and he just didn't care.\n\nBut we did go back when we had hours to spare and as you read above, it took forever. The table next to us waited 45 minutes for their party of four. Our party of two? Over an hour. Which I could forgive if the burger was the equivalent of manna from heaven. Of course, it wasn't. It wasn't awful but even in my ravenous state, when everything tastes awesome, I was left unimpressed. It was nothing special. Totally forgettable.\n\nAll the high ratings? I'm guessing it's the emperor has no clothes syndrome. Or people who have never had a burger that wasn't fast food.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "Nice trendy place in a perfect area for it, burgers are excellent, decor is very nice for a bar/Resturant. The burger can be a bit bigger for the price considering it's an al a carte menu. Very similar to shake shack but not the quite it. pricey but it's a very quality burger o yes Blood orange margarita very awesome.", "author": "Manny R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-24", "description": "I should have went for the 50/50 burger. The lamb burger was good but not great and the Greek fries weren't the best I've ever had. Not sure why this place is rated so highly it reminded me of Johnny Rockets but without the kick ass milkshakes.", "author": "Brittany R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-15", "description": "After work, a friend decided to take me for a \"great burger spot\" as he would describe it. It was my first time so I was excitied when I saw the layout of the place. It has a seating area in the front, a bar then indoor back seating and an outside patio area. It was getting cold as the night went on so I figured we could sit in the middle. However the hostess told us that it was a four seater and because it was only two of us we would have to sit near the back door where people would be coming in and out from the patio area and still be freezing. The place was half empty and so I couldn't understand why we weren't able to sit there, especially if the table wasn't reserved. Then he moved us to the front window seating and near the OPEN ENTRANCE DOOR to have a seat!! He then told us to seat on opposites sides of one another so there could be more room for others. Again... There were barely people in the restaurant. I put up a fight to sit side by side because I like my space plus it was warmer that way. The hostess handed us menus and walked away. We waited for about 10mins for a waitress or server or something!! No one showed so I got up to walk to the back to ask the hostess was he taking our order and he said he would call our waiter. Our \"waiter\" ended up being the sole bartender behind the bar who was making drinks for a couple. He asked our order and I told him I didn't want to shout it across the room, and I didn't think it was far i hand to stand up and walk to my waiter. So my friend told him what I wanted and guess what... I had to shout it across the room just to confirm it with the bartender/waiter.  The food arrived promptly. the two8two burger was nice, the sweet potato fries froze over before I could finish them. The drinks are high priced and very weak, you get more ice than alcohol. It even took them an even longer time to bring the bill. I had to walk over to the hostess once more and hand him my card. The bill came up to about $80 for one order of nachos, one burger w. fries and two drinks. I could have went to BBQ's  or Buffalo Wing Wild Wings and had better food, a more comfortable seating and stronger drinks that are worth the price. My suggestion, if you walk pass this place. KEEP ON WALKING.", "author": "Dominic M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-01", "description": "You can't say 5 minutes, make us wait 10 with no one ahead of us or behind us and then sit two parties before us. Disrespect off the bat. \n\nThe menu is trying to convince you that there's a variety of burgers, there isn't. \nThere's 6 toppings total, 9 different names and the burger size will vary from 5oz to 8oz. \n\nFries are frozen. \nThe buns on the burgers you could find in key food 4 blocks away. \nA fried egg on the burger will come out over well. \n\nA beer, frozen fries and a burger that's nothing special $31. \n\nHint to the servers , when a party is having a conversation don't interrupt. \n\nTranslation = don't bother.", "author": "Dimitri K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-14", "description": "Went for lunch with my young daughter.  Burger was delicious, but the bun was a little insubstantial. Chiles on the burger is a nice touch.  Fries were a bit plain.  Onion rings were good.  Service was quick and efficient, but space was a little too dark for my taste. \n\nAll in all a good place for Saturday lunch and I'll certainly return.", "author": "Jeremy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-13", "description": "Greasy non-tasty burger. If you sit close to the kitchen you will smell like grease for the rest of the night.\n\nService was poor as well", "author": "Farshid R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "Came here during a break from class, Ordered a Dark and stormy  and the regular two8two burger. My Oh My. the Burger was delectable! Im not usually easily impressed with burgers but it was juicy and omg I only wished there were 4 more on my plate. \nThe burger kicked ass. GO!", "author": "Vito P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "I had heard good things about Two 8 Two a while ago, but I was kind of deterred from checking it out by the name - Two 8 Two Bar and Burger? I get that the name makes it easy to remember the address, but the Bar and Burger part was discouraging, I'm mostly not a burger kind of girl. I finally went though, because it was one of the locations listed on the NYC Good Whiskey Passport, and I was very pleasantly surprised. \nI just went with my husband for drinks, so I can't speak to the food here. The bar was large and surprisingly elegant, with a large selection of liquors on display, and their prices were great for the offerings. My husband got the $5 pilsner that was the night's happy hour special, which he liked, and I ordered an old-fashioned to test the whiskey skills. BTW, you could choose ANY whiskey you wanted if you wanted to do a 1-ounce neat, which I thought was really nice.  And I was really impressed by how much time and effort the friendly bartender put into making my drink, which tasted great. And they don't go the usual super-saccharine maraschino cherries in their drinks either, the two I got in mine were delicious! It might not be a spot I'd want to try for food, but it's nice to find a cool, reasonably priced bar in the area.", "author": "Alexandra K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-19", "description": "Burger joint \nVery simple and basic when you're craving some simple American bar food. Drinks were ok.", "author": "An B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "I dream about this veggie burger with grilled onions. Since I moved out of the neighborhood I crave it all the time. The onion rings, sweet potato fries, and regular fries are all to die for. The food is superb. \n\nThe customer service is horrific. Beyond. I've probably come here 20+ times and no matter who the server is, no matter how empty the restaurant, the servers behave like you're disrupting their stoner afternoon. It's a burger and bar place, so all I'm expecting is the most basic customer service, I'm not under any delusion that I'm at a fine dining establishment. Even with the lowest expectations, they fail. \n\nTo sum up: one million stars for food! Zero stars for customer service.", "author": "C O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "Coming here on a weeknight is a good idea. there doesn't seem to be a large crowd but enough people and still space to stand or sit. \n\nComing here for a burger meal with gf, I order their $12 burger (forgot the name) but I remember it's good and made well. The bun isn't wet or plain and the patty is made the way you ordered. We got the fries with goat cheese but it's a bad idea. I don't really like it because it's simply goat cheese and fries mix together. Stupid idea but watever. \n\nTheir happy hour is awesome with their offering. The beer is light and the cocktail is good for everyone. I will order the bourbon drink.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "What a fun burger joint. We sat at the bar and enjoyed their 5$ anchor drafts. They seem to have daily drink specials! They have a fab list of craft beers and an even more fun menu of craft burgers and hot dog. I had the breakfast burger which features a sunny side up egg on top. My fiancé had a giant chili dog. Both were delicious. If you like feta cheese you have to try the Greek fries! Much yum! \nAmbience is relaxed and casual. They have a little garden out back to eat in too!", "author": "Erin M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-26", "description": "Got a stomach flu I got from a medium-well burger there. I eat burgers (with the same ingredients) often enough and I haven't gotten a stomach flu in over a year, so I'm fairly sure it's not me (being honest).\nEverything else (mood, service, taste) was good, so I hope it's a one-time thing, but it seems like a good idea to let people know =)", "author": "Cameron M."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}