{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-03", "description": "I enjoy this place whenever I come.  The location is dimly lit, bar in the front, with some tables in the back and an outdoor section further in the rear. I had the bacon pub burger i think that's what its called and my fiance had the jalapeno burger. She had the Greek fries and I had the chili cheese fries. The burger was pretty good. Could have used a bit more seasoning, but it was definitely juicy and big. The fries were incredible, the cheese was so tasty on my chili cheese fries and the chili didn't over power the food combination. The jalapeno burger was also good, well cooked with a nice little kick to it. The Greek fries were awesome, with big chunks of feta cheese. The prices were good as well, and it matched what it would normally cost in an area like that. The service was pretty fast, not many people were at the location, so that definitely helped speed things along. \n\nAfterwards, we took our time finishing and just relaxed. It was good to finally eat at a location that doesnt make you feel rushed as soon as you finish your food. The only times the server came to our table was to ask if we wanted more drinks and if we wanted anymore food. We werent hounded as most places. When the bill came, payment was fast as well. We were able to pay and not have the usual 15 minute wait that the area is famous for. \n\nIf you want to try something a bit out of the ordinary burger, you should def try this place out at least once.", "author": "Ivan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "I'm not really a fan of eating burgers but this place is worth to try! Especially when it comes to how cooked you want the burger. I would want well done but since many people ask for medium rare, I usually just go with it.  The staff there are very friendly and the place is usually crowded. I saw many reviews about trying the Greek fries but after getting it, I didn't really like it much. However, I loved the sweet potato fries (since I love sweet potatoes). The burgers were good. You can't say they were the best but it was good. If you want to talk with a group of friends or family and want a burger, try this place.", "author": "Anne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "Good classic Americana burger, no frills and not trying to be anything gourmet, just real old school flavour. Decent value with the lunch special too!", "author": "tom F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "Delicious veggie burgers and sweet potato fries! Definitely get it with cheese.  Our bearded server was very attentive, and vigilant with my soda refills. Will definitely be coming back to this cozy spot.", "author": "Amy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-05", "description": "Two 8 Two Burger and a cocktail to end the evening after a night out bar hopping. Oh yeah. \n\nFirst time back here in quite a while. Burgers still taste good and they have a terrific selection to choose from on the menu. The Two 8 Two Burger is a hamburger with roasted poblano chiles, cheddar cheese and two 8 two sauce. Cooked just right and the chilis gave it a nice kick. Love the sauce. Solid craft beer selection, not super large, but enough here to satisfy the palate.  \n\nThe place was empty the night we wandered in and sat at the bar. Nice friendly bartender took care of us. I was in a cocktail mood and they also feature a nice little cocktail list. I had the  Presidente - rum, solerno, dolin dry vermouth, pineapple juice and grenadine. At $10 it's a decent price for a well made drink, yet I was a bit underwhelmed by this one. Maybe it was a bit too sweet for me and tasted like juice. \n\nI also thought the burgers were a tad pricey for the size that they are. Plus, there is an extra charge for fries. It was an ok meal to end the night before heading back on the subway.", "author": "Phil H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-16", "description": "The food here was solid.  I had a lamb burger and hubby had their 50/50 burger.  We ordered our burgers medium, but his came medium well and mine came well done.  It had good flavor for sure, but it didn't knock my socks off.  \n\nThe cocktails were very good.  I had a Sazerac and hubby had a beer on tap (I cannot remember which).  The service was friendly and our waiter was attentive and sweet.  The ambience was really nice and the bathroom was very clean.\n\nI would come back again if I know I needed a reliable go-to in that area of Brooklyn and I know I wouldn't be disappointed.", "author": "Donysa V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-16", "description": "Burgers are good. Prices are a little high but I guess that's expected in that hood. Service not so good.  For some reason the waiters get very annoyed if you ask for ketchup, reacting as if I had asked for one of their kidneys. Very strange.  Happened a few times that I've been there.", "author": "Annie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-20", "description": "The following are things my girlfriend said to me during a recent meal at Two8Two. Please note that she has never been wrong. Ever.* \n\n\"I like the look of this place. It's simple, but well done.\"\n\"What an awesome little garden!\"\n\"I love that they get their meat from Paisanos! That's our butcher!\"\n\"That server rocks! He didn't have to let us know happy hour was ending.\"\n\"You are the pinnacle of manliness. I don't deserve you.\"\n\"Mmmm...mojito.\"\n\"This is the juiciest burger I've ever eaten.\"\n\"It's the perfect size for me.\"**\n\"I think the onion rings are frozen, but they're still OK.\"\n\"That two8two sauce...I want it on everything.\"\n\"Your breakfast burger is exactly what I want when I'm hungover.\"\n\"You're so handsome and charming it's intimidating.\"\n\"That egg is so runny and messy and good.\"\n\"These burgers are like Shake Shack, but better.\"\n\"We should come back just to drink in the garden. And then we'll probably have to eat these burgers again. And again. And again.\"\n__________\n\n*Just ask her.\n**Please note that she likes them a bit smaller. I'm talking about burgers, people, keep your jokes to yourself.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-17", "description": "Beer. Burgers. Brooklyn. What's not to love?\n\nI was lured here at the mention of a decent happy hour (they have two $5 beers on tap until 7) and though initially disappointed without a cocktail option, I was later pleased with a damn good burger and sweet service.\n\nI always get things named after the restaurant if they're available, so this trip led me to have the Two 8 Two burger with some sweet potato fries. Both amazing, and grilled to perfection. Even the burger bun was incredible, something that is often an afterthought for owners.\n\nTrust the reviews, the burger really is as juicy as advertised. Glad to have a super spot in my 'hood!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "This review is from 2013 - re-posting here as the original forum I used is no longer online.\n \nI never thought this would happen to me. When I first started reviewing burgers several years ago, I was certain I would never give a perfect 5-star score. I felt it should be an aspirational goal for burger makers everywhere...the perfect burger, impossible to improve. A five star rating for me was more a concept along the lines of Plato's forms, an aspatial, atemporal abstract of an ideal, a blueprint for perfection, unattainable in this fleeting and imperfect world. I was wrong, oh so very wrong. These words do not come easily...I visited this establishment last Tuesday and have spent sleepless nights of self-doubt and struggled with a gnawing sense of my own mortality and flaws. This burger changed my life. I have racked my mind, tastebuds and soul for a way in which it could be improved, and it cannot. The meat is exquisite, fresh ground, loosely packed with the perfect blend of fat and protein. The bun was perfectly toasted and in no way too much or too little for the burger and toppings inside. The cheese and toppings themselves were first class, fresh and flavorful. I started with their namesake two8two burger and it was simply wonderful but I considered the possibility that I was overly impressed by the house sauce and toppings. I dived back into the fray, selecting a simple cheeseburger as the ultimate test; giving the burger no room to hide, a chance for pure and true expression of its essence. The second burger was somehow even better. These two burgers may have ruined me. By expressing and flaunting taste bud perfection, I fear this place has murdered my burger tasting future. What will compare...how will I justify the next $10+ burger that doesn't even come close? I have tasted the metaphorical apple from the tree of knowledge and am now a fallen man, with too much knowledge for my own good. Buy this burger at your own peril; perfection made reality is a dangerous thing.", "author": "First L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "I'll sum it up;  the best burger i've ever had.  The 282 burger with bacon.  \n    I hand grind and grill burgers often at home, and I was blown away by the blend they use here.  There must be some secret ingredient in there, its that good!", "author": "Walter S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-03", "description": "This place literally stinks. The kitchen was pumping out full on greasy fumes. I couldn't stay.", "author": "Y R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "My sister and I came here for a late lunch and it was delicious! We both got the turkey burger and split an order of fries. We were able to sit outside on the back patio since the weather was so nice. The only negative thing I could say was that the turkey burger was on the smaller side - about the size of a McDonalds hamburger. I could probably eat two they were so good. Definitely coming back!", "author": "Mikayla M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "Quick review: This is the kind of burger you want to eat! So good. So consistent. The type of burger you crave. So lucky to have it in the hood. \n\nHighly recommended.", "author": "Darryl S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "This is the best burger joint in Brooklyn. Try the Billy burger or the Pub burger. Consistent every time with everything on the menu.", "author": "James S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "The ambiance is really Brooklynish, stylish chic and effortless. Not too crowded on a Saturday evening. I order onion rings and the breakfast burger which has eggs and bacon. Really Delicious. My friend had a lamb burger with  fries. She said it was perfect and she rarely eats lamb. Everything just really good including the wait staff.  Definitely a place to chill and eat", "author": "Adriana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "I loved the lamb burger - delicious juicy party with a very thin bun. Highly recommend!", "author": "Nilanjana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "It's burger heaven..... I went with my brothers and sister and even my daughter.... \nMy brother and sister loved love the breakfast burger, I ordered the turkey burger which was hot, moist  and so darn flavorful. My daughter absolutely loved her mini burger and especially get French fries... Really great to go to a place that accommodate kids. The atmosphere was well lit and cozy. Our waiter was awesome can't really complain. \nI will be returning... Two8two", "author": "Tiff T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "Great place for a burger and a beer. Just like it says.  Great food. Great atmosphere.  Great service.  Ben was awesome!!!", "author": "Chris R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "If you are vegetarian and your husband meat-eater and you wanna eat together- it is amazing place for both of you!!!\nNice dinner after IKEA -time\ninstead of eating right there\ni would recommend this place to all my friends\nCheers", "author": "Irene C."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}