{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-05", "description": "I went to Two 8 Two last Friday.  The burger was divine (although I wish it were a tad bigger -- it disappeared in a matter of seconds).  The Greek salad was the perfect starter -- such a wonderfully light dressing with lovely morsels of salt and seasoning.  All in all, a delicious spot (but make sure to order two burgers if you are way hungry).", "author": "Carrot Cake R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "This place has tasty tasty burgers and the bartender was able to give some great recommendations about their beer on tap; which was a great selection by the way. The place has a great feel and all the employees were very friendly. Lots of families bring their kids and eat out on the back patio, gives them a cool place to hang out.", "author": "Nick L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "I love this place. the burgers are great also try the onion rings those are great too. The place is a bit small but once your there and you taste the food you won't mind, they also have a little outside area in the back. I recommend you try 282..", "author": "Kyria G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-15", "description": "Went here last night and highly enjoyed ourselves. Staff was nice, friendly and fast. We order the nachos, onion rings, fries and a burger with cheddar , red onions and their special sauce. We had lemonade and ginger beer for our drinks. I really liked the nachos, and my date really liked the burger. The fries and onions were good but we would have like them more if they were homemade. I think with tax and tip we spent a little under $40.", "author": "Aimee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "Came with my boyfriend the day it opened. Obviously we had been anticipating opening for the past several months as well. The waitstaff definitely seemed a little harried, but that was to be expected the opening da\nThe little garden in the back was very sparsely decorated but still pretty cute. We wanted to sit outside but it was a little cold and there were a bunch of little kids running around. (I love kids but not so much when I'm trying to enjoy a burger and a couple of beers.)\n\nWe both ordered a kelso and decided to split several things. We had the Billy burger, a turkey burger with cheddar, and sweet potato and regular fries. Everything was super yummy. I'm a sweet potato fry snob and these were really good. The standout of the meal though was the turkey burger. Oh my God was it good. Not even just compared to other turkey burgers, it was better than most beef burgers I've had.\n\nI will definitely be back often. My only reason for not giving this place five stars was the lack of music playing. The couple next to us was arguing so the lack of music was a little awkward.", "author": "Alicia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-02", "description": "The place is definitely lively - not too loud that you can't hear anyone but certainly not dead.  The place seems to be extremely popular, since a lot of the meat was selling out fast.  The burger was delicious, but there was some slight confusion over the temp of the burgers (mid rare v. medium etc) - just a hiccup really.  The drinks were delicious and definitely creative - for example, a REALLY spicy bloody mary and a rye whiskey with blood orange and grenadine.  Sides are separate from the burger (which is a little downgrading), but they are great for sharing with other people.  I definitely would go back, but I'm not running to it.", "author": "Gina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "Awesome burger place and great prices. I am a particular fan of the turkey burger. Backyard area is quite nice as well. Wait staff are always super friendly. Only down side is that the ventilation is not great so you often walk out smelling of burger.", "author": "Alexander H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "I hardly ever  venture into Brooklyn. Not because I have anything against it...we are simply on polar opposites of the world and the commute is just a major headache.  But I decided to take one for the team with this one. Let me start out by giving you fair warning...\n\nWARNING: If you are planning on heading out after eating here...I suggest you bring a change of clothes and possibly a bottle of shampoo! You WILL smell like you were rolling around in ground beef. The restaurant itself doesn't smell (it actually smells delicious) but unfortunately, it is rather small..and the grease from the grill just somehow gets embedded into your hair and clothes. \n\nOther than that...the \"Pub Burger\" is EVERAY-THANG! I love a good burger and this has put the icing on the cake. Juicy, plump, cooked to perfection. The onions were awesome! I could just eat a pile of the onions! The bacon was cooked PERFECTLY!! Wasn't hard and dried out like I was expecting it to be. Their special sauce was made by Jesus himself! I literally licked my fingers after I was finished. The drinks were...ehhh...mediocre. I had the Pomegranate Margarita (or was it passionfruit)...either way it was small, and WAY too strong. My friend had the mojito and it was pretty much a glass of lime juice. I wasn't there to drink, and I wouldn't recommend making it a night there. The outside patio looked adorable and the place was pretty packed, but we were seated quickly. Onion rings were ok. I've had better. I gave Two 8 Two...four stars because their burgers were so damn good. I would go back..but only for a quick bite to eat.", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "i was in the neighborhood and did a search on bars and decided to stroll over to this place for a drink with a friend... what sold me on this place was the $6 sainte germaine (one of my favorite liquors) drink special... mmmm... it was  YUMMY!!  my friend ordered the bloody mary special and it came with bacon flavored salt on the rim... yes, you heard me correctly... i'm talking BACON!  bacon is good with everything but it's AWESOME with bloody marys... especially the version here where they made it extra spicy with habaneros, another bonus was the PICKLE... woo hoo... i almost wanted to just steal my friend's drink but loved my drink too... high quality drinks for an awesome price.  looking at the rest of their drink menu, i was impressed with the choices... there was a wide selection of stuff that me-likes-very-much.  i shall be back to try more...\n\nnow on to their burgers... they're small, but leave you full... so you're not suffering too much from food coma.  if you're here between thurs-sun... get the LAMB BURGER!!  it's delish!  a perfect blend of juicy lamby goodness, tzatziki sauce, and soft bread.  i was also able to try the two8two burger with poblano chilies cuz i like my stuff hot.  the chilies were seared perfectly so that they provided a bit of heat but was not overpowered to the point where you don't taste the burger. \n\njust for the record... no i am not THAT much of a piggie to have two burgers.  we asked the kitchen to split the burgers so we could try a bit of each and they were happy to oblige.  KUDOS for that, less food surgery required on my part!  over all the service rocked.  we ate at the bar... and the bartenders are friendly and it's a relaxed atmosphere.  \n\nlastly, the sweet potato fries, as opposed to the burgers... were of a generous portion.  there was nothing left by the time we were done.  needless to say, i loved this place!!", "author": "Cherie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-03", "description": "I went for dinner to Two 8 Two after work, at around 6:30, after reading favourable reviews on here - many of which remarked on the house special sauce.  Also, I noticed on the way in that their happy hour till 8 would get me Buffalo Trace for $6 - awesome.\n\nIt was decidedly well-lit...which is definitely not my choice for bars or restaurants, but perhaps gives it a more family-friendly vibe.  The music (also mentioned in other reviews) was fine, nothing special.\n\nThe service was fine.  I got my Buffalo Trace quickly, the menu was straight-forward and the bartender gave me a suggestion for a burger when I asked.  It was a better-than-fine burger.  I've had better, but I've certainly had worse.  This is the kind of around-the-corner place that you could go weekly for a Friday night burger...it's not worth any amount of travel to check out.  The sauce isn't too \"special\", all the ingredients listed to me by the bartender were your standard bar fare.  The options for burgers - a potential gold mine of ingenuity - were all very pedestrian. However, the burger was actually rare, which is not an easy find amongst the local-Friday-night-hang level of bars.  I also ordered the Greek fries...yet another opportunity for an awesome original dish...but they're boring.  The dusted seasoning is great, but the cubes of feta makes it impossible to eat the fries and the feta together.  I ended up eating the feta with a fork, and the fries by hand.\n\nBy no means was any of this a deal-breaker, this bar is an absolutely adequate, middle-of-the-road sort of bar...but if you're looking for an interesting burger, keep walking.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "I was excited when Bareburger opened in the neighborhood and would frequent it often. They closed unexpectedly for a few days (renovations), so I decided to check out Two8Two.\n\nThe two8two burger is one of my favorite burgers in NYC. The roasted poblano chiles and the sauce compliment the quality beef used to make the burgers. While the burger is on the smallish side, I think it's priced appropriately.\n\nI also recommend the chili cheese fries. And Two8Two has a good draught beer selection as well.", "author": "James J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Had the pleasure of eating here tonight. We had the Two 8 Two burger. It had t some amazing peppers on it and the sauce is finger licking.\n\nIf you are in the area you must eat here. Didn't give it 5 stars because I feel the burger could of been a little bigger. Or maybe i should be just eating a little less.....\n\nAnyway try this place you will be happy you did and you will go back a second time", "author": "Glen O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-25", "description": "I got myself a nice juicy burger here.  I think the size of the burger is a plus and a minus--small enough that you don't feel totally stuffed, but perhaps too small when you devour it in 5 minutes. I got the two 8 two burger, and the chiles and sauce are definitely excellent.  The sweet potato fries leave something to be desired, though.  The outside patio looked really nice, but we couldn't enjoy it due to a private party :(  Next time!", "author": "Martha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "I wandered into Two 8 Two one day and was delighted to discover that they serve lamb burgers and sweet potato fries, two of my favorite foods. I've been back a few times now, and the quality of the food and the service have been consistently excellent. The ambience is casual, clean and friendly. They have a bar up front where you can hang out, as well as a nice little outdoor seating area in the back for dining. This is a very good spot for burgers, primarily, and hanging out for a beer or a glass of wine.  Although there's a bar it's really a restaurant. The patrons range from singles and couples to groups of friends to families with kids. Nice option.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-04", "description": "Delicious burgers, good cocktails, solid beer list, chill crowd.", "author": "Jason H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "I just wanted to copy  \"peter d's\" review but that might be cheating.  All of the regular Smith Street Brunch spots had  too long of a wait for hungry people to deal with.  We had just walked Smith from Baltic to Atlantic when the sandwich board  sign in front of  282 Atlantic caught my eye.  They seated the 4 of us immediately  and the service was fast and pleasant and the prices nice and mellow.   The burgers were great  and the BLT's had  a soft buttery grilling . So,  it sometimes pays to turn the corner.", "author": "jim r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-29", "description": "Very good burgers and fries. Drinks were tasty and not overpriced. The ambiance was pretty good. Would normally give it 4 stars, but my husband asked me to marry him the same night we ate here, so I'll toss in the extra star.", "author": "Kait K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-31", "description": "Kitchen is open til midnight. I got the pub burger and Greek fries and both were great. Was hoping for a black \u0026 blue but the pub burger was the closest thing. The bacon was a little drippy, though.", "author": "Jess K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-24", "description": "Great burgers! Quality meat ...ketchup not needed,  Made it a point to try all the types of French fires... Love the Greek fries. price was reasonable. only problem we are use to bigger burgers.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "Can't go wrong with this place. It's one of our go-to safe places for an excellent burger. Always cooked to the specified temp. Greek fries with feta and oregano are awesome. Excellent hot toddy as well.", "author": "Yuri E."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}