{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "This was my first time staying in Brooklyn for the New York City Marathon and I was looking to eat a good burger and a beer the night before the race. It would turn out that they had some good beer on draft. I ended up ordering the pub burger and it was good. If you want fries with your burger, it can be added as a side for an extra $3.50.\n\nThere's a fairly small bar section with a couple of TV's just as you enter. Even though I was by myself, it was a bit early for dinner, so I ended up getting a table in the back where there's many tables. \n\n*Founders oatmeal stout nitro*\nI love a good oatmeal stout and the nitro version is almost always better. This was a good beer to go with any burger.\n\n*Pub burger*\nThis was a nice delicious bacon cheese burger with lots of grilled onions. This was one of the better burgers that I've eaten in my journey.\n\n*Side of Fries*\nA bit pricey for a side, but I just couldn't eat a burger without some fries. I'm used to eating at most places where fries are included.\n\nOverall, their burger was good enough that I would not hesitate to come back here if I'm ever staying in Brooklyn again.", "author": "Emil C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Burgers are amazing and they have great toppings. I recommend anything with the two8two sauce and poblano peppers. Sweet potato fries and regular fries are not amazing, but compliment the burger well. Great service for a quick and delicious lunch.", "author": "Miriam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "The 828 burger was just sooo good! Super juicy and the bun was soft and nice! I've tried a lot of burgers and this is one of the better ones i had. The meat-bun ratio was exact. The price is today normal and worth it. \n* I must add that the fried halepenios on top of my burger were not really hot and i was looking fora but spicier but it didn't change the burger equality.", "author": "Hadar P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Two 8 Two has really solid burgers, a friendly staff and some decent beers on Draft. The Bartenders were all super friendly and helpful. \n\nThe burgers are a little bit on the smaller than average size, but a good bit tastier in my opinion.", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "Daily visits here would likely induce heart failure but it was a delicious burger. Comfort food at it's finest. Fries were just ok and it was a surprise that they came separate. I really enjoyed eating that burger though. Very friendly staff too.", "author": "Jesse L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-14", "description": "I went there and ordered sweet potato fries, i gave the guy my money in his hands and as I'm standing there with my hand out he places my change on the counter, i do believe i was over charged and they took a tip without me knowing, those fries estimated to the amount of 6 bucks! not to mention the fries were cold and soggy and the ketchup was old and mixed with some other sauce! I was very displeased with the service, i thought being in a diverse neighborhood that i would be treated fairly I believe i was racially profiled because I'm African American! I will never spend money in an established where the service is severely poor!", "author": "Trina N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-08", "description": "The food was okay nothing big about their burgers. Drink was not good,could be the bartender that was making the drinks. The place is not big  for large parties maybe size of 4. Would I go back, I don't think so..", "author": "Karen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "NYC burger Mecca!! Each bite of the pub burger feels like taking a step along a deliciously satisfying spiritual journey.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "One of the best Burgers in the city. You almost never see this place written up on any of the foodie sites or Time Out NY which should always be listed. The meat is fresh and extremely tasty. You will not be disappointed here.", "author": "david l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Was dying to ask what is in the two eight two sauce because oh my goodness it is the most perfect burger sauce ever! Had the breakfast burger with a fried egg on it and it was just heavenly!! The onion rings were crunchy and delicious and the French fries were well, sorry to repeat myself here, but perfect!! Can't wait to go back here!!", "author": "Brigitte M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "Cozy, affordable, burger joint.  Burgers are so good I haven't tried the hot dogs, but I want to.  No fancy topping really, just the basics done really well.  That said, I love the poblano peppers on the burger. Great combination.\n\nSolid selection of beers, and they have boozy milkshakes.  I haven't tried the later, but they sound good.\n\nThere is happy hour, but it is limited.  And a couple of TVs at the bar, but defnitely not a sports bar feel.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-15", "description": "Pros:  - Delicious burger on a potato (?) bun with absolutely yummy \"house\" sauce that definitely has mayo and ketchup in it (I won't ask for the secret, promise!). \n            - Very reasonably priced, especially for the area! \n            - yummy, refreshing drinks\n\nCons: - let's just say that before even going through half of his buger, hubby ordered seconds . Indeed, it is not a huge burger and while it's pretty delicious, for a grown boy of ... Well, just not enough\n           - the yummy drink could use a bit more \"adult beverage\" to it and a bit less \"Shirley temple\" \n\nI do like this joint and would recommend a visit.", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "I stumbled upon two8two on a Friday night with my boyfriend after our plans to see an amazing comedy show got cancelled.  (The only reason this is relevant is because I was really unhappy with the way our night started to turn out and where ever I went had to be at least decent without me ripping off some heads..)\n\nOk, so the important stuff - burgers, fries, good drinks.\nWe both got the breakfast burger which had egg and bacon on it.  The burgers look smaller than a normal burger joint but they are more than filling.  Everything was juicy and delicious.  I got the sweet potato fries and my boyfriend got the onion rings - both awesome.  He originally wanted regular fries and it was just a good mistake I guess.\n\nFor drinks - I got the seasonal cider and he got a bourbon lemonade.  I'm not a bourbon fan and that was also very good.  Mixed drinks were only $8 - which for the city, was really reasonable.\n\nThe place wasn't crowded at all, we got a seat right away without reservations and even after dinner there were plenty of seats open at the bar to watch the basketball game.\n\nAll in all, I definitely recommend.", "author": "Eva B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Great vibe and great food! Would highly recommend the chicken sandwich, it's charred ever so slightly and has the cheese perfectly melted on it. \nTwo8Two sauce is terrific too, whatever it is-and I say that as a compliment because it seems like at this point \"secret sauce\" is all the same at every restaurant (lookin at you @Shake Shack)!", "author": "Alex W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Burgers was delicious. I had the turkey burger and my boyfriend had the Billy Burger and fries.", "author": "Chanelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "This place had been highly recommended by a friend so I decided to give it a try.\nThese burgers are good, but not the best in the world. If you're looking for amazing burgers I would probably go elsewhere. \n\nThese burgers reminded me of an upscale Shake Shack, only much less oily. I really enjoyed the jalapeño margarita though. It was well made - nice and spicy! \nI didn't expect the burgers to be on the smaller side so my bf and I ordered one to share after we had finished our first burgers. We got sweet potato fries on the side which were pretty good, not too crispy but not soggy either. \n\nWe ordered the two8two burger (10$), Half and Half Burger with a fried egg (12.50$ bc of the egg add-on) and then lastly the Billy Burger (8.50$). All solid burgers - not oily, fairly juicy and had tasty grilled toppings. We both liked that the burgers were not heavy. The grilled onions in the Billy Burger and the roasted poblano chiles in the Two8Two burger were a delicious addition to the burger, which added a lot of flavor.\nMy boyfriend had the half and half burger. He wished that it would have been a bit more juicy but it was still definitely good. This one was particularly stuffed because of the fried egg so it was a bit hard to eat. \n\nI appreciated that this place is affordable. Nothing above 12$ unless you get lots of extras. I would definitely come back. Solid burgers, good drinks and cozy bar type atmosphere.", "author": "Yelena K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "Stopped in on a Saturday (late afternoon). Friendly service from both the bartender who checked our IDs and the one who served us -- including an A+ beer recommendation. Enjoyed their draft selection and the environment (casual and welcoming). Oh and FYI given the current heat wave: Cold AC in this place, especially if you sit near the middle of the bar!\n\n(Why not 5 stars? Their food menu left a little to be desired. Sure, it's a burger joint \u0026 I'm a vegetarian, but it seems many other places nowadays dress up the veggie burgers with something beyond lettuce \u0026 tomato, offer a delish grilled veggie sandwich, or have more sides on the menu. Ah well. Would still go back for beers!)", "author": "Christine F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Theeeeee best burgerrrsssss everrrrr. Love the 50/50, half bacon half beef. Great drinks, service is wonderful, and cool atmosphere!!!!", "author": "Kiya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "This place is fantastic. The food is always great and the beer is nice. It's always possible to get a table even during lunch. The outdoor seating is fantastic for the. The weather is great. Skip the Shake Shack a few blocks away and come gere", "author": "Costa F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Very cool bar with a no-b.s. menu. I highly recommend stopping by for a pint and a burger. The prices are fair and the staff is friendly. The only issue I had was that I couldn't figure out how to eat the Greek fries without the feta cheese falling off. I'll probably stop back in soon.", "author": "Mitchell B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}