{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "Really good burgers. I have only been in the neighborhood a short time but found these to be the best. I can't really see why anyone goes to Bareburger. It was absolutely devoid of flavor. The downside here is you will smell like meat. There's no ventilation, or it kind of feels that way. Luckily when it's nice, you can sit outside. lol.", "author": "Feather A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "This is my favorite burger in NYC (it's tied with the prime meats burger). I don't understand why more people don't talk about it bc it is truly a gem of brooklyn. I recommend the regular 282 burger but they also have other great french fries, turkey burgers and lamb burgers. I crave this burger sometimes and just go and get it alone at the bar. Any friend I've ever taken here loves it too. It's never crowded and it's always pleasant and quick! Run, don't walk, to this burger!", "author": "Emily M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "The burgers are great! Dont be fooled by the size they are extremely filling. This quaint burger joint also has an outdoor seating area which will be lovely late spring early summer. Full cocktail menu to accompany the array of burgers provided. Our server was quick.. didn't feel rushed..", "author": "Bana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "Very solid \"fast food\" style burgers (a la Shake Shake, Burger Joint, etc.) and great draughts makes this place a welcome addition to the neighborhood.  \n\nGotta knock'em down a star for being skimpy with the onion rings and fries, which were good too.  Yeah it's only $3 per order, but guys, put more rings and fries on a plate and charge a buck more.", "author": "Geoff C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-04", "description": "Went here specifically for a burger on an early Saturday afternoon. I heard a lot of good things about this burger, and when I saw it in a magazine's list of top new NYC burgers I figured that was a good enough reason to go.\n\nI was hungry and got the pub burger since it was a bit bigger than the rest of their burgers. Long story short, it was a solid burger. Meat was cookied right, bun was not overpowering, and I added their roasted poblano peppers which is a pretty ingenious burger topping that I hope to see more of.\n\nThis place is a solid 4 stars, but two burgers, a order of fries, and two drinks was around $50. It loses a star only because with so many burger places in the area, the price kills this place.\n\nOtherwise, good burger, good drink selection, good outdoor space in the back.", "author": "Kyle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "I had the Billy Burger with the lettuce bum. At first I was thrown off by the lettuce bun, but it was delicious. By far I think it was the best burger I've ever had.", "author": "Nay P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-22", "description": "Solid but don't order the ice cream sandwich! It's just a good humor, old fashioned cardboard-y chocolate with icey vanilla, cut in half and drizzled with some raspberry sauce. That's bush league. What is this, TGI Friday's?", "author": "David R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-18", "description": "Cute, but so generic it leaves no particular impression. It's a bar that serves fancy little burgers and good sweet potato fries. There's outdoor seating and the staff is pretty nice so basically it's like any other place on Smith/Court.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "Very pleased by this addition to the neighborhood! Boy and I have popped in a few times over the last few months and have always been pleased by the friendly service and food. \n\nThe Two8Two burger is by far my favorite--the poblano chiles give it a little kick without making it truly spicy, and it's (so far) been cooked exactly as ordered each time. Given that the boy is SUPER picky about his hamburgers being cooked correctly (medium rare, or rare if possible), knowing that they're consistent is really great. The burgers are definitely a little greasy, but in a really really satisfying way. Definitely not a critique, but do prepared with the napkins!\n\nThey've slowly expanded to include a few more offerings, although I think the non-burger offerings are weaker. The Greek fries in particular were kind of silly--the cheese was just sprinkled on top and wasn't warm enough to stay on the fries during the plate-to-mouth trip. Unless they start giving the entire dish a quick broil or switch to a slightly more melt-able cheese, I would just avoid! \n\nGo, order some burgers and a beer, and enjoy the view (preferably of the garden rather then the prison across the street).", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-02", "description": "The burgers here are sooo good! I had the original Two8Two burger but I added bacon. You can't go wrong with it!\n\nI don't like lamb but I tried my friend's lamb burger and it was really delicious.", "author": "Elise S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "Great burgers and solid beer selection. Plenty of space at bar area to hang out with two TVs available for local games. Grilled cheese is also delicious. Summer time is best with their back yard setup with 4-5 outdoor tables.", "author": "Dani S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "What can I say? The burgers are excellent, as was the Greek fries....burger was so juicy....ummm if only I had room to eat another one....", "author": "Rob M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-18", "description": "I haven't been back to the restaurant, but the owner was kind enough to offer me a free lunch or dinner after reading my review. I don't foresee going back anytime soon, but I did appreciate the owner taking the time to write. His apology seemed genuine.", "author": "Elizabeth K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-03", "description": "Meh.\n\nNothing special. Great service, but burgers were nothing I'd come back for. Too lean (dry) wonder bread buns. Bacon tasted cheap.", "author": "Porter B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-04", "description": "The Brooklyn burger wars are heating up, with a handful of burger masters plying their trade along the Atlantic Ave./Eastern Parkway corridor, and the offerings at Two Eight Two are serious contenders for the meaty crown. The patties are juicy and flavorful, packed with a gentle hand but not nearly as loose as the version at Fresh \u0026 Fast in Manhattan. The fries at Two 8 Two were classic perfection -- an excellent rendition of the the standard pencil-thick burger accompaniment. My Pub Burger was topped with perfectly-cooked bacon and they do something toasty and buttery to the bun that kinda got my own juices flowing at first sight. \nThey have a nice beer list and mix a fine specialty cocktail. I enjoyed my Bourbon Limeade and Joe's Blood Orange Pomegranate Margarita was just sweet enough and also delicious. \nThe owner has a 10,000 megawatt smile and a personality that can light up a room, a good thing in this space that resembles the scarcely decorated \"restaurants\" that one sees on the Restaurant Wars episodes of Top Chef. If the weather permits, sit in the backyard. \nOn this particular Tuesday evening the dining room was filled with families with small children who were being completely charmed by the affable owner.", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "Loved their burgers, their BLT, their Greek Fries. Loved their Dark \u0026 Stormy. The Two 8 Two sauce is pretty sweet. I wish they had honey mustard, though--the star keeping them away from 5.", "author": "DeLana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-23", "description": "THE BEST BURGER FOR THE BEST PRICE, HANDS DOWN!! The portions are the perfect size, the toasted (and I'm guessing buttered buns) are so fresh and soft and I love the shreded lettuce. The Onlion rings are not to be missed!! I crave this place and its so easy on the wallet!!!", "author": "Susan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "Awesome. Breakfast burger and protein burger. Fries. Good BMs. Thought the burgers were a little small, but I was satisfied walking out.", "author": "Austin A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-07", "description": "I yelped best burger in brooklyn and this placa came up. Took a drive there, and had the protein burger. it was good... nothing amazing.", "author": "Monica M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-14", "description": "I heard good things about this place, so I was shocked at the lousy service my friends and I received, or should I say no service, we ended up leaving,  will not be coming back, ever!!!!", "author": "Janice B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}