{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "The lovely wife wanted a burger for dinner and mentioned the place on Atlantic that opened a while ago that we hadn't been to. We checked the Yelper-net and two things emerged from our research:\n(1) Peter D had been and loved it\n(2) They get their meat from Paisanos down the street and we love Paisanos.\n\nThey make a slightly smallish burger. I'm fine with that. If you want a huge-ass American #1 burger, then you will complain about this place. \n\nWe had the 282 burger which was very good. The peppers are nice and smoky addition. My only other comment about this burger was to echo what someone else mentioned: the cheese gets lost. They seem to be using the most neutral cheese in the world. Stick something with a bit more flavor in there.\nWe also had their oddly very good greek salad and their very very good sweet potato fries.\n\nThen we walked down Court and had some lemon ices from the pizza place. Lovely.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Pub burger was awesome. 8.5 out of ten. Regular and sweet potato fries were both good too. We'll definitely be back", "author": "Wyatt M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-25", "description": "I've been coming here since it opened (sometimes more than once a week!) as I really love the food. This past Friday night (January 23rd) I brought a few friends here and I was so disappointed. \nWe decided to go to the bar before we sat at a table and the bartender was the rudest person I've ever encountered. Not sure his name but he has dark brown hair and an almost grown in foe-hawk? (not sure if that's the term). Anyway, he was nasty to not just me but most of the people he was serving. Complaining (loudly) about other guests at the bar to me and just so disgustingly inappropriate.  Can't the owner find nicer bartenders? I felt like he was a manic patient  at a hospital that you didn't want to anger bc he might have a crazy episode. We ended up not staying for dinner since his demeanor made me sick. \nI guess I'll take a break from bringing people to 282 or coming here full stop since his bad attitude completely turned me off to the place. Frankly it scares me that he's in the service industry.", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "Here again. Destroyed 2 breakfast burgers. Every time they satisfy! Best burgers ever! No one else compares", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "Great food, amazing burgers! Service was slow took over a half hour to get our food, but they did apologize and comp the drinks.  Would definitely come back!  Would have given 5 stars if based on food alone.", "author": "Maureen T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-27", "description": "update: I got an email from the restaurant saying that the waiter should not have put the automatic 20% gratuity on my bill. I would guess that is true since it was so strange that it happened. I am happy there was a response, and I did not take them up on the offer for a refund.", "author": "Jo S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "Must be the best burger in the neighborhood. Lots of topping options, but I'd stick with the classic version. Decent fries, too. Nice garden in back. Happy staff.", "author": "Mark B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-18", "description": "I was really craving a burger so I came here for brunch. Too many kids! I got the two8two burger with bacon added. The burger was ok, but I guess I've been spoiled by eating grass feed/organic that non organic just doesn't taste the same anymore.", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "If you go here with the expectations of getting a decent burger and a cocktail without any fanciness then this place is pretty good. I wouldn't come here if you are looking for a nice dinner/apps though.", "author": "Micah D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "Best burger in NYC.  I know people say that a lot, but this place is the real deal.  Very juicy.\n\nThe ambiance is typical for hipster Brooklyn joints, but the staff is much friendlier than most.", "author": "Grand B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-26", "description": "I've passed by this place on a number of occasions and last week I finally went in and had a sit-down lunch with my girl and our son. As soon as we walked in we were immediately greeted and sat down which impressed me instantly. Another great aspect is that even though there is a bar up front, it is definitely family-friendly. On a side note, there were a lot of people with their kids so if being around children is not your thing than this may bother you since some of them may be a bit loud and very young. My 5 year old was very well behaved though ;) hehe.\n\nI opted for the Veggie Burger since I was in a \"lesser-of-the-evils\" type of health kick that day but nevertheless it was a good burger. A weird thing was that it was cut into 4 triangles but I think it's so that it would fit into the bun but either way it was cooked correctly and was pretty tasty. I didn't miss meat at all ;) I can see myself eating it again soon but I do have to taste the beef and lamb burgers though. I have canine teeth for a reason ;) \n\nThe prices were very affordable and my water was constantly refilled which is always a good sign of attentive service. The food arrived fast even during a busy service too! But.....\n\n.....I have to give it 4 stars since French fries don't come with the burgers :( I love you guys but this is America and I demand complimentary French fries!!!.......p", "author": "Brian P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-01", "description": "Okay, I debated if I should take off a star for atmosphere.  It smells so greasy.  If you come in for a meal, you will smell like burger afterwards.  So, you are warned.\n\nBut I still have to give it 5 stars because the burger was REALLY tasty!  It's a simple joint.  The menu is simple, with a few burgers and sandwiches.  But I think it is because of this that what they do have is so dang tasty!  \n\nI had the two8two burger.  It has cheese, chili, and sauce.  It was cooked medium, and it was soooo juicy.  It was a three napkins situation.  It didn't automatically come with tomatoes, onions, and lettuce, so we asked for it.  And I know this is something simple, but I LOVE their onions.  It's shaved so thin.  You know how you usually get onion slices to put on burgers that are like 1/4 inch thick, and there is no way you can actually put that on the burger and eat and have it stay on?  Not a problem here.  I love onions on my burger, and these stay on.  And the whole thing is just tasty!  They know what they're doing!\n\nYUM! \n\nGo.  Now.", "author": "Jeannie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "I'm willing to say that the 282 burger is the best burger in Brooklyn. Great draft beer list. Sweet potato fries are also a hit. But really, don't bother with the rest of the menu.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-07", "description": "Came here again for dinner with my boyfriend (almost a year since my first visit). I ordered the breakfast burger again which was still as delicious as I remembered it (ordered it medium since I remember medium rare being too red).  I also ordered the Greek fries which weren't amazing or really as good as I had remembered.\n\nOverall a great burger. Would recommend and come back.", "author": "Siv L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-28", "description": "I really felt this place was underwhelming. The burger was rather small, it wasn't very juicy or flavorful, and I walked out feeling very hungry still. The fries were also pretty bland. I would pass on this place if you're looking for a no-frills bar burger.", "author": "Jason E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "This burger was cooked great.  I got the Billy Burger.  We shared some Greek Fries.  Not wild about the Greek Fries, but I saw some chili cheese fries and I know what I'm getting next time.  Definitely going back.", "author": "Tim H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-09", "description": "Burgers, Burgers, Burgers... Burger places are a dime a dozen these days... and two8two for me is a solid choice in the crowd, but not necessarily worth the walk from home to become my go-to.\n\nWhat two8two does have going for it over some of my other burger picks is the robust bar program.  There is a long menu of signature and classic cocktails as well as a really good beer list across their 8 taps.\n\nThe veggie burger is of the housemade variety and suffers from the same crumbling problems as most.  It's saved by a good flavor profile and the yummy two8two sauce.  The fries are a step above average.\n\nOverall it was a good experience and will definitely consider it as an option when I find myself in the area.", "author": "Kevin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-26", "description": "I've been going to Two 8 Two since they opened. Hands down, they have the best burger in the city. When I have a good burger somewhere else, my comment is always \"it was delicious, but it was no Two 8 Two!\" Thankfully, we moved out of the neighborhood, making our trips for dinner more infrequent. I think I put on about ten pounds during their first six months in business.\n\nOutstanding burger, great onion rings, and a fine mojito -- what else do you need?", "author": "Renee P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-07", "description": "I have been here twice and had two very different experiences, making it difficult to rate. \n2 stars for experience\n3 stars for the food\n\nThe first time I came it was about 5:30 on a weeknight, so we got a table outside for happy hour. I ordered the turkey burger first, but since it was so small I got the sweet potato fries after. I eat beef, but try to go for a healthier option when it is available. I have been eating turkey burgers for years and I honestly think this was the best tasting turkey burger I have ever had. That being said I am sure most people who head to a burger join want the beef; more on that later.\n\nI think I had 2 beers, the burger and fries and it was around $20; not a bad deal (it was happy hour)\n\nMy return was on a Friday evening 7pm-right when happy hour ends :( \n I ordered an organic pale ale (I didn't know beer could be organic too...) \n\nSince there are only 4 outdoor tables they offered us the option to share with another group, which I am really not into so we opted to sit indoors. Well...I didn't realize how 'child-friendly' this place was. The dimly lit room, techno music, and crying babies made me want to eat and run! I understand how helpful it must be for some people to have the option of bringing their children out to eat, and burgers are pretty standard child fare but the long bar that takes up most of the restaurant gives this place more of a bar (read: adult) feel and I just didn't expect it. I ordered the turkey burger again, still very good. \n\nIt was hard to hear the person I was sitting next across from, who also got wet when a child spilled a drink on his leg. \n\nI tried the beef burger which was tasty but not amazing, the best part of both burgers was the 'special sauce' one of those mayo-ketchup combos.\n\nWe tried the 'greek fries' which are basically fries with feta and oregano thrown on them. This is just impractical. It was nearly impossible to get the cheese on a fry. We resorted to using forks for our fries, a little ridiculous if you ask me! \n\nMy last experience was really a deterrent. I would only go here if I could sit in the backyard and there were no children.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "Super casual. Great burgers, good fries, and decent drinks. We ordered the lamb burger and the regular burger with two8two sauce. It was really good and the sauce tasted thousand islandish. The back patio is a nice shaded escape from the city streets. A solid lunch spot! :-)", "author": "Casey J."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}