{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "I have been passing this place for a long time and today I finally made it in.\nWhat a great find.\nTotal quality. One of the best burgers you will have. Also had a greek salad that was perfect.  Burger was a bit small but quality all the way. Try the 50/50 and you will not be let down. The place is also well kept and the guys running it didnt stop moving for a minute while I was there.\nWill definitely be back.", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "Hands down one of the best burgers in Brooklyn. Service has always been good and they have lots of great beers on tap. The outside patio is nice. \n\nSometimes there can be a few kids running around, so best to go later in the day.", "author": "Emily P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "Always pass this place on my way home from work, so I went with some friends and it was so good, turkey burger is to die for", "author": "Kelsey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "For the most part, the food is always delicious. The only thing that ever disappointed me was the lamb burger, which I only tried once. In all fairness though, other places have also managed to screw up lamb burgers. Anyway! I usually get the two 8 two burger with the poblanos, and I am always pleased. Its cooked perfectly every time. Even the sides are yummy, and some of the cocktails are good too.", "author": "Indira W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "One of the best burgers I've had. I ordered the two 8 two burger. It melted in my mouth. Just thinking about it, I might go there after writing this review! I judge burgers on if you have to put extras like ketchup and mustard. This burger doesn't need any of that, it's great as is. I also ordered the Greek fries which I recommend.\n\nGreat service, very attentive. There's also some outdoor seating perfect for warm days.\n\nPrices are reasonable.", "author": "Jerald M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "Jerald M. hit it over the head with the review he has, but let me just say.\n\nI usually don't do peppers on anything.\n\nI ate all the damn peppers that two 8 two burger had and wanted to get another side of them. That's how good the damn food is. \n\nEnough said.", "author": "Jeanna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "Read the reviews, and had the lamb burger and the Greek fries. The burger did not disappoint, but the Greek fries were not something that can be shared by two people and were a bit dry; I think a sprinkling of olive oil would go a long way. \n\nService was nice, food came a bit slow, but the lamb burger really was good enough to get past some of the other points. Beer decent.", "author": "Jakub W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-19", "description": "This is a popular place on Yelp so i made it a destination. I enjoyed the boozy-burger vibe.\n\nThey clearly put a lot of thought into designing the overall experience. Reminded me of a hip spot in SF or Seattle a decade ago with the warm tones and hip rock/funk/trip-hop soundtrack. Feels like how bourbon should taste like. \n\nThe waiter was smart and on point. \n\nThe burger was very small and a bit pricey. They get fresh meat from a local butcher but make no claims about the contents. It is not grass fed or organic or anything. Just beef or in my case lamb. \n\nThe lamb burger was tasty though. I added an egg and ordered a side of fries. Yes you pay $12 for the little tasty burger and the get the opportunity to order fries. \n\nThe fries were fine. Well cooked. The style was very fake-fry feeling. Sweet mush recombined into the shape of a fry. Not my favorite style but they did it well. \n\nBut in the end I leave feeling good. Next time I might order 2 burgers though and try the onion rings.", "author": "Erik F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-29", "description": "Yesternight was one of many firsts -- first time hearing of a Hoyt-Schermerhorn station, first Yelp group outing, first burger in Brooklyn (from what I remember), etc. As I subtly tried to make out the pineapple-on-the-table to meet up with Peter \u0026 Co. (nice to meet you all, by the way), I got a chance to check out the Two8Two scene. This low-key Brooklyn joint looks and feels more like a bar than a restaurant with self-seating, just-attentive-enough servers, and a simple menu. I dig it.\n\nI decided to go with their namesake burger, which is topped with roasted poblano chilies, cheese, and the special two8two sauce. Let's discuss:\n\n- The patty: perfectly seasoned, medium/medium-rare, juicy, (slightly) greasy awesome-ness. May or may not require 2-4 napkins while eating.\n- The poblano chilies: far less of a kick than anticipated (even with a moundful!) but a good addition\n- The bun: not toasted/thick enough to hold up against the patty's juice\n- The size: perfect for a girl, petite for an average guy* \n- The two8two sauce: overhyped - this same sauce goes by many other names  (\"special sauce\", \"inn-n-out sauce\") but is essentially not all that different from thousand-island dressing\n\nI didn't realize that the burgers don't automatically come with toppings (tomatoes, onions, lettuce), so will keep that in mind if/when I return to Two8Two.  Maybe after I try a few other burger joints that are \"the best in the city\", I will update the rating. Until then, 4-stars seems right -- as in \"Yay, I'm a fan\". \n\n* Easily remedied with a side of fries, onion rings, and/or sweet potato fries. All of which I didn't find particularly stellar/distinctive, but they get the job done.", "author": "Natalie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "YUMMY!!!\nWhat a great addition to this area. The fries and onion rings are delish. The prices are just right, although the bloody mary (with bacon salt rim) that my friend had was 9 bucks and in a 1/2 pint glass. That was a little steep to me, but  folks that I was dining with each had a burger and raved about the special sauce-so that made up for it. I opted for the nice sized grilled cheese with bacon on pullman. Everything was just perfectly cooked and nothing was overly heavy or greasy. The only downside is that I missed this Elite event at Two 8 Two a few months ago. I really look forward to going back soon and trying a burger of my very own.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-05", "description": "Two 8 Two is an amazing find.  It looks and feels more like a bar than a restaurant.  There is table-service but you seat yourself and it's casual and friendly staff is very accommodating.  Yesterday, the couple that came in right after us brought their bikes in without any complaint.  It's the kind of place that understands you.\n\nWhat I don't understand are the mixed reviews on Yelp about their \"Breakfast Burger\".  This thing is amazing.  The bacon is perfectly cut to fit the burger.  It's crisp but not too crisp.  The egg is sunnyside-up and it leaks ever so perfectly with each and every delicious bite.  The beef is mildly seasoned and the sauce is evident but not too generous.  It's a perfect marriage of flavors that explodes in your mouth until the burger is fully consumed.  Come hungry.  Order two.  Trust me.\n\nUnfortunately, I have mixed reviews about the bar.  I love the Chipotle Bloody Mary with its \"Bacon Salt\" and order this each and every time.  In the past, I've noticed their white wine is rarely properly chilled so I don't order white wine from them anymore.  But listen, don't let that deter you.  You're here because it's burger time and this place knows what to do when it's burger time.", "author": "Jude R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "I love the burgers here, and all the bar food I've had has been good, too. The bar is cool, and cocktail specials are innovative and delicious. Service is good bathrooms are good, bar area is nice if not a little exposed (mostly backs to the flow of traffic). The seating area is small but usually sufficient, and the sweet patio out back is great in nice weather. Sometimes there can be some wild little ones jumping around. Other than that, my kind of place.", "author": "Wendy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "I've been here a couple of times. Most recently, I was here for new years weekend. Just as I remembered. Good burger, although Im not a big fan of the small buns. Blood Orange margarita was pretty darn good though. \n\nwould go again, just nothing to rave about.", "author": "Calvin A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-04", "description": "I used to love coming here with my family up until a few months ago when my 5 yo daughter was served a spoiled hamburger. We pointed it out to the server and he seemed to think we were crazy. We did not send back our own burgers as they were good. Sent hers back. Got her a hot dog instead. No offer to comp the hot dog or worse yet, an apology for the mistake. Needless to say we will not return.", "author": "Nath L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "This is pretty much my go to place for burgers. The breakfast burger and the greek fries are AMAZING. My friends loved the onion rings and the massive hot dog. They have some pretty yummy cocktails and some pretty yummy beer and I usually can't stand beer. The prices are also fair. The waiters are nice, the bartenders are nice both have been attentive even when it was busy. They have a nice outdoor seating area with large picnic tables which sometimes means sitting with strangers but I don't have a problem with that. \n\nI wouldn't come here for the nachos or chili cheese fries. They weren't bad at all but I've had a lot better and they don't have salsa or sour cream.", "author": "Shaks R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "It's a very nice little burger and beer spot. Came here yesterday with my girlfriend after some food shopping. Can't go wrong with a a really good burger! \n\nI had the (5oz) cheeseburger with sautéed onions with lettuce, tomato, and ketchup. Also has the onion rings which were good. \n\nI had a mimosa with peach schnapps. Will def come back here", "author": "Victoria B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "This place is so dope! \n\nWas in the mood for a burger and a beer and hit this place up with a buddy of mine. \n\nThe service off the bat was top notch! Everything was quick, the drinks were perfect, the burgers were delicious and juicy. The server constantly refilled our water. \n\nThey even fixed our wobbly table right then and there. \n\nDefinitely coming back. Amazing service guys.", "author": "Mike J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "One of my favorite places for a quick burger. It's not crazy expensive, they make a mean cheeseburger, basically a perfect post-hangover spot if you need some grease in your belly. Again, the burgers are nowhere near healthy. They are great, but seriously be prepared for some grease and be OK with it. Also while you're on the wrong side of healthy living, you might as well try to fries. They have some fancy seasoned fries that are not to be missed.\n\nThe outdoor garden patio is beautiful in summer and in winter the indoor dining space has a clean, hip vibe. I also love that they take credit cards, which is often an issue with restaurants in this neighborhood.", "author": "Lily A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "Very good burgers, definitely hit the spot.Outside is a little clusterphobic though.", "author": "Chad C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-29", "description": "This is one of my favorite burgers in all of NYC.  Seriously.  Get the 282 burger with the poblano peppers. Dare I say it, I think I like it better than Shake Shack.", "author": "Frank W."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}