{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-18", "description": "I haven't had an amazing burger in a while.  The two8two burger is great.  It was juicy, and tender.  The hint of spiciness from the chile made the whole burger irresistible.  I was craving for more after I inhaled my burger.  On a side note, I also had the nachos, which were okay, I've had better.  The service was good, I will definitely be coming back soon.", "author": "Wayne C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "Burgers were really great, but small.  The sauce was delicious. We asked for recommendations for fries and were told to try the sweet potato fries. Sadly, they were frozen fries. They tasted like it and because I could see fridge from my seat, my suspicion was confirmed when they pulled them out of the freezer.  Also, the ice cream sandwiches are not homemade. They were actual store bought ice cream sandwiches. Just seemed odd. Would go back for the burgers.", "author": "Tara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-28", "description": "They have added appetizers and a few new burgers.  Appetizers did not strike my fancy, so I did not partake.\n\nSat outside this time, and it was very pleasant.  The garden is nicely done, unlike the main dining room, which still needs some work.\n\nService was extremely friendly and helpful again!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Ugh people are so annoying about their complaining of the prices! If you want cheap (crappy) burgers go to a diner people! I feel compelled to write this review because I had an epiphany.  Me and the hubby went to two 8 two a few weeks back after our tire got popped and we barely made it home from the city at around midnight, and this was the only place open in the hood at that time.  We sat and rejoiced in our delicious burgers but didn't quite appreciate their deliciousness. Fast forward to last weekend when we went to the movies and then stopped by our fave diner (that we've been going to for years and where we LOVED their burgers) and we were horrified to learn that our burger tastes have evolved far past the dry, flavorless diner burger.  So again last night we visited two 8 two (i promise i really don't eat burgers that often I'm mostly a healthy eater but for some reason we've been hitting the burgers pretty hard lately) and it was everything i remember it to be and more! The burger was juicy, flavorful, cooked to perfection and delicious! I subbed the bun for lettuce and it tasted even better! I probably could have done without a plate full of sweet potato fries but i have no self control (clearly...I've been eating burgers non stop). Anyway, yes its pricey ($66 w/tax and tip for two burgers two sets of fries and a beer and wine) but you get what you pay for! if you have no taste buds and think all burgers are created equal then please go elsewhere (and don't take up precious limited outdoor space at two8two) but if you eat burgers only every once in a while and when you do you want them to rock your world then this is the place for you! Plus you live in downtown Brooklyn clearly you have enough money for the exorbitant rent/mortgage so shut up and pay the $13 bucks for the burger!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "Tried this place last weekend and got the Billy Burger while my girlfriend got the veggie burger. The billy burger was excellent! Grilled onions, cheddar cheese, 282 sauce. Sooooo good. The veggie burger was awesome too. The food, good beer menu, and chill atmosphere make this place a great spot! Will definitely be going back", "author": "Sean C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-11", "description": "Burger = delicious!! (worthy of 4 stars?? We'll see about an upgrade after next visit)\nBeer = good, but served by a bartender whose personality traits toed the line b/t aloof and rude\nFootball = flexible (they changed the channel when asked)\nGreek Fries = suck. Don't bother. They sprinkle cold feta on hot fries. The cheese doesn't melt/stick to fries, so at the end, you're left w/ a plate full of cold feta chunks.\n\nTally = worth trying again....but stick to the basics and don't be disappointed by the charm-free bartender -- you're going for the burger, not the conversation", "author": "Madam F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "Legit burger spot. \n\nFor starters we had nachos, chili fries, sweet potato fries and onion rings. They were all very good. I was especially impressed with the nachos. I usually consider nachos in the \"ehh whatever it's just bar food\" category but it was surprisingly better than I expected. \n\nI had the 282 burger. We were all surprised that they did our burgers medium rare when we did not even ask for it. That's a PLUS. We realized they didn't ask any of us how we wanted our burgers. Could be a bad thing if you like your burgers medium and up, but to me that just says they know how a burger is supposed to be. Not much else to say other than it was a delicious burger. \n\nGood ambiance, good food and good service. No complaints here. \n\nWell, they don't have mushrooms. What kind of burger joint does NOT have mushrooms?!", "author": "Alvin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-20", "description": "Great burgers and beer.  The Burger was juicy with great tasting and the two8two sauce complements it perfectly.  seems like a combo of mayo, garlic and diced pickle.  Great Staff as well.  I recommend adding a fried egg to the burger as I do with any place that offers it.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-03", "description": "Total middle of the road place. Burger was great but the fries came out cold.  Asked for new ones, got the same batch refried. Bartender was completely unattentive to boot. Not worth $25 for burger, beer, and fries", "author": "Zachary C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "Came for lunch on a Tuesday at noon - was the only person in the place.  They had two specials posted - a draft beer special for $4, and extremely flavorful pale ale - definitely a good choice.  They also had a burger and fries special for $8.  However, it was the plain burger.  You could order any burger and they would charge extra for the toppings - so I got the Breakfast Burger, which amounted to a $1 savings (wooppee!).  The burger was downright juicy and flavorful, but way too much two8two sauce (which is mayo based). Next time I will get a burger without it. The other complaint was that the fries arrived after I had already finished the burger (the waitress had to yell at the cook).  However, the fries were good and plentiful.  Overall, I had a pretty good experience and the burger was great (better than Shake Shack!).  Glad to have such a good place in the neighborhood.  Will definitely return.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-08", "description": "Since we're living in a snapchatting-YOLO era, I figured I'd ignore my company's web filter which prevented me from viewing two8two's website. Grabbed a few friends and made the trek from the Metrotech office. Never mind that it's across from what appears to be a prison, this place ROCKS. Delicious burgers quickly arrived which spawned an unspoken racing war as no one was able to put their burgers down. This place is the bee's knees for lunch and will be at the top of my recommendation list for people visiting the office!", "author": "Sam A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "I was in the area so a friend and I decided to stop here for a bite. Before I start I gotta say that you must get the Greek Fries, AMAZING!!!. Now on to everything else... The burger was great, I have had better but it was still really good. Why give them 4 stars and not 5.....? Because of my drink. It was almost the worst Mojito ever, my friend had something else which they weren't pleased with either. Maybe it was just an off day (Sunday). I will def go back to see if this place will earn that extra star. All in all the restaurant is nice and they have outdoor seating in the back which is great when the weather is nice. You wont be disappointed, I promise.", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-03", "description": "My other local bar in BK that isn't Zombie Hut!\n\nThis place it totally five stars. Even more so now I am in London, eating tcompletely forgettable sausages at a trendy bar. Ok London, I know food is meant to be bland, but... wow. Just, wow.\n\nSO, 2 8 2! I had burgers here a few times and they are pretty darn tasty - however, I am not a burger-person. My friend really likes the burgers, but he used to go to an oh-so-dodgy burger place in SF that gave him food poisoning, so! \n\nI love the BLT though. Love love love. Like, a weird, super-strong, potentially illegal presidential election talking-point love. Yeah. I would come here and eat two - two - BLTs. They are only 5, so you are not breaking a bank (or even needing to break into one). So tasty! MMMMMM!\n\nI only ever had a heferweizen beer here, the name of which I cannot remember. The bar staff always knew if though, because they are seriously super-awesome people.\n\nGo here and have fun!", "author": "Andrew I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "Two 8 Two is a hidden gem! I swear! The burgers are the perfect size and they are very juicy. They are not too big and not too small and they taste great!  They don't have a greasy taste or oil dripping off of the bun and I appreciate that.  The prices are also very reasonable.  I also had the fries and onion rings and the fries are nothing special but the onion rings are good.  My mom ordered the lemonade and the waiter said it was sweet, but it was just the opposite, Very, very bitter!  My sister had her burger with their \"special\" sauce, but she said it was so good, she was using it for her fries lol. And if you are on a diet you can also order sweet potato fries.", "author": "CANDICE H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-26", "description": "Small burger, but it was pretty good. The patio out back was really nice, especially with the nice weather. Seems like a cute location and people brought a lot of kids but don't know that I'll be back.", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-25", "description": "YAY! Finally a great burger place in Boerum Hill.  We have probably been here at least a dozen times and brought our friends and family here.  We saw we were not the only fans when we ran into our friends here on two separate occasions.  Great burgers and amazing beer.  However--My only suggestion is that the greek salad needs some vinegar and greek accouterment.  I love greek salads and this one was really lacking.  When I asked for vinegar I was told the kitchen did not have any?  That seemed strange.  However, I will come back here again of course (and bring my own vinegar)", "author": "Jenna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "The food here is excellent - I had a green chili burger and my wife had the lamb burger.  We also had the feta fries - big enough for two to split.  Service was fine.  The only beef (haha - get it?) that I had with them is that for $10, a burger should come with fries.  They didn't.  Paying for extras can really set you back here.  Damn good burgers though.", "author": "Brian H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-23", "description": "Where is the common sense or hospitality that should come with a basic burger spot? This place has poor service and bad presentation. I've been twice and really tried to like it the second time since it is local to my home. The last time I went, my experience was worse than the first time. My mixed drink came after the dinner with the check and on top of that it was the wrong drink. They didn't even comp me the wrong drink that came. I'm pretty easy going but this is plain old bad business.  I wish it was a better spot because it is so close. Just so disappointing.", "author": "Evan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "They serve a great burger! The meat is delicious and the toppings as well. The sandwich could use some love though.", "author": "Jelmer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-05", "description": "The breakfast burger was amazing - juicy and full of flavor. \n\nThe service was friendly but I felt that the waitress was hovering over us a little too much -- some personal space would be appreciated. \n\nI took off a star because I think the place is too expensive, especially if you get drinks. The burgers/hot dogs do not come with sides so once you add those on, you are looking at about $12-15 per person for burger and fries. \n\nThe drinks are expensive and the one I had wasn't very good.\n\nThere is a good chance I might come back if I feel that I need a little burger pick-me-up.", "author": "brb b."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}