{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-05", "description": "N and I came here since we were in the hood and didn't know where to go that was close to the bike shop, so we came here.\n\nThe fries didn't taste so good - I felt they reheated them or it just tasted like they were.\n\nI got the breakfast burger - good, but the buns were cold and just wasn't into their buns.\n\nN got the lamb burger - that was good, but again...the damn buns.\n\nN liked their lemonade, but I thought it was just okay.\n\nCute place, but work on the fries and buns and then I'll come back.", "author": "Ro R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-03", "description": "With a lot of competition for burgers in this area, two 8 two definitely comes out on top. It's better than shake shack! Though, it's a bit more expensive. The burgers are the perfect size and the poblano peppers on top are a great touch. We also ordered the chili cheese fries, which were good but the portion was small. My friend ordered the nachos, which was okay.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-06", "description": "I completely disagree with Victor S.  (we are friends otherwise I would never call out a fellow yelper!).  Sorry namesake!\n\nI was here last week during the freak October snow with my roommate and her family.  I ordered the signature burger and my roommate and I got the sweet potato fries to split.  The burger was AAAAMAZING.  It was perfectly cooked, juicy, flavorful.  I mean, really, one of the best burgers I've ever had.  Truly.  Of course, when you make one thing (there are a few other things on the menu, but mainly its burgers), you better make it damn well.  They do.  The two 8 two sauce is really unique and a great compliment for the meat.    Also, the sweet potato fries were a delight.  I don't usually like sweet potato fries, but hot diggity did I like these.\n\nI should also mention that the entire table's burgers were cooked to perfection.  And apparently the regular fries are just as good as the sweet potato.\n\nTo top it off, service was friendly and quick.", "author": "Vicky L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-15", "description": "Beer\nList is\nBetter than\nAverage bar.\nSo are the burgers. Patio out back.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-20", "description": "I'm not going to talk about best burgers, because best is inherently impossible to define. What makes a burger better than another? Can you say one distribution of cheese is better objectively than another? One cooking style? One bun type?*\n\nYou can't, and that's the reason there are a thousand places in New York's five boroughs that make their own version of the American standard. Meat ... cheese ... bun. After that, it's personal preference and location that make all the difference.\n\nAnd that's why I say Two 8 Two makes my favorite burger in New York. Not the best -- that's impossible to determine. \n\nBut my favorite? That's an easy call. The 'Breakfast Burger' at Two 8 Two is culinary genius layered in between two of the softest, most delicious buns** you'll ever sink your teeth into. When you ask for medium rare, it's on the rare side instead of on the medium side. The egg on the breakfast burgers runs just enough to soak the bun, but never completely destroying it*** while the Two 8 Two sauce should basically be put on everything in the restaurant.\n\nThere are other things that come with the burger -- there are fries, which are pretty good, and they have the good sense to stock Buffalo Trace bourbon**** as part of the regular assortment of liquors. There's also beers and a nice patio that's an excellent spot to sit outdoors in the warmer weather.\n\nBut really, just order a burger or two***** and call it a day. You can't beat it.\n\n* - Yes, you can. Potato buns are better than anything else.\n\n** - Minds. Gutters. Out.\n\n*** - Perhaps because I ate it so quickly the bun never had a chance to fall apart.\n\n**** - It tastes like a double rainbow.\n\n***** - Better yet, go with a light eater who won't finish her burger, and then you won't feel like so much of a glutton.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "Stopped by here late night last friday with a friend for a late night bite and we were floored. I got a burger while my friend got a turkey burger both with fries and it beyond hit the spot! Throw in 2 bud lights as a night cap and we were sold. We walked in as they were winding down and had every right to tell us they were closing but the bartender could not have been friendlier and served us right away. Great chance find on Atlantic Ave near CG!", "author": "Matt V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "I'm a little late on my review as I was here on a double date about a month ago. But I remember all 4 of us feeling satisfied and content after our burgers and craft beers. Our waiter was exceptionally nice. Oh and the fries with cheese was very good.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "Ordered the pub burger, comes with bacon and their two8two sauce. This has to be the most juicy and flavorful burger I had in a long time. Their Bloody Mary is a killer, at 6 bucks. Very glad we walked in on our ways to traders joe. Want to order another burger but my gf is shaking her head.", "author": "matthew c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "Best burger in the city.  I'm not kidding.  I've tried hundreds of places and 282 is my #1 place.  Perfect fries too, plus my favorite beer (Weinstephaner) on tap.  The outdoor space is great.  They nickel-and-dime you on the burger toppings, and the cocktails are quite small, but those are the only bad things, and the burger is so good I'm happy to tolerate those.  Family- friendly, so note to the childfree: prepare yourself for a hundred strollers if it's daytime.  But it's still worth it!!", "author": "Debra D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-12", "description": "I have had many great burgers in NY and at the time I ate here, I was craving my balls off for a burger.  I met a friend at this place because he told me it was the best burger he has ever had and he was definitely right!  The sauce they put on is incredible and since I like my burgers rare, it was cooked (or not cooked) to perfection.  I ordered the 8 oz burger because the normal 5 oz was not doing it for me.  The fries/onion rings are very good, but you arent going there for that.  As for the place itself....\n\nKinda dark, big bar and good amount of seating in the back.  Good beer selection.  However, might be a little tough to find but try it and you will love it!", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-10", "description": "Cool little spot with a decent atmosphere.  The bartender was pleasant and all smiles (and it didn't hurt that she was easy on the eyes), and the rest of the staff seemed to be on top of things.\n\nOrdered my fav drink,which I normally have to describe, and it came out just right.  Got a cheeseburger and it was a 7.5/10.  It was cooked as I asked and was juicy and tender, but could use some more seasoning (same with the fries).  \n\nDrinks were solid, food was okay, and the bartender was great.  I would check it out again.", "author": "Eddie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-21", "description": "The billy burger was good, but a bit small. The sweet potato fries were what you would expect. They tasted like frozen sweet potato fries that were cooked. The service was mediocre. It was good to try, but not worth going back.", "author": "Pearl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-21", "description": "After Court today, I was sooo hungry...So I made my client walk over to two 8 two.  After having amazing food at a Yelp event, I was very happy to find that the place was equally as good today for lunch.  I got to sit outside and it was nice and cozy with the picnic tables.  In fact, after seeing 6 people sit at them, it was weird to just have 2 people at a picnic table.  The waiter was very nice.  The lemonade was decent but the cup was smaller than I thought it would be.  However, I had no complaints.  The burgers are always great and you can not really go wrong with any of them (though I have not tried to turkey burger).  The onion rings were decent as were the sweet potato fries...", "author": "Jamel O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-25", "description": "My husband and I love a good burger. We were so psyched when Two 8 Two opened up on Atlantic, because it quickly became a go-to where we knew we could get friendly and prompt service and watch some sports. Heck, once I even got to suggest a cocktail with some of the lesser-used liqueurs (sidenote: It was not a well-developed drink).\n\nThe staff is friendly and the burgers are juicy and come from a local purveyor. Good sweet potato fries as well. I fear it's just not a secret anymore that this is a solid place, because I tried to go last Thursday and the place was packed at 8:30pm.  Writing this review reminds me that I should go back soon. Now, if they'd add some dessert options to the menu (dessert burger anyone...with donut buns?)....", "author": "Cara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "Fantastic burgers and draft beer selection, also great service and ambience. I had the Pub burger with a delicious glass of Bells Amber on draft-  Sated !", "author": "Colin A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-27", "description": "Great Burger, great little outdoor space for squirts.  This place is a little light on atmosphere, but is perfect for kids and the burgers are legit.  Similar to a shake shack burger (I used to call them west coast burgers; Bistro Burgers were NYC/ east coast archetypes), but bigger than shack burgers.  We went at 6 on a Sunday and every other group there had kids, which was really nice.  \n\nDelicious spot we will definitely return.", "author": "Elias S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "The workers here are so polite and helpful. Two friends and I were trying to find a place to chow down with our dog. We called them and asked if we could bring her, she's 12 pounds and super quiet, into their patio space so we didn't have to leave her and they were super accomodating with us. The server actually brought our dog water first before us! A+ my man! \n\nTheir menu is small which is perfect for the indecisive type like me!\n\nGot the Two 8 Two burger which was delish! Their house sauce is very tasteful and burger cooked to medium rare just like requested. I shared with a friend (we weren't too hungry) and it was enough. The side of fries are worth it as well. You get a good amount for what you pay for! Also, their happy hour drink that day was a mixture of lime and whiskey. Sweet and powerful.\n\nFinal word: Will come here again.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-14", "description": "Not gonna lie. When I passed two8two countless times before it opened I thought, what a dumb name. That place is probably gonna suck, just like most the other places on Atlantic.\n\nHappily for me, this place rocks, and it's only 2 blocks from my apartment (convenience + deliciousness - the perfect combo).\n\nTo be honest, I knew it would be good as soon as I walked in, as I had a celebrity sighting - Yelp's very own Peter D. was leaving as I entered the place.\n\nAnyway, onto the food. I love the burgers. They're not overly large - they are the perfect size and don't make you feel gross. I always get the house burger, which comes with pablano peppers, and is juicy deliciousness. The buttered buns don't hurt, neitha.\n\nGood selection of taps. I would stick to the beer here. Depending on who's bartending, the mixed drinks can be great, or they can suck. For example, the first time I ordered a mojito there, it was one of the worst ever. Then, remade by the tall gentleman waiter who works there most nights, it was way superior. \n\nSides are good too. Greek fries, sweet potato fries, normal fries. All quite good.\n\nVibe is homey, chill (wooden chairs/table, minimal) with picnic tables in a small garden outside. Good for a chill first date or just a night out that's low key.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Phenomenal.  Looking for a quick bite while staying at Nu Hotel.  Staff recommended two8two, which was conveniently located and open late.  Both drinks and cocktails were great.  Burger was cooked to perfection and something about the grill added amazing flavor to the cheese, and the beef just crumbles in your mouth (this might sound like a bad thing, but trust me that it's not...).  Highly recommend.", "author": "Sancho T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "If you like beer and burgers this is the place...... Local beer companies and there pub burger are great will go back in a heartbeat.......", "author": "Joselito M."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}