{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-01", "description": "Given the great reviews, I was hoping for a pretty special burger. Unfortunately, the Burger was pretty average for a ten dollar burger. It was juicy enough. Fries and onion rings on the side were fine.\n\nNothing to write home about...\n\nIf you can't do lactose - make sure you get it bunless - there's dairy in their potato buns.", "author": "Matthew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Got only the Two8Two burger without fries and the peppers with the two8two sauce was a great flavor combination but the bun was too small for me. I actually ended up eating the burger with a fork and knife because the buns were not enough for me. I would try something else when I go next time but I do believe I am going to try Junior's since its so hyped.  \nDid not like that a burger did not come with fries but that you had to pay another $3.50 or more for them. Just makes me second guess it when I do not want to.", "author": "Jerrius J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "Great burger! Veggie burger that is. Close to our Airbnb and loved the ambiance. I would definitely return. Wine was ok - should have ordered a beer.", "author": "Dayna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "Was looking for a delicious burger somewhere in Brooklyn for the days Im too lazy to drive into the city or Astoria Queens, glad I found this spot.\n\nMake the trip from sheepshead bay and its worth it. All the bartenders are cool, most the time Scott takes care of me. \n\nI really like the cigar city IPA, greek fries are delicious and the burgers are cooked to my medium preference, prices are very reasonable for this part of town. \n\nNot too many sport fans but they have 2 tv's playing games at the bar.\n\n\nI see some people saying the burger was average for a ten dollar burger, they were expecting something special. I say it's pretty damn delicious for a $10-$14 burger. I tried burgers in steak houses, and IG famed spots, paid $25+ and sometimes felt those burgers should've been $10.", "author": "Leon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-03", "description": "Awesome burgers and beers!  Friendly staff. Had an enjoyable experience. Highly recommend Two 8 Two Bar \u0026 Burger.", "author": "Lankester M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "I've order delivery and come to dine-in a few times, and whenever I'm craving a turkey burger, I usually end up here! It also helps that my favorite nail salon just happens to be right next door. You should also try their regular burgers (my other half likes their cheeseburger) and the greek fries. In short - solid burgers and excellent delivery service!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "I've had some great burger experiences here.  I would say that I enjoy sitting at the window while enjoying a \"Billy Burger\" and an IPA.  I prefer to go when it's not quite busy with happy hour crowds.  Late afternoon is preferred.  The burger is simple and juicy. I believe they source their ground beef from Paisanos Butcher shop on Smith Street.  I really enjoy the shredded iceberg lettuce that sometimes accompanies the burger.  They don't always give you lettuce so I make it a point to ask for it.  Also their pickles are really good alongside the burger, I usually get an extra side of pickles.  I wouldn't say the fries are the best, but I tend to go for the sweet potato fries.  All in all, this is a good spot if you enjoy a simple burger and a beer.", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Great time yesterday at two8two!  My friends and I were looking for a place with happy hour and decided on this place. They had two options. A draft beer and a bourbon limeade. I went for the bourbon drink and ended up having three. Very tasty. We sat in the area out back on the picnic benches with umbrellas. It was a nice size with about 4 tables. \n\nSince we were drinking we needed something to eat. The burger options sounded very good so we went with those. Two breakfast burgers and one other. I can't remember the name. All very good. If you prefer your burger a certain way they will arrange for it. Very accommodating. \n\nWe would definitely return again!", "author": "Cortney W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "I actually give this place 3.5 stars. I was in jury duty and I couldn't wait to go to lunch. I scrolled through my bookmark areas and came across this place. I was so hungry I couldn't wait to sink my teeth in a good a$$ burger. When I walked in the place was pretty empty and I just took a seat at the bar. I couldn't quite figure out what I wanted so I ordered the lamb burger and a mojito. The lamb came with a tzatziki sauce. I ordered a medium burger and received a medium burger. So far a thumbs up. As I sunk my teeth in the burger I was waiting for my tastebuds to jump alive, but they just skipped. The lamb wasnt bad but it wasn't omg great. You could definitely taste a lot of middle eastern flavors in the lamb burger. My tzatziki sauce was good but it would have been great with a little bit of bbq sauce added to it. Unfortunately, they do not have bbq sauce, so I opted for the house sauce. It was an ok mesh buy bbq would have been better. My mojito was really good and made with fresh mint and lime juice. I'm adding that into the details because some people give you artificial mojito juice flavors and not actual lime juice. Like I stated earlier my lamb burger was just good not great. However, I can always eat a burger. Next time I will have my all american meal and fries.  So, I will be back to try another burger. The staff gets an A+ for friendliness and service.", "author": "Nadia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-31", "description": "I enjoy the burgers here.\n\nThe drinks?  Depends on who's tending bar that night.  I don't know names - but the girl - she's great.  Drinks are spot on.  The 2 other dudes?  not so much.  They aren't bad, just not well balanced (and depending on what you order)\n\nIf i see it's one of them, i'll stick with a straight bourbon or something else you can't mess up.", "author": "Jiimy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-29", "description": "I came here for lunch with a friend and had the chicken burger and fries. The burger was okay but the Greek fries were amazing. I want feta and oregano on my fries always. To drink, I had the iced tea, which was light and tasty. Service was good -we received our food timely.  Staff was very friendly. I don't eat beef so burgers aren't really my thing, but I will definitely be back for two8two's fries.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "++\n- two8two burger is good\n  (Poblano peppers are not spicy at all!)\n\n+\n- onion rings are real\n- bartender is conversational, he knows how to play the room\n\n-\n- Small ass burger", "author": "renje g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-04", "description": "The burgers were great and so were the Greek fries. Great size burger and super tasty.", "author": "Corinne C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "I've been meaning to try out this place for the longest time and boy, am I happy I did. It's a large space with plenty of bar seating and a huge area in the back along with a backyard patio and it's dim, warm, and inviting - perfect for a lowkey date night or to throw back a few drinks with your friends.\n\nFirst off, their pub burger is incredible. The grilled onions are perfect, the cheddar cheese is melt in your mouth, and even though the bun is one of those barbecue buns you can buy from Wonderbread or whatever, it's actually perfect for the burger because you're not there to eat bread. You're there to eat MEAT. The two8two sauce is some sort of mayo-based topping, a little sweet and a lot savory. My only complaint was that my burger was a little bit on the salty side, probably from the 8 oz patty and the bacon all rolled together, but listen, I'll take a little bit of dehydration for something that delicious.\n\nThe onion rings were nothing to write home about, but honestly, I was so happy and joyous after that delicious burger, I didn't even care. This is worth every ounce of hype, I assure you.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-15", "description": "So my friend and I came here on a Saturday evening. We were seated in the back after about a 4-5 minute wait. We received the menus right away, our waiter was cool I don't remember if he gave us his name or not. My friend and I ordered two burgers medium well (one with no bun, you can request it be wrapped in lettuce instead) with the chili cheese fries my friend also got the strawberry shake. Sadly my burger came out medium and I don't like my burgers medium but I ate it anyway. The beef is very fresh unfortunately it lacks any sort of flavor not even salt and pepper the bacon that was on top the burger didn't even help, also they gave me what seemed like a whole lettuce head I ended up leaving most of it on the plate. My friend said the burger bun was really good. As for the fries there was nothing special about them. I didn't try my friends shake but she said she could taste the artificial syrup at the bottom.  All in all I won't be coming back here there was nothing spectacular about this place. But feel free to take your chances !", "author": "Andria A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-08", "description": "I came here with friends. Good food, cozy atmosphere and good prices. The service was kind of slow but otherwise I would definitely come back. Parking is hard around that section of Atlantic Avenue so walk from the train but otherwise no complaints.", "author": "Chelsea H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "The burgers here are absolutely amazing! We will be returning for more when we travel back to Brooklyn.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "Went for lunch, their burgers were really good. They were always friendly and accommodating (party of 7, including a toddler and a preschooler). Kids loved their food and everyone was stuffed to the point we didn't even want to hear about the desserts.  We'll be back for sure", "author": "Juan Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-02", "description": "I've been here a few times and there hamburgers are consistent. There cooked correctly and the buns and hamburgers are good. It is very good that you can rave about it? no. Is the quality there? Yes. I'm a fan of the standard cheeseburger which let you enjoy the hamburger meat without all the frills($8). This is a very reasonably priced burger for the quality. I also enjoy the half bacon half beef ground burger. It's called the 50/50 it's also very good. The fries with the feta cheese are really good if you enjoy feta cheese that is. \n\nThe milkshakes even though they use blue marble icecream which is very good quality the actual milkshakes are nothing special and they don't have a large selection of flavors it's simple vanilla black and white caramel etc. \n\nI would go back for the occasional beer or simple burger.", "author": "Marlena K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-20", "description": "The Bar and the Burger. Simple, wonderful, and shouldn't be hard to execute. Fortunately, two8two wears the mantle well. I've been here twice with my wife. Once, we sat in the back garden with a group, the second time we sat alone at the bar. Both times we had excellent service and both times we had good brews and burgers at a decent price. \n\nNote: the food is a la carte. If you order a burger, that's all you are getting. This is a detractor for some, and I admit I think it's pretty lame, but it is what it is. Sometimes it is unfortunate to live in New York.\n\nPersonally, I think the buns are too small. Both times I have been here, the bun on my burger has been a bit smaller than the burger itself. This, I am not crazy about. Also the bun itself is not the large, substantial bun I am used to with a burger. It is small and low-profile like the little potato buns you can get at the supermarket or like a fast-food-style bun. That, however, is the only comparison to fast-food I will make here as the quality of two8two is anything but. Regardless of my complaint about the bun, I just can't be mad at it. It may not be my preference, but the burgers are delicious anyway and it's certainly not a deal-breaker. \n\nMy wife and I have had an all-around great experience here and we will be back.\n\nNote: there is not a terrible amount of seating here but they do have a large bar to sit at. If you have a group or it is a peak hour, call in to check what the deal is so you don't end up waiting too long. Not sure if the outdoor seating is seasonal only.", "author": "Jordan B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}