{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Love love love the Billy burger with lettuce, tomato, and onion. They cook it to your liking and it comes with a \"two8two\" sauce that's tangy and delicious. I get my burger pink/medium and it's always perfect, juicy, and super tasty. My friend got the turkey burger and he said that it was good as well. \n\nThe fries are great too.. Especially the Greek fries which come with feta cheese (yummmmmm).\n\nService is always good with friendly waiters. Atmosphere is very laid back and chill. Highly recommend if you are interested a great burger in BK!!", "author": "Nneka M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "This is going to sound odd, but I crave a good burger after a great workout. And so, we ended up at Two 8 Two. I got the Billy Burger which comes with grilled onions, two8two sauce, and cheddar cheese for $8. It was juicy. It was cooked exactly how I asked it to be (medium). It was just overall a really tasty burger. My girlfriend got the Two8Two burger which is $9.50 and comes with roasted poblano chiles,cheddar and two8two sauce. She thought it was delicious as well. We split some sweet potato fries $4.50, which you can't really screw up, but they were good! Crispy and hot upon arrival.\n\nGreat, casual ambiance. TVs at the bar. Affordable, good food!\n\nI'm only knocking it a star because the service wasn't the best. But, everyone has an off day. So, I'll definitely be back for more burger greatness, and will re-review if the service is better! There are for sure a few more burgers that I want to try on the menu.", "author": "Michelle P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-06", "description": "Good Burgers, Good beer selection, grab some friends and enjoy. In addition to the burger I ordered some nachos and they were ok. Sweet potato fries are yummy and regular fries as well.i would most def come thru again.", "author": "Luis B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "Shitty service, waiter clearly so bored with serving us.   Burgers were mediocre and the table was so shaky we could barely eat without spilling our drinks...which took forever to come tiny tiny drinks for the price and the jalapeno margarita sour.\n\nSo many great places to eat in Brooklyn I will never go here again and I suggest skipping it.  Anyone who likes it is probably a friend of the staff because it appeared they were all huddled in a corner and ignored the general patrons.", "author": "Mapleaf K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "You like burgers? You like beer? There's a shit ton of burger and beer joints in Brooklyn Heights. Shake Shack and Bareburger serve beer, so why come to this no-name joint?\n\nBecause it's the fucking best burger you'll ever have. Feeling like a glutton? Get the breakfast burger? Otherwise get the Billy Burger. Their sweet potato fries are perfect. Their beer selection is great. There's an outdoor patio in the back. The ambiance is welcoming and friendly. I've had great dates and great times with friends at this place. \n\nI fucking love you, 282 and your \"melt in your mouth\" burgers. Never change.", "author": "Sherief M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "Rob is great. The mixed drinks are well made and the beer menu celebrates some local brews. The comfort food is excellent.", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Only in New York do bachelor pads and burgers often cost a fortune.  In any other city, the average offering of each would be reasonable.  Here it's tough to find a decent burger in the single digits.\n\nBut there are spots you can try hand-made, non chain burger for under $10.  In fact, I was happy to walk near Two 8 Two and noticed a sign promoting their lunch specials.  For around $8, you get one of their burgers and and a big plate of fries - a pretty good deal in any city.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "Found this place from grubstreet's list of burger places to check out in NYC, and I was not disappointed. The Pub Burger is a must try. It also has a full bar and a few tables too, so a good setup to grab a couple of beers with the burger of course :)", "author": "Kishen P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-16", "description": "The bar is fine but the food is pretty lackluster. I ordered the veggie burger and was greeted by a soggy bun, sad shredded lettuce, and a Dr Preagers California burger patty. If I wanted a frozen veggie burger, I would have just eaten at home. My partner had a regular burger and thought it was so so. \nYou're better off eating at home than here.", "author": "Douglas C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-12", "description": "I came in here from the good reviews on Yelp. It took the wait staff a couple of minutes to seat us, even though they weren't too full up. By the time we sat down and took a look at our menus, nearly all the tables filled up. Before we were seen for our drink order, two tables seated got drinks and their orders taken. When we were seen by the waiter, he apologized for the wait as he was alone. No worries, I get it when you're slammed with folks and you're on your own. Sucks. So we cut him some slack and ordered some food and waited. Then tables who were seated after us, got their food before us, which made us a little prickly, because we were hangry. And after that, my partner's burger which he ordered medium rare came our medium to well-done. When I flagged the waiter over to address it, since my partner said it really wasn't good and not what he wanted, the waiter argued with us about how that was medium not well-done, even though we had ordered it medium rare and told him that and the burger even came with a little M. RARE flag in it. Throughout the exchange, the waiter was passive aggressive and condescending to us. The onion rings were superb, but other than that the food was meh, especially with dealing with that waiter. I'm sure on another night he would have been fine, but the whole experience just seemed to snowball into a bad dinner.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-14", "description": "Skip this place. Attitude from both bartender and waiter and for no reason because they weren't hot or cool. It's a crappy diner with a bar up front  that's trying to be hip. The place is in desperate need of an update with the old Starbucks interior. My friend and I both ordered the 282 burger and got sick that night. I called in sick to work the next day because of it. The burger was small and didn't come with fries. For $10 at a diner, you should at least get fries with the slider size hamburger. Too many good places around to go here again. My guess is that it will be gone soon.", "author": "K C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "Best burger in Brooklyn; nay, best burger in NYC hands down. Great cocktails, good service, good ambiance. They make their burgers from meat from a local butcher. Their lamb burger is legit too!\nMy wife, who is vegetarian, raves about the veggie burger.  \nWe come here once a fortnight at least and it never disappoints!", "author": "Idrees D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-21", "description": "A bit of a let down since we have a lot of great burgers in Los Angeles. \n\nThe presentation of their burger was quite boring for a gastropub.  If I am going to pay $9+ for a gastropub burger, they better make it look appetizing. They just plop the chilis on the patty and on the side, you've got cheap looking mound of iceberg lettuce a sad looking tomato as if I'm dining in a high school cafeteria.\n\nThe service was just OK and a bit non-existent.  \n\nI felt that i should have instead visited the Shake Shack, but felt that I should have chose Shake Shack instead since the burger was good, but not extraordinary.  I had Shake Shack at JFK and was already quite impressed with the entire experience. Their burgers just looked more \"happier.\"\n\nWhat's interesting or unusual on the burgers we order was the chili placed on it.\n\ntwo8two Burger  9.50\nHamburger with roasted poblano chiles,\ncheddar cheese and two8two sauce\n\n50/50 Burger  11\nNew! 50% beef and 50% applewood smoked bacon with roasted poblano chiles, cheddar cheese and two8two sauce\n\nDraught beer selection:\n\nDRAUGHT BEER\nHefe Weissbier - Weihenstephan - GER 16oz  6\nCelebrator Doppelbock - Ayinger - GER 10oz  7\nPivo Pilsner - Firestone - CA 16oz  7\nIcculus Kšlsch - Barrier - NY 16oz  7\nSculpin IPA - Ballast Point - CA 16oz  8\nPale Ale - Stone - CA 16oz  8\nShakespeare Oatmeal Stout - Rogue - OR 16oz  7\nHop Rod Rye - Bear Republic - CA 16oz  8\n\nThe burgers here are quite small and felt that I can get a bigger and better burger in LA.  Hey, but this is NYC and everything I ate seemed expensive and is to be expected.\n\nI can definitely get a better burger at a gastropub in LA. However, I am a fan of the beer selection as they had some hard to find beer on draught. Some you can't even find in LA gastropubs.", "author": "Anne Explores LA +."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "I recently came to two8two for a friend's birthday lunch.  It was insanely simple to get to and it's right across from the Brooklyn Detention Complex.  Safety first!\n\nWhen you first walk in, there is a decent sized bar.  In the back there are a few tables, as well as a patio area outdoors.  We were quickly seated and given menus.  While the menus look simple, there is actually a lot to choose from....And they're vegetarian friendly!  We decided to start with some nachos and beer.  The beer selection is great and offers a lot of craft beers, rather than the typical beers many other burger places offer.  We had asked for the nachos to not have meat.  The first batch had meat and our server was very nice and took them back to have them re-done.  No hassle there.  For our entrees, we had grilled cheese (I had with chiles, my friend had with tomatoes and chiles), and the birthday girl had a lamb burger (which is only available sometimes).\n\nThe grilled cheese was tasty but they could have left off some of the chiles.  They were tasty but there were far too many.  The sweet potato fries were cooked perfectly.  I feel like many places screw up sweet potato goodness, so this was refreshing.  Our friend said the lamb burger was also tasty.  \n\nThe service is fast and helpful, the food and drinks are low-price (happy hour runs until 7 PM), and the atmosphere is very retro and cool.  Next time I come here, I definitely want to try out the veggie burger.", "author": "Kristy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "One of the best burgers I had in a long time. I highly recommend the lamb burger that comes with tzatziki sauce. Will definitely come back again!", "author": "Seeohme M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-18", "description": "This is a decent place to grab some lunch. I had the protein burger (lettuce wrap instead of bun) which is super healthy and I was really glad to see they had that option. The burgers are a good size, not too big not too small. They're not the most amazing burgers I've ever had but they're good. I also shared the Greek fries which were good. I didn't have any drinks so can't comment on those. Service was great and prices aren't bad. Overall, it's a safe bet if you're looking for somewhere to eat in the area.", "author": "Pooja C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "The two8two burger is hands down my favorite burger in all of NYC. Juicy, melty, topped with cheese and poblanos, it is delicious every time. They also have great fries and even a great Greek salad.", "author": "Shira T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "my family and I absolutely LOVE this place! service is fast, customer service is great, and the burgers are amazing!!\n\nask for John when you go, he's the best!", "author": "Teadae O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "Really enjoyed the blackened chicken sandwich from this place. The sandwich was juicy, tender, and well served. The only thing I would suggest is a stronger bun to hold together all the deliciousness. Also, the onion rings are crispy and cooked very well! New spot!", "author": "Malique S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "Absolutely love the burgers at this place! I went here with a few friends and the food was amazing. The Greek fries were the bomb.! I had the \"Pub Burger\" which was amazing! But I tried some of the other burgers they had and all of them taste really good. They get a resounding 10!, in my book  as far as burgers go! If you're getting drinks stick to the beers.", "author": "David L."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}