{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "There is little that can remind you of what a charmed life you lead than waking at noon, heading to two 8 two, and having a breakfast  burger ($9) and a beer. This is a wonderfully seasoned burger with fried egg, bacon and cheddar. It's decadent, juicy and you feel good about yourself for eating breakfast !!\n\nOr maybe your shopping in the area and want a late lunch. Grab a seat at the bar, talk to one of the friendly bartenders ( Melissa is super ) and order a Billyburger ($7.50). A \"simple\" burger with cheddar and grilled onions -- it's so good you'll be mad at all the bad burgers you eaten elsewhere.\n\nI've been here numerous times since yelp event years ago and the quality has been consistently high. If there's a complaint it's the hamburgers are so good I haven't branched out and tried lamb, turkey or veggie burger yet.\n\nThey use locally ground beef ( from Los Paisanos-- review coming), have a nice outdoor area and staff is always accommodating. \n\nLead a charmed life and satisfy your burger cravings here.", "author": "James F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "So I had a date who I wanted to impress and we were talking about burgers and first I suggested Burger on Smith, but then remembered the last time I walked by it, it kind of looked closed.  A quick check on Yelp confirmed that.  So I looked for similar places and this popped up and based on the reviews, it looked like a winner.  \n\nAnd it was!\n\nVery nice service, decent beer selection (although my Weihenstephaner didn't taste quite right.  Maybe they don't sell that much and the tap lines aren't too clean?  Not sure but I drink enough of it to know when it's off) and the food was great.  I loved the fries..they seem to get some bad press here.\n\nThe breakfast burger was great.  A bit messy but so, so delicious.  \n\nAnd the date seemed to go well, so we'll see how that works out.  In the mean time, here' s a great place to get your burger fix.", "author": "Bill T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Really good burger here. The net/net is that it's cooked to order fairly perfectly and comes out looking good and not dilapidated and, really, what more could you ask of a burger place?\n\nHad the Pub burger - grilled onions, cheddar cheese, bacon on top, with their version of ketchup/mayo (2-8-2 sauce). Inhaled. Gone. Never to be seen again.\n\nThe menu is short and concise, which I appreciate. Get the onion rings, skip the regular fries. Outdoor seating with shade!", "author": "Cerca T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-16", "description": "It's alright. \n\nI usually go there with my coworkers for lunch maybe once a month or so. The burgers are pretty good and reasonably priced. $5 for a Firestone Walker pils is a good deal. A lot of the other beers are overpriced. \n\nI really enjoyed the protein burger, even though my coworkers consistently make fun of me for ordering it. I think there's some kind of irony going on with skipping the carby bun and then getting fries and a beer. WHATEVER.\n\nBut, there are  problems. I don't know why the owner of this place can't install proper ventilation in the bar. Every time I leave, my clothing smells like I've been cooking in the back of a McDonald's. I assure you, this isn't an understatement. C'mon guys, fix it.\n\nThe other problem is the mustard. Look--you're selling gourmet burgers and blabbing about your roasted anaheim and poblano chilies. Why the hell are you giving me disgusting, bland, yellow mustard? It should be whole grain or, at the very least, spicy brown. \n\nWe'll probably keep going back to 282, but there are a lot of pitfalls about this place. I may have to bring my own mustard, because they're too cheap to supply one that's halfway decent.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-15", "description": "Half and half burger \nPretty tasty but dirty \nPlate and one bad drink*\n\n*one of the tequila drinks was bitter as fuck- couldn't finish", "author": "ReviewHaiku F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "Wow!!! I was at a venue at the barclays and decided to stop by and try a burger here. Holy cows, the burgers here are out of this world. I thoroughly loved these burgers, they were sosososo delicious.? We had the half and half burger with the poblano peppers and extra bacon, yum's. I will 1000% come back again!", "author": "Anthony B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "This is a bar and the food is great. It's dark and mysterious in here but it's cool at the same time. My sandwich was smooth, hot, delicious and mouth watering. The strange this is it didn't have lettuce or tomatoes on it and I love both. For what I had it worked totally. I should have purchase two but that would be me being greedy. The location is cool with me being that it's on a main street (I think).", "author": "Jason J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-15", "description": "Nice, casual place.  I would have enjoyed a nice brioche bun or something, rather than the standard restaurant supply bun they use.  The patty was cooked to my request, which is great but the quality didn't seem amazing.  It was pretty weird having the server browsing the web, on their laptop, standing right next to our table.  Overall, I think this place is a good option for the area.", "author": "Heath C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "I came here as a last resort since the place I wanted to go was not serving food due to technical difficulties. This place was really spacious and clean and luckily there was not many people when we arrived. The host /waiter gave us the option of sitting outdoors or indoors and we sat outdoors. The outside seating was pretty small but we big enough to fit 4 picnic tables and seats without feeling so claustrophobic.\n\nThree of my friends and I ordered the Billy burger (hamburger with grilled onions, cheddar cheese, and two8two sauce) which was affordable ($8.50) and it was a decent size with a side of thinly sliced tomatoes and shredded lettuce. My 2 other friends ordered the lamb burger (ground lamb topped with house made tzatziki sauce), and the 50/50 burger (hamburger + apple wood smoked bacon with poblano chiles, cheddar, and two8two sauce) which was slightly more expensive but was really good. As a table we ordered sweet potato fries, fries, and nachos. We came here on a Sunday afternoon and luckily there was happy hour for mimosas, bloody Mary, and the St. Germain's cocktail, all costing about $6-$7. I ordered a mojito which cost $9.\n\nFood: the burgers were a perfect size that didn't make me extremely full, my personal favorite was the sweet potato fries \nAtmosphere: really spacious, roomy, and perfect for a date or hangout with a group of friends\nService: really food customer service, friendly waiter who even cracked a few funny remarks\nPrice : affordable ($7-$15)\n\nI really recommend this place if you are hungry for a small bite to eat and catch up with friends around the area. The food are a decent size and the drinks are delicious!", "author": "Ladiny P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-25", "description": "Wasn't really a 4 star burger. The bun was super small and cheap, fries were previously frozen. Far from acceptable.", "author": "Masih T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Literally love this place! We come often, the burgers are great especially the billy burger. BLT is our second favorite! Absolutely worth trying!", "author": "Ashton K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "I had the 50/50 burger. So delicious! I was expecting a bigger burger, but I was happily satisfied. It was a half beef/half apple smoked bacon, which you can taste once you bite into the burger. The burger was topped with their signature sauce, grilled poblano peppers and cheddar.\n\nI also had the Greek fries with feta and oregano. They were delicious, but I have had better in Astoria.\n\nThey have free wifi and an outdoor space.", "author": "Deirdre L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "Came here Saturday July 4th to grab something quick to eat before catching the fireworks by the Brooklyn pier, it's 4th of July why not eat a burger and we want something quick, why not! Well, it took too long, place was half empty and medium burgers usually take around 10 minutes to grill (things you learn when you used to work in a steak restaurant).  \n\nWe got the 50/50 burger which is half beef and half apple wood bacon with poblano chiles - this was A-OK, though it would be better. \n\nThe Billy burger - this was wayyyy better, the right ingredients and it was juicier than the 50/50 burger.\n\nFor sides we got regular fries and sweet potato fries.\n\nFor drinks we got the classic blood orange margarita, I must say that it taste close to the ones that I make.\n\nOverall review: burgers are the size of shake shacks and it's not too big, go for the sweet potato fries as a better option. Ask for extra Two8Two sauce on the side and the blood orange margarita is a must try.", "author": "Lisa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "I am leaving second review of the place. My first visit was Ofer 2 years ago and we just had our engagement party there. I cannot stress how wonderful this place is. The amazing food, attentive friendly staff, comfortable decor. One of my favorites and a must must go.", "author": "Rob H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "Not sure how it is on a normal weekend, but I came around here on a snowy Saturday afternoon with barely anyone around. Easily was able to get a seat with quick service to boot.\n\nOrdered the breakfast burger ($10) and Greek fries ($5). Burger was hearty despite its diminutive size, while the seasoned fries were bundled together with a healthy helping of feta cheese. I would say it all was \"pretty good\" . Not in the running for best burger but really hit the spot on a cold day. \n\nNo real frills about this place. A few tvs, a basic bar setup (with several crafts), and a pumped up bar food menu. Can't go wrong coming here.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-04", "description": "I called to place an order on my lunch break, that was OK but when I went to pick up my burger the order was wrong. I should haven known something was up when they didn't know which one was mine and it was missing fries. It also kinds suck that I didnt get an apology for the inconvenience of having to come back and lose time.", "author": "Lourdney J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Friendly service! There was a small error on our order so the waiter gave us oinion rings on the house. Got a burger with a fried egg that hit the spot.", "author": "Aron L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Straight forward, no frills, killer burgers. \n\nFriendly staff, outdoor seating, couple of tvs, and decent enough selection of drinks. \n\nPrices are great too. Not sure what else you would want in a neighborhood burger joint.", "author": "John W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-02", "description": "Theres something to be said about missing a neighborhood joint for two years, going back and the food and service is still awesome!!!\nWine list needs sum vast improvement and we wont discuss the extremly limited bourbon list (read: tribute to cautiously avoiding all things hipster) the burgers make up for the limited alcohol choices.\nPraise jah for awesome burgers in lieu of neighborhood gentrification", "author": "Devine G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-08", "description": "Got the lamb burger. It doesn't look the most appetizing on the plate but it tasted phenomenal. A bit pricey since it doesn't come with fries or salad on the side and portions were small. Good selection of draft beers.", "author": "Na S."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}