{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "Great casual spot with just really simple, delicious burgers. I tried the breakfast burger which came with cheese, bacon, two8two sauce and an over easy egg. Onion rings and fries also very good. I'll be back...", "author": "Kim S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "It just dawned on me while scrolling through list of restaurants near me that I have never written a review of this place...\n\nI have been here probably 15 times as I live just over a mile away. By NYC standards a far walk but read on and you'll see I'd walk much further.  I can honestly say this is the best burger spot in the city.  It is probably the best burger I've had. After the first time I went to Umami burger I thought it was  the best and this a close second, however the second time I went to umami it was not as good as the first, still good but the bun a tad dry and burger just the slightest overcooked (I have been there twice). This place consistently delivers great quality every-time. I have never been disappointed. I bring out of towners every-time and they are always blown away. \n\nYou can order any burger they have it does not matter. However I love the breakfast burger or the signature 282, the homemade sauce is a creamy, spicy, rich ketchup type (I once joked spicy, dank Big Mac sauce but I know.. I know..), and the roasted poblanos just take it over the top. I'd guess the meat is 80/20 because it gets messy (I'm a MR guy, if you go over that then well I can't imagine it would matter where you go to get a burger...). Size wise they are a tad small but most good joints are. I usually skip fries and get two burgers. However, the fries are awesome, sweet potato fries are as good as you'll have. \n\nI've seen some complaints about the service. This place has a good cocktail list so if you sit at the bar you might have to wait a bit to even be acknowledged.  But the drinks are really good especially at the 12 dollar price point. I think they know they have regulars and if your smart you ll wait. I have sat in be donning room a few times and service is usually decent. Would maybe go for 4.5 due to the service. Def can't give this place 4 though just because the burgers are that good.", "author": "Colin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "Dear breakfast burger and Greek fries,\n\nSimply amazing as always.. Always on repeat like your favorite song..  Delicious .. Did I mention delicious? Nice to enjoy such a juicy burger with amazing fries while sitting out back under an umbrella.. A favorite of my two children and I.\n\nThank You two8two", "author": "Melanie J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-06", "description": "I did like this place, it can get crowded in a hurry but If you are not in a rush try it. The service can be much better if only they were just a tad bit more attentive. I think the service focuses so much on the front where the bar is located that they forget about us hungry heads in the rear. I came here just for a plain and simple burger with cheese and that's what I got. The burger was good, a little on the small side and needed just more seasoning but I could not complain because it is filling, unlike other places which gore you to death with food for 10! The sides are good and i enjoyed the sweet potato fries. Start off with a drink the bar mixes them well. if will definitely come here again.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "All I can do is rave about their burgers. \n\nEvery time someone visits me in NYC, I bring them here. The Greek fries are phenomenal (big enough for 2). \n\nIf you are a huge bloody Mary fan (like myself), make sure to get one. It comes with bacon salt, so need I say more?", "author": "Katie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-04", "description": "Great place, love the all wood furnishings, classic pub set up.  The drink list is great, can't sing its praises enough, must come back to throw back some drinks.  They have a protein burger!!! (Lettuce wrapped, bunless!  #PraiseBe.)  The 282 sauce was yum, chill cheese fries were standard classic.  The bunless lettuce wrap was pretty to look at not exactly constructed to rest readily but the taste made you forget that, so yum.  The only complaint was the clientele with the screaming children, this is Clinton Hill so I guess it's to be expected, but it was a dampener, although not the establishment's fault.  The service was prompt and super friendly and knowledgeable regarding the menu.  #GreatSpot will be back", "author": "Roberta H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-08", "description": "I really can't say enough good things about Two 8 Two...I've always had a great time here. Burgers are simple, fresh, and filling. Prices are very reasonable - especially for the area. The staff is friendly and attentive but knows when to back off and let you enjoy your time either inside, at the bar or on their cute patio out back. There are solid drink choices with a great rotating beer selection. The atmosphere is warm and relaxed and I swear they are playing music directly from my iTunes library every time I go. \n\nFavs include the Billy Burger (try it with a lettuce bun!), onion rings and Crispin Hard Cider. But really, everything on the menu is a win. I'm already thinking about my next visit....", "author": "Colleen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-03", "description": "Top 5 Burger joint in NYC. I came here once a couple months ago and I need to come here again. Multiple times. \n\nMe and my friend decided to sit at the bar and watch some TV to eat with the burgers. The atmosphere was outstanding as we had numerous conversations with the people also sitting at the bar and eating their food as well as the waiter/bartender. I ordered the two8two burger which was delectable. IDK what the ingredients of the two8two sauce is but I can only imagine that it's suger and spice and everything nice. The next time I come back here, I want to be able to bleed two8two sauce. \n\nNext time I come here, I need to remind myself to try one of their dogs.", "author": "Hasib H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-30", "description": "This is pretty much one of my top New York burger joints! The Two8Two sauce is amazing, the buns are perfectly toasted, the burgers are amazing....what else can I say! Great sweet potato fries, too. The bartenders and servers are always nice and attentive. My only complaint was the last time I was there, there was a loud pack of wild kids running around who hit my boyfriend's injured shoulder... please control your kids, people!", "author": "Alex G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-01", "description": "I've been here for lunch and after work.\n\nDuring lunch I had the turkey burger with grilled onions and cheddar cheese. I was disappointed that for $7, you only a burger with lettuce and tomato. The grilled onions and cheese were extra. I was also disappointed they only had the option of cheddar cheese, not even Muenster. The margarita was also very, very tiny - would not recommend. I asked for the Two8Two sauce on the side but it came on the burger. There wasn't enough for me to figure out if it was actually a good sauce or not. But the burger itself was good so I was left conflicted.\n\nAfter work, I ordered a lamb burger, which again was disappointing as it was $12 for nothing but lamb, lettuce and tomato. I got a drink but I can't remember which one it was but it was good and decent sized this time.\n\nI'll only go back here if I am really craving an expensive burger with limited toppings.", "author": "Asmika D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-06", "description": "Decent burger and fries. If you are a lover of burgers you won't be blown away.\n\nThe first time I went I had this place pegged at 4 stars. My second visit made me drop it to two.\n\nThe burger had decent quality meat but it was barely warm. The toppings aren't very fresh either. The lettuce is the shredded iceberg lettuce im not a fan of.\n\nMy beer and the fries were delicious. But as for the burger, 3 stars.", "author": "Elijah O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "Words won't give this place justice. Service is amazing food AMAZING. I have never had a burger so well done before in my life l. I had a lamb burger from the gods !!!! Very kid friendly clean amazing restaurant would recommend it to anyone across the world!!! And Also vegie friendly !!!!", "author": "YArielis V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "I can't wait to eat here again the service is really friendly and the place is nice and clean they have a garden in the back you can eat in in the summer when you go you need to have the lamb burger is really juicy and fresh one of the best burgers in new York don't miss this jem", "author": "Yaakov W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-12", "description": "I've been back to Two 8 Two three times since my initial review, and my verdict remains-- they still have the best burger I've found in NYC! Also, I must give props once again to the sweet potato fries and onion rings-- both very delicious! One thing I failed to mention in my initial review was their great selection of reasonably priced draft beers, so be sure to check those out as well. Also, I recently found out they have Happy Hour each day, so ask the wait staff about their drink specials. I'm fairly certain their Happy Hour goes until 7 p.m. and includes special pricing for pints and other drinks.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "This place makes an excellent burger and I'm from LA where they make burgers for men with appetites. When I'm in NYC, especially Brooklyn, I brace myself for children's menu amounts of food for unsexy prices.  Two 8 Two is the exception not the rule. Lot of white children in strollers in that part of Brooklyn. Get to Two 8 Two, eat a great burger, and get the hell out of there.", "author": "Stan P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-22", "description": "BEWARE: The Lunch special is totally bogus. $8 for a burger and fries. Our waitress, who was very nice but a little green (second day), advised us that we could choose any beef burger (minus a few fancy ones) from the menu for $8. Bill came and they charged an additional amount for every add-on that was on each burger. So ordering the first burger on the menu with poblano chilies, cheese, something else ended up costing $10.50. Some $8 lunch special. In fact, every burger ended up costing the same amount that it did on the menu! Although you did get fries. The food was good but my group and I felt deceived. So much so that when we raised it with the waitress she said she would inquire with her manager but instead bought us back the original bill.", "author": "Bryan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "Wow. Really great burger, best in the area for sure. \n\nWent yesterday and am honestly contemplating going in again. You know the food's good when you're thinking about it in bed the next morning. \n\nGreat, friendly and humorous (in a great way) service.\n\nYou gotta try this place.", "author": "Darryl J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-31", "description": "Last night, my friend and I were starving so we ordered a couple burgers, chili cheese fries and sweet potato fries from this place.   We opened the fries first, they we're okay, but when we opened the burgers, forget about it. Something was so off right from when we smelled them. And it wasn't just the beef, the bun tasted like crap, the onions we're horrible, the burger tasted so disgusting I had to spit it out.  It was like the whole thing was cooked in some kind of weird oil or someone wrapped their farts around it and handed it to us in a neat little package.  Now I am nowhere NEAR a burger snob (or food snob in general), but this was by far the WORST burger I have ever had in my life.  We had to toss out about $24 worth of crappy burgers because they were 100% inedible. I will never be coming here (or ordering takeout from two8two again).  Nasty waste of money.", "author": "Whitney V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "I too have dreams of their burgers. By now, it's been at least my 7th time in the past six months going there. \nWith that said, burgers are amazing. Juicy, perfectly cooked and seasoned. Cocktail list is almost  a fail. Sounds good but just doesn't work. Bourbon limeade and bloody marys are the only thing going for them. Stick to beer or regular drinks.\nGreek fries are good, so are the sweet potato fries. But I will admit for the additional cost, I typically just get a burger and am satisfied.\n\n** Also, a lot of people have commented that it's a bit pricey. That's because the burgers are organic/grass fed/come from a GREAT butcher as opposed to that crappy meat that everyone else orders from who knows what food distributing company.Just sayin.", "author": "Ashton G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "Best burgers in Brooklyn since Dubuque.  I had the Pub Burger.  It was cooked perfectly and so delicious.  The bartender suggested dipping the fries in the house sauce- which was amazing- but I think they were spectacular even on their own.", "author": "Jeff G."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}