{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-02", "description": "The burgers are outstanding but the big drawback: there's no ventilation at all. It got to a point where I had to go outside for air. I simply could not breathe. My clothes were permeated with the smell of smoke and meat for days. It was gross. PLUS_ no coffee?!\n\nIf they fix this problem, I would eat here ALL THE TIME but It's close to intolerable.", "author": "Anastasia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "A great ambiance to such a small and charming place! They have great beers on tap and amazing service. I ordered the breakfast burger and a side of sweet-potato fries, as soon as I bit into my burger, I regretted putting ketchup on it because the burger tasted so good! I normally hate burgers, but I would go back here every night!", "author": "Kym S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "We have gone back several times. Our favorite burger place around. Good cocktails and beer selection, as well.", "author": "Rob S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-05", "description": "Had the two8two burger and enjoyed it.  It was juicy and the bun, though wimpy, was good.   \n\nEverything else needs work.\n\nThe burger didn't come with lettuce and tomato or pickles.  Apparently you need to ask.  And the fries are extra.  The 4 dollar \"Greek Fries\" are ill conceived.  The Feta simply falls off, so you're left with fries and side of crumbled cheese.   \n\nMy waiter was \"not a beer person\" so he wasn't able to point us in the direction of a tasty beer.  If you're a waiter at a burger and beer joint and you don't like beer, at least pick the brain of someone who does and get informed.  \n\nThe decor of the bar is great and the staff is pleasant.  And they have the most important thing, the burger, down.  There is room for the place to improve.  But unless they actually do improve, I wouldn't recommend.", "author": "N F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-11", "description": "Cool spot but service sucked. Took 10 mins to get noticed and I was sitting at the bar! Had 1 drink and left. I do want to go back because of the great reviews of the burgers!! Next time Ill come by during the week instead of a Friday.", "author": "Martine P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-11", "description": "I decided to go this place because I was craving a burger all week and I had a Big Mac the night before that did not hit the spot. So tonight I went out with my family to this spot. It was easy to get to and find because we all live in Brooklyn. Honestly, I thought this place was going to be more fun. The atmosphere was pretty dry, this is the kind of place you take you're grandmother. It was not crowded and we were seated immediately. After 5 minutes of sitting down I realized there was a black liquid on my hand and wasn't sure where It came from. I looked up and noticed there was a leak from the ceiling. After we moved our table the waiter quickly walked away. When he came back he asked us what we wanted to drink and I asked him did they have anything sweet he suggested a house arrest and again walked away quickly before I could ask anymore questions. I settled on a rum and coke and it was pretty good and strong(I admit I am a light weight). We finally ordered our food and I a 50/50 burger without plabano chillies. My burger was literally amazing. It was medium cooked and was fulfilling. I also had onion rings which were pretty good. Everyone else had fries which they enjoyed. Overall, dry atmosphere, okay service, and good food. I wouldn't recommend sitting down and eating but I would get take out from this place.", "author": "Ramelle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "I have been here several times, and every experience has been great. The service is top notch and people (employees and patrons) have always been a lot of fun. Whenever I visit Brooklyn, I make sure to visit Two 8 Two. \n\n The burgers: The burgers are incredibly juicy and flavorful. They have always come out prepared as requested (medium, medium well, etc). The fries have always been crisp and never overcooked.\n\nThe restaurant: very clean, casual layout. Front section is the bar area, with table seating in the back half and an outside area in the back. Noise level has been relatively low, so conversation is easy while you dine. A great mixture of people on a given night. \n\nThe staff: Top notch. People are friendly and efficient. Orders come out quickly, no mistakes, and never feel pressured to rush through my meal. \n\nOdd quirks: for some reason the bathrooms are not labeled. At all. I think they're trying to keep them a secret.", "author": "Brian B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "Nice whiskey limeade during happy hour. Burgers are good, but very small for the price. Laid back atmosphere with a cute garden in the back.", "author": "Liz B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "Wow!  One if the best turkey burgers I have ever had.  Protein burger is the way to go, nice crisp lettuce, no soggy, very tasty.  Good beers on tap too", "author": "Bryan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Come to Brooklyn!! This place is awesome. Bartender is super cool. Service is terrific. Great vibe. INCREDIBLE BURGERS....HOLY CRAP!!! Magic in your mouth!!", "author": "Jan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "I've been here once and the burger was delicious. They have a outdoor area that has plenty of space.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "Two 8 Two has the best burger. It melts in your mouth. I love the Billy Burger. You do not need to put anything thing else on it but what they give. Seriously, it's that good. Staff is great. And they have an outdoor area.\nPut down what you're doing and go get a burger now!", "author": "Seth L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "the burger meat is superb \u0026 fresh! great deal for the lunch special. I must say it tastes fresher than shake shack sorry Danny, your ice cream will always be better.", "author": "Corey M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-10", "description": "the service is awesome,i very much liked the atmosphere . the food not so much. \nok the burgers were good,but the skinny fries with feta .,whats the point ? the onion rings look great and yummy when they are served, but why is the batter so sweet.?\ni did enjoy the service,but the food not so much.", "author": "pat g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "Fantastic burgers, done just the right way. Great drinks. Friendly, courteous staff. Cozy inside with a small but cute outdoor space for lazy Sundays.", "author": "Agnes C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "Mmmm that Billy burger was delicious. Great patty to bun ratio, a perfectly seasoned very fresh tasting juicy patty, topped with quality and perfectly portioned slice of cheese and mound of caramelized onions, the whole of which the bun envelops without falling apart in your hands make it an amazing specimen of a burger. \n\nThe plain fries were good but an afterthought here.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "So effing delicious.  These burgers are treated right, with a solid bun and the right fixins for every taste.  It's surprisingly affordable and their great selection of beers on tap make the perfect accompaniment.  \n\nI got the Billy Burger and when the waiter came back to ask how my food was, all I could do was glance up at him, with my mouth dripping burger grease and my hands covered in sauce, and nod.  He understood.  \n\nOne note: the waiters are kind of uncommunicative and tend to disappear, making you feel like you did something wrong, but once the food comes it doesn't really matter.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-03", "description": "Billy burger was very good, but half way thru eating it I found a big gnat on my plate next to a small piece of food. My friend and I couldn't figure out where it was from - we didn't see it flying around.....anyways they didn't charge me for the burger, just wish it didn't happen.", "author": "Grace H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-17", "description": "Good beer selection (standard for the neighborhood).  Burgers are decent, on par with in-N-Out/Shake Shack.  If you like veggie burgers, they are supposedly very good - no hockey pucks and it's not overcooked. \n\nI like simple, but this is a little too simple and lacks character... c'mon, this is Brooklyn.  The neighborhood is teeming with hipsters.  It's right across from a prison!!  That's awesome!  Where's the creativity??  It feels like any plain vanilla bar/restaurant you'd find in the upper east side.\n\nOutdoor picnic tables are a nice touch, but if I want to have a beer and hang out outside, Brazen Head is right down the street with a better drink menu.\n\nLast I checked, it's only open for dinner, meaning a bar that specializes in burgers and fries *isn't open for lunch*.   Wrap your head around that.", "author": "Nish R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-15", "description": "Burgers are excellent. But the staff, which doesn't seem to change, has definitely developed an indifferent attitude. Seriously, he had his nose in the air the whole time. No smile, nothing. Just a perfunctory robot bartender with ZERO charisma.", "author": "Zack R."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}