{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-17", "description": "I love Two 8 Two. The hamburgers are high quality (the meat comes from Los Paisanos), an appropriate size and a great value (regular hamburger clocks in at $6.00). The atmosphere is nice (love the patio in the back for summer nights) and the service is friendly and fast.", "author": "Naomi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "Just got back from this place and I was kind of surprised at how busy they were at 10pm. Although the food options in this neighborhood after 10 are limited basically to the diner so it's nice to see that they're open til midnight. \n\nThe burger was good. The meat is from Los Paisanos. It is always nice to see one local business supporting another, not to mention their meat is delicious. \n\n...but they don't have hot sauce? They loose a point for that. \n\nAlso the bill had my breakfast burger as $9 (the price on the menu) which was then crossed out and $10 was written. Not sure why they overcharged me.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "I came here with some out of town friends to drink some quality beer and eat quality food. The burger I order was especially delicious(breakfast burger) , the fries were an 8.5 on a 1-10 scale and their beer wasn't too shabby. I was surprised they had Captain Lawrence , and I was also pleasantly surprised by the bar-esque atmosphere. Our waiter was awesome, and he deserved every bit of the tip we left him.", "author": "Jamie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "Our group was looking for something with easy food and good beers on tap. We found it in Two 8 Two! Yay!\n\nThe burgers were really juicy, and the special sauce is great. We got all the different kinds of fries and completely demolished them. They had a pretty decent list of beers on tap, and I got to check Ommegang's Rare Vos off of my \"beers to try\" list. \n\nI took one star off because this place was so smoky from the grill in the kitchen that I left with a sore throat. If it had been any smokier I would have had to walk out coughing. Hopefully this was just a one-time thing, because I really do want to come back.", "author": "Amelia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-03", "description": "Great service. Amazing burgers. The Pub burger takes it!! As a good rule of thumb, when a burger place has \"burger\" in their name expect to be impressed. I was for sure. My only problem was that it was a little messy to eat. Regardless it was pretty damn good. Going back for sure.", "author": "Bryan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "I love this place. Drinks are amazing and burgers are juicy and delicious. Even the veggie burgers. :) I love their Greek fries and the drinks are always strong and yummy.", "author": "Liya D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-11", "description": "Went in looking to have a burger and a brew. I ordered the poblano variety and it was delicious. Shared an order of fries with my brother, which were ample and nicely cooked. I was not asked how I wanted my burger. Fortunately, it was cooked just like I wanted. Nice sear on the outside and pink in the middle.  Will definitely go back when I am sober.", "author": "Mike H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "What a hidden gem...My lady friend was craving for a burger and I haven't had a burger in a while so why not, it was late at nite and we stumble upon Two 8 Two on our drive back into bklyn as we were gonna take a walk on Smith st., so like any normal foodie i yelp it and saw great reviews..at first glance it looks like a small dim bar/pub type lounge but boy was i wrong.  The place was pretty big as we walk pass by the bar and there was an outdoor seating as well.  We wasted no time and order our food their two 8 two burger, a billy burger with bacon (recommended by our waiter) and some greek fries along with a ginger ale.  It didn't take long and burger was done to our liking medium well, i have to say it look small but it was just right for a late dinner.  The billy burger was juicy, had lots of flavor, the bacon was crispy and the onions gave it a nice touch not to mention the bread was nice and soft.  My lady friend had the two 8 two and that as well was very good but we both agree the billy burger was better. My gingerale was not the water down u get at some places this one actually wash down the burger real nice lol...definitely be back with some friends to sit outside, chill and try their 8oz burger...their prices very reasonable, service is great, and its just a real nice place to chill and have a nice conversation, i don't drink but they have good selection of beer/alcohol as well....there's other burger joints in the area but imma make this my first choice if ever in the area again", "author": "Tommy J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-10", "description": "There was a table of toddlers next to us. They (and their parents!) were acting like we were at a playground. I like kids. I'm a babysitter and a camp counselor. I don't like feeling them bump up against the table while I'm trying to eat. \n\nI know that it's not the restaurant's fault that other customers were acting like this. BUT when I said something to the staff, there was no response besides \"Well, they're paying the bill now.\" As we were leaving we looked for a manager, but the hostess told us that the owner had stepped out, and that she wasn't sure who we should talk to about this. This meant there was an issue, and nobody who could actually fix it. \n\nThe burger was alright, though kind of small. The onion rings were fine, and the sweet potato fries were good. \n\nI don't plan on going back (especially because the burgers at Pete's are way better!).", "author": "martie f."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-31", "description": "Stumbled upon this restaurant about a month ago - have been back three times.  Everything about this restaurant is fantastic - cocktails ---freshly made Mojitos especially -- food, decor, price \u0026 a very pleasant staff.   The burger is one of the best I have had.  It is on my list of top favorites.", "author": "Maureen O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-21", "description": "Great addition to the neighborhood.  Hopefully the location doesn't keep them from thriving.\n\nSmall menu of burgers and hot dogs.  We've been three times now and have really been impressed with everything, from the food to waitstaff (who are super friendly).\n\nThe two8two and billy burgers are really tasty.  They are not huge but one seems to be enough for a meal.  \n\nAnd the onion rings are kind of epic.\n\nOnly knock on the place is the hot dog, which was just OK.  And I guess the size of an order of fries could be bigger.\n\nWe will definitely be back.", "author": "Kevin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "Great quick \u0026 easy neighborhood place. The staff is friendly, and the burgers are great. The menu isn't the most extensive, but they've mastered the basics. Theirs is the one of the best turkey burgers I've had, and their hamburgers are great too!\n\nNice bar, nice outdoor space, nice staff, delicious burgers. I'm totally a fan!", "author": "Jenny H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-06", "description": "Very good burgers, but ratings dragged down by the use of what has to be frozen fries and onion rings, like you'd get when you pull off the interstate for a commercial fast-food lunch.  The burgers (especially the 282 burger) are too good to be serving fast food fries.  With Shake Shack coming to the neighborhood, I'd consider upping your game in that department.  Great place with friendly staff, but don't phone-in the extras.", "author": "David J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "Want a great burger?  This is definitely the place to go.  Delicious burgers with great toppings and the sauce is super!  Service was also great.  This is a don't miss place for sure.", "author": "Bill C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-04", "description": "Coming in at around $5 the BLT on whole wheat might be the best deal in the city. I always ask for my fries well done because I am that type of guy.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "great burgers.wish i ordered two. also wish the parking was better so i didn't have to order and leave.", "author": "GPooh K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-24", "description": "Went back. Better burger than last time I was here. Still a bit on the dry side so my review is more of a 3.5. Thankfully bun was not stale this time.", "author": "F P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-25", "description": "This is a great place to have in the neighborhood! I've been there a few times, sometimes for food and sometimes just to chill at the bar. They have some delicious drink specials and the bartender who is usually there is really awesome, funny, and friendly. The turkey burger is great and my friends have said the regular burger is good as well. I do agree that portions are on the smaller side, compared to some burger joints, but it gives you more room for the Greek fries! which are the strangest but most awesome side ever.", "author": "Becky S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "Love love the 2 eight 2 burger. Perfect lunch size w/o the guilt and feeling the necessity to run to to the toilet after lunch.  Acoustics can get a little loud, staff friendly even w toddler guests. Nice selection of drafts.", "author": "mj b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-20", "description": "Solid burger place. The food is good, the beer is better, it is best when both are combined. We sat at the bar and the bartender seemed as though he didn't even care that we were there. Kinda strange but I wasn't there to make a friend.", "author": "Anu And Austin H."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}