{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "The perfect place for a family meal following my nephew's birthday party.   Wish I had followed the previous Yelp reviewers' advice and gotten the breakfast burger.  Instead I opted for the Greek salad.  Nothing wrong with it but nothing special either.  Parents both ordered burgers and pronounced them excellent.  My dad is a burger fiend and both parents are obnoxiously fussy about their medium rares, so to actually get positive praise is huge.\n\nPersonally I preferred the regular fries to the sweet potato ones.  Of course I ordered the sweet potato ones so I had to spend the meal sneaking regular fries off other peoples' plates!", "author": "Deborah N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "Another day of rock climbing. BKB was nearly empty, so I pushed myself. Hard. Three hours later, I was craving food. As it is so often said, with great ascension comes great responsibility.\n\nI got in the car and was instantly drawn to Boerum Hill. It was as if a voice was quietly whispering directions to the burger promised land. I then realized that Sean M. was with me, and wondered why he was whispering.\n\nWe walked in. Amongst the ~20 tables, only a party of five was eating, while a brunette with impossibly blue pants was sitting alone at the bar. We looked at the menu, which used a lot of words to essentially ask, \"burger or hot dog?\"\n\nWe both ordered the Breakfast Burger. 10 minutes later, I was presented with a buttery brioche bun, on which rested the most perfect patty, bacon and fried egg I had ever laid eyes on. I picked up my cholesterol vessel and took a bite. The giant liquid explosion that ruptured forth from the egg could not have been a better metaphor.\n\nThis burger is the reason people laugh at the Shake Shack lines. This burger is the reason that America won the Cold War. This was the best burger I can ever remember having in this fine city. \n\nWhy not five stars? The fries were average, they need to offer more sides, and since the restaurant decor is nicer than the menu suggests, it was odd that the waiter appeared to be wearing his \"laundry day\" t-shirt. But 4 out of 5 cardiologists agree that you shouldn't be dissuaded from coming here.", "author": "Evan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "Veggie burger is so good. Really really good. I'd give 5 stars if I didn't notice a live bug in my beer right as I was about to take the last sip. I was inside but it's still summer, so we'll let it slide.", "author": "Katie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-10", "description": "Favorite burger in the cobble hill/carroll gardens area.\n\nNot too big, not too small. Great toppings.\n\nAmazing fries, particularly the sweet potato ones.", "author": "Riot D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "A local go-to.  Realllly really good burgers and great greek fries.  Get their specialty burger.  Also a great bar area with a strong beer selection and a couple TVs for catching some games.  And an awesome deck out back for the summer time.", "author": "Ramez K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "In Brooklyn heights and looking for a nice and cozy burger joint? As a regular customer, I don't have enough good things to say! The staff are nice, quick, and efficient. Enjoy a drink from the bar and have the option to sit outside in the back of the restaurant. \n\nI always get the 282 Burger, which is arguably one of the best burgers in New York City. It's simple but so delicious - fresh beef, slightly toasted bun, roasted poblano chiles (peppers), cheddar cheese and 282 sauce. Fries are cooked to perfection. (Try their onion rings too.)", "author": "David Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-11", "description": "One of the better burgers I've had in NYC (beats out Minetta Tavern, PJ Clarkes, others).\n\nGood service, prices. Secret sauce makes it.", "author": "John P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-17", "description": "Unexpectedly empty on a recent Sunday night...is this place new? Good, solid burger joint that is low on frills and incongruously high on price. Breakfast burger was decent: well-cooked, not-too-juicy egg, but there was nothing special about the \"two 8 two\" sauce and the bacon looked and felt like it was cooked a few hours ago. Fries and onion rings come separately and there's nothing particularly great about those either. The bar is a good size and the beer offerings are decent. Staff very friendly and patient. \n\nGood for what it is.", "author": "Alexander M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "Went here yesterday for the first time around 2:00.   The place wasn't too crowded and because it was such a nice day, we sat outside in the back.  I had the Billy burger.  It was juicy, greasy and amazing...the type of burger you want when you are craving a burger.  I had the pomegranate margarita.  It was good, but a little bitter.  \nI will definitely be returning.", "author": "Jaclyn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "The only reason why I don't give this place 5 stars (6 if it were possible) is because the service isn't always up to par. However, these are absolutely the BEST burgers in Brooklyn!!! Super fresh and savory, and the Greek Fries are to die for!", "author": "Sofy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "Really cute \u0026 casual spot with great burgers. Staff was awesome and so was the food. I had the lamb burger which was delicious! The burgers don't come with sides, so you have to order them separately. Definitely recommend to anyone who wants to enjoy a delicious burger and a laid-back vibe.", "author": "Drita D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-16", "description": "Went to Two8Two for the first time with a friend last night and it was as good as he promised it would be! I had the Billy Burger with Bacon (caramelized onions, cheddar, special sauce and lots of delicious bacon on top) and french fries. The burger was decently priced $7.50 (+$1 for the bacon, well worth it). \nWe sat up at the bar to watch the Knicks game and ended up staying a few hours. The bartender/server was super friendly and attentive. I had a really good cocktail called \"Presidente\" which I recommend. Also had some good beers on tap and some whiskey on the rocks. \n\nI will definitely be going back. Good food/good beers/ good crowd.", "author": "Katie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-07", "description": "A casual sit down atmosphere with burgers that I prefer over Shake Shack. Excellent patty quality and size and cooked perfectly medium for not much more dollars. Outdoor patio in the back too.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-02", "description": "I had Two8Two bookmarked for quite a while, and after finally trying it, I was a little let down.\n\nThe Breakfast Burger was good, but not memorable. Small. No crunch. Sweet Potato fries were good, but no cool dipping sauces? Come on! Just ketchup? Please.\nSomeone else ordered the salad and received a mini plate with lettuce, one tomato, 3 olives and a mound of dry lamb burger. They were very non-plussed. Very. Food presentation is usually not a big deal, but this was so boring you almost felt like you were eating at home. You gotta try harder. Make it look pretty.\n\nOn a good note, the waitress was refreshingly friendly.\n\nReally not a bad burger joint, but when you have Moo Burger and even Shake Shack nearby, will we be back? Doubtful.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-14", "description": "Good food horrible service. Unfortunately I will not be coming back to this establishment due to the disrespect of our waiter. My husband and I asked for more ketchup and he told us to ask the people we came with to use there's. Then when we asked for the check he repeatedly told each of us that the tip was not included as if we didn't understand.  I'm pretty sure he didn't enjoy serving a table of minorities.", "author": "Janelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "A friend of mine recommended this wonderful place stating the house special sauce was crack-like and we had to try it...sweet baby jesus the burgers were so good and juicy.  With all the burger joints popping up lately, I wasn't expecting anything to write home about but this place is YUMMY...can't wait to go back.\n\nThe services was fabulous and our burger were cooked perfectly...I just had a regular burger, nothing fancy cause I wanted to taste the actual burger and the house special sauce (yes, it is crack-like), and it's was juicy beefy heaven!\n\nIf you are looking for a YUMMY burger joint...two 8 two is the place you need to check out!!!", "author": "Judy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "My only complaint is that's its a little dark for a place that offers great burgers. My favorite drink is house arrest. Its a strong concoction but goes down very smooth. There is an outside area, but didn't use it. The main entrance a patron is created BT a bar. So its a little intimidating to bring children. However, I have seen children at this place. Haven't had a chance to go back.", "author": "Aunkhofmishra .."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-25", "description": "If I had wanted a Trader Joe's frozen veggie burger I would have just stayed home. And the staff was full of attitude.  Worth a trip to Bareburger around the corner even for the extra dollars.", "author": "Peggy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "My boyfriend and I drove 45 minutes from Westchester to try their burgers and we agreed that it was worth the drive! I got the billy burger and he got the burger with bacon and egg on top (forgot the name) but they were delicious and flavorful. Fries were good too. Definitely coming back soon.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-28", "description": "Burgers had decent flavor. Very, very tiny though. Fries are a la carte sadly, and cold, no salt. Sweet potato fries were tasty but a bit undercooked. I was kind of embarrassed to take our out of town guests there because of the extremely small portions for the price. Much better places in Brooklyn for the price.", "author": "Sara T."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}