{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "10 out of 10. burger perfectly cooked.  Juicy. falvorful, buns tender,  crispy fries.  One of the best bugers ever had.", "author": "David S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "This burger spot was pretty amazing. The place sources there meat from a local butcher who provides top quality meats and it makes all the difference in the way the burgers here taste. I opted for the Double Cheese burger. This was huge and more than enough for one person. It was full of flavor and the sauce was amazing. Put some chili fries on the side and I was a done bun. Will be back for sure and if your looking for a good burger place I would recommend giving this place a shot.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "Great service, delicious food. Everything we got was hot and fresh. Will definitely go again. Their Greek fries are what's up!", "author": "Genielle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "I heard this place calling my name from across the street...\"hey Jason, Two 8 Two is just for YOU!\" So I figured why not?!\n\nWalk in and was  greeted by a very friendly bartender manning the decent sized bar. Gave me a menu and was indecisive because all the burgers and sandwiches looked so good. Went with the Breakfast Burger. Delicious beyond Delicious! Burger was a nice size, steaming hot , juicy \u0026 so fresh. I want another one!\n\nThough I took my food To-Go I can't really comment on the service or even the dining room but from what I saw beyond the bar is the small dining area but with an outdoor area beyond that.\n\nGreat uplifting music going to enjoy your meal! \n\nAmazing burger for a decent price. Well worth the money - you'll definitely leave wanting more!", "author": "Jason C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-16", "description": "ok... for beer but that's it \nfood is so small as if i went to white castle for burgers\n2 beers 2 glass of wine and 2 small burgers around $80 with tip thats crazy!!!!", "author": "Russ U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "Friendly atmosphere, filling burgers and good fries. What else can you really ask for for a simple night out?  The burgers here are cooked to order and came out very quick.  The service was fast and prompt and we didn't have to wait long for everything to come out.  Their Sweet Potato Fries taste awesome while it's still warm.  The onion rings were good too, but a few of them were a bit too big so the onion itself pulled out of the battered shell.  I tried their lamb burger and it was very savory.  No gamy aftertaste you may get from lamb when prepared poorly, but this burger was spot on.  The tzatziki sauce they made was almost sour cream like consistency and balanced well with the spices in the lamb.  The tangy flavor really added depth to the burger.  I was afraid because the tzatziki sauces are normally made with yogurt that it would be too thick, but they made it well and was not thick.  \n\nOverall, it's a nice and happening place, but a bit dark in some areas due to lack of lighting.  There's outdoor seating towards the back, if you're in the mood to sit outside.  When it got packed the arm space between tables along the bench seating was tighter than I would like for eating burgers because I tend to have a wide arm stance.", "author": "Louis N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-29", "description": "Great burgers at this burger joint/bar! I especially enjoy the Greek options such as oregano fries, Greek salad and lamb burger. Decent happy hour too. There is not much in ambience, but good quality food and drinks.", "author": "Renee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-28", "description": "stopped by for a quick lunch with my family a few weeks ago. \n\nThe first thing you see walking in is the bar.. not a whole lot of seating inside.. additonal outdoor seating. \n\nJust came in for a quick grub. Burgers were good, my son ordered a hot dog.. it was so salty and dry, he could not  take another bite after the first.. we all taste tested it and yes it was inedible. \n\nFixed by ordering another burger!\n\nServer is nice, but service is a bit slow.", "author": "Rianna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-19", "description": "The service AND food were both amazing. They accommodated our large group of 14 and Brianna, our waitress, was a magical wizard. Not one order was messed up and everything came out quickly and basically at the same time. The quality of the burgers was also unbelievable. Definitely would recommend it to anyone and everyone.", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "This is my go to burger delivery... burgers and ESPECIALLY THE FRIES are tricky when it comes to packing and traveling. The burger always travels well but the fries... leave a lot to be desired :( I know it's not easy to keep them from being soggy and gross but I think a better job could be done here. My advice- take the burger/ keep the fries out.", "author": "Fancy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-03", "description": "One of those rare burgers that makes you want to tell your friend to please stop talking so as not to interrupt the experience. It's close-your-eyes-while-you-chew good! If it's not the best in the city, I have no idea what is (but I can tell you for sure that it's not that side of beef on a bun nonsense at Minetta Tavern). This is truly transporting.", "author": "Brandy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-16", "description": "Bunless Turkey burger was flavorful and juicy but would have benefited from a real lettuce wrap rather than extra iceberg lettuce. \n\nBoyfriend say beef burger was alright, nothing special. Neither of the burgers came with fries, you have to order separately. \n\nBartender seemed preoccupied--after sitting at the bar for a while with drinks and food we had to ask for glasses of water. He was more conversational by the end of our stay, which made up for it, but we wished he had been friendlier in the beginning. Also the Bloody Mary mix was poured from a can, no celery or olive garnish, came in a short rocks glass, so that was disappointing for the price. \n\nLastly there was a patron raising hell while we were there...coming up to the bar and cursing about his food being sub par. He was totally out of line but it seemed like a sign considering our experience was sub par as well. \n\nFor a quick burger and a drink that's not over priced, this is a fine spot, but nothing special.", "author": "Ellie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-03", "description": "Really really sweet waiters, grumpy bartender, and the worst burger I have ever had. Ever. The tiny burger was more salt than meat. I was starving, so I ate the damn thing, and the wait staff is so adorable that maybe I'll come back, but guys.. it's a burger! How hard is THAT? Please up your game... I'm neighborhood so I want you to stay in business!!!!", "author": "Peri L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "This is probably my favorite local spot.  Been hitting it for over 5 years now.  The burgers make shake shack burgers taste like cardboard, the cocktails are always on point, and the beer selection is pretty serious.  The service is good too -- Ron \u0026 Ben are great bartenders.  I like the fact that you can meet just about anyone here, from locals to celebrities.  The quality is high point but the vibe is low key.  They've got a good happy hour.  My menu favorite is the Billy Burger or the BLT with egg --messy but delicious if you're the adventurous type.", "author": "L A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "What is it with NY and their tiny burgers with humongous price tags.  When you charge $10 for a burger, you're setting the expectations pretty high (even for NY), and this place definitely falls short.  Their namesake burger was pretty bland, not sure what the two8two sauce was supposed to taste like.  All I tasted was a cheeseburger with poblano chiles.\nThe feta on the Greek fries also lacked any tang and just served to mute the flavor of the fries.  Most of it ended up left on the plate and not in the stomach =(.", "author": "Daniel H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-22", "description": "Food is decent but I do not understand the legion of virgins with no social skills they employ behind the bar. They manage to screw up what should be normal order taking interactions almost every time. It's super weird and a huge disincentive to coming back.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-28", "description": "So my first visit to Two 8 Two was for a BK Yelp event back in 2011!  Since then I've passed by often enough but never stopped in for a meal.  Until last week.\n\nHubs and I were out and about and decided we needed burgers.  Stopped in around 8pm to a semi crowded dining room but were seated right away.  \n\nI had remembered the place being cozy but that's to be expected when a gaggle of Yelp Elite peeps come for dinner.  I wasn't expecting it to be as cozy when we came back.  Our table was close enough to the next that if I wanted to try one of their fries I wouldn't of had to stretch very far.  Luckily our dinner neighbors were chill.  And so was the rest of the place.  Chill staff, chill vibe.\n\nI wrote in my event review that the burgers 'weren't my favorite in the city' and that still holds true.  If I'm going to go out for dinner I want to leave full or at least full-ish.  Not gut busting but satisfied.  When Hubs and I left Two 8 Two we both had the same thought - 'I'm going to be hungry again in an hour.'  I'm not sure what the problem is either - I wish I could pinpoint the issues with my burger but I can't!  My turkey burger was seasoned really well, was cooked perfectly* and diameter-wise was larger than its bun.   The cheese was good, the bacon was good, the house sauce was good, even the shredded lettuce was a nice addition to the burger.  But I left hungry.  I left wanting more.  I left thinking about food options near our next destination.  \n\nMaybe others will have more success with Two 8 Two than I did.  Maybe I'll visit again at some point and see if I can figure out why I don't love the place like so many others do.  \n\n\n\n*Cooked completely and remained juicy!", "author": "Alyssa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "If you're looking for a burger and a beer, and we've all been there, this is a great spot.\nNice beer selection, really juicy, delicious (and not to mention huge) burgers and a friendly, efficient staff.\nIf you come here on a warm day, sit outside in their patio in the back-great vibes back there.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "A solid burger place that lets you take a break from hipsterdom. Both the beef and lamb burgers are delicious and the fries and onion rings are exceptional. Only down side is that the dining room in the back gets really loud. I'd probably opt to sit at the bar next time. Those are the best fries I've had in a while. Thin-ish and crispy just perfect.", "author": "Amy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "Impressed by this simple yet tasty burger. The patty was smashed and had flavor in every bite, definitely marinated well. I am a sucker for a potato bun, the toasted, buttered sweetness of the bun tied well into the seasoned taste of the meat making it a mouthwatering marriage. The staff was attentive and the $6 happy hour margarita hit the spot. Love this intimate burger spot.", "author": "Mia K."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}