{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-13", "description": "After craving a burger for 3 days... I'm sad this is where I ate one....  Burger was incredibly messy to eat, beef had 0 flavor, super greasy, bun was no longer a bun for the second half.... Also large party came in to the back patio which meant we went without service for the majority of our visit. Tons of burger joints in the area to choose from. Won't be back", "author": "L. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-03", "description": "Let's start off by keeping in mind I was in pretty bad mood and very hungry....with that said\nI walked in, I was not greeted at the door or even acknowledged but I thought I'm in a bad mood play it cool. But then a couple walks in, sit at the bar ( mind u I was in front of the bar plus the place was pretty empty in the front) and is acknowledged to the point where they order drinks and food then after following and calling out to the woman behind the bar im able to place my order (lamb burger and sweet potato fries to go $18).\nThe couple is served (mind u I went to the store and my car then came back and went through the same thing of not being noticed) and im still waiting. But then I notice a take out bag. The woman who took my order walked passed the bag twice and was asked about it by a coworker, but didn't make an effort to look for me. At one point someone who may have been the manager walks by me (does not ask if im being helped) goes to adjust the lighting (which is 2 feet away from me) without saying a word.\n\nAt that point, I'm done and just want my food. So I get up from the stool I was sitting across from the bar 5 feet way to get my food.\n\nTHE FOOD: was great the lamb was well seasoned and the sauce was great. The fries appeared to be fried without much flavor. I would go back for the burger but if I get the same service I don't care how the food is im out  bc it will kill the experience.", "author": "Vanessa J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-19", "description": "Not bad. First time there with one of my besties after work.\nThey pretty much just have burgers and fries.\nCute establishment, small, quaint, and loud.\nHad a turkey burger and garlic, rosemary, greek herb fries (something like that). They were actually good, rather greasy though.\nFood was ok.\nVERY reasonable prices.\nCute waitress and good service.\nBad part is, you leave smelling like a greasy spoon...#nobueno\nThey need ventilation or something.\nI would visit again...wearing a plastic suit. That smell stayed in my clothes, coat and hair for 2 days...YUCK!", "author": "Tanda M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-22", "description": "This place was better when it was selling Bail Bonds. The limes in my drink were probably sliced 2 months ago. I didn't try the food so can't comment on that. Overpriced drinks, snobby attitude. No thanks. UPDATE********Also just to let everyone know the owner or server of this bar leaves rude comments if he doesn't like your review. He objected to me writing that the limes seemed like they were two months old. Well let's call them DESICCATED then. They were clearly old and nasty comments back to me doesn't change my experience at this crumby bar.", "author": "Betta L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-03", "description": "I stopped in here with my teen daughter during for a late lunch. We sat at the bar and there was only one other customer in the restaurant. A very pregnant, (looked like eight or nine months along) woman. She was there when we got there and I watched the bartender serve her three shots of whiskey while she also downed a large beer. I was horrified. She was still drinking when we left. I found the behavior of both the bartender and the patron reprehensible and I will not be back.", "author": "Maggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-30", "description": "Came here with the bf craving a big juicy manly burger and that is exactly what we got! I ordered the Regular Hamburger with cheddar cheese, lettuce, tomato and two8two sauce. The bf ordered the \"Pub\" Burger which has grilled onions, cheddar cheese, bacon and two8two sauce. Omg great burger! We asked for them to be cooked medium and they were cooked as expected. We also ordered a side of sweet potato fries and so happy we did. I highly recommend them!!\n\nI love the atmosphere of this place. A cute little bar/pub/outdoor patio restaurant.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "Went here tonight for a friend's birthday. Owner and waitstaff were incredibly friendly and accommodating. We filled up the back and had a wonderful intimate party. \n\nWe ordered nachos, sweet potato fries, and onion rings to start. The nachos were awesome but you should eat the right when they come out to avoid the chips turning flimsy... Unless you like them that way.. Then to each his own.\n\nI split a Pub burger and Greek salad. Both were delicious and the happy hour drinks helped to turn the meal into a double play would recommend this for parties and anyone looking for a juicy burger in the neighborhood.", "author": "Shawn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "Happy hour: 12pm-7pm. $5 drink deals on pints, bloody marys \u0026 mojitos. Their mojitos are pure perfection. So is the bartender.\n\nIt was too humid for my friend and I to sit outside in their little garden so we sat inside, where the a/c kept us cool. Thank goodness for a/c!\n\nMy friend said, and I quote, \"their burgers are kick ass. You know you want to\". I succumbed to the peer pressure and ordered the two8two Burger ($9) - hamburger with roasted poblano chiles, cheddar cheese and two8two sauce. After my first bite into it, I made a life-changing decision: all my burgers from now on MUST have roasted poblano chiles. I kid you not.\n\nMy friend ordered the Breakfast Burger ($9) - hamburger with fried egg, cheddar cheese, bacon and two8two sauce. I got to have a bite of hers and yes, it was kick ass. \n\nDisappointingly though, their onions rings were rather bland. My friend said they usually are really good. But you know me, I ate it anyways. Can't waste food right? Poor people dying in Africa and all.\n\nOur waitress was lovely and attentive, constantly making sure we had a mojito to keep in our hand.\n\nA great burger place that I will be returning to often when I'm in the neighborhood!", "author": "Julia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "Great burgers, great beer selection! Not the widest selection of food items, but there's mostly something for everyone. Great fries. Greek salad is good before your burger. Great prices.", "author": "David P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-28", "description": "Not sure if I missed something when at Two 8 Two considering all the stellar reviews. I have only been once so maybe after next time I will update this review.\n\nAnyhow, I ended up at Two 8 Two on my way to TJs and decided to stop in for a burger mid-afternoon at the bar. The place was empty (it was 3pm middle of week) but the bartender was very absent for not having any other customers to take care of. I don't expect food to come out super quick but all things said above considered, it took about 15 minutes for my burger with fries to come out. \n\nThe burger was decent, not the best burger I've had and not un-eatable. But for a place that advertises itself as a 'burger' place I would have expected better.\n\nTheir back yard looks nice and I'm sure it would be a different experience with more clientele present.", "author": "Sofia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "I love this place and come here all the time.  Great burgers and Greek salad is nice.  A full bar with good cocktails and rotating draught beers.  Always good, always great service, never disappointed.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-11", "description": "This place is to the point. The decor is minimalist, clean and the burgers are hearty and juicy.\n\nWe ordered the Two8Two and Pub Burger. I've never had pablano chiles before but enjoyed their mild spiciness; they were a nice addition to the burger. I preferred the Pub Burger, however, as it had bacon and onions. It seemed to pack more of a flavor punch than the namesake burger.\n\nThe sweet potato fries were a-ok. We slurped away happily on some rum punch and mojitos. \n\nI'll be back here again. And by that I mean tomorrow for the Yelp Elite event! WOOO!", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "My favorite burger spot in the hood. Love love .. Wish they had tater tots ! Just sayin.", "author": "Sousan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-11", "description": "This is my go-to burger spot.  The burgers here are incredibly juicy, perfectly cooked (good crust on the outside, but perfectly juicy inside), and well seasoned.  The bun is (I think) butter toasted, which surprisingly adds a lot to the overall burger.  I've had the 282 burger, billy burger, and pub burger.  My favorite is the 282...the poblanos add a great flavor to the burger.\n\nThe only problem with these burgers is that they are somewhat small.  This can be remedied by ordering the pub burger, which is significantly bigger at 9 oz.  However, since the patty is so much bigger, I think the outside gets a little overcooked by the time the inside is cooked, and it seriously detracts from the burger.  Stick with one of the normal sized burgers.  Even though they're smallish, I always end up full, especially if I split a side of fries with someone.\n\nThe sweet potato fries are also pretty delicious.  Crispy on the outside and soft on the inside.  The onion rings are good too, but I would go for the sweet potatoes.\n\nIn terms of the bar, I always stick with a beer, which is great with the burger.  My friends ordered the bloody mary.  They said it was pretty mediocre, and definitely didn't justify the $10 price tag.  One time I went and they had a boozy limeade special, which was pretty good.  If you're going for the burgers, stick with a beer.\n\nThere's happy hour, which has some deals on beer and on a beer and plain burger combo.  However, the happy hour deals aren't that great, which is sort of disappointing.\n\nThere are definitely some complaints about 282, and I would normally give it 3.5-4 stars, but the burger is THAT GOOD.  It takes it all the way up to 5 stars.", "author": "Sitaram C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "Great burgers -- nice and juicy with some interesting topping.  282 has a bar feel (well, I guess it is a bar), but the burgers aren't your typical pub-tasting burger, which is a nice change.\n\nI like the 282 burger, with chilies and some kind of special creamy sauce.  Fries and onion rings are fantastic as well.  The sweat potato fries have a ton of flavor and are usually perfectly cooked.\n\nI haven't tried anything else on the menu as I'm a simple burger kind of guy.\n\nThere mixed drinks are really well made too.  The spicy bloody Mary is great, although watch out if you down one on an empty stomach as the spiceness isn't forgiving.", "author": "Maurice H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "Five F-ing  stars!!!\nIt has a nice inviting atmosphere, wair staff could use a bit more cool ppints. The music needs some tuning up, but the food is awesome!!! (with a capital \"A\"). I am looking forward to coming back and having the twobytwo burger- it's like a religious experience. Forget the expecting \" a party In your pants- the burger is a party in your mouth- yeah, I said it! A party in your mouth.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "Great place to grab a cheeseburger and some onion rings.  Satisfied my craving.  I recommend the Billy Burger.", "author": "Amelia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "Love this place. I've been there twice. \n\nThe first time was during the summer, the waiter was a little bit too friendly, like sitting down on the chair next to us to take our order.\n Anyway, the burger was delicious  but I thought it was a bit on the small side, I had the \"Pub\" Burger(grilled onions,cheddar cheese, bacon and their two8two sauce).\n\nWent back like two weeks ago and I was happy to see that their burgers are much bigger now :) :) and still delish!", "author": "French L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-23", "description": "This place is great. We were seated right away and waited on quickly. The menu is perfectly basic for a burger place.\n\nI had the signature burger with the poblano chile, cheddar cheese and the house 282 sauce. Delicious burger but the portion was fairly small. I could have easily eaten another entire burger. I do eat alot so this portion is probably perfect for the average diner. The sweet potato fries are in-sane. Its hard to get sweet potato fries perfectly crispy without a mush middle. This place pulls it off.\n\nOnce again: the food was amazing but dont expect a big portions if youre hungry.", "author": "Brian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "This review will ONLY rate the Food. For reviews sake let's consider this to be a less expensive place and let's say the wait staff is good. \n\nThe burgers, albeit tiny, were STUPENDOUS!!! I had the two8two burger Medium Rare, It was FANTASTIC! Had to order a second round.\n\nDid not try fries or anything else, this place is, after all, a burger joint so I just went there for a burger. \n\nI tried the spicy Bloody Mary with bacon salt and it was good as well (SPICY)\n\nWill go there again! \n\nDon't make this a dinner date, eating takes less than 30 minutes", "author": "Allen D."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}