{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-16", "description": "My thought process with burgers always begins with the question:  Is it better than Shake Shack?  I can confidently say Two 8 Two passes that test and earns the 4-star rating for taste.\n\nBurgers are flavorful, cooked correctly, and have a good meat-to-bun ratio. Prices are right and service is friendly and efficient, and ambience is cozy and not too loud, and there's a nice little garden seating area out back . Great place to catch up with a friend or watch a game; great rotating beer selection.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-29", "description": "Delivery was a complete nightmare \nOrdered a burger at 7:52pm, didn't receive until 10:33\nYes, you've read that correctly. \nI was a hangry bitch. \nCalled and the manager made excuses, took no responsibility and directed me to call caviar. \nNever ordering from here again.", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-24", "description": "Ordered a standard burger with cheddar, onions and their two8two sauce. Asked for it well done (don't judge me) and it came back rather crispy on the edges, but that's ok because the flavor was good (I find that most places don't season their burgers, but this one def had salt \u0026 pepper at least). What I didn't like was that they only have cheddar or feta. What kind of burger joint only offers two kinds of cheese? Also, there was no lettuce or tomato on it (did I have to request that separately?) The fries were ok (reminiscent of McDonald's fries, but fresher) and onion rings were alright, nothing special. \nThe two8two sauce was a nice addition (it's mayo, mustard, pickles, garlic and paprika), went very well on the burger and as a dipping sauce for the fries and rings.\nWould I go back? Maybe if they give more options than just \"beef, cheddar and feta.\" I'd rather go to Burger Village in Park Slope.", "author": "Yovany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "Wow. Super impressed. Drinks were awesome to start with. Had mezcal and egg white drink which was dope. Burgers were out of this world and probably under priced. Would have paid $20 for a massive \"pub\" burger with grilled onions and meat from local butcher. My wife's burgers with grilled poblanos was also impressive. Definitely will come back and try happy hour special before 7 and outdoor seating.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-12", "description": "Looking for an amazing burger in a chill environment in the Downtown Brooklyn neighborhood? ... Look no further!\n\nFood - (5/5)\nThe burgers are top notch. Patties are delivered fresh daily from the local butcher shop, Paisano's. I frequent this butcher shop weekly and can vouch for their amazing quality beef. You can really taste it in the burger. I tried to breakfast burger which had perfectly crispy bacon but my egg was cooked a bit too much. That's on me for not specifying my preference. The Half \u0026 Half burger is solid too. You can't go wrong with any of the burgers honestly. The hot dogs are foot long which justifies the $10 price tag. Didn't try them, but th bartender devoured one and said it's his favorite thing there.\n\nAmbiance - (5/5)\nChill and casual. Went here on a Sunday night with friends and we sat at the bar. Great service and two small TV playing NBA games. The bartender made some delicious old fashioned as well. \n\nLocation - (4.5/5)\nConvenient location right on Atlantic so a close walk for any of the Downtown Brooklyn neighborhoods. Coming from Park Slope might be a hike but it's well worth it. \n\nValue - (5/5)\nExceptional food and service at a fair price. Burgers range from $10-13 and don't come with any sides. The sweet potato fries are a great addition if you're looking for something to compliment the burger.", "author": "Barney C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "this would have gotten five stars but the bartender made our rum drink with Whiskey. Otherwise the burger was the best meet ever and the chili fries with the bomb!! Great lunch date place!", "author": "Beth-Ann G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-26", "description": "Went for Good Beer Passport Dinner\n\nFood - 2/5. The poblanos were really overpowering on the burger. Despite being roasted pretty well, the large slices of poblanos with their stringy texture did not fit well when eating a sandwich. Since you're cutting with your teeth, it wasn't a good texture especially when you have everything else to chew at the same time. Beef patty itself was pretty average and the two8two sauce was barely noticeable. There was a reason they served the burger with ketchup on the side.\n\nService - 4/5. Friendly and courteous.\n\nValue - 2/5. Their namesake two8two burger runs at $10.50. It sounded good on paper, but the actual burger itself wasn't good to eat. Despite the price point, it doesn't come with any sides at all either. I definitely expected more.\n\nParking - Street (Free)", "author": "Auggie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "The best drink (Bees knees) \nGood burgers too. Love coming here late at night enjoying the music and environment.", "author": "Irene B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "Had the Burger medium rare, chili fries outdoor seating  Definitely worth a trip.  Seating was quick no reservation required on Saturday early", "author": "Shawn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "I had the two 8 two burger which consists of toasted poblano Chiles, cheese and their special sauce. I enjoyed it very much and although I thought it was small, it was pretty filling! \nThe potato buns they used were the perfect match with the burger. \nMy guy had the double cheeseburger which he really enjoyed. He even compared it to the shake shack and said that it was pretty similar taste wise! \nWe ordered a side of fries and it was a very generous portion. They gave us enough fries to go around and I do love fries. \nThe only downfall I'd say is that they charge for side of pickles. I get that it's only $1 but there was only 3 small sized pickles.. and also, the burgers don't come with fries on the side. If you want them, you need to order them separately.\n\nBesides that, taste wise they're pretty good!", "author": "Gloria K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "Before I start, I need to get this out of the way: Wow! \"Two 8 Two Bar \u0026 Burger\" (Named after the address) is a gem in Brooklyn that needs to be shared. This popular hot spot is a great place for hanging out with friends, or dining with a date. I came here by chance, but am grateful to have found it. Let me get into what happened.\nI was looking for a place to eat with my brother while we were in Brooklyn. I pulled out my phone and went to Yelp. Long and behold, Yelp did not fail me. \"Two 8 Two\" came up on my radar. It was a ten minute walk from my job, so that was a plus. To add they had a weather guard up at the front door, so you know it wasn't going to be cold inside. Inside it was quaint and long. Once you walk past the bar, there's seating in the back. The hostess sat us in Brianna's section, a waitress that was very friendly. She filled our glasses quick and immediately took our orders. Looking around I loved the red walls and wooden seating. The place was tight, but seemed to get the most out of the space. In the summer, they have a patio in the back, if you feel like dining outside. Once I got the lay of the land out of the way the food came out. No surprise one order of fries were huge, so sharing is recommended. The new double burger was big and juicy to add. Looking at all the cheese and beef took me to my happy place. But it wasn't till I bit into the burger and tasted the beef and 282 sauce, that I started to sing. It was an incredible match. They only offer two types of cheese (Cheddar and gouda) But I understand why. The burger is made to support the taste of those two cheeses, they simply made a masterpiece and want you to experience it. That added with the home made fries and you have true fine dining. I would one hundred percent recommend this place. Great atmosphere, good service, and amazing food, make this a Brooklyn restaurant that's going to be on Atlantic for years to come.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-12", "description": "I came here for my annual lunch with my team for the holidays. Their burgers have not disappointed us yet.. I wish they will make a burger combo. Service is ok.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-17", "description": "I've only had the Greek fries from here and I've returned many times to order them again.", "author": "Marley M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-23", "description": "If you're looking for a casual spot that knows how to make a classic burger, visit Two 8 Two Bar \u0026 Burger. I came here on a Friday night around 7:30 and while the place was almost full, I was seated at a table immediately. \n\nI ordered the Billy Burger with a side of sweet potato fries. The Billy Burger was just the right size and the meat was very tender and juicy. The sweet potato fries were delicious as well. Service was very attentive. \n\nIf you're looking for a casual spot to grab a solid burger and a drink, Two 8 Two is worth a visit.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "I came here for a friend's farewell party on Friday night. The space is small, but very cozy. We had a fairly large group, and were given the space in the back. The only option I had was the veggie burger, which was pretty tasty- I just had them hold the cheese. \n\nI also had the blood orange margarita, which was most definitely grapefruit, but still pretty tasty. Thankfully, we were automatically given individual bills, allowing everyone to come and go as needed.\n\nI passed this spot sooo many times when I was living in Brooklyn, and never went in. I'm glad I was finally able to check it out, but it's not on my list of places to return to when back in Brooklyn.", "author": "Dominic M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "Good burger. Nice little place. The waiter was nice and helped get an outside table ready for us quickly. We were given water and then... nothing. We looked over the menu even though we were ready from seeing the menu before coming in. Eventually our server came over and we ordered everything, including drinks. Commence with more waiting. Everything then came at once, including drinks. Could of sold more drinks if they weren't served with the food. \n\nSpeaking of the food it's pretty good. Their meat is supposed to come from a local butcher literally around the corner which I've been to and is fantastic. I found the burgers to be a good size. They are not crazy big but, they are also not tiny like someone mentioned. \n\nThe turkey burger was full of flavor and between the toasted bun and the crispy bacon was on par with what I expected of a good burger. \n\nWife had the protein burger, it had a ton of lettuce for the wrap, she ended up disassembling it. Flavor was on point though so no complaints. \n\nSweet potato fries were crispy on the outside and fluffy on the inside. \n\nThe onion rings were fantastic. Straight up beer batter onion rings. They serve them with ketchup, which is a crime. No ranch, another crime. I dipped them in the mayo/ketchup/relish mix which makes up their 282 burger sauce. \n\nOverall pleasant service and good food.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "This has by far been the most seasoned turkey burger I've ever eaten! The sweet potato fries actually taste like sweet potato fries as well! I got the turkey burger (of course) and I added a fried egg, grilled onions and pickle with extra two9two sauce on the side. It was REALLY good and super cheap! I like the back area where you can sit \u0026 eat outside as well!", "author": "Zyishia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "Everything right between 2 potato buns. \n\nI recommend the double cheeseburger.\n\nJuicy beef topped with American cheese, red onions, pickles and the two8two sauce (think homemade Big Mac sauce) served between 2 warm potato buns.\n\nI read someone compared the burgers here to shake shack and it's spot on. Perhaps a slightly larger version but just as if not more delicious. \n\nAlso the fries were done well, one order is plenty large so I recommend sharing and that way you can try the regular and sweet potato fries.", "author": "John T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-11", "description": "Underrated burgers. Potato bun, high-quality dry-aged meat, cheese, caramelized onions, and sauce. That's all you need! They source their ground beef from the renowned Paisano's around the corner.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-01", "description": "So I'm not sure how I've ever missed reviewing, hands down, my favorite burger spot. One of the best burger spots ever. I've actually been eating here for three years. A friend and I did this Loaded Cocktail Passport event back in 2016 where we were given this card to sample cocktails from multiple bars across NYC. This spot was on the list. We tried as much food as we could during our trek the three months the passport was active. None of it lived up to the burgers and onion rings we had here. The menu, is simple and I've had about 4-5 different burgers on the menu. What I had here last month was the breakfast burger. I was in the mood for a burger with egg (sans swine). My friend and I shared onion rings and fries. Not sure what she had but I hyped her on this being an amazing burger spot and she agreed. Of course we had drinks which are just as delightful but the burgers overshadow the drinks every time lol. One of my favorite places. Always open to dropping by. I wish they delivered to my apartment. I live close by but apparently not close enough ‍", "author": "Amira A."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}