{"aggregateRating": {"reviewCount": 604, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "One of the best cheeseburgers I've had in New York.  Also, when we were leaving, one of the waiters chased us several blocks in the freezing cold to bring us a birthday card by boyfriend had accidentally left on the table.  All in all, great service, great drinks, great atmosphere, great food.  Thanks a lot, two8two Bar \u0026 Burger!", "author": "Louisa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-27", "description": "We stumbled upon this place while we were walking.  The menu is fairly simple, but everything was fresh and delicious.  They have a house made veggie burger, and you have the option of throwing an egg on it. Score! But the best part was the Bloody Mary, possibly the best one I've ever had. It's spicy so you may only be able to have one, but oh so worth it.", "author": "Patty V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-09", "description": "\"Pub Burger\" = VERY good (bacon, chedder, sauteed onions, 282 sauce). If you're the \"Price is no object\" type bump this up to 4.5 stars, because the taste is definitely there. If you're looking at the whole package (value included) still easily a 4, as both burger and toppings were both perfectly made to order. But with no sides \u0026 $12 tag it's a bit pricey, even if it is 9oz's. For me it was well worth it, planning to go back to try some of the other interesting combo's.", "author": "Kevin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-17", "description": "Gotta admit, I'm a sucker for good poblano peppers.  And the burger to go with them was large, juicy, and perfect.   Burgers start at \"only\" six bucks and go up, the more stuff you put on.", "author": "Toni S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "Solid place with great burgers.  The Billy Burger sauce is delicious and the peppers on the 282 Burger is inspired.  They brag about the freshly ground beef and it clearly makes a difference.  Atmosphere is simple yet fun - and the waitstaff is friendly albeit sometimes a tad slow...", "author": "Peter L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-04", "description": "The best burger i have had in a long time...super juicy and flavorful and just the right thickness.  The onion rings were good also.", "author": "Devon K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "came here for drinks, and although I didn't have a burger, the two8two sauce is awesome with their sweet potato fries.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "A group of us came here to give it a try....let me say...I'm so glad we did!  The burgers cost anywhere from $6-$12 and you can add extra toppings for a little more $.  The burgers were made very juicy and cooked perfectly.  I ordered a \"Pub\" Burger medium rare and it came out perfect.  Everyone in my group agreed that the burgers here were very good.  Only downside (and probably the reason it got 4 out of 5 stars) is that the burgers don't come with fries!", "author": "Sam C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "Yep, that turkey burger was super juicy, just as promised.  Try the fries with feta and oregano although they are rather hard to eat.  The cheese isn't melted, but when the fries are hot, the feta get super soft and almost creamy.   The onion rings were a bit over battered for my taste and IMHO not worth the calories.  Bud Light: $4; various microbrews: $6; wine by the glass: $9.  Burgers are great but a tad small, a la Petey's Burger in Queens.  Oddly, no appetizers are served except there was a nacho special.  Not a high energy environment but sometimes the music seemed too loud for the laid back atmosphere.  The outside space is great but expect to share the table.  Try to get the table right at the gate by the outside space;  it is the best of both worlds.  The bar is a bit too bright and it was dead on a Friday night.  I think this place can be successful but some glitches prevent it from greatness.  For example: deep six the shredded lettuce - too hard to put it on the bun.  Snazz up the ketchup: don't just serve Heinz.  If you are going to serve nachos with chili (the lone appetizer the night we went), you must serve salsa with it otherwise it's too dry and blah.  By the way- no hot sauce?  Really?  The Two-8-Two sauce isn't bad but why not provide it in a little tureen on the side to add a bit of color to the dish and allow customers to turn up or down their sauce experience.  The roasted habernos were interesting but too pricey at $2.00 for a miniscule side order.  Don't get me wrong: I really liked Two 8 Two and will certainly return.  Still, Two 8 Two has to shoot for the stars and try a lot harder.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "These burgers are top notch plus AMAZING turkey and veggie burgers to boot! Great beers on tap and extra bonus is the outdoor seating now that the weather is warming up! I went back for a second time this week! Make sure you ask for the tasty special sauce. The special sauce is SPECIAL. I can't wait till they start serving brunch!", "author": "Paul H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "An absolute A+ in my book.  Went here the other week on a Friday night.  The food was phenomenal, the drinks were well-mixed and creative, and the decor was kitchy fun and about what you'd expect for a Brooklyn upscale burger joint.  They do have an outdoor seating area, but it was just too damn hot that evening.  Perfect place for a low-key Friday night dinner.  Definitely order the smoked chili peppers on your burger.  My only regret was ordering the smaller-sized burger patty.  I was still kind've hungry.  Next time, definitely getting the larger one.", "author": "Alex N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-16", "description": "I love this place. Food and ambiance are terrific. I can go with a group of friends for a yummy drink (ginger mojito!) and burger (with poblano chiles and the house special sauce please), or I can bring my kids earlier in the day and sit outside in the back garden. The waitstaff are attentive and always pleasant and the price is right. Overall I think this is the perfect addition to the neighborhood.", "author": "Dana H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-30", "description": "I want to like this place.  The atmosphere is great and the people are nice.  The burgers are good, however they are fairly small.  The cocktails are pitiful.  I've given it more than one try just to see if the first time was  a fluke.  The drinks are very small, watered down and are $10.  There are a dozen other places in the neighborhood where you actually get your money's worth in your drinks and they actually taste like alcohol, not flavored water.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "great service. excellent sweet potato fries. they did not have ommegang's rare vos on tap anymore, but the waiter was kind enough to suggest another belgium ale that was good enough.", "author": "Joana T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "Wow! What a pleasant surprise. I'll definitely be back. The bartender was great, the staff super helpful and the food really, really delicious. We started with nachos - arguably the best I've ever had - and then split a BLT, which was only $4.50 (insane) and equally tasty (due to a secret sauce). The interior is pleasant but nondescript. The food plus a beer, a Bloody Mary (great, very spicey) and two diet cokes came to a whopping $28.85 before tax/tip.", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "I had an hour to waste before meeting a buddy, so I stopped in to have a beer at 282.  Then I tried the burger because someone next to me ordered one.  Awesome burger.  One of the best I've had.  I highly recommend this place.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "The best burger I've had in my life. Great service, amazing food", "author": "Tamara M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-02", "description": "Bottom line. A 45 minute wait for a burger and fries. Yes it was a busy day. But that was 3/4 of an hour after I ordered. Staff nice, burger fine, if not quite to temp. But at 2pm in NYC  that's just crazy to have a kitchen that can't get this kind of food out. Bartender's excuse was, \"Sorry it's a full restaurant.\" Said sweetly but helplessly.  With all the choices for great burgers all over town including Brooklyn, and all the similar stories I've heard from friends about this place there's just no reason to return. They need to get that problem fixed or despite the reasonable prices, pleasant but charmless room, etc. they will not make it. Or maybe they will. By nearly 3pm I thought either this place is a mess or I am for not leaving.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-27", "description": "This place is very good...yummy burgers, fries and onion rings...but don't trust them with your birthday cake! I went here for my birthday dinner with my parents and my boyfriend. Being my parents they brought me a birthday cake and had the servers bring it out. The waiter then brought it to the back so that they can cut up four slices. Well little did we know they were cutting up more then four slices....they obv SHARED the whole cake with the staff with out asking. Funny thing is we had no idea since he brought us back the cake in the box. My mom even OFFERED the waiter a slice of cake and he laughed and said no. Well to my surprise the next day I went to have a slice of cake and there was literally ONE slice left. WHO DOES THAT?!? GEEZ. I mean they did me a favor but how rude?!? Makes me not want to go back, honestly...", "author": "Heather E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "I've been here twice in the space of 5 days.  I had the two8two burger, comes with poblanos on it, which was fantastic.  I also had the pub burger, which was the best large burger I've had in the city since McHale's closed.  The consistency, flavor, and juiciness, coupled with their special sauce make it  one of the best burgers i've ever had.  That being said the service left a lot to be desired.  Both times I was there, the bartender/waiter (same guy) was sullen, unfriendly, and passive aggressive.  Not just to us, but to every other group that was sitting in the back garden (which is quite nice), so much so that we all shared stories of how rude this guy was to all of us.  The people sitting next to us asked if the side of fries was large or small (its pretty big for a side).  His reply was he didn't know the exact \"ounceage\".  What a jerk.  And don't ask him whether he has any recommendations!  He also likes to make people wait for no reason.  When I sat at the bar(on a quiet night), every time we ordered a beer, he would take the order, and literally stand there doing nothing for ten minutes before getting us our pints.  It was almost comical.  Left a weak tip, but management really needs to figure this out.  I'd be a consistent customer if not for this @$$clown.", "author": "Stephane M."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Two 8 Two Bar \u0026 Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "282 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Dqxdz2AqWMV8IEacmd0wBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185962282"}