{"aggregateRating": {"reviewCount": 7, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "great pizza   great price... typical nyc atmosphere.... order a slice pay for it and will be eating it in less than a minute... excellent place to stop in and have a quick slice ... im always in a rush when I'm down there... for six bucks you can get a whole pie", "author": "Tommy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "So disappointed..\n\nPepperoni was charged to me at 3$, and it was the smallest slice of New York pizza I have ever received. \n\nThey warmed up the pizza really quickly, so quickly that the cheese wasn't melted. The pizza was insanely greasy, so much so, that it was dripping when I held it vertically. It's also cash only unless your purchase is over a certain amount. \n\nI'm trying a different place next time.", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-21", "description": "I mean.... for 99 cents, it def wasn't half bad! ESPECIALLY for NYC!? Theres no need to be disappointed in a slice of 99 cent ANYTHING lol no need to even go into detail as far as Im concerned haha its edible and cheap and perfect to bring you back to life if you have had too much to drink hahah. If I ever get to NYC I will be stopping here late night!", "author": "Bee M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "99 Cents Hot Pizza is good for cheap slice \n\nAnother 99 cents  Pizza landed on down town Brooklyn. Good for the area and the people who looks for cheap slices for a quick bite.\n\nI was doing some job out there and come across to this 99 cents place and gave it a shot. Which comes out not bad for a quick slice. It's $2 for 2 slices of pizza. Good deal.  \n\nThis spot, I can say have little more cheese than other 99 cents Pizza around the city.", "author": "Willson P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-27", "description": "$1 slice says it all. The cheese was okay. The crust was thicker than thin crust. It wasn't the best slice but it was enough to fill you up. It fulfills its purpose. Amenities served on the counters. Very limited seating.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-30", "description": "As a dollar slice connoisseur, I didnt have high expectations: dollar pizza is usually not very flavorful or refined, and the dinning ambience is always lacking in \"atmosphere\" haha Regardless, this place was still a disappointment. Im writing this is to notify potential customers that there is a far superior dollar slace place a few blocks away on wiloughby!\nThe slice didnt have enough cheese. Its like they were really rushed or careless - it was mostly just saucey crust. The music was so loud i that i couldnt understand the cashier. Go to wiloughby.", "author": "Eliza D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "My roommate wanted to try this pizza since it's right by our house. I was against it but went anyway because it's 99 cent pizza in NYC, c'mon! It was just as expected, kinda tough crust and greasy without any frills. It's good for a quick, cheap bite. We will definitely be coming back.", "author": "Julesy T."}], "servesCuisine": "Pizza", "priceRange": null, "name": "99 Cents Hot Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "255 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/9cteE52Z7jjwnl22HWIcaA/ls.jpg", "@type": "Restaurant", "telephone": "+17188021942"}