{"aggregateRating": {"reviewCount": 24, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "I came in looking for a solid meal after a workout in the area. Luckily, I was more than surprised with what they had to offer. The staff was super courteous and made me and my friend feel super welcome! The mixed shwarma was full of flavor and super filling. The falafel was seasoned so well!\nIt was crispy on the outside but nice and soft on the inside! Also, dont let me get started on the baklava, that thing was rich and buttery and sweet. And a steal at $2.99!\nI'd definitely recommend going here! I'll definitely be going again!", "author": "Christian B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "I rarely post reviews but I loved my shawarma yesterday so much and feel the need to tell everyone about this place so that I continue to eat there. As it's 2 blocks from where I live I could very well eat here every single day. \n\nI had the lamb and beef shawarma, it was the best shawarma I've had in my life. And I am not just saying that I lived in North Africa as a child and have traveled in and around the area. I also lived in Mexico and they know a thing or two about meat on spits thanks to the fact that the food tradition immigrated there from the Middle East.\n\nThe meat was fresh, as we're all the veggies. The sauces were perfection. And whatever they sprinkled on top took it to another level. Such an incredibly spiced sandwich! \n\nIt is going to be an effort not to go there daily!", "author": "Priya G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-30", "description": "I've walked down this strip countless amount of times and have been eyeing this place for quite some time now so I decided to finally pull the trigger and give this place a shot. \n\nAs soon as I walked in I was greeted and offered a complimentary falafel to try from the kind man in front. The falafel was very crisp and flavorful, but I came here to try their meat so I'll probably have falafel next time. \n\nI ordered the mix shawarma in a pita which consisted of their chicken and lamb, I wanted to have a bit of both to to try. First off, the pita sandwich was huge! Fully loaded with meat all the way. Both the chicken and lamb were seasoned very well with their spice blend and both very delicious but the lamb definitely had a bit of a chew to it. It would be better if the lamb was more tender but regardless, very flavorful. \n\nThe pita was perfectly toasted and fluffy on the inside which was great for absorbing all the juices, sauces, and hummus. I love the fact that they opened up the pita bread like a pocket and stuffed the meats inside, I much prefer this over just laying everything on top...it's just easier to eat.\nThere are a few tables in here but not ideal for large groups. Great spot for a casual lunch with maybe one other person though.  \nWith that being said, I will def be back when I want to have a good pita sandwich again!", "author": "Phil L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-19", "description": "I'm glad this corner of Smith Street has gotten a revitalization of sorts.\n\nThere's a new deli/buffet on the corner, and what was my former tattoo shop has become Shawarma Grill.\n\nShawarma is one of my favorite good groups. There's just something so satisfying about watching meat getting trimmed off the spit. Man, that sounded dirty.\n\nI've had the best shawarma in the world in my travels to Europe, and I can say without a doubt that Shawarma Grill is... fine.\n\nThe people working there are incredibly nice (a free sample of falafel as soon as I walk in? Don't mind if I do!).\n\nI got the mixed shawarma (chicken/lamb) on a pita. That pita was really loaded up with meat, fresh veggies, and a generous portion of Tahini sauce. I will say that the chicken parts were a little dry, but the lamb was good. And at $7.50, it's a pretty good deal.\n\nI also got their soup of the day, which was a chicken tomato soup. Loaded with spices, and perfect for the weather.\n\nThere are a couple of tables against the wall, and they have a customer bathroom, which is nice. Not a bad place to have around as a no-frills, late night food option!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-08", "description": "There's a new shawarma spot on Smith! \n\nAnd as they should, they are carving meat off a spit. This is the best way to make shawarma, and some might say the only way.*\n\nIt's pretty good so far. For instance:\n\nThe portions are large and affordable. \nThe chicken shawarma is juicy and flavorful and delicious. \nThe place is clean and bright and good for a quick meal or takeout.\nThe service is excellent. And I'm not just saying that because the dude behind the counter gave me some complimentary falafel when I walked in.**\n\nThat said: \n\nWhile the flavor was good, the lamb/beef meat combo just isn't the texture I expect from shawarma/gyro meat. Instead of the pressed, crispy but tender and easily torn pieces shaved off the spit, it was more like overcooked steak, chewy and tough to bite through (not ideal for a sandwich, if that's what you order). \n\nThe hummus lacked seasoning. Seriously, all it needs is salt and it'd be banging. Hot sauce would do in a pinch. \n\nThose are minor issues though; I'll be back soon for the chicken, and since they just opened I have full confidence they'll get it all right soon enough. \n_____________\n\n*I would say this. \n**I assumed it was because I'm so darn cute, but the next guy after me got some too and he was at least 7% less cute than I was, and assuming Shawarma Grill has standards of some kind, it might be everyone as they get underway. At least that bodes well for you.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-06", "description": "I was in the area and in the mood for a good lamb shawarma wrap. AMAZING! Not only did I get to try the amazing crispy fresh falafel but the lamb shawarma was just so fresh. All of the food here is made to order. The only thing sitting out is the condiments for the wrap! Probably the beat falafel In brooklyn! Come here for lunch or dinner. I hope this place lasts because i WILL be back.\n\nIn an area stripped of its culture, this authentic middle eastern shawarma place is such a hit! Very casual and friendly.", "author": "James M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-25", "description": "I walked in to see it was not packed on a Sunday night around 6 pm.  I was amazed that the food was pretty affordable and tasty.  I thought the lamb and beef shawarma was pretty good.  I had it on pita and a bed of lettuce salad meaning an extra $1.  One part of the beef was hard and crispy and almost hurt my palette, but otherwise, I enjoyed the flavor and the fatty content.  It's not a diet-friendly meal.  I thought the staff was warm and friendly. I noticed that this is a great lunch or dinner for someone on a budget.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "Lots of food! So yummy! I got the lamb and beef shawarma plate! Didn't expect a meal so big for only $10!", "author": "Chloe H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "Great food and super friendly staff. I got the gyro with lamb and beef and it was great!! Definitely try their soups!! The staff working there are super nice and were giving out free samples of their soups :). Will definitely be back!", "author": "Sabrina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "This place has it all. Fresh ingredients, generous portions, authentic flavors all very reasonable and amazing vegetarian options. My favorite is the lentil soup and the baba gabouj. All of the baking is done on premises. The baklava is incredible. Mustafa and the rest of the guys who work there are very friendly and ready to please. My number one go to on Smith Street. Keep it up guys! -Sam", "author": "S K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-07", "description": "Finally, an authentic shawarma experience in Downtown Brooklyn. Granted, it's a bit of a walk from all the action around the Metrotech/Courthouse area but it's worth a trip if you're in the mood for a good bite. The portion is pretty big and ingredients are fresh. The chicken shawarma was seasoned very nicely with the right balance of spices and the white sauce didn't overpower the dish. Added bonus was the sample felafel with their tahini sauce...which was heavenly.", "author": "John N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "Everything is super fresh. Great seasoning on the meat. Friendly staff. Can't wait to try the pastries next time.", "author": "Yuriy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-13", "description": "Really delicious got this amazing wrap for 6 bucks was stuffed and going to get me another one tomorrow !", "author": "Jason R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-07", "description": "its alright....the beef and lamb is very fatty... delivery was fast, but the salad had a lot of tomatoes. The rice was pretty hard but it was okay", "author": "Didi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-01", "description": "Absolutely fire. As the resident shawarma expert of my friend groups and having much experience hanging with shawarma snobs, I can confidently tell you this is some of the best shawarma in brooklyn.", "author": "Sayem H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "I moved to the area last year and hadn't gotten around to trying this place until today - and thank GOD I did! I ordered the chicken and lamb shawarma in a pita, so I could eat it on the go - and it was DELICIOUS! The best post-gym high protein meal I could ask for. They did NOT skimp on the meat, the veggies were fresh, and the tahini sauce was perfect. Suffices to say my sandwich didn't survive the short walk to my apartment. The staff was so friendly and quick to serve me. All in all, great experience and great food - will definitely be stopping in more often.", "author": "Faris A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-10", "description": "How does this place have almost 5 stars?? Ordered delivery and the hummus and babaganoush were spoiled, the chicken wrap was so dry it was inedible. Stay far far away! Beyond disgusting!!!", "author": "Dorian M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-20", "description": "Thanks I ate there lunch today I'm throwing up now feeling sick never again now I understand why there was nobody getting food", "author": "Peter B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-22", "description": "It is truly amazing foods. I definitely highly recommended this restaurant to all my frinds and to everyone who like Mediterranean foods.", "author": "Mohammef A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "I am so happy this place opened. This is my go to lunch/dinner spots whenever I'm around downtown BK. You don't see many restaurants with this kind of service. Amazing people, fresh, and delicious food. Their shawarma platter, kebabs, and the sandwiches are delicious. I can't rave about this place enough. The guys that work here are extremely nice, the menu is reasonably priced, and they are generous with their portions.", "author": "Renee H."}], "servesCuisine": "Middle Eastern", "priceRange": null, "name": "Shawarma \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/kDc0Kry9eBiU2vrsqiaz_g/ls.jpg", "@type": "Restaurant", "telephone": "+19293878196"}