{"aggregateRating": {"reviewCount": 153, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "This place rules! Had an awesome time celebrating my 27th with close friends. It was a great atmosphere, very relaxed and we did not feel in a rush at all. If you and your friends are into sharing dishes, I would definitely recommend this place. Service was on point. Great wine selection!", "author": "Clarke B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-15", "description": "GOod but not great. We ate at the bar, and as it was a quiet night, there wasn't much of an atmosphere, and none being generated by the bar staff. Both the food and drinks were on the expensive side for what was presented. We shared the duck for two, and while the flavour was good, the smoking process hadn't rendered the fat or crisped the skin, so the texture was chewy and the smoked fat flavour lingered. The Butchers Fries were superb though, good enough that I think I owe the place a second chance.", "author": "Gavin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Wow. Just wow. Fantastic service, the food was incredible. I had the BBG chicken with Black beans and best I've had. The watermelon salad had such great surprise flavors in it. I will be referring this restaurant and visiting more often for sure!", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Ill start with the fact that i almost stole the roaster decanter. I have my eyes on it and Ive called dips!\n\nOo la la. We went there for dinner last night it was absolutely incredible! Let's start with the decor: it's set up to be rustic French with a lovely tiled kitchen and cast iron detail that blend nicely with Brooklyn finishes like exposed brick and natural wood. There's a gorgeous Barn Door that they use as the coat closet... How creative!\n\n Now the food. It was DELICIOUS!  The menu is very simple and straight forward but still very unique. They encourage family style sharing but the A La Carte menu is has the same dishes plus a few more like risotto and pasta. \nWe decided to share the fish for 2 (so tender and flavorful) and the duck for 2 (prepared 2 ways, fried and sautéed in a sweet oriental sauce with pineapples and the best roasted radishes I've ever had. I could eat nothing but those radishes and go home happy every night). The sides we got were the cream spinach, the duck fat roasted potatoes with the little pearl onions, and the brussel sprout salad. I didn't have anything that I didn't enjoy. My favorite part of the mean was the poached pear at the end. It was so tender and warm drizzled with a spiced caramel sauce served with a scoop of vanilla ice cream omg... dessert is always my favorite part!\n\nThe drink menu is very creative so even if you're popping in just for drinks this place is totally worth it. The care that the wait staff, owners and, maitre d gave was very friendly and welcoming.  I even got a few seconds to chat with the chef who was creatively carving pineapples....of course. \n\nThis is going to become a regular spot for us!!!", "author": "Maria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Went here for a birthday dinner. The ambiance was amazing, and so was the food! The in-house Somm took so much time to walk us through the wine list and helped us pair our dishes with the perfect glass. The head chef is from France and his Sous Chef is from Spain, so the menu is a really lovely fusion of the two. \n\nI highly recommend the scalloped potato side (it's the chef's mother's recipe!), the mushroom risotto appetizer (enough for two to share), and the veggie lasagna as a main. \n\nAlready made reservations for a second visit! A great gem in the neighborhood.", "author": "Melea M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "My husband and I kept passing this place by and kept saying we need to go in. We went in the first time probably a month or two ago. We've been here every week ever since and brought our friends by. The duck is absolutely amazing! Chicken was ok, maybe a little dry. I get the chicken liver mousse every time we come in and it's just amazing! The two guy bartenders, Phil and Josh (I think that's the names) are great at making drinks, great service and always a good laugh.", "author": "Sofia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "The ambiance is great, rustic and green. The food is good, but the portions are small. If you're hungry, I would not recommend going here. The food is tasty, but for me it's over priced for what you're getting. Great date spot, if you're not trying to eat a lot.", "author": "Alicia T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-11", "description": "I've been to beasts \u0026 bottles twice, both times leaving me disappointed. While the dinner service and ambience were nice, the food was seriously lacking. With a higher price tag, I would expect some better quality or fuller flavors, and not just a bland rotisserie chicken. With that being said, perhaps I ordered the wrong dish. As far as recommendations go, I would recommend a few other restaurants to my friends before recommending this one.", "author": "Frank P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "Phenomenal food, fantastic service.  The staff was wonderful and were very diligent about a seafood allergy and making sure that none of our food was going to be cooked near or with any seafood.  Will absolutely be returning.", "author": "T. N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-29", "description": "Return? Probably not, fine but too many better options on Atlantic\nAtmosphere (3) Nice \nFood (3) - watermelon salad (3), chicken (3), Cod (3), cheesecake (2)\nDrinks: $9 Gruner, $16 vodka martini\nService (4) Friendly \nCost = Total tab w/ 2 drink before tax/tip typically $100", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-14", "description": "I came here for my Birthday brunch on Jan 1, 2017  . Venue was great for friends and family . Nice place for business causal or brunch party attire.", "author": "Tamara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Came in on a Sunday afternoon for brunch. I had the Biscuits and Chicken Gravy and my boyfriend ordered the Smoked Salmon Roll. Both of us really enjoyed our meals. Drinks were solid. Staff was very friendly and welcoming and we didn't wait long for our food. Definitely worth checking out if you are in the area.", "author": "Latoya D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "A must try restaurant. Great for date night or a group of friends who enjoy good wine. \nFood was amazing, we had the short rib appetizer and the duck for two. Wines by the glass was no surprise outstanding- Master Somm Alex LaPratt was helpful with pairings and suggestions as well as extremely friendly and attentive. Looking forward to going back soon. oh and chocolate mousse and dessert wine was a nice end to the night!", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "I wasn't sure what to expect going into Beasts and Bottles. After looking at the menu online (and creepily peaking through the window,) I got the feeling this was was a ~sexy~ cocktail bar with ~small plates~ only.\n\nBut it turns out Beasts \u0026 Bottles is actually serving up some very delicious and hearty farm-to-table food. While the space is definitely ~sexy~ it's actually quite unpretentious. \nYes, there are live plants on the wall, but this Brooklyn. We dig the plant art.\n\nMoving on! My friend and I ordered the pork belly and octopus, heirloom tomato salad, and prawns, along with some delicious cocktails. All of it was tasty, though the pork belly and octopus was probably my favorite. The pork belly was so perfectly tender. I wish the prawns would've been slightly more inventive, but the flavors still worked really well. \n\nThe service was wonderful -- just the right amount of doting without being overbearing.\n\nAll in all, Beasts \u0026 Bottles is a classy and delicious spot. Can't wait to come back!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-15", "description": "Don't get me wrong...the food was tasty. But everything else about this restaurant was off for me.\n\nThe service some might call attentive but I felt that the staff was looking for an up sell at every opportunity. They clearly want each table to order an expensive cocktail followed by an expensive bottle of wine. \n\nWhich gets me to the pricing. It wasn't that the items were too expensive but when I'm paying $60 for a chicken for two I expect more that two breast and wing pairs. Yes there was a chix pot pot pie but the presentation lacked the gravitas of putting a beautiful whole chix on the table. It ended up being enough food and was really tasty but when the dish arrived we all thought it couldn't possibly be for two people. Again it's $60 for chicken that includes no veggies. \n\nThe Decor was totally disjointed and gave me the impression of a gussied up Chinese spot that is trying hard to justify high prices and not a genuine well thought out space. The interior designer should not be retained for their next project. \n\nThe saving grace is that the food tasted good but I don't think I will be back.", "author": "nycParkie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "Good ambiance, waitstaff was really helpful with recommendations, and I left some items there which the kept for me.", "author": "Hilary S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Spectacular evening with perfect service. The chicken was delicious and plenty to share for two... Leaving room for dessert. Wine selection was also solid and space is beautiful. They are open for brunch so will have to check that out. \n\nI think I actually like it better than colony!", "author": "Mike P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "I've visited this charming place two times for dinner thus far, and I must say I am loving this place! I was waited on by the same server both times. Although I didn't catch his name, he was very attentive and even tried to recall what I ordered the first time I dined there. \nThe cheeseboard is fantastic with the amazing selection of local cheeses (middlebury blue, mixed drum and meadow melody). \nOctopus and suckling pig app was great. The pig was fork tender and the octopus leg was a tad dry, but, amazing flavors though! \nGreenmarket cantaloupe gazpacho was a tad too acidic for me but my partner liked it. \nDuck for two was absolutely amazing and the portion was quite large for two people!\nCaribbean chicken was well received by my sister, and from what I tasted, it was crispy skinned and the flavors paired well with the black beans and plantains. \nMarketfish of that evening was black bass with clams and saffron foam. It was a delicious and delicate dish that may not be filling for one with a large stomach.\nNeed I get into dessert? Man, the dark chocolate mousse with brownie and vanilla foam is something I would love to have every day! \nMeanwhile, the cheesecake with lavender honey, candied walnuts and orange ice cream seems to need improvement. The baked cheesecake was an amazing fluffy texture but note! It is a goat (?) cheesecake which isn't stated on the menu. The orange ice cream tasted like a fresh orange, being pretty acidic. The lavender in the  honey was just a bit too delicate for the ice cream to come through.\n\nLastly, the BREAD. It's something easily overlooked because it is free but... man their bread is superb being fresh and the texture is something I can eat forever. I've been given two different breads on two different occasions.", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-26", "description": "I wanted to be blown away because rotisserie chicken is my jam. I was already hesitant by the price of $25 or $26 for a chicken plate but went for it. For 1/2 chicken and fries { It would be nice to have had a more thoughtful side accompany the chicken} the cost was WAY OVER what it should be. When I read about the rosemary and lemon and herbs, etc. I expected my plate to be bursting with beauty and flavor. I thought I would experience crispy skin and succulent meat smothered in herbs. Instead I got a small pieces (2) of chicken with almost no herbs whatsoever. Didn't have much flavor but was ok. For the money: NO \n\nWhat was really good and I would give 5 stars to was the service and the drinks. Both IMPECCABLE. I had a cocktail, some rose and champagne over the course of a few hours sitting with friends and it was perfect. The servers were wonderful.", "author": "Brena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "My boyfriend and I came here to celebrate our anniversary. Everything was delicious. We ordered a duck and a steak for main course and the portions were huge. Great place, awesome food", "author": "Vera D."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Beasts \u0026 Bottles", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/GBL6nFACY_E_fG2m0xHTsQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188553158"}