{"aggregateRating": {"reviewCount": 153, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "Amazing experience all around. Looking for a cocktails and cuisine to write home about? Look no further. Just go and see Josh at the bar and you'll be taken care of.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-22", "description": "Everything that's good and bad about Brooklyn. Very good food at exorbitant prices. As bourgie as you can get.", "author": "Harold A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "This is my favorite restaurant  already! I have tried 3 chicken and 1 duck dish so far and all have been excellent!! So fresh the bird just melts in my mouth. My husband loves the wine selections as well as the food. Our service has been excellent every time we have been there. Great setting and ambience!", "author": "Jan D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-31", "description": "Been there for dinner, was decent. Brunch was a different story though. Maybe one of the worst brunches I have had in the area.  It tasted like the majority of the food had been cooked the day before--the ratatouille was cold and sitting in a pool of oil, the chicken sausage was hard, dried out and definitely old, the toast was stale.  Felt like our breakfast had been cooked and sitting out hours before it was served to us.  As we were eating, my husband said it tasted like we were eating breakfast on an airline, and that was dead on--tasted like pre-cooked plane food.  Will not be back.", "author": "evan r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "After an off first visit we went back for a second try at the request of the manager. It was well worth it. We had an excellent brunch from start to finish. The drinks and biscuits are delicious but the highlight was the main course. I had a salmon roll and my husband had a pork belly, shrimp, and coconut rice dish. Both were excellent. The ambiance is also lovely with a beautiful green wall and nice decor accents. Many thanks for a great brunch date!", "author": "Katie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "So glad I stumbled upon this gem! Had a terrific experience with some small bites and superb wine pairings. Decor is pleasant and inviting. Service was attentive and super friendly. Can't wait to try the pot pie when the weather cools off a bit. The mustachioed sommelier is a dreamboat!", "author": "B M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "This is my second time eating at Beasts \u0026 Bottles, and I had a great Brunch the first time (you must try their Salmon Roll)...but Dinner was very different while also exemplary. The restaurant fires on all cylinders and ebbs and flows with energy. FIRST off, the service is unlike anything I've seen in Brooklyn. The first and last time someone crumbed my table, and refolded my napkin when I got up in Brooklyn was at the River Cafe. They seem to take all the details of great service and execute them unceremoniously. SECOND the food seems to mirror the service with uncomplicated  Provençal cuisine, prepared with Artisinal ingredients and presented in an honest traditional fashion. I almost had a Ratatouille moment when I tried the smoked duck tonight, how could something so seemingly simple be elevated to such complexity of flavor...bravo to the chef. THIRD the space itself with the exposed brick and greenery on the wall and the ceiling is very Brooklyn chic Brasserie without seeming overachieving. The room has a great energy with a cozy feel and the sound does not resonate and reverberate  like many a restaurant I've been to in a townhouse space. I am truly impressed with the direction that restaurants in Brooklyn are headed. The competition for restaurants is a well fought and ever changing battle where only the best restaurants will ultimately survive. Beasts and Bottles is a new innovative addition to the downtown Brooklyn restaurant scene that has set the bar really high, and looks set to dominate the restaurant jungle by effortlessly raising the standards to a whole other level...thank you Beasts...and Bottles too!", "author": "Paul G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-26", "description": "Great atmosphere and very attentive staff. One bite into my chicken Provençal style, roasted with herbs and served in a cast iron skillet, and I decided that I'd be back. Everything was absolutely delicious. Come hungry.", "author": "Sabine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Excellent chicken (a beast, I guess) and interesting wine list (bottles). Cool vibe, too. A great addition to the neighborhood, but also worth traveling to. Hoisin chicken recommended.", "author": "Alex N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "Pleasant surprise. We ate at the bar, as all the tables had been reserved. The bartender crafted a lavender lemon cocktail for my wife that calmed her craving for bitter lemon. We had the Provençal roast chicken and sea bass. The fish was perfect--the dish a masterful creation in its consommé with bean purée and Swiss chard-- while the chicken was very tasty, but a few minutes away from perfectly moist. The potatoes it came with were the best I've ever had: crunchy-crisp outside and melt-in-your-mouth creamy inside, no doubt helped along by the goose fat. Even the tomatoes were exceptionally rendered. All right now, let's get to the piece de resistance: the dessert. The cheesecake with its orange sorbet topping, caramelised walnuts, and lavender is the best I've ever had. The interpretation of lightness and warmth, the crust and mix of flavours and textures, especially the light cheesecake itself, was brilliant. The decor and vibe were good. The space could use a more vibesy crowd, but that, I guess, varies from hour to hour and night to night. We'll be back.", "author": "Paul P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-12", "description": "We had lunch today. Chicken sandwich was excellent and chicken and waffles was delicious. I ordered the Burger and it was presented nicely. However, it was not cooked.  I left a burger and a half and no even questioned why!", "author": "Bruce B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "What an amazing addition to thr neighborhood. The quality of the food is second to none and the rotisserie selection (more than just chicken) is beautifully executed. Stars of the show for my wife and I were the sweetbread sausage stuffed quail with white asparagus and dandelion greens, and the charred romaine with bacon dressing and shallots. The wine selection is very well thought out and contains good wines from the northern Rhone valley.  Well worth a visit and the five star review.", "author": "Paul B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-28", "description": "I came here for brunch and I would guess the dinner experience is different. It's a cute restaurant, I'll give it that. However, I would say they are overpriced and uneven. One person in our party ordered the quiche and she said it was actually cold. This is inexcusable for a restaurant in this price range. The other three people in our party all ordered biscuits with gravy, poached eggs, mushroom ragu and duck proscuito. I have to admit that this dish was very well done. The biscuits, gravy, poached eggs, and mushrooms were all en pointe. The duck proscuito was just fine, which surprised me since I usually love duck and love proscuito, but apparently not united into one object. However, the dish was small for a $15 meal (+$6 for double espresso!! yeesh!). I was still hungry after consuming it, and while having a healthy appetite, I wouldn't say I am a glutton and I am a fairly small person. The dish needed some potatoes or some other side to complete it and for the money, it should have been there.", "author": "Aliz C."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Beasts \u0026 Bottles", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/GBL6nFACY_E_fG2m0xHTsQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188553158"}