{"aggregateRating": {"reviewCount": 153, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "This is a nice place with excellent meatballs, but is over-priced for what it is, which is not anything especially differentiated.", "author": "Glen W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Had a fantastic experience at Beasts and Bottles.  Surprise fifth guest that was happily accommodated last minute.  We ate fantastic apps and mains accompanied by one of the most eclectic and affordable wine lists I have come across.  The som picked out wonderful wines that everyone raved about as we walked out full and smiling.  Thank you for a great experience in such a fun and beautiful environment.", "author": "Sean L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-14", "description": "Truly it's 3.5 stars, but yelp hasn't figured out that its users want that yet, so here is the run-down: The food is very good, but is it appropriately priced? $150 for two appetizers and a chicken dinner with 2 drinks? Too expensive. Should be $$$$. Also, two standard items on the menu here on yelp were not on their menu any longer. Might not be their fault, so I am not holding that against them, but 1/2 of the reason we went there was for those dishes. The service was ok. Huge pet peeve of my wife: we had to ask for bread multiple times, and when they send it, it's exactly 2 pieces of toast. C'mon guys. Don't be stingy with bread. It's low class for the prices you charge. All that being said, the roasted marrow bone was excellent as was the salsify appetizer. Roasted sasso chicken was good, but $60 for two people for chicken? We would go back, but might think twice when we could go to Luger's for steak at that price.", "author": "Avi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "Beautiful space, delicious food, fabulous drinks and the sweetest, most helpful staff.\nLoved it!", "author": "Patrice H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Loved everything we ate and drank at brunch, they are very good about children, which is not to say the food suffers one bit to accommodate them. Will be coming back!", "author": "ashley d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "Great food and great selection of wine and amazing service.Very happy for this new place in our neighborhood.", "author": "altin u."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-11", "description": "Went for Brunch on Sunday.  The food was good but it did not compensate for the poor service. I see this place has 4 stars so maybe they were just having a bad day.  I got there at 11:50 AM with a reservation for 12:00. The place was not very busy so we were easily seated. It took over 15 minutes to get a cup of coffee and one person in our party ordered a drink that never came.  The food came out quickly and it was good but the offering was not what you would call a traditional brunch. It was very difficult to get a refill on the coffee and when we did get one we found we no longer had cream since the dispenser was so small. Getting somebody back to the table was not easy and by this time they were starting to get busy. If this place was in another city I may try it again but I won't repeat since there are so many other options in Brooklyn. I made the reservation the night before and this was one of the few places I could get one. I am still surprised at the 4 stars.", "author": "Mike J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "First off, the place is gorgeous!  The plant wall + stained glass + retro style hanging lamps give off a comforting feel.  Secondly, the food was amazing. The hoisin chicken was great!  The perfect amount of spice and zesty.  I had the cheese cake with sobert for dessert and it was prefect!  Finally, the service was superb, the maitre d was attentive and extremely mindful of my rare food preferences.  Bonus - the restrooms were immaculate, candle lit, and not freezing like other places. \n\nWill definitely be returning.", "author": "Leanne D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "The burger is HUGE, it's got the juiciness but still cooked to perfection and the sauce is seriously one of those ancient secret recipes designed to make you eat the whole thing.  Also had the jalapeno corn, which I'll definitely have again on my next visit.  The bar selection was really good, I had a few craft cocktails and also enjoyed an amazing Duncan Taylor scotch.  The ambiance was just right and the staff conscientious.  Will definitely be going again soon!", "author": "Carl D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-04", "description": "What a disappointment. My husband and I came here a few months ago and we enjoyed it. This time was awful. The food was bland and the service was straight up weird. The wait staff is inattentive. My husband sat with a finished drink for almost 20 minutes. Dirty plates stayed on the table for too long. When I said I didn't enjoy my appetizer, the waiter said, \"you should try adding some salt, I find most of the food needs salt.\" Just weird. Never going back", "author": "Shannon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Fantastic place! Food was amazing and the servers were very attentive. The manager came over to help with drinks making us feel very welcome. The decor was beautiful with perfection down to the last detail. Can't wait to go back!", "author": "Simone Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "This is a nicely done renovation on Atlantic.   The food is tasty, but overpriced (we had the chicken dishes).  The appetizers looked really good and I think that might be the way to go.  I was really disappointed that they won't give you a table in the dining room without a reservation when the place was 30% full.  The wine selection was good.", "author": "Theresa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-21", "description": "I would give this place zero stars if possible. The steaks are always over cooked. Chicken came out dry and pot pie had no sauce. Now it seems if you send food back you are asked no to come back. Wow!!!!!  I'll take my money to an actual restaurant that knows what good service and food is...  maybe instead of asking customers not to come back fix what's wrong in your kitchen so good food comes out the first time.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "We were the first ever brunch customers! Fabulous brunch, tried the chicken \u0026 waffles, kale salad and shrimp \u0026 prawn - all equally amazing. Fabulous staff, just great all round!", "author": "Sascha H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "I'll keep it short. Just left there. I had the duck and my wife had a chicken dish. The duck was cooked perfectly and my wife enjoyed the chicken very much. The service was attentive but not overly so. Overall nice experience.", "author": "Bruce A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Went for brunch in early 2017 and was impressed by the food and service. My wife and I both enjoyed the biscuits and gravy. They offered reservations which is nice for brunch and the staff was very accommodating for our group with two toddlers.", "author": "Hunter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "This place is SO GOOD. I had the market fish for one (absolutely amazing, super tender and perfectly seasoned), my boyfriend had the provincial rotisserie chicken (he said it was \"fall-off-the-bone-good\"). We split the brussel sprouts and the cauliflower gratin, and both were very good. The cauliflower tasted like my grandmother's macaroni and cheese but better. We had the chocolate mousse for dessert - to die for.", "author": "Laura S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "What a great place! My table shared the roasted duck, octopus \u0026 pork belly, bone marrow and striped bass with Grilled Corn and Duck fat fingerling potatoes. All of them were exceptional.  I would definitely recommend this place to anyone whose in Brooklyn or doesn't mind go over the Bridge.", "author": "Micah D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Great food that I just finished my dinner here and already am thinking when should I come back again!  Love the decor, the ambient, the service.  Amazing food we tried are the garlic rosemary bread, jalapeño corn, cavitelli pasta. All delicious, and we didn't even try the rotisserie chicken which is probably their signature dish. Definitely would recommend!", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "We had an amazing and dynamic dinner at this new hot spot. LOVE the design of the space, the fish was delicate and delicious, I'm GF and they were so wonderful and accommodating.  The wine in particular was exceptional! Welcome to the hood B\u0026B!", "author": "Jenn G."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Beasts \u0026 Bottles", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/GBL6nFACY_E_fG2m0xHTsQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188553158"}