{"aggregateRating": {"reviewCount": 153, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Service: 8/10\nFood: 9/10\nAmbiance: 10/10\nOverall: 8.5/10\n\nWhilst not the most attentive service, when received was very warm and hospitable.  There was a fair amount of hit/miss with the flavor profiles, the execution was on point and I must applaud the attempt at innovative flavor combinations.  Had a lovely night and will be sure to return.", "author": "james s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-05", "description": "I got the smoked duck, which was just ok, it came out a bit chewy.  My wife got the fish, which she enjoyed.  They screwed up our side which came out much later, which was confusing because the place was half empty.  nothing was bad, but nothing was amazing.", "author": "Rakesh M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "A lovely place to brunch without a line. We made reservations but found the place was good for walk-in on a cold day. \n\nThe drinks, food, and ambiance were wonderful. I tried the smoked salmon roll on a pretzel roll and I actually liked the bun! I usually avoid the buns since it's too much bread but this was thinner. My friend was very happy with her pancakes. The cocktails had character and worth another visit. \n\nThis place could be good for a family or group if you need a venue for weekend brunch.", "author": "Urszula P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-16", "description": "This is the most failed I've ever felt by reading good yelp reviews. Beasts and bottles was an utter ( and expensive) disappointment. I've heard good things from people of though I will say not in the last year. I had very high expectations and given the menu which is beautiful and a superb wine list was really excited when I went with a friend. But the food is mediocre at best. \n\nWe ordered the octopus (which I get almost everywhere); it was a little chewy and not remotely braised and crispy. My friend got the steak tartare which I actually enjoyed more than he did but the meat was cut very big and I think was grass fed which made it rather toothsome and chewy. Not for everybody. And also under season. Could really have used more mustard and capers.\n\nI then had to smoked duck which was under seasoned, a few things were under seasoned and everything else was over salted. It was chewy as well but probably the best thing we had ( low bar) it also came in a slight marinade of plums and prunes and the plums were mealy. And then my friend got a monkfish special which was not only appallingly small but also chewy and not very flavorful despite being extremely oversalted. \n\nThe wine list is great, and the service is pretty attentive (Our glasses were never empty, and we got things pretty quickly). But I absolutely would not go back. The food is just not up to what you can get almost anywhere else in this neighborhood at this point. I will say it did seem like there were an off a lot of people who don't live in Brooklyn and out of towners in the restaurant. This is not a local, good food spot. You can do better people so go elsewhere.", "author": "Sasha K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-10", "description": "Gotta admit, didn't fall in love with this place. And based on previous reviews, I thought I would. Long story short, I think it's overpriced and underwhelming.\n\nBoyfriend and I shared the octopus appetizer - extremely disappointing. Flavorless, cold, and covered in chickpeas that tasted as though they came straight from a can just 2 minutes prior.\n\nAlso shared the bone marrow - that was good.\n\nHe got the steak which was excellent. I got the duck which was mediocre. Again with the lack of flavor - they really need to figure that out. Bland dishes + high price point = unhappy me.\n\nThe best thing we ordered was definitely the steak. Everything else, I could have done without.\n\nWish I had better news! But for nearly $200 (we each had two cocktails keep in mind) I would definitely go elsewhere on Atlantic ave.", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-05", "description": "What a charming restaurant.  The low lighting and candles give it a very romantic vibe.  I got there a little before 8 on a Thursday and it was empty but slowly filled up throughout the evening.  Our bottle of red wine was delicious.  For apps, we got the empanadas which were mouthwateringly cheesy but sadly I got a huge chunk of cartilage in my first bite.  Beyond that, the friend chicken entree was juicy and the potato salad paired well.  The smoked duck was the show stopper! Such a great flavor and the outside was perfectly crisped.", "author": "Heather F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-26", "description": "The restaurant is beautiful, but that's probably the best part. The food is mostly meh to fine. If a restaurant charges for bread, it should be damn delicious and theirs was just fine. We didn't even bother finishing the crudo - the texture was dense and there was no flavor. The market fish for the evening (monkfish) was overcooked and the preparation was quite flavorless. The chicken was good but if it's the thing they're known for, it should be great. The duck was probably the best dish any of us had, which was pretty good. The server had a hard time describing the dishes or cocktails we asked about, and I had to ask for water to be refilled at least twice. The cocktails were delicious at least. I was pretty disappointed.", "author": "Heidi K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-23", "description": "This is my second visit to Beasts \u0026 Bottles.  The first visit warranted a second try but I won't be going back.   The wines were just ok for a place that touts wines.    I checked Vivino ratings for some of their wines \u0026 they were not much more than 3 stars.   The food portions were minuscule.   I wouldn't go there hungry because you'll leave hungry.   The only plus was the wait staff.   Not going back is all I can say.", "author": "Philip C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "The granola with seasonal fruit and honey was outstanding. I'm amazed how they could take the simplest thing and make it so delicious. With every Spoonful was \"oh my God the honey taste so good\".", "author": "Marilyn R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-23", "description": "Well, I typically don't write reviews for good spots - no need to attract crowds. Bad reviews, on the other hand, are useful.\nI regret to say that B\u0026B has just earned their right to be reviewed by me, here we go. Our last dinner:\n- we wait for 50 min after we ordered before the waitress informs us that one of the appetizers is not going to be ready for like another hour. We ask for the other appetizer we had ordered to be brought now and switch the unavailable choice (btw, the restaurant is half-empty at this point, so I\"m not sure why it took her 50 min to talk to us)\n- 10 min later she brings an appetizer where the allergen we had asked to be removed was not removed\n- ok, now we've been waiting for our food for over an hour. Meanwhile, drinking wine on an empty stomach, which is not optimal by any means.\n- she finally brings that appetizer done right (though the amount of meat there has been reduced by 50% compared to the previous version)\n- then we get mains.. so I guess they decided to not give us the other appetizer we ordered? Ok then.\n- then, AFTER mains, we get the original appetizer... which my husband had explicitly told her to NOT bring after mains.\n- then, as an attempt at a nice gesture, they bring us maidelenes. My husband is allergic to gluten, which he had informed her about. He asks: are these gluten free? - to which she responds: \"These are on the house. They are a traditional dessert blah-blah-blah\" - it takes like 5 repetitions to get her to understand the question. No, they are not GF. Which now feels like a cruel joke - bringing a customer something on the house that they cannot eat. This is a level of thoughtlessness I do not expect at a $$$ place.\nSo this is service. Now, food-wise: the recipes they've had for a while are still pretty good, though they did deteriorate somewhat. New recipes are a total disaster.\nI've had many wonderful dinners at this place before, and I'm sad to see it run its course.", "author": "L N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "I will never stop talking about how amazing this restaurant is. \n\nI love Beasts and Bottles! The service is great, the food is amazing! I have had the duck for two and the rack of lamb, as well as their happy hope specials. I will be a fan of this restaurant forever. \nThe lamb I had tonight was perfectly cooked and the potatoes and broccoli rabe serves with it phenomenal. This place is my favorite restaurant in Brooklyn Heights.", "author": "Nerissa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-31", "description": "Not happy, felt misled and the manager was incredibly unpleasant. Overpriced for what it is.\n\nI went to this place for New Year's Eve and thought that the 4-course tasting menu was pretty disappointing. The first course was so small that I didn't believe at first that it was in fact part of the menu being advertised. It really seemed like a complimentary piece of pastry that you would get with a coffee. The rest of the meal was average at best and the waiters were quite pushy to get me to leave. Despite all this, it was the portion sizes and the attitude of the manager what bordered the offensive. I wasn't even nearly satisfied after finishing the full meal, so I asked I speak with the manager to provide feedback on an experience that I considered below what you can find in other comparable NY restaurants. The manager's attitude was the most arrogant I've seen from anyone in a service industry. He simply attacked my palate and repeated sentences in foreign languages to express how incredibly amazing the menu was instead of listening to anything I had to say.\n\nI like to eat and with so much offering available in New York, anyone can have a far better experience at any comparably priced restaurant in the city. It's simply not worth the price!", "author": "Alejandro E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "While the menu items are mouth watering in description the food itself is nothing more than mediocre. \nFor a restaurant that offers a $60 chicken one would expect a certain level of service m. However the level they they offer here is les than acceptable at a McDonalds. \nAfter sitting down and ordering the home made bread before our drinks as an appetizer, our waiter disappeared for 20 minutes and our drinks arrived. We placed our full order :\nDuck egg and asparagus (delicious! Best menu item.. uses foam? Weird didn't know it was 2001 but ok)\nChicken Provençal ( cooked well but less than flavorful) \nBrussels sprouts ( awful! Tasted like they were plain Brussel sprouts chopped and blanched. No flavor)\nFries (hard to fuck up fries) \n\nAll this I would have given a four however it's the appalling service that we received that I had to knock another star down. When our asparagus that we ordered a good 15-20 minutes after the bread arrived first we confirmed with the waiter that our bread was indeed coming. He said it would be out shortly.\n\nThen all at once everything came, bread included, which clearly wasn't placed at the beginning. Everything was set and the waiter disappeared....FOREVER! We did not see him again ONCE!  No one came to ask if the food was ok. If we needed drink refreshments or salt and paper. \n\nFinally we flagged a busser down who acted as server the rest of the meal. He brought us salt and pepper, informed our server we would like two more glasses of wine (which didn't arrive until we were done with our meal) and came around to ask if we were finished. After sitting for 17.5 minutes ( ohhh I timed it!) our server dropped our bill off with out even asking if we wanted dessert, how the meal was or anything! \n\nI usually don't factor service in for yelp reviews but the combination of mediocre food and horrendous service I had to. \n\nI would not make this place a top priority.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Nice setting. Food was yummy but there's always an element that's slightly off. We ordered two entrees and wines\n1. Burger - bun too thick but patty was just right\n2. Caribbean chicken - tasty and crispy skin but white meat was pretty dry.", "author": "Na S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-15", "description": "Beasts \u0026 Bottles has a cool name and a cool, trendy decor to match. I really like the style of the place from the tables, to the bar and tall tables, the outdoor seating area, even the lighting fixtures are oozing with style. And like other reviews say, it is an easy place to stop in for brunch as their usually isn't a line, unlike Colonie or Chez Moi. Unfortunately, the reason for this is, their brunch is just OK, compared to the competition. However, based on some of the reviews I have read, I think their dinner might be amazing, so I may be back.\n\nThe first issue we had was the service was not great. Beasts \u0026 Bottles has a pretty expansive dining room and I think their was maybe 1-2 waiters and the bartender. Which meant it was like 10 minutes to order and maybe another 10-15 before our cocktails arrived. Food came out staggered as well, with our side orders, and one entree coming out like 5-7 minutes before the other 3 entrees. While 5 minutes isn't much, it makes for a weird/awkward dining experience. But, I will chalk this up to a rough day.\n\nFood is tasty, however. Lots of good flavors and a lovely presentation. However, not all their cuisine choices did it for me. I had the Biscuits and Gravy. The biscuits were tasty as way the meat, but their version of gravy was too watery. The thick cut bacon side was tasty, but not really that thick Unfortunately, when I think thick cut bacon, I think of like steakhouse cut. Otherwise, its just bacon. However, the burger was tasty, good meat cooked the way you want it, the Asparagus Omelette was simple, clean and flavorful and the cocktails were quite good. I especially liked the Ginger-Blood Orange Mimosa.\n\nI definitely think Beasts \u0026 Bottles is worth a visit and I will be back.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Amazing place and I am a picky eater! Highly recommend to save some room for desert. Staff are very friendly and helpful.", "author": "Svetlana G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "Very accommodating and great food choices. The wait was long because we had a large party, but the bar kept us occupied with great cocktails and wine. It is a great place to share food as well. I loved the take on chicken pot pie for two. The pie is soooo flakey and the chicken is so flavorful. Love the atmosphere of the restaurant as well. There were a lot of people but our dining experience felt relaxed and intimate. I would definitely come back, but with less people.", "author": "Kim N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-24", "description": "I asked these guys to do my family's  Thanksgiving dinner. This Thursday was the day . They listed a dinner that was fit for a king. The food was delicious  and like  advertised was pleadontiful. When  we made our purchase we asked if there would be  heAting instructions etc. and  was told no.  Perhaps  one may want to heat the Turkey but everything's ready to eat Okay then hungry family  members run over to pick up the meal at 2:15 as instructed  . Everything was cold.. cold soup..cold sweet potatoes...cold gravy  and the Turkey  was undercooked  raw yes a Turkey breast was undercooked. The only  item that was heated were the brussel  sprouts. Thank God  my family's all pulled together  and turned on stoves and heated the meal and  we ate. The food was good really good. I CAN'T  BELIEVE  THESE GUYS  LET THIS HAPPEN. THIS MEAL should  never  have left  the kitchen. We're going to let things cool down and go in on Monday.", "author": "Eugene D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Casual fine dining without being pretentious! \n\nBeasts \u0026 Bottles has become a favorite of mine over the last few months. Classy and elegant atmosphere, excellent music, an incredibly cool living wall/ceiling installation, all with friendly and attentive service to boot! Great spot for a romantic dinner or first date. Works for larger parties too!\n\nThe cuisine can be classified most likely as new American, with an emphasis on French rotisserie (they have a cool rotisserie complete with flames in the back adding to the ambiance.) I thoroughly enjoy the Smoked Long Island Duck almost every time, but the rotisserie chicken options, especially the Truffled Chicken for 2, are also home runs! The risotto appetizer is also highly recommended.\n\nAs far as drinks go there is definitely an emphasis on wine (the wine list has a table of contents it's so extensive!) I have learned that one of the owners is the ONLY Master Sommelier operating in Brooklyn! They also have a super knowledgeable and friendly floor Somm to help guide you through this extensive wine options. While the wine is great, the rest of the beverages are also on point with an eclectic variety of craft cocktails, spirits, beers, and after dinner drinks. Try Ginger Rogers!\n\nCan't Recommend this place any higher! Check it out.", "author": "Jordan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Great brunch!  Got there early (11:30) and the place was empty.  The chicken \u0026 waffle was amazing!  Comes with bacon \u0026 eggs - enough to share.  The biscuits \u0026 gravy were good but not the traditional gravy I was hoping for.  The Pims cups were tasty too!", "author": "Kay E."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Beasts \u0026 Bottles", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/GBL6nFACY_E_fG2m0xHTsQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188553158"}