{"aggregateRating": {"reviewCount": 153, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "Overall I found this whole dining experience pretty perfect. I read a number of Yelp reviews yesterday that actually had me worried about visiting Beasts and Bottles, and I have to say that my friend and I had the most wonderful experience. \n\nWe live in the Brooklyn Heights neighborhood but had never been to Beasts and Bottles before last night. We were seated right away by a very friendly and professional host. The whole restaurant decor is just gorgeous and fresh, with warm lighting and low music. We could actually hear ourselves talk to each other (I know, this makes me sound old, but when you go to dinner you want to be able to talk without screaming at each other) and the tables are spaced so nicely that you aren't on top of the people sitting next to you. Classy. \n\nOur server was also very friendly and knowledgeable about the menu. We each ordered cocktails ($13, which is pretty reasonable for NYC) that were to die for...I highly recommend The Green Light! \n\nWe skipped appeitzers, but did order the fresh bread and rosemary butter. Yum! And while I know the chicken dishes are their signataure, I went with the Clam Linquine which was delicious and just the right amount of spicy. My friend ordered the Buttermilk Fried Chicken which was beautifully plated and had no bones! I will absolutley have to try that next time. Portions were quite large, which was also a nice surprise. \n\nWhile the evening was a bit of a splurge, it was well worth it and we will be back soon!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-21", "description": "Rating: 3.5 \n\nI came here with a friend on a Monday night around 6:30 PM. When we arrived in the restaurant there was only one table of patrons, the rest of the large restaurant was empty. \n\nThe space was little bit darker but it was spacious and clean. \n\nSince the restaurant was so empty our friendly waiter was very attentive to our needs and came over right away to get both our drink and food orders. \n\nFor food, my friend and I ordered some croquettes (which were ham that day) and truffled chicken for 2. The croquettes were very delicious - the creaminess and ham flavor really worked well together. I was less impressed with the truffled chicken for 2 though. The roasted chicken was very dry so it was difficult to finish. The pot pie's flavor was good though and complimented the flaky crust well. However, it just did not feel to be worth the $31 price tag. \n\nAll in all, the restaurant itself was very nice; however, the food itself was hit or miss depending on what was ordered.", "author": "Deborah W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-27", "description": "The only two reasons I can think of to go here are:\n1) You're a tourist who doesn't know the difference between a corporate version of the \"Brooklyn vibe\" and an actual good restaurant.\n2) Your blood sugar is dangerously low and every other restaurant in a four block radius is either full or closed.\n\nTheir supposedly signature dish is chicken breast and \"truffle\" chicken pot pie. The breast is dry and poorly seasoned (and it's one of those arrogant places with no salt and pepper on the table so you need to ask a staff member permission to be empowered enough to season your own damn food), and the pot pie pastry is raw. \nThey also have the kind of service ethos where if you don't like something, the waiter, rather than voice any kind of understanding or wish that your experience were better, goes back and forth between trying to upsell you more drinks and dessert and avoiding your table because it seems to be YOUR job to make HIM happy. \n\nThere are just too many good restaurants in that part of Brooklyn to walk out of one feeling more regret than satisfaction. Avoid this feeling by avoiding Beasts and Bottles. \nYou'll do better at a nearby deli.", "author": "Brian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-19", "description": "Probably the best happy hour deal in the area! $8 for anything on their cocktail menu (which includes a LOT of awesome stuff). Plus $5 for a plate of heritage chicken wings. The Roman Holiday and the Stacked Deck were probably my favorite cocktails, but I tried almost half of them. You can get the HH wings in two styles. I went with tandoori since that was pretty unique. They were delicious, and since they're on the smaller side (no GMOs!), you get a bunch of them. The space is beautiful and gigantic (great for groups and/or children). Will definitely be back for the smoked duck!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "Ambience is amazing. Drinks are awesome! They have a happy hour that prices their $13 cocktails at $8. Great deal. The food is incredible. The duck was incredible. Thank you Julian for taking care of me!", "author": "Allison S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "So finally had their entrees with friends and family in town. Amazing. Just, freaking amazing. Their smoked duck dish,, which used to be for 2(and was duck two way), was my favorite duck I've ever had. Seriously. They've since changed the menu to a single entree and only the smoked duck(no confit), which is fine with me as it's ALL about that smoke duck. If the smell of it from the kitchen doesn't entice you, then I don't know how to help you in life. Their octopus app is a tad small to split between more than 2 people, but it has so many light flavors. I'd recommend getting it no matter what bc it's still worth getting a single bite. The ultimate tease. \n\nThe meals are pure joy and art flavoring in my book.  The atmosphere is all class. I can't express how damn good that duck is. Get it if you like duck.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-31", "description": "The worst meal I've had in 3 and a half years living in NY. \nWe dined at Beasts \u0026 Bottles on NYE at 7 pm and it was absolutely horrible. The tasting menu was a huge disappointment. We signed up a night before on open table for the 4-course meal offered at this restaurant and it was a complete joke. They mislead you advertising the holiday meal as 4 course dinner. The only course that was decent was the dessert. Everything else was tasteless, without seasoning and VERY SMALL. It was not very expensive considering it was being advertised as a 4-course meal on New Year's Eve ($85) but it was not a 4-course meal. It was a joke and we left hungry, very hungry. \n1. The truffled cauliflower vol-au-vent was the size of a quarter. It tasted like it was baked at a cheap corner bakery. It was upsetting when we realized that this was the so called first course.\n2. The Waldorf salad was not seasoned at it was 80% celery. It really was a sub-par salad.\n3. The Truffled Lobster Pot-au-Feu was not a full lobster. Seafood is my favorite food and I know how it looks. This was not a baby lobster and it was accompanied by a single tiny potato. Joke. \n4. Dessert: the ice cream was fine. You cannot really mess up the ice cream. \nIn addition, we felt rushed from the moment we came in. The waiters kept trying to remove our plates before we were finished even though the place was 60% empty for New Year's Eve. \nThe waiter was very nice and pleasant and the place was clean and nice inside. \nWhen we asked to speak with manager, we were shocked by his pedantic attitude.  He was unpleasant, arrogant, pretentious and kept saying how great their chef is. Instead of listening, he kept pretending to speak French at us even though he was clearly not French. He kept saying that it was tasting menu to explain why the New Year's Eve menu was different from the pictures in Yelp and Opentable. It WAS NOT a tasting menu and it WAS not a 4 course meal. \nHe kept saying that the restaurant is so amazing but it is not even on Infatuation.", "author": "Olesya P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Very nice place, excellent food and really great service. We came here, a group of 6, for a birthday dinner on a Friday night. It was pouring rain and our party did not arrive at the time of the reservation. The staff was very accommodating by seating the party that was waiting while the others arrived. Most places need everyone there before being seated, especially on a Friday night. \n\nOur waiter was very informative of the specials for the evening and answering any questions we had about the menu. The hubs and I both ordered the Black Angus NY Strip. The temperature of the meat was perfect. Although his cut was a little better than mine, mine was fatty, I truly enjoyed the seasoning and flavor of the steak. The fries were also well seasoned and had just the right amount of crispiness. \n\nWe each ordered cocktails. The only comment I would have regarding the cocktails, were the orange and lemon peels were really intense in the drink and over powered the overall flavor of the drink. I would definitely return.", "author": "Channelle R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-27", "description": "It's too bad because the concept has potential, and it seems from other reviews that they sometimes are much better than they were last night.  \n\nOur experience was cold food, weak service, and insane pricing. So even assuming based on other reviews that the food is sometimes significantly better, the bottom line is that there are many, many better options close by.  If you want a restaurant of this size and general \"vibe,\" skip this one in favor of Boutros or French Louie.\n\nOur mains came about 45 minutes after we finished our (decent) appetizers. They were not good:\n- Duck. Served room temperature. Maybe this would have been good fresh off the pan, but it was over-rested and room temperature.\n\n- Chicken provincial. Served warm-ish. It was super uninteresting and either was overcooked or had dried out.\n \n- Cauliflower \"main.\" Served cool. This was terrible and the closest I've ever come to sending food back. \n\n- Risotto. Piping hot. Nice enough, although one-note because, you know, it's cheesy risotto.\n\nThe pricing.\n- Our server told us the special appetizer was foie gras for $96.  When asked, she repeated that it was $96. (We did not order it).  \n- The wine list is concentrated at $120 and up--the sommelier's \"default\" recommendation was an $180 bottle. That's steep. \n- Total bill for 4 was a bit north of $500. That included tip, cocktails, 3 apps, 3 desserts, and two bottles of our \"peasant\" wine.\n\nThe service.\n- Our server was super indifferent and clearly unhappy to be there.\n- The sommelier seemed aghast that we might want to keep to sub-$100 bottles of wine. \n- Everything was slow, even setting aside the crazy long wait for the mains.\n\ntl;dr The good version of this restaurant would be a nice addition to the neighborhood, but you can do much better at other places.", "author": "Jason L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "Just wanted to check this place out for future brunch or dinner opportunities.\n\nJust ended up having a nice glass of Rose at the bar, which ran $12 per glass.  The Bartender was really friendly and informative about wine and beers.  Such a nice experience after coming from another place that was the exact opposite experience. \n\nThe entire staff was friendly and looked genuinely happy to be here.\n\nThe decor is like a rustic farmhouse with a smattering of eclectic antiques and turn of the century lighting.  It just all seems to fit together nicely.\nThe open kitchen is spotless and the bathrooms really nice.\n\nCan't wait to get back here and try the food.", "author": "Jim P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-15", "description": "Funny thing happened at this restaurant but before I talk about that let me just say that for the price I expected \"chef\" dishes not line cook dishes. \n\nFrom the moment we entered and were seated my partner and I both knew that this place wasn't for us. The waiter a beefy looking guy basically ignored us, we ordered two beers both in the pricey range. One beer needs to be super cold and the other needs a little warmth for you to notice the subtle effects. Okay you may not know that but hey beast and bottle don't put an eleven dollar bottle on the menu and bring me a friggin cold glass. The waiter didn't bring the beer another person did so no points were deducted. Halfway through the beer he (the waiter)finally comes to take our order and he grabs the bread plates and precedes to ask what we want.\n\nBread first , I answered. Plates can be set down and plates can be \"set down.\" We got the attitude set down. Strike two.  No refills on water ,no would you care for another,nothing. \n\nNow here is where I had issues. I'm a chef and my partner has attended a year at CIA so we KNOW FOOD. $29 dollars for ribs and the gristle is still on the four bones  and they aren't separated which means it's going to get messy???   Hello this isn't friggin prospect park where the option ( these were the type of ribs you purchase for a large picnic, big meaty, gristle and all spare ribs)is  licking fingers chewing the gristle or trying to eat around it. No  finger bowl, nada. The coleslaw consisted of julienned carrots and  cabbage in irregular pieces which made the dish awful to eat and pick up on a fork. Besides there were more carrots than cabbage. And it was buried under the hot ribs. Hello mayo should never be near hot food. I could go on but why?  My partners dish wasn't wiped before plating, smears and drops etc around the perimeter.We will NEVER PATRONIZE THIS PLACE AGAIN not because of the food but because of what happened next.\n\nThis next part is the one that really got out goat up. The waiter brings the bill. We put the card down. The host takes the check and card,another guy brings us the slip to sign. Two different totals but somehow the cents manage to stay the same. No one is around so we signal the guy who I asked about the bread when it finally arrives( he never answered my question when I asked about the ingredients) my partner asks if he could send someone to the table. I'm facing the door so I see the guy go behind the bar and use his phone. The waiter isn't on the floor nor the host this I notice. Less than twenty five seconds after the guy whose texting puts his phone back the waiter rushes from the back and comes over with an apology about our bill and how someone's drinks were added to ours. Two things. We never said why we wanted to speak to him and number two what drinks cost forty dollars  even with tax (remember I said the cents portion stayed the same). Our itemized bill was $87.31 the credit card slip is $137.31\n\nThis is not a place you can trust folks. Bottom line BEWARE . This was ou and out fraud. It's a scam in hopes that you don't pay attention.", "author": "Phenix H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-05", "description": "Oof. Okay... I think maybe we just came on a bad night... or maybe this place is better for brunch?\n\nMy boyfriend and I arrived for an early reservation on a Friday night. The atmosphere is lovely, and I had really high hopes. \n\nUnfortunately, right off the bat our waiter (who by the way was VERY kind and sweet, but it was definitely either his first night or he's never worked in a restaurant before.) My boyfriend and I both work in the industry so we felt bad for the guy and are pretty forgiving. We asked him about the portion amounts, how things tasted, about the cheeses and he literally had NO idea what was on the menu. Not a great first impression. \n\nAs far as the food goes... meh... really underwhelming. My boyfriend got the spare ribs and I got the bucatini. Flavor-wise nothing was really interesting. The cheese board portion was extremely small, and the brussels sprouts were actually pretty vile, some spicy sauce with green apples and peanuts. The flavor was really weird and all over the place and the brussels were hard and not cooked. :/ \n\nWe live in the area and will probably be back for brunch.. but this was not a good first impression.", "author": "Emily P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "I had a great experience at Beasts and Bottles. I'm sure there's a reason behind the name, but I'm not sure what it is! I made a reservation at 6pm for an hour later at 7pm for 4 people on a Saturday night. Very easy to get on Opentable. When we got there, the restaurant wasn't very crowded, but when we left it was completely full. The vibe is really cool, loved the green jungle-type wall. \n\nOur waiter was really knowledgeable about which cocktails were best, and which entrees he recommended. We ended up ordering the stuffed calamari \u0026 pork belly appetizer which was delicious but soo tiny for ($21!). 1 bite for each of us! We also started with the warm house baked bread which I initially thought was on the house, until I saw it on the menu. The waiter simply asked if we wanted bread, little did I know...it wasn't free. \n\nFor entrees we ordered the cauliflower which was unbelievable. I'm not a vegetarian, but this was delicious! We also had the Caribbean chicken which was massive and shareable between 2 people, with a side or two. The plantains and bean mixture was killer underneath the chicken. Also ordered at our table was the duck, which was recommended by our waiter. I'm not a duck eater,  but they said it was awesome. We went overkill on the sides (because they were $6/each) and got the duck fat potatoes, broccoli tempura \u0026 brussels sprouts. Do yourself a favor and get the broccoli tempura. Hands down winner out of the bunch. \n\nOverall this place was great, the prices weren't unreasonable for the high quality and I'd recommend this place in a minute. Would definitely come back for some more great food! Too bad I rarely frequent Brooklyn!", "author": "Kara M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-23", "description": "We booked in here for Thanksgiving dinner and had high hopes based on some of the other reviews on here. The restaurant itself is decorated beautifully and ambience is great.\n\nUnfortunately that's about it, our waiter was clearly unhappy about having to work on turkey day and barely managed a smile.\n\n$70 per head for 3 courses which were mostly underwhelming, lacked seasoning, and in the case of the lamb, portioning was small and the pumpkin was raw. The salmon ceviche was drowned in white vinegar which was overwhelming.  On the plus side the wine pairing list looked good.\n\nIt was 27 degrees outside but the main door was left ajar so everyone was inside was eating with their jackets and scarves on. When I asked our grumpy friend to shut the door he rolled his eyes and said he would ask. (They did shut it and it made all the difference).\n\nWith drinks, taxes, and tip we left $200 later and slightly unsatisfied. \n\nMaybe we stuck a bad day being TG (although the restaurant was far from full) there are so many better options in this neighborhood we won't be going back here in a hurry", "author": "Tammy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Great Drinks + A friendly and  knowledgeable bartender Phil made this a memorable and extremely enjoyable visit.  I was there close to closing on a weeknight, but was still left to take my time and enjoy my Steak Tartare ( which was great, on par with Employees Only, as Phil had remarked) and some of a Cheese Plate.   I love it when I enjoy a place like this off peak hours and get incredible dishes and great service. The place has a nice layout and decor, and I could see myself back here alone, on a date or dining with friends. Convenient location and it really does stand up to it's quality neighbors. I've read about the Chicken and Duck dishes and I look forward to my next visit to B\u0026B. Thanks Phil!", "author": "Matt C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "Get the duck.\n\nI like just about everything about Beasts \u0026 Bottles, but I truly love the duck. Daikon radish, yuzu, ginger, bokchoy, and orange coming together in a drinkable sauce to accompany a generous portion of both the beautifully cooked breast and the crispy confit leg included in this feast for two...this dish is special. My wife is a breast woman,* but she was gnawing on that crispy confit leg by the end of it, and loving every second of it. \n\nReally though, if you can handle the slightly steep prices, you're not going to be sad about anything you order here. Make it a special occasion with friends, admire the living ceiling (a serious step up from just the living wall) and order all the beasts and bottles you can handle. \n\nIf you need a little more direction:\n\n1. The charcuterie board is fantastic. Instead of just a few different types of cured pork products, you're also getting the highest quality chicken liver mousse, a duck and foie gras pate worth ordering on its own, and duck rilletes as well (yeah, anything duck is good around here). \n\n2. The beets and burrata starter is a winner, as is the octopus and crispy suckling pig (how could you go wrong?). \n\n3. The Sasso Chicken is served with a goddamn pot pie of its own. How can that be bad?\n\n4. This past visit, the market fish for two (a very nice sea bass) was a little too simple for my taste (a little more meyer lemon perhaps?), but paired with the BANGING broccoli rabe with lemon, garlic, and garrotxa cheese, it was absolutely perfect. \n\n5. Personally, I prefer the winelist to their cocktails, but you do you. Although, my mother would like you to know that she likes how their somm carries himself, so that should definitely factor into your decision-making.\n____________\n\n*Hmmm.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-15", "description": "Came here with my girlfriend for dinner and was not overly impressed. Probably a nice spot to get a drink, but I'm not sure I would come back here for the food. We ordered the octopus as an appetizer and then for dinner I ordered the rib eye and my girlfriend got the burger. The octopus was cooked perfectly and was quite tasty, however it came out cold. The rib eye is pretty large and will definitely fill you up, but it tasted like it hasn't been seasoned at all and was not cooked medium rare as I had asked for it to be. It was probably more a medium to well done steak. The burger looked great, but was stacked way too high for someone to bite into and was overall just a mess to eat. For dessert we got the chocolate mousse which was fine, nothing special. For drinks we also ordered a red wine and the Lavender Collins and both were excellent. They don't skimp on the drinks here, I got a nice full glass of wine and my girlfriend said her drink was pretty strong as well so that's a plus. Service was pretty quick, though not all that warm or friendly. Pricing is fair I suppose for the area. Overall they have a nice ambiance in here, the food however falls short of expectations.", "author": "Devin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-02", "description": "Service was excellent. Dinner entrees (risotto/ fried chicken/short ribs) all pretty good. \n\nDrinks were good even though cocktail options were limited. \n\nThe cheese plate was beyond disappointing. 3 quarter size pieces of cheese with 3 pieces of sour dough and table spoon of jam for $15! They should be embarrassed. I literally lol-Ed when it came to the table.", "author": "Carolyn G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-16", "description": "Came here for Valentine's Day.\n\n4/5 food\n2/5 service\n\nIt took us forever to be served and granted, it's a busy night but I think 40 min from the time we sat down until the time we got our amuse bouche is way too long. I mean, it's a prix fixe menu and there's no choice on the first item so it's not as if they were surprised by our order. \n\nWine pairing was okay but it would have been nice to have the sommelier come by each time instead of a frazzled server. \n\nI don't think I'd come back.", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-07", "description": "After reading all of the reviews, I really did have high hopes for this place.  I must say that I was incredibly disappointed and was expecting more.  My wife and I were in the area last night and figured we'd check it out.  \n\nMy wife had the Sotol Peach cocktail and I had the Jack's Abbey Hoponius IPA, both of which were very good.  For our main course, we each had the burger, which was good (top quality), but kind of small, overcooked, and not to mention overpriced for what it was.  The fries had an interesting seasoning to them and were delicious.  Also, the service wasn't that great, and our server was really pretentious and wasn't apologetic whatsoever when they forgot to put the cheese on my burger.  Additionally, they were quite stingy with the cheese on my wife's burger. \n On the bright side, the drinks were good...\n\nOverall, this place isn't anything to rave about.  For what dinner for two costs, you're better off going elsewhere.  It's overpriced and just isn't worth it.", "author": "Matthew V."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Beasts \u0026 Bottles", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/GBL6nFACY_E_fG2m0xHTsQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188553158"}