{"aggregateRating": {"reviewCount": 153, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "Sooooo good. Pancakes are the bomb! The biscuit with the jam are excellent and all the other brunch menu items were very good too, great ambiance too!", "author": "Geri R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Pleasantly surprised by how delicious this meal and dining experience was! Attentive and fast service, and every dish had a little extra umph to it. The small things - water pitchers, side plates, green wall, general interiors - everything added to make it a great experience and place to spend time in.\n\nThe tempura oysters were delicious, and well paired with the grapes and melon. The Australian rack of lamb was very flavorful, and went perfectly with the juice and fava beans. The bowl-plate made cutting a bit hard, and the racks could have been split into single pieces (had a couple double slices). \n\nWill definitely return, can't wait to try everything else on the menu!", "author": "Kailey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Beautiful ambiance, bottles and servers! Perfect location for people gazing and enjoying a nice beverage. Come here for drinks, food, friends and ambience. 100 thumbs up.", "author": "April C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-10", "description": "Nothing to write home about, really. Might be a good place to bring someone for a drink, but I wasn't impressed by the food or experience. \n\nThe good:\nChicken liver mouse, cocktails, ambience, chicken Provençal was tender and deliciously seasoned\n\nThe bad:\nChicken meatballs dry and dense, sauce just okay, shishito peppers soggy and tasteless! Underwhelmed by the potatoes that came with the chicken - they were like those square hotel breakfast home fries! No bread for the table, you have to buy it, and the servers were a bit pretentious and refused to laugh at our jokes. \n\nThe ugly:\nMy husband almost choked on a piece of glass that was in his drink!!! The manager was very apologetic, said a wine glass had broke and a piece must have landed in his glass, but that's bartending 101 - look in the glass before you pour a drink into it! Personally, if I were the manager I would have insisted the whole meal be on the house. That's just a lawsuit waiting to happen and we probably should have left.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "I have lived in New York for 4 years, searching constantly for the best chicken waffle in town. Today, I found it. The chicken was boneless dark meat, with a delicious crisp and balanced flavor. The waffle was light but firm, and it was very absorbent (of egg yolk and syrup). The setup also included bacon which literally melted in my mouth, with a hint of maple. I ate this two hours ago and I still feel like I am dying a happy death. \n\nService and decor were good too, don't get me wrong, but I'm all about the waffle.", "author": "Jonathan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "This is a review largely inspired by my husband, who really liked it here. (I enjoyed myself, too!) \n\nWe arrived on a Saturday, no reservation but got seated right away. The service was attentive but not overwhelming, and the food was delicious. My husband had a salad with squash, and it was a generous serving; he added a steak tartare appetizer and that made a tasty meal.\n\nI had duck croquettes, which were fine enough; the mushroom risotto was totally amazing. \n\nThe ambiance was just right -- not noisy, not full of thudding music.\n\nThe name suggests \"beer and burgers,\" but this was a classy, proper restaurant we'd recommend for first dates: pleasant without being pricey.", "author": "Randee K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "The restaurant is spacious and the staff is welcoming, with great happy hour deals. The most amazing thing was the bread, which was hot, flaky and delicious. The rosemary butter was a perfect compliment. Highly recommended.", "author": "Anna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "This is a hip place with an excellent menu. \n\nThe homemade bread with selection of butters was a small portion, but perfect for 3 people -- piping hot and oh-so-good. Everyone was impressed by their entrees as well. I normally don't order chicken when I'm out, but it's clear they cook it perfectly here. Mine was well-seasoned and paired with excellent accompaniments.\n\nService left a little to be desired. Our cocktails didn't arrive until our meals did and only after we inquired. My friend asked for a box at the end, but her food was never returned to her. These aren't the worst things to have happen, but to have two incidents in one meal was odd. \n\nOthers' reviews look promising, though, and the food was fantastic so I'm likely to return.", "author": "Ali S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "I've come here a few times since writing my original review, and every time it's been a solid experience, though never memorable. Because of this, Beasts and Bottles has become the place where we go as Plan B, when Colonie (Plan A) next door has too long of a wait time.\nTonight was really the final straw for me, and they've just lost a local BK Heights neighbor for good.\nI'll spare you the full story of the experience, as it's exhausting to even think about it, but the main issue was the service. The food was again ok, one dish stood out (the agnolotti), and the rest was fine. Not outstanding by any means, but it did the job. \nHowever, the service was so inattentive and disorganized, and we as waited a ridiculously long time for any food at all, coupled with the fact that some dishes were missed from the order (and then presented uncooked), I have to say it really put a damper on the evening.\nTo be completely fair to the establishment, I will say they apologized and took off quite a few things from our bill, which is certainly a nice gesture. Unfortunately, I've never been one that's excited at the prospect of free food or free things in general -- what I value is the experience I get from a restaurant visit, and tonight really dissuaded me from ever coming back.\nNow I need a new Plan B... hmmm.", "author": "New Yorker N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "This place is great for brunch, and their biscuits are to die for. When I lived in the neighborhood, I went here maybe every two weeks and got the scrambled eggs \u0026 chicken sausage (it comes with Ratatouille so I didn't feel awful about not getting any veggies with my meal) and occasionally the fried fish sandwich. \n\nI cannot recommended the biscuits enough, and I've never been disappointed with the accompanying jam, which they switch up every time!", "author": "Rachel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "I absolutely love this place. We've tried nearly the entire brunch and dinner menu and every dish was outstanding. They also have a great drink menu, and you can literally ask them to make anything you want, or simply tell the barman what you're into and let him amaze you :)\n\nAlso, the service couldn't be better. The two waiters we had (I'm pretty sure they are the only ones) were very accommodating, friendly and helpful when we needed suggestions or changes. \n\nI really can't recommend this place enough!\n\nAlso, they have an actual \"garden\" going up the wall and ceiling, which I find to be pretty awesome :)", "author": "Laura O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-15", "description": "I really have no complaints about the restaurant except for the portion size which was generally small.  The restaurant is nicely decorated, the service is good and the food is well prepared. We went on a Saturday night and were seated promptly.  I got the leek salad, fish special and the dessert along with two drinks and I still left unsatisfied.  My wife who is petite and doesn't have a big appetite, felt the same way.  The entree protein was barely 6 oz and could have been larger along with the sides which were not substantial.  Overall was hoping to be blown away and I was left a bit hungry.", "author": "Dr. B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "Got a lot of potential for Atlantic. Visited for a Sunday dinner and was pleasantly surprised. Service was extremely attentive. Food was well prepared and delicious. \nCurious to see if it remains consistent and can keep innovating its dishes.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Went to Beast and Bottles for dinner and was impressed by the food. The Atlantic Salmon Crudo was a great starter and the Duck for two was excellent. The Cavatelli was also very good with a lot of flavor and a bit of a kick.\n\nThe servers were also friendly and helpful.", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "The smells that come out of that kitchen seduce you. Lucky for all of us the flavor matches the smell.  But the highlight of this meal would be the biscuits. Ya'll, I'm saying...holy smack your momma good.  It is almost as if they used a slight bit of pulverized corn meal mixed in with the flour to make these because they had just enough crunch before you reach the flakey center with melt in your mouth goodness. Served with peach jam and butter, this thing makes you understand what true love is.  If you only have space for one thing, this biscuit situation combined with a nice tea.", "author": "Reshard R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "This place is beautiful. They have small booths for small groups of 2 or 3 max, a long table top that fits 8 I believe, small cocktail tables in the front, and spacious seating in the dining area. The waitstaff was extremely knowledgeable about the menu items which is a major plus for someone like me that can't help but to ask 100 questions. The food came out very quickly and all at the time it should have. We were a party of 4 and ordered 4 apps, 4 entrees and 1 side. This was way too much food and 2 of us were able to brown bag. Everything was yummy- especially the apps!", "author": "Honest R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "This has become the regular spot for work outings at my company. The ambiance here is really nice - love the decor and just the overall look of the place. Their bread and house made butter are amazing and totally worth ordering. They also make some awesome alcoholic and non-alcoholic drinks. My personal favorite is the lemon lavender spritzer.\n\nThe coq au vin here is amazing - extremely flavorful. Their desserts are also on point. Some of the other entrees have been hit and miss, but overall this place is a solid choice for a nice dinner.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "We wandered into Beasts and Bottles as a neighbor of the newly opened restaurant and were welcomed in by the beautiful living green wall and warm staff. We were seated right away at a cozy booth where we had a view of the mesmerizing rotisserie oven in the open kitchen.\n\nNo matter how the food tasted, there is no question in my mind that I would have come back to this restaurant after I took the first sip of my cucumber and agave cocktail. Tajin on the side, sweet and tart together without the sharp tequila taste, it was scrumptious. My roommate and I ended up having multiple throughout dinner! My boyfriend had the Delon Collins, which was impeccable - slightly carbonated and tasted like a not-too-sweet soda.\n\nWe started with a cheese plate of Meadow Melody, Nancy's Camembert, and Timberdoodle, which were all delicious, our favorite being the camembert. We also got the bread; now I'm someone who usually gets annoyed when I have to pay for bread, but this was 100% worth it. Warm, soft, with rosemary and salted butter. Mm! I'd have it again every single day.\n\nFor our main dishes, my roommate had the hanger steak, my boyfriend the hoisin chicken, and I the provencal chicken. All incredible! As my roommate would say \"whatever the corn is cooked in is ******* amazing\" - the hanger steak was certainly good enough to have her clean her plate. She also had a side of mushrooms, which she commented had an \"interesting texture but delicious nonetheless.\" My boyfriend licked his fingers as he ate the hoisin chicken with his hands (even though a classier person may have used a fork and knife). The hoisin chicken was delicious - a definite order - pretty sweet and could've used a slight kick, but who am I to complain? The provencal chicken was delectable, though not an adventurous choice. It came with fries, some of which were soggy, but the crispy ones were just perfect. \n\nWe ended our meal by sharing the chocolate mousse and cheesecake, all of which we devoured, even the huge portion of mousse (it is for 2, as they note on their menu). We waddled home after a meal we'll certainly enjoy again.", "author": "Jeanne M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "A very nice place to have a glass of wine . A bit on the pricey side . Very nice surroundings and bar area. The cheese appetizer was delicious but not enough only small slices were given ! At 17.00 ! On the whole \nGreat place , good luck !!", "author": "Bella B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "So first let me start off by saying my husband and I  came here 2 days in a row.  THAT is how great this place is.  The food is outstanding the service is the best we have experienced in Brooklyn in years.  This place is a gem and I swear I think we may go here for brunch this weekend because we cant get enough.  Plus their prices are very very reasonable for the level of service they provide on ALL fronts.  (Btw we came here about a half hour before they opened, by accident, on a snow day after getting out of work early and the manager was so nice! They let us come in because it was freezing out and just sit by the bar while they finished up their service meeting) \n\nJust to break it down a bit;\n\nFood: both nightly appetizer specials were to die for.  Leeks prepared two ways and a head on shrimp in a perfectly cooked risotto. The bonemarrow is so delish,  I could just order 3 of those if I didn't think it would give me a heart attack. The bread.... Just get it, my husband is lucky I let him have a piece. Everything is prepared with care and thought is put into the dish. Nothing is over salted and complicated, the natural flavors of the food are the star.  And you HAVE to order the Madeline's for dessert. \n\nService: top notch.  The sommelier is incredibly sweet and knowledgeable. We described what we were in the mood to drink and he gave us thoughtful suggestions that were ON Point and delicious ( he also respected our price range) .  I want to go back just so he can recommend something else for us to try.  The wait staff is so incredibly attentive and yet not so much so that you feel like they are intruding.  \n\nThey treated us so well on our second night there in a row (with another guest this time) that if we weren't sold on the place from the night before, their attention to detail,  (mentioning dishes we ordered the night before) and their ability to make us feel like part of their little family would have.  \n\nI'm in the customer service industry and to see a restaurant in Brooklyn that is NOT (anywhere near) over priced make the effort they do is so rare.  \n\nGo on a date,  bring work friends, go out for a couples dinner, or a group birthday, just come here!  It's worth every penny and you won't be disappointed.", "author": "Tami M."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Beasts \u0026 Bottles", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/GBL6nFACY_E_fG2m0xHTsQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188553158"}