{"aggregateRating": {"reviewCount": 153, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "The duck was exquisite. Some of the best duck I have ever eaten in my life.  Get the duck.  Our waiter, who spoke 5 languages, gave us fantastic service and was extremely friendly and gracious.\n\nOverall our meal was excellent, the menu was unique and appealing and the wine was great. We got the Syrah.  I originally thought the restaurant's name was \"breasts and bottles,\"  referencing chicken breasts and bottles of wine.  I think this is probably a much better name if you guys are open to a name change.  Anyone who gives this place less than 5 stars likely has really horrible taste buds and I feel bad for them.", "author": "Alex G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-16", "description": "OK - Don't shoot me...I am the first to give a less than 4 star review...but let me tell you why.  \nThe Good:  \nGreat sommelier: +5*; He knows his stuff and he pours with joy \nGreat ambiance: +5*; Rustic meets chic meets comfortable\nGreat bar: +5*; Creations are a craft not a snobby mixology wanna be \n\nThe Fair:\nGood bar prices: +4*; drinks were well priced, well poured and well served\nGood menu: +4*; Had the rabbit terrine (a 3/8 inch slice served just cooler than room temp), the pork belly/octopus salad (2 pieces of pork belly + 1 tentacle) and the mushroom side (has potential, but served cold - I assume that this is growing pains of a first week opening)\n\nThe Poor:\nHere we go...again, don't shoot me.  The potential is great, but I am afraid that once the novelty wears away, this will be an overpriced oasis of mediocrity.  $25 +/- for chicken (2*) and higher for meat entrees (2*) with ample portions but uninspired delivery.  The flavors were good but as expected - no \"pop\", no \"sizzle\", no \"wow\" factor (2*).  With no disrespect meant, I note that the home made bread was great (served in a softball sized loaf...4* for the item / 1* for the price)...why oh why must you charge me $4.00 for this in addition to higher priced entrees?    I am a transplanted Manhattanite and am happy (ok, not \"happy\" but \"well accepting\") of paying for superior product.  The trappings are superior, the bar is superior but the food, alas...is not.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-05", "description": "The place was nice. Service was good. The food was just okay. There were no notable dishes that would entice me or the others in the group to return. The best part of the meal was the bread which is $4 per order. There are so many restaurants in NYC with at least a few dishes that are amazing. This place just doesn't have that. I would try it again if they had a new chef or changes the menu.", "author": "Keith S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "I was checking out all of those rad Middle-Eastern spice shops this past Monday and decided to explore down Atlantic towards the water.  This area is a really beautiful spot to check out and I was just feeling thirsty from the walking.  I popped into this cozy-looking spot for a quick drink and a bite until the two alternated into a super meal.\n\nI loved the freshness and simplicity of the ingredients and the exacting preparations.  Sometimes when food is piled high with adjectives, you just bury the great (or not so great) technique of the chef and the flavor of the food.  It shocked me to hear that they've only been open for a week now.  But what also struck me was how excited the bartenders and servers were and how warm they were.  I don't live nearby, but I'll be checking back here more often than I need sumac and coriander in the neighborhood.", "author": "Scott L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Incredible. This restaurant is fantastic. The service was excellent but more importantly the food was exquisite. The menu offered something for everyone. The wine selection (bottles) was impressive. The menu changes seasonally so the choices are endless. \n\nP.S. The dessert (OMG).  Try it!", "author": "Walter O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "The food was pretty darn awesome. The sommelier was kind of upset with us when no one in our party ordered wine or even cocktails. We went mainly because we knew someone who worked in the kitchen and was gonna go somewhere for drinks after. But overall, very nice place and the cavatelli pork ragu was soo good!", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "Personally, I really had a great experience at Beast \u0026 Bottles. The plant wall and the interior design of the restaurant is very unique. Our server Altin was very accommodative and took time to guide us ( my friend and I) through the menu. We ordered the sardines and the beat salad as an appetizer. For our main course we ordered saso truffle chicken and the creamed spinach. We were extremely satisfied with the recommendations. The food was delicious and the service was great. We will definitely come back.", "author": "Anna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "The food and service was impeccable. We had the prawns as an appetizer which were perfectly seasoned and served in a delicious broth. The heirloom carrots were incredible! I know it's hard to believe that a carrot dish could be so creative and well executed but don't take my word for it, try it out yourself. I also highly recommend the strawberry rhubarb pie with vanilla icecream. Not too sweet and very fresh! And before I'm done, I must comment on the wine and cocktails. I am a little picky and admittedly hard to please in this department but our wine and cocktails were very good. My fiancé had the tequila, cucumber cocktail, and I had a glass of the California Pinot and a cocktail that the server recommended as an after dinner drink...\"Bamboo\" something? I love herbal smooth cocktails and this one hit the mark. \nThe decor is hit and miss...some really great rustic features but a little too much going on...stained glass, green wall. But I will be back. Overall, a really wonderful meal and great experience.", "author": "Joolee T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Cute little wine bar bistro. Came here for Sunday brunch and everything was delightful. Service was good and wines were excellent. Make sure you try the homemade biscuits which are out of this world! Fried chicken and waffles are a must! Will definitely be back to try dinner.", "author": "W C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "Had brunch last Sat. My friend and I, who are foodies, were wowed by the biscuits and gravy, best we've ever had (and I'm from Upsouth). Bloody Marys were also excellent. Really interesting interior design with live greenery.", "author": "Gary D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-04", "description": "We were thrilled to hear a Master Som had opened a restaurant in the neighborhood.  Finally checked it out for dinner tonight.  The squash soup, fresh bread and spreads were delicious.  The truffle chicken for two, not so much; chicken breast dry/over cooked, potatoes and onion drenched in duck fat.  It comes with chicken pot pie which was yum but very soupy. Impressive wine list.  Felt very boxed in, eating on a tiny table for two - the dinner plates are the size of bread plates, the knives and forks are much bigger than the dinner plate.  Ask for one of the three booths, they look comfortable.", "author": "Vivienne F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "Disappointing. .... \n1. The prawn app was meh and a hour after the meal I can still taste it and not in a good way. \n2. Cavatelli (sp?) was not great. The pasta was good but the duck and beans in it were not cooked well. I picked around it. \n3. Steak was good but here's the deal..... We were about to order the hangar steak and then the waiter talked us into the ribeye special without telling us it was TWICE AS MUCH. We were shocked when we got the bill. \n4. Chicken meatballs were fine but tasted like they left out one ingredient.  \n5. Service was good and friendly.\n\nNo interest in returning, at least not for the food.  Might be nice to go hang at the bar. Aesthetically it was beautiful but the food is not great which is disappointing because I'd like to return based on the \"vibe\".  But not worth the money for the food. \nSummary: \nThe prawns were gross and I am sorta sick just thinking about them.", "author": "elizabeth y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "This adorable spot is perfect for a cozy, romantic dinner or even a small family gathering. It feels warm and approachably sophisticated at the same time. The food is fantastic, especially the chicken for two, the pastas, the fries, and all the charcuterie. Really as good as it gets for a down-to-earth, neighborhood place. Unfussy, earnest but very top notch service for both food and wine, topped off with a fantastic wine program. Not to mention you can go for a leisurely stroll by the water as the Brooklyn greenway next to the water is just a couple blocks down the street.", "author": "Estilomina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Came here with my friends who frequent the chefs other restaurant. Gorgeous decor and super friendly/knowledgable staff. We ordered a bunch of dishes to share and everything was delicious. Standout favorite was the hoisin chicken and the duck. The pot pie was also delicious. If you have room for dessert, and I suggest you leave some, the strawberry rhubarb pie was out of this world.", "author": "Robert B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "What a pretty place and welcome addition to the neighborhood! Staff was very friendly, although under some \"opening\" stress and all the food we tried (rabbit terrine, foie gras and chicken provencal) was delicious. I only had a old-fashioned but the signature cocktail list and the wine list seemed very appealing.\nLooking forward to going back and try everything else!", "author": "Clara F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-22", "description": "Horrible. Not happy. Hungry. The food took very long to come and it wasn't even good!!!!! We ended up going next door to get pizza. Don't come here!!! You'll be underwhelmed like we were.", "author": "Jesse T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Fantastic food, beautiful decor, and super friendly team. The birds are a sure bet. Be sure to check out the superb wine selection put together by co-owner and Master Somm, Alex.", "author": "Casey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Amazing food,  great service,  good price,  the service is fantastic,  the fish for 2 with roasted corn was out of this world, definitely coming back", "author": "Jose Daniel O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "This is based on just one visit, but every aspect of this restaurant seems to be on point -- a rarity generally, but esp for a place that has been open for just a couple of weeks. Food was perfect from the a la carte bread that comes hot, fresh and crusty, to the perfect little madeleines for dessert. Rotisserie chicken was juicy and well seasoned. All vegetables were beautifully prepared to bring out their natural flavor and sweetness. Service was professional and friendly... and the place itself is beautiful, with a veritable hanging garden of Babylon on one wall and handsome stained glass windows on another. Wine list is impressive and is particularly rich in French selections, tho perhaps a few more value oriented wines would be appreciated -- didn't seem to be much under $65.", "author": "Barry P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-20", "description": "I'm giving three stars because we've had a good meal and an especially bad meal here. We came on a Saturday night a few weeks ago and had a lovely dinner -- the duck was so nicely done, although service had some hiccups. The restaurant was packed and had a lively atmosphere. We returned on a very (very) slow Monday night and decided to try the chicken Provençal. Bummer -- for a place that specializes in chicken, it was surprisingly bad. A local rotisserie chicken cooks it better. The breast in my dish was overcooked, the thigh not cooked enough (it was pink, stringy, very much not appetizing). The only saving grace were the crispy potatoes. Service was on the unfriendly side. Perhaps it was just a bad night, but with its prices we won't rush to find out.", "author": "Branfa B."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Beasts \u0026 Bottles", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/GBL6nFACY_E_fG2m0xHTsQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188553158"}