{"aggregateRating": {"reviewCount": 153, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "Very good food, super solid wine list. Octopus was nice. Will definitely put this in the rotation.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "We had an impromptu dinner which turned out to be a very special meal. It was very hot tonight and we wanted something light but having ordered the roasted duck for two was not what we had in mind for a light meal but it was certainly delicious.  It came with shredded duck confit, pickled daikon and carrots, roasted pine nuts and buckwheat crèpes.  As disjointed as these components were, they somehow worked together.  The pièce de résistance was the duck which was perfectly done to a medium rare.  It was very tender, not sauced or overly seasoned. The flavor of the duck showed through in the simplest way.  The offerings of pine nuts, pickled shredded carrots, daikon and crèpes with the sumptuous duck reminded me of a Peking duck, Moroccan-esque moment but it really is a well thought out unique creation of Chef Laurent Kalkotour whose French pedigree among others included working with Michelin starred chefs Alain Ducasse and Daniel Boulud The salmon crudo satisfied my desire for something fresh as did the heirloom tomatoes and peach salad.  They even had my favorite pie, a strawberry rhubarb with a big 'ole scoop of vanilla ice cream to put a perfect ending to an amazing meal.  How fortunate to live a short distance to this fabulous new restaurant which will certainly get mad crowds.  The roasted chicken at the next table was so inviting that a repeat trip is already on my mind.  Wine aficionados, be prepared for an equally creative and pleasant experience!  They now have a brunch which is also a must do.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Extensive wine menu, amazing food and attentive service, what isn't to love about Beasts \u0026 Bottles? I've swung through here a couple of times so far, and have always been impressed - whether I'm exploring the bar's cocktail menu at happy hour or I'm in for a nice dinner and a bottle of wine from their extensive list I've always had a wonderful experience. I'm looking forward to my next chance to stop by and try something new from them!!", "author": "Daniel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "The service was unlike any I have had in quite some time. The crew Beasts and Bottles has assembled never, for one minute, had us needing or wanting a thing. Even when the kitchen was hit with a dinner rush, we had multiple people keeping us updated on the status of our dessert. Overall, we just felt oh so taken care of for the evening. \nAs for the food...it was some of the best we have had in the neighborhood. The duck and foie gras pâté appetizer was delectable. For entrees I had the mussels with butchers fries. With the exception of a few mussels that didn't open up the dish was perfect! I could have directly drank the sauce out of the bowl. The hubby opted for the hoisin chicken which was extremely tender and had a wonderful flavor. For dessert we ordered the dark chocolate mousse for two and it was decadent! The bowl could have easily been shared by four people as it was super rich but definitely satisfied our sweet tooth. \nI can't wait to go back and try other items off the menu.\n* We learned there are happy hour specials ($3 off cocktails, I believe) from 5-7 but only at the bar.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "My family and I live in this neighborhood and saw this restaurant getting revamped. Finally the doors opened last Monday and what a gem! It did not disappoint! \nWe were warmly greet at the door and sat quickly (we had no reservation). The ambiance was great and vibrant (great music by the way!!). We were immediately taking care by our server (Pablo, I think..) who recommended some great cocktails.\nI got the O'Ramsey and it was delicious.\nWe ordered the Duck and foie gras pâté followed by the Quail stuffed with sweetbread and for main course the truffled chicken for 2. It was beautifully prepared and the pot pie was out of this world. We were served our glasses of wine from a magnum bottles by a super nice sommelier who knows his stuff. Outstanding and impressive service for this neighborhood restaurant. \nWe will be back!", "author": "Jean-Pierre Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Wow! I couldn't be more excited to have this move into our neighborhood. We arrived with a reservation, were seated and greeted warmly. The menu is innovative, yet familiar. Decor is friendly and fresh. Wine list and cocktails are fantastic. Try the cucumber tequila drink (I don't recall the clever name off hand) but it will blow your socks off and you will gladly face the grim prospects of a hangover to down several of those bad boys. \n\nI recommend going heavy on the small plates as they were the real stars to me. You MUST try the octopus! \n\nWe will be returning frequently.", "author": "Elle J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-04", "description": "provencidales chicken\nbone marrow\n\nlots of sexy decor with mood lighting,\ncool and trendy ambience.\nchicken was cooked well but over seasoned.\nprepare to pay for the bread they offer to start.\nthe homemade butter was the best part of the meal.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Absolutely loved the cocktails, the wine list and the food!  They definitely represent their  namesake well.  They have such a great wine list with some great gems.  I really enjoyed discussing cocktail options and culture with the bartender, who made me a phenomenal   Boulevardier.  \n\nAs far as the food goes I loved everything.  I started with the Chicken Meatballs, and the bone marrow, which was delicious, but I recommend you get it with some extra bread with the Whipped lardo.  I had the Cavatelli for my main, which was great and also very filling.  We also shared the snap peas and the grilled corn which was very rich.\n\nThe decor is suttle but really on theme and on point, I think they have the nicest champagne cooling buckets I've ever seen.  And I loved the chicken shaped decanters.  The small attention to detail with the decor just made it feel like that much more of a special night out.\n\nGet a reservation soon, I have a feeling they are going to get very busy very fast!", "author": "Nathan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Great addition to the Atlantic ave restaurant row. Unlike previous reviews I thought the service was superb. Our water glasses were never empty. The waiter checked on us often as did the manager (?). We had an unruly 2 year old with us so dinners are never a relaxing affair but the staff did their best to make everyone comfortable, even bringing some unexpected ice cream for my son which definitely quieted him down for a bit. The food was delicious. They know how to hit the spot with lots of olive oil, butter and salt. We must have gone through 3 or 4 of the house baked breads. My roasted chicken was perfect and my husband loved the beef cheeks special of the day. The biggest complaint is how long it took for the food to come out. There was definitely a delay and things were coming out at random with long stretches of time in between. It was a relatively busy Friday night so I'll give them a pass this time but at their price point I would home the kitchen gets their act together.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Attention anyone waiting in line for brunch at Colonie: this place is better.\n\nAwesome diversity on the menu. I've gotten a lot of various things for both brunch and dinner and they were all good. The chicken and waffles are amazing -- I dream about them. \n\nBeautiful, big space.\n\nTakes reservations which can be rare for a good restaurant in these parts.\n\nGreat service all times I've gone.\n\nHard to find all these things in one place so 5-stars from me.", "author": "David S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-29", "description": "I often ignore the \"this was abysmal\" 1-star reviews, but let me give you a short and not-sweet one.\n\nI have severe food allergies. I was a little nervous when the server and manager did not inspire confidence - seemed really confused - but after a long discussion with the kitchen, put in an order. This is the first time a restaurant has brought out a dish where the runner explicitly said \"this is fine for your allergies\" and, after I started eating it 2-3 minutes later, have my server come by to casually say something along the lines of: \"uh, there might be dairy in that dish.\"\n\nThe short experience ended with my wife and me leaving the restaurant and me, extremely fortunately, not needing to administer epinephrine and go to the hospital. If you have allergies: stay far, far away. Others: I would say this is symptomatic of mismanagement across the board and would steer clear.", "author": "S K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-14", "description": "Despite the food being delicious, the service was very inconsistent.\nWith prix fixe menu, we still waited almost an hour for the main course. Similar long wait for dessert. \nGuests who came much later after us, were served quicker and left while we were still eating our meal.\n\n...thus the 3 stars! Mr. Sommelier was great though!", "author": "Nina N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-17", "description": "I chose this venue because it was close to an event.  It did not disappoint.  The decor is rustic modern and it is cozy and welcoming.  The presentation of the food was impeccable, the most eye-catching of them the carrots and quinoa, served with thin shoestring curlicues of orange, yellow, and purple carrots.  The steak tartare was also pleasing, with a quail yolk nested atop the puck of beef, and little dollops of truffle chive cream and aoli.  Perfectly roasted chicken with cubed potatoes was nicely browned, and the market fish for two was beautifully presented and tasty.  Our waiter was sweet and attentive.  I wish the wine list had a deeper bench on American wines, but we managed!", "author": "Kerry O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-11", "description": "Service was absolutely horrible here. I cannot stress how bad service was. It would have been nice to get a refill for water while staring at everyone else get a refill of water.\n\nI was also super hungry so as you all know when you're super hungry food generally taste really good right? Boy was I wrong \n\nAppetizers: \n\nOctopus and pork belly not bad although you really cannot possibly f up on these two pairings\n\nBone marrow again.. you really can't f up bone marrow\n\nMain course:\n\n32 minutes after my appetizer I finally receive my COLD chewy medium rare hangar steak.\n\nHoisin chicken.. nothing special it was definitely better than the steak.\n\nTip to waiter: The food even tho wasn't amazing would have been better if there was better service. Good service will always make bad food more bearable.", "author": "Jin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Food was amazing, staff was attentive and very friendly, atmosphere was great. Dinner came out to the table quickly but we didn't feel rushed through our meal and the restaurant felt very warm and welcoming. The tempura broccoli and potato gratin was delicious as well as our steaks and desserts. Very happy.", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-27", "description": "ALLERGY SUFFERERS BEWARE: I have never written a Yelp review before but this restaurant prompted me too.  I am highly allergic to  cashews.  We ordered the hoisin chicken which according to the menu had peanuts and only peanuts.  When the chicken arrived, it was adorned with something that was obviously a cashew.  When we asked the waiter, he went back to the kitchen and asked, came back and said it was only peanuts.  We showed him the cashew and he went to the kitchen and then STILL came back saying it was a peanut.  My sister ate it and concluded it was a cashew. Another waiter came by and told us, \"oh yes, last week we ran out of peanuts and so the kitchen was using cashews last week.\" Luckily I noticed the cashew, but I might be dead if I didn't.  Beware if you have a strong allergy because the staff do not seem to know what is in the food.", "author": "Molly S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-16", "description": "Don't bother to eat here. They told me I couldn't order the smoked duck for one so I opted for the rotisserie jerk chicken. Awful. No flavor and dried out. I had to ask for tobasco and salt. The owner comped me and said that I could have had the smoked duck for one. He had real attitude.", "author": "Karen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "After an uncharacteristic first impression, my dining companion and I were invited back to give \"Beasts and Bottles\" another chance. Our second go 'round was a truly pleasant evening with attentive service and enjoyable dishes.\n\nAfter champagne, my friend and I started with the house-baked bread, served warm, before moving onto the Truffled Chicken (for two) with a side of carrots.\n\nThe Truffled Chicken is served two ways: with the white meat over mushrooms and the dark meat baked into a pot pie. The white meat was tasty, but the pot pie was tastier, proving to be the standout dish of the night. We drank a recommended white wine with our meal, which paired nicely.\n\nWe finished with the night's special dessert--chocolate and lime ice creams atop a sweet biscuit--and had the opportunity to thank a member of the staff for the invitation back.\n\nAll in all, we felt welcomed and appreciated as dinner guests, and the meal was a great way to end the week.", "author": "Jarrod T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "Very good food, great wine list and cool decorations. This is a 5 star place for lesser wallets then my own. I would give this 4.5 if I could. Just nothing of the food stood out to make it a 5 star place. Almost 5 stars due to wine.", "author": "B C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-24", "description": "Very nice space and good vibe.  Service was very good but interesting that they bring a new wine glass with every glass of wine when you order by the glad (and sticking to to the same wine).  Food was good but really pricey for what you get.  Split the the truffle chicken for two.  The pot pie was amazing.  The chicken was a little dry and lacked the flavor.  And only two pieces for 60 dollars?  Understanding there is truffle in it (but the other two chickens are also in the 50's) it's pretty outrageously priced. For that kind of money you can get a super market rotisserie chicken and a really nice bottle of wine.", "author": "Molly G."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Beasts \u0026 Bottles", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/GBL6nFACY_E_fG2m0xHTsQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188553158"}