{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "This may be a super skewed review, but Superfine really saved my wife and I from having a complete meltdown. As one of the groups caught up in the reBar mess, we were left out on the street, trying to find a new place to have our wedding reception. after 2 weeks of calling place after place after place after place.....you get it....I got in touch with Tanya (the owner) and we had a meeting. She was nothing but sweet and accommodating and made it possible for use to have our wedding reception for what little money we had left. And man oh man, that reception was a PARTY! The food was awesome and the staff was amazing! My wife and I will forever be in debt to them.\n\nBut enough about the wedding. We've actually been to Superfine a few times for dinner and drinks and we've never left unhappy. The food is always seasonal and delicious, and everybody working there has never given me a reason to complain. I would suggest something specific to eat, but the menu always changes, but it's always good.\n\nWe will forever be regulars and if you ever find yourself wandering the streets of DUMBO, stop in, get a drink and play some pool - IT'S FREE!! (The pool table, not the drinks).", "author": "Kevin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-09", "description": "We ventured into Superfine on a snowy day, after walking across the Brooklyn Bridge. We really, really wanted to like it due to its unconventional layout and atmosphere.  Our server was indifferent at best: we watched our beers sitting on the rail at the bar for an eternity before she decided to bring them over, and at meal's end when I reported that the \"amazing\" mahi mahi tacos were beautifully cooked and seasoned but should have been drained before plating (they were downright \"soupy\"), she shrugged and replied that fish is wet.  My wife got the grilled cheese which was tasty, but small considering the price. If you seek overpriced food from a staff that doesn't seem to care, Superfine may be for you - otherwise, you can do better.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Great food and ambiance.  Huevos Rancheros superb!!! Great music and atmosphere for Brunch!", "author": "Eduardo V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "I came in here on a recent Sunday evening with a group to continue the festivities of a friend's wedding earlier in the day. The space is open and industrial, but the hodgepodge of fun vintage furniture and other decorations make the space festive and inviting. I really liked the tiki bead \u0026 tinsel curtain that led to the women's bathroom.\n\nThe restaurant was somewhat empty around 6pm, so it was easy for us to find space. We commandeered the free pool table and played on it for most of the night. At some point, a live folk-y band came onstage and played, which added to the chill yet fun atmosphere.\n\nThe draft beer selection was good, and I got to try a couple beers I had never even heard of before. I didn't personally order any food, but my friends who did said theirs was very good.", "author": "Julia L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-18", "description": "Everything aesthetically speaking was marvelous and their drinks (cocktails) are AMAZING!!  but the food not so much. My friends meal looked so disgusting and poorly cooked.. Not to mention it tasted like pure lime...The calamari was so bland for being \"grilled\". Probably wouldn't come again , except for that's yummy rum cherry drink !!", "author": "Patricia J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-30", "description": "I came here during the Dumbo Art festival with friends. There was only the bar menu available which had about 4 choices and desserts. It's 4pm in the day and you're a New York restaurant... Why don't you have more options available? As a vegetarian I could only order the cheese platter or the grilled cheese. It was my first meal of the day and I didn't want to start off with a plate of cheese, much less one that cost $14. \n\nThe second option wasn't much better...$15 for a grilled cheese?! It's 2 slices of bread and cheese...how is that justifiable?! A  hearty pasta meal in a good Italian restaurant is that price... Mexican food is even cheaper. For $15 that better be the best grilled cheese on earth. I asked the waitress why it was so expensive and all she said was that the ingredients were all organic. \n\nNo thanks, I'll keep my money and skip the organic ingredients. I decided to go with the Warm Apple Crisp instead for $8. I'd rather shell out money for a dessert I couldn't make myself than two slices of bread and cheese. My friends ordered the grilled cheese however and said that it was just ok, not worth $15. My apple crisp was just ok as well. They were super stingy with the ice cream, not even a full scoop. \n\nThe service at Superfine was super slow as well. The waitress took forever to come with our menus (she was very nice though). And the busboy forgot I asked for a spoon for my dessert so I had to get up and get one myself. \n\nOverall, I wasn't impressed with the food, prices, or service. Their one redeeming quality was the drinks. They were a good size and the bartenders didn't skimp on the alcohol. Still didn't make me forget the mediocre food though.", "author": "Yoshi K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "Superfine is a favorite amongst many who live in this unique Brooklyn neighborhood. Tucked away under the Manhattan Bridge, you could almost miss it but my suggestion is DON'T! If your looking for a great destination with a cool vibe, this is the place. I would classify Superfine as a hybrid. It is a bar, restaurant, music venue, and local hangout.\n\nInside, the space is intriguing with a post-industrial aesthetic. Once your lips meet the food, you will be hooked. The menu has lots of fish and fresh vegetables dishes. Being a burger lover, I got a cheeseburger with bacon and it was AMAZING. But why take my word for it? Go try it yourself and experience this really trendy space.", "author": "Christopher R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-18", "description": "We stopped in Superfine after dinner for some more revelry. They had a decent beer list, and a lot of empty tables where our group parked it for a while. There wasn't anything special about Superfine, but it was nice that they had tables open, it was quiet enough for conversation,and wasn't super crowded.", "author": "Alexandria T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "I always leave happy and full from Superfine. Had the calamari mixed with artichokes and endives. The house salad was fresh. My mouth waters just thinking about the pork chop. Grilled to perfection and served with mashed potatoes and a special coleslaw mix.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-22", "description": "Stopped here during a downpour in Brooklyn. I had scouted it earlier in the day looking for a good quality lunch spot, but the $14 sandwich price kept me walking past. At dinnertime, there wasn't much else around that wasn't packed, so we went in and got seated. The menu prices were very pricey for what they were. I ended up getting a shortrib taco appetizer for $10 as I wasn't feeling any of the $$ entrees they had; one plus is that they did have an amazing alcoholic ginger beer! The minus is that when I asked for more bread, the waiter thought I meant another beer and he brought me a 2nd. When I told him that wasn't what I meant, he shrugged nonchalantly and walked off, so we were stuck with another ginger beer.\n\nAnyway, unappealing menu items, high prices, and the food was medium. Also, there isn't anything \"Mediterranean\" in this place, so I was further disappointed given the Yelp! category. I wouldn't come back.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "I can't say enough about this place! The hostess Bella is Supernice and our server John was attentive but not overbearing. I had a bad birthday experience at Peter Luger on my birthday and was seeking a steak redemption. I ordered the Grass Fed Filet Steak au Poivre and I was stunned at the quality. I would say it rivals Keen's at about half the price. I really loved the atmosphere too. It does not feel cramped and crowded like Manhattan restaurants and I like the original artwork on display. I will be back for sure!", "author": "Joe P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-17", "description": "Food was overall OK--no majorly exciting flavors.  Service was sub-standard.\n\nOn food, a placard on the table raves about local, organic and highest quality seafood yet waiter wasn't even sure if salmon was wild caught.  Turns out it's farm raised yet no other detail was provided.  Hangar steak was pretty delicious, although I ordered it medium and it was borderline raw in spots.  Other items were just basic with no flair including pork loin, mashed potatoes and bar menu antipasto.  \n\nService was disjointed overall--felt like opening night.  While the place wasn't even half-full, it took over 10 minutes for our waiter to stop by when we arrived to take the order straight thru.  No check in when food was delivered.  And then my empty plate sat there although it was noticed at least 3 times.  Just getting the check when we requested it was tedious.  \n\nAt the price point, food and service should have been a little more special.", "author": "Phillip B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "FIVE Stars for Atmosphere! 3 Stars for Food!\n\nVery trendy yet Hipster. Definitely a comfortable to come and chill with friends. It if difficult to hear each other with large parties though. The place gets VERY loud. They have a free pink pool table, great for special photos. Drinks are good, Food is OK. I had the Fish Tacos, the taco fell apart but was good. The Hash Browns and Salad were very sparse, think crazy expensive City restaurant. \n\nIts walking distance from the Promenade, Brooklyn Ice Cream, Jacques Torres, etc. Great Location.", "author": "Alice L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-13", "description": "Boring place with boring meals but good selection of beers. The options in the area are so scarce though that this is not such a bad option after all", "author": "Rafael A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-19", "description": "Oh Superfine... what's with the odd kitchen hours? I've three times in row stopped in for solid eats only to find it's in between lunch/brunch and dinner or that you stop serving by 11p on a Saturday. Not superfine. At all. DUMBO doesn't have that much going for it restaurant wise, you'd be wise to offer full kitchen hours. The bar 'food' filler is not a solution.\n\nThe only reason I'm giving 2 stars is because in the (now distant) past I was lucky enough to have a meal or two there and it was good.", "author": "no n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Best burger I've ever had, simplicity and taste beyond your wildest dreams. The pork chop was also incredible. Great service too an easy 5 star all round", "author": "Simon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Excellent food, great atmosphere! Pork chop was amazing. My wife had the fish which she loved. Cocktails could be a little stronger, but other than that great place.", "author": "Jeff S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "No complaints at all. Superfine is Superdelicious! My partner and I stopped in for a quick bite before skate night and were immediately impressed by the decor, service, and of course the food. This is a really cool spot that's away from the hustle and bustle of NYC; which is a major plus in my book. Also, they offer live music...a nice touch to your overall experience. The open seating, quality of food, and hospitality honestly reminded me of Nashville. I will definitely return.\n\nTip: order the fluke fish and chips and raspberry shortcake for dessert.\n\nP.S As a farm to table establishment, their menu changes frequently....which sucks if you have a favorite item, but could also be awesome if you like trying new things!", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-23", "description": "My client and I needed a quick lunch so we stopped here. I ordered the grilled cheese and it was pretty decent he ordered the portobello mushroom and he said it was good but has had better. I'm sure there are other better dishes to order. The service as extremely friendly and helpful though. I think I would give it another try and order something else.", "author": "Jane P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-17", "description": "When we walked and there was no one to receive us at the door. When we finally found someone, she was rude and obnoxious. The food was disgusting, watered down beans and under-cooked fish. We returned 2 of the 4 dishes we ordered. Then as I we were walking out, a cork from a bottle flew in front of my face almost hitting someone. It was a bartender opening a bottle of sparkling wine. It was a bizarre almost surreal experience, like being in the twilight zone. Needless to say, I'm not going back.", "author": "Ari S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}