{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-21", "description": "If you're thinking of eating at Superfine, I recommend staying home and eating a Lean Cuisine instead. \n\nThis was most certainly the worst meal I have eaten in my fourteen years of living in New York City.  The service was mediocre and the food was inedible. \n\nOne of the members of our party canceled last minute with a sinus infection and we all agree that she probably had a more enjoyable evening.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "I work in Dumbo and my friend was in town and happened to be in the hood. We wanted to meet up for a couple drinks and maybe some food. I really thought about where to go while sitting at my desk. There was only one choice!\n\nThis is by far my go to for Dumbo. There are better cocktails, better food, and bettter decor at other places, but none bring together all 3 in the Dumbo-way like superfine does. Keep it up! And whats the next pizza on special?! \n\nLove.", "author": "B C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-03", "description": "I was here several weeks ago before that Lizmonade event. I've been to ReBar numerous times across the street and figured to give this a shot. The bartender was friendly and let us sample beer as we figured out what we wanted. I think all beers on draft are $4 during happy hour. Steph wanted to go here because she 'thought' there was a Mermaid beer. I know exactly what she was thinking of: The Coney Island Pilsner. It's not that great and it also wasn't on tap or on the shelf. But they had one of the best German beers on tap that I've tried in a good long while and fully regretted my choice in getting a mediocre IPA after I sampled hers. It was called Benediktiner Weissbier. A very refreshing amber ale that had hints of banana on the end of its nose. I can't believe I remember this because it was months ago and I never order German beers. But here you go, kids. \n\nTheir champagne cocktail with muddled strawberries and floating mini raspberries - Nothing to write home about. Split that with Steph because it sounded good but was just an over-priced cocktail with adequate but not great Prosecco and floating fruit in a champagne flute. Very spacious place though and it wasn't too full during a decent happy hour. \n\nOH! And most important part about this review: You can play pool for free here! You're welcome.", "author": "Ingrid S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "A favorite amongst DUMBO locals.  The owners and staff are incredibly welcoming.  Great brunch with amazing Bloody Mary's.  Live music on Sundays at brunch and dinner always a lot of fun.  Food is good and the overall vibe is excellent.", "author": "Brooklyner B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "I was in Dumbo and dropped in after being away from NY for a few years.  It was fairly busy (it probably was around lunchtime) and resulted in it taking a bit longer than I would have preferred to have been seated and attended to.  It also was pretty loud as well, which wasn't an absolute deal breaker for me but not totally enjoyable.  Aside from that the experience was cool.  I got the superfine chicken sandwich and enjoyed every bite.  This honestly has been the only thing I've gotten here, but it hasn't failed me yet and will probably continue to be my go to as long as it's on the menu.  I paired it with a cider that I experimented with and unfortunately didn't like it too much because of a odd taste on the back end that I couldn't quite place...  Maybe cinnamon but not sure.  A more dry and less sweet cider would have been better I think.  Hope their beer list updates next time I come back.  All in all, it was a good meal and I'm sure I'll be back.", "author": "Lucien A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "Superfine\nNY BK DUMBO\nSaturday 11th July 2015\nFour Stars\n\nThe restaurant was fairly empty except for the decently busy center bar. The atmosphere is pretty laid back with an upscale feel. I really like that there is seating along the backside of the bar and the pool area in the front.  Our birthday party sat in the far back corner below the Coney Island mermaid parade banner. We enjoyed some liquor, wine, and beer. \n\nThe grilled calamari with endives, carrots, and dressed with an anchovy vinaigrette was quite good but I think the squid should have been featured more in the dish. The fried squash blossom was one large flower battered, fried, and stuffed with cheese. Both were good starters to share. The Bone-In Pork Chop  had a Cajun flavor with actual grill lines. The meat was quite juicy and tender except around the bone. The Gouda Mac n Cheese that accompanied the entree was delicious. The pasta was lightly sauced and less creamy. The Gouda flavor was mild. The addition of broccoli lightened the dish and add a bit of crunch. However there was not enough cheese of veggies for my tastes. \n\nAside Note:\nI get pet peevish when a restaurant calls their pasta and cheese combination as \"Macaroni and Cheese\" but in actuality the pasta used is something other than macaroni. This restaurant used \"cavatappi\" which is a ridged tubular corkscrew pasta which is in the macaroni family. So this place actually can said Mac n cheese. For example: If I order ravioli and you give me tortellini, I think that most people would feel a bit mislead. \n\nThe spaghettini was the best looking dish and most filling without the presence of a protein. \n\nThe service was good. They added a 20% auto gratuity which is illegal but always fine by me.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "the porkchops were deliciousssss!!!!! the bar is the coolest it goes all around and has a high and low part but it definitely fills up fast. My friend and I were seated at at table over looking the bar. Aside from ordering the porckchop(which was seasoned well) i got the lemonade drink. That was good as well. My friend ordered the penni pasta which came with sausage and he doesnt eat pork but the waitress apologized and kindly took it back to the chicken to substitute with chicken. I will definitely be back and it is very affordable", "author": "Kim A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Revisited Superfine after many years... What a transformation of the menu...\n\nThe space has that perfect blend of modern, artsy, local, industrial spattering of local artists artwork on the walls. 7 PM on a Thursday night, not too crowded, not too loud, promptly seated.\n\nEnjoyed a delicate Campari lemonade cocktail and splurged on the steak au poivre with a side of mashed potatoes.\nThose potatoes, silky and chived, intended for sharing... But sadly, hoarded by me. So good.\n\nAnd I say splurge in the true sense of the word as this steak was, by far, the finest prepared and most tender piece of meat I've ever tasted. And I've eaten at Keens, Sparks, Peter Luger's, Old Homestead... I finally know what the \"melt in your mouth\" experience is.  $38 with a side of perfectly seasoned fries and a small salad.  Solid. A short walk from the York Street stop on the F line.", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "my family and I had an amazing dinner! The love band made the whole evening better. First off, the food tasted so fresh. Superfine is known for their organic ingredients and you can taste them. Second, our hostess was very friendly and the atmosphere was relaxed. I definitely recommend for dinner. ALSO, they do have a bar but it was kid friendly and they have seating.", "author": "Brianna Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-02", "description": "I've been here before when it was super busy, service was ok. Today I came in, not busy at all. Walked in and the bartender saw us and didn't acknowledge us. During the wait, another bartender comes behind the bar and they begin talking. We're still waiting. So I decide to flag him down and he says \"yea, I know, we're talking\" Idk who trained him in customer service but I truly feel disrespected. Everyone in customer service knows!!! CUSTOMERS COME FIRST!! I'm am beyond disappointed and disgusted with how he treated us! I should never walk into a bar, a popular one at that, and be ignored for a conversation that could have waited. Shitty service and worse bartender I've encountered. All them muscles and clearly NO brain!! A real asshole if you ask me!!!", "author": "Tina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Typically over priced because it's in Dumbo but unlike most restaurants, the quality of the cooking and ingredients come through in the food and almost make the price worth it. I have never seen a wilted piece of lettuce. The hiuse salad is $8 for a pile of lightly dressed leaves, but they're so crisp and fresh and balanced that it's worth it, in my book. It raises the bar for restaurants that clearly don't take care with their greens (AL MAR)\n\nThe soups are usually delicious and the meat is always cooked properly. At dinner, the calamari is to die for. It's perfectly grilled. Perfectly. And the pizza is delicious and changing daily according to the chef's best judgment. \n\nThe only downside of this place might be the pasta; the noodles themselves are largely nothing to write home about and taste store bought. \n\nIf you come here during lunch alone or with someone else, the service might end up being awfully slow so youd better sit at the bar where the chill bartender is always ready for you. \n\nFrom what I understand, this place is OG, a type of es establishment in Dumbo before Dumbo became what it is now. But Superfine has held up well and feels like the place still cares about what it does, unlike so many spots in Dumbo which are largely basic-bitch fare.", "author": "Yurn T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-29", "description": "*** Casual hang out area, Lots of drink selections *** \n\nThis is only reviewing the location and the drinks. The venue is very large and they serve food and drinks. A group of us came here to hang out and cool down; we had to get our drinks ourselves even though we were sitting at a table. The menu had a lot of selection to choose from.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-13", "description": "Was in Dumbo this weekend and was looking for a fun friendly place to eat. I found this place on yelp. I entered and waited 5 mins to be acknowledged by the hostess at the top of the ramp. After 5 minutes I politely said \"excuse me\" to the lady at the hostess table just to ensure I was waiting at the correct place. She replied \"I'm doing something, I can't help you\". I was so taken aback by how immensely rude and disrespectful she was. I was shocked and my only thought was that she did not want to serve me as an African American woman! There was nothing else that she knew about me that would make her respond to me in such a disgusting manner. I was had no choice but to turn around and leave the establishment. So sad that we still encounter these type of people in Our own neighborhoods in 2018. I would never spend any money in a business that employs racists and does not treat all customers with dignity and respect.", "author": "Colleen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "Drinks and desert Sunday night with my guy. It was so bitter and cold outside but inside Superfine was really cozy. They had live music and it was at a good volume as to still chat and talk. I had a Hot Buttered Rum drink as per the Bartender's recommendation, which I adored. My boyfriend had a Dark n' Stormy which he didn't love because as I always remind him, he does not like ginger beer!!! The Bartender noticed how slow he was drinking his drink and sweetly offered to make a different drink but he declined and we shyly blamed it on the fact he is a slow drinker. We didn't want to hang out for too long since we already had dinner at a nearby place and just wanted one round of drinks and desert. For desert we had an apple pie with ice cream, it was okay... the ice cream was good. I was happy with the whole ambiance, art and attentive service so the not so special pie didn't bother me one bit. I want to go back and try the food and more cocktails. It also seems like the type of place I would loveeee to work at.", "author": "Aileen V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Some might think \"wow a place needs to be extremely good in order to get five stars\"....well if you're looking for that kinda place Superfine is the place to go!\n\nMy boyfriend and I happened to stumble upon this place after walking across the Brooklyn bridge. I'm glad we did! From the atmosphere to the drinks to the food and amazing serving staff, you honestly can't go wrong in a place like this. \n\nI had the pork chop with Gouda Mac and cheese and my boyfriend had their grass fed burger cooked to perfection. \n\nLooking for a great Saturday night dinner for two or a cool place to grab drinks with friends Superfine is the place to go!", "author": "Sanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "This place has one of the best pork chop brunches I've ever had. I think it's a must to try here. It is extremely well cooked. It's moist with a wood grill finish. My only problem with the pork chop brunch plate is that they put apples next to potatoes which makes no sense to me, but I give them to my wife so it works out. I've also eaten lunch here. My burger was very good and my wife's chicken sandwich was even better. Not the best burger I had, but very good. The 5 stars that I'm giving to this place however definitely have to do with the pork chop brunch. \n\nP.S. People that are giving negative reviews to this place don't focus on the food. So to me totally useless.", "author": "Lenny G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-13", "description": "Not a restaurant. Not a Club. A hybrid of HORRIBLE service and all too loud music. Any five star reviews of this place can easily be considered farmed..", "author": "Oskar M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-07", "description": "Came here for a drink with some friends after a long day.  I was underwhelmed by the beer and cocktail list and service.  The atmosphere was cool though, but it was akward to stand at the bar on the high side and look down on the servers.  We didn't have any food or anything, so I might have to come back for dinner.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-17", "description": "Sucks it hard in all honestly.  The definition of undeserved pretentiousness. Smelly bar stuff, asshole bartenders.\n\nGet ready to get ripped off!!!!\n\n\nThanks but no thanks.  See yanbyyyyye..!", "author": "Marc S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Stopped in for a quick work lunch and had the spghatini (sp). \nIt was really flavorful and filling, and even though I sat at the bar, the service was delightful. There is something about this spot I really like. Gonna bring folks here for dinner sometime soon!", "author": "Rik N."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}