{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "This incredible restaurant is the pioneer of Dumbo and it's obvious in the details how they've outlasted all the others. The food is fresh, delicious and respects the planet. The environment is beautiful and welcoming with a friendly, knowledgeable staff and the owners (3 awesome women) are there every day! They support community, music and art in the spirit of the old NYC that you only hear about in folklore.\n\nI would recommend Superfine to all nice people.", "author": "Carmelita W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-08", "description": "I do not know about the super part.\n\nI will say that the bar/restaurant has a really cool layout and the decor is very artistic. The place kind of has a fusion between the old and new school in terms of decor. It seems that this place invites a very diverse group of people, which is one of the things that I love about New York (but we are seeing less of in the city).  I did not experience the food here, although the pictures of the pork chops look pretty amazing. Superfine has a very nice list of beers and cocktails, so everyone can find something that they like.\n\nAlthough the bartenders were very nice, the service could have been a little better. Even though we are sitting at the bar, it seemed like we had to shoot a flare gun in the air to get any of the bartenders' attention. I think that many folks from the neighborhood hang out at Superfine, which is cool, and the bartenders were chatting with them. I mean they weren't extended conversations but it felt like we were waiting a long time to get acknowledged for ordering drinks.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "this staple of DUMBO is amazing, and not just because the owner is from Texas. Amazing food \u0026 drinks, and the ambiance can't be beat. Pool table, full bar, and fabulous art work. This is the place to be in this hood.", "author": "Bullet S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-22", "description": "Didn't love it. Service was slow but everyone was nice! Food just ok. Hubby didn't like the burrito. I had the enchiladas and they were fine. We are glad we came but we wouldn't come back", "author": "Sue G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-17", "description": "Cool location right under the Manhattan bridge in Dumbo, Brooklyn.  Building had that old-New York, industrial brick character inside and out.  Fun vibe inside.\nWe went for lunch this damp June saturday, and had reservations, but probably didn't need them.\nI love the menu concept -- apparently selections change depending on ingredient availability and sustainability. Thumbs up for that.\nFood was good, but I know there's more potential.  My grilled cheese was nice, with spinach and tomato on multi-grain bread, but a little too oily (yes i know it's grilled cheese, but still.)\nMy wife's portabello sandwich was also a bit on the greasy side.\nService was great.  I'd like to try this place again for dinner or later for drinks.", "author": "Patrick A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-28", "description": "Been in here a few times before, all good experiences. Went in last night with a couple of friends after work and upon asking for a *table*, NOT seats at the bar, I was asked how old I am, and upon answering that I am, in fact, twenty-eight, the hostess said \"really because you look about fifteen.\" I wasn't aware you needed to be a certain age to get a table at a restaurant - I had not even suggested that I might want to order a drink! Afterwards, our server was very pleasant and attentive but my food was cold and bland. Sadly will not be returning.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "Honestly torn between 2 and 3 stars.  They took a last minute reservation for 8, which was great.  However, the food is mediocre.  We ordered a range from the menu.  Jerk wings, gem salad, burgers, crab roll, branzino, calamari, risotto, spaghetinni.  The gem salad was missing the artichoke.  The spaghetini was missing stuff as well.  The jerk wings were mild in flavor.  My burger, which was angus beef, and cooked medium well, was just okay as well.  The shoe string fries were good though.  Even drinks, magarita, iced tea and lemonade were just okay.  Not sure if I would come back.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-09", "description": "I was a bit disappointed with the food. We ordered Calamari, risotto and spaghettini. Risotto was overwhelmed by the taste of asparagus. The meatballs in the spaghettini were too spicy. We also ordered pomegranate cocktail and it was too bitter.", "author": "Becky V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Atmosphere is great. Staff is great. \nBurger - 5.0\nCalamari- 3.0 (little mushy)\nWings - 2.5 (need to upgrade flavor)\n\nCool vibe and great burger.", "author": "Brad V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "A great find in Dumbo, in the shadow of the Manhattan Bridge and a stone's-throw from the York Street subway station (F line).  The place has a very cool, low-key vibe, with a nice long bar, exposed brick, and friendly staff - the kind of place you feel instantly comfortable with. \n\nAll three of us ordered different variations of the breakfast burrito, filled with scrambled eggs, house-made sausage, jack cheese, pinto beans, and a healthy amount of green chiles, perfect for anyone who likes a little heat with their eggs in the morning - that subtle yet oh-so-satisfying burn. The burrito comes with some nice breakfast potatoes and some fresh salsa, making for a great start to the day.\n\nWe lucked out and were treated to some live music by Brad Vickers and the Vestapolitans, some great American blues/R\u0026R to go along with a great breakfast (and a very nice spicy bloody mary).  Definitely a really nice way to start a sunny fall morning in Brooklyn!", "author": "Andy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-13", "description": "Stopped at Superfine for dinner with a friend after the Essence street style festival. The festival was amazing, lots of beautiful people but not enough food trucks so we decided to seek dinner elsewhere. \nSuperfine happened to be right in the vicinity. We glanced at the menu and though it didn't seem too appealing I figured I'd make it work. And I was starving. \nFirst thing I notice is that Superfine is actually a pretty dope venue. It's so big that there's railing separating the different areas of the restaurant; there's seating everywhere and a huge bar with seating on both sides. There's even a stage for live performances and yep- there was a band playing. Unfortunately the band was on their way out but a cool jazz band started setting up soon after. An impromptu dinner and a show is always great! \n\nUnfortunately the food here is slightly below mediocre. We shared the corn chowder ($8), the waiter split it into two bowls, his suggestion, which was nice. I ordered the pork chop, a massive piece of swine accompanied with a cheesy pasta side and yellow squash ($28) and my friend ordered one of their pasta dishes ($24). Pretty hefty prices which would have been OK if the food was good but it was not. \n\nThe corn chowder was super bland, so bland that we added salt. It was just not good, though the corn did taste fresh. Rarely do I have to add salt to my food at a restaurant, in fact, that was a first. \nMy pork chop came with beautiful grill marks and a great grill taste but it was slightly dry and too thick of a cut. And again, lacking salt. The sides were forgettable, only 2 slices of yellow squash and a variation of mac \u0026 cheese that wasn't cheesy enough and had sad little pieces of broccoli mixed in. The dish didn't really work together.  \n\nMy friend's pasta dish was a simple pasta with red meat sauce (made with sausage), eggplants (she asked for light on the eggplant). I sounded appetizing but when it arrived it didn't look very interesting, and when I tried it, it was bland as hell. Slightly worse than a pasta dish I could easily make at home. \n\nOverall the food here was completely disappointing which was such a shame because the service was awesome and our waiter and hostess were both great. \n3 stars for good service and a great ambiance, with live jazz, but the food deserves 2 stars for having no flavor and being overpriced.", "author": "Sasha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "We had a DELICIOUS nomment at Superfine. Dîner was really good, fresh. Beer is a total go to! Cherry on the cake: the menus changes every day according to what is delivered! Love it! This place deserves its 5 *", "author": "Ludivine V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "My favorite place to eat in the city. Incredible bad-ass women owners, fun funky atmosphere and always amazing food. Love love love!", "author": "Helen T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "I came on Friday night for a work event and had a great time. I was there for cocktails, networking and games. There is a pool table on the elevated level offered for Free to patrons. The drinks are a bit on the pricey side, but then again it is DUMBO...they do offer a happy hour which has more of a reasonable selection. The food is good and fresh....all in all it is a great spot to converse, hear music, play pool and chill out...Would definitely go back on my own.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "Small portions, spotty and slow service.\n\nTbh it was a bit underwhelming and then the bill came. Waiter was so indifferent he made us calculate our own tips and taxes across 6 checks.", "author": "Pete R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "I came here with my wife and kids, and was surprised when they were able to sit us right away with no reservation. The food was spectacular as well as our server Alex. I  Will come here alone with my wife next time!... The best seafood we've ever had .. Their selection of Beers are seasonal and a must have .. Their staff are kind, respectful and their owner are always onsite to say hello and explain menu options and what farms they work with, Organic Farming, Biodynamic Farminng.. Truly an amazing experience all around .. Eye opener to the best neighborhood in Brooklyn", "author": "Steven D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-20", "description": "So the decor is nice, large open space a nice band was playing. But someone here has made a lot of bad decisions. First off the food is terrible, no taste everything was bland. Don't order the breakfast burrito it was soggy. And the steak and eggs, the steak was very small. They included a small salad with rotted greens. But worst of all they have 2 terrible paintings with the word love on it.", "author": "Vanessa J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-26", "description": "Went there as a large group for lunch. Service was awful. They took 20 min to get our drink order, another 20 to bring the drinks out, and only then did they take our food order. Took 30 min to bring out the food for one table of 10, and it took until we were done leisurely eating our meals before any food came out for the other starving table of 15. Honestly, we were in this exact same situation a few months ago and I thought that that was maybe a fluke. Nope. They provide terrible terrible service 100% of the time.", "author": "Alice Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "I think this is a nice neighborhood restaurant. Their food selection is not huge but it is interesting. The staff is friendly and the space is nice. The next time I am in Dumbo it is likely that I'll stop by again.", "author": "Cindy A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-29", "description": "Just a chill neighborhood spot. Lunch took a while to serve, but it was good (pork chop and veggies). Big portion for the price.", "author": "Andrew K."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}