{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-18", "description": "Superfine is mighty fine......not exactly.  Love the name, and have been here once a long time ago for nighttime crawlin'.  Big industrial corner space with oodles of exposed brick and windows all around, just at the side of the Manhattan Bridge.  Coming in for brunch after the Winter pop-up market(my next review).  The hostess said whassup?  A strange greeting for a hostess- yes I would like a table wench.  As the zydeco band played, I noticed the lack of tables so I sat at a cute spot at the bar.  The front of the dining area boasts a pool table and auditorium chairs, which is pretty cool.  The service here overall is in the I could not give a flying f...k, category which seems ok for the hordes of hipsters dining in.  Luckily, there is an absence of the stroller set in this hamlet of brooklyn.\nI ordered the steak enchilada which arrived on a hot plate-obviously nuked.  Tasty with green chili, lots of beans and homefries for $12 bangers.  Organic coffee looked good.", "author": "Franny A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-08", "description": "I made a Saturday, 7 pm reservation for a large group of people weeks in advance and confirmed it twice, but once we got there, they didn't have our table ready and then while we were waiting for them to get it ready, they gave the table away to another party without a reservation.  We weren't seated until after 7:30.  \n\nThey were very nice, and apologized and gave us a free round of drinks, but it was a bachelorette party and we were headed to a show nearby, so the stress over the timing really put a damper on our meal.  \n\nI was served the wrong drink (I ordered a kamikaze and received a cosmopolitan) and they tried to serve us a few incorrect meal and dessert orders.\n\nThe calamari was rubbery and over-cooked and the scallop/shrimp entree was not very good.  Maybe they were having an off night with the seafood, but it was really disappointing.  \n\nHowever, the pork chop, steak and ribs were all fantastic (giving credit where it's due).\n\nI've had mostly good meals here in the past, and I like the atmosphere and the music, but the experience last night was sub par to say the least.  It was really a let down to count on Superfine for a perfect evening for my friend, because they just didn't come through.", "author": "Teresa T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-17", "description": "Sure it reminds me of a few girls I've dated.  And yes, it's a cornerstone of the dumbo experience.  It's hip.  It's edgy.  It's eclectic.  I get it.  But that makes it a great neighborhood spot and not necessarily a destination restaurant.\n\nThe Sunday brunch is mediocre.  I had the fish tacos.  Just fish and tacos.  No white sauce or shredded cabbage.  The tag line on the menu should've said 'It doesn't suck'.  \n\nI have to admit though, the best plate at our table was probably the breakfast burrito.", "author": "David F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "I liked the layout. It is a bit tiny area for seating at bar but you can deal with it. \nThey had a pool table but someone was playing non stop so I missed a chance playing. I also found out that it is free?! \nI will have to ask nicely to switch turn next time if i ever go there.. \nOver all, I only had beer there but the price was good. I thought because of the look of this place, it will be expensive beer but it was not. \nGood place to hang or go out for dinner.", "author": "Yumiko F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-06", "description": "My actual food experience was 3-star, but I'm giving an extra star to the friendly bartender for topping off my drink (which was mixed very well).\n\nThe space is nice, and sectioned off reasonably between a lounge area with pool table, dining tables, and bar. And it's cute that they bring you a handwritten menu on a white board (though the writing is illegible at times!). My main gripe is that they were out of a couple of things on a Friday at 9pm - which might be excusable for a restaurant with a large menu (but their menu is pretty small). And those a dined with seemed to have really small dishes. On the plus side, the prices were very reasonable, and the appetizer pizza was quite tasty.", "author": "Kiesha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "I only know this fine establishment in the context of its bar. And it's the only bar in Dumbo or Vinegar Hill open late late on weekends until 66 Water is back in business. It's nice, large and loud, with Dumbo locals aplenty. Drink prices are also reasonable, which is surprising considering the unreasonable prices for everything else in this part of town. There's even free billiards! If you can get a game in at 2am on a Friday. What more can you ask for? For the neighborhood's gentrification to reverse? Keep drinking, buddy.", "author": "Lawrence S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "I recently went here for the Brooklyn Bridge Conservancy Junior Committee Cocktail Party and was really impressed by the venue. It's a cozy spot in Dumbo with an attentive wait staff, reasonably priced beverages, and a cozy vibe. They have plenty of drink options from well drinks to wine (a bit expensive, but this is Dumbo), and the music is memorable! I'd love to come back for happy hour with my friends.", "author": "Lindsey T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "This place is having a bit of an identity crisis. From the outside, it has a sorta warehousy feel. The exposed brink inside and bi-level bar inside are cool, but the blow up palm trees and other strange tropical decor seem a misplaced. Then the fact that we had to actively seek out someone to get us a table was a bit annoying (especially when she acted as though we were bothering her when we eventually found her). All that was forgotten though when our waitress arrived. She was incredibly friendly, not a bit pushy, and offered just the right amount of guidance when it came to recommendations.  I love that they change the menu regularly based on what's fresh and available that day, practically guaranteeing a quality meal. The pasta was delicious with a generous amount of sausage and kale and an incredible red sauce despite the fact that this place doesn't claim to be italian. In the end, we left super satisfied, almost completely forgetting superfine's minor earlier indiscretions. A solid choice on this side of the Brooklyn bridge.", "author": "Jen I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-17", "description": "This place is really super cool.\n\nThe food is fresh and taste awesome. The drinks are great! the decor is really funky. The staff is nice.\n\nMake reservations for dinner...if you don't it could be a long wait.\n\nTry: the pork chops and the house salad.", "author": "Awilda S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-09", "description": "After waking up on Sunday with a nice, full body hangover someone suggested hitting up Grimaldi's down near the Brooklyn Bridge. No one else seemed to want to go so my friend and I, well, we went on a Man Date.\n\nBecause of the line at Grimaldi's we immediately ditched the pizza idea and just decided to score some grub in the area. I remembered that a co-worker had recommended  Superfine so we hit it up.\n\nI like Superfine. I think the setup, at least for brunch, works great.\nThey had a live bluegrass band playing, people were attractive(not that that's a prerequisite but it helps), however we were definitely the youngest people in the room.\n\nOnce inside we immediately seated ourselves at the bar and began drinking bloody marys(strong, mad vodka).\n\nI ordered the omellete special and he got the breakfast burrito. \nMy omellete special(good, no complaints) was about half the size of the breakfast burrito(apparently delicious).\nBecause of this I finished my meal well before my friend and just sipped on bloodys. By the time he was finished I had a nice buzz goin.\nThere is no brunch special where you get a drink with your meal so you can(as I did) accidentally unnecessarily run up your drink tab very quickly. Drinks are expensive.\n\nEither way, the food and drink left us feeling fantastic and forgetting about our hangovers.\n\nOverall - a good(not great) place to get brunch if you are in the area.\n\nWe topped it off by walking across the Brooklyn Bridge into Manhattan.\n\nI then immediately took the JMZ back to my spot and crashed for 4 hours...NICE", "author": "Zach S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-01", "description": "New Years Eve Burlesque Show.\nREALLY Superfine????  Since when is it OK to have children at your New Year's Eve Burlesque night???  Naked women and children rushing the stage to see.  Also, when you have one of those children get up and do a\ncover of Adele, perhaps you should announce that you are doing karaoke.\nThe really bad loud guitar band that got up to do an equally bad cover of\na John Lennon song did not add positivity to the proceedings.  The most annoying aspect of the evening is having to fight children to see the stage.  I don't care if this is Brooklyn where parents bring children into a bar like they bring them into a grocery store, a night at a place that has strippers on stage should be off limits to children!  What a way to disappoint, Superfine.  We wont be coming back next year.", "author": "Sherry H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-16", "description": "I USED to love Superfine, but I will NEVER go there again. \n\nIs it possible to give negative stars? Last Saturday  friends of mine were there for a birthday party. Late in the evening a male patron drunkenly grabbed my friend's crotch. Yeah. No warning, no provocation, she was walking by and he grabbed her. She's a boyish looking lesbian and he and his douchbag friends were checking to see if she was a boy or a girl. \n\nThe bartender was alerted to this and did nothing. After a heated exchange between my friend, her girlfriend and these drunk assholes my friends were the ones escorted out of the bar. \n\nI don't care what your gender/sexual politics are: it is totally unacceptable for someone to be out of control drunk and grab another patron in a sexually harassing way. It's DISGUSTING. What is even more DISGUSTING is that Superfine is owned by a couple of dykes. Get your door policy and security shit in order, ladies.  You don't support your own community? Then we're sure as hell not going to support you.", "author": "Jane M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-15", "description": "Stopped in to have a bite to eat after Nerd Nite at Galapagos. Superfine sheltered us from the dark and stormy weather outside. Once inside, I forgot about the dreary weather and soaked up the beautiful ambience. There is a vast sunken bar in the center with Asian-inspired paper lanterns hanging above giving the place a romantic, dreamy feel. The dining area is spacious, and this is one of the reasons I really like Brooklyn. There is SPACE. Not to be taken for granted! We sat at a 4-top formica 60s style table. All the tables are mix-matched and give the place a bohemian feel.  The menu is on a dry erase board, which I find unique and tells me that the chef pays attention to the menu and tries to vary the offerings. We weren't famished but needed to refuel so we ordered a tilefish/shrimp cakes appetizer. A few minutes later, the waitress produced a plate with 2 beautiful seafood cakes. Cooked just right, flavourful and fresh! We also tried the chocolate orbit cake, and it was a small piece for $7, but well worth it. The texture was mousse-like, and not too chocolatey! Just the way I like it, silky, smooth, and not too sweet! There was also a DJ spinning tunes, and took me back to the early 90s (ie Salt n Pepa). The rain doesn't suit me, but walking out with the Manhattan Bridge overhead and rain pouring down made my heart go thump thump with excitement ;-)", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-19", "description": "I absolutely love this place. Food, drinks, atmosphere and staff are fantastic.", "author": "Yondas E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-21", "description": "Contrary to some yelpers, I really enjoy this place for dinner (although i've never been there for drinks only, so I can't attest to the \"horrible\" bar experience). However, if you're looking for a cool place in DUMBO - with a laid back vibe - to sit down and have a delicious meal in - this is a solid option.", "author": "Joanna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-21", "description": "Ok, first of all: Superfine wins my prize for favorite gluten-free fries (shoestring, warm and crispy delightfulness!)  Hooray for potatoes!\n\nNow, for the rest of the stars: Fun, tasty drinks. An openness to gluten free dietary restrictions. A rotating menu of in-season and as local as possible meals. Perfect place for bringing out of town family (there are wild culinary feats AND home-style fares that both city dweller and midwestern middle ager alike can appreciate!)\n\nAaaand, last but not least: Our waitress was delightful, and though a few minor technical difficulties ensued, we remained completely happy and feeling entirely welcome.  \n\nThis will be a permanent fixture in my out-to-eat suggestions!", "author": "kate p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-04", "description": "We've been to Superfine many times and enjoyed it very much. We love seasonal menus that change daily based on what is most fresh, and Superfine sets a fine example of this kind of philosophy. Don't come if you are in a major hurry- just sit back and adjust to the more relaxed vibe of Brooklyn and you will have a nice experience. Our only complaint (albeit a minor one) is that the french fries are too oily and salty, but the other food I ordered has always been exceptional.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-08", "description": "Superfine is a really good look.. As a restaurant. It's a real nice place to bring a date while being able to listen to her speak.. LOL.. The have pool tables without it being sleezy/ dirty/ bar. Exactly what I said.. perfect for a date, drink, dinner and a little fun. I've actually seen live music in here before too.. Menus changes.. But I'm a fish person, and it was on point every time I was there.", "author": "DJ G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-13", "description": "I had 1 AWESOME brunch here and 1 HORRIBLE dinner.  the dinner could probably use some explaining, but let's start with brunch.\n\nIt was about 6 months ago but I can still taste the french toast.  It was literally perfect.  Maybe I was high on brooklyn and just moving into the new hood, maybe the Blue Vipers of Brooklyn playing some old timey music 10 feet away heightened the experience, or maybe it was that dollop of vanilla yogurt on top of the french toast (a combo i had never, somehow, though of)...but anywho, it was delish.\n\nThe dinner.  Halloween night.  they had a different, \"special\" menu that night.  it was gross.  everything we ordered was gross.  all i recall is a disgusting \"frozen elios\" like pizza and rubbery calamari for the gf.", "author": "Jared P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-16", "description": "I've been going to Superfine since before they moved. They are an institution in DUMBO.", "author": "Bubbles McTroubles S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}