{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-12", "description": "Great cocktail menu. Usually drop in for a red hound. Today was my first time having lunch. Great ambience. Got their grouper tacos which I was not a fan of. Staff was very pleasant. Tried their chicken sandwich - delicious. Definitely recommend. Great for groups also. My firm stops in for happy hour and takes full advantage of their pool table.", "author": "Natasha E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "Found this searching for a brunch spot with live music in the Dumbo area and immediately felt good about it (all of the photos and reasonable menu prices were a quick sell!!!) Got to sit near the band and enjoy our wonderful brunch. The food was really good. Happened to be there on a personally tough day, ended up crying as I was talking about things with my friends. Our waiter after an already incredible service (!!) brought me another mimosa after seeing the state I was in. So thank you for a great time Superfine and especially our waiter whose name I did not catch but had gorgeous pink hair and the most fun earrings! You made our day really special.", "author": "Zeynep A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Very nice.... love the live music and pool table!  Employees were very kind and the place was clean.  They don't serve food until after 5 so don't go too early", "author": "Kelly T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Superfiiiiiiiine, I love you so. So many years of celebratory dinners, gathering with friends, and last minute drop ins. The food is still beautiful on every level, the vibe, the service, the art, all love on a plate.", "author": "Shira K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Wow. Came in with my group of friends and luxuriated for hours over incredible food, good drinks and super professional service. I love when a simple salad is one of the best items on the menu. Such a cool vibe in a cool neighborhood.", "author": "Liz A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "Cool bar/restaurant located in Dumbo. In case you can't find it, look for a small sign on the brick wall.\n\nWe only had drinks at the bar, check out Happy Hour prices, very good prices for location.\n\nBartender was friendly", "author": "Eric P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Foods are always goods and people are very friendly.  Live music band is always a plus.", "author": "Linh N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "The atmosphere is amazing in here plus they have a pool table where I got to wip some butt !! Lol the prices are regular and it was pretty packed really early on a Friday", "author": "Ramon M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-31", "description": "I came here on a first date with a lovely woman. Yelp wrote that there would be live music and some wrote the food was decent but the bar better. So the service was sub standard. First, the server did not even come to our table for about 10 minutes. When she dud, she goofed up my date's meal and she had to wait, again, for the server to acknowledge us. This took another 5 minutes and that with me getting up to find someone to help us. We then had to wait another 10 minutes until the food arrived. Of course, i did not eat the soup in front of me do the soup got very cold. When the food finally arrived, it was also sub-standard. My soup was a ridiculously  plain broth with no flavor and few vegetables. Her sandwich was just okay, although she wouldn't admit that to me because she is a lady. The sign said that the live music would begin at 7. It never began. No announcement. No nothing. The night was a disaster. I was polite to the staff, said nothing but left a small tip much to my dismay. I enjoy tipping and thanking servers for their hard work. Alas, there was nothing for which to tip. I spent $40 for bad service, bad food, bad information and a bad time on a first date. I don't recommend you eat here, and please do yourself a favor and NEVER take a first date here.", "author": "Akiva P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "Had such a fabulous meal and time at Superfine. To the tune of live classical jazz, I devoured a heaping plate of their incredible shoestring fries (an absolute must-get), along with their deliciously fresh sea bass taco filled with avocado and cabbage, and their hot fudge sundae. The whole experience was such a great way to spend a Sunday evening.", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "If you find yourself in NYC, in and around Brooklyn - you'll be happy you chose this place. Recently went to NYC for AfroPunk with some friends and we stopped in for a bite to eat and the food was pretty good, although the menu isn't very extensive. We had the jerk chicken wings (not spicy, but cooked well) accompanied with the kale house salad that could use just a dash of salt to bring out the flavor profile and a friend ordered the scallops and thought they were cooked to perfection! The best part though was the amazing service we received...the owner greeted us at our table and was very welcoming and attentive, as was the staff. The ambience was EVERYTHING and they have live music that begins between 6pm-7pm. We didn't get to enjoy the live music but we'll be back!", "author": "D W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-09", "description": "Chill spot, we stopped in for a drink after Ignazio's pizza. We like the old timey bar and good music.", "author": "Jenna F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Great atmosphere and yummy food for a a good price. I love the live music on Sundays!", "author": "Stephanie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Just went out to dinner with some visiting friends here, on a very impromptu basis... I am SO GLAD that I've become familiar with this place!!", "author": "Philip F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "Let me tell you a story. I recently got back from Edinburgh, drank a ton of Scotch, and found one that I had never had in the States that was reasonably priced at Duty Free - Jura Superstition. I lugged the bottle through two countries, and then started my new job in DUMBO. My first week, we go to Superfine for happy hour, and they have a damn bottle of Jura on their bar.\n\nAnyway, Superfine is... don't say super fine, Kenny. Just don't f'n do it. Superfine is great. The layout is a bit weird. Bathrooms in the front. Sunken bar immediately inside, and then elevated areas for tables and whatnot. I suppose it's because the block is on an incline, but it's weird to watch the bartenders serve someone sitting 4 feet above them.\n\nThe place gets PACKED after work hours (especially Friday), so get there early, snag a table, and avoid being elbow-to-elbow with everybody else. The pool table doesn't help with the crowds either.\n\nThey have a pretty good bottled beer selection (including Hitachino!) as well as some decent drafts.\n\nPeople seem to really be into their pink lemonade. I had one, and let me tell you, that thing is dangerous. Doesn't taste like vodka at all.\n\nAnd of course, they have a fine whiskey selection. Good enough that I didn't have to bring a bottle back from the UK. Grumble, grumble.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-17", "description": "Their brunch was delicious, and the music was great, but the wait staff was slow, inattentive and unwelcoming.", "author": "Carol P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-02", "description": "Staff was rude and Unhelpful. We were people from out of town and exploring but the help made us feel very unwelcome. Looked like a trendy hip place to go drink, but I wouldn't want to spend my time there!", "author": "Clare B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "Came here on Halloween and was pleased to find friendly bartenders and a not-too-rowdy crowd. Vintage-y decor and good service.\n\nWe ordered standard well drinks and appetizers, and all were great. The apps are large enough to be a meal for one. Excited to come back to try the cocktails.", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "Me, my girlfriend and our friend wanted to eat in Dumbo a few days ago after work so we stopped here.\n\nIt seemed like a pretty trendy place with all the art on the walls and everything. \n\nI looked at the drink menu which had a lot of beer that I never heard of. I was disappointed that a Brooklyn bar didn't have Brooklyn lager. I was also disappointed that the Negra Modelo I ordered was out. So I ended up going with the Peak Organic Winter Lager which was not bad. \n\nThen I looked at the menu. Being that I'm not the most adventurous eater, seeing such a small selection made me a bit nervous. I went with the pork chop, which seemed like it would be the most filling and the least scary. The price was a little off the charts though. \n\nThe pork chop was actually really good. And the English cheddar Mac and cheese that came with it was really good too. My girlfriend had some spaghetti dish which she said she enjoyed. The only downside to this experience was that I was not completely full after I finished my meal. I could have spent the same amount of money at a different restaurant and walked out stuffed.\n\nI would have went for dessert but no one else at my table wanted it, so I didn't want to be the token gluttonous person (even though I still had plenty of room left). \n\nAll in all, the food is pretty good, but don't go here when you're starving and/or far from payday.", "author": "Emily P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "I came here last month for a friendly gathering. My boyfriend and I were hoping there would be some vegan options available. The owner greeted and sat us. When we told her we were vegan, she proceeded to tell us EVERYTHING on the menu that was vegan or could be made vegan. She brought us the freshest salad I've had in a long time at a restaurant (I grow my own greens, so I'm picky!). She made sure the soup was made vegan and even brought us string fries that she proudly fries in a separate fryer from any meat. She recommended the hummus platter and it certainly did not disappoint. The owner spent so much time with us even though the restaurant was slammed (it was a Friday night after all) that we felt right at home rather than being \"those annoying vegans.\" She even invited us to their Sunday brunch (she is very proud of her vegan scramble, which may not be advertised yet) the following week as they were going to be participating in a local Bluesgrass festival. We are very appreciative of the attention to detail here for anyone with food specifications and looking forward to returning for brunch!", "author": "Jen G."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}