{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-08", "description": "A local favorite, great drinks and lovely bartenders.\nTry the chili champagne long drink if the still have it.", "author": "Kajsa W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-19", "description": "As an afterwork drinks staple, I am a big fan of Superfine. Excellent drinks, great service and FREE pool. :) Also, I called one Saturday morning, asking them to see if they could locate some belongings I may have left behind. The manager was incredibly helpful, searched and returned my call -- I will always appreciate that!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "My fiance and I had a great meal here the other night. I had spaghetti with cauliflower, Parmesan, and breadcrumbs. He had a burger, which came with shoe string fries. (I ate half his fries, easily. They were delicious!) The food was fresh, the portions were good, and my cocktail was fantastic- I had the Pear Tree. It was just strong enough without being cloying. The music they were playing was fun and at just the right level, and there is some fun, funky artwork. We had such a good time watching the sun set through the window and people watching. Was it full of trendy hipster Brooklyn-ites? Well, yeah. But everyone was laughing and having fun. There was a girl in a leopard print coat reading a book at the bar. People playing pool. Good times. Also, they're big on sustainability without being pretentious about it, which I think is really admirable. \n\nThe only thing was- it was loud. I don't know if it is the acoustics in the room or what, but the volume of the conversations felt like a dull roar. We settled into it, but it's a little much right through the door. Also, the hostess stand isn't right by the door, which is a little confusing. We definitely had a few moments of: do we seat ourselves? Will someone come? etc... I mean, it sorted itself out. But a sign with a fun little arrow would made us feel less silly than asking someone nearby. \n\nAll in all, we really enjoyed our meal here and will return for sure :-)", "author": "Jeri L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-19", "description": "Came here for lunch today, and I wish i could review the food, but that would involve our food actually showing up. After waiting more than an hour for a grilled cheese sandwhich and a grilled\nChicken sandwhich, my wife and I decided to leave. Not once did the waiter check on us, or give us an update on the food. Then once we were leaving, another member of the staff stopped us outside, and rudely stated \"well, your food is ready, do you just want it to go!?!\" No apology or attempt tp make nice.  Needless to say, we will not be coming back to try the food.", "author": "Kurt M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-30", "description": "Fish cooked and presented without love which set me back $20 pre-tax. Felt somewhat greasy in the mouth.\nPerfunctory/distracted service.\nLIked that they provided a full bottle of water. But won't go back.", "author": "Marie D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-21", "description": "I wouldn't send my worse enemy's mother to this juke joint. Ordered a Cosmo that came in a tiny, martini glass fit for a baby. After three sips and $12 later, I went to order food and asked the waitress for additional options and she said there are none, what you see is what you get. Yet there were fries sitting at the station and no where on the menu so when I asked I was told well we have things that come with things. Horrible service. If you don't care about treating your customers well then continue to fuel menus that make sense.", "author": "Tierra M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-21", "description": "The food was below average and over priced. The menu was not what is presented on the website. We had the fish at $30 a plate. The fish tasted frozen, the seasoning was bland, the the small portion of fish with three potatoes looked lost on the giant plate.  We had the apple crumble for desert with cinnamon ice cream. The apples were not cooked, no sauce, and that was definitely not cinanimon ice cream.", "author": "Nancy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "First this is not Mediterranean cuisine, but American. Music is a bit loud. Pool table upfront and bar. Seating in back. We had a superfine waiter to go with our superfine food. Menu short and changes daily. I had pea soup to start that really tasted like fresh peas. And scallops perfectly prepared in top of a avocado lime purée. Delicious!  All in all a fun and satisfying experience. Highly recommended by me.", "author": "Monika F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-08", "description": "So I am the one person who has been (un)lucky enough to have had bad service, bad food, bad karma, bad everything today at this restaurant which everyone seems to really like and where I have been before, without such drama.  Soupy dish of Huevos Ranchero served cold, swimming in beans, topped with flacid tomatoes.  Clueless service (sure, blame the kitchen for what was CLEARLY your f-up), stale bread, and a furrowed brow when we pointed out her mistake.  Music was fine, but being hassled to put money into the tip \"bucket\" by the aggressive woman was a big turnoff.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "The grilled squid from their appetizer menu was excellent, but the service was poor.  We also had Groupon vouchers for their drinks, which we were told were not accepted anymore.  Later the waiter said they would honor it, then the bill came with the full price.  We left frusterated.", "author": "May T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-06", "description": "Excellent food. I had the jumbo sea bass. \"Jumbo\" should not describe 8oz. I'm pretty sure I could have had the whole plate with about 3 bites. It was delicious though. Don't come here if you're starving", "author": "John S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-17", "description": "superfine more like super inadequate. Really unimpressed with this place. layout is odd, hostess not helpful, food not even warm. superfine?", "author": "ryan m."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-16", "description": "I made a reservation at this establishment. Arrived on time. Was rudely \"greeted\" by the hostess and was told that the reservation just came in even though I had made it over 2 hours ago. Waited at the bar for over a half hour and watched multiple groups being seated. Spoke to the hostess and she insisted that our table would be ready soon even though we were looking at an empty 4 top right in front of us. The food was great but will not be returning. Too many lovely restaurants in this area with much friendlier staff.", "author": "anne marie b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-01", "description": "Every time I go to NYC I make it a point to stop in Dumbo. Throughout the years I've seen this place blossom from warehouses into upscale lofts and student fashion mecca. \n\nOne of my favorite places is Superfine. The first time I went there, over 5 years ago, Keith was a bartender at the time and he used to make his own sweet and sour mix every morning using Lemons and Lime. \n\nA couple of years later and no one has carried on the tradition, but the service and drinks creation is still alive. \n\nThe decor is very rustic and they do have a FREE POOL TABLE!!!\n\nThe ambiance and service are quite good. \n\nThe bartender was nice and talkative when spoken to. Some bartenders give you one word responses and go to the next customer. We talked drinks and liquor and it was quite nice to talk \"shop\" if you will. \n\nI had the burger with Gorgonzola cheese and bacon (or whatever they call it) and it was quite good. I wish the red onions would have been switched with sauteed onions as it wouldn't have taken away from the sharpness of the Gorgonzola cheese. I was given an abundance of fries, which is good. One can never have too many fries while enjoying a good burger. \nSadly, they do not carry any BBQ sauce. I enjoy my burger and fries with BBQ sauce.\nEasy BBQ sauce recipe:\n1/3 bottle ketchup\n2 tbsp. Worcestershire sauce\n1 tbsp. brown sugar\n1 tbsp. spicy brown mustard\n1 tbsp. minced onion or garlic\n1 tsp. garlic powder\n1 tsp. pepper\n\nThe Good:\nService is good and the workers are polite.\nThe atmosphere and decor is chill and comfortable\nHappy hour prices ($3.50 Beers) \nFREE POOL TABLE!\n\nThe bad:\nNo BBQ Sauce\nThe pistachio martini tastes like frangelico", "author": "Rob F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Awesome service,  I have to thank the staff and managers of Superfine for allowing a special day to happen at this restaurant. Superfine accommodated a group of 40 ppl for a post proposal gathering. Drinks were easy to drink and delicious.  Food was good for the most part, but a few dishes had to be returned to be remade or re-cooked.", "author": "James L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "I cannot begin to tell you how wonderful everything was at our daughter's wedding at Superfine this November.  From the greeter at the door, to the wait staff, to the servers, to the bar tenders, to the kitchen staff, everyone was friendly, efficient and helpful.  The house DJ  kept the music pumping all evening.  \n\nThis is a result of Tanya's leadership.  Many of our guests are either deaf or hard of hearing.  Tanya made it possible for us to conduct a mini class with her staff to make them familiar with simple ASL (American Sign Language).  She also made up special menues at the bar.  Her floral arrangements were gorgeous.  I cannot say enough.  \n\nSummer kept the bridal party together by helping us with snacks and helping us get ourselves in an orderly fashion into Superfine.  \n\nI wish I could remember the names of all the staff so I could thank them individually.  Be sure that if you decide to have an event at Superfine you will have a great experience.  Just go in for a drink or a meal and see what I mean.", "author": "Shelley G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "Superfine has a very fun and energetic vibe. They had a live jazz band that actually walked around the restaurant. Fun place for brunch. \n\nFood wise, cheap and good but not memorable. Bloodys are on the spicy side so be pre-warned if you order them.", "author": "Kristin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-16", "description": "I like that their menu changes daily depending on what's locally and organically available - that's great, but while the food is good, it's nothing to write home about.  Or maybe it just gets overshadowed by the bustling bar, live bands and free bright orange pool table?  It is definitely a cool place that makes a mean Dark \u0026 Stormy.  I think the best time to go is for brunch where they have live blue grass.  Solid place to just hang out over a few drinks though - I've eaten there a handful of times, but have actually wandered over for a drink or four dozens of times.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-13", "description": "This place deserves major props for putting up with our wedding after party. After a dozen or so of my friends and family spilled across the street from our reBar wedding,  the staff was very polite in dealing with us. (If it were me working there, I probably would have been staring daggers as my friends took over some of the tables near the pool table).\n\nDrinks and food magically appeared before my new husband and me thanks to my courteous family, so I have no idea how expensive things are, but I will say their pizza is freaking delicious and well worth whatever the cost is. After a Grimaldi's pizza the following day, I came to the conclusion that Grimaldi's is shit and Superfine is way better.\n\nExtra points go to the host/servers for comping my friends when they eventually had to ask us to move to the bar to clear way for reservations. My apologies for the drunken inconvenience to you, but thanks for putting up with us and being nice about it.", "author": "Tanya T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-24", "description": "I don't care about the food, I only care about one thing. The bathroom. Superfine has what I like to call a functional bathroom. No frills, nothing fancy, but it gets the job done. With this being said there is much room for improvement. There is a strong musky scent which can be done away with. No real creative approach with decor and the door lock was missing it's knob so it was hard to lock. The hand soap was your average industrial, paper hand towels were well stocked and a no lid garbage can which I like, no fussing with kick peddles. Adequate lighting and decent sink fixtures.  All In all a solid 3 stars from the BR rater.", "author": "Restroom Review R."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}