{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-20", "description": "Disappointing! Steak was overcooked, fries soggy, tiny portions, food took forever to come.  The waiter was nice and helpful, but not planning to return to Superfine anytime soon.", "author": "Anne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-01", "description": "When you're unemployed, or unemployable, yet are still hip enough to drink a coney island lager and play some pool on a smooth forgiving table, c'mon by SuperFine!\n\nBeen coming here for years, and while I don't love everything about it, it's standard for Dumbo's nightlife and what the neighborhood has been for several years now.\n\nThe positives, HAPPY HOUR, $3.50 a beer, yum. POOL TABLE, free!! SERVICE, nice and clean, like mature adult hipsters. LIVE MUSIC, only ever seen my sister play here, so that's a good thing!! Actually not true, saw Mike West a few years ago, who was great and the crowd was good for folk/acoustic music.\n\nThe negative (but not like a herpes dealbreaker), FOOD, sometimes expensive for what it is, and not as good as it used to be. Every now and then they have something on the menu that is really great, but I'm not sold on their famous brunch, I don't think it's every blown my sawx off.\n\nSo yes, \"YAY! I'M A FAN\", and I usually make it a point to stop in here for one drink when I find myself in DUMBO.", "author": "Gabe W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-26", "description": "Speaking strictly of brunch, Superfine is extra fine. The space, tucked away in lovely, industrial DUMBO, is vast and homey at the same time. Both times we went with large parties (kids in tow) and the wait staff - minus the bartender, who tended more to the late morn adult drinkers - were extremely nice, patient and accommodating. While not so inventive on the vegetarian side, the grub is good, solid fare - delicious pancakes and a hefty breakfast burrito. To top it off, live bluegrass every Sunday! Stroll over the Front and Washington after wards to take in a classic view of the Manhattan Bridge.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-01", "description": "I only had one beer, a Duvel, which is magnificent in and of itself. \n\nBut I'd be writing this review with five glowing stars even without that frothy Belgian goodness, singing the praises of Miss Ann, the bartender.\n\nSee, I was in the neighborhood the other evening to catch a movie in the park. As goodies for my foodie friends I was meeting, my backpack included a 6 pack of my homemade beer. A lovely nut brown, and my first attempt at this art, but I was pleased with the result. Anyway, back to the story.\n\nCome to find out, the rent-a-cops were in a particularly invasive mode that evening, which may be the norm, to protect upstanding moviegoers from evil liquor smugglers such as myself. Had I attempted to bring my wares through the gate, they would have been confiscated or (worse), poured out on the ground.\n\nI slipped into Superfine and quickly explained my dilemma to Ann, who graciously agreed to not only watch my beer, but even put it in her little mini-fridge while I enjoyed the movie, so chilled goodness was available later for all.\n\nThank you ANN!", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "Spacious, relaxed, friendly.  Nothing super special about the food or the drinks, but I love a place where you can always get a seat, never feel rushed nor pressured to order more beer.   Just a nice, happy neighborhood place in an area generally lacking them.", "author": "Talia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-30", "description": "Food: oversalted and not delicious\nDrinks: watered down and oversized-personally, I would rather have a small, good drink.\n\nI have come here at both peak and off-peak times only to be routinely disappointed.", "author": "J M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-17", "description": "A friend brought us here for a quick bite after walking around DUMBO.  \n\nFree pool?!!!!!!!!!!!!!!!!!!!  That was the first thing I noticed as I stepped foot in this place, but our brief stay didn't really give much time for a game of pool!  \n\nThe burger was hard to botch up but I didn't find the antipasta plate too appealing to my visionary senses.  Service was questionable.  I actually had to get up and approach the waitress myself to ask for our check.  The check arrived 15 minutes later; waiting gave me enough time to finish my glass of Coney Island Lager.  The place didn't seem to busy for a Sunday night.\n\nTo be continued...", "author": "Aiko Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "My friends and I were in on a busy Saturday night for drinks at the bar. The tequila was priced a bit high, but we had a great experience. Very rarely do I go to a bar and love all of the staff -- everyone working behind the bar was fabulous. No egos, very accommodating and fun.", "author": "Allison D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-18", "description": "Never open, even during posted hours. Arbitrarily stops serving certain dishes at weird times. Complete waste of time. Glad Bubby's (and that's not saying much) is open now cause this place is a joke.", "author": "Jules D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-10", "description": "Since we live a block away from Superfine, we wanted this place to be great so we will have a place to have a good food in a walking distance. It's great that they get organic food from local farm, I wish they knew how to cook them. We ordered shrimp salad, pork chop, zitti and of course beer. I can say that the beer was the best part of our meal. Shrimp salad was good but there was only 3 shrimp in shrimp salad. Pork chop was very dry. The zitti was so not special. \n\nIt has a fun atomosphere. We may come back to drink but not to eat.", "author": "Meg F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "My husband had a pasta dish with homemade sausage and I had steak, and we were both happy with our meal selection!  The menu is limited, however...  Only 1 page including the appetizer and the main course.  The wait staff was very nice, too.  We'll return here for sure.  Oh, it could have been our drinks, but it was a bit pricey....", "author": "Su S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-19", "description": "When my friends used to live in the hood- I used to frequently visit superfine...Had friends...friends...work here..so drinks were always GOOD :)\nI have had dinner at superfine too, and it was decent. I somehow don't remember it though, I am positive it's because it was 3 martini's later.....but i'm sure it was good!\nCrowd is totally laid back, the decor is fab, open spacey...just really relaxing! I usually used to end up here for my last cocktail....so my apologies for the blurred review...but I always left happy :)", "author": "Maria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "The food is delicious and the ambiance is lovely. Grass fed beef, local produce. Hearty, delicious seasonal fare. I was there tonight and there was a live jazz band playing. This place is a hidden gem with some of the finest food in the city. I'll definitely be back.", "author": "Laura T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-27", "description": "The name says it all. I've been going here on and off over the years and it never disappoints. In a neighborhood like DUMBO where doggie spas and organic laundromats are popping up all over, its nice to know this place has stood the test of time and hopefully will be around for years to come.\n\nBest for brunch - live music, great cocktails and super staff [many of whom have been with the place since it opened and there's something to be said about a place with very little turnover....].", "author": "S B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-27", "description": "I LOVE this bar. Not only is it very reasonably priced (my gin \u0026 tonics were $5 each, and the bartender gave me the same price well after happy hour was over) and cool (brick, multi-level seating--you can actually sit above the bar and watch everyone--and really neat lighting), but it's fun--everyone's nice--and it's an easy walk from the F train. It's nice to take a cigarette break, look out at the old-fashioned cobblestone-esque streets, and gaze out over the river. \n\nThe bartenders are all very friendly and helpful. I didn't order food, but I saw some stews go by that looked really amazing. (Expensive, though--I think a pork stew, which was certainly not large enough to share, was around $15.)\n\nThey even have events--a ho-down, live music. Plus a pool table.\n\nA great place to spend a weekend night.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "Unexpected delight !!! My husband and I went to grab a bite to Superfine, not expecting anything special, and ended up having a great time! We are definitely coming back, grilled calamari with endive salad are to die for. Special thank you to our waiter Tim, for recommendations on Our drinks and great service.", "author": "Inessa U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-08", "description": "A great place to share some drinks with friends and talk. Classic DUMBO as it has tons of space and an air of artsy coolness. The drinks prices are about average, as long as you dont let your girlfriend order the COSTMOpolitain (a 16$ cosmo).\nIve tried it once for dinner and was satisfied but not extremely impressed, though the ingredients were very fresh, the fish I had was underseasoned.\nIm willing to give the food another shot, but I'll keep going back for the nice atmosphere.", "author": "Aaron Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-22", "description": "Superfine is...super fine.  It's tucked away in quiet Dumbo but is a hotbed of sophisticated energy, good food and warm ambiance.  The dark wood and great lighting inside make it a perfect spot on a cold New York night.  But most of all, it's a great place to really relax.  Only downside, it's loud.", "author": "Robert A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-31", "description": "Disappointing food. Banana bread was undercooked and over sweetened. Burrito was literally flavorless. Just gross. Don't eat here!", "author": "lysa p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-05", "description": "I love the not-coin-op orange pool table. I love the friendliness of the patrons. Occasionally, I love the live music. I love the wooden interior. I'm ok with the nice lesbian bartender who seems to be really friendly to my pretty friend I tend to come with, and how she complete forgets who I am without my pretty friend. And I really love the bench with the painted faces on it outside that I can sit on while my smoker friends do their thing.", "author": "Josh R."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}