{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-23", "description": "Had a nice outing with coworkers here the other evening. A bit of drama about seating us at a \"reserved\" table, which was funny b/c the party at ours showed up and then left, apparently, and a handful of reserved tables remained open around us most of the night (with the reserved signs still on them). Awesome drinks choices (no happy hour specials though) and nice range of food for different appetites; I had the light and refreshing bean hummus, feta, grilled artichoke, and minty Israeli couscous plate. The major drawback was that I could barely hear my friends over the a) general din --the place is huge, with no sound dampening effects -- and b) blasting music (which, for the record, was not very good music; I remember some 80s tunes; odd given the hipster clientele, like the dude in jeans w/a wallet chain sleeping on the couch... at 6.30pm--huh). Our lackadaisical waitress disappeared for most of our meal, otherwise I might be inclined toward an overly generous four stars because I want to be in love w/Superfine.", "author": "Krista B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-26", "description": "cool place to get a drink, big and airy with lots of seating. however brunch here was a little chaotic, live bluegrass music, our waitress forgot everything we ordered so we had to constantly remind her, and the food wasn't spectacular either.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-20", "description": "Huevos Rancheros eggs to order, hatch new mexican green chili, pinto beans, jack cheese, corn tortilla. $8.50  Pretty good, but the service was sort of.. dead.  Idk.  It's just breakfast anywayyyyy. :P", "author": "Thea T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-16", "description": "Working in dumbo has lead to a search for a non-cash only,  quick yet enjoyable and affordable sit down lunch.  Superfine was the perfect choice.  With its chill vibe, daily changing menu, decent drink choices and a pool table if you have extra time, it's good for any time of day.", "author": "Ilana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-08", "description": "Although I've adopted Amy Poehler's philosophy in Baby Mama that organic food is for rich people who hate themselves, the organic fare (which changes daily) served up at this quirky bar-slash-restaurant is superb. If you don't feel like having food, this is still a great place to drink-comfy couches, an orange-felt pool table and inviting bar stools will keep you there longer than you probably should be.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-20", "description": "First and foremost, the pool table is free!! Full sized orange felt and a couple of useable sticks. The bar is huge, it has two sides to it, the backside elevated over the front. What is totally awesome about the bar is the fact that they have Prosecco--I have yet to find any other bars that do, in Brooklyn or Manhattan. The happy hour after work is great. They also have changing artwork monthly(?). THey tout the food as being made from the freshest ingredients that they can get, thus the menu changes daily. Great pitch, but I find the food to be average. The bartenders are totally cool. I have spent many a happy hour here after work and have had a great time when I'm with people I know. However, when hanging by myself, I find that it is not the kind of bar crowd that you would expect. There is a hodpodge mix of locals new and old, day workers, families, drop in's, construction workers and artists. Kind of a hard crowd to get a handle on and spotty in terms of sitting next to someone and striking up a conversation. Certainly not a place to go and mingle on the weekend. I would recommend coming here with your own crew. It's worth it.", "author": "Lani P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-09", "description": "Service was fair to poor, food was poor to, well, my friend described her entree as \"the worst beef stew I've ever had.\" And for $21, at that. My entree wasn't the worst (a pasta dish w/sausage and vegetables), just poorly balanced and overcooked. Apps were OK. Our order was taken promptly and correctly, but entrees came before I was done with my app. The waiter just dropped my entree on the table and never came back to remove the large app plate from our small 2-top table - which I ultimately moved to a nearby empty table myself. After we finished, and declined a dessert menu, the waiter just disappeared. After 10-15 min I got the attention of the hostess, asked for our check, and a few minutes later our waiter reappeared -- and asked (again) if we wanted dessert. Sigh. This is NY people -- there's just no need to pay high prices for bad food and poor service. Maybe it would be an OK place to meet for a drink? But don't waste your time and money going for a meal.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-03", "description": "This place lives in infamy amongst my friends. We have renamed it Super Sucks. I have never waited so long for food. It got so bad that the people below us, who were there for a birthday dinner, started eating the cake they brought because they were so hungry and they sent a piece up to us, which we fought over like animals.... When we finally got our food and we asked what the problem was, the waitress (who was for some unexplained reason wearing a Fez) told us that there wasn't any problem. I mean seriously it was like 90 minutes. No apology, nothing. Its not like we ordered Peking Duck or some special souffle - it was pasta and burgers.", "author": "J B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-29", "description": "I love the salads, the fish, the pastas, the huevos rancheros,  the steak sandwich, my veggie friends are happy here, even my vegan friends.  I love the desserts, my favorite is the pave.   Pretty much whatever I order I dig.  They have a great antipasta plate too.", "author": "Dee C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-15", "description": "I went there on my birthday with a friend.  I never knew there was a time limit on reserved seating.  I had finished dining and was enjoying the live band when I was aked to leave because I had been there for three hours and my table was overbooked... That  never happened to me before.  I was going to leave before I was asked to go and yet my friend wanted to enjoy the band!!  Anyway, I did not want to play pool or drink at the bar that night.  I guess they wanted to make money.", "author": "Thyrza M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-24", "description": "I have been waiting a while for an opportunity to dine at Superfine. On arrival we had to wait since they weren't seating for dinner yet. The hostess said we can get a drink at the bar. One bartender seemed to be buddies with a couple down the bar and was pouring them drinks, then she paid attention to pieces of paper on the bar, then strolled up and down, basically IGNORING US. Finally, she comes over (mind you there's almost nobody at this bar), and mumbles something with a disdainful look on her face. Do they have iced tea? \"I don't know, it's the end of the summer, how much you want to bet there's no iced tea, etc etc etc\" Then stares at me with her stupid cowboy hat and that ugly mole on the tip of her nose and WALKS AWAY. HELLO I STILL WANTED SODA. AND WAS THAT A YES OR A NO TO THE ICED TEA?? Once seated we asked the lovely waitress if there was any iced tea, and she said Sure! WTF! I do have to say all the food at Superfine was delicious, and the waitstaff all very friendly and prompt. We had octopus to start and it was tender and tasty. I had pork chops which was also very good. The only food pitfall was the plum tart for dessert. Instead of a flaky pastry crust, it tasted like pizza dough. All in all, I would reccommend Superfine, but be wary of HORRID bar service -  left such a nasty impression on my mind I don't think I would personally go there again.", "author": "S C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}