{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "We got a bit hungry checking out an exhibit at powerHouse, and we wandered into Rebar. (You're saying to yourself, \"But this is a review of Superfine!\" Shut your mouth.)\n\nRebar was closed, for no apparent reason. So we walked across the street to Superfine. (See? You could've just had a bit of patience and saved us all a hassle.)\n\nThe first thing that caught my eye was the pool table, with two important characteristics: it is (1) free, and (2) separated from the rest of the place, which gives people adequate room to maneuver. (By \"maneuver,\" I mean they can lose to me without making excuses.) This automatically makes me happy. But between the strange, eclectic decor, the funky lights hanging over the bar, and the friendly service, I probably would've liked the place anyway. \n\nOur server brought over our own bottle of tap water (love that), and then the manager moved a sandwich board listing the lunch options alongside our table. So...are there no written menus? What do other people do as my indecisive ass deliberates? Do they hate me because I can't choose quickly between the chicken and steak sandwiches? I'm SORRY, the waitress said they were both good! Stop pressuring me! Get these voices of my head!\n\n::punching self in the head::\n\nI panicked and chose chicken. Although I could feel the angry glares, no one came over and spit in my face, so I assume I was sufficiently speedy. My companion wasn't hungry, but the waitress convinced her to get some asparagus soup.\n\nThe sandwich turned out to be delicious, juicy chicken slathered in aioli; but the shoestring fries that accompanied it were just OK, and her asparagus soup wasn't worth discussing.\n\nBut I can say with confidence that I'll be back to Superfine. To eat, and to play pool. And to drink, but that goes without saying.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-29", "description": "Ok.  Not bad for a DUMBO restaurant. On the pricey side of things.\nLoud restaurant. A lot of ppl here for happy hour after work. Huge space with a pool table. The food is decent, not too fancy not too great.  I would come here with large crowds. Not so much for romantic evenings tho.", "author": "Wilson L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Andy K 4/18/15\nWe definitely were wowed,  our waitress Jessie steered  us to pizza with fig- goat cheese caramelized onions very refreshing change  \u0026 the pork chop with smoked gouda mac \u0026 cheese  was excellent. dessert the chocolate whatever left the plate clean.  assume atmosphere  definitely conning back", "author": "Andy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Came here because my fav band from New Orleans was playing - will be coming back for the scenic walk from the subway and the spectacular grilled cheese.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-05", "description": "Ok Superfine, I gave you another shot, and you were yet again totally disappointing.  The service was terrible, the drinks were too sweet (even when requesting a non-sweet option), the food was overpriced, totally mediocre and uninspired (and such a limited menu...)   And $52 later I was still hungry.  Portions were not great.\n\nThe only thing that's good about this place is what it looks like on the inside.  It's cute.  But that's about it.\n\nWhy why why?", "author": "anni b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Several people recommended this place and I was very pleased with this choice for a Saturday night dinner. Funky decor, creative energy, friendly service, and delicious food (though I have to say menu is kind of limited). Will be back!", "author": "Ellen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "Large space, great energy and atmosphere. Staff was super accommodating and Sunny even welcomed us to the neighborhood with free drinks!  The beat salad and Camembert is delicious with a side of bread. Will definitely be back!", "author": "Karina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "Super fine is super awesome! Came here on Valentine's Day and they had a really adorable set up: all our servers wore red, there was live music up front, and the atmosphere was really trendy and relaxed. My date and I enjoyed some really awesome drinks here and I ordered a house salad-which was brought to me by a bubbly, smiling server. Bar is fully stocked and you have the option to eat right by the bar or sit at one of their tables in the dining area, which also features a pool table! So cool. Will be back!", "author": "Niomi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-09", "description": "Very good. Wines were good and pork chops were delicious. We were able to be seated before our entire party arrived which is very convenient in a city where schedules are fluid. The retro 60s kitchen tables and chairs were funky and functional. Overall a positive experience.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-09", "description": "If we were coming for drinks only, I may rate this place 4 stars. But we actually wanted good food as well as drinks. Disappointed. The good: The Macho Grande, a Margarita served in a pint glass did not disappoint. All the power you want in a Margarita without the taste of bottled sweet and sour. The bartender makes the lime mix fresh offering a flavorful double Margarita. The traditional Manhattan with Maker's Mark was done right as well. The not so good: We were starving and excited to start with an appetizer, 2 entrees and maybe dessert. The menu however, was rather boring. A struggle to find mouthwatering descriptions. A number of meatless options if that's what your looking for. We managed to find 1 entree that we settled for. Penne with homemade sausage. The homemade factor didn't prove to shine. If nothing else, a basic burger would have been a good fall back option for this bar, but no such option.", "author": "Asonya R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-25", "description": "I still can't get over the fact that we paid $11 dollars for three rubbery sea scallops covered in a sauce that I'm pretty sure was Tostitos salsa. And they were cold; I'm assuming that they were just sitting around somewhere before they got to our table, because we waited almost an hour for them. That's your special? Really, Superfine?", "author": "Acacia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Great food, atmosphere, and service. A bit pricey but totally worth it considering the amount o fresh food you get and the neighborhood.", "author": "Tory C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-14", "description": "Bathroom review:\n\nPretty good. Oldish feel but with new mirror and paper towel holder. Cool tile floor. Toilet and urinal close together - but there's a privacy lock so it's single use for all intents and purposes. Urinal has a strong V-style to the bottom part (looking down). \n\nPush door with deadbolt. Can use the paper towel to open lock - and throw it into the nearby open-topped garbage - then push door open without touching any handles. Bottom-plunger liquid soap dispenser. Clean but old. \n\n(Women's room: has a beaded curtain that is difficult to get through. There's a pink stall and a green stall. The pink one is a little cold. Flowers.)\n\n3/5", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-22", "description": "Went there with my best friend and it was the perfect place to catch up. The menu changes daily according to what is in season, it isn't cheap, but it is Dumbo. Portions were so so, but the food was very tasty, and that is matters to me more. I'd go again.\n\nPS: At the end of the night, they had some dj spinning 60s tunes (lotsof motown) and I wasn't too sure, but was lots of chicks who looked like dudes by the bar.", "author": "Jasi R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-13", "description": "I really don't understand the layout in here. It is not conducive to eating, drinking, nor live music listening, so what is the point? Why the sunken bar right in the middle of the restaurant? It doesn't save them any space, and it pushes all of the tables off onto the sides, where your view of the (minuscule) stage is blocked off by pillars. Either some interior designer really effed this one up, or this place was never really meant to have a restaurant nor a stage.\n\nThe acoustics are also just awful. Metal floors, open ceilings, and no rugs = a mess of sound bouncing all over the place. You could be 3 feet from the stage and not be able to make out the singer's voice.\n\nFood seemed alright, but I only had one plate of pasta and some beers. Nothing to write home about.", "author": "C.J. T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "Very cool atmosphere. Friendly and helpful service, also very attentive to children. Food was excellent, the fish was perfectly cooked and seasoned, the pasta beautifully al dente. Excellent selection of local craft beers and wonderful cocktails. The desserts were great as well, but a bit more variety wouldn't hurt (most were choklate based). All in all, a great Dumbo experience!", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "My brunch date and I love love loved it here! Hoping to grab a bite before the Essence Style Block Party, we picked Superfine on a whim for Sunday brunch. It was wonderful; great food, strong drinks, live music (briefly) and attentive service. I had the omelette of the day and my friend had the chicken enchilada. My omelette was great and came with yummy home fries (I wish there was a little bit more on my plate, but they were quite tasty). The house made sausage was also very, very good. While I enjoyed my food, I had a bite (or a few) of my friend's enchilada and I so wish I had gotten that instead. It was perfectly seasoned and absolutely delish! I ordered a drink that I didn't like and our server brought it back and made a suggestion (spiked pink lemonade) which I loved. It was very strong and two gave me a nice buzz. Our waiter Ryan was amazing! He was attentive, knowledgeable about the menu and accommodating. They also had a live band and singer for a few minutes while we were there, they only performed one song but I enjoyed it. Looking forward to coming back!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "This is my favorite restaurant in the neighborhood. It can be hard to get in here without a reservation on the weekends, but it is soooo worth it.\n\nI order the superfine steak every time I go. Not only is the steak itself awesome, but the salad that comes with it is the freshest, crispiest salad I've had since moving to NYC. I'm from California, so I can be a bit of a produce snob.\n\nI have had great luck with service here, as well. The staff are very attentive, and bring things to you pretty quickly. I had my birthday dinner here, and the waiter noticed we were celebrating something by all the photos being taken. He brought over a complimentary drink for me, and put a candle in a slice of their [amazing] ginger spice cake. We never asked for any special treatment - never even told him we were celebrating until he asked. I thought that was pretty cool.\n\nThese guys will have me as a regular as long as I live in the hood!", "author": "Heather S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-21", "description": "I work in DUMBO and I have been here only a couple times.  I heard so many great t things about it, but I have not experienced the same attraction for this restaurants that my co-workers have developed.\n\nThe first time, I only had a drink and played pool with a co-worker and a few of her friends. That was pretty fun and I enjoyed the trendiness of the spot.\n\nThe second I went I had their burger. It was okay, I've had better. It also took them a while to serve our food (I'm pretty impatient - but I appreciate food cooked to order). They are also a bit pricey, at least in my opinion. I have had amazing meals for much cheaper than Superfine.\n\nLong story short, Superfine is just that, fine. Not spectacular.", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-03", "description": "Terrible service.\n\nThe bartenders completely ignored the side of the bar we were sitting at. We practically had to send smoke signals just to pay our tab. Once we were seated at a table, again we constantly had to get our waiter's attention. At one point, one of the people in my party had to get up and physically tap the waiter on the shoulder.\nWhen we ordered, we told the waiter we needed to leave by a certain time to get to a concert. The food took forever. When we asked, a manager explained that the food takes a long time to cook. Fine-just tell us that when we told you we had a time constraint. Im not sure what could have taken so long-the soup was obviously microwaved because it was hot in the middle and cold around the edges and my fish was raw in the middle.", "author": "Darcie P."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}