{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-20", "description": "Poor very, very, very poor service! Unbelievable, they forgot to order my food, hostess so rude, server didn't pay attention to our table at all!", "author": "Lusya L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-11", "description": "There was a bug on my burger when I got it! The burger bun was dry and stale. The burger patty itself was burnt at the ends and towards the center. The only good thing was the fries, I really enjoyed the fries. After seeing that bug on my bun I was completely disgusted.", "author": "Nashaad A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "Average drinks. Average atmosphere. And the lady that works the restaurant floor is super rude and ALWAYS has an attitude. Like I've never seen her not be rude.", "author": "Allan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "The food here is amazing. Been here a couple of times and have had a few different items on the menu. They staff are friendly and courteous. The style of the restaurant is cool and the brunch menu on Sunday was awesome!!! Would recommend this place to anyone.", "author": "Diamond S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-14", "description": "Superfine is alright. It is one of the only bars in the neighborhood that is open until closing time like, every night (except Mondays). It has a unique layout, as the bar is sunken and there are seats above it as well as straight in front of it (look at pictures, I can't describe well). The beer selection is ok and they have a pool table with plenty of tables around it. \n\nOne thing that does make it great is there are frequently wedding goers that come here to after party (there are several wedding venues/spots in the immediate vicinity) so its an interesting crowd.", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "Exceptional LOVABLE Superfine.  Their take on comfort food (and cocktails) is fresh and distinctive.  Popping Saturday night ambiance - great live music too.  We'll all be back at Superfine soon!", "author": "Max W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-28", "description": "The breakfast burrito was bland and the chicken was dry. I ordered tea and it never arrived. And, we were asked to leave our table and sit on a bench before the last person had finished her meal (we didn't) as they had another reservation coming in for our table. Plus, the music is so loud it is hard to carry on a conversation.", "author": "Amy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-07", "description": "Alright things have changed...\n\n1. No more changing menu depending on the fresh ingredients of the day. \n2. Live music has been replaced with a DJ. \n3. The food is mediocre. \n\nSeriously, the grilled pizza used to be so good with a nice chewy crust but this time the crust kind of crumbled apart, like they didn't knead the dough, or more likely just got it from the supermarket. It looked like raw flour. The scallops were noticeably smaller and definitely not fresh. \n\nAnd the service was bad. The waiter decided to channel his inner Einstein and memorize our order instead of getting a pencil and paper and writing it down. Of course we got the wrong things... \n\nIf things stay the way it is now I can't see how this place will stay in business. It's sad to see the culture of this area slowly withering away.", "author": "Bobby C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "They should call this place Superfab!  Cheers to the chef extraordinaire, the creative mind behind lots of new adds to this fun menu!!!", "author": "M. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Here is the only thing you need to know: the  daytime bartender has a laser precision talent for time. Which is everything. Go there. Saddle up the bar and know everything will be just fine.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-15", "description": "The female manager is an unprofessional B****. I recognize this is very harsh but I could use a lot stronger words but I won't so people will actually read this. \n\nFirst, this is the only review I have felt inclined to write on yelp because of my horrible experience.\n\nMy family, friends, and I grabbed a late night dinner and drinks after I performed in BK Bridge Park. There were 10 of us and they sat us quickly.\n\nMy dad told the waiter he would be paying for six guests (his family and significant others) and asked for two separate checks. In which the waiter said not a problem.\n\nNOTE our waiter was superb. He was handsome, nice, and attentive.\n\nWe all enjoyed our drinks and meals. \n\nWhen we received the two checks it was done incorrectly. My brother sorted out who had what and went up to our waiter and asked to rewrite the checks in the original way we requested. The waiter did not have a problem with the request. Until...\n\nDUN DUN DUN a skinny brunette manager interrupted their conversation and said, \"Absolutely not. You need to figure it out for yourself.\" And proceeded to bicker with my brother. After their dispute away from our table. She came over and yelled condescendingly, \"We are all adults here. Figure it out. If you had the steak, pay for the steak.\" This was especially jarring and rude since most people at my table were not involved with the conflict and this was their first interaction with this classless woman.\n\nThe waiter came over and apologized. My father said he would talk to her. He asked what the issue was. She told him we should have been appreciative that the restaurant accommodated such a big party. Sooooo since you did not refuse to serve us, we should be appreciative of your rude behavior. Like sorry there were ten of us and we spent a lot of money at your establishment.\n\nShe ended up refusing to change the check and we spent 15 minutes figuring it out. The waiter brought my dad a free beer and apologized profusely for the intensely nauseating situation.\n\nAs we were leaving, the manager was sitting outside complaining and smoking a cigarette like a petulant 17 year old girl. \n\n\nIf she was not part of our evening, I would give this restaurant 4 stars. \n\nNOTE TO OWNER: Fire your female brunette manager that worked Saturday June 8th. Or send her to some communication classes.", "author": "Kristin K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-10", "description": "I feel like the food and everything here very much mirrors the name of the establishment. We had the pizza, the chicken wings and the truffle, oyster pasta. All of the food was good, but it all also tasted and looked like a hastily prepared family meal. The drinks and everything also seemed fine. It's definitely a bar that I would come to and chill with decent food and an open ambiance.", "author": "Ian C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-06", "description": "Food wasnt as great as expected. Missing alot of items that used to be on menu", "author": "Danie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-06", "description": "Menu was wrong. We ordered and where told ten minutes later the soup was not what we had ordered for the night. I changed my order to pork chops with asparagus and mashed potatoes. With a handful of tables it took them a long time to get the food out and gave me undercooked broccoli rabe instead, thought I wouldn't notice. Disappointed to say the least. Not worth it.", "author": "Lahna H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "I won't be able to eat calamari anywhere else. Who knew calamari could be so good when it's not deep fried in batter. Burgers were amazing. Live music on a Sunday night. laid back yet helpful servers. Love that you can see the full kitchen. \nDelicious. Going back!", "author": "Lindy E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-19", "description": "I wanted to walk on Brooklyn Bridge today.  Before we started, we wanted to have lunch.  We walked around the area a bit and decided to go to this place.\n\nPeople were very friendly.  I think probably the thing is they have too few people working for the size of their venue and thus when they get busy during brunch hour, service slows down.  Since this is my first time (and probably only the time unless I will be convinced otherwise in the future) trying this restaurant and I have no comparison point.  We were seated immediately which was great.  Live band was playing which was fun though a bit loud.  So that probably is a wash there.  Ordered coffee and 2 dishes (fish tacos and huevos rancheros.  They were out of fish and substituted it with shrimp) from their brunch menu.  It took full 15 minutes before coffee arrived and at least another 20min from there before food arrived.  I thought that the tacos shell (soft tacos shell) was a bit too dry and coarse but that's probably up to everyone's taste - I just happen to like my soft shell very soft and thin.  I thought their take of huevos rancheros was very interesting (a plate was flooded with beans) but then again, cooking is like art and it depends on chefs to interpret what makes a good dish.  Only if the dishes were warmer, they would have been a lot better.  Both dishes unfortunately got served lukewarm.\n\nI understand that this spot is very popular, so I may be minority and maybe I happen to hit them on a bad day and/or at bad time.", "author": "Harumi U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "I've been a regular at Superfine for a long time and have come to rely upon them for a great meal.  I am thrilled to report that Laura- Chef extraordinaire and part owner is back!  The other night I order a few appetizers.  The first was Black Sea Bass ceviche with capers, preserved meyer lemon, jalapeno, mint and shallots.  I love ceviche when it's fresh and prepared well and this dish did not disappoint.  I'm a sucker for meyer lemon and  it worked well here.  The next appetizer was roasted sweet dumpling squash with red quinoa tabouli, shaved brussel sprouts and shitake mushrooms.  It was quite a hearty dish for an appetizer.  I'd highly recommend it for a vegetarian as it felt substantial- I ate the skin of the squash as well.  I'm not vegetarian but appreciated the flavors and substance.  I'd also highly recommend Superfine for a delicious, reliable lunch- best fries around and the best heuvos rancheros for Sunday brunch.  Thank you Laura for returning to Brooklyn and to all of us regulars who missed the hell out of your dishes!", "author": "Kate B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-07", "description": "Good LORD, was this place a disappointment.\n\nThey get a star for ambience. It's spacious, relaxed, airy, and has your standard hip-restaurant decor.\n\nBut man, the food. For $14 I expected something more than a flavorless gray hamburger patty on a dry bun with a handful of middling thin-cut fries. It tasted exactly like what you'd get at a suburban Appledenny's Steakhouse, except they'd give you cheese and condiments, and it'd cost $5 less.\n\nThat was my date's dinner. I got the \"flatbread pizza\" which again cost $14 (yeah yeah, we ordered the cheapest items on the menu, so sue us). It consisted of a chewy, doughy crust topped with a thin layer of tomato sauce, some bland mozzarella and tomato slices, and \"basil chiffonade\" which apparently means wilted, hand-torn basil leaves. It's hard to mess up caprese, but the weird crust ruined it.\n\nThe waitstaff were distant and unfriendly. Our waitress seemed to spend most of her time milling around the soundboard next to the hostess' table. We got no \"how are you enjoying your food?\" check-in, and we had to flag a random waiter down in order to get a refill on my date's Coke, after waiting about 10 minutes with his empty glass at the edge of the table.\n\nOh, and the cocktails. Very expensive, very sweet, not very strong. Not much more to say there.\n\nI guess the live music is a selling point. We were there early on a Sunday evening, so we probably weren't getting their A-Team, but the trio of white twenty-something art students on the stage did a decent approximation of freeform jazz. Maybe this is standard for the area, but even so I wasn't particularly impressed with the management's practice of going table-to-table with a bucket to solicit money for the band. Either pay your talent or don't, but leave me in peace to eat your underwhelming food.\n\nIn conclusion: Skip it. I'm not familiar with this neighborhood, but for the price you're paying you should be getting much better food and service than they're offering.", "author": "Melle E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "This place is pretty cool. And by pretty cool I mean, everyone turns to look at the door when you walk in to see if you're anyone interesting (Me: \"Geesh, maybe I should have done something more exotic to my hair\"). Alas, I am not particularly interesting, but the crowd and the menu here are pretty cool.\n\nWe got here around 8 PM on a Friday where we were amazingly able to grab a table right away. I think it was the bartender (?) who delivered our drinks, she was really attentive and on top of things. Our server was ok, she tended to disappear when we needed her but was accomodating otherwise. My friend asked for the fries on the side with aioli which wasn't on the menu and she was happy to bring him some, which was great because they were really great. I don't know why more restaurants don't serve matchstick fries, they're so good. \n\nI got the ricotta dumplings which were solid, not amazing, but not bad either. I loved the decorations and the ambience here. I didn't notice until I went to the bathroom, but the music was provided by a DJ which makes this place officially too hip for me, but maybe next time I'll go I'll dress up a little more and feel like I'm part of the in crowd.", "author": "Emily V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "DELICIOUS BURGER AND FRIES - healthy meat - no antibiotics or hormones.  The prices are excellent, the ambiance is warm and friendly.  It's a beautiful place to sit and have a satisfying meal.  Great neighborhood to walk around and enjoy yourself. It will instantly become your favorite restaurant.", "author": "Natasha S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}