{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-15", "description": "This restaurant has been on my radar for quite some time and I'm glad I finally got it out of my system.\nFood was good.  Portion size of the dish I ordered was definitely not up to par with what I paid for it.  Flavors were great, but I needed more.  Dessert was good also, but I probably could've skipped that too. \nService was freaking HORRIBLE.  Every member of the wait staff had that hipster vibe, and it definitely showed.  Slow motion to take orders, bring food, bring check, and basically ask for anything for the table.  Midway through, I wanted the busboy to be my waiter.  The best part (and I don't mean this in a good way) was when another waitress (not my waitress, might I add) asked, \"Was everything okay with the service because you didn't leave a good tip\".  Totally blown away by what was said, she immediately returns and says, \"I'm so sorry, I was looking at someone else's bill\".  First of all, you weren't even my waitress and second of all, who asked you??  \nI was hoping this was all a dream....but when I pinched myself, it wasn't.", "author": "Ava H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-27", "description": "I am by no means someone who is in expert in what BK has to offer. However, my good friend took me and about 7 other folks to Superfine last night. \n\n1) I was impressed with the space. High ceilings nice decor and alot of room between tables. I also felt like I was in the suburbs. Also the fact that they were able to seat 8 people immediately at 8pm on a Saturday in NYC was impressive.\n\n2) I am cynical and thought that being able to seat 8 people in such a large space would carry a price. Price being good food or lack thereof. However, I really liked my dishes. I got the Zuchini Soup to start and the Spaghettini. The soup was great: light and a great dish to start with. The spaghettini was cooked perfectly al dente and had some taste chunks of spicy italian sausage.\n\nI had no complaints and would defintiely come back again.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "Ahhh Superfine, you are probably my favorite spot in DUMBO. Was meeting up with my friend who I hadn't seen in nearly a year. We wanted to go somewhere nearby and we stumbled upon Superfine.\n\nFirst off, if you weren't paying attention you would walk right passed it. Its in an old warehouse in DUMBO, but the interior is awesome. Cool vibe, moody lighting, Free pool table and the display art from local artists.\n\nStarted with drinks, the Dirty Hoe (Guinness \u0026 Hoegardden) was our drink of choice which was actually really good. Who would have thought Guinness \u0026 Hoegardden mix would taste so good lol.\n\nOn to the food, went with the NY strip with seasoned fries while my friend went for the flounder. Everything was perfect, steak was perfectly cooked and the fries were crisp and tasty. The flounder was also cooked just right and was light and flaky.\n\nEnded up staying there for like 3hrs. Great food, great ambiance; you have to come here if you find yourself in the area!", "author": "Greg A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-12", "description": "The main issue here is the wait time.  The food is pretty good,  but be prepared to wait at least an hour for your food.  Its really unacceptable when you just need a burger on your lunch break,  it shouldn't take this long.  If you have all day,  this place is \"super fine\" otherwise try somewhere else.", "author": "John G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "I was a bit apprehensive after reading reviews that varied wildly here. But my friends and I had a fantastic brunch experience there from the interaction over the phone to reserve a table for 9 people to the very end. \n\nThe cocktail list is impressive. I had the apple brandy sidecar-- I'm a sucker for calvados-- and it was quite good. The bloody mary comes in a pint glass and my friends said that they packed a wallop both in terms of alcohol and horseradish. \n\nEveryone seemed to love their food. Many fans of the huevos rancheros as well as the steak and eggs. My pancakes were fluffy and the housemade sausage had nice flavor to it. The coffee was up to snuff too. \n\nThis is a good place for locavores and those who value organic ingredients and responsibly raised meat. \n\nThe bluegrass band was a total bonus-- perfect accompaniment for the meal.", "author": "Marisa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-21", "description": "Just wanted to note this place is not mediterranean. It's cool but just not Mediterranean.", "author": "Tastey T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "First time here for friend's birthday, Ordered the tilefish for $28. It was alright but the portion is too small. I left still hungry.\n\nNot worth the high price, I've ate at much better places.", "author": "V T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "GREAT bar, cozy and super fine indeed! Had a lovely sauvignon blanc for $6. $6! Crazy. My friends cocktails were all very tasty, though the list seems to err on the side of ultra girl-y sweetness and sugar, which was a bit of a surprise because the bar has sort of a masculine-whiskey sort of feel. \n\nSplit a pizza with marscarpone, ricotta and creminis which was very nicely prepared, flavorful and addictive!", "author": "Miranda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "Great DUMBO option for casual drinks, live music, or dinner with friends on a schoolnight; the place is sparse and has a pool table that only costs patience (the currency fluctuates from 20 to 50 minutes or more) \n\nTo be quite honest, the food is nothing spectacular, but the vibe is so festive that you will find it acceptable. This is preferably a place to come for drinks.\n\nLive music is very entertaining, and once upon a time that I came with Yelpers, there was a Buenavista Social Club-like  band playing some salsa, and a couple of old timers actually indulged in dancing amidst the tables. They were adorable.\n\nOutside there is some seating too, although the plastic table they have allocated ad hoc, is quite vexing for some reason I can't determine, that you may want to \"kick-it\". I think some Yelpers would agree to this fact.\n\nSo come for great times, conversation, and music; and enjoy this part under the wing of the Brooklyn Bridge, and if possible, dance.", "author": "Javier M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-24", "description": "i was only here for an hour tonight but what an impression this place made on me. First of all, the fact that its right underneath the Manhattan Bridge just blew my mind. Yeah, the rumbling noise from the cars overhead can be very distracting, even maddening at times. But that just adds to the charm of Superfine. \n\nWere there a bunch of yuppies here because its in DUMBO? Oh you betcha there were, but at least these were the cool kind of yuppies, who can talk about photography and roller derby in the same breath. The service was a bit slow, but then again we had a fairly large turnout so I kind of expected it. \n\noh, did i mention the pool table? our tables were right in the lounge area where there's a huge couch and a pool table, which is free! I love shooting pool, especially if its free. \n\nso yes, I have found our new \"verlaine\". (yes, that is an inside joke) just gotta find out about happy hour specials and whatnot.\n\nEDIT: oh well, Happy Hour is only from 4-7pm, which does none of us no good, boo!", "author": "roderick A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-06", "description": "My girl and I entered Superfine on Sunday at around 2pm for brunch. We walked up to the seating area and waited patiently. After motioning 5 of the staff who gave us blank looks we were finally seated by the bar overlooking the restaurant. We were told this was the best seat in the house. \n\nBeing brunch, i just wanted to take my time and relax for 5 minutes before ordering. 1 minute after receiving the menu my relaxing fantasy was short lived by the plump and rather rude bar girl who grunted \"you ready!!\".  \"No, i just sat down\" I exclaimed and continued reading the menu. After another minute the rhino came back and grunted at me again \"you ready now???\". \n\nThat was the last straw...I paid for my tea and told the other waiter we would not be eating here. The layout is great and i assume the food is probably decent but the service sucks and the bar chick....well dont sit by the bar if she is working there....Short black hair with streaks...\n\nSorry to whinge and be abusive but she really should not be working in hospitality.", "author": "Marc P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-26", "description": "I never show up at a restaurant without first checking if it will be possible for them to accommodate my vegan diet. The lady on the phone assured me of having vegan items on the menu. But when I showed up for brunch the same day, my waitress dismissively told me that my options were either huevos rancheros (minus the eggs and cheese), granola with yogurt (minus the yogurt), or the breakfast burrito (minus the eggs, cheese, and sausage). Then she made a snide comment about Superfine not being a vegan restaurant though they're \"working on it\". I ordered the egg-less and cheese-less huevos rancheros, mainly because where else are you gonna go for brunch when you're already in Dumbo?\n\nIt's fine if a restaurant doesn't want to deal with serving vegan fare, but it's pretty incedible for them to lie about it on the phone just to get customers in the door--a soggy tortilla topped with a smattering of beans and pico de gallo is neither a vegan version of huevos rancheros nor is it worth $6 (guess they felt bad about my pathetic excuse for a meal and knocked $2.50 off the regular price). And my boyfriend got milk that had turned, served with his coffee.\n\nTop it off with the waitresses' surly and unprovoked attitude--I wouldn't go back even just for drinks at the bar.", "author": "Julia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-07", "description": "It's a little known fact that the original name of this place was \"Fantabulious-supercalafragelous-tocatchpaladoches-superfine\" but due to a problem with the business cards, they just went with Superfine....\n\nGREAT place with all of the style and funk of BKYN.  A great bar feel coupled with GREAT food, sweet staff, a nice homey restaurant environment (we sat in the kids section and actually loved the madness of the disrobing-frolicking-gibbering little creatures) and they have a roving selection of fun art....\n\nI had the pork chop (so perfect it inspired my Jewish/Vegetarian GF to have a bite!!!) with the softest garlic mashed potatoes and perfectly cooked grilled asparagus.  The Olive oil and crusty-chewy bread where great and the Lentil soup was delicious with a earthy but not over-done flavor - great...\n\nlove it...", "author": "Furyk C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "This is partly a review of Dumbo because one of the reasons we ended up at Superfine was to check out the Dumbo \"scene\". Honestly... I am not sure what the Dumbo scene is (is there a scene?) but I had a great time (more about that later).\n\nI went to Dumbo because some friends of ours were subletting a place there, complete with a roof deck. If you live in Manhattan it is really nice to go to the other side of the rivers and appreciate where you live. After some drinks on the deck we decided to find a nice place to eat in the area. Superfine was our Yelp inspired choice.\n\nSuperfine has a really nice space... open, high ceilings, exposed brick... very comfortable. It is somewhere between trendy and neighborhoody, which is just my cup of tea (whiskey).\n\nThe bartender was super friendly and even though all the seats at the bar were taken we had no problem getting our drinks and bringing them over to the pool table. The free pool here was definitely a highlight and we stunk up the joint appropriately. For dinner we all got pasta and surprisingly it was very good... I assumed Superfine got by more on its vibe than its food but I was pleasantly mistaken.\n\nWe really wanted to experience Dumbo so after dinner we looked for another bar... this seemed rather difficult. There was just not that much going on. The heavens opened up for us however as we met a very cool dude with a loft overlooking the river and he invited us up. His place was exactly what I imagined Dumbo was all about... he had essentially built his place from scratch a number of years ago and it was the perfect place to have a small or very large group of friends over. We drank vodka, talked about the meaning of life, listend to good music and left hoping everyone in Dumbo is as cool as he was.\n\nI am still not sold on Dumbo as an evening destination but I am sold on Superfine and if you are in the neighborhood I highly recommend it.", "author": "Jeremy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-23", "description": "Probably one of the best restaurants that I have tried in a while for many reasons:\r\n1) the food is fresh -- like many places now, they work with local farms to bring in the best local produce and meats\r\n2) the wine list -- affordable, tasty\r\n3) live music -- on Saturdays, they are rocking in with a jazz vibe that is super cool\r\n4) laid back atmosphere -- the menu is on a dry erase board, the service doesn't rush you and the decor is a mix-and-match hodge podge of chairs and kitchen tables evocative of a simpler time\r\n\r\nIt's clear to me that DUMBO is the place to go for places with great food sans the attitude.", "author": "Meryl C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-01", "description": "When someone tells you there is a free ($) orange pool table in Brooklyn, under the Manhattan bridge, that used to be a garage, and is filled with the sort of people you can strike up a conversation with, I hope you think fondly back to this review with teary eyes. Yes, Superfine, my numero uno favorite bar in New York, followed closely by Sonny's in Redhook. It's got great atmosphere, unique location, and cheap beer.\n\nI've eaten there once, but can't remember what it tasted like, which probably isn't a good indication, but the real deal is Gramaldi's pizza down the street.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-02", "description": "I work in Dumbo, and with the limited # of nightlife options end up here for drinks and snacks  with the work kids pretty frequently. My experiences here have been mixed and if there were more options around I might have the balls to downgrade it to two stars but I'm wary of biting the hand that feeds me after-work booze. So, I'll try to stay scientific and just list out the pros and cons. \n\nPros: \n-Is in Dumbo, has booze and snacks\n-Big space, plenty of room to hang out with a group\n-Drinks are reasonably priced\n-They take credit cards\n-Once in a while has a good veggie soup or sandwich on the menu\n-Has a free pool table with comfy couches and chairs around it to lounge in\n\nCons: \n-Inconsistent service - sometimes super friendly cool bartenders, sometimes total bitches. Once had a hostess who threw a psychotic fit because our party of 12 pushed the two separate tables we were seated at together. \n-Food is lame. I admire their local/natural philosophy but their uninspired, bland, boring dishes give natural cuisine a bad name. \n-Few veggie options. \n-Bar area can get super clogged with people.", "author": "Patricia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-15", "description": "One of my favorite spots... \nEverything on the menu is consistently good... they have one of my favorite burgers in all of NYC on sunday nights... The brunch is fun, always good energy and music, and despite the fact that yes, sometimes the bartenders get very busy and arent the most talkative, the service is usually pretty good. \n\nNone of the food is pre-prepared... traditional cooking rules apply here so sometimes the food takes a bit to come out, but its always worth the wait. \n\noverall: Free pool table, fun local scene, great beers, kickass burger.", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "came on a thurs night w a friend. ordered the movie star drink ($12- ginger vodka w lime and ginger ale and syrup ) . it was too sweet for me. \n\nfood was really tasty and fresh. we shared the scallops ($14) for three scallops was a tad expensivo! but so tasty. i had the pork loin sandwich from the bar menu ($12) and my friend had the polenta (around $18). both were well flavored and delicious! dessert was an apple rhubarb crisp ($8) w a scoop of vanilla ice cream. tasty and significant portion. \n\nambiance was great though a bit loud. the bar seemed to be loudest . service was great. super nice server. \n\ngreat date spot. sure was dark enough.\n\nwill def. be coming back when im in the dumbo area.", "author": "Kay W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "With a little arm-twisting, I convinced an East Villager to make the trip across the river to DUMBO.  A few $3 beers later (plus outstanding dinner and appetizers)and he put Superfine on his short list.  Superfine, located on the movie lot that is Front St. in Dumbo, is at once hip, friendly, casual, and quality.  The space inside is enormous (as other Yelpers have already attested).  While I've yet to throw down on the renowned orange pool table, I liked the really chill vibe it exuded.  The exposed brick and massive wooden columns are so cool you'll probably question whether they're original (or just pretend) - but rest assured, this is Dumbo, and it's another converted warehouse space.\n\nFor not much money, you can have really excellent food.  I mean, take that same meal (fig and gorgonzola pizza, or grilled calamari) across the East River, and double the price.  I really like the menu, too.  There's so much stuff made fresh daily that you'll wish you could stay to try the whole whiteboard menu of sustainable and organic grub.  Yes, we had to wait for a table, and yes, the food took a little while to come out.  But in defense of the staff who service this huge restaurant, they were all really pleasant and friendly, and very attentive once we got our table.  In the couple of times I've come here I've had a great time.  Check it out if you're traveling to Brooklyn on the F.", "author": "Andrew U."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}