{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Great brunch! Went here on a recommendation from a friend, and it definitely exceeded expectations. We came around 12 pm and stayed about an hour, and there was live music. Great service, eclectic atmosphere, and delicious food.\n\nI got the French Toast, which was heavenly, and my friend got the granola and yogurt.", "author": "Mary D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "So disappointing.\nFood was terrible and greasy. \nNot busy on a Saturday night and I should have known.\nWill never return.", "author": "Betty F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Love this restaurant! A huge thank you to Tanya and everyone at Superfine for putting together an unforgettable dinner party for 20 people for my wedding engagement this weekend!! They went above and beyond and helped make for an unforgettable evening. Food, service, live music, ambience, was all on point. We will be back soon!", "author": "Ray M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Super delicious food, great atmosphere and friendly staff. It was a Wednesday evening so it was not overly crowded. It was just right. I'm sure this place gets busier during the weekend. I ordered the roasted chicken served with fries and my sister ordered the stake. Both were fine choices. If you want a chill evening in a great venue come here.", "author": "Oscar S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "I was visiting family on the Lower east side and we decided to ck out DUMBO.  The experience started out ok.  They were busy and our party of 4 had to wait...to be expected.  We ordered and waited FOREVER.  After the people who came in right before us were leaving I got up to see where our food was - at this point the place was 1/2 empty. Never ONCE did our server ck on us.  After we ate, again, no sign of our server.  I finally got up and gave the hostess my card and told her we've been there for 1 1/2 hours.  The manager can up, apologized and took care of our round of drinks.  We were happy with that...2 sodas and 2 bloody Marys.  The problem, one of the bloodys was still on the bill - $11.  I went back up and he explained that he only saw 3 people at the table because one was in the bathroom when he made the correction.  He was rude about this and when he came back, he gave me the $11 and and had an attitude about it.  How bout a simple apology?\n\nI left a 12% tip on my outstanding balance for several reasons.  1. Our server never checked on us, not even to order another round of drinks and certainly never to resolve anything 2. I had to get up to ask where our food was, when I finally did, I saw the mad scramble to put it together - again, no apology.  3. After we ate, the restaurant was now 1/2 empty, I had to get up again to give the host my ccard the server was MIA 4. When the manager came back and said he deducted a round of drinks - he only took 3 off. I had to get up again!!\nI sorry but, what service am I paying for!?\n\nThen here is the best part,  we had to call uber because we were now late - costing me twice as much to return home...As I was getting in, the manager barged out of the restaurant to ask why I stiffed the server...excuse me sir but we were never served!! \n\nOverall, on of the worst customer service moments I have had ANYWHERE!\n\nNo surprise that others have shared recent service failures. \n\nThe place is overpriced and service is horrible.  I must say that the gentleman busing tables was a very nice guy - sorry he has to deal with that place.\n\nNot a great first impression of DUMBO.", "author": "Brian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Food was Delicious and our Drinks were good too! We asked about the menu and our waiter was nice and informative. We will definitely be back soon", "author": "Aide B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "This is one of those places that makes a lot of lists, you know? It's very fun and funky, and the decor is really interesting and makes for a good instagram. It was hard to pick what I wanted on the menu! The only problem was that it was LOUD and it was fairly early when I want because, you know, brunch lines. The service was great, though, and we didn't have a problem finding a seat!", "author": "Kelsey W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Pretty cool place, live music, awesome neighborhood. Drinks are nice and strong (love that). Haven't tried the food but when I was there I got a look at plates that other people have ordered and I must say it looked pretty good. The place is huge! The bartender told me that back in its days it use to be a horse stable.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "Love the sunday brunch steak sandwich its to die for i even told the chef how yummy it was.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "They had real Hatch New Mexico green chile!  Breakfast burrito was amazing and authentic to New Mexico. Amazing brunch and great drinks. Sat at the bar for Brunch on a lazy Sunday. They had live music and plenty of seating. We will be back for sure.", "author": "Jenna R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "This place is awesome!! Great atmosphere, awesome food!! I had the juevos rancheros and it was killer!! They even use hatch green chile! Growing up in NM eating that stuff, and finding it in Brooklyn is great! Great live band as well. I will definitely be returning", "author": "Jonas R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "I love this place, i always get the pork chop with mashed potatoes with veggie slaw. you have to try swing by.", "author": "Donna W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Went to dinner here last night with a party of 7. It was fabulous! Best steak and pork chops we ever had. Server was awesome and drinks were good.", "author": "Dina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Twice in one week. Weeknight and weekend. A bit loud but food is fantastic. Great beer on tap.", "author": "Jim L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Hands down favorite local restaurant. Always fun entertainment with great food and a game of pool if you desire. Love the casual atmosphere,quirky vibe and really delicious food. Love their pork, chicken, pasta,lamb meatballs and soups. Also great beer on tap!", "author": "Tess G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Took my superfine homegirl to this spot after that awful trek across the bk bridge.\n\nIt is huge (that's what she said).\n\nThe waitress was affable, and the burger was sick delish.\n\nJohnny Cash was pumpin on the speakers.\n\nThere were some drunk construction workers at the bar area.\n\nThere were midwestern tourists (like grampa, granma, jake, susan, jake jr, jacqueline and baby jake) all loud with their terrible midwestern accents.\n\nIts a chill spot to hit up on weekdays. On weekeends, you'll see lots of I Love NY shirts up in hurrr.\n\nOf note: I detest all the faux-trendy(transplant hyped) bk bars.", "author": "Louis R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-07", "description": "I wish I could give this place zero stars. We were hanging out by a pool table (which is in a bar) and somebody near us spilled a drink. Not even five minutes later a hostess (or something to that effect- somebody insanely uninviting) came over and screamed at us, asking why we wouldn't tell the staff there was a spill. So rude and won't ever be back or ever tell my friends to come here - and we live in the area. I hope this place seriously runs out of money and goes to shit and can't recover because that's exactly what this woman and this bar deserves", "author": "Ashley K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-09", "description": "This place is totally average and should be called \"SuperRude\". The service here is awful. From the bartender to even the manager Suzanne, we did not get good treatment.  When we tried to talk to Suzanne about it, she was defensive.  Not at all customer friendly. The bartender shared her name as she wouldn't tell us. \n\nAs I closed out my tab, I was informed that a 20% tip was added because there were 6 of us; the problem is, we were only five. I would not have given 20%.  Felt like they tried to get away with charging me a bigger tip. \n\nThe drinks are expensive and not that great. We were charged $12 bucks for tequila shots that we had to bus to our table ourselves. \n\nThe atmosphere is cool, but unfortunately the terrible service ruins the experience. They act like they're the only game in Dumbo. I won't be returning anytime soon.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "This was me and my fiance's second date night spot, so we decided to return with our parents for a beautiful morning brunch/lunch. It definitely was as good as I remembered it. With fresh ingredients and super boozy bloody mary's, I'm sad we didn't think of coming here earlier. I guess we'll have to come and indulge after the wedding diet.\n\nFor brunch, I'd highly suggest the breakfast burrito (I couldn't finish it) and the pork chop with eggs (this is more of a dinner meal though). \n\nAs a second point, I've always loved how this restaurant looks. Located at the bottom of the bridge, it has beautiful levels and very welcoming open spaces. It's probably a big hit with all the start ups in the area after work for happy hour.", "author": "Clemens W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "If I could give less than one star I would. My friends and I came out tonight to enjoy the neighborhood music under the Archway and all. My friend was hot and Superfine seemed like a good fit for our group with the rainbow flag flying. I left her in there expecting the ladies behind the bar to keep a safe environment for her while we were dancing. When I came back in she was so upset because the bartender had asked her to move for some other people!! She politely declined, as there were dozens of empty seats around. She couldn't wait to get out of there. The complete void of any dark skinned people at the bar on top of her being asked to move is very damning for your establishment. When she told me the story I was disgusted. No one should ever be asked to move seats in a public establishment!!!", "author": "Laura S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}