{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "Love the funky eclectic atmosphere.  Went here for lunch.  Place was pretty empty but the food was excellent.  Roast beef sandwich with bacon...yum.  The flourless chocolate cake was rich and delicious.  Friendly staff and nice vibe.  Would definitely come here again when in town.", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-10", "description": "Overpriced, tried to make us sit at separate tables even though we called the owner (who we have a business relationship with) days before and made reservations for 15. Then they tried to charge us $3.00 extra per card cause we were using credit cards  for part of the bill even though the menu didn't say so! Won't be going back!", "author": "Suzanne S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-03", "description": "Came here randomly after a walk across the BK bridge with a large (30)  people and surprisingly, we were greeted quickly by a waiter. Unfortunately, he doesn't know his draft beers; he suggested their Kelso White Ale was similar to Blue Moon. Umm, no. Nothing like it! And it took more than 15 min to get this beer, when the bar was just steps away and he only had 2 tables to deal with. \nBetween that and seeing some of the negative reviews, I doubt I'll make the trip out for this place again. Life's too short to frequent crappy bars.", "author": "T E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-02", "description": "Came here last night for a quick bite and drinks with a friend.  Pretty relaxed scene, big space with a big bar down the middle.  We shared a salad and each got a main and 2 drinks, for a total of $85 all in.  Given the quality and portions, I walked away feeling like I paid a little too much for what I got, but it was still good and a pleasant experience overall.  Service was friendly, if not a tad slow.\n\nIf I'm in the area, I'd probably choose Rebar over this place, but it's a solid choice with a decent menu (that allegedly changes daily) and a well-stocked bar.  I'd go back.", "author": "Joe L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-30", "description": "Drinks were good--dinner not do much. Got the baby back ribs with Mac and cheese. Waited 40 minutes for over salted meat and no refills on bread. The Mac and cheese was under seasoned while the meat was over seasoned. Highly disappointing.", "author": "Michele L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-20", "description": "My experience here was actually great in all aspects... aside from the actual food. The atmosphere was great, there was live music, and our waiter was exceptionally friendly and natural. I won't condemn the food altogether as my boyfriend and I had the same thing, fish tacos. First of all, I love fish tacos in pretty much any format, except with salmon. I assume the fish they use varies by day, because the type of fish was not listed on the menu. Even though I do not prefer salmon, I think I would have enjoyed the tacos more if the salmon was seasoned, or there were additional dressings such as a tangy slaw or an aioli to boost it. The tortilla was very fresh and warm and the side salad was crisp and yummy. I would come again to try a cocktail and a different dish.", "author": "Ashley W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-18", "description": "Went here for brunch the other weekend as we were walking around Dumbo and this was close by. The atmosphere is great - there was a band playing that wasn't too loud, and they were great. But the food was very meh. I had the breakfast burrito and boyfriend has the huevos rancheros. Both were served with VERY runny pinto beans that took away from the rest of it. I loooove breakfast tex-mex and this didn't cut it for me.", "author": "Julia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "The atmosphere is very fun. I DO like this place and frequent here often. If you're going for a fun, lively, not pretentious place to eat, this place is definitely good. If you're looking for great food, you're probably better off going to a slightly fancier place down the block, like Al Mar. \n\nThey have a huge bar, plenty of tables, free pool table too. Sunday brunch is good and real cheap.\n\nBeware of the man in the vest that is always at the pool table on weekends.\n\nVisited February 2013", "author": "Arun J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "For the price you pay, you get attentive service and a great ambience but the food Is a bit overpriced. But what do you expect in DUMBO? Overall, it's a good place to take a date or a laid back dinner with friends.", "author": "Annie H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-22", "description": "I wish they had a website or a menu online so I can properly recount the conversation I had with the bartender.\n\nMe: ::looks at drink menu:: Can I please have a [drink made with house infused tequila that sounds good]\n\nBartender: No, sorry, we're out of that.\n\nMe: ::looks at menu again:: How about the [drink made with house infused rum]\n\nBartender: We're out of that too. It's the end of our week and we're out of a lot of stuff. (I was told by someone who ate here that they had several food dishes that were gone as well).\n\nThis discussion happened on a Saturday night. Now maybe this is the kind of place that gets great weeknight business, but the weekend is usually when bars and restaurants make a lot of money. So I ordered a Manhattan made with Knob Creek. It came out to sixteen dollars. Now I like Knob Creek, it's pretty decent, but you can buy a bottle for $35, which is what two drinks of it at Superfine.\n\nWhat an obscene ripoff.", "author": "Adam R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-11", "description": "I would have considered returning only for the bruschetta, but they lost my debit card. I had to call multiple times within an 11 hour span to finally get some sort of answer, and to have been told once that \"credit cards that are left at the restaurant are sent to the office off-site, but must be retrieved from the restaurant.\"\n\nThe third time I called I was told they are kept in a safe at the restaurant, but only one person can access the safe, however, I don't know how they are finally placed in the alleged safe at the end of the night. In summary, there are inconsistencies amongst the staff members as to the placing of forgotten cards. \n\nAbout twelve hours later I finally got a call back that my card could not be located. There are no new changes on the card, and the \"Superfine\" restaurant was the last place I visited with the card. It's somewhere in the restaurant, they just lost it, or the staff just failed to communicate where they actually place lost credit cards.\n\nDisappointing.", "author": "Mary S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-26", "description": "After seeing my buddies and fellow Yelpers Ava E. and Lani P. went here, I just had to try it out.\n\nGrrr no food! My drink was over strong!! But they didn't have any food. We came at the weird hour between lunch and dinner. The lady was cool though...after telling us she couldn't give much in the way of suggestions because she was an alcoholic she comped our drinks! I wanna go back. Wanna come?", "author": "Yasmin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "My daughter and I were lucky enough to visit New York this week to celebrate her birthday.  The design of the restaurant has such a cool vibe, and the food is so fresh, with the menu changing every night depending on locally sourced ingredients.  From the delicious cheese platter to the unbelievable lavender creme brûlée, our dinner at Superfine was definitely a highlight of our trip!  Can't wait to visit again!", "author": "Hilary H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "Dudes... Eat the steak, calamari, porkchop or pretty much anything in that realm... It's amazing! And affordable... Interesting space... But the food rules... So really that's it... Also the staff is pretty amazing... It's a real spot with good ass food. Take your girl here!!", "author": "Twiz R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Staff has been super helpful for us. Food is always good and fresh. Events are a lot of fun. Great mix of people here.", "author": "Mark E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-27", "description": "Like what everyone else has said- drinks are good, the staff is a joke. And like what most people have said- you walk in really really really wanting to like this place and wanting it to not disappoint.\n\nThis seems a bit harsh but never in my life have I ever been so pissed off at the attitude of an incompetent staff. Usually there are variables that go into an overall shitty dining experience. Maybe the server has too many tables and is overwhelmed. Maybe there's a new chef in the kitchen. Whatever, there are variables. I've worked in a restaurant, and I know that just because your experience sucks, does not mean the server is at fault, though they are the people who unfortunately have to deal with customers. \n\nIn this case, let's jus talk facts: \n\n- We didn't have utensils for a good 20 minutes or water. \n- There was string or a white long something- in our water \n- Our server didn't come by for a good 30-45 minutes. \n- After 45 minutes of sitting down, we did get bread for the table. \nCon: The bread looked like somebody was snacking on it. \n- Our actual meal took an even longer time. \n- During this time our sever checked on us a total amount of 0 times. However, she did manage to openly snack near the bar/kitchen in the back. (not a big deal, people get hungry) \n- We had none of the condiments our meal was supposed to come with. \n- The food was mediocre at best. If you're going to charge $18 for pasta, let's make sure it's at least warm when it arrives at your table. We won't even go into taste, since that's subjective.\n- Server, again, though we were burning laser eyes into the back of her skull was still busy snacking in the kitchen. Meanwhile the bus boy is running around, obviously busy.\n- Asked the hostess if we could just have someone come by our table. \n- It's a sunday night- meaning- it is not that busy. \n\nOverall: HUGELY disappointed. Maybe ordering drinks at the bar and not getting table service would be the right way to go. I wouldn't recommend having dinner or an actual sit down meal here. You're going to do more watching the server eat than actually eating yourself.", "author": "jill l."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-14", "description": "Food was good but the service was indifferent at best.  Have servers check in every once in a while. Have hostess NOT slam the bill on the table.  Say thank you.  Smile, say hello, engage the customer.  I can get the same quality food at a hundred places in NYC.  Put a bit more effort into service... Not likely to be back.  Superfine?  Supermeh!", "author": "Scott C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Great Bar!  Was a little difficult to find as the name was written on the wall.  Thank goodness for GPS as we walked right past it several times.  Once inside, we spent an entire snowy afternoon at the bar catching up with two great friends.  The bartender was friendly and makes great drinks.  Tried almost every drink on the menu and even some of their home infused liquors.  Would love to do another \"lime\" here.", "author": "Dani B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "Agree with Alexis, Superfine is one of the better place for lunch in DUMBO. The food here is great, prepared fresh from locally procured ingredients. They come out of the kitchen slowly, but the space is neat enough for good conversation, if you are not in a rush it's absolutely enjoyable. \n\nLove their Chicken sandwich and Spaghettini.", "author": "Mo Riza .."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "I'm not only pretty disappointed, i feel a little nauseous.  I kept eating and eating waiting for a sense of satisfaction but the food was without any merit as far as culinary accomplishments. I liked the restaurant itself, the service was friendly and tried hard, but you just need to invest a chef - c'mon, this food is lousy, if this was a small city in Oklahoma, perhaps it would be understandable, but dumbo, brooklyn, nyc - just not acceptable.  based solely on what you served you really should start again from scratch.   Exclusively from a food perspective, a total zero.  I'm giving the stars because of ambiance and service, and general hospitality.", "author": "David S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}