{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "My husband and I were in search of a place to have our wedding and we decided to book our event with Superfine. The Event Planner, Tanya, was so attentive and informative and she really wanted to make sure we as couple had our input and most importantly she worked well with our budget. \n\nOn our wedding day, my husband and I were happy and satisfied with the service. All of our guests had much great things to say about our event: they loved the food, the cake, the atmosphere and how attentive the servers were.", "author": "Crysbel M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-25", "description": "Sunday brunch review\n\nThe food is nothing special, what ppl come here for is the live music. This Sunday feb. 17th they had a band from Alabama, interesting music. \n\nThe drinks are watered down and cost just as much as everywhere else. The mojito is lime juice with ice and almost no liquor. However, the pool table comes in handy if you want some healthy competition. \n\nOverall, wouldn't come by here again. Just because the drinks were sucky.\n2.5 stars because apart from the live music they have decent beers and the waiters were friendly.", "author": "Avina H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-17", "description": "Haven't had a brunch this bad in a while. It honestly felt like brunch from Hell. We came in on a Sunday when they had a live bluegrass band playing. Totally a preference thing, but I personally find this genre absolutely grating. The type of music you start making when you've been in isolation and inbreeding hard. Anyway, this review isn't for music. \n\nThe food was just so mediocre! It was mostly generic Tex-Mex fare. Exactly the Mexican food you deserve while you're listening to redneck jazz. Burrito was bland, mostly just over cooked scrambled eggs wrapped in a gummy tortilla and drenched in watery hot sauce. Served with 3 nuggets of unseasoned potatoes. Pathetic. $16, in no universe justifiable. Coffee was dirt water. No one seemed happy with their food. It was just the lot of us, slowly shoveling tasteless, tepid, soft mounds into our mouths. Service was fine though, can't fault them for anything.", "author": "Candice L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "Came here for a me date Memorial Day weekend. Kentucky lemonade, (bourbon and sugar on the rim!) and Frittata. Perfect portions. So many places just give so much food, and seriously, how many times do people actually eat their doggy bag leftovers? Also, when you check in, FREE GLASS OF WINE. Come on, how can you loose?? Love the vintage touches too, and fresh flowers!! TREAT YOSELF!!!\n(Also, they didn't mind that I brought my half drank iced coffee, some places are weird about that).", "author": "Annie E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-01", "description": "Superfine might be superfine because it's in Dumbo and by the East River but it isn't all that fine when the food you ask for isn't available and the food itself isn't all that super. \n\nDetails:\nI came here for Brunch around 1PM with two other friends. It's quite spacious and there's even a stage for live music. Amaze. A band was playing folk / country music and it was really sweet. And our waitress was sweet. But that it is folks - nothing too \"WOW\" ing. \n\nFood is average. The brunch/lunch food is mostly tex-mex feel and good ol' chunks of meat and omelette. They didn't have sausage when I went. The side order of bacon was really disappointing because I could have made juicer bacon at home. My friend who had chicken enchilada said the chicken tasted really fake, but the beans were good. Oatmeal was average. Omelette was mediocre because it didn't have any distinct taste - I had to think why I was eating an omelette that tasted like nothing. The potatoes were good.  My other friend who had pork chops said it was pretty good. \n\nAlso, two of the three drinks we ordered weren't available. \n\nIt was below average to average feel of an experience.", "author": "Joanne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-04", "description": "Came here on a spontaneous date on Friday and had a wonderful experience. The vibe was super cool and the staff was great. Food was mediocre we ordered the artichoke salad, grilled calamari and fries - we were pretty full on the drinks which were on point. We tried a few of the drinks honestly all of them tasted great you can't go wrong. Def would come here again.", "author": "Sheena K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-13", "description": "I came here late night had jerk wings the snakebite beer (amazing) and I regret nothing. My bartender/server Martin gave me exceptional service unlike the server who was around me he had a light blue shirt around us he just wasn't accommodating at all and condescending I'm a server myself on the lower east side and give all my guests exceptional service but whatever I don't hold grudges. Even when it's closing I give everyone a smile and great attitude he wasn't a team player. However, Martin was nothing but great to us for my first time dining in dumbo. I will come here again and again and again. Great service. Four stars to Martin!!! Great food and great wines and beers for the price . Great music mix of 80s and 90s right up my alley. Come\nHere after a nice walk in the Brooklyn bridge it's worthwhile.", "author": "Naniaka C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "Great spot in Dumbo for brunch.\n\nFood was killer and there's a pool table, although I don't know if you can play during brunch. Mens has something for everyone. Nice couple of beers to choose from and full liquor bar.\n\nThis place has a feel that the space hasn't changed much since back in the day. I love that. It is right under the bridge,​ so truly Dumbo.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-30", "description": "I LOVE THIS PLACE !!!\nI have been coming here since I was a teenager ! Now I bring my kids here and we love it so much !!\nThe steak is always the best - order it and I promise you it's the best you ever had even if you have been to Peter Lugher (which in my my opinion is a tourist trap and the food is crap now) \nAfter dinner have some drinks and play some pool !!! Thank you for existing SUPERFINE ! You are my favorite", "author": "Alina B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-30", "description": "This place is as sub par as bars, pubs, can come. Super high prices for food that is the blandest of the bland. God I hate Brooklyn for spots like this. Gentrification at it's finest. I ordered the Jerk Chicken Wings let's just say if I was Jamaican I would have sprint like Usain Bolt straight into a samurai sword after eating these because they are profane and blasphemous! Damn near $30 for a dinner oh and if there is not salt on the table make sure you ask for it because the food is gonna need alot. Do you know how I felt once I left? Swindled, robbed and above all else hungry.", "author": "Patrick C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-21", "description": "Love this place. Awesome menu, good portions, delicious food, cool vibe for any occasion, great service, yummy menu.", "author": "Blake B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-17", "description": "I can only review the service because myself and my other half walked in. Asked if we could sit at the bar and as we sat down the bartender didn't even acknowledged us being there. He kept on walking back and forth. Fed another employee chocolate while we waited for him to finish hoping we can grab his attention. 7-10 min passed by another couple sat at the bar and he directly went to them. Needles to say we walked out.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-16", "description": "Came around 7 PM on Sunday night. Place wasn't super busy, but the service was pretty slow. Took them forever to come over and take our order. I ordered the side salad which was nothing but a place of lettuce. That's it. For $8. That pissed me off.\n\nThe pasta bolognese was okay, but for $23 it wasn't worth it.\n\nThe atmosphere is really nice, so I advise coming for beer/ cider. My friend ordered a burger, and it was okay, but they really expect you to fill up on the fries.\n\nI will definitely not be coming back.", "author": "Cassie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "Superfine is my local joint, and we love it! We love the owners, the atmosphere and the food is outstanding. Farm to table, organic, delicious. It's a women-owned business, and always has been since it opened 21 years ago. Can't recommend it enough!", "author": "Rosie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Superfine lives up to its name and more. It has been a staple in Dumbo for 18 years and I have been coming here since it's inception. Fresh sustainable foods made with love from start to finish. One of my favorites is the farm salad. And the steak is always beyond delicious. I highly recommend eating and chillin in this great neighborhood spot.  You can always find beautiful art, community, food and music. What more do you need?", "author": "Kelly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "Great location.  Great food.  Good prices.  The staff was friendly. We even noticed a few of the staff giving great tips on other places (museums, shows, etc) tourists might want to check out.  The vibe of the place was really interesting and comfortable. Nuff said.", "author": "Keyth S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "The butter squash soup is to die for. Ryan have outstanding customer service. Also the location is convenient.", "author": "T G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-17", "description": "Idk.. just okay burger. Below average pour on my $13 laphroige neat. Cloudy pour on my $8 voodoo IPA.  Slower than average service. Not sure how to feel about this place.  I wish I didn't tip 20% but I'm a coward.\n\nI would not come back.", "author": "James F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "My go to spot in Dumbo. Love the staff, the atmosphere and the menu. Great quirky layout and everywhere you sit has an interesting aspect. \nTasty cocktails, great brunch meals and the staff made me laugh twice. Not just once.", "author": "Lloyd J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "The food here is outstanding. Great vibe. very fresh great ingredients simple delicious. I will admit it's a little over priced/expensive for the entrees but good quality food is not cheap. The pork chop wins.", "author": "Brian G."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}