{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-17", "description": "SUPER FINE.\n\nNice space, good food, FREE POOL.", "author": "Helena Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-13", "description": "I must say the atmosphere is nice, but wow,  my friends and I ate here last night and NONE of us were pleased with our meals.   We tasted each others and hands down, blah.  Not worth the wait, but  the bartenders were cool, gave us a round of shots. \n\nI really can't remember what the dishes my friends ordered, that tells you something...   They were totally generic, closer to mass produced chain restuarant food.    We did tell the waiter and he gave us dessert on the house (nice), but those too seemed like they came from a box. \n\nExpected more from such limited menu.  Oh, and the schpeel about being organic and fresh, blah blah blah...hmmm - questionable.  \n\nI would not go out of my way to go back.  Extra star for the bartenders coolness and the waiter comping dessert.", "author": "Dana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-22", "description": "I threw a benefit for the Leukemia and Lymphoma Society here, the h'artfest, and I could not have asked for a better place or better hands to be in.  The owners and managers were so thoughtful, helpful, and wonderful.  They made the evening pleasurable as well as possible.  The space is beautiful (especially at night) and everyone had a great time.  I recommend Superfine to anyone looking to throw a function.", "author": "Aubrey R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "I don't get what the negative reviews are about.  I've been to Superfine about 5 times, all at varying points (Sat night dinner, weeknight dinner, Sunday brunch) and each time the service has been fine and the food has been delicious.  Fun cocktail list.  It's moderately priced for Dumbo.  I get that the decor and atmosphere can be off-putting to some, but you should be able to recognize that that is an individual preference thing and Superfine is going for a certain aesthetic.\n\nShould be more like $$$, esp if you get a few drinks.", "author": "Daniela J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-19", "description": "great interior, but a small ever-changing menu with very few veggie options and no snacky small plates. The decor and name pleased me no end, but I really wanted an entree size salad and had to go with angel hair with cauliflower, onions and virtually no sauce. Eh.\nI'd drink at the bar again for sure if I was in Dumbo but I wouldn't seek it out for chow unless I was a meat eater :)", "author": "Coco W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-01", "description": "Superfine is super good! The food is tasty and unpretentious. My girlfriend had the steak and fries, I had pork chops and mash potatoes with asparagus. They had a good wine menu and the pricing was reasonable.The atmosphere is kinda shabby, but in a calculated (not intentional) way, and our waitress was a delight.\nThe only disappointment came with the dessert. I got the brownie with whip cream (they made it sound much more appealing on the menu) and my friend had the ginger cake with lemon sorbet. We both strenuously wished that we had quit while we were ahead. But the food was so good we didn't think that we could lose with dessert. Oh well. We're still going to go back.", "author": "Arlene J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "Funky local spot in DUMBO, great place to relax have a couple drink with friends, enjoy the atmosphere, listen to music. I didn't have the food but would frequent the locale when given the opportunity", "author": "Eric H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-03", "description": "We shoulda stayed put and had dinner here...but we didn't so I can't vouch for the food, tho it smelled mighty tasty, and had to have been better than where we ended up (at rice). \n\nBut all that said, it fit the bill nicely for our pre-dinner, pre-dancing hang out spot--comfy couches (for sy to get her disco nap on), pool tables (for ko to play with the pros, and for the pros to hit you with their cues and butts), and drinkies (for me to imbibe while doodling happily). \n\nThe vibe (despite the invasive cues and butts) was very chill and friendly. Gorgeous tall ceilings, warmly lit, and (to sy's delight) comfy couches. And I love that it's called Superfine, but is in a place called Dumbo. Next time I'm in Brooklyn, I'm just gonna stay there. I'm sure they won't mind...", "author": "eliza w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "I absolutely love this place! The bar is great and service is excellent. I have always enjoyed this hip trendy bar and the variety of people in it. The owner rocks, when she drives up on her hog and parks out front in the summer. This place is great!!", "author": "Charles V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-25", "description": "Our little trio came here after passing Grimaldi's horrendously long line. For dinner we shared the jumbo shrimp appetizer, which was grilled well. I had the roast half-chicken (tasty dark meat, dry breast meat) with a yummy side of mascarpone mac-n-cheese. My friends had the barramundi and pork chop. Overall the food was good. I enjoyed my meal. But for such basic dishes, the food was overpriced.\n\nI really liked the interior of Superfine. There's a bar when you first enter and an elevated area in the back used for dining. The decor is eclectic-- random diner-style furniture, various colored lights, exposed brick walls. It's fun and low key but nice.\n\nI'd eat here again if I find myself in Dumbo.", "author": "Alicia L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-06", "description": "Just a little too mediocre for a place that presents itself as being much better.", "author": "Kerry S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-11", "description": "Honestly Superfine can do no wrong to me,  except now the clientèle is beginning to annoy me... I love that the menu changes daily according to the local farmers so everything is super fresh \u0026 delish!!! It's like my mini SOHO. I love the locale, I love the mismatched decor, \u0026 I LOVE DUMBO. I also LOVE that I bring dates here \u0026 don't have to worry about running into someone else I'm dating because they can't seem to stand the place \u0026 come only if I'm gonna be there (Upper East-side Snobs!)... But I'm A Brooklyn Girl, We Take Some Getting Used To...\u0026 this is a Brooklyn spot \u0026 I LOVE IT!", "author": "Smithsonian G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-09", "description": "I had my birthday party at Superfine on Fri Oct 22 and it was fabulous.  Even though i was half an hour late, they held the table for my guests and me with no attitude.  The waitress bought me a beer and the servers were happy to bring out the cakes my friends broguht with candles in them.  The meatballs were delicious and free pool is always great.  I lvoe this place.", "author": "lisa a."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-18", "description": "The space is great -- open, high-ceilinged, good amount of seating and pool tables if that's your thing. Location is also good, located right on Front street around all of the other (read: not many) neighborhood places to join in some sort of merriment.  Don't get me wrong, I like dumbo, but it's hardly a real \"destination\" with robust nightlife offerings.  Superfine fills the niche well, as a bar doubling as a lounge with live DJ sets. \nThe beer is standard fare and at least one tap is generally dedicated to a local brew. \nIt's an interesting strategy to name your establishment as two superlatives.  Sets the bar a bit high.  And, while I quite like superfine, I'm not quite sure it lives up to its nomenclature.  Morethanfine might be better.", "author": "nate r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-28", "description": "Ohhhhhhhhhh brunch, how I love thee.  Nothing better than meeting up with a huge group of friends the morning after, so to speak, ordering a bloody Mary, and stuffing your face.  Seriously, it doesn't get much better than that.\n\nAnd Superfine lives up to its name, serving up tasty (if a bit overliquored and undertomatoed) Marys, fantastically fresh omelettes, and other goodies.  Though the hostess was a bit rude (telling us our eating time would be cut short because we were late on the reservation), our server was very kind (and prompt!).  \n\nOverall, an excellent, excellent spot.", "author": "Jillian Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-03", "description": "The Good: Super-nice staff; super-cool bartender; great interior; turbot had an amazing cucumber salsa; shrimp in the penne was just how shrimp should be: fresh, butterflied, meaty, and garlicky; easy transition from dinner table to bar stool; a rare find that serves dark Krusovice \n\nThe Bad: Men's loo does not have the cool beaded curtain like the one gracing the women's, thus making for less dramatic ingress/egress\n\nThe Ugly: Someone ordered a beer-tomato juice concoction that just seemed inherently wrong", "author": "Paul K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-20", "description": "Love this place! We don't go for great food (it is tasty though) or excellent service, we go for the great space that's very warm and inviting. The drink prices are also great.", "author": "Nick G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-25", "description": "I loved the atmosphere of this place. It's built in a large, open space with a brick interior, which I'm guessing was a factory in its former life.\n\nThe lighting is soft with lots of colorful paper lanterns. There is a pool table toward the front and the bar is very cozy. The kitchen is open, which is always nice:)\n\nMy one issue was with the menu selection. The waitress brougth over a white board with around 5 entrees and 5 appetizers on it. That would be (super)fine (sorry, couldn't resist) if there were more variety in what was offered. I was there on Thanksgiving Eve and didn't want a very heavy dish, but all of the options save one mahi mahi entree and an appetizer salad were heavy.\n\nI ordered penne with broccoli, panchetta, gorgonzola and brussel sprouts(it was the lightest option that wasn't seafood). The portion was managable, which made me happy as I tend to devour all that's placed in front of me! It tasted great, but was a little heavy on the salt and olive oil. \n\nSuperfine has a very interesting dessert menu. We ordered an ice cream dessert that was pretty complicated. The waitress kind of lost us halfway through the paragraph long description, but it was very, very good. Two scoops of a homemade, citrusy ice cream on top of a double espresso shot topped with a tiny puff of very light whipped cream and some cinnamon.  \n\nOn a side note, I love the random sparkly touches:silver foil stars hanging from part of the ceiling, red glittery flame designs on the bottom of the doors and a curtain of long red tinsel and beads serving as the door to the women's restroom. I may or may not have walked into the restroom just to pass through that curtain....;)\n\nI liked this place and I would come back. But I'd eat healthy all day before visiting and not stop by on the night before Thanksgiving!", "author": "S V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "I would say it was fine, but not super fine.  Drinks \u0026 vibe are good here, but I wasn't impressed with my underwhelming pasta.  Weirdly the menu is on a board, only there wasn't a good place to view it from where we were sitting so they passed it to us.  I guess it saves trees.  The cheese plate was pretty good, though. I agree that the layout of the place  is strange.  We sat on the high side of the bar, near the kitchen and also along the path from the dining room to the restroom, so it wasn't exactly cozy, but on the plus side, it was easy to flag down the bartender when we were above him.", "author": "Briana H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-06", "description": "It'ssssssssssssssss alright, I guess!  But don't dare order a Guinness here. I've never in my life seen such a badly poured Guinness--was it the bartender's first night? I mean, we're talking it looked like she had poured a Coca Cola! She was nice enough when my boyfriend politely asked for something in the bottle instead. My wine was drinkable. Nothing remarkable about this place, although I like the location and the decor (high ceilings, lofty place). I'd return, but I'm not especially chomping at the bit to do so, not when Rebar is across the street.", "author": "Joi B."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}