{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "Super chill, as expected in this neighborhood of BK. I was here for their happy hour. It was a delight and cheap! $4 Mermaid Pilsner and good service at the bar- what's not to love?", "author": "Valentina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "Hands down, this is my favorite place in Brooklyn.    Have been coming here for years and have never been disappointed.  Food is fantastic, menu changes daily, drinks are delicious and the overall vibe is really great.", "author": "Mike V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-31", "description": "I love superfine.  This is my after work drinking spot and I'm here at least once per week.  The bartenders are awesome and super friendly and the vibe of the location is great.  There is a free pool table and they have rotating local art on the walls.  \n\nIt can get a bit busy, and I'm sure some people have trouble getting the attention of the bartenders.  In addition, sometimes the beer taps leave a bit to be desired.  If they doubled the tap capacity and rotated some craft beers on those new taps (to match the wholesome and fresh rotating menu) it could really add a lot.  However, when you get used to this place it becomes a favorite.  \n\nThe burgers are great and the fries are incredible.  I haven't ordered much else though.\n\nThis probably should be a 4 star review, but the people who work there make it such a good experience and get to know you, so they're getting 5 stars.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-20", "description": "I like it, cool DUMBO vibe and had a decent burger, my partner's pasta looked appetizing as well.\n\nBar certainly worth checking out at night as well!", "author": "Geert D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-17", "description": "This place is alright. When rebar is closed for weddings on the weekends I like to go here for plan b brunch.", "author": "Joey S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-18", "description": "I'd say as just a bar this place would be great, the whole restaurant idea-not so good. I was here for dinner on Fathers Day it wasn't really packed but it was busy... I don't know if it's always there but there was also live music. Anyway the drinks are really worth the trip and it's a very lively place the food is just not good. I had their pasta which was under cooked, the sausage in it was burnt and over cooked and the sauce was blah if that was any indication of the rest of their menu I'll pass. I would go again but I'd make sure to eat first.", "author": "Mercedes L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-30", "description": "I wish I could leave a 4-1/2 star review, because I would--but because I cannot, I rate the place 4 stars.\n\nMy friend and I had planned to meet her fiancé here this evening, and we were quite pleased to learn that one of the proprietresses was going to hold a table for the three of us until he arrived.  We had a couple of reasonably priced beers at the bar until he showed, and then ordered from the absolutely friendly and jovial waitress with no issue at all.\n\nAnd then... we waited.\n\nAnd waited.\n\nAnd waited some more.\n\nIt was an hour and some odd minutes before two of our three entrées showed up--just two.  The third?  Missing in action, apparently.\n\nThe aforementioned proprietresses, however, were absolutely horrified to learn that one of our mains was missing, so they brought out a complimentary plate of assorted charcuterie to hold over that member of our party until her pork chop arrived, literally moments later, accompanied with profuse apologies.\n\nBasically our bill ended up being somewhere between a quarter and a third of what it should have been because of the number of comps we were given, but we were more impressed with how honest everyone was with us.  Yeah, stuff happens (it turns out there was a new, green chef in the kitchen who was having a really tough night), and we understood that, and we appreciated that we weren't lied to or jerked around.  It helped, too, that the food was fantastic--the pork chop was on the same level as a juicy steak, and the sea bass was one of the best I've ever had.\n\nIn any case I'll be back, without a doubt.", "author": "Ryan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "Had a lovely dinner with great service over the slow labor day weekend. Menu was thoughtful and delish - I gather it changes a lot but I had a hummus plate (lamb sausage and really lovely artichoke hearts stood out) and bits of several other dishes, including a generous cheese plate and really good bread pudding dessert. Good veggie options, really laid back vibe (maybe the holiday weekend, though, whole neighborhood was quiet). Beer list was a little uninspired and cocktail menu seemed pretty dated and on the very sweet side - had a nice glass of red wine instead.", "author": "Cs N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-22", "description": "I came here on a Sunday night with friends. We had pizza, eggplant panini, pork chop, grilled calamari, apple galette, and chocolate orbit cake--all of which was excellent. And there was live music (a folk-country band) that was wonderful! Will definitely come back to try the hamburger.", "author": "Jerome E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "Fantastic food, great atmosphere aside from the din. Drinks are delicious. You will spend lots of money.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "I came here twice . The first time my friends and I stumbled upon the bar and heard the loud hip hop and my friends were in love. They had a dj above the bar and the vibe was great. Being that we had such a great time the first time , we decided to go back for a friends birthday . We went and I realize there was a \"live performance\" about to play , and hear this band was playing blue grass music ?!? I have nothing against it but I was confused and it wasn't the same vibe from the time before. My friends were so disappointed , but we still enjoyed ourselves with the drinks , everything gets better when there are drinks involved . I might give this place another shot if they cut the bluegrass music stuff out lol", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-30", "description": "Came here for an early lunch on a Saturday. Place was nearly empty. The decor is nice with a pool table and very colorful, unique art. We had a steak sandwich, penne with sausage and spinach,and a burger. All were very fresh and tasty. Shoestring fries were very good especially with some garlicky mayo. Although it looked like a bar more than a restaurant, we (and three other families) found the place to be very kid friendly and the staff very accommodating.  A bit pricey but we felt we got our money's worth.", "author": "Tami W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-04", "description": "While I give this place 4 stars, I give their burger 10 stars.  One of the best burgers ever.  \nAlso a great space at a great location.  I have been here many times before with other food and equal feelings for the food as the burger YUM!    I strongly suggest you come here at least once if not many times.... for a burger or more.", "author": "Nathan V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-24", "description": "Nice cool place for a hang out and casual dinner. \nHad a pool table and the deco was dark and rustic. Pretty cool find. We were pleasantly surprised with atmosphere. \n\nFood was pretty decent too. They bring you a large board with menu instead of having printed menus. I don't think there was too many vegetarian options though. :(", "author": "Esther Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-16", "description": "I love this spot because it's neighborhoody and unusal and the food really is amazing.  Yeah, food can take a while to come out, and yeah, sometimes the drinks are a little slow to arrive, but where's the fire people?  Where, I ask?  This ain't Times Square where tourists are rushing to get to the theater after getting an early bird dinner special.  This is DUMBO, where the locals like to lounge and relax and enjoy the experience.  If you want fast, cheap, greasy food then I suggest sticking to your local diner.\n\n\nJust sayin'\n\nEvery single thing I've eaten here has been ta die for!", "author": "Dana T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-22", "description": "Another cool \u0026 funky Brooklyn eatery. This one in Dumbo, Brooklyn (Down under the Manhattan Bridge Overpass). This gentrified area has plenty of overpriced rental loft space available but it has become a mecca for artists \u0026 the culinary community.\nSuperfine has a nice vibe \u0026 bohemian spirit to it. Cool bar, pool table, pleasant alternative music as opposed to the annoying kind \u0026 an open kitchen. They even have live music on Sunday Brunch \u0026 at other select times. My husband \u0026 I went for Friday lunch \u0026 arrived at about 2pm. We were immediately told by the Manager that the other patrons that were seated all came at once \u0026 haven't gotten their food yet so it would be at least 45 minutes until we ate. Ooookaaaaay. We decided to stay. I have been in the business for over 20 years \u0026 the restaurant was NOT busy. The tables he referred to had about 12 Guests total \u0026 I really didn't think it would take that long but I was prepared. Our hipster Server in a Fez hat took our drink order fast \u0026 placed the menu board in front of us. They offer about 10-12 items with a Mediterranean flare that changes daily. They boast that about 98% of their ingredients are from local farms/artisans, are organic, seasonal \u0026 sustainable. Coolio. We sat right in front of the kitchen so I could hear the 3 cooks talking about the orders. They didn't seem rushed at all. The Server was nice \u0026 took our order quickly. My husband got a Coney Island Lager because they didn't have any seasonal beers (odd since they claim to be all over the seasonal thing) \u0026 I got a Ginger Ale in a nice big pint glass! I hate it when they give you a soda in tiny glass. It would have been nice to have a cooler soda collection like Boylan's or again something local. Howie got the Steak Sandwich with Mustard Caper Aioli \u0026 fries ($11) \u0026 I got the Superfine Hamburger on a brioche bun with fries ($12). We got our food in 30 min but other patrons did seem like they must have waited a lot longer. I also checked some sites like Yelp \u0026 Chowhound \u0026 Superfine does have a bad reputation for extremely slow service. We just got lucky I guess. Everything looked good \u0026 obviously was prepared with quality ingredients but was bland. People! You have to season meat with at least a good amount of salt \u0026 pepper before searing it. That's a big pet peeve for me. Also, the mustard caper aioli which I asked for on the side to dip my fries in (I know, REALLY healthy!) had absolutely no flavor. The capers could not have been in there. What a waste AND they charged me a buck extra for it without telling me. The really skinny fries were delish. Unfortunately, my lettuce, tomato \u0026 onion were buried under them so when I found them they were warm \u0026 limp. Whose grand idea was that!? Overall, Superfine was just ok but yeah, it was pretty hip.\n\n126 Front St\n(between Adams St \u0026 Jay St)\nBrooklyn, NY 11201\nNeighborhood: DUMBO\n(718) 243-9005\n\nSubway: York St (F), High St (A, C), Clark St (2, 3)\nHours:\nTue-Fri 11:30 am - 3 pm\nTue-Fri 6 pm - 11 pm\nSat 2 pm - 11 pm\nSun 11 am - 3 pm\nSun 6 pm - 10 pm", "author": "EJ S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-19", "description": "I love this place. The food is clean, fresh and really delicious On a recent trip there i ordered the salmon salad, calamari salad, a side of fries and 2 glasses of wine for me and my partner.\n\nThe calamari was lovely and tender, served on a bed of artichoke and cucumber! Refreshing, light and perfect for a summer night. THe salmon salad was beautiful. perfectly done. The fries were super thin and delicious. Both salads were appetizers but big enough for an entree! We ended taking the salmon home and it kept nicely for brunch the next day.\n\nThe service was on point, polite and made the experience wonderful. Will go back again soon.", "author": "Marie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-31", "description": "This is the first bar I've ever been to in NY, and I had a great time here :) The food and drinks here are both good, and it's a nice spot to come to after work. The bartenders are really friendly.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-16", "description": "Rudest hostess I have ever come across. Yelled at us for sitting down at a table (after standing in the front for 5 minutes in the cold and assuming it was seat yourself because the hostess was no where to be found) and then obnoxiously sneered and told us to get out of our table since we were looking for drinks and not dinner.", "author": "Lauren K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-16", "description": "Cool space and I like that they have a pool table!", "author": "Marie S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}