{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Loved it!  Went there for lunch...great vibe - food was delicious, service was superb!  Would definitely go again", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-28", "description": "Thee best Calamari I think I ever had. The pieces were so tender, and I love that fact that they were not fried.\n\nHad a couple of drinks as well, I thought the Old Fashion was just OK, and the Dark \u0026 Stormy was better.  \n\nA little pricey for drinks I thought.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "Things really are bigger in Brooklyn.  This spacious bar was a great spot for a group after a meeting.  The bar seating is small, but they have a ton of tables...plus, a pool table.  Laid back, but also with some distinctive decorative touches (table patterns, reddish lighting, etc.).\n\nA nice selection of beers (including a couple of local brews), cocktails, etc.  The music was good, and at the right level for making conversation.\n\nHaven't tried the food, but liked the space a lot.", "author": "Sydney B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-07", "description": "The drinks are very good.\n\nThe waitstaff, not so much.\n\nThe food quality, like the Dumbo arts community, is disappearing.\n\nI want this place to stay alive. I really do. My guess is that they are buying time.", "author": "Rachel J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-05", "description": "-1 star: Overpriced....I drank ONE beer to save my wallet.\n\n-1 star: Bad service...no one greeted us at all when we walked in....\n\n-1 star: Bad service (again)...bartenders acted like they didn't want to serve us; they literally avoided us like the plague...we only got served bc a dude on the other side of the bar had to tell one of the bartenders that we were trying to order...not throwing shots but my 2 friends and I were the only black people in there...hmph.\n\n-1 star: pool table was hogged all night...but it's free though....\n\n-1 star: didn't feel like I belonged there....not going to trouble myself to go back and try again. \n\n+1 star: DJ was playing good music.\n\n+1 star: met some cool people there.\n\nMaybe I'm spoiled bc I have a favourite lounge/bar, but I've never had such a bad experience....\n\nEver.\n\nThe. End.", "author": "Sierra W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-10", "description": "From the time we walked in the bartender was extremely rude...they have no food on mondays..weird..but not a deal breaker.. mostly just wouldn't come back because of the terrible service by the bartender..skinny blond girl.. forgot her name.. oh wait I don't think she even told us her name.", "author": "Patricia K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-11", "description": "Had an ok experience minus the bill. The hostess definitely stole money from the check looking back on it. We gave her $80 in cash and $80 on a credit card. Thinking about it the next day since I was drunk I realized she must've pocketed the extra $30. Since she wrote that we only have 50$ in cash on the bill. Stupid me was too out of it to notice.  Now checking my credit card bill I see I was charged another 25$ on top of the $80 I put down. Get rid of this hostess lady with the big hair. She's stealing your money and mine!!!!", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-30", "description": "Came here on a whim one summer night and was totally impressed by the live jazz band/food/and drinks! Atmosphere is so chill yet trendy. Great Dumbo spot", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-31", "description": "One of my favorite spots in the city ! \n\nThe menu changes every day with seasonal dishes featured... there is always an interesting mix of people at the bar where I usually sit alone to chow.. brunch is always great vibes with a live band and awesome menu... \n\nalways some cool art to gaze at on the walls, usually from a local Dumbo artist.. \n\nand of course Tanya and Cara Lee the owners are just wonderful and warm people who got to know over the years as I became a repeat and regular at this place. :) \n\nI live in manhattan now, but i still venture down to dumbo on sundays for their BURGER... so freaking good... thick and juicy with a mountain of skinny crispy fries !!! one of the best in the city !", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-27", "description": "Be AWARE of cockroaches! The manager and the barman were ignorant for that. Even-though the food was good.", "author": "George M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-19", "description": "This is by far, my favorite place for dinner in Dumbo when I am working late and don't want to cook. They have great food. The service is good and they won't bother you to leave. \n\nThe only drawback for dinner is it can get pretty noisy, so it is not the best place for a date or business dinner where you would be talking to someone. It works perfect for me, I use it as my kitchen away from home to grab a quick bite when working from home, so I am usually alone and bring a book. \n\nLunch time and brunch are not as noisy and often peaceful.\n\nI have lived in the area and been going here for many years, since they opened. The atmosphere is New York eclectic, reflecting the history of the neighborhood when artists used to be the majority of people living there. \n\nMy favorite is the pork chop dinner. It is a nice size portion and delicious! For the type and quality of food they serve the price is quite reasonable.", "author": "Anna H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-20", "description": "\"Wow\" is all I can say with regard to their burger ; The type of \"medium-rare\" goodness that invokes a sense of \"why did I agree to split this with a girl I barely know.\"    \n\nAs each bite inches you closer towards your sealed-fate of empty hands and plates, you wonder if you could use the free-hand to swipe the other half from your counter-parts grip.  But you don't.  Because Superfine is also about remaining...superfriends.\n\nEverything about it was bliss.\n\nThe setting is unassuming, but the lack of a black-tie does not imply a black-eye (see what I did there?) on the well-appointed menu tied together with organic and fresh ingredients. \n\nSimply a must if you are in the area, and with so much to do in the area, it is worthy of the trip.", "author": "Tom O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-19", "description": "Superfine is just that. Fine. Nothing really special. The beer selection is nice, but outside of that, the menu is lacking. They have decent options, but often their bar menu won't have a burger on it. That's just insane to me. Burgers should be a staple of every bar, and I don't think that's too much to ask. The other items on the menu get pretty expensive pretty fast.\n\nThe atmosphere is quite nice, though. It's a very unique space in a nice neighborhood. It's enjoyable if you're going to have a couple drinks, but outside of that, I'll find another place to eat.", "author": "Ross B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "Not bad, not bad at all. I came to Superfine to meet a few people, and was intrigued by the decor. Because I spend so much time in Manhattan, and a bit in Queens, too, I'm always open to being whisked away by Brooklyn charm. I am very into exposed brick, so I liked that, and the bar was cozy and nestled in a separate part of the restaurant, kitty-corner to the dining area. \n\nI had two very strong, very proportionate vodka cranberries. The people I was with had beer, and one had a martini. I know that my friend Bob enjoyed a Coney Island beer, but because of my lack of beer knowledge, that means little to me. He liked it, though, this I know. \n\nWe decided to stay at Superfine for dinner. I was really drawn to the red lentil soup - really good, and couldn't decide between a cavatappi or the mozzarella sandwich. The cavatappi had meat in it, and because I didn't know how they would respond to a substitution, I decided to get the mozzarella sandwich. Delicious. And homemade potato crisps. The second best thing to the food was that we sat right by the kitchen and could smell waves of garlic while watching food be prepared. \n\nI'm new to DUMBO restaurants, but would definitely recommend this location.", "author": "Alexandra K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-26", "description": "Breakfast burrito was the weakest thing I've ever eaten. Like a sock with cleaning products inside.", "author": "Terry S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-17", "description": "Not your average place. Luckily, I was pleasantly surprised. The food and drinks were really good. I had a Costmo which is a more detailed combination of my two favorite drinks, Grey Goose and Cranberry juice. That was very good. I also had the pork chop with mashed potatoes and a cabbage slaw which was delicious. \n\nOverall, Superfine is a cute hidden spot in Dumbo and if you're ever in the area, definitely stop by!\n\nPlease visit my blog http://simplypamarie.com/2013/08/28/superfine/ for further details and great pictures!", "author": "Pamela G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-26", "description": "Don't sit near the pool table. It's so filthy dirty, it probably makes you sick and your food poisoned.", "author": "Steve H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-19", "description": "The ambiance is great and very DUMBO. I love the live music and the bands! We were there last Sunday for brunch. We walked up the ramp but there was no hostess stationed there. We waited and there were other servers around who were walking by us and saw us waiting but didn't say anything. They could have told us that \"Someone will be with you shortly...\" but no they just ignored us. \n\nThe food was ok. It was on the expensive side and small portions. I ordered the fish tacos and they only had 1 corn tortilla vs. the traditional 2 layered corn tortilla taco so by the time it got to me and i picked it up the taco fell apart. It was all soggy. The steak was cooked well but on the smaller side.", "author": "Til T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Came by the other night around 10:45pm to have a late dinner since their kitchen was open til 11. The decor was cute, all decorated for Halloween. \n\nMy friend and I ordered the grilled pizza and calamari; not a lot of food but it was really good. I also had their margarita which was way too sour. We shared the earl grey creme brûlée which was good but nothing extraordinary. \n\nI did like that they had a pool table and I saw some people playing dominoes when I got in. Cute place.", "author": "Vicky V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "What a cool eclectic place in DUMBO. Yelp app say it's closed from 3-6 but it's only the kitchen that is closed.", "author": "Bar F."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}