{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-22", "description": "Avoid at all costs. So many better places in DUMBO.  Let's start with the nearly 45 minutes it took to deliver the food... most of which had been prepared incorrectly (including an ingredient that one of my friends has a deathly allergy to) and barely edible.  Waiter didn't check in once... had to take water, napkins, hot sauce from another table.  When we noted to both the waiter and owner that we were uncomfortable with experience they both really didn't seem to care... owner took $5 off the bill as compensation.  Really?", "author": "Thalia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "Time and time again at New York City restaurants, the art of hospitality is completely missing, but I am happy to say that at Superfine they really know how to make you feel right at home. I was supposed to have a birthday gathering of about 30 friends in Brooklyn Bridge Park and low and behold it was pouring outside.  So we stopped by Superfine about 20 minutes before the party was supposed to start, to see if they could accommodate us instead. They welcomed us with open arms and did everything they could to make my birthday special. It was truly an extraordinary thing, and every one of my guests was marveling at how this restaurant went out of their way to take care of such a large party on such short notice. Thank you, Superfine!! You have about 30 new big fans of your restaurant!!", "author": "Beka B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "Huge kudos for getting us in and out quickly, as we were under time pressure. The pistachio martini, cherry rum soda strong and delicious. Great quality food, varied tastes on the menu. The pork was dry and chewy. Fish, beef, veg pasta, beet salad, calamari were superb. We would return!!", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-24", "description": "Drinks were amazing, staff was so friendly, AND the hummus plate was killer. The decor is cool- artwork changed from the last time I was there which is always exciting. Have only been on sunday afternoons but I'd like to see how the crowd is at night.", "author": "Caitlin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-13", "description": "The food is delicious, and they have a great happy hour until 7pm or so I think where well drinks are $3.50. Plus they have a pool table, which I'm a fan of. Only problem: they're closed on Mondays and many a monday I've forgotten that and wandered over there after work.", "author": "Emma M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-02", "description": "Been coming here for years, mostly because if you live in Dumbo you have about 4 choices of places to eat - at least one of which is always closed for a wedding or private party. This place is ok. The food is ok, the service is ok, but lately it's just not been worth it. Came with family a few weeks ago - there were several open tables but they seated us at a cramped very dark table butted up against the kitchen/corridor. Not the most comfy with my elderly in-laws so we left.  Tried to get brunch today was told wait would be 1/2 hour at most because we didnt have reservations. Sat there as group after group came \u0026 got seated because they (I'm assuming) had reservations - kept checking in \u0026 though they were apologetic saying we were next - several times, over an hour passed before we decided to leave - why not just tell us we wouldn't get a table? Went to Almar \u0026 was treated well \u0026 seated quickly.", "author": "Lisa K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-07", "description": "The location is great, I really like DUMBO and there are plenty of things to do there. The decor is really cute too. It's a large, dim space for dinner and drinks and they have pool tables and a long thin bar in the front, giving the place a warm, snug feeling.  i felt really good about coming here, even though i had meant to go to another place in the area that was full because of the vibe. seemed really chill and the people that were there were not the usual snobby manhantanites i am used to. sure there are some hipsters here and there, it is DUMBO after all, but i personally will take hipsters over yuppies any day.\n\nBUT... when we entered with smiles, excited about the meal we wanted to share, a girlfriend of mine made the mistake of asking the host if we could sit at a tale she did not suggest.  the host said, \"you can sit here or here.\" and my friend, which i later realized had made a fatal mistake answered, \"can we sit in the corner over there?\" she was not rude about it at all. if you knew her, you'd be surprised she requested a different table at all. the host however, then said, \"oh, this table isn't good enough for you? that's ok ladies\" and then left.  i felt kinda weird about the whole thing but shrugged it off.\n\nlater, the waiter was very nice and pretty helpful, but he disappeared for a little while after we ordered a bottle of wine. i think he was disappointed that we chose the least expensive one, though we really the true reason was because we wanted a red italian.  it took a litte longer than expected for him to return afterwards but i was willing to forgive that. the meals were really very delicious and i appreciate places that purchase locally grown and organic food whenever possible.  however, he made us feel really guilty about ordering dessert because \"the kitchen was closing soon.\" i work at a restaurant and we start up and keep the dessert station in later because a lot of ppl order dessert after their meal, which can potentially finish around the time the rest of the kitchen starts closing down. we actually said, \"it's okay if you can't. we'll just take the check if not.\" but he returned with good news for dessert from the kitchen.  my friends hurrayed but once again i was iffy.\n\nthe desserts came and they were actually not very good. i'm incredibly easy to please so i thought maybe i had heard the description wrong. the desserts were also sold verbally, so there's no real way of knowing what's really in them or how much they were. but of course i didn't complain because it's just not my thing. plus, i hate making ppl that serve me food feel bad about it. it's a hard job sometimes. so i let it go.\n\nnow the check comes and here's the zinger: i am american but 2 of the 4 of us had european accents. one of the girls is german and the other was austrian. though i ended up paying the check for the 4 of us, the waiter put s 20% gratuity on the check automatically. i know that this is not standard for a a party of 4. i go out to eat a lot and this has NEVER happened to me. i'm an amazing tipper, if i do say so myself, and my bf, who was with us, always scolds me for it. however, i didn't have the balls to mention this gratuity to our server. i just paid and left. i would have left him at least that much anyway, just cuz he made us feel so bad about dessert, but i will avoid this place with a passion from now on.\n\nleft a bad taste in my mouth.", "author": "Karen O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-05", "description": "This is what I call a rad place. I feel like you could use it as a set for an 80s club/lounge with Flock of Seagulls blaring through the sound system (it got dangerously close to that, although the DJ had a fair mix of just older records). I love the set up of this place, when you walk in, the first thing is, you can see everything. It's Dumbo, I mean it's just a huge space that's busily divided into parts but everything is viewable, thus making for a great place to always be people watching. Restaurant is in the back, to the right is the free pool everyone's talking about, complete with loungy seating, the left is the bathrooms, and in the middle as you walk in, after taking in the brick walls, mod art, etc, is the bar. It's a normal bar on one side, but there's also seating behind the bar elevated on a walkway, so you can order up there as well. The DJ is front and center behind the bar. Everything is separated by railings and what not. I got there just as some fellow Yelpers, Roderick, Audrey, Javier, Michelle, and Srini were finishing up their dinner. And I got to drinkin. And then we were spotting the wig party (I doubt it was for the Whig Party back in baby-era US) and the lone desperate girl who puzzled me as to why she was there; she felt at home enough to make me think she frequented the place or was friends with the staff, but awkwardly grasping at things, guys, the DJ's ass, dancing with nobody, to make me thing there was hilarity afoot. There's live music certain nights, as the elevated back tables/booth in the restaurant area can be cleared out to make a stage. Sounds like greatness to me.\nDUMBO was always an intriguing area to me, I'll definitely now have something I can always go to if I'm in the area for any reason.\n\nUPDATE: something I just remembered about the \"desperate\" girl. I was looking over to check up on her from our vantage point at a table. What I saw was what TBS would call \"farkin' hilarious\". There was a man would was by the DJ booth, and she was there sorta dancing/swaying a little, but looking to talk to him. \nHe literally turned away to walk toward the bathroom, and she grabbed him from behind, full grab, both arms wrapped. What made it funnier is because she was fairly short, and he was tall, so it kinda looked like she was falling as she hung on.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-15", "description": "I am admittedly biased about superfine,Ii started coming here when the girls opened it, it was one of the only places in dumbo to go.. Whey had the foresight to make to todays Dumbo.  We come on Sundays for brunch with the baby and it is fun, food is of very good quality and well made. Love the pork chop medium rare and several other of thier dishes.  I admire that they left the basic layout of the interior intact , but goofy stuff like historic value is important to me.  The staff there is friendly amd helpful. And the pool table is level, sticks are straight for the most part .......  and it's free.  Chaaa\n\nI love this place and the people, and I  am not the easiest guy to please.  As my friends amd family will attest\n\nIn fact i just finished my steak sandwich and hoegaarden. Cheers!!!", "author": "Peter O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-24", "description": "I had my first dinner at Superfine the other night and was blown away.  I've always loved brunch there (despite the staff making sure that the live band is always so loud your ears bleed and the Kafkaesque experience of waiting for a table), but dinner exceeded all expectations. The food was awesome, wine was great, service was kick-ass and the cool space is even cooler at night.", "author": "mark s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-14", "description": "The only reason this place gets the 4 stars and not the coveted 5 from me is because of the bitchy, rude hostess.  Now I don't think it was intentional nor do I think it was malicious but she was rude and shot none-the-less.  Either way, once seated and drinking, the food was AMAZING. We eat out a lot so for me to say the pork chop was great is really something.  We started with a nice bottle of Rioja - then a lentil bean and spinach soup - definitely odd but once I got used to the textures, it was good.  She had the house salad - totally average, nothing to write home about.  Then the entrees: pork chop and spaghetti - mine was fantastic - from the buttery mashed potatoes to the cole slaw, everything on my plate was gone.  Her spaghetti was above average but nothing special.  Finished with the chocolate cake.  From the cool, dark, bar-like decor, to the loud, open air space - we liked it all.  Maybe not the best place for an intimate dinner but for the two of us, it was nothing short of fantastic.  We'll definitely be back.", "author": "Joe O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-20", "description": "I actually really like this place. It's in the heart of DUMBO, very loungey and they have their own home-made flavored vodkas. Haven't eaten there yet  [yes I'm a lush], but you can meet some really interesting people, hang out on the couches, or play pool--that is if you make the trek out there although it's really not that far.", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-01", "description": "amazing brunchness to be had at superfine. \nsadly, ive yet to eat dinner there, but its a super place for brunching. \n\nfood is good, staff is friendly, the space is bright and airy and when you have to wait for a table, theres a pool table near the hostess stand to distract you.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-11", "description": "I work in the navy yard and was a patron (lunch and evenings) but you lost me tonight.  Entered with visiting guest and your waitress rudely turned us away, telling us to wait in the front while the tables were cleaned.  We waited, and never seated, although plenty of tables were open on a slow tuesday night. I was embarrassed.   Thank your service.  Never again.", "author": "C W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-16", "description": "Nice people and vibe but the food is just not good. Why not keep it simple with some good bar food?", "author": "Jason S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-28", "description": "Went during the Dumbo Arts Festival, so had a bit of a wait (as there aren't all that many options in the area anyway).   The hostess, bartendar and waitress were all really nice.  Was a good, eclectic crowd.  The female DJ was playing a fantastic mix of music from every decade.  Great drink menu.  I had the steak for dinner--it was surprisingly good and the flourless chocolate cake was sinful.  Had a good time and would definitely go back--even with another wait, and thats saying something.", "author": "Kathleen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-31", "description": "I love these awesome cowgirls and the life they breathe into DuMBO.  This place was in a divey bar some years ago, and it seemed like such a long shot that they could pull it off, but they sure did, and now have a ultra amazing outfit complete with bluegrass brunch.  The cocktails are great and the specials are always worth a try.  Many characters at the bar, on the staff, or wandering around outside.  Highly recommended.", "author": "Dave S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-25", "description": "After Famous Fat Dave gave us a food tour. I asked him to drop us in DUMBO. Super cool area. This was a great place to have a drink. The train is right up the street to get back to Manhattan. Awesome", "author": "Chelsy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-31", "description": "Food is good, great atmosphere. They have really good trad jazz musicians playing here occasionally.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-09", "description": "Superfine...how do i describe thee?Anyplace were you can get drunk and play a game of chess(yes they have a set) is fine by me.\n\nHeres the deal, its an amazing spot to hang out with your friends, the whole decor reeks of an NYC show shot in an LA Lot then transplanted to DUMBO, which is terrific, kinda like if the cast of Friends visited a bar as much as they had coffee, thats what it would look like.\n\nMy first time there i thought it was the coolset thing in the world because of the lack of menu, everyting is written on a board and carried from table to table. Price for the food is decent, not cheap but not bad either, but then as soon as you set yourself up for a really superfine(enjoy the pun?) meal you are dissappointed. The food isn't exactly the best, and the portions are small, espcially for the price you are paying.\n\nDon't EVER order the salad, its...i shit you not... just lettuce and the best part, it costs you $12, lol. My friends and i crapped our selves when that happend. \n\nMinus the often poor tasting food, Its really an awesome place to hang out, and nothing beats the freel pool table, the drinks are pricey, but the tap beer is pretty cheap.", "author": "Abby L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}