{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "I went here for brunch on a Sunday. The BEST huevos rancheros I have ever had. And the live bluegrass band, \"The Mayor of Goodtimes and the Bleeding Hearts\"... adorable... if a little immediately on top of our table. The guy on the upright bass was obscured so that you could only see his face. He had this distracted, slack jawed countenance and was staring out the window while he played... I kept thinking 'wait, who is that guy behind the band? Is he fixing something?'.", "author": "M B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-18", "description": "Very cool spot. Large space. Pool table. Great sandwiches and special entrees and soups. Nice staff. Very unpretentious. Cool hangout spot.", "author": "Elizabeth O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-09", "description": "If you're fortunate to live in New York and its boroughs then you're fortunate to live next to some of the best bars and restaurants in the country. Superfine is not one of them. Even if it lost the 'Super' prefix, it would still be over selling itself by a mile. The service is a pitiful. The bartenders rude. The layout is terrible. Yes, it has a free pool table but it's decrepit and no fun to play on. In short, if you're in DUMBO and in need of a drink, head over to 68 Jay St. Bar.", "author": "LJ C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-31", "description": "Menu uses fresh and organic food found locally mostly. The homemade sausage is amazing. Got the chicken last night (yum) because the side dish was marscapone mac and cheese- heaven.  Interesting beers revolving on tap.  Had the fire island ipa and loved it.", "author": "Liz F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-06", "description": "It's a bar ... it's a restaurant ... it's a music venue ... it's ... Superfine!  It suffers from trying to be too many things at once.", "author": "Nate S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-09", "description": "Cute space. Standard weekend brunch menu. Yummy food. Great cocktails - especially the Red Hound.  Stunningly rude and obnoxious hostess.  I probably won't be going back.", "author": "Jen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-02", "description": "Superfine was pretty super fun but wished the food was half as super good. In short, the food was OK, but nothing certainly to clamor about. The paper napkins was probably the hint that this place was going to be stellar. Don't get to DUMBO much so I suppose it's a good option. The fun piece of ritual they have is placing the chalkboard menu on a seat next to you upon making a decision. So we just treated the menu has a fifth member of our table. They have a bar in the front with a pool table which makes the place an option for small get togethers.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "Maybe the only solid bar in DUMBO: free pool, killer happy hour. They serve lone star, it is good.", "author": "Damien G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-17", "description": "not sure what is mediterranean about this place? i don't know where to begin -- the culturally appropriated name of this bar/restaurant? or perhaps the rude wait staff? i actually had to explain to the waitress last night that i came to (a restaurant) to eat, when she asked me if everyone at my table was eating when i told her i was ready to order. seems like a no-brainer that that is what we came to do. or how she tried to explain to me how she puts in the order. if i wanted to know how waitresses put in their order, i would have gone to waitressing school. or perhaps she thought she was teaching me some manners by telling me she \"needed to take drink orders before food orders\". this was after we were rudely sent back to the hostess stand (where no one greeted us or was there to seat us) after we attempted to seat ourselves (only to end up back where the hostess had shooed us away from). absolutely, incredibly, rude. and when i finally tried to make an order at 9:00 pm mind you, they were suddenly \"out\" of everything i selected on the menu. absolutely absurd experience. i left after the waitress rudely threatened \"if you want to convince everyone at your table to leave and take your business elsewhere, that is your choice\" -- out of nowhere. i am from the mediterranean, this service was complete shit in comparison to the hospitality i've experienced there. to have this place under this category is a disgrace. i believe the waitress was racist and should be let go (but i also believe she will eliminate herself with her own stupidity). i will be forwarding this review to the managers of this restaurant. absolutely unbelievable.", "author": "T S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-15", "description": "It was a lovely day for a bikeride and checking out DUMBO, but Superfine's brunch was totally Super-bad (and not in a good way). \n\nIt's a great space, and loved the bluegrass. BUT I don't think we're going back anytime soon.  \nwe made our reservation at 11:30, understanding the band would go on at noon. They didn't start showing up til noon, and so we didn't hear much music. \nMy husband had a very nice omlet. Small, but that's fine. \nThe Huevos Rancheros on the other hand were a cheap mess. Tossed a couple of bad tortillas on a plate, slopped on some insanely watery chiles, add flavorless pintos and topped with two scrambled eggs. The tortillas were a soggy inedible mess. The whole plate was so watery it could have been served as soup, and the beans were nothing I couldn't have microwaved myself. I was tempted to send it back (and I NEVER do that). Instead I left a note on the back of the check, which I'm not sure they saw. \nAlso -- they cleared our plates so fast I had to hold on to my coffee cup (they took my spoon), and we had to constantly ask for refills. \nWe gave our credit card, and the hostess literally threw the check and plastic holder on the table as she strode past.", "author": "Anne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "adorable, fun, friendly place with simple but inaginaitve food and great music.  The staff can be it or miss (some can be a little surly) but they always have great beers on tap and fun peeps", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-27", "description": "How can you give Superfine a bad review??  Everything we ate was perfect! I would come back here in a heart beat. Each dish was perfectly seasoned and salted and so fresh! Probably one of the best grilled squid dishes I have ever had.  A lovely small selection of wine as well. My only negative comment is that it is very loud. Stop reading this and Go eat there!", "author": "Mona L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-09", "description": "their steak sandwich is to die for. thinly sliced teak, very tender, watercress and mayonaise dijon mustard with their thinly sliced fries. all in a nice panini bread. i work near by and this has become our friday spot. and when we go, everyone orders the same dish. it's that good.", "author": "Melvin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-09", "description": "The place lives up to its name\n\nHands down, Superfine is my favorite joint to hang out.  IT ROCKS.  If you want to meet people who share a GENUINE interest in tasty food, local art, hot DJ mixes, and shooting free pool .  Look no further for like minds.  \n\nYou will get a taste of Brooklyn culture for real.\n\n\n** PROS ** \nfantastic space for dining, drinking, dancing (on some nights) and free pool table\n\n** CONS ** \ncan't think of any\n\n** EXTRA **\nLive music occasionally", "author": "Vee O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-09", "description": "Cool spot...I would go back, but they really need to find some new bartenders here.  They have such a nice bar....seems a bit of a shame.", "author": "Vini A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-13", "description": "Nice decor... But the food is not great and the service is bad. We had just finished our plates and were considering sharing some desserts...and a waitress came to tell us that it would be great that we leave as the table was reserved! Ouch", "author": "Barbara H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "excellent food, drinks, and fun atmosphere...i'm new to the neighborhood and had fun the 2 times I stopped in.  pool table is a big plus for me.\n\nglad to see it doesn't get too packed on the weekends....and that somebody in the area is doing it right.", "author": "David T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-15", "description": "This was was pretty good, the staff was a little questionable (we had to request more drinks even though all of them were empty).  The atmosphere was great, loved the building and the funky-ness of the furnishings.  I loved the old pool table.  We had brunch there and the special pancake of the day was an apple pancake and they were delicious!!  I will definitely make a trip over to Brooklyn next time I'm here to eat at this place.  Price was decent, food was great.  Loved the whole thing.", "author": "Jess O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-16", "description": "Very Ironic name for this place, as we had a terrible, stressfull experience there. We happened in for a bite before a movie. First off- the bartenders are experts at ignoring their patrons, as it took nearly 15 minutes to get their attention and another 10 to get a bar menu (they have one menu for the entire bar area. 5 Minutes AFTER we ordered, they informed us of a back-up in the kitchen. When we explained our time constraints, they assured us the food would be out in 30 minutes max so that we could make our movie. 50 minutes later the salad came- some lettuce on a plate. When we told them we were leaving and to cancel the rest of our order,  two dishes magically appeared. It was too little too late, and we ate quickly and canceled the rest,  leaving hungry and irritated.  The food, BTW,  was medoicre at best.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "I heard a lot about Superfine, but had never been there until I started planning my wedding there last fall.  Due to unfortunate circumstances, my fiance and I planned our wedding in 2 1/2 months.  We had to change our venue, and after hearing our story Tanya became committed to having our event at Superfine.  We felt cared for throughout the planning process, and on the night of our event (12/3/11) things came off without a hitch.  It was the only place we had not done a tasting, and the food was fantastic.  The staff was kind and attentive, and people commented all night on how perfect everything was.  We could not be happier with how things worked out, and we are so happy that we ended up having our event at Superfine.  Incidentally, throughout the planning process we had brunch, dinner, and drinks at Superfine and we loved it all!  Truly great food, great service, and a beautiful space.  Highly recommend.", "author": "Caitlin B."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}