{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-02", "description": "Besides Bo's artisan caramels, the sandwiches are great, the burger is a generous portion worthy of New York prices. Very good casual bar where you could easily spend the afternoon.", "author": "Robert C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-23", "description": "Slow service and apathetic wait staff. Come on guys, you can do better!", "author": "Elyse L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "Stopped by for dinner with a few friends after a riveting presentation about bed bugs.  The space is pretty cool - big open space with different areas and brick walls.  It was Friday night and it was a bit loud, but not so loud you couldn't hear the person across from you.\n\nSo instead of individual menus, they bring a big dry erase board with the menu.  It's a little bit weird but not a big deal.  I wonder if the waitresses get tired of lugging that thing around.\n\nI had the Beef Short Ribs and Polenta.  No complaints here.  The short ribs were tender and tasty.  \n\nI'd definitely come back if I was in the area.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-02", "description": "Literally the worst service ever. I've walked out of there twice. It's too bad because the food is good. I waited an hour while they served every other table but ours and asked them to check on our food twice. I've had to get my own silver wear, ask the bar for a drink after asking my waiter four times. The lunchtime waiter must be high. He literally cannot remember a thing.", "author": "Emily S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "I was looking for a place that had a cozy atmosphere where me and my friend could catch up and of course had good eats and drinks. It was all of that. \n\nI got the steak \u0026 fries - it was delicious. My friend got the sea bass - he said it was good, but it seemed a little on the small size for him. Dessert he got the green tea cream brulle, I got the pecan tart - both delicious. Their drink menu was pretty extensive and the bartender did a really good job mixing. We ended the night with a cheese platter - that was the only part that wasn't so good. Cheeses weren't up to snuff for a cheese plate. \n\nWe ended up staying for 5 hours between talking, drinking, and eating. We went on a week night (Tuesday) around 7pm - not a bad crowd at all (we also closed down the kitchen ha). Completely recommend that you go to this place if you want a place to chill with friends! :) It was superfine!", "author": "H F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "Cool space, interesting concept. Found the drink prices reasonable. Was there last night and the crowd was a bit too douchey-Manhattan types made of plastic. Definitely will revisit!!!", "author": "BK D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-29", "description": "Name - 3/5\nPasta with sausage - 4/5\nPizza - 4/5\nBroad bean salad - 5/5\nIsraeli couscous - 5/5\nhangar steak - 5/5\nservice -4/5\natmosphere - 4/5", "author": "Ben M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-29", "description": "My boyfriend and I went to Superfine after wandering into DUMBO having planned to eat at AlMar.  There was too long of a wait at AlMar (it was a Thursday evening), so we strolled a little farther east to Superfine.  \n\nSince it was a Thursday, it was a superloud, superhappyhour time there, so it was almost intimidating to walk back to get a table.  Once we did, it was just a bit louder than you want it to be when eating dinner with your significant other, but it wasn't awful.  The noise gives a level of privacy, in some way.\n\nWhile the service was extremely friendly and the bar area was clearly a great time (although the crowd was pretty homogeneously hipster/Williamsburg-esque types...nothing wrong with that, though), the menu was just too limited for my taste.  Nothing was particularly creative on the menu, although they were mostly classics.  My boyfriend and I shared the grilled romaine salad, which was delicious with midnight moon cheese (to die for).  I had spaghetti bolognese, which I would never order typically, but there wasn't anything else on the menu that jumped out at me.  My spaghetti was absolutely delicious, I will say.  I was just confused as to why the entree menu was limited to 2 pasta dishes, pork chops with mashed potatoes, and one or two other options.  It just wasn't telling me a story about the type of food to expect and if you're not into those few options, you're SOL.  They also felt overpriced by about $5 per dish.\n\nOverall, I'm glad we came in because this is a fun place, but I don't think I'd return for dinner unless I happen to need food after a rowdy happy hour at the bar.  There just wasn't enough inspiration there to make me feel the need to try other dishes.", "author": "Lily E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "I've only been to Superfine a few times but am set on returning when I can. \n\nThe space itself is really great- open and inviting while still intimate. It also doesn't get overly loud because of the layout. \n\nThe happy hour deals are most excellent and the bartenders are attentive and really good at what they do. I suggest ordering a pint of Coney Island Lager and getting your butt whooped during a friendly game of pool.", "author": "Whitney J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "My boyfriend and I found this restaurant by accident and I'm so glad we did. Everything was amazing! Service was great. The waitress was so nice and attentive. Food was delicious. We started with an appetizer, Tovy's green salad. For our main course, my boyfriend ordered the pork chops and the side of mashed potatoes was the best I ever had. I ordered spaghettini which was also delicious. I \"cleaned the plate\" which I usually never do. The food was so great that we decided we would be missing out if we didn't order dessert so as a result, we ordered chocolate flourless cake with coconut sorbet. All I can say to sum up our experience is \"perfect\"! I almost forgot the love band was definitely a great \"bonus\". We can't wait to visit this establishment again.", "author": "Colleen K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "Who doesn't like this place? Pretty good food and decent if loud atmosphere. The kitchen gets a bit backed up around lunch time but otherwise there is little not to like about Superfine.", "author": "Will K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "Came here for lunch with coworkers and I absolutely l o v e this place! Love the Grass Fed Beef Burger! It was amazing...probably the best burger I've had in a while. While I'm not into shoestring fries, those were good as well.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-18", "description": "Cool location. Kinda ... Me and my cousin couldn't get over the fact that the projects were a few blocks away. \n\nSuperfine has this cool and trendy vibe. There's a pool table located at the front of the restaurant with black leather couches surrounding it. It's a nice touch.\n\nWe came on a Sunday and it was busy. We told there would be a 20 minute wait so we decided to sit by the bar. I didn't mind at all because it turned out to be a cozy seat and we were overlooking the entire restaurant. What I loved: the Grilled calamari. It was delicious, light, and served as a great appetizer. Side salad was a drag. They literally just piled a bunch of lettuce on top of the plate and served it to us. \n\nMy burger was super tasty. What WASN'T super tasty was the 45 minutes we had to wait for it. I was beyond starved by then. Maybe it's a tactic of theirs to keep their customers waiting for so long. Then again, the kitchen is tiny and I think they had like 2 cooks there. Either way, I thought it was really good and liked the sesame seeds that coated the bun. I grabbed a few of my cousins shoestring fries, which were OK. They would have been better if they weren't so soft. Oh yeah, and if they were FRESH! They probably sat on the counter waiting to be served. \n\nWhat was reaaaaaaaaaallly good was the Orbit Chocolate Cake with Whipped Cream. Yum. \n\nJust wanted to make a comment that the bartender was VERY attentive to us. He filled up my cup of water without me even have to ask for it and was always there when we had any questions or were ready to order.", "author": "Helen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-22", "description": "The space at Superfine is fun...industrial look, funky decor, high ceilings, a bar that's not too crowded, and a separate dining and lounge area.  There's even a pool table, which makes Superfine a super fine place to hang out with some friends.  I just wish they'd lose the mismatched kitchen tables and chairs in the lounge area and replace them with mismatched comfy couches.  \n\nThe drinks are reasonably priced and the bartenders are trendy but not in an unapproachable way, which I like.  Brooklyn can overwhelm me sometimes. \n\nIt only gets three stars...for now...because I haven't tried the food yet.  An update to this review will come soon!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "Their food is amazing and they're open late. What more could you ask for...", "author": "J D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-01", "description": "Believe the hype! Comically passive aggressive and inattentive hosts, servers who disappear, food that takes a looong time to arrive and is fine when it does. The calamari was actually quite good but the chicken thighs were just okay and the focaccia plain. Not a horrible experience but not one I'm eager to repeat.", "author": "Nota R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-30", "description": "Three of us went here when rebar was closed for a private party. I'd heard good things about it, and it seemed others had too, since the place was packed. But now I'm scratching my head trying to figure out why it's still open, as the service was so atrocious that all three of us thought we must be having dinner in the Twilight Zone.\n\nWhere to even begin???\n\nWhen we came in the host/manager was hunched over in a chair. I felt like we were waking him up from a nap; he seemed surprised and disoriented to see us. After being seated next to a window with a lovely view of the giant dumpsters right outside (not sure if the venue has heard of a thing called a curtain), we waited for about twenty minutes fir someone to come by and take our drink orders. We asked for a glass of wine, a draft beer, and a cocktail. The wine came out right away, but fifteen minutes later, the other two drinks were still MIA. Mind you, one of them was a DRAFT BEER.\n\nIt was difficult to flag down any of the servers, who were dressed as if they'd all pulled their outfits from a Buffalo Exchange grab bag. They were all kind of just meandering about, not waiting on anybody. Correction: one young man was all over the table next to us, crouching down by their seats and chatting them up like crazy. But that seemed to be because they were his visiting family members.\n\nWhen we finally got to inquire about our drinks, we were told the holdup was due to the bar being so busy. We looked over at it and there was ONE PATRON who was, naturally, being ignored.  I think the truth is that the staff had forgotten about us, because the beer and the $8 cocktail, which was basically lime juice in an egg cup, appeared just moments afterward.\n\nAlthough we were there for dinner, we still didn't know what we wanted at thus point,  because food menus were nowhere to be found. When someone who we hailed like tourists trying to get a cab in the rain at Herald Square finally came by to discuss meals, we learned why this was. After disappearing for an unsurprisingly long amount of time, the guy brought over a white board on which a few food items were scrawled. He propped the board on a chair, and promptly vanished.\n\nSo we're eyeing this \"menu,\" when we realize the appetizers are basically the same price as the entrees. Curiouser and curiouser. Once our order was taken, we (and this was a shocker) had to wait about forty-five minutes for our food to arrive. In the meantime we struggled to talk over the embarrassingly hokey band playing behind us. When the band's set was over, some woman who worked there actually hopped onstage and announced that she would be passing around a costumey top hat so that patrons could drop in dollars in order to pay them. \"Superfine will be chipping in too,\" she announced. Uh... Yeah, they'd better! Because a place that's charging $13 for an appetizer, $8 for a shot of lime juice, and spending zip on their menus (I don't care if the menu rotates, it still doesn't belong on a tucked-away whiteboard) should be able to pay their own subpar musicians!", "author": "Bethany B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-30", "description": "For many people a restaurant with live music, good food, attractive décor and in a hip neighborhood equals 4 stars.  I have to give it only three because there exists a small few, my husband among them, who loathe live music.  What? You say.  It can't be all live music.  It must be rock, or jazz, or funk, or really saccharin sweet female folk singers.  No.  He hates them all.  For all the Whos in Whoville who aren't my Grinch husband, you'll probably be pleased to know that Superfine in Dumbo brings in bluegrass bands every weekend for brunch.  \n\nSuperfine is a place that for many would be a four star eatery.  Their menu is determined by what's locally available.  The scour the farmers market and whip up a menu based on what they find.  Dinner is so variable that no printed menu exists - they hand write a new one each day.  Brunch is a bit more reliable, as brunch foods are fairly steady.  They have fish tacos, heuvos rancheros (with hatch green chili!), pancakes, a breakfast burrito, etc, and all are quite good.  My music-hating green chili-loving husband declared, \"This is good!  Let's make this our new brunch place!\"  But what about the music? I asked.  \"Oh, yeah,\" he said, thinking it over for a bit.  \"It's okay.\"\n\nVictory!  Superfine, you melted his Grinch heart just a little.  And for that, you are truly worthy of your name.", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-19", "description": "This is an interesting place in a good way! I discovered this place long time ago but it was super packed and the recent trip to dumbo, I decided to give them another try. \n\nWe had group of 6 people arrived around 12ish. it was EMPTY, i guess dumbo people don't eat brunch until late afternoon. This place is very hidden, no sign but once you open the door. it's super spacious ! \n\nI don't know if they change their menu everyday, but our menu was written on a whiteboard and you just order from the whiteboard.  I really enjoyed the atmosphere and brunch ! \n\nI know the fact they open the \"GATE\" in the summer time for a more open feel. i can see it's a great place for date, small/large group or just grab few drinks !", "author": "Lucy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-06", "description": "Sunday bluegrass brunch is the way to go! My band has played here many times. It's always noon to 3pm. Tanya and her team do it up right! Get the breakfast burrito with green chilis from New Mexico! Also, the big bloody mary's are potent. I always go to the candy store across the street afterwards and on nice days take a walk in the park a few blocks away under the brooklyn side of the manhattan and brooklyn bridges.", "author": "Leah L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}