{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "Imagine, if you will, finishing your final exams, and seriously needing a glass of wine. A friend offered to buy me a congratulatory glass here, and so I went, every weekend, consecutively for about 5 weeks. \nSince it was in December, and freezing, the only downfall is that since I am not a resident of DUMBO, the transportation was a bit of an issue. The F train is a few blocks away, but c'mon. It's almost 4 AM and you're drunk from the conversation with the awesome bartenders, and probably the bottle of wine you have had. You really want to wait on the platform, on a weekend for the F? no. and there are always cabs outside waiting...\nSince that winter-time drunken weekend month, I have been back a couple of times - once for brunch and another time to bring my family from out of town, for dinner. Brunch was crazy and packed, we ate at the bar. I drank mimosas, and had the huevos rancheros. muy bueno.\nDinner with the fam was nice. It was a week night, around 8, and the place wasn't dead, but a little less busy than the weekends. We still made reservations. \nThe food is fresh, and well prepared, leave room for dessert! the flourless chocolate cake is rich, and the mixed berry shortcake is like summers on the ocean....the fruit was fresh and firm, lightly sugared and the biscuit was sweet and a tad salty - homemade and delish! The staff is gracious, accommodating and fun. The decor is funky, and the space with the high ceilings, low light, and trains rumbling above you going across the Manhattan bridge - well, this place isn't to be missed.", "author": "Kathryn s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-12", "description": "Peckish and thirsty, we randomly walked into Superfine on a Thursday evening. I was surprised at how good the food was. We started with the calamari, which was perfectly cooked. My polenta with sauteed mushrooms was simple but satisfying. Between the three of us, a shared appetizer, and a bottle of wine, the bill came out to under $100 -- hooray! Although it's not anything to make a special trip out for, it's a good deal in a good location; I'd visit again when I'm in the area and hungry.", "author": "Avitania B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-20", "description": "Definitely a terrific place, one of my favorites in Brooklyn.  When you're SICK of attitude, poseurs, the thing that makes going out exhausting sometimes, head to Superfine.  It is real, cool, interesting people, creative spirits, excellent food and excellent drinks.  I go here when I'm craving one of my favorite drinks: a Dark and Stormy.   A simple yet delicious cocktail of ginger beer (no, not ginger ale, it must be ginger beer preferably from the Caribbean) and rum with a splash of lime.  That's it, but there aren't many that get the ginger beer powerful enough and the mix yummy instead of too harsh.  This is only one of the reasons Superfine is great.  Food is great, but I put it in my Luscious Libations list.", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-22", "description": "I met a friend for drinks here yesterday and really liked her choice of drinking establishment: the staff pour a stiff cocktail, the crowd is laid-back enough without dabbling into LA attitudes, and the space is fantastic. Hard to believe that only ten years you'd come to this neck of the woods for underground parties and blotter, y'know?", "author": "James E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-08", "description": "A very chill place in the seemingly middle of nowhere in dumbo. Since the area is still becoming residential, this was a surprise to find. Good happy hour specials, but my fav is $3 Yeunglings! Plenty of seating, and there's even a pool table WITH room to play.", "author": "Erik C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-06", "description": "4 stars for the space, 3 for the food.  Came for a holiday party last weekend and the converted warehouse space is great.  Has different levels, high ceilings, but never feels too sterile.  The drinks were cheap, the food had a good mediterranean flare but kept things local.  I think its a great event space, if i was having a small dinner i'd go somewhere more intimate.  Great location though, near the water, under the bridge, right off the F stop.", "author": "Allison H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-13", "description": "SuperFine is super hip and could definitely be a fun place to hang out at for drinks. While I think it's awesome that this restaurant is all about farm fresh food, to be honest, nothing I've tried has really wow'ed me. The food is good, don't get me wrong, but it's average for an American-style burger place. The last time I went I was looking for a salad and the waitress hyped up their garden salad as if it were going to be something special. When it arrived it was nothing more than a small plate of lettuce. Skip the food, enjoy the atmosphere and drinks.", "author": "Adrienne P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-20", "description": "I am not sure what my problem is lately but I keep finding myself in the outer boroughs, i really hope this does not become a habit. I fell in love with this place the moment i walked in. Something about the semi hippy vibe really made me feel relaxed. The menu is presented to you on a dry erase board you know... so the hippies don't harm any plants in creating paper menu's. I went for the burger and it was very good, not GREAT but very good. The fries were of the shoestring variety and crisp, hot and delicious. If i lived or worked in the area i think I would go ALL the time.", "author": "douglas B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-11", "description": "SUPERFINE follows suit with typical artsy-fartsy DUMBO dining scene in A) producing delicious, but pricey, meals with the awesomely fresh ingredients and B) seating patrons at cafeteria-esque tables mismatched school desks. Do not mistake this for criticism, the fresh ingredients and American-style cooking make for deliciousness on a plate, and if you feel the need to praise it sonorously with small amounts of food flying outwards, the happily loud retro-casual dining atmosphere will not judge too terribly.\nAppetizers and main courses change daily to accommodate the restaurant's \"Freshest ingredients\" philosophy---but the readily available French fries add bonus points to any meal. Diced into teeny-weeny starchy toothpicks and cooked however such things may be cooked, these mealtime accessories will make even the snottiest wordsmith agree--- puns are not only acceptable but exquisite when they taste like delicious and! Fries are best served SUPERFINE.", "author": "Sirui H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "drinks and food!!! very nice!!! the food uprised me, i must say!!! very , very good and stylish!!!!! dishes!!! music was on point and they got a pool table!!! nice spot to hang!!!", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-27", "description": "i don't live in ny and was visiting from seattle. i consider myself someone who can appreciate locally grown, sustainable food--which is a major movement in seattle and the northwest. my friend and i went to Superfine because she had been on a date with her sweetie during the summer and had a tasty meal. \n\nthe menu at Superfine rotates and changes daily. it's written on a white board which the wait-staff bring to your table. i appreciate this touch and i imagine it saves a lot of paper!\n\nunfortunately for my gluten free needs Superfine was not a good choice. the menu was mostly bread and/or pasta outside of the house salad, red lentil soup and the beet and brie salad (which was sold out). oh, and the steak with fries. i ended up ordering the steak with no fries and just salad. i was charged the full $25 for this and felt a little disappointed by that since i didn't want the fries. the best thing about the meal was my hendricks martini (which would be hard to screw up). needless to say if i was in ny again i wouldn't hit up Superfine.", "author": "Jenn B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-08", "description": "Probably one of the better restaurants of DUMBO given the dearth of choice. The food is good (juicy burger but oil-laden fries, good pork chops), the bar is neat and the ambiance quite pleasant. The big, big, big problem is the wait time for the food to get served. There is a clear mismatch between what the kitchen can deliver and how many people can be sit in the dining area.\n\nOh and the menu seldom changes, which is harsh when you work in DUMBO.", "author": "Alexis L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-05", "description": "In the mornin': get the breakfast burrito. Otherwise you will be disappointed. It's a great burrito, but everything else on the menu is mehhhh.\n\nLate at night: avail yourself to the house cocktails. The high quality of the cocktails (the \"cherry rum soda\" and \"creamsicle\" and so on are all YUM and STRONG) totally redeems the crowdedness, the snotty hostesses, and the scowl I got from the bartender when I interrupted her conversation with her lesbian lover.", "author": "caitlin o."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-23", "description": "Breakfast burrito and mimosas were a good way to start off a lazy Sunday at this hip DUMBO spot. There was a live band playing ... perfect music for the converted factory location and diner-chic decor and table settings.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-31", "description": "superfine is FUN. it's a great place to grab some beers and chill out - and yes as others have mentioned there is a free pool table! the space is beautiful and it has a really laid back and friendly vibe.\n\nthe food is not bad. I like the organic and local thing, and they don't waste paper by handing out menus; instead, they bring a dry erase board to each table with the day's menu on it. I had the pork chop, which was was only ok - it was kind of dry and bland, unfortunately. my friend's steak was much better, although I wouldn't characterize it was one of the best steaks I've ever had - it was just good. the fries that come with the steak are these teeny tiny thin crispy fries where you have to eat like 15 at a time to achieve the equivalent of 3-4 normal fries, which is OK, but I prefer regular fries. \n\noverall, 3 stars for the food, and 4 stars for the organic local fun chill lack of menus vibe - but heck I'll round it up to 4 since I'm a big ambiance person anyway.", "author": "Yee C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-10", "description": "The best dirty martini I've had in a long time and the rotating menu is fun.  Sunday seems to be burger day.", "author": "John E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-17", "description": "Attended a holiday party here. Great service, quality food, not bad at all.", "author": "Kenny H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-19", "description": "Food and atmosphere were great.  Menu changes daily based on local ingredients that are available.  Steak au poivre was cooked perfectly and the fries were so yummy.  Service was friendly and attentive.", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-16", "description": "Like Rebar across the street, I usually don't mingle with the typical crowd that Superfine draws. However, I used to come to this place every weekend when my roommates worked in DUMBO, and we always had a blast here. I spent 2008-2009 New Years Eve here, and it was loads of fun. The place is decorated nicely, and the bartenders were pretty awesome. If our close friend/barkeeper Lola Rocknrola was still behind the bar, this place would have to be given a 4.5.", "author": "Christian E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-07", "description": "Went to Superfine for Sunday brunch recently and was not disappointed! The food was probably the weakest link in the experience, but no more/less standard than any decent brunch food. The blue berry banana cake and coffee were a nice start. What I really liked was Superfine itself. It has an abnormal layout with a pool table/lounge/dining area on the \"upper level\" and a recessed bar on the \"lower level\". Towards the end of brunch a 2 piece southern rockish band played and passed a hat around for tips ala Nashville or something similar. A nice twist on boring brunch. All in all, its a cool spot for drinks, dinner, or brunch in forever intriguing Dumbo.", "author": "paul j."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}