{"aggregateRating": {"reviewCount": 432, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-13", "description": "Drinks were good. Eclectic furnishings. Not pretentious hipster crowd. Price of the food was a little high but it's DUMBO after all. Service was attentive. \n\nWorst part... the noise and the acoustics. It gets loud quickly and I couldn't hear anything beyond my colleagues sitting directly next to me. All six of us said the same thing afterwards - glad it's not early onset hearing loss, but stay there longer and your ears will be ringing.", "author": "Wendy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "I don't trek to Brooklyn much, and Superfine is a good example why. 1) The drinks aren't much cheaper than Manhattan. 2) DUMBO is loud. Something about trains overhead rattling by. 3) Yes there is a free pool table, but the thing is in complete shambles. 4) Their leather couches and theater seats are (I guess?) suppose to be artsy... but they just look run down, beat up, ripped, and makes me wonder if I might get bed bugs.\nStay in Manhattan. Send me a message on where to go for a free full sized pool table and intact, comfortable, and hygenic leather couches.", "author": "Evelyn W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-27", "description": "I ordered the chocolate mint pot de creme with langues de chat cookies for $8. I did not taste mint and was surprised that it was actually mousse. Very fancy name but disappointing! Overall, nice restaurant in DUMBO with a pool table oddly enough and a bar in the middle of the venue.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "I was at The Dumbo Loft next door for an event and was dying for a microbrew IPA. A friend recommended this place and it didn't disappoint. Mind you - it is open all week but there's no kitchen on Mondays. I was very happy with the beer selection and love the vibe. If you're in Dumbo, come by for a drink!", "author": "Jennifer F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Umm.. this is amazing. The bluegrass brunch was brilliant! The enchiladas and Bloody Mary will make you cry in the best way possible. So yum!", "author": "Megan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Great food and date spot during the early evening and great bar to take friends to and hang out at night. Free pool and great atmosphere, probably one of my favorite spots in the area.", "author": "Chad C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-10", "description": "I have been to this restaurant only a handful of times.  I desperately want to love it since it's in my neighborhood.  But after the horrible service, the rude hostess, and the dingy surroundings, I will not be returning.  \n\nPricing is meh, food is meh, the people are meh.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Just went for a drink.\n\nIt was quiet at 6 pm on a Sunday, plenty of open seats.\n\nThey have cider.\n\nThere was live music.\n\nBartender was fine and not rude, not sure what people are complaining about.", "author": "J B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-08", "description": "Met with friends for a casual short dinner. Bar was well stocked with whiskeys and I had a sour that Bo made. Turns out Bo has visited my small island- Bequia- numerous times so we hit it off.\n\nStarted dinner with friends and had the calamari which was tender and flavorful. We also shared a large salad and and I had the spaghettini which had a lot of fresh roasted vegetables. \n\nPrices were affordable and service okay, nothing stellar about it.", "author": "Holly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Great place for Sunday afternoons...super casual...great bluegrass brunch with The Demolition String Band!!!! Vegetarian burrito, pork chops and eggs all were awesome!!! Great beer menu!! Can't wait to come back....", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-02", "description": "I went last night--it was Friday and around 6:15PM if I recall.  The place was about a quarter to a third full, I would guess, most folks at or around the bar.  Tons of space at the tables.  We wanted to sit at a table.\n\nWhen my wife and I walked in, we stood around for a little while waiting for someone to come up and seat us...nope.  Being the proactive sort, I walked over to the far side of the bar to ask the bartender what the process was--he didn't seem that happy to talk to us and hadn't made any move to acknowledge us up until this point--and he told me we should go up to the desk in the middle of the space (not exactly obvious folks) and wait there for someone to seat us.\n\nSo we did.  We stood there waiting another five minutes, and during that time I noticed a bunch of staff in the back apparently having a great time, talking and joking around.  Finally I turned to my wife and she must have had the same thought because she said, \"should we leave?\"  I nodded and we strolled out, as unhindered by staff accosting us on our way out as we were on our way in.\n\nWe headed down the street to Atrium, which is probably a bit pricier but the folks who work there are actual professionals who take their jobs seriously (the food is fantastic too).\n\nIt's too bad too because this place is right around the corner from where I work.  Ah well.", "author": "Dave D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "Nice happy hour spot!\n\nThe place has a very cool, low-key vibe, with a nice long bar, exposed brick, and friendly staff. great beers on tap.", "author": "Cristian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-29", "description": "What a great atmosphere the wait staff was so nice and the food was delicious ... we had Mahi Mahi that was cooked perfectly and it's a great spot to go before or after a walk over the Brooklyn Bridge", "author": "Denise D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "The bartender was not particularly busy, however she blatantly ignored our multiple attempts to request service. She looked directly at us while continuing to snack behind the bar and not acknowledge us. When we went up to her to put in a drink order, she served us with an attitude and sub par cocktails. Oh and p.s: her crappy attitude. And p.p.s the really crappy attitude.", "author": "Alice J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "5 stars for the food, 4.5 for service and 4 for the interiors.\n\nThe food was of fantastic quality. While the price wasn't on a low range, the size of each dish and the quality of the food were definitely worth the money. I went with my husband on a Saturday night and we got a grilled calamari salad for appetizer, grilled pork chop and spaghetti with home-made sausage as mains, a small slice of orange cake for dessert, and a bottle of wine. The calamari salad and the spaghetti were the best we've ever had - good quality ingredients, perfectly seasoned and cooked, and came in generous portions. The pork chop was really tender and tasty. The total bill came to $140, which is reasonable for a quality three-course dinner with wine in New York.\n\nOur waiter was nice and helpful, however, we find the lady greeting and taking us to our seat not very friendly. The space itself is beautiful with old brick walls, exposed beams and metal ramps dividing the space into the bar, game and dinning areas, yet the interiors seemed randomly put together. The choice of mismatch vintage tables and chairs fell flat as they look too cheap for a place that charge the price they charge. A random and cheap looking lantern stood in contrast with the industrial lighting in the rest of the space. The intimacy of the dinning area created by warm lighting and candles on the tables was offset by the cold light coming from the protruding stainless steel kitchen counter. \n\nIt was a good find in Dumbo, will definitely come back for the food and see if the interiors are any better during daytime.", "author": "Hang P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-25", "description": "Superfine it's a nice restaurant. I come here every once in a while If I happen to be in DUMBO. I like the general atmosphere, and the food is really tasty, but last time I had dinner there it was so loud.. I was barely able to talk with the people at my table (and we were 6!)\nBeside this annoying aspect, I highly suggested. Service is quick and nice. Particularly good are lobster salad and pork chops. And don't forget to try their French fries! Tiny and delicious!", "author": "Martina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-15", "description": "The shoestring fries are very tasty and they had a Brooklyn hard cider that I enjoyed; however, my chicken sandwich left something to be desired.  The set-up of the bar is neat with different layers of seating, and there are pool tables.  The location is good and convenient to the subway.", "author": "Rebecca D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "My husband and I have been going to Superfine for 10 years, first having discovered it for their Sunday Bluegrass Brunch. Good music, fun, and delicious wholesome food.\n\nWe went to Superfine for Valentine's Day and were not disappointed. I love the open space, funky decor, and delicious food!\nTanya, one of the owners, always greets us warmly and has a great joke de vivre which is reflected in the spirit there.", "author": "Gable G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Dim lighting, good wine, Modelo on tap, chill staff. It's under the Manhattan bridge, your Uber driver will be hopelessly lost. It's ok. Your date will be really charming and super cute so it'll be worth it. Do it.", "author": "Marie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "Super aight. Went for happy hour and it had a nice drink list to choose from. The double bar set up was pretty cool, one in front and behind. Overall enjoyed my time here", "author": "Adam O."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Superfine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/v6NYPuaDKhqvj0PYajh2vg/ls.jpg", "@type": "Restaurant", "telephone": "+16469025859"}