{"aggregateRating": {"reviewCount": 3, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "Friendly staff. Good food, corner location that catches your eye as you drive by. Multiple selections of variety of food including buffet style. Will come back. Nice seating place in the back", "author": "Ana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-26", "description": "Everyone knows Brooklyn is better than Manhattan.* \n\nThat said, there are certain things that Manhattan has that Brooklyn doesn't. While there are amazing bodegas, sandwich shops, delis, and more all over, most of Brooklyn doesn't really have that one-stop lunch shop super deli where you and all your co-workers can get sandwiches, salads, soups, paninis, udon, pasta, quesadillas, ramen, teriyaki stir fry, fruit, snacks, and also a large hot food bar that you load up on by the pound. \n\nWell, Metro Buffet is here, and they've got it all. \n\nI've yet to dive into all the options, but they put buffet in the name for a reason, and I'm into the hot food bar. It's $8.95/lb., and as long as you're loading up right (mostly meat, not other things that weigh more than they're worth like potatoes), 3/4 of a pound should make a fine lunch for a normal human, and 1.5 lbs. was plenty for a fatboy like me. \n\nTo be clear, trays of food kept out are never going to be as good as individual orders of freshly cooked food, but the strength here is the sheer variety you can get all at once: \n\nFried chicken, other saucy chicken things (including some General Tso's knockoff), roasted veggies, grilled veggies, maduros (sweet plantains) that are always a winner, ribs, mushrooms, fried rice, rice and beans, cheesy things, buffalo sauced things, potatoes of several varieties...it's a literal smorgasbord. \n\nMy advice is to diversify your bonds, ninja. Sometimes one variety of chicken could be overcooked and dry, so you want to get a nice range of options so you're minimizing your risk on having a bad lunch. And always, always get the maduros (sweet plantains). \n____________\n\n*Feel free to dispute this if you want to be wrong.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-03", "description": "I came here right before eating my actual lunch because I was famished and dramatic. Lol when my belly calls unfortunately I run lol. There were a few people airtime around eating but for the most part the place was empty. They have a separate cold and hot bar like your standard buffet as well as a deli. I wanted to get something small and quick so I just grabbed vegetable rice and sesame chicken. To be honest it wasn't anything special, it taste like most buffet food. However I'm sure I would come back and try something else I find most buffets have their special dishes that taste better than others. The place is clean and the employees are pleasant. Stop in if your starving.", "author": "Andria A."}], "servesCuisine": "Delis", "priceRange": null, "name": "Metro Buffet", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "296 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/CKe8rAFD7jo0n0H6Z6w3tg/ls.jpg", "@type": "Restaurant", "telephone": ""}