{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Okay, I am very picky about my italian food. I was really impressed by this place. It was the closest to authentic since I dined at Obica. It is not the same level in quality of products and style, this place is a bit more casual and easy. But for what this place is, the pizza, caponata, burrata, and the tiramisu were all lovely. The server was really friendly. The atmosphere is very inviting and casual. I was there for Easter walked in with my boyfriend and we were both pleasantly surprised. Flavors were good and it was just an overall pleasant experience. It deserved 5 stars because it exceeded my expectations.", "author": "B U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "This review is for their breakfast service: I was on my way to 61 Local to grab my coffee--always a great place, but I saw the window open across the street at Número 28 today, and since it was a sunny, lovely morning, it made better sense to sit at the window, outside, than to sit inside in the dark. This place is under new ownership, but the open, inviting interior remains the same. The wide marble bar also remains--one of the most inviting and comfortable bar spaces in the neighborhood. I was told that several of their bartenders migrated over from the Japanese speakeasy Angel Share (!)--that is why several other commenters have mentioned that they seem to know their stuff.", "author": "MJ L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Just randomly decided to go have a drink and loved the layout of this place so I sat at the window bar...Best decision ever!! This watermelon cocktails were so worth it and refreshing...Then I got in on the food...The Chef Allessandri definitely knows what he's doing with that grilled octopus mmmmm... I can still taste it!! The pizza was amazing too..Definitely my new spot !! The open concept it perfect for the neighborhood and a summer night in BK!! Love love love!!", "author": "Annekay F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "This is one of the best pizzas in New York. I am not a fan of American-style pizza. Numero 28 use good ingredients and make good Italian-styled pizzas", "author": "Charlie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "This the best review! I live in Boreum Hill, Im italian And this is the place to be! Davide", "author": "Davide D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-20", "description": "We've eaten here 3 times and I'm a fan.  The pizza is so good, it wasn't until the third visit we tried something else.   We had the Bronzino, simply prepared and accompanied by a generous portion of grilled vegetables.  The salads are generous, carefully dressed and perfect for sharing.   The pizza is fantastic with a wide range of options.  With the large pie, you can have up to 3 different types which helps solve any disagreements in your party including between meat eaters and vegetarians.  The toppings are fresh and generous and the crust is well cooked and never soggy.  Decor is funky - they play vintage Micky mouse cartoons silently in the lounge area, often with zoned out kids relaxing while their parents enjoy their meal.", "author": "Sandra B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Numero 28 Pizzeria \u0026 Cucina", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/If-5C7quGC-AZ-mgZ1wHbQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479874819"}