{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-10", "description": "Mixed experience- pizza great, Marguerita, truffle, sausage, all yum.\nBruschetta bread was stale and rubbery.\nI hesitate to insult the entire profession by saying the argue was horrific. It wasn't service. Took order, delivered food, had to ask for everything- water, napkins, utensils, check, you get the pic.\nPizza is probably worth take out, would hit eat in again.", "author": "milou g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Vincenzo and his team know what they're doing. I hosted my birthday party here recently and it was wonderful. I ordered pizzas for my guests, some of whom mentioned this was the best pizza they've had in a long time. My friends ordered delicious drinks from their insanely talented bartender, Tetsuo. There was a live band that played beautiful music and sang 'Happy Birthday' to me. I felt so special. Vincenzo was wonderful to work with. I will be back soon, and highly recommend Numero 28 for everything from a dinner for two to a large birthday party.", "author": "Kate R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-28", "description": "Just want to start by saying that the food was excellent, but the service every time I've been here has been exceedingly poor.\n\nOf the three of four times I've been to Numero 28, I've had the cheese plate, bruschetta, salad, and numerous pizzas and pastas. I was more than happy with the food, but the service was only mediocre. The pizza and the pasta seemed to be made on a totally different schedule - they tried to bring out my friend's pasta with our appetizers, but she asked them to wait until our entrees came out. The waiter seemed pretty annoyed about it, and I noticed a lot of tables had food coming out at different times - the couple next to us got their meals like 20 minutes apart. The staff was also not particularly repsonsive or friendly. It took us a long time to flag the waitress down for water and the check, and no one came by to see how we were doing after our food came. \n\nI keep going back because the food is good and my friends like going, but to be honest, I regret it while I'm there every time because the service is so awful.", "author": "Cindy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-19", "description": "Love this place and last night was my first time. Food was amazing, staff friendly and welcoming! Definitely, will be back. If you want authentic Italian cuisine, this place is special!!!", "author": "Juliet A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-08", "description": "Pretty disappointing considering we've been going to the other Number 28 establishments in the city. This one did have a nice decor and does accept cards, but the quality wasn't that great compared to the others. Partner got the Capricciosa, and I usually get the Rustica, but they didn't have it. They did have a similar version with Kale. We tried to order some beer but they seemed to be out of everything except the bland stuff. As far as the pizzas go, one was undercooked and the other was burnt. The flavor wasn't there, which was sad since we do like the other restaurants which sold us on flavor. Maybe it was an off night, but it was pretty disappointing to be let down on so many fronts at once. Overall, try the ones in the city if you have a bad experience here.", "author": "Danesh J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Huge restaurant with a big bar that is great for a glass of wine or two. One of the better happy hour deals around ($4 wine until 730). They have a white and red wine on tap and both are good. The pizza looks good and there are always multiple tables of people. Worth a try if you're in the area!", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-01", "description": "Amazing remodel - the restaurant looks beautiful, but I found the food to be meh, unmemorable, and the burrata was more like fresh mozzarella (big no no).  I'll come back and try out more items on the menu since other reviewer seem to have really enjoyed their experience here.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Can't express enough how great of an addition this restaurant is to the neighborhood! Having frequented Numero 28 in the east village, I knew the pizza and pasta would be delicious. What I wasn't prepared for were the cocktails. Mamma mia, were they good!! You can tell a great deal of thought was put into crafting the drink menu and the bartenders really know their stuff. The restaurant has an airy and lofty vibe but the decor is cozy and the staff make you feel right at home. I had the D.O.C. pizza but will definitely be back to try the Pizza Tokyo!", "author": "Reema S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "Entered the restaurant expecting an upscale pizza pie. After waiting for just a few short minutes, our oval shaped Reginella pizza came out, served on a long oval wooden board. The cheese was fresh and the San marzano sauce was to die for! Highly recommend this spot if you're looking for some good BK-Italian pizza! Ps- the environment is super eclectic and cute!", "author": "Anum A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "Order the Rafaella which was delish! Exactly what I was looking for in taste and texture. Just enough salt to flavor the sauce and cheese, yummy tomato sauce, thin enough crust, outside crust not too overbearing. The only reason I didn't give it 5 stars is because of the price. $19 with tax for the small has 4 slices, an expensive pizza for one. Though if you're willing to open your wallet, I recommend Numero over Sotto Casa, whose pizza lacked flavor and a good salt balance.", "author": "Kay T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Vinvcenzo (smiley face) or as I like to call him Vinny B, boy! He knows what's up. This boy knows what's good. He does the red pizza. He does the white pizza. The no cheese. Haha. You know, like I always say No cheese no choice. Is what I say.\n\nBack in the day, Vinny B was all up in my hood and my grill but then ever since he started doing the red pizza on the grill I been like, yeah boy whats up, thats my pizza boi! Hell yeah. Love you vinny Hope you have a good christmas vinny.\n\nSHit you know you like I always say you know, pizza is good. CHeese is pretty good too. You know. haha. Its what I say. See you in Vegas, baby.\n\nI love it.", "author": "Steven L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-21", "description": "We've been here twice, and are quite pleased that Numero 28 opened this spot on Bergen Street. The space itself is open and airy, with floor-to-ceiling windows that fully open, creating an indoor/outdoor vibe if you are seated near the front. At the owner's suggestion, we had the reginella, which was deceptively simple - margherita with fresh buffalo mozarella. The pizza is delicious. It comes out on long wooden boards, and you can customize your pizza or do half and half with different types. We also tried some of the salads as starters and enjoyed those.", "author": "Jayne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "So glad that this place opened up last year.  The place feels authentically Italian with a nice modern vibe. Service was very attentive and friendly. Pizza was flavorful and crispy. Eggplant parm was just like I remember in Italy. Please start delivery!", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Amazing food! Definitely try the chocolate soufflé for dessert if to like chocolate... It's more like a lava cake.", "author": "Katie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-27", "description": "Just okay. Not sure if it's because we have had such amazing pizza and meatballs at other places in Brooklyn, but it was nothing special. While the sauce was good, the meatballs were over cooked and hard. They also needed a lot of salt.  The Pere salad was nothing special- the dressing was also lacking salt.  The pizza was fine, but a little soggy on the bottom. The service was just okay- we waiting a long time for the food and had to ask several times for water and remind the waitress to check for our food.  The Sangria was good. All in all, mediocre food and service. I would rather go to Luzzos or Sotto Casa or Lucali.", "author": "Mimi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "Absolutely delicious! Their pizza is wonderful and the pasta is perfection. We've visited a few times and they have never disappointed!", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-27", "description": "Love the food, but they are not open until 2:00 as advertised. Please update your information.", "author": "Jamie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Such an amazing restaurant. Came here late at night and the pizza is amazing. Definitely recommend the divalo!", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "Never again! The waiter this past Friday night was so rude and unpleasant. We were a party of 4 and sat by one waiter then told to \"move\" because the table was \"reserved\" by another waiter a few minutes later.  We quietly moved tables. But then sat there waiting for menus for over 10 minutes. We all felt very unwelcome and left. There were TONS of available tables in the place. We live down the block and have tried the place 3 or 4 times and all but one time there were frustrating issues. We are very easy going people. Not ever bringing people there again. We had a lovely dinner at Chez Moi that night. Next time we go to Table 88 where we always have a lovely time.", "author": "Nicole J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-27", "description": "We wanted this place to be great. This space is in the perfect location and has failed so many times. I don't know if it is under the same ownership, but this is another total fail. The bar is ok. The food is ok to good. The service is terrible. I waited for my third visit to write a review because I wanted to love it, but three times in and same story: there is always a big party there who knows the owners and the service only pays attn to them; it is overrun by small children wandering and crying (and I have my own - this is the complaint from my 7yo); and our grownup meals came out a full 21 minutes before the pizza we ordered for the younger folk. Ridiculous.", "author": "Andrea B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Numero 28 Pizzeria \u0026 Cucina", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/If-5C7quGC-AZ-mgZ1wHbQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479874819"}