{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "Amazing atmosphere and delicious food. Beet salad is mouth watering and pizza is always made to perfection.", "author": "Jane T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Atmosphere is cozy \u0026 rustic! Excellent Italian waiters with a great sense of knowledge of their foods. PIZZA IS GREAT with a great choice of appetizers ( especially the rice balls \u0026 burrata)", "author": "Rita R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "Nice vibe, service, atmosphere and food. Arugula salad was at the peak of freshness - simple and perfectly dressed. D.O.C. Pizza was quite good as well. Nicely charred, excellent ingredients with lots of basil. Perhaps not my favorite pie in the area, but more than acceptable (while I believe there are good pizzas and bad ones, pizza preference is as individualized as DNA). Only slight disappointment was dessert; mini-donuts with nutella were bland and unremarkable. Espresso was acceptable, tho lacked the mandatory crema. But I'm a stickler for good espresso, which mystifyingly, is not that easy to get in the good Ole USA -- even NYC. OK, don't get me started on that...", "author": "Barry P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "incredible huge 14\" pizza marinara for only $10. got it with a side of broccoli rabe for a great dairy-free classic Italian lunch.", "author": "Ashley M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "Had their incredible Venetian- style thin crust pizza a couple of weeks ago and they are as good as the East Village location. They get a little experimental on the food, but with discretion and care and you know what, its a success. The interior design is large, airy and dark wood tasteful. Sad part is some local zoning issue with a church has temporarily revoked their liquor license. Keeping my fingers crossed for them-- it is causing them to lose a ton of business and perhaps this incredibly welcome addition to the Smith Street dining scene might just go away.", "author": "Gayle G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "Meh. Service 3, pizza... Over price... Ambiance...parents after school with a million kids running around... Not a good spot for getting a beer and a bite after work. Pizza... Nothing to write home about.", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-03", "description": "Pepperoni pizza 2.5/5. Too much pepperoni but evenly distributed. \nArtichoke mushroom pizza much better 3.5/5\nCrust was burnt multiple places.\nDough not particularly flavorful. \n\nIt was closing time but still expected a bit more.", "author": "Ghazi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "Delicious pizza. We went in on a Saturday afternoon and were very surprised to find ourselves alone in such a large space. The pizza is made with fresh ingredients and it's cooked to perfection. My only complaint is charging $8 for a topping of mushrooms. Other than that, this place competes well with my other favs in the neighborhood.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "BOTTOM LINE UP FRONT:\nCome here for good fresh pizza, good vibes, and delicious cocktails. Further details below my friends! :)\n\nAfter a few drinks across the street at the 61 Local bar, my friends and I decided to grab dinner here. Their pizza is really fresh and the server suggested we order a large pie. The cool points here is that you can order your specialty pizzas and divvy it up across one pie... SO we each got to order our desired flavors.\n\nThe icing on this gem of a venue is their signature cocktails. I believe their bartender either came from or used to operate a speakeasy in NYC (I don't recall which). I wish I took a picture of their drink menu since I didn't realize this is a new addition to the Numero 28 Cucina chains in NYC, but please order up your drink of choice and I promise you can't go wrong (all 3 of us literally tasted each different drink order and we loved each one).\n\nCheers!", "author": "Wilther M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-10", "description": "The pros: \ngorgeous space, if a little bit too on-the-nose for bougie hipster Brooklyn. \n\nThe pizza was delicious. Right amount of chew and crisp in the crust. \n\nCocktails: I had the Kipling which had grapefruit, Montenegro, and earl grey infused gin. Balanced and delicious. \n\nThe cons: \nUneven service. Our waiter was horrible, ignoring my drink order and not taking my date's-- he was distracted with incoming guests. Which was odd because the restaurant wasn't even busy. Later when I asked him for my drink he claimed I never gave the order to him, which was charming, really. Nice to blame it on the customer. Thanks. I could really have done without the attitude. I'm docking one star for that. \n\nThe risotto with radicchio and taleggio was a special but it was a little bland. \n\nThe portions are BIG. This is not a bad thing necessarily, but be warned.", "author": "Joelle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "Nice decor for October, friendly employees, \u0026 pizza was delicious! Will come here again to try different toppings :p", "author": "Christina V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-10", "description": "Great staff, ok food, sky high prices. Sorry, but it wasn't worth $100 for pizza and pasta dinner with two adults and one child!  Thanks for making us feel welcome, but your prices are way too high for the quality and ambiance.", "author": "sarah r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "AMAZING PIZZA! ; the tomato sauce is incredible, the crust is just PERFECT, does not feel greasy of even unhealthy which made me feel comfortable with stuffing my face on it! = Ate 2 pies on my own. \nAMAZING PLACE!", "author": "Dayana M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-01", "description": "What a HUGE disappointment -I have been going to 28 for years.  The food and service was good.  NOW the place is run disaster with terrible service (except for the bartender), poor food, loud club music and a general sense of we don't care if you eat here or not. CLEARLY no management.  Too bad.", "author": "Stacy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "We all enjoyed our plates here!  Shrimp Risotto, pizza, and lasagna!   Great ambiance inside and in Brooklyn!  Pizzas are huge and super tasty with their fresh ingredients!  We recommend eating all our choices and def recommend the Creme Brûlée! Will come back again!", "author": "PJ D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "SUCH a welcome surprise. High quality, simple ingredients done very well. Burrata with anchovy and the spinach avocado salad was outstanding, and the medium pizza \"for 2\" is almost comically enormous and satisfying. Our meal came with fresh, hot, crusty homemade bread and we went for the delicious Panna cotta for dessert.", "author": "Israel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "The best guys who care about old world culture. \n\nLove the food and love their passion for satisfaction. \n\nFirst time to Brooklyn. \n\nBest guys. Christian, Vincenzo, mikrketto.", "author": "Vijay C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "Solid addition to the neighborhood / diverse menu / good staff / cocktails could be more interesting but solid / you should try it.", "author": "E. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "I came here for a late snack . I ordered a couple of appetizers . They were all fresh and delicious .\nI hope they get their liquor license soon .", "author": "ABDALLAH A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "By far my favorite pizza in the neighborhood. Spacious, chill, and devoid of the insane crowd that swarms the west village location. The menu is full of fresh, inventive recipes and I've never had a bad experience. Everyone I've taken here has loved it!", "author": "Jen Q."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Numero 28 Pizzeria \u0026 Cucina", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/If-5C7quGC-AZ-mgZ1wHbQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479874819"}