{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "I am so glad I get to update this review with 5 stars because I've really been rooting for Numero 28.\n\nCame for the third time last night at 11:45pm (yes, they were still serving food!) and the service was absolutely stellar. The food, as it's always been, was on point. (So far I've tried the reginella and frichetta pizzas, the homemade fettuccine in tomato sauce topped with fresh basil, and the bruschetta). The classic, fresh flavors plus the kindness of my waiter just made my night.\n\nThank you, guys. Keep it up!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "We stopped in for a very good authentic Roma style pizza and some appetizers including Meatball and Eggplant Parm that were both excellent.  The service was outstanding !! They even had some very nice wines by the glass.  There is a large outdoor eating area which unfortunately it was too hot to use today. It would be lovely place to eat on a cooler evening.", "author": "Ivan K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-14", "description": "Came here for lunch and it was empty.  We were the only table. Probably because it the place was full of smoke - seems as though they need to fix their ventilation system.  Waitress apologized for the smoke, so at least they owned up to it.  Waitress was neglectful because she was busy with a table towards the kitchen full of papers and a laptop.  It's completely fine to handle paperwork during business hours, but not to the point of neglecting people.  At one point, the waitress was MIA at one point and people came in looking for anyone to be seated. Turns out she had completely stepped out of the building! She came in after a few minutes, to the surprise of the people seeking food and service.  Food is okay.  It's probably better to give delivery from this place than dining at their location.", "author": "Diana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Thisisa very nice a pee zah. I liken very much. Ifa u find yourselfe hear inde Bergene streetah, stop by. Ees a littah expenseeve, butta ifa I gotta da money isa no problem. You gotta dis. O yeas tella daboss da hous wine is notta so great!", "author": "Ck M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "Rustic Italian pizza joint with more to offer. Italian beers (peroni and moretti) and happy hour specials M-Th 4-6pm $4 drafts and $5 wine. We had a pizza and ciccio and enjoyed both. Live music in the summer!", "author": "Haven B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "5 stars for service, 3 stars for food and 4 on decor. I can get equal to better pizza at many local take out spots. They used frozen spinach on one of our pies, the dough was ordinary and the bottom was soggy all the pies I tried. If I was paying $4 a slice st a local take out spot I wouldn't mention it, but I was expecting better from Numero 28. Service was on point, no complaints there.", "author": "S. Mark S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Such a wonderful experience at this place ! The food and wine , divine ! The staff are amazing and so friendly ! They make you feel like you are eating at a restaurant in Venice . If you are looking for an authentic Italian restaurant absolutely come here ! I wish I could give it 10 stars !", "author": "Marissa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-24", "description": "I'll start off with my food, which was not good.  I had the Broccoli pizza and the sausage tasted like it was bad.  It was unpleasant at best.  I picked the pizza apart and didn't eat the majority of it; our server didn't even ask if it was OK. When we walked in, the hostess tried to seat us at a 2 top in between 2 other tables. Totally get this logic if the restaurant is crowded, however, it was not crowded, at all.  More than half the restaurant was empty.  She insisted we sit at this table even after I politely asked her to seat us somewhere else.  Not 1 table filled up for the entire hour and a half we were there.  Bad food + bad service = bad rating.", "author": "Allie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "For newyorkers: if you want to eat an excellent pizza come here and order it one (with a medium one can eat 2/3 people). But they don't have only pizza ;) \n\nFor Italians in New York: if you miss your homefood come here and enjoy the place and Brooklyn. \n\nThe atmosphere is cool and the service is excellent.", "author": "Alex T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "I'm a regular customer of the other pizzeria in the East Village location and this was my first time at Cobble Hill location.\nIt was the perfect evening to sit on the lounge next to the window and dine.\n\nWe had the pizza Tokyo (crispy flat bread topped with fresh tuna, scallions and mayo-wasabi) OMG!!and the grilled Octopus served over mashed chickpeas was outstanding! \nThe food is authentic and prepared by their Italian (and hot!) chef.\nThe servers are always smiling and making sure that you have a fantastic time.\nI definitely recommend this place , try them and you'll be back for more :)", "author": "Olivia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-02", "description": "Why it took a century to bring decent pizza to New York is a mystery to me.  When it did, it came with a price.  \n\nConsidering the ingredients on the menu aren't designated DOC, (Denominazione di Origine Controllata), it's a bit much.\n\nThe space is cool, the food good, but it's overpriced and cold inside.  We kept our jackets on throughout dinner, and noticed other diners did too.  Are we paying for the heat?\n\n-14\" Margherita Pizza is $14!  (DOC is $19)\n-Penne with Tomato Sauce $18!\n-Lasagna $18!\nEllipsis.\n\nDrop the prices by two bucks down the menu, and you'll be a winner, otherwise it's a bit absurd.\n\n*A note on Service- We are New Yorkers, we know how restaurants work.\nI felt like we were being waited on by the owner overlooking the manager, who was overlooking the waiter, giving the uncomfortable feeling of being a tourist in Rome.\nI was waiting for the €3 for the bread charge.  \nEllipsis.", "author": "Kimi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "This pizza is it!! We ordered a medium diavolo and it was perfection. It arrived on a long wood cutting board which was a nice rustic touch. We have been to a few other wood fired pizza places and all had very wet crusts. Número 28 has it down to a science be every piece had the perfect (to us) consistency. I adore the charred color on the crust and it adds that amazing smokey taste. The sauce is insane. It tastes just like the freshest tomato and not tomato paste. The soppressata is a lovely textural topping and the mozzarella was nicely melted. \nThe decor and ambience was a nice rustic/urban cafe feel. We loved that the front windows were open for that indoor/outdoor dining experience. While the service left a bit to be desired the food made up for it. This is definitely going to become our regular pizza fix.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-30", "description": "Mediocre pizza (soggy in middle). Over cooked spaghetti with clams that had no flavor. Would rather have thin crust pizza from Dominos.", "author": "Bonnie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "Hands down one of my favorite restaurants in Brooklyn. The pizza is incredibly fresh and delicious. My friend and I ordered a small margherita and mushroom truffle pizza to share. It was so flavorful, thin and the right amount of everything. \n\nDefinitely ask for garlic sauce on the side!\n\nThe restaurant itself is very charming and cozy, perfect for a date night or small group dinner!", "author": "Pearl S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "The gnocchi was hands down the best i have everrrr had!!! I couldn't believe with every bite how in heaven i was. The house wine was so good and the overall atmosphere makes u feel like ur in Italy! The staff was an absolute pleasure i would give them ten stars if I could", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Hands-down the best real Italian pizza in Brooklyn  thin crust-perfect amount of tomato sauce cheese and fresh garlic and Cherry tomatoes and peppers and mushrooms -stakes are pretty good little salty but still pretty good tuna tartare  five stars this place will make it and is worthy.", "author": "Allen G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-28", "description": "Came here for a birthday dinner party and we were put right in the middle of the restaurant with all the other customers. With the noise and the socializing, we probably should have been put off to one side so as not to bother everyone else in the restaurant.  Rustic but modern decor.  Friendly and attentive service.  Food was decent - meatballs were small and too dense, pasta was super al dente and margharita pizza was pretty basic and uninspired. The sauce was very tasty though.  This would be a good place to meet a friend for a weeknight meal.", "author": "Steph G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "I ordered a margarita pizza the other night through Postmates and all I can say is, WOW! What a pizza! The crust is exactly the right amount and medium oil...delicious. \n\nNext time I am in town I will need to go by myself! \n\nAmazing Brooklyn Pizza!", "author": "Mike M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "Food was good but not at the level of other locations: one pizza was a bit burnt on one side and the arancini were too much soaked in tomato sauce. Service was ok, but not memorable. Overall, I would recommend trying the other locations, in park slope or the village.", "author": "Maurizio P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "I love Numero 28. All locations around the city are great. But Bergen is my fvorite. The Best pizza in a NY.", "author": "Bole C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Numero 28 Pizzeria \u0026 Cucina", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/If-5C7quGC-AZ-mgZ1wHbQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479874819"}