{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-13", "description": "Numero 28 was the pick for a recent date night, and although I wish I discovered this spot a little sooner, I am happy I did eventually stumble upon it. Really cozy restaurant with rustic decor, decent crowd on Friday nights without being too cramped, and attentive, friendly service.\n\nCalamari is light, crispy, tender, and comes with a tangy/sweet sauce on the side, but our server was also happy to bring over a side of marinara upon request. The Diavola pizza had a crunchy, thicker outer crust edge while still rocking a thinner crust in the middle that New Yorkers are all about. Although the name is perhaps suggestive of this pie being devilishly spicy, even I was able to enjoy it (I am almost pathetically weak when it comes to handling spicy food) - I even added some red pepper flakes to my slices to kick the heat level up a notch.\n\nI'm looking forward to coming back soon for more delish  pizza and to try Numero 28's homemade pastas.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-03", "description": "Just ordered the Fricchettone pizza and Rigatone alla Norma pasta because of a 35% discount and couldn't be more disappointed!! The pizza was stale, soft and cold - just terrible! The pasta was even worse - it was suppose to have ricotta cheese but instead had shredded mozzarella and there was hardly any eggplant or sauce. Even with the big discount, it didn't make up for it. I wouldn't have paid 1/2 of what I did for what I got. \n\nI can't believe anyone would give this restaurant good reviews with all the other Italian joints in the neighborhood.", "author": "Anh V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "I always have trouble digesting pizza but here I always had a great experience! Good job guys!", "author": "Magda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "I first got a taste of Numero 28 when my roommate went the bougie route for Super Bowl pizza. I tasted the pie she ordered and mentally bookmarked Numero 28 for the next time I needed a pizza fix.\n\nEnter: the other day, when my sibs were in town and in the mood for pizza. We thought about getting Lucali but were not in the mood for a multi-hour wait. I remembered Numero 28 and the decision was made. We showed up for an early 5PM dinner and were the first ones there, treated to personalized service and our food was served posthaste. We ordered a large pizza split into three flavors (rustica, margherita, and 5 formaggi) and the penne alla vodka with shrimp and zucchini. The pizza... let me tell you. It was heavenly. The crust was just the right amount of crispy thin and doughy. All of the ingredients tasted fresh and every bite was a dream. It was just as good (if not... better??) as leftovers the next day. I tried the penne and it seemed like pretty standard penne alla vodka, but my bro-in-law liked it and the pizza is the reason to go here anyway.\n\nPrices are steep ($40-something for just the large pie and it fed three with leftovers), but that's what you pay for love at first bite. Will be returning and ordering and re-ordering.", "author": "Naomi D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "Had lunch here outside and it was lovely! I'm not exaggerating when I say their quinoa salad is literally the best one I have ever had. On the particularly day we were there, there were a few tables seated inside and out but only one server. That part was a hot mess. Our server was super nice though and knowledgeable of the menu! So in that regard the service was good, but they definitely needed more people working. But seriously the quinoa salad.. amazing! Will for sure go back", "author": "Alex I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "This was my second time going here and the visit was as nice as the first time. The staff here are always very nice and welcoming. The first time, we made reservations but the second time we were seated as a walk in for 4 people. I find it impressive that the servers take in your orders without writing it down since it seems like such a chill restaurant. \n\nThe food was great! Two medium pizzas for 4 people is a lot! We were going to a movie afterwards so obviously we couldn't bring food in. Having two appetizers, a salad, and 2 medium pizzas definitely filled me up.", "author": "Noa I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Just moved to the neighborhood and we are so happy to have an authentic pizza place near by. Wow! Just delicious! And the staff was so welcoming and attentive.", "author": "Orathai P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-29", "description": "My relationship with this place is rooted in irony.  Because you see, for someone who isn't especially crazy about the food, I seem to wind up here an awful lot:\n\nHere's the thing. I can name any number of BK spots that serve better pizza, but almost none of them accepts reservations for large parties (am referring to you, in particular, Wheated).  And on a busy weekend night, who wants to risk waiting for ages with a big group that includes kids?  So much to my chagrin, this has become our default.\n\nBy now, have been here a bunch of times and have not been impressed by a single appetizer or cocktail.  They are priced way too high for what they are (read: mediocre).  Had a pasta dish once and while it was fine, I felt like I could make something better at home and I don't want to feel that way when I dine out at this price point.  \n\nThe pizza isn't terrible.  But on one recent visit, I actually heard myself calling it 'insipid.'  I think maybe, at the time, it was more fun for me to say this word out loud than anything else, but really, if you look it up in the dictionary, its synonyms, like 'characterless' and 'uninspired' totally apply.  On my latest visit, the crust was bland and limp if that tells you anything.  \n\nThe ambiance here has a festive feel that is perfect for a Saturday night, and service is always pleasant, if occasionally flaky.  Plus, while I may not love the pizza, am always happy to see the leftovers in our fridge the next day.  This is pizza that reheats well.  So 3 stars it(still) is.", "author": "Yael D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-08", "description": "Great pizza and great service.  The drinks.were great as well.  The burbon-based drinks were very well prepared, and the beer selection, although small, had some good options.  The pizza was amazing, however a little over-priced.  If we are back I. The area we will consider this place again!", "author": "Jeremy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "My favorite restaurant in Brooklyn. I go with my girlfriends and enjoy sitting outside with a delicious Rose and watch the World go by. It's also my children's favorite place. They love the spaghetti Vongole \u0026 their homemade Focaccia. \nThe staff are Super \u0026 always make us feel at home. Especially Francesco!!!! \nHaving spent many times in Italy \u0026 the Amalfi Coast I adore good Italian food and Numero 28 is the best Italian! \nMy favorites the Burrata salad, tuna Tartare, calamari, the Lasagna is to die for \u0026 their Pizza is Insane. Their special Numero 28 with this heavenly Truffle sauce is a Must!", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Great food and service.... It's comfortable and has a nice artsy feel to it.\nThis place is around the cobble Hill area and has a very nice hipster vibe to it.\nThe ginger soda is great", "author": "Da Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-02", "description": "The pizza here is absolutely delicious, but the place is totally empty - for good reason. They have a huge projector TV silently playing the news, or whatever, behind the bar - and they're playing the worst kind of dance hits imaginable. Maybe that works for a midtown crowd, but in this location it's not the right formula. Put on some Italian vibes and turn off the giant screens and you'll get more bums on seats.", "author": "Dantelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "If you enjoy a great Neapolitan pizza, this place will not disappoint. I ordered delivery and my Margherita pizza was hot and fresh with super high quality taste.  Reminded me of Sottocasa and Motorino (better?!). Ordered a delicious arugula salad, as well and was impressed with the quality and freshness of all ingredients. A bit pricey but well worth the indulgence!", "author": "Dana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Have you ever been mad at yourself for not having gone to a place in your neighborhood that's been open for a while, because when you finally go it turns out to be pretty great, so you're kicking yourself for not having gone sooner? \n\nMy wife has that problem, except she gets mad at me instead of herself, and she kicks hard.\n\nIn any case, we should've been coming in here for the past year because Numero 28 is pretty great. We have a surplus of good pizza in this neighborhood, so we didn't really feel the need to check out another, but this cute little spot off Smith Street offers a lot more. \n\nNamely, delicious fresh pasta:\n\nLasagna bolognese. Purple gnocchi. Spaghetti with clam sauce. These are things I like to have in my life, and I don't know why I waited so long to eat them at Numero 28, where they do pasta right. The salads are solid (pear, gorgonzola and pancetta are never a bad combination), the apps are good (I don't know what aurora sauce is, but I like dipping calamari in it), and of course they have pizza, but we needed some good lasagna around here now that Brucie is no more, and I like this one.\n\nWith regard for the pizza, it's not bad by any means. They offer an array of toppings to place atop a not quite thin, not quite thick crust, and I'm not sad about being able to order at 29\" pie. Anything with caramelized onions is a winner, by the way. \n\nBut I'm here for the pasta. And the booze, but that goes without saying.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Finally I found a place that serves Lambrusco. When you drink lambrusco, you are drinking a wine that was enjoyed by the Romans of the Roman Empire. The Romans adored Lambrusco. It was easy to grow, high yielding, and very popular. You can easily imagine Caesar sipping his goblet of Lambrusco, nibbling on cheese, and looking out over this holdings. In general you can find cheap, bad-tasting lambrusco - but you can also find delicious, fresh, fruity lambrusco that is perfect to go with a summer salad. There are also dry lambruscos and even sparkling lambruscos. Give a few a try and see how you like them! Don't judge a lambrusco based on a super-cheap bottle, though. It could easily be that you aren't even drinking lambrusco, and would improperly malign the real grape based on the imitation. This is served cold light and refreshing especially with Pizza.. Great summer drink. LOL you thought I was a sponsor for Lambrusco... Now to the food. Authentic Italian. If ordering the Pizza ask for it well done. Bruschetta yummy...I will venture more food options but as you can see I was excited about the beverage of choice which is very rare........Atmosphere is laid back very comfortable and friendly.", "author": "Irene B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Awesome.\n\nThe vibe, seating, and music are absolutely awesome and so relaxing. I just wanted to sit there and sip wine all night.\n\nAppetizers: we got the buffalo mozzarella with prosciutto which was incredible and a healthy helping for the 4 of us. My co worker said it was the best he ever had, it was totes good!\n\nSpaghetti: we wanted something to split so we got the bolognese fettuccini which was arguably some of the best homemade pasta I have had and cooked all a denete.\n\nPizza: note pizzas are HUGE! We got two mediums and I thought they would take over the world! Definitely probably some of the best wood fired pizza I have had. 2 mediums were a lot maybe one medium and a small would have been good.  We got the Frichettonne and the Parma, the Parma being my fave and blowing it out of the water, but incredibly delicious though.  \n\nThis would be excellent to go or bring home for leftovers. I definitely want to/am looking forward to coming back here again.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "When this gorgeous space opened up in Cobble Hill, I must have passed it a dozen times before finally grabbing some friends for dinner. The first thing they noticed was the thing I love so much about this place: It's huge! Seriously, it's rare to find something that's warehouse-sized in this 'hood, and it's a nice spot to bring a big group for a meal.\n\nThe pizza is amazing (and fairly priced, those complaining didn't comment on the massive size of it). The drinks are also superb--loved the Japanese influence, which was a nod to their chef.\n\nMy only complaint is that the service can be a bit slow at times, but hey that might be the Italian way.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-24", "description": "This rustic chic eatery is so much more than just a pizza joint, but they definitely know how to pizza. I was pleasantly surprised by how stylish and spacious this place is. Complete with a full bar and a bartender who, I've heard, makes some rockin' cocktails, I could even see bringing a date here.\n\nMy friends and I ordered a carafe of their house red, two apps (kale salad and burrata with eggplant), and two medium pizzas (Capricciosa and Diavola). The kale salad wasn't anything special, but the burrata with eggplant was delicious and unlike anything I'd ever tried before. The pizzas were also very delicious. Thin, but still soft crusts and great, fresh flavors. Just looking at the photos make me hungry.\n\nNote that the mediums are rectangular and about 2.5' long! Definitely enough for 3, or 2 hungry people. \n\nOur bill came to just under $130 before tip; a good value for the amount and quality of food you get!", "author": "Juliana T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "Stopped by on a rainy Friday at noon. We were literally the only people there, so the service was of course very good and hands on. The pizza was very good and very filling - could barely get through an individual pie! \n\nOnly issue I had was that they gave us a menu that included brunch items and a sangria that they actually weren't serving that day. We were a little frustrated by that! But, the end result of getting personal pizzas was good!", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Go ahead and read my reviews for other Italian restaurants in NYC. I hate all Italian restaurants here. Especially the two bit guido Brooklyn hacks that stuff their fat faces and all sound like Cyndi Lauper, guys and girls.\nThis restaurant passed my spaghetti carbonara test because it's simply a spaghetti carbonara like the ones I had in Italy albeit less al dente, not the soupy slop and it was delicious. The seafood pasta was delish, especially the shrimp and the sauce. They really hit the mark with the shrimp. \nIn short it's authentic Italian in American portions with Brooklyn prices. Enjoy.", "author": "Thomas C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Numero 28 Pizzeria \u0026 Cucina", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/If-5C7quGC-AZ-mgZ1wHbQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479874819"}