{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "Hands down delicious spinach ravioli, came here after work with a couple friends and was seated  immediately. The only draw back was the inattentive wait staff once our food arrived to the table getting another drink or the bill at the end of dinner was near impossible.\nThat aside this dish alone would have me comeback for more.", "author": "yolanda c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "We sat at the bar and ordered the Gnocchi and Penne with eggplant, mozzarella, and some other things in it. Entree Portions are served in a sauce pan. Portion is ok. Us Italians look for a generous and not healthy conscience portion. The mozzarella sprinkled on top was not melted. To each their own. I would have preferred melted. The Gnocchi was so delicious and flavorful and absolutely delicious. Staff are friendly and welcoming. Oh and pizza is great , just so expensive. Would probably go back.", "author": "Patty Ann M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Thank you guys so much .the host himself hand delivered my order after our lil mix up . They definitely make sure to take care of their customers food was great . I really appreciate it ! The pasta was my favorite part it is amazing definitely think they are worth it", "author": "Arianna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Very good place for pizza. Pizzas are great and je rest of the food they serve as well but most importantly the staff is always welcoming at this place", "author": "James B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Came here with my starving cousin. Although I was stuffed, I managed top eat a fourth of the medium pizza. It was worth the wait. My cousin loveddddd it, we ordered half margherita and some type of meat. All I have to say if I would have been on an empty stomach I would have eaten a whole pizza to myself. Also the place is so cute. Enjoyed!", "author": "Martha D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-30", "description": "My husband and I stopped here one night for a light dish of appetizers since we both were not terribly hungry. The idea was for the apps to get our tastebuds in the mood for pizza. Unfortunately, the opposite happened. The meatballs and calamari both tasted and felt like something pre-made and straight out of a plastic freezer bag. Everything was soft, mushy, and lacking in any hand-cooked texture...think bland, homogenous, \"stock quality\" dishes disguised as something nice. Service was good, but I don't plan on returning. Overall a very disappointing experience at Numero 28.", "author": "Anna Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "I stopped in here on a Friday night and then the following Sunday night. It is a cute place to watch the game as they have a huge screen by the bar. \nFriday we ordered the \"Parma\" pizza with homemade fettuccine with bolognese sauce. The pasta was good but the pizza was definitely memorable because it was so authentic. I had a couple of glasses of wine which is really good here.\nI actually decided to come back Sunday night to watch the game. It was a nice place to watch the game without the \"divey\" feel of most sports bars. This time we ordered the Fusilli with tuna, grape tomatoes and olives and the Eggplant Parmesan. They had bruschetta, mozzarella/tomato salad and olives at the bar for patrons to nimble on which was nice.\nMy overall experience was a positive one. You can taste the freshness of the ingredients in every bite. This is definitely a neighborhood gem and I will be visiting in the near future.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Some of the best pizza made by reeeeaaal Italians... From Italy LOL\n\nA we dropped in for a quick bite at midnight.\n\nThe staff was friendly, no one rolled their eyes at us strolling in almost at closing.\n\nThe place was lovely, warm and intimate. Nicely decorated and clean. Even their bathrooms were well kept.\n\nWe didn't explore everything that's offered here because the place was closing but there was a full bar with some interesting looking cocktails on their menu.\n\nThe pizzas were pricy but worth every penny. We got a margarita pizza. Thin crust, fresh, flavorful, non greasy... Just top quality. They gave us a bowl of fresh parm cheese to sprinkle as much as our hearts want. But honestly, the pizza was so flavorful, I chose to just enjoy it as is.\n\nWe were very impressed and we're glad we stumbled on this place accidentally.\n\nAfter we took our first bite, we basically committed to coming back to try more. \n\nGreat little gem here.", "author": "An B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-26", "description": "This restaurant is just OK. The service was good, the atmosphere was nice. The food is very average and so over priced. My mom and I ordered 2 pasta dishes, the sauce was exactly the same, one was just a bit spicy. I am a huge dessert lover and we ordered 4 different once, they were just OK. Would not go back here. Ordered bloody Mary, didn't have vodka.", "author": "M A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "First time customer at this venue. I had pizza at the 7th Ave location and their pizza was very authentic. \n\nWe sat at the bar. The place was comfortable and the service was good. Pasta not salty and well-prepared. The cocktails was well-made. Looking forward to trying the pizza next time.", "author": "May L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "The prosciutto on the Parma Pizze was so salty I had to take it all off. The dough was delicious, but I couldn't even enjoy the pizza with how salty it was. Only reason I tried this pizza is bc of the 35% first time offer I was given. Will likely not order this again.", "author": "Adam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "A solid four star. Pizza is tasty and authentically Italian. Aranci, vegetables, salads and desserts are very good as well. Service is friendly and efficient. What's not to like? Kid-friendly; takes reservations; easy on and off the F train. Definitely recommend.", "author": "Ileinie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Beautiful restaurant with authentic Italian pizzas (and staff!). We went in during brunch hours (they do have a brunch menu), but decided to stick with personal pizzas- the Italian way! If you've ever had pizza in Italy, this is going to bring you back to that delicious moment. If not, let me give you a virtual taste. Italian style pizzas are usually 10-12 inches and made for a single person. That's a sort of fun size where you're going to feel really happy (and then really sad) if you eat the whole thing yourself, but you might start slapping your dining partner's hand if you just share one. The pizza is very thin, though not crispy, and has the best quality ingredients and sauce adorning it. Bellissima! \n\nThe restaurant is very well done, cozy and chic, and the staff are great. Highly recommend checking it out.", "author": "Reana K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "Pizza was good but for  $32 for a take out medium pizza I'd expect it to be sensational. It wasn't that. It was a good pizza but it should have been $20 Max. Otherwise what's the point of coming here rather than going anywhere else?", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-21", "description": "I walked out hungrier than when I walked in.  Ordered a medium pizza for me and my child and was incredibly disappointed.  Perhaps we ordered the wrong thing as at $30 for the pie I would have expected it to be delicious.  We left and saw Doninoes across the street any my child said 'we should have gone there.'", "author": "AE F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-19", "description": "Stopped there to watch the Yankee game yesterday. I ordered a beet salad and fettuccine bolognese. Both were inedible. The salad looked like they had dumped a can of cubed beets on a couple of pieces of wilted lettuce. The pasta was overcooked withh a tasteless, greasy mess of a sauce. The staff was clueless. After I left my order virtually untouched the only question they asked was if I wanted another beer. With so many great places in the neighborhood I don't ever need to go back.", "author": "Don O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Great restaurant, Italian style pizza.  My friends and I came here for brunch and we were happy to sit outside on a beautiful day.  We had a white vegetable pizza, a stuffed focaccia sandwich and an omelet stuffed with potatoes and onions.  All were very good as was the service and the prices.", "author": "Laura B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "I came here a few times and always it has been such a lovely experience. The restaurant is very cozy, the food comes out fast and it's always tasty. Definitely a spot to go if you crave pizza, you will not be disappointed! Give a try to handcrafted cocktails as well", "author": "Lana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "I came here with my parents around 10 PM on Saturday night. The space is gorgeous; it's cozy and light with great front windows (the front walls are entirely windows) that overlook a quiet, residential block. The room was lit with candles and soft lighting that gave it a romantic, comfortable feel. \n\nThe waiter was fantastic and the food was spectacular. My dad and I shared the Arugula salad (fairly basic: arugula, cherry tomatoes, and Parmesan cheese with a nice, light balsamic dressing) and a sausage pizza that was enormous (we got a medium--there were plenty of leftovers). My mum ordered the calamari which were delicious (lightly fried, chewy, perfection) and the eggplant Parmesan which I believe is an appetizer but satiated her just fine.\n\nThe food is fantastic, the atmosphere is wonderful, the service is great. I HIGHLY recommend Numero 28 for date night or just a nice dining experience.", "author": "Maria W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-18", "description": "Food was good, in my opinion needs a bit more seasoning but overall good. The service was a bit on the slow side being that we were the first ones to walk in.", "author": "Amy G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Numero 28 Pizzeria \u0026 Cucina", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/If-5C7quGC-AZ-mgZ1wHbQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479874819"}