{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "Kogane turned out to be better than I'd expected. From the outside this spot is very unassuming. And the interior is quite humble as well. \n\nBut the ramen packs a punch. We ordered the spicy ground pork ramen and the tonkatsu ramen, as well as the vegetable gyoza. It was all very tasty, especially the spicy pork ramen. And for under 15 dollars a person, it's a great bang for your buck.\n\nWill be back!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-10", "description": "Standard novices trying to jump on the ramen hype train. Not super terrible but mainly just really subpar is all area.\n\nTonkotsu ramen broth really tasted like it was from sun ramen prepackage. The toppings were flavorless. Seasoned egg was underseasoned. \n\nService was terrible. Waited, no one came for my order had to ask for it. Nobody asked if I needed anything or anything. Didn't bring check which I had to also ask for. Mind you  this was 1pm on a Monday and the store had a total of like 4 people with Two waitresses. Like come on! You had 2 person each.. that's really good coverage sigh...\n\nLong story if u live nearby n u hafta eat there I guess what can you do. But I would never go back and prol warn all my non-existent friends to avoid", "author": "Walter W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "So good. Love the small cans of sake they offer. Bowls with ground pork are good but I suggest adding the chashu as well. To me it's all about the season egg and they do a pretty good job. Service is always pleasant too.", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Been here at least ten times and always had spicy miso ramen. So good it made me a ramen fan after some resistance.  They added outdoor seating. Pretty decor, too.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "This place was awesome. Very clean and fast. The service was amazing, they were extremely nice, never let us run out of water, checked in constantly and they let us split the check on 5 cards. \n\nI got the pork gyozas and the ramen burger and paid $17 plus tax. The burger was a good size and it was delicious. Overall awesome experience.", "author": "Rodolfo O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Our weekly drop in. Great veggie noodles, great service, great hot sake.  The ambience is great but tight spot. Prices are great. Go now :-)", "author": "James O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-26", "description": "Decided to stop in after reading reviews. I only ordered appetizers..so here it goes.  The seaweed salad...delicious. Wings in a chili lime sauce sounded great but the reality is they were AWFUL!!! Bland, burnt on the outside partially cooked inside and that so called chili lime sauce was unbearable,  lacking the two main ingredients chili and lime....hmmp go figure. The gyoza vegetables also bland, no need to expound. Lastly, the sweet potatoe fries at first glance looked inviting....but the first taste was very very over salted to the point I did not eat them nor the raw chicken wings...smdh. \n\nNeedless to say I will not return.", "author": "Trish B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "It was a lovely meal! Staff was courteous and the food delicious. Was able to sit outside and the waitress recommendations did not disappoint. Good chill place for a quick bite. Get the tuna!", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "Tonkotsu ramen was impressive. First, the bold smoke scent from pork on top hits and the fat later on broth was pleasantly wrapping my tongue. Tonkotsu broth was bit mild but still has a presence. The noodle was perfectly cooked in al dente. The balance between umami side and fatty elements were really good. I'd love to come back here and check out other ramen soon!", "author": "KwangHoon H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "My friend \u0026 I stumbled upon this place on a day out \u0026 we were starving. The food was amazing. We didn't expect it to be that good. We didn't have enough cash on us, though, so when it was time to leave the tip, the girl at the front got upset because we didn't have much. We had to leave change which made it worse, but I don't know what she expected.", "author": "Tania P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "Excellent basic tonkatsu ramen! \n\nThe pork bone broth is rich and  tasty \nHomemade noodle is al dente\nTender pork jowl melts in your mouth.\n\nFor only $13, I will definitely go back", "author": "Gary K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "This place was a cozy and delicious respite from the snow for lunch. We went around noon and it wasn't too crowded. I got a curry-based ramen and my sister got the stir fry ramen. The curry broth was rich and flavorful, but not too overwhelming. The waiters were very attentive the entire time, constantly refilling our waters. The bathroom was very clean and modern. Would definitely go again!", "author": "Carolina Grace K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "Tonkotsu Ramen (great soup, great noodles, great pork, its just great)\nsweet potato fries (great potato, great sauce, its just great)\ntakoyaki (great)\n\nI will be coming back for more.\n\nService is good, they are responsive and polite.  Also knowledgeable about their drinks.\n\n4 star, because everything else on the menu is just okay.  Especially their dessert, they really need to work on their dessert...", "author": "Simon L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-23", "description": "Very decent ramen place at reasonable prices. Great location, I like not having to have good ramen without waiting 1+ hours in Manhattan. \n\nI tried the curry ramen, which was very flavorful but I didn't like how the fried pork was already getting soggy by the time I was eating it. I thought the handmade noodles were great and an interesting new texture (a little skinnier than what I like, but still very tasty). I also really liked that they give a huge portion of noodles, which is a plus. \n\nI'd come back again if I were craving ramen and was in the area!", "author": "Christina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Nice cute local Japanese ramen shop. Got the spicy vegetarian ramen which had bell peppers and okra which was a little strange. Would have preferred it to have sansai and the more traditional vegetables. Also note $20 minimums for credit card use. Decent but not worth a special trip to visit.", "author": "Adelyn Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-17", "description": "Good but they serve the smallest portions I've ever seen except for soup -yawn. All really delicious just way too small. Drag because very few good food options in this area.", "author": "Disco .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Tonight was my third time coming here. The other two times were for lunch. I must say the lunch menu has much better prices, but the dinner price is reasonable. Great ambiance and is always a warm temperature for those cold winter days.\n\nThis is a good restaurant. Will it blow you away with amazing and creative dishes and refined waitstaff? No, probably not. However the staff is extremely professional and the ramen bowls are great. I specifically like both of the pork ramens, but I prefer the one without the jalapenos.\n\nNote:\nTwo other customers were here tonight and were being extremely rude to the waitress regarding the BYOB policy. Little did they know they were sitting next to Joseph N. \"The Food Mercenary\" who was ready to make fun of them on the internet with his skills obtained from working in the restaurant industry for over 12 years.\n\nCurrently the restaurant does not offer BYOB and the waitress was attempting to explain to two men (who do not look like they have worked in a restaurant in their entire lives, I am talking real trust fund looking baby-men) that the restaurant had applied for BYOB status and would hopefully receive it in a month or two. \n\nThese guys would not let up, they kept saying the restaurant would be closed in a month and that the review would be terrible. The waitress apologized and acted very professionally. As a previous server, I thought she handled the situation exceptionally well.\n\nI hope that other customers will understand the current BYOB policy and will not cause a scene and be rude to the waitstaff.", "author": "Joseph N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-19", "description": "Didn't have a good experience, maybe it was that day... Service is good, considering it seemed like they were short staffed. The servers kept their smiles and service, and whom seemed like the manager was running around servicing customers as well, so there's no complaint there. Just the ramen was just so mediocre. Had their lobster, shoyu, vege, and spicy miso ramen. The noodle was over cooked, and the broth lacked any depth. It was just covered by the sauce or tare, which wasn't good either. We couldn't finish it...\n\nRamen is one of those things that you find the store you like and it grows on you. This place just wasn't for me.", "author": "Kozo T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "Not the BEST ramen I've ever had but for my girlfriend and I's one night layover in Brooklyn this place was just what the doctor ordered. Nice and spicy with fresh ingredients and a pretty damn tasty broth. Also the atmosphere was perfect, the wooden walls and dim lighting created a really inviting ambiance especially after traveling for 7 hours from Europe.  Definitely recommend!", "author": "Jake F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-06", "description": "Been here before for lunch and loved it. Today stopped by to have seafood ramen and it was just bluh. No flavor, 3 shrimps, and frozen little piece of starving lobster. Definitely not coming back here. There are so many good ramen places in NY and unfortunately this place is not one of them.", "author": "Iryna S."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}