{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-28", "description": "My first ramen experience (other than the 25cent packs). I got the chicken which was not spicy  but instead very very salty. Food was good and not that expensive ($13) but was not very filling. Restaurant is small and cozy (fits about 20). The staff was nice but didn't go much farther than taking out order and bringing the bill at the end. It was a nice experience, wouldn't rush back.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-20", "description": "Fairly good ramen in this tiny, packed Brooklyn Heights hole in the wall.  Service was a tad pushy and cold.  The server asked what appetizer we wanted but the selection wasn't that great so we opted to skip appetizers.  We were asked a second time and when we said no thank you, we were given a rude glare.  Ordered the shoyu ramen and though the chicken in it was delicious, the broth was a tad too salty and the noodles a bit too chewy.  The tonkatsu ramen had a better flavor.  Portions are a tad on the smaller side.  It's still better than most ramen in the area but certainly not the best.  Service, though fast, needs some courtesy work.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-22", "description": "First I just want to make it clear that the 2 stars is for the ramen only. It's edible but definitely wasn't worth the trip. I ordered the spicy miso ramen. The broth just wasn't right; barely taste the miso + the consistency was very watery. There was no char siu like most ramen bowls but instead there was minced pork. The noodle tasted kinda starchy + wasn't chewy at all. The egg was extremely salty.\n\nThe only good thing out of my meal was the wings; so good I ordered another one! It was so tasty + the lime dipping sauce was delish. But I wasn't there for the wings. I was there for a good hot hearty bowl of ramen + that was major foodie fail.", "author": "Quyen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-25", "description": "I've given this place so many chances and finally found a ramen I like - seafood ramen. I basically disliked all other ramens I have tried, especially the spicy veggie. But the stuff were so nice that I kept coming back.", "author": "Phyllis J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "It was our first trip to Brooklyn Heights and we were hungry for lunch!  We wandered around looking for somewhere to eat and randomly decided on Kogane Ramen.  A quick check of the online reviews made us feel like it would be a decent choice.\n\nIt was a cold, rainy day in May and we were looking to get something in us to warm up.  This hit the spot.  We were treated nicely by the 2 girls out on the floor.  The apps hit the spot, we had the grilled peppers, edamame, and the pork gyoza.  We had the Yaki, spicy vegetable, Tonkotsu, and Shoyu ramen.  All 4 of us enjoyed our meals.\n\nI'm a simple white guy, originally from the Midwest, I'm not going to claim to be the #1 authority on authentic Asian food.  In fact, I'm not even a big Asian food fan, BUT I love me some ramen (not the packs you ate in college, which taste like pure salt) and this was good ramen.  To me.  At least I've actually been to Japan (and China!) and eaten authentic ramen.  I suppose I've got that going for me.\n\nThe portions were good, the service was decent, and the place was nice.  After walking for hours visiting the sites, I wish my chair would've had a back.  That's my gripe.  My back was sore from the miles of walking we'd done already and I was looking to relax while I ate.  The seats were hard and backless.  Is that a big problem?  No.", "author": "John L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "What a gem of a place! Delicious food, fair prices, and attentive service all wrapped in a cozy atmosphere. If you're craving Ramen, do yourself a favor and check this place out.", "author": "Mgo T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "Good ramen!  We had the tonkusu ramen and the shoyu ramen.  Both ramens were good flavored and noodles were in good texture. The jowl pork buns and blk sesame tuna were delish. Definitely recommended.", "author": "Jenny G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "Ate here on a Friday night at 8 and was pleasantly surprised to find it not packed although there were patrons. Had the pork belly bun to start which was decadent with a slick of spicy mayo. My companion and I ordered the Parco Ramen and the Red Tonkatsu Ramen. The Parco was the clear winner for a couple of reasons. First the curry broth was savory and unique. Second the pieces of breaded pork cutlet inside were lean and tasty and the reason soaked in the broth flavor. The Red Tonkatsu was good but it was so spicy we couldn't finish it as our mouths slowly went numb. I like spicy but wasn't expecting it bc the menu description didn't warn of the heat factor. Attentive service.", "author": "Kerri M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Kogane is a small but clean and cozy restaraunt hidden on Old Fulton near DUMBO. The service is great and the food is amazeballs. They have a few different kinds of ramen on their menu, although the spicy tonkatsu is my favorite. I usually try the tonkatsu based ramen when I go to a ramen joint because thats what I base everything else off of. Anyway, the ramen here is delcious as hell and the spicy broth is perfectly oily and rich. The price is decent too, for such high quality food with great portions", "author": "Arthur V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-02", "description": "I  would like to say it was good sorry  it wasn't. Went there with my wife and daughter. There meal was ok I guess.I ordered the seafood ramen big mistake .the shrimp was overcooked  the broth had a faint taste of seafood not enough depth in the broth. The snow crab leg also overcooked and a taste of ammonia an smell.I'm  sorry can't  say soup  experience worth it left there nausea.I  hope  I  don't  start puking", "author": "Ernesto G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-18", "description": "Long overdue review - I live in the area and was excited to try this ramen place based on reviews but this was such a disappointment. We ordered the red tonkatsu with chicken and the chicken tasted rotten. When brought to the servers attention, their response was we changed suppliers. I really wanted to love this place but unfortunately will not be returning.", "author": "Christy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "I usually venture out into the city when I'm in town but I was pleasantly surprised by this place! The appetizers were delightful and the ramen was pretty good. I left this places stuffed AND satisfied.", "author": "Ria R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "Popped in for dinner. It's a very small place with only a few tables. But we were able to be seated almost immediately for two. The place gets very steamy because of all the ramen being prepared. So your clothes will smell of ramen. \n\nI ordered the Tonkotsu Ramen. It was so delicious. The ramen was thin and firm. I couldn't tell if it was hand made. But the broth was everything. At the ramen places I've been to the broth is usually very salty. But here it was light and very well seasoned. I could drink the broth like soup! (I should have). I think it was the right portion of meat for the size of the bowl (but can there ever be enough meat?) I wasn't left craving more. \n\nWe also got sides of pork gyoza and chicken wings. The gyozas were so delicate. I have no idea how they get the wonton skin so thin. The pork was well seasoned. The fried chicken wings were very crispy but tasted odd. I think they used a different type of oil. It tasted very nutty like coconut. Don't think it I enjoyed that. \n\nOverall it was a great experience and want to go back soon. It would be the perfect place to grab lunch or dinner especially as the weather starts getting colder.w", "author": "Bennet G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "Great ramen place ! The restaurant looks new, very cozy and clean. They serve ramen in big bowls and everything is delicious. If you have been to Chuko in Brooklyn, you will love this place as well. I will def coming back here!", "author": "Ester L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "The place was pretty cozy. Customer service was pretty friendly. Fast service, nonetheless, the spicy red miso ramen was a bit salty compare to other places", "author": "Anh T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-21", "description": "The best ramen in Brooklyn Heights / Dumbo is finally here. Definitely worth the visit if you're in the neighborhood.\n\nThey opened in Fall 2015 with an assuming wooden front. Was served complimentary green tea on my visit for lunch.\n\nThe ramen, both noodles and broth, are flavorful, and well balanced. The fresh ingredients really come through. Ordered the Spicy Miso - which wasn't that spicy at all but had a great umami depth. Also ordered the stir fried yaki ramen which came with deliciously fresh vegetables.\n\nAlso ordered their fried wings for an appetizer - those were crispy and delicious and the sauce was a great addition. \n\nThe service was very attentive - though we were the only ones in there after the post lunch rush. Enjoyed the details like the wooden soup spoon, and the post wing wipes. \n\nWill keep updating this review as I explore other bowls and dishes but very excited to come back and to try their whole range of noodles. Eager to see how they impact the neighborhood and vice versa!", "author": "Larry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "If you're looking for some warmth you should visit Kogane with its cozy atmosphere. They serve amazing sweet potato fries and red tonkatsu ramen that harbors so much flavor.", "author": "Jenny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "The spicy veggie ramen is my favorite in NYC - I have tried enough bland, thin vegetarian ramens to know how special Kogane is. The broth is flavorful and rich and the included vegetables, including sliced red peppers and greens, make for a hearty, beautiful meal. (They have two vegetarian options so if spicy isn't your thing, you have another option but I think the spicy is far and away better) Bonus that the service is friendly and the tiny restaurant is cute.", "author": "Colleen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "I'm not sure where to begin other then WOW. Got the miso eggplant starter which was rich in miso and eggplant flavor and the vegetable gyoza. The gyoza had the perfect amount of heat. The chicken shoyo ramen might be one of the top 3 ramens I've ever had. The broth was super rich in flavor and it was a very generous amount. Seating is tight so come early. I will def be back here!", "author": "Cait M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Such a sweet place. Small and cozy. Tables and benches. The Yaki Ramen noodles were phenomenal. Perfectly cooked noodles and veggies. Brussel sprouts were outstanding.", "author": "K B."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}