{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Having been spoiled by the likes of Ippudo in Manhattan, I was curious to check out some of the Ramen spots in Brooklyn.\n\nGot Spicy Miso Ramen. \n\nBroth was pretty flavorful but not quite up there with thickness and richness of those I've had before. Noodles were perfectly al dente. Pork slices were OK -- they felt a little rough, missing tenderness and flavor. The big turn off, however, was that the egg seemed to have been pre-cooked before and just warmed up before serving. Forget about runny yolk dripping into the bouillon, I could still feel egg insides being slightly cold in the center.\n\nOn the plus side, their Gyozo appetizer was great. I'd give this Ramen 3.5, but the place deserves 4 stars for all the other things.", "author": "Juriy Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Got the veggie ramen. Good portion size and tasted great. There were plenty of mushrooms, which I love, and the noodles were the perfect texture. Solid choice, would go back!", "author": "Saloni D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "This is great place for inexpensive yet delicious food.  I love their spicy miso ramen.  Big portion and very tastly.  And sateed brussel sprouts!  After eating them, you will think about brussel sprouts differently.  So addictive.\nI grew up with ramen.  I can honstely say I know ramen very well.  By far this is one of the best place for ramen.\nI like the ambience.  It's small, friendly place.", "author": "H L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-21", "description": "The food is really good - I'm a sucker for the octopus balls and pork bun. The ramen is really beautiful - the noodles themselves and the incredible broth! It's amazing what they do with that little kitchen! \n\nIt's down the street from my apartment too which  is pretty dangerous.\n\nMinus one star because the service could improve. Every time I'm there, they either forget something and ignore us, or are all over us, about to take our plates before we are done. I this this will improve though - just gotta work the kinks out!", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "On my trip to New York for New Years I came across this spot on New Years Day. \n\nThe story goes that eating long noodles leads to long life so what better way to start 2016 than to get ramen?\n\nTo start, the place is cozy and friendly. Very clean with a traditional Japanese ramen vibe. \n\nWe started with the fried wings as an appetizer. The wings were crispy and the chili lime sauce was very tasty. \n\nFor my main I had the ramen burger. I honestly thought it would be ramen with beef. I was incorrect, in the happy but incorrect. It was actually a hamburger and the bun had been made with ramen noodles cooked in a circular mold. The burger was good and the ramen buns actually worked very well. \n\nIf I lived here I'd definitely be back.", "author": "Shawn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "Looking for a place in Brooklyn to eat, and stumbled on this gem. Bowls have generous portions, loaded with flavor. This was my first time eating a Ramen bowl.. and I'm hooked! Service was excellent... good food and good service made for a great dining experience", "author": "Lori T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-02", "description": "I am disappointed with this ramen spot. I ordered for takeout and it was ready by the time I got there. The good thing is the broth and noodle are in separate container so the noodle doesn't get soggy. What disappointed me was the I am the pork which was hard and chewy. I understand ordering ramen to go is not the best idea so I didn't have high expectations. But they really did terrible with the pork so can't let that slide. \n\nDef wouldn't order takeout again but I might give it a go for dine in.", "author": "Julie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "After a long night of New Year's Eve party, I needed a hot soup to ease a terrible hang over. I thought this was a perfect meal and the first of many delicious dish that I'm going to eat this year. \n\nI've been in this area before but I've never noticed this place. It's a few steps away from Clark St. subway station. Its a tiny restaurant with most likely 20 seats including the chef's table. I like the way how its decorated, you definitely feel the Japanese vibes of the entire premises. The table and chair setting was unique and very creative. I would say its probably one of cleanest Ramen joint I've ever visited.\n\nUpon entering the premises, I was greeted by the server and directly seated. Just like a small restaurant in Japan a complimentary tea was served before the meal. My intention of this visit was to try their signature dish which was the ramen however I can't resist to try the Chicken wings. I'm glad that I ordered it  because it was absolutely delicious. It was tender and juicy. As for main course, I ordered the \" SPICY MESO RAMEN with pork belly. Oh man, the entire dish was extraordinary. The broth alone was flavorful and the noodles itself was cooked to perfection.\n\nIf I lived here, this would definitely be my go to restaurant.", "author": "Cris T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "The ramen here is pretty good! I was pleasantly surprised. So far, I've had the Spicy Miso and the Spicy Tonkotsu. Both have good depth of flavor. Could have used more meat though. \n\nI did find that everything besides the ramen (like appetizers) tends to be a little overpriced though. 4 takoyaki for $7. \n\nAll in all great place! Glad I found out about it.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "Was drawn to this ramen shop from thrillists recent list of the 21 best ramen shops in New York.  I was skeptical of the inclusion having not heard of the shop, but after eating there, i agree that it is more than justified. \n\nI had the pork jowl bun, the tonkutso ramen and my favorite cheap Japanese beer - Orion.  \n\nThe ramen has depth of flavor, perfectly al dente noodles, and very nice pork in it.  The buns were tasty too. \n\nSo 5 stars for the food.  \n\nI have to knock off a star because of lack of ambiance and it being very warm in the restaurant.  That said, the service was very good.  I highly recommend it but maybe not as a fancy date.", "author": "Ian A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "food was great! not sure y, but an appetizer was discounted? or came with one of the meal noodles? not complaining but that was unexpected lol thank you! i would love to come back soon. just one of the waitress, hostess? wasnt quite friendly. my mom couldnt make up her mind whether to sit in door or out and the waitress didnt seem to happy about it. she kept a grumpy face the entire time we were there. thats y im giving one star less. but the noodles r worth going back for", "author": "Hel E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "I decided to come here last minute. Don't regret it all! I was quickly seated and served. Food came out relatively fast and it's tasted great! The ramen burger is actually crunchy unlike most places that are served soggy and weird. The only downside to this is that gloves weren't supplied for the ramen burger and it was super oily and messy. Would definitely come back", "author": "Carmen T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-06", "description": "Typical ramen place. Ramen tasted decent, nothing really stood out to me to think it was delicious. Quick service though.", "author": "Laura F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-20", "description": "Used to be a good ramen place but after the customer experience I had I wouldn't even give one star.... ordered food using seamless food was suppose to arrive in 45 mins, at one hour after I called the restaurant asking where my food was response it's out for delivery. 20 mins later I ended up canceling my order as they hadn't even made it. Whoever picked up the phone and lied to me about my food being on its way when it was a blatant lie should be fired! This is not how you treat your customers. I wonder what else they lie about? Is the pork even really pork? Are the noodles actually made fresh or are they from a packet? Once you lie about one thing it's easy to lie about multiple things including what's actually in their food. Be warned before you find out what they have been lying about to you this whole time.", "author": "Po T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "I decided on the braised pork cheek on bums appetizer and the miso lobster ramen, both were skillfully prepare by the chef at the noodle bar. The pork cheek is flavored with the perfect amount of seasoning as not to be overwhelmed by the spices so that the pork is center stage at all times as I devoured the appetizer, the bums itself were soft and moist. The broth for the ramen is rich and tasty, never turning into a salty experience like most of the ramen broths I've encountered, with all the ingredients in the ramen tasting fresh and delish. The waitress was also very friendly, overall a good meal and I will return to try it's other options in the near future.", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Got the spicy tonkatsu ramen, best I've had in a long time.  \n\nWould highly recommend the jowl bun, basically no chewing required.", "author": "Mark C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "I had the miso spicy ramen and it definitely met expectations. I ate the entire dish right to the bottom. We ordered dumplings as well which were mediocre, hence 4 stars. I would stick to the ramen, but overall a great Japanese place in the neighborhood, I wouldn't pass it up if you're in the mood!", "author": "Mike L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Love this place. The atmosphere is so cozy and authentic! The lighting is soft and seating is family style w great decor! I recommend the tonkutso and shuyo ramen! For an appetizer I did the pork gyoza which was also amazing! Lastly do not leave with out trying the oze sake! It went perfect w the meal! I'm sure any dish from here would be a hit!", "author": "Kina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-25", "description": "Legit! Great bowls, always steamy hot and so tasty! I love the Red Tonkonso AMAZING! I can come to this space year round. I've tried every appetizer and they are all good.  I'm here at least once a month. Keep it up", "author": "Chris W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-21", "description": "New ramen shop that says they make their own noodles -- reason to be excited, right? The shop is very nice and can probably fit about 30 people - and the menu is a typical ramen shop.\n\nThis time around -- I passed over the pork buns and just went for the main deal. Whenever I try a new ramen shop -- I stick to the same thing so I can measure them all against each other -- the Spicy Miso Ramen.\n\nThis Spicy Miso Ramen came with flat noodles (I never ask - but they are always wavy everywhere else) - with not a bounce in them. Kind of just a boring noodle :( The broth was good - but I would not call it rich nor flavorful.\n\nI would give them another visit if I was in the area - but it wouldn't be the destination that I was hoping it would be.", "author": "Jaclyn V."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}