{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "I always love a good bowl of ramen!  Prior to coming to this restaurant, my fiance and I had our engagement photos taken in DUMBO on a frigid afternoon.  Ramen seemed like the perfect way to warm back up.  I had the red tonkatsu ramen and it was definitely a little spicier that I thought it would be, but it was still very enjoyable.  \nThey had a pretty limited wine selection... they were out of both of my top two choices of reds the evening we went. Other than that the restaurant itself is small, but inviting.  Staff is attentive.", "author": "Kristina I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Amazing place! Went today to have lunch and I ordered a Tokoyaki and the original ramen and it was amazing! Good taste and service! Good price has well!", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "This place is awesome. I've been a couple times now. Intimate, food is on point across the board. And it's priced well compared to other ramen places. Best ramen in Brooklyn!!\nI love this place more and more every time I go", "author": "Jillian T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "Travel near and far for a good bowl of ramen.  Kogane Ramen is a quaint ramen eatery in Brooklyn Heights with both indoor and outdoor dinning area waiter service.  Modern ambience but with traditional Japanese roots.  Service is attentive and prompt as I was immediately served and without hesitation placed my ramen order also requesting my favorite: green tea.  The green tea is authentic Japanese as the aroma is fragrant.  The ramen bowl is extremely deep in the depth and the noodles were delicious but not abundant as I hoped.  A wooden spoon is provided with a lip that prevents the spoon slipping into the ramen bowl.  Upon scanning the menu there are the standard small plates:  Gyoza, shumai 燒賣 (siu1 maai2), and edamame which were very enticing.  One unisex facility, which is relatively clean but spacious.  The facility is modern of bathroom vessel sink with bowl above the counter.  I do not suggest this café for large groups as this business would not sustain large parties.  This café is very accessible by the A and C trains at High Street- Brooklyn Bridge.  I would return to eat my fill for more ramen and try the gyoza or shumai and maybe their plum wine.\n\nTonkotsu Ramen $13\nPork bone based broth, braised pork jowl, menma, Japanese wood ear mushroom, half soft boiled brown egg, scallion, and black garlic oil.\n\nTravel near and far\nAcross the miles\nIn the passage of time\nIn search for good food\nCome for the ramen\nFeed me, feed me, feed me!", "author": "Tina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-28", "description": "This cute little Woden interior place is a great spot to visit if you want the manhattan feel but don't want to be in manhattan. My boyfriend's veg ramen was delish, I like my pork belly ramen so-so, not a fan of a rich fatty broth. But everything else was great including their veg gyoza. I also love their deep ramen bowls and wooden utensils. Def going back!", "author": "Meetal P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "I used to work in the area, and found this Ramen house on yelp. Stumbled in here right after the lunch rush hour on a super cold December day. Found that they were still packed, but the vibe was awesome! It really felt like I found myself in a ramen house in the middle of Tokyo. A few tables with groups chatting and eating, and then there was the bar which viewed into a picture window of the kitchen area so you can see the cooks preparing your meals. \n\nI was seated rather quickly by the waitress at the bar as I was by myself. Felt a bit bad because there were 2 couples waiting ahead of me. The waitress was super friendly and took some time to tell me about her 2 favorite dishes. One being the curry ramen the other being a pork belly based ramen, I opted to try the pork belly as she said it was much spicier. Also ordered a Japanese cream soda, there is 2 on the menu one being melon and other just says white cream soda. I was under the impression that the white cream soda would be similar to a Caribbean/West Indian cream soda, but when the waitress brought the can it had some english on it that mentioned yogurt cream soda. I will say I was pleasantly surprised, way better than it sounds.\n\nNow down to business, the bowl of ramen came piping hot. I could feel the steam warming up my face, and the smell was just out of the world. I first tried the broth which instantly woke up my taste buds. Just the right amount of spice, and the flavors melded so well together. The noodles were on point, not over or under cooked, great flavor. All the other ingredients just came together to make the perfect bowl of Ramen. There are some add-ons you can order for an additional fee, I wish I had asked for the corn just to try it. But regardless this is one of the better ramen experiences I've had in a while. \n\nThere are several ramen options on the menu to satisfy everyone, including a seafood and a vegetarian option. I'm going to be sure to visit again if I'm ever in the area. Great atmosphere, awesome menu, excellent service, and prices are well worth every penny.", "author": "Ravi P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "Wonderful restaurant with exceptional food, service, and prices. Highly recommend for a well priced, delicious ramen meal in Brooklyn heights.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "So delicious, and such kind and helpful staff. Ducked in here after a freezing cold walk around brooklyn and can't wait to come back!", "author": "Diana G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Okay, so me and a friend stumbled on this ramen place since no restaurants were open on President's day and we were in the mood for ramen. \nI was pleasantly surprised. I liked that they offered alot on their menu. For appetizers, I ordered the pork gyoza, Shitiso peppers and pork buns. They were all good especially the pork gyoza.\nFor the special, I had to get the lobster pork bone ramen special. It was everything you would think and more. For bonus, they had a nice size claw, tail and pincer in the ramen. \nThey also have a nice variety of desserts which I definitely will try the next time I visit.  All in all, it is a really nice cozy neighborhood spot with really nice waitstaff.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "As an avid ramen fan in NYC, I am pleased to say that Kogane Ramen is excellent. I've been here a few times though today I had the Red Tonkatsu ramen, spicy buns and Brussels sprouts appetizer. The Brussels sprouts were cooked nicely, marinated in a butter soy sauce with diced seaweed. The pork in the spicy buns was diced and tasty, topped with a light spicy sauce in the bun. \n\nFinally, the ramen, the main reason you will come here. The noodles were cooked to perfect al dente, while the broth was not too thick, not too spicy, but very flavorful. The hard boiled egg soaked up the flavor of the broth to make it a delectable side great, while the pork was BBQed equally well. Overall I was very happy and very impressed.\n\nI would say that Kogane is on par with some of the my more favorite Manhattan based ramen spots such as Misoya or Nakamura, and it can hold its own. If you're in the Heights, try it out! いただきます！", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "This ramen restaurant deserves 5 stars!! The customer service was excellent. The waiters tried their best to please my family \u0026 I and were very kind. The food was fresh and well priced for the large portions. I recommend this place for anyone- kids, couples, or simply by yourself.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-19", "description": "Haven't had ramen in years was it good or bad you asked. I dont even know it was satisfying and it had okra in my veggie ramen. Ok it was great what wasnt was the fresh seedless pickle with ketchup type stuff on it wtf! The atmosphere is nice but that long bench sit on the inside is just awkward.", "author": "Tram Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "We ordered two spicy miso ramen orders and extra noodles last week because it was seasonally appropriate to do so. \n\nDespite Kogane not coming up as an option in our neighborhood on Seamless, it came up through Yelp. We jumped on it!\n\nThe bad is that delivery took about 90 minutes, significantly longer than the estimate. However, they were apologetic when I called to check at 80 minutes. The delivery person also apologized. I'm going to give them the benefit of the doubt that there was a snafu with the order service and give 5 stars. \n\nI usually prefer a different type of noodle, but it was very, very good. Broth, ingredients, everything. It's likely that we will order again and hope for a quicker delivery time.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "cute ramen place that's not too loud and has table sizes that are perfect for people in pairs or singletons. i'd come here with one good friend i'd like to have a conversation with, or with a good audiobook to listen to if i were to sit by myself.\n\ni come here regularly for the brussels sprouts. (granted, if left to my own devices my food intake would probably end up equilibriating to 95% brussels sprouts, so my words are biased anyway)", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "So this is my go to spot for Ramen. My personal favorite is the Tonkotsu Ramen for 13 bucks. For whatever reason, ramen in NYC is really pricey, which is the only reason I took off a star. The service is quick, the ramen is absolutely delicious. They also make their own noodles. The noodles are the perfect firmness and the broth is delicious. The pork jowl is fatty (fatty is good) deliciousness. They do serve other appetizers but I simply go for the Ramen. You can get extras but the extras are a tad pricey. The egg they serve is good with the soft yolk. The setting is intimate as it's not very big. During the summer months they provide outdoor seating. If you feel the need for good Ramen, this is the place to get it.", "author": "Ken C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Pretty good neighborhood place for Ramen. We came for Sunday lunch around 1:30 and waited for about 5 minutes as it was still busy.\n\nThe Brussels sprouts with hijiki and edamame were well glazed and perfectly charred. It's a great pairing with the hijiki, which soaked up the oil. The takoyaki was a bit odd, crispy on the outside and soft on the inside, bit different if you're used to the St. Mark's kind.\n\nI had the seafood ramen which came with generous portions of mussels, 2 shrimp and a snow crab leg. I asked for less salty, which worked out well since I don't like having the constant thirst after typical Ramen places. The broth was seafood based and pretty good. \n\nThe lychee pistachio tart came with a scoop of ice cream and turned out to be a good dessert to share. However the frozen pieces of lychee on top had a strange texture.", "author": "Jess J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "We love Ramen and have enjoyed many fine bowls of it in Manhattan and even Prospect Park (Chuko). We were really glad when this place opened in Brooklyn Heights (in the former space of Siggy's). The atmosphere is very casual, and the ramen was delicious, not that we haven't had better. This is a great place for grabbing a bowl, and not a formal meal. Overall a good choice in the Brooklyn Heights area.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "This place is super cozy and cute with an overall comforting atmosphere, perfect for a first date, special meal or just a great dinner in the city. Not pictured is the ramen, BUT it was delicious, great flavor to the broth. Prices are pretty fair for what you get.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "Is it the best ramen in NYC? No, but it's still damn good.\n\nThe tonkotsu ramen with mushrooms and eggs is a cool $13. Simple, light, tasty. Noodles were a little thin, but the flavors were all there.\n\nI also tried the shoyu ramen. Tons of corn and chicken, but not much in the way of the broth.\n\nTheir appetizers are ok, not great. The gyoza is meh. The pork jowl bun is fine, with a little bit of spiciness. We actually ordered four with mayo and one without, and the one without took an extra 5 minutes to get to the table, which was weird.\n\nThe shishito peppers are plentiful, but they really need to be charred more and spiced more evenly.\n\nThe space itself is really nice. The decor is very wood-themed. They have wood paneling on the walls, and there's one big wood slab table perfect for groups of 8.\n\nThey also take reservations!\n\nWould definitely go back because of how convenient it is for me personally, and because they have a $10 ramen burger.\n\nUpdate: I came back to have the ramen burger. I think they tried cooking it too fast and over too high heat because it was medium rare but the outside was way too charred. Nothing special, especially compared to the original ramen burger. Oh well.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-30", "description": "This past summer I discovered that a new ramen spot opened up in Brooklyn Heights called: Kogane Ramen. I came here on an early Friday evening with my boyfriend and friends.\n\nIt's in a very nice neighborhood and close to the Brooklyn Bridge, attracting many tourists. The space is decent size and you don't feel cramped inside and the kitchen here is closed. I recommend making a reservation if you have four or more people because it can get crowded fast.\n\nFor appetizers, my friend insisted we try the black sesame tuna and pork jowl buns. I'm not a fan of tuna very much, but the black sesame tuna turned out to be decent. It's seared with mango salsa and wasabi dressing. It had a slight tangy, tropical taste with a hint of spice in it. It was prepared fresh and super smooth! The Pork Jowl Buns were made up of braised pork jowl and cucumber with spicy mayonnaise. It was moist, delicious, and juicy. I really enjoyed it and the flavor.\n\nOur friend ordered the Parco Ramen (pork bone and curry based broth, pork katsu, spicy, Japanese pickles, soft boiled egg, menma, scallion, and black garlic oil), sound pretty interesting and also a bowl of bowl of spiciness at the same time.\n\nMy boyfriend ordered the Seafood Ramen (chicken and seafood broth with snow crab, mussels, shrimp, fresh corn \u0026 scallion). This is the first time I've seen a ramen restaurant serve a seafood ramen. The seafood ramen was legit! They had decent size shrimps, real mussels, and snow crab that was moist and delicious! The broth was very light, but it still did well with maintaining that seafood flavor.\n\nMy friend's girlfriend and I ordered the same ramen: Tonkotsu Ramen (pork bone based broth, braised pork jowl, menma, Japanese wood ear, mushroom, soft boiled egg, scalion, and black garlic oil). Tonkotsu is one of my favorite ramen by far! The Tonkotsu ramen at Kogane was really delicious, creamy, rich, and just completely satisfying. I enjoyed every piece and slurp of the broth from my bowl.\n\nI really like Kogane Ramen. It's truly a gem and I highly recommend any ramen fan t ogive this spot a shot because it's authentic and truly scrumptious. You won't be disappointed. I hope to return soon as I haven't been here since June.", "author": "Jessica D."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}