{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-28", "description": "Definitely a great addition to Brooklyn Heights. Eggplant appetizer is delicious. The ramen was great too. Too bad the place is so small.. it surely will be crowded all the time.", "author": "J L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Thought the ramen was quite good. We took out, so I am sure it could have been even better. I got the Spicy Miso Ramen, which was excellent and had some good spice to it. Just what was needed on a cold and rainy day!", "author": "Mike C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-25", "description": "Fair at best.   My vegetable gyoza was undercooked and I did not think the pork broth in the Parco Ramen was anything special.    The noodles could have come right out of one of a college student's food stash.  The staff is friendly.   The ambience not so great. -- when I was there they were playing teenie bop music.  Ramen makes me think of cold weather and nice relaxing classical type music.", "author": "Brian G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-14", "description": "Their calamari salad was outstanding. We had also the spicy miso ramen and the tonkatsu ramen, it was comfort food on a cold day.", "author": "Rick H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "This is a cozy spot to tuck into a big bowl of ramen. The Shoyu and Spicy Vegetable ramens are tasty and satisfying. The Octopus Balls (bit of an unfortunate name) appetizer was so pretty we didn't want to eat it, but we were glad we did! The staff is also very friendly and attentive. Great addition to the neighborhood.", "author": "Allegra S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-18", "description": "Nice and cozy spot in the old Siggy's location. My husband and I enjoyed the brussels sprouts appetizer, pork buns, and the pork ramen in a curry flavored broth. The brussels sprouts were delicious. The pork buns were good. The ramen was interesting/different from what we usually get and quite tasty; the egg was cooked perfectly. The service was great - the waitresses were super nice and made sure we were happy with our food. And they refilled the complimentary tea and water frequently. A great addition to the neighborhood.", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "This place is a great addition to the neighborhood. It's really nice and cozy inside, which reminded me of similar restaurants in Japan. We got the gyoza, pork buns, and two different types of ramen- all were delicious. Some other people mentioned the staff seemed aloof- this was not our experience at all. They were attentive and helped us decide which ramen to choose. I'm really looking forward to putting this place into my regular rotation.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Excellent addition to the neighborhood! Ordered the spicy miso ramen and it was delicious and filling. Service was prompt and courteous, and prices are fair for the amount and quality of food that you get, so we'll definitely be back.", "author": "C K."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}