{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "It's super busy at lunch but worth it! Simply go for a seat at the bar, and enjoy a very nice ramen.", "author": "Frédérique B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "Really solid Ramen spot in Brooklyn heights. I wasn't to happy when they first opened since they were replacing Ziggys. However I have been several time and the food is very good. A bit pricey for Ramen. Though I shouldn't be surprised in this area. The lunch special is the best deal. They do serve beer and wine, however no full bar. Also the pork buns are really good.   A good choice for a lunch spot in this area.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "We stumbled upon this place after walking around the Brooklyn Bridge Park and I was pleasantly surprised. The broth was thick and flavorful and you could tell there was a lot of time put into making this. I like my noodles chewy and the noodles here were just that and so yummy! It wasn't too pricey, less than $30 for the two bowls which is pretty good considering how authentic it was. The service is also great! I have been to Totto Ramen and Ippudo and this place definitely ranks higher! Would definitely recommend this place.", "author": "Jen Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "The tonkatsu ramen was good, but not as good as Ippudo or Momofuku's. \nThe star of our dinner was the huge bowl of brussel sprouts! They were perfect- 5 stars. The shishito peppers were better than Momofuku's.\n\nI would definitely come back with a friend or two. The restaurant is tiny.", "author": "Yen N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "With high hopes, my wife and I did a stop in to check out the new ramen joint.\n\nOur order was built around a journey of the menu in order to get a well rounded opinion. \n\nFirst, pork Gyoza which was tasty and cooked properly (a fine crunch but not hard). \n\nSecond, Parco Ramen which comes in a giant looking bowl but is actually a rather average (but good) size. The broth was succulent and the noodles were done perfectly, a chew that was spot on. A fair portion of meat and all of the normal fixins. \n\nThird, side order of Ramen burger to check it out. Concept continues to be an intriguing one, however, I have found only one place that has ever delivered exactly what you want it to be.... And that is at Smorgasburg Brooklyn. This one needed a little more time grilled and a little more fry on the noodle bun as it did not hold up to the burger (an almost 100% common mistake). \n\nFinally, the deep fried green tea ice cream. Outstanding crust, clearly a unique in house build. Ice cream was tasty, but I recommend placing the ice cream in a deep chill or flash freezer to make it extra hard before frying. Very close....\n\nCurrently they do not have a liquor license so no Japanese beer, wine or sake... But maybe in the future.\n\nNet net- we will be going back. The food was above average and very fair. I believe they will continue to refine and nail the delivery.\n\nOrder any of the Ramen soup (that's why you are here) and supplement with an app or desert.... But the soup is king.\n\nEnjoy!", "author": "Drew O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "Ok so this place just opened up. Very small and quaint place. Fits about 30-40 people max so don't bring a giant group with you. I walked in and it's self seating, so I took the nearest stool available. Took about 5 min for them to take my order. I ordered the Spicy Miso Ramen. Arrived 10 min later. Now I got to say, the broth and noodles were divine. However the meat portion was very scarce, which is understandable because the description says its minced pork. But definitely not worth the $14. Delicious meal, just not entirely full. I'll be trying the Paco Ramen next. Definitely give it a try. Just don't expect to come out full unless you're willing to spend at least $30", "author": "Aziel T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Very rich soup for what I had: Spicy beef miso ramen (I think). I loved it. Best ramen I've had in a while. I was craving ramen and though it's a 20 minute walk from where I live, I didn't want to go past Brooklyn, so I chose the one that had the best yelp review. SATISFIED. The Melon Cream Soda was an interesting beverage choice I had. If you ever had the Korean ice cream popsicle called Melona--imagine that in a beverage form, lightened, and carbonated. Worth all the five stars I can give. It cost me about $16-18 in total with tax and tip.", "author": "Eli K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "It's a 15 min walk from the office, which is worth it considering I dislike the closer ramen spot... Only been here twice but the place has been great both times. Their broth is pretty salty though, but I guess that's typical for ramen. The appetizers are simple, yet really tasty. Love the peppers.", "author": "Jasmine F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "This is one of the best restaurant I have been. I had the calamari salad, the misu ramen and the ramen burger and they were amazing!\nI totally recommend this place to anyone.", "author": "Danny M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "Visited Kogane on a very cold winter night and it hit the spot for me. The restaurant is small with about 5 tables and a bar with a few stools, but we were able to snag a spot. The kitchen overlooks the restaurant and it got very hot in there probably due to the small space and open kitchen. I got the spicy vegetable ramen and my husband got the chicken ramen. I was surprised to see how large the bowl of ramen was that came out and I wasn't able to finish it. Mine came with lots of vegetables including okra (one of my faves).The noodles are supposedly homemade and tasted fine. My husband didn't particularly like his and when I tried his it lacked flavor so I wouldn't recommend the chicken ramen. Overall if you're looking for a decent ramen spot on a cold night this is a good place to visit.", "author": "shana l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "Very pleasant waitresses. The place is small, but you get more attention from staff. Food is good too.", "author": "Diana O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "The noodle is hand made in the shop ,they also serve wine and sake , the Tonkotsu Ramen was my favorite ,if you are in Brooklyn height must try", "author": "Annie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "So, this was my first time ever trying Ramen. First thought? \"Have I been living under a rock this whole time?\" I was impressed. This was a Lunch Date with my Boyfriend and it happened to be his first time eating Ramen too. We had nothing to compare it too which isn't a bad thing. I had the Tonkotsu and he had the Parco. They both were very yummy. The setting of the restaurant is small and intimate. In other words, perfect for dates. We found a few more things on the menu that caught our eye. There's always next time. And we will definitely be going back. Happy Eating!", "author": "Samantha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Ive never quite had such a spectacular pizza in a while. The savory flavor of the cheese and sauce worked so well together. I dipped it into my ramen and I was transported to another universe of flavor.  it gud #100", "author": "Steven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "Place is a gem! Was in a Japanese \"tapas\" frame of mind when I was there. Had the pork jowl buns, takoyaki and seared tuna. All were fantastic especially with soothing cold drafts of Sapporo and Orion to wash it all down with. Great looking vegetarian ramen options too so everyone can enjoy this fantastic restaurant.", "author": "Roderick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Came in on this cold NY night to warm up and have some good Ramen with my boyfriend and i have to say it was delicious and perfect for warming up. We started with the Pork Jowl Buns (wanted to try something different) and I was pleasantly suprised. I wasnt expecting them to be so delicious.  They place a nice slice of pork on top of cucumbers with some kind of sauce (had perfect amount of spice) on the soft bun. Next came our Ramen! I had the Red Tonkotsu ramen (pork belly) it was spicy but very flavorful and the noodles were perfectly cooked!", "author": "Claudja S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Beyond delicious every time we come. Excellent service and food beyond compare! The vegetable gyoza are outstanding and their special ramens  are always amazing", "author": "Amy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "MmmmmMm. A nice warm bowl of ramen while it is cold outside.  The resto is a little small, but very cozy. Tough if you come with a large group of friends. The tonkatsu was nice, and perhaps adding extra noodle would be more filling.", "author": "Jonathan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "Small with solid food. Had the spicy miso ramen which was flavorful and hit the spot on a rainy night.", "author": "Alessandro Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Get the Red Tonkotsu! Best Spicy Tonkotsu Ramen I've had! Even better than the ones I had in Japan and Singapore! Love the broth that's not too oily and the consistency is not too watery!", "author": "Gee G."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}