{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-26", "description": "Stopped into this Ramen joint with a friend for lunch today. This is a very small restaurant but the smell of ramen hits you right when you walk in. I got the pork belly ramen. Broth was honestly wonderful and the pork belly was very good. They were super accommodating to my dietary request as well. \n\nAtmosphere here is typical Brooklyn (small) but very modern, nice, and clean. Service was attentive and kind. I enjoyed the whole experience. I can imagine this place being right when busy though.", "author": "Jonathan I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-30", "description": "Overall the food was really good, just was disappointed that the card machine wasn't working, and we literally had to walk down to court street in the rain to get cash from the bank. Literally this is the first time this has ever happened  to me while out to eat.\n\nOverall the food was decent.", "author": "Tai A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-21", "description": "Ok so besides my husband, the only men I want is ramen, Kogane Ramen that is!\n\nOut in the city, after hours of walking and pizza snacking we needed a quick, nice and comforting picker upper. Something soothing, warm, filling. Ok I'm def describing Kogane rn. \n\nI was a little nervous on trying Ramen for the first time ( I know I know, late to the party but at least I'm admitting it! ). Being vegetarian, most soup bases will always have some chicken, beef, fish base to them so I know I was being a little risqué but I didn't want to be the one party pooper saying I didn't want ramen. So whatever, I went to for it! \n\nNeedless to say I was not disappointed. I can't say it was the best ramen I've had since it wouldn't be fair (given I've only had this one). I do have to say it was delicious. This little hole in the wall was so authentic. Everything was made fresh to order. It was getting pretty packed and despite the small space we were seated and greeted immediately. I was able to order the spicy ramen with vegetable broth. It was incredible! Soothing, comforting, home cooked. It was just what we needed on this cool spring day and after walking our food away. \n\nOne of our friends that was with us isn't a fan of fishy flavors so they were able to skip the fish oil in hers. Again, our server was just incredibly accommodating and welcoming willing to swap things out and give us options. Japanese bottled beer was a must so make sure to pair up your ramen with it. So happy to have had my first ramen experience in this spot! It definitely won't be my last :)", "author": "Marietta C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-18", "description": "We came on a Thursday night at 7pm and they were quick to seat us for a party of 4, even though our 4th person wasn't there yet. Waters and menus were doled out very quickly, which I appreciated. My boyfriend got there within 5 minutes of us being seated and by 730pm, the place was a madhouse. The place is small to begin with the line to get seated was now out the door. \nThe service never suffered and we never felt rushed even though there was a huge line of prospective diners, all jonesing for our seats.\n\nWe got the large (375mL for $9) house hot sake, an order of edamame ($5), sauteed brussel sprouts ($7) and pork gyoza ($6 for 5 pieces) to start. The edamame was standard fare. It is pretty hard to mess up edamame! The gyoza was also delicious but nothing to write home about. The sauteed brussel sprouts were the star of the appetizer show. Perfect balance of spice and umami flavor from the fish sauce. For $7, the portion was very small, maybe 10 brussel sprouts cut in half, at the very best. It comes in the same size bowl as the edamame and we could have easily eaten 2 servings of it, without question. \n\nNext, we got 2 orders of shoyu ramen ($14), a chicken broth based ramen with chicken breast, corn and mushrooms, a parco ramen ($14), which is the pork bone broth and curry based ramen with a pork cutlet and I got the red tonkotsu ($13) ramen, which is the spicy pork ramen. The ramens came out hot and fast. We were pretty stuffed from all the appetizers so we barely had time to digest before the entrees were presented.\n\nMy spicy ramen was pretty good but definitely not spicy enough. They have a condiment jar of chili garlic oil on the table and I added some in my ramen, which helped but I did wish that the soup was as spicy as advertised.\n\nMy boyfriend and daughter were not crazy about the chicken shoyu ramens. It had a layer of fermented fish sauce (called \"patis\", in Filipino kitchens) floating on top and you're supposed to stir it through the soup. My boyfriend didn't know this so his first ladle of soup was all fish sauce. He was shocked as to how salty the food was and I noticed the culprit floating on the surface of the bowl. After stirring it through, it definitely tasted better. My daughter has a sensitive palate to anything fishy so even after stirring, she was still overwhelmed by the fish sauce permeating through her soup.\n\n3 appetizers, sake, and 4 bowls of ramen, with tax and tip came out to $107. Not the cheapest option for dinner but not that bad either, considering its Brooklyn Heights.\n\nIf I were to come here again, I think it'd just be for appetizers and drinks. The service was good but the ramen could be much better.", "author": "Anna-May A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Excellent Japanese food! The ramen burger is to die for and the ramen with gyoza's is just delicious! I will definitely be coming back! It really tastes and feels like you are in a authentic ramen shop in Japan! It's not huge inside so I wouldn't bring a huge group (no more than 6, i would say) but it's worth it!", "author": "Emily O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-07", "description": "Tried the red tonkotsu ramen ($13) and seaweed salad ($6). The ramen still leaves much to be desired :(", "author": "Judy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "Kogane Ramen has to be top 5 ramen spots in ALL of NYC. Trust me, I've eaten at many and this spot was unbelievable. The broth is not watered down and the tonkotsu broth is rich and flavorful. The char-Siu is also thick and tasty. Clearly the best ramen in Chelsea, come here on a chilly day and you won't be disappointed. Did I mention they make their own noodles? Perfect bite texture!", "author": "Eric H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-15", "description": "Really good ramen! Tasty broth, not too salty or fatty. Cheap sake is a nice plus.", "author": "Tom F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "Great place for comfort food. Just what i needed on a sunday night.\nWalking distance from DUMBO, street gets pretty dark and quiet at night but not hard to find.\nA good bottle of cold beer and some appetizers with ramen sounds tempting for any night.\nI got the lobster ramen and realized it requires more work than i had previous thought - lobster requires some effort to remove the shells by hand.\nWould totally come back to check out their other ramen options.\nPortions is huge.", "author": "Janice L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "Niccceee. Ramen soup offers veggie soup for non -pork eaters. I will definitely come back . Perfect on this rainy April day .", "author": "Tamara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "This was my first meal in ny \u0026 I have to say it was pretty good! It's such a cute little spot, and I mean little. I ordered the red tonkotsu ramen which is just spicy tonkotsu. It was a good balance of salt \u0026 spice. The noodles were great too, the thin straight ones \u0026 you can tell they're fresh. They don't look like top ramen curly noodles like some other restaurants use. The service was great too even with a packed house.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "We somehow hadn't spotted Kogane in a year of hunting for good Ramen near us in north Fort Greene...we'd tried all the other highly rated places within a couple miles, but were still missing the quality of Ramen we got in our last place Hells Kitchen.  Today, that all changed! \n\nKogane is delicious, with pork, chicken and veg broths, and a variety of flavors and noodles.  We had the Spicy Vegetable Ramen and the Red Tonkatsu, and both were fantastic.  Completely different flavor profiles and ingredients, even different noodles, but we loved them both.  The pricing is totally reasonable for NYC Ramen, it's actually the cheapest I've had for this high quality.\n\nThis is absolutely going to be a regular spot for us going forward, looking forward to going for dinner and trying the Gyoza, buns and sake!", "author": "Pat L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "Have been here a few times and this place is always great! More than decent gyoza, only complaint is the sauce it came with was meh and kinda oily. The takoyaki is always top notch. Crispy on the outside, gooey and delicious on the inside. Really, really enjoyed my parco ramen. Came with pork katsu, I've had several ramens with a katsu or tempura and it usually get damp and useless. Here the batter remained relatively crispy and didn't just fall off the meat the second I picked it up. Was a good amount of spicy and every ingredient complimented each other. Super enjoyable. My buddy gets the veggie ramen and loves it. Also goes for the eggplant app and enjoys that.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "My favorite ramen spot in NW Brooklyn. Service is excellent every time. The Tonkotsu Ramen is one of the bests I've had (including manhattan ramen spots). I recommend the pork jowl buns as an appetizer and the yuzu cheesecake with red bean paste (Pictured)!", "author": "Alina J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "Really love Kogane. I live a few minutes away in DUMBO and have been to the restaurant throughout every season - I can say it's the absolute coziest on a rainy Sunday evening. They always seem to be very busy, but have just one table left for us whenever we come in! The ramen is really consistent and delightful. Pork buns and gyoza are a treat, too.", "author": "Aleigh H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-25", "description": "Pretty disappointing sweet potato fries and ramen. It is a small restaurant but it wasn't crowded when we went on a Friday evening. The sweet potato fried lacked seasoning and the sauce that came with it didn't really help. The spicy vegetable ramen was just too salty and that was all that I could taste. The portions are huge but doesn't make a difference when the food isn't that great.", "author": "Fenn N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-26", "description": "Came here in Christmas Eve. Quite a cozy and warm space. Under 30 seats approximately, but it's comfortable for people with friend and small family.\nI ordered a shoyu ramen. The texture of noodle is good, for I prefer chewier one. Also the soup not salty and in a proper flavor. In addition, the meats are flavorful with some pepper I guessed. Overall, it's a good experience in a holiday night.", "author": "Astrid W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "Yummy and satisfying. I wouldn't trek here, but good if you're in the area. We enjoyed our bar seats. The gyoza was good. My spicy ramen wasn't spicy enough but still hearty and filling.", "author": "Karen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-07", "description": "BEST DAM RAMEN PERIODTTTTTT. My boyfriend and I travel from Jersey all the way to this spot in Brooklyn just for the Ramen. It's scary how addicted we are to the ramen but we cannot get enough. My favorite is the red tonkotsu ramen \u0026 their pork jowl bunsss  def recommend this place for a good quick meal. Service is excellent as well. Haven't had a bad experience yet.", "author": "Edna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-09", "description": "We were looking for a warm soup nearby when we were in the area and this place popped up on our yelp search so we decided to give it a try. Came on a weekday afternoon, the place was slow so we got immediately seated. I got the Tonkatsu Ramen and husband got Spicy Miso Ramen. They are super delicious even though I am not a ramen fan. The pork belly was tender and I love how the broth isn't fatty. Although my husband and I agreed that they are a bit too salty. The waitress took great care of us by refilling water and tea all the time.", "author": "Hao H."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}