{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Great local Ramen place. Very good broth and noodles. Quick service and cozy atmosphere", "author": "Spencer L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-08", "description": "Excited to try out a ramen shop in Brooklyn, and the complimentary green tea was a great way to start a NYC winter afternoon. Service was fine, nothing bad nor exceptional.\n\nThe spicy miso ramen, unfortunately, wasn't as stellar as I hoped it would be. The menma is welcoming and sweet, the shredded pork was okay, but the broth disappointed. I would probably hop over to the city for a better bowl o' noodles.", "author": "Jacques C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Small but very clean spot. Tonkotsu Ramen soap was flavourful! I will definitely go back gain...", "author": "Deo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Food was really good. My favorite is the Brussel sprouts for appetizer. Had Spicy Miso Ramen for main, and  green tea mochi and green tea mille crepe(tastes exactly like Lady M's!!) for dessert. Also nice ambience and excellent service. Will definitely comeback! Now one of my favorite ramen spots in Brooklyn.", "author": "Chelsea A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-16", "description": "Just had lunch here today. Had no problems with getting a seat (probably because it's hot, muggy, and 80 degrees outside lol). I had the tonkatsu soup, and for $13 you get decent amount of stuff in it (two bars of pork jowls, about two fingers thick, half an egg, bamboo shoots, scallions and mushrooms) Pork jowls were soft and tender, and the half an egg was the perfect consistency; yolk kept its shape but was kinda runny yummm.\n\nBroth was flavorful and slightly creamy... it felt very home made-esqe. No crazy explosion of flavor in your mouth but quiet and solid. In addition, it wasn't too salty.  I like it. If I'm craving for ramen and am too lazy to go to manhattan, Kogane Ramen is where I will certainly turn to!\n\nNoodle was thin, straight and bouncy.  I also noticed that my ramen stayed really hot up until the end, just slightly scalding so you gotta blow on it every bite. Other ramen places I've been to don't do that... not sure, the amount of wait time for food is about the same; roughly 10 minutes. \n\nI will definitely go back and try their other soups!\n\nPS: If you want extra noodle, the cost is $3.", "author": "L. H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-03", "description": "Not Authentic.  Sorry, the flavor of the broth as well as the texture of the noodles and the garnishes are not what you would find in Japanese ramen(aside from the egg and menma).Wrong type of seaweed garnish.  Tonkotsu ramen broth was not creamy and white enough.  If you want the real stuff, there are other places, but if you are fine with the imitation, this is your place.", "author": "May T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "Finally quality authentic ramen in Brooklyn Heights, looking forward to a cold rainy day and some spicy miso ramen.", "author": "Chris R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "We found this cozy ramen spot on google maps and were excited to try it.\n\nWe sat on the stools by the kitchen so we could talk to the chef and watch the ramen preparation, (recommended).\n\nRamen: tonkotsu was delicious, probably the best pork I've had in a long time. The chef told us he makes everything fresh daily, and you can tell.\n\nCheck it out, also try the fun cream flavored Japanese sodas!", "author": "T Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-01", "description": "Not much to say. What they serve here is not \"ramen\" , just some sort of \"not very tasty noodle soup\".", "author": "Shennai Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-31", "description": "I'll caveat this by saying that I've ordered here previously with good results, but tonight's experience is completely unacceptable from any reputable restaurant. We ordered delivery through Eat24 and now nearly two hours later, we are still waiting for our food to arrive. After an hour, we called and they said \"the driver went out 20 min ago\". After an hour and a half they said \"very sorry, it's on it's way, we called the driver but he didn't answer\". After TWO HOURS, they have started screening our calls and now just pick up and hang up. Unbelievable.", "author": "Anthony M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-05", "description": "This ramen place is really small and quaint, fits maybe about 30 people max. The ambiance is really nice, but unfortunately, not much more can be said about the food or the service. \n\nI arrived with one other person Sunday evening around 8:30 PM and we were seated quite quickly. The first thing I noticed was that there were napkins on the floor from the previous customers. Not a big deal by itself, but with the rest of the experience it certainly brought my rating down. \n\nThe menu is pretty small, maybe about 5-6 appetizers and 5-6 types of ramen. We ordered some pork gyoza and I had the Parco Ramen while my guest had the Spicy Miso Ramen. While we waited, my guest and I noticed that a couple next to us and a man sitting across from us ended up arriving after the both of us yet getting their orders of ramen and gyoza before we had even gotten our gyoza. At this point we had been seated for about 30-35 minutes, so I reminded the waitress of our order. I can't say whether or not she had forgotten, but it was surprising that it took so long for our appetizer to come out. By the time the gyoza did come out for us, the couple next to us had already finished paying. \n\nFood wise, the gyoza was average, and was accompanied by its sauce. I do always like when they give an even number of gyoza in the orders, and here we were given six. After our gyoza our ramen finally came. The Parco Ramen came with a pork katsu cutlet, which is why I picked it initially. Sadly, I only got about four small pieces of the katsu that looked to have been swimming in the broth for quite some time. My guest noted that he added a soy egg for an extra $2 but was sad to see that it only came with half an egg, and that it hadn't been soaked for long enough. For $2 I think Kogane could afford to add the second half of the egg. \n\nAnother thing I noticed is that we both received the same type of noodle. Customers familiar with ramen will know that based on the broth, different textures and thicknesses of noodles will be used to best suit the ramen type. For a ramen restaurant to miss that pretty crucial step kind of puts me off. \n\nFinally, the service. Since I won't assume that the waitress forgot to put our order in, I won't count that against them. However, for such a small restaurant, there were three waitresses ambling around the entire time we were eating. It was quite distracting, and I can't say that the extra help was even noted, because I still had to ask when our food was arriving, if it would take much longer, and finally I had to ask for the check. The only things the service did well was refill our waters and take my payment at the end. Otherwise, they would walk up and down the small path in the middle of the restaurant the entire time. Also, one tiny thing that bothered me was that one of the waitresses was drinking water right in the middle of the customers. I've waited tables before so I understand the need to stay hydrated, but we were always taught to drink and eat away from the line of view of customers. Just a personal preference, but I thought I should add it. \n\nAll in all, I hope this place picks up the quality and the service, because they've got a great little venue and a lot of potential. For now though, I don't think I'll be making another visit.", "author": "Ursula H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-12", "description": "Decent ramen, nice enough but clueless waiter. We asked for recommendations and he either didn't care about the menu or doesnt know the menu. I'm hoping they have gotten rid of him since my first visit a month or two ago. This place has potential. It's no Ippudo but it's good for a local fix.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-11", "description": "Was excited to check out this place after seeing the good reviews. Very disappointed. I ordered the Shoyu ramen and pork buns. Pork buns were ok, soft bun with pork and few slices of cucumber with what seemed to be spicy mayo sauce. The meat was a bit on the dry side with not much flavor. It seemed like an ok attempt at pork buns found in cheap chinese buffet. The ramen was VERY disappointing. It was just a cheap instant packaged Sun Ramen found in H-mart with some added veggies and meat, no joke. The broth is flat and has no depth of flavor. And they charge $16 for a bowl, seriously...? Even the top notch ramen places like Ippudo, mu, chuko, totto, etc charge $15-17 per bowl. Only reason im not giving this place 1 star is because of the friendly staff. I dont know how this place have such good reviews and im really skeptical of the authenticity of the reviews. This place takes $1 packaged instant Sun Ramen and charges $16. Stay away.", "author": "Tae Jin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "The chicken wings were delicious. They were nice and flavorful but not too spicy. The shoyu ramen was amazing as well. It's a bit new, so it's pretty empty most of the time, but it's definitely worth a try!", "author": "Brian L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-06", "description": "I was excited to try here but alas my vegetable ramen had only one flavor: scallions. Way too much scallion. No flavor except scallions. If you are going to have a ramen restaurant, some attention should be paid to serving ramen that tastes good.  Very strange how bad the ramen tasted - especially since looks like money went into fixing the space up. Still trying to get the taste of scallions out of my mouth a few hours later! Maybe that's why the restaurant was empty at 7pm on a Saturday night. Sadly I won't be going back either.", "author": "Jane W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "I'm afraid I've become addicted to their Pork Buns and Parco Ramen. And there's no cure.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "Nice small place\nGood appetizers and Ramens\nAway and quite from the busy touristic places under the bridge, with all the long unreasonable ques.....", "author": "Ronnie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-20", "description": "Decent ramen in a small and cozy location in Brooklyn heights. The pork and chicken in the ramen soup was the true highlight of the standard fare. The place is small and gets filled for lunch quickly. Forget about the long line for the bathroom snaking around our table. Have had better, but for the area not bad.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "The tonkatsu and the parco ramen are delicious.  I wasn't that into the veggie or miso ramen and their sides and pork buns weren't anything to write home about.  Stick to the classics and this place is fantastic.", "author": "Paperback W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-15", "description": "Ramen underwhelming. Was really excited about a ramen place opening in the neighborhood but after trying it out twice, I don't think I need to go again. The broths tastes similar for all the different ramen. Appetizers mediocre. Prices...as expected in fancy brooklyn heights. I'd recommend just making a trip out to the city for ramen worth your buck.", "author": "E L."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}