{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "We liked it.  We wanted NOODLES and SOUP, and Ramen was a good choice.  Limited menu, but on target.  Cute place.  \n\nBUT, my I ordered a spicy meat broth soup, with meat, and it was missing meat.  I'm really not sure if I got what I ordered.  When I said, I don't see any meat, the soup was taken away, and immediately brought back with a meat glob on top.  Once I mixed it in... my hot soup got cool, immediately.  It wasn't spicy, and it was no longer (temperature) hot.  When we were done, then I was asked if it was okay.  NO, not really.  Sorry.  And then, I think the pork wasn't fully cooked, or at least should have been brought to proper temperature when served to me, because I had an unpleasant reaction at home.  Disappointed....", "author": "L K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "I'm glad to have a ramen place in Brooklyn Heights and I have to say the ramen is pretty good here. I had the shoyu chicken ramen and I thought it was quite tasty. My husband had the spicy ramen and he liked it. We ordered the pork buns but we're disappointed. The pork was very chewy and fatty. Definitely wouldn't order that item again but we'd come back for the ramen. FYI they don't serve alcohol here.", "author": "Vicki K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-17", "description": "Happy that a ramen place ended up so close to my home.  Spicy miso I loved on a cold and blustery night.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-13", "description": "Have been a consistent fan for 2 months now. Ordered the seafood ramen tonight and the mussels were tiny and rather bad (could not eat it). The crab legs were OK and also the 2 shrimps in the seafood ramen order. Lobster ramen much better (from previous experience). Also ordered the eggplant but the sauce was too sweet - did not balance well with the roasted eggplant, sorry to say.", "author": "K D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Great\nSpicy miso ramen\nWill go often\nGyoza terrific\nExcellent service", "author": "Alejandro D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-30", "description": "Went here last night with my bf. Very very little like most ramen places. No community table which is good. Clean. Friendly staff. I ordered the red paste ramen with pork belly. By far, probably the worst ramen I've ever tasted due to the after effects. Broth was ok, spicy, not enough noodles, and pork belly was cut very thin \u0026 it was hard. It was weird. Bf had the other one with the jowl.. just knowing it's from the pigs face grossed me out and he ended up getting sick thinking about it. This morning?? Worst stomach ache ever. But hey! It's worth a try!", "author": "MC V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "Stopped in here for the first time this week. I am always up to try Ramen anywhere, especially near work, to see if it's any good to become my regular spot. This was average. I got the shoyu ramen because I was feeling a bit sickly and wanted a good old japanese chicken noodle soup. The chicken were nice white strips, no creepy chunks of fat to worry about. And it was a decent bowl, but just not too flavorful. I loved the corn but felt they needed more veggies. I would come back to try some of their pork bowls or something with a little spice to it to see if they're any better. The bowls were stunning, very large bowls though and they had nice large wooden spoons. The place was very small, only about 6 tables with one being a large bench style for a big group. It was pretty quiet there at weekday lunch time so I was accommodated well and quickly.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "We walked over the Brooklyn Bridge in a recent trip to NYC and found this place. It's a very cute, small hole in the wall restaurant. I ordered the spicy miso ramen and my husband am I shared an order of gyoza and edamame. My ramen was pretty good- very tasty and flavorful although a little oily and not as light as I'd hope. The gyoza were a touch bland, but had a light texture which was great. The service was friendly and efficient.", "author": "Gena L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-31", "description": "Ordered a delivery, including the seafood ramen and the ramen noddles. The seafood was fresh but the soup was just tasteless so we didnt even eat half of it. the noddles were good but that's not why you order or go to a ramen place", "author": "Irit A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "I was craving noodles and with the help of Yelp I found a place near my location. I ordered the spicy miso to go. The broth comes separate to the noodles, egg and other veggies. I put it altogether in the car and ate it up. The broth was so delicious I do not regret it. Enough salt, enough noodles and perfect spicy in the broth. I do think it's a little pricey compared to other places but you know what they say location location location.", "author": "Jackie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "Stopped in for a nice night with ramen. Many options for ramen, both pork options where delicious, and a very good price point. Kirin bottle is only $5. Also had the ramen burger, pretty good.. beware the ramen bun is greasey as per usual with the dish.", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "Must try!! The Brussel sprouts with hijiki is to die for. Made to order takoyaki crispy on the outside, soft on the inside, my fav! My husband had the tonkatsu ramen. Pork jowl is tender and soup is flavorful. I had the Parco ramen, which is a spin on the traditional tonkatsu ramen. It is a pork based soup flavored with a light curry. Very tasty! Highly recommended!", "author": "Amy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-05", "description": "This used to be a handy place to go for lunch, but they now have a $20 minimum for credit cards. Just the incentive I need to eat elsewhere.", "author": "James L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "Wow, I can't believe this little gem is here in Brooklyn Heights. I had the spicy miso ramen. The flavors are rich and bold. The seafood ramen looks really good too. It's a small place with reclaimed wood walls everywhere, definately has a hipster vibe. Can't wait to come back!", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-10", "description": "It's just my personal preference and I like thicker curly noodles.  And they use thin straight noodles.  The broth was solid good.   The service was prompt but I went at a really weird hour.   I'd say 4.5 for those who like thin noodles.", "author": "Su S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-07", "description": "I ordered the veggie ramen for delivery and like another customer pointed out, I liked that the noodles and broth were separated so that they weren't soggy. The delivery time was also incredibly quick, which was great. However, the noodles were al dente which is what I expect from pasta but not noodles. I generally did not enjoy my dish because of the consistency and lack of flavor, but maybe a non-veggie ramen is more flavorful. If you're vegetarian, then I wouldn't recommend this place for you.", "author": "Maria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "Today is friday and i  bring my freinds to try ramaen which got a great name in my whole neighbour\ni want to try some  thing new and different\n\nsame great welcome i order shoyu chicken which i never try here before!!!! it was amazing\nwe start with different apatizers\n\nmy friends love wings ,takoyaki,buns and miso eggplan.It was amazing mouth watering\n\n\ni love this place.Its new in neighbour and doing best service i have ever seen,\nFood wise its on top \n\nBecause its alll home made fresh ramen no msg and no outside buying products all fresh which i really like.A true flavour.Thats why when ever i go there its busy ,\nand i want to write while i am eating there\n\nthis season is best for kogane ramen i love it ...", "author": "Eddie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-11", "description": "The food was alright. Good service but not very authentic. It's a good location as you can walk to the park right after though. Probably won't come back since parking is kind of hard to find as well.", "author": "Dexter C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "Great ramen place in BK, the place is small and cozy, it has a bar table where you can see the chief prepares the food. The waiters were amazing and very polite, I definitely suggest the calamari salad appetizer. Best calamari I've had in the USA! For sure coming back again!", "author": "Tarik M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-02", "description": "I felt the ramen was somewhat less authentic and lackluster from most of the other spots I have tried in Brooklyn and the City. I tried the spicy tonkatsu which was neither spicy nor rich in flavor... what you would expect from tonkatsu. The fried chicken we had had some elements of typical japanese fried chicken flavor but was also lackluster and forgettable. \n\nThe service on the bright side, was excellent and friendly. The place is small and easy to miss on the street. The décor is Spartan and intimate. They accept credit cards which is a nice touch. Not necessarily the place for large groups, but if you are hard up for ramen, it is close to the train station.", "author": "Lawrence L."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}