{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-11", "description": "The ramen is amazing! Very close to the likes of Totto and Ippudo and by far the best option in Brooklyn Heights. Only reason I gave it 4 out of 5 stars is because the service is kind of slow and the pork buns could use a little more pork", "author": "Valentin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "We love Kogane in general, the noodles are toothsome and the varieties of ramen soups are all nice. Only problem: sometimes they let the broth get way too salty!!! Some days it is just right and other days I can barely drink it, I need to add water. I wonder if it depends on what chef is on duty...", "author": "Kat P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-25", "description": "The soup is delicious and rich.  The noodles were not so good.  Instead of egg noodles, they use plain thin wheat noodles and I don't think they have the option of alternative noodles, which is disappointing considering they are a ramen shop.", "author": "April Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Love this place. Second time in one month. Small and cozy spot in the area. Really good Ramen, nice people, fast service.", "author": "Tamara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "Just ordered takeout for the chicken ramen. I haven't had ramen very many times, but I thought the chicken ramen was tasty and filling. Only criticism was that it took a relatively long time for them to make the order, but I'll attribute this to the fact that they just opened within the last couple of weeks. This is a great addition to Henry Street, and I wish this little place lots of success.", "author": "Jaime P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "This place serves excellent ramen!  The broth was savory and the service was great.  My only wish was that that portions in the Ramen could be larger.  Unfortunately, we did leave a little bit hungry.", "author": "Todd S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Amazing. Best I've had, including famous places in the East Village.", "author": "PM M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "So thrilled to have a good Ramen place in the neighborhood!\n\nMy girlfriend and ate there a few days ago.  Nice place.  We sat at the counter overlooking the kitchen and they appear to have a clean and efficient operation going on back there.\n\nWe started with the brussels sprouts which have this awesome sake butter on them.  Then I had the tonkatsu ramen and it was delicious.  The broth and the pork were excellent.  The noodles were only ok though.  I forget what my girlfriend got, some kind of curry ramen.  She liked it a lot, but I tried it and I think mine was better.\n\nAnyway, can't wait to come back here.  I'll be a regular customer in the winter months.", "author": "Mitchell G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Firstly, I look for a good service in every restaurant!! I must say that the service was on point and the food was incredible the broth had so much flavor and richness to it. I enjoyed every bit of it. I would totally recommend you guys!! The waitresses were very friendly and welcoming. They deserved 25% tip from me.", "author": "Ashmita G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "what a hidden gem of a place. nice and cozy, and ramen was fresh and amazing. Ordered the tonkatsu ramen and was pretty blown away. They give you two big chunks of pork, not like the usual spots who usually give two thin slices. I love how they also offer home made chili to add into the soup and that was too perfect. Best ramen in Brooklyn hands down.", "author": "Silky W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-12", "description": "I was not at all impressed by there food. The chicken broth was gross, the brands Trader Joe's are a lot more delicious. The noodles were highlighter yellow and way over cooked. As one who enjoys ramen I was gravely disappointed and will not return. Lots of better places nearby.", "author": "Eddie E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-15", "description": "Food was generally okay (not the best, not the worst) but staff was rude and service was underwhelming and generally slow. My husband was running late to our dinner date because of delays on the trains and the waiter felt the need to give him crap about how long I'd been sitting by myself. Not acceptable.", "author": "Jess B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "Awesome addition to BK Heights. Ramen was really delicious (try the tonkotsu pork and add corn!) and foie gras chicken wings are a must-try. Clean, all-wooden interior with great energy.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "My favorite ramen in BK, maybe even NY. \nI've become a regular here. I've had all the pork ramen and it's all good. The spicy miso with ground pork is really good. Broth has a great, rich flavor and the ingredients taste fresh. Noodles are always cooked perfectly. \nMy favorite is the red tonkotsu ramen (with an extra egg, every time). The pork serving is decent and its tender. The flavor of that alone is far above average. The broth is just so good. Not too salty, not like miso soup. The mushrooms, scallions, egg and bamboo shoots never taste like they're straight from a can or have been sitting around. I keep trying ramen from other places around and none of it compares to Kogane, in my humble opinion. They're service is great too. Decent sake, beer and wine selection for a small restaurant. \nI usually get the seaweed salad and/or blistered peppers too -- never disappointed in them. Decent serving size of seaweed to help cool your mouth when eating spicy ramen. And the peppers are more than enough to share. \nIt's a little gem of a restaurant in that neighborhood.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "The Tonkatsu and Parko Ramen were excellent.  The Miso Ramen and the Pork Buns were not that great.  Definitely hit or miss but the hits are excellent and the atmosphere is cute.", "author": "Rolf W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Unbelievably delicious. Picked up on a whim. I have been craving ramen for weeks. And learned that one of my local spots closed. Put \"ramen\" into Yelp and this place came up. Fabulous. The pork ramen broth is luscious and the buns have the perfect balance of spicy sauce to uncious (is that a word) meat. Plus super fast and courteous staff with a pretty restaurant.", "author": "A M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "The menu here is small but that's a good thing; the restaurant has also been around for only 5 to 6 months. The location is kind-of hidden under scaffolding when you walk by it on the street but when you walk into the restaurant, there's a nice small Japanese restaurant kind-of ambiance. As mentioned before, they don't have too many food items on their menu which makes ordering simple and quick. Try the roasted brussel-sprouts, they are delicious! I am definitely planning to visit here again for their ramen, which was very flavorful and hearty. Complementary green tea makes the experience that much better!", "author": "Marc L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "Wanted to try something new the other day, and I had a discount from Seamless, so I got some ramen to go for dinner. I had the Parco ramen, a curry based dish, that was delicious. Nice and creamy. I also got some pork dumplings, which were really good too. Could have used a little more sauce, though, as the cup they gave me was only about a third full. The only real issue I had with my order was that they gave me the broth separate from everything else, which is smart for takeaway, since no one wants soggy noodles. However, it was really tough to sit and wait for the noodles to soften up while smelling all the deliciousness.", "author": "Dan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "I had came here last weekend on Sunday with me and my husband. We were walking around Pineapple street looking for somewhere to eat and we had realized that the new ramen restaurant had opened up. We came in and it was very busy but we had been seated very quickly only having to wait less than 5 minutes for a seat. the host was very nice and got us seated as soon as she saw a table for two was open. the menu is fairly small but a good variety of different appetizers and ramen. I had ordered the foi gaui chicken wings and pork jowl buns as an appetizer and my husband ordered the pork gyoza. for ramen, we had ordered spicy miso and parco.  as well as for service, our food had came fairly quick. it only took about 10-15 minutes. the waitresses I noticed were very helpful with the customers, getting us whatever we needed. the food is so good, the chicken wings are definitely something you should order when you go. the ramen is honestly the best ramen I've had and I've tried other ramen restaurants but this ramen doesn't compare to anything else. it's homemade and has a unique taste to it which makes it even better. my first impression here was very satisfying, the food was amazing, and the service there was excellent. I will be definitely coming back for more. I recommend everyone to try this place out, you won't regret it.", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Not only is the food at Kogen Ramen outstanding, so is the service! Restaurant and delivery. I have had the Ramen, chicken wings, eggplant and gyoza. This food is good for the soul or when you're not feeling well. Love this place!", "author": "Arlene C."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}