{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "This place is so delicious located right in Brooklyn Heights, with street parking available.  The atmosphere is cozy and small, would recommend for parties of 2-4, and they take reservations.  Prices here are super reasonable and they have beer/wine/saki #winning\n\nAppetizers: all phenomenal and exceeded expectations.  We had the pork dumplings (6 dumplings per an order) which were so fresh and piping hot. The shishito peppers were also fabulous crunching and just a bit charred for flavor.\n\nDinner: we had the ramen burger and this was out of this world! So good, so much flavor and absolutely delicious. I have never had one of these before or anything like it, but definitely one of the best things I have had.  The spicy miso ramen was also delicious. Not the best but good.  We would definitely come back to enjoy another meal here.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "I love coming here, especially in the winter and fall. In my opinion, this is the best ramen place in Brooklyn. I have been to a few places and either the meat is chewy or the broth is tasteless. This comfort food makes me happy-I melt in the broth. I also like the appetizers and how the menu has new items throughout the year. My favorites are the Red Tonkotsu Ramen (not spicy) and the Tonkotsu Ramen. The buns and the wings are great too.", "author": "Syndy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "If you're in a ramen kick are in the BK Heights area, this is the (only?) spot! Cute, small little shop with efficient and friendly service. I had their Spicy Miso Ramen which could have used more of a kick. \n\nTheir broth is very good, but I've had more flavorful and richer ramen in other spots in the city.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-11", "description": "One of the best ramen noodles I've had. Very delicious flavor of the broth. The staff is pretty decent.  The seating arrangements aren't the best but overall a yummy ramen.", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-11", "description": "I was looking for the best Ramen in Brooklyn and this place had the best reviews. It's pretty good. \nStarted with the grilled peppers and tuna apps. Grilled peppers we're great as was the tuna. \nThe server was knowledgeable about the saki which I really appreciated. \nI ordered the sauteed ramen as I hadn't had that before. I also asked for a side of broth. It took write a while for the side of broth to get to me, way after the noodles were delivered. Next time I will make sure I get my ramen in the broth! Not saying it wasn't really good, it was more like a plain pad Thai than ramen. The broth was complex and savory. I really enjoyed it. The egg was over cooked and not pleasing to look at either. That could have been much better. \n\nAll in all an enjoyable experience, but next time I'm in the area I will try the ramen place down the street before coming back to here.", "author": "Ralph R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "We stumbled into this restaurant, post music festival in the area. It was key because it doesn't close until 11:30pm on Saturdays, and there wasn't any other food around the area. But, what a charmed discovery it was!\n\nI consider myself a Ramen Kween, and Kogane exceeded my wildest ramen expectations. My friend and I shared a plate of miso-glazed eggplant (mmm, eggplant) to start. She had a pork-based ramen while I had the spicy, vegetarian ramen with a soft-boiled egg. With mushrooms, okra, noodles that tasted house-made, and kale, the spicy veg was delicious (usually, it's so hard to do vegetarian ramen well) and came in a massive, massive portion. Of course, I ate every last bit. \n\nOur food came out quickly. The space was clean (though, they could've been a little more liberal with the A/C...I get it, I get it, though - hot, stuffy, humidity is just par for course in NYC during the summer).", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Quality food and great attention to service.\n\nOrdered the takoyaki and tonkotsu ramen. It's honestly hard to screw up takoyaki so it was within expectations.\n\nRamen broth was rich and the meat both thick and tender.", "author": "Jay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "Kogane Ramen is a small restaurant, so if you have a large party, its probably not a good idea to come here. But for a party or 2-4, Kogane Ramen is perfect. \n\nI ordered the Tonkotsu Ramen, which is pork based, and it comes with two pieces of soft tender pork jowl, half a soft boiled egg, scallion, mushrooms and black garlic oil. My god, it was so good that I even drank the whole broth. My only thing is that it wasn't enough for me. For someone who can eat a lot, I could have easily eat two bowls. It would have been nice if they gave a full egg and an extra piece of pork.\n\nThe restaurant is small, but each table has enough room where I was not on top of the person next to me. What I like was that toward the back of the restaurant there is a window where people can sit facing the window, can watch the cooks make the ramen.\n\nThe prices are a affordable and the service was great. They were nice and respectful. I would definitely come back.", "author": "Vincent A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "What a surprise! Was not expecting anything from here, but their ramen surprised me. Broth was rich and delicious. If you're craving ramen in Brooklyn, check this place out.", "author": "Ming L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Cute little gem of a place. Hanging out in the area with the hubby and the pooch, figured we'll give it a try - pooch had to refrain, yes she was very sad about it - ordered take out and took our lovely meal to the promenade. Deliciously tender and flavorful pork jowl buns, love he tad bit of a kick it had and how the pork belly just melted in your mouth. The Ramen was delicious - full of flavor, super filling, huge portion.  I wish it had a bit more mushroom. The place was packed so we had to wait a little longer (oh well, the rain hadn't started yet) and from the looks of it, not only was the place packed but there was a line waiting too! Note to self - will come back!", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "No fuss delicious spot for Ramen in Brooklyn. The menu is simple and the food is spot on. Perfect for those chilly fall evenings when you crave something hearty and tasty. \n\nMy vegetarian friends- Kogane has got you covered with two veggie friendly options (veg broth base) that are both distinct from each other. I had the spicy vegetable ramen and it was incredibly flavorful and rich with mushrooms, okra, kale and bell peppers. I added the soft boiled egg which imo is a must have with ramen and it was a perfect complement. The service was friendly and quick and they give you a jug of water at the start so you don't have to flag down anyone for refills (it's the little things ya know?). The space and seating is limited but they make the most out of their outdoor seating with heat lamps. The menu also has a variety of hot and cold appetizers and dishes to satisfy.", "author": "Gayathri G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "Solid ramen joint just across the Brooklyn Bridge. I was feeling adventurous and tried the Parco Ramen, which as it turns out had a very interesting curry broth. I enjoyed the bowl-it was very large and definitely filled me up for dinner. I thought that the broth was a tad bit salty but was very flavorful. The noodles were good quality and I thought that the ratio of other toppings was decent as well. \n\nWith so many ramen options in Manhattan, I'm not sure if I would venture back here specifically for this place, but I definitely think it's worth stopping by if you're in the neighborhood and looking for a casual bite!", "author": "Mendy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "I love this little restaurant. It is great for meeting a friend or a small group. It is quiet for how close the tables are.\n\nI love the all natural wood used in the space, gives it a rustic, but natural feel. Is relaxed and inviting. The staff are very friendly and attentive. \n\nAnd the ramen is a delight! I love the curry base ones and pork tonkatsu. Broth is complex and has good texture. The tea is also good. They don't over stew it like many places do.\n\nThings they could improve, not much. Would love to see more pickled vegetable offered as add on and more tea options.", "author": "Anna H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Delicious broth and ramen, one of the best in Brooklyn. Also must have the green roasted peppers and the ramen burger  highly recommend it", "author": "Mike V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "This review is for their delivery. I ordered two tonkotsu ramen, a ramen burger, and takoyaki. The ramen soup came separate from the noodle and pork jowl which was good so that the noodle won't get soggy. However, one of the lids for the soup split right open and spilled all over the bag. That was half the soup gone. The noodle was okay but was stuck together. The pork jowl was tasty and had a good distribution of fat. It seems like it was not cut against the grain, so it was a bit difficult to bite off. The ramen burger was rather hard to eat. Even though we ordered \"rare\", the meat came medium well to well done. The takoyaki was tasty and pretty on par with other good takoyaki places in the city. \n\nConsidering the downtown Brooklyn area, this is a solid ramen place.", "author": "Nilsa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "When I need something less heavy, I like to order the shoyu ramen. The parco ramen is a little too salty and the tonkotsu pork a little too oily.", "author": "Sandra K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Very delicious bowl of ramen. It just hits the spot! I'm no ramen expert nor have I been to Japan. But the broth was extremely flavorful. I had the Red Tonkatsu Ramen which had a nice kick but not overly spicy that you can't taste anything. I'm happy I found this little place servicing hot delicious goodness a few block away from where I live.", "author": "Melanie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "We sat outside and it was a very nice setting. We all had a different ramen and it was delicious. Perfect for a fall day if you order the spicy ramen. The wings were nicely crisped with a sauce that I've never had but truly enjoyed. Go experience this spot for yourself, it's a treat.", "author": "Dylan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-29", "description": "This place is definitely above average but not exceptional. Being one of the very few ramen restaurant in the downtown Brooklyn area, this place got my attention and my friends and I decide to check it out. \n\nI got the Red Tonkotsu Ramen, which is pork bone broth ramen with chili paste and braised pork belly. It was really yummy. The broth sustained a deep tonkotsu flavor while still was very thin and light. The spice level was just right and consistently. The only down side to all of the ramen was the sold boiled egg. I felt like it was overcooked by 30s to a minute, because the yolk was starting to get powdery instead of jelly/jam like. They also only give you half of an egg, which is absurd in my opinion..\n\nAnother specific downside was the tonkatsu in the parco, curry based, ramen. The pork cutlet was supper fatty and chewy, as if I was biting on tendons instead of just the pork loin. At least two of the pieces were like that in the bowl, which makes it very discouraging to eat. I just wish that they use only the pork tenderloin\n\nThis place is really small so a reservation in advanced would be ideal.", "author": "Hai L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "Come here if you're craving some ramen and you want to check out the Brooklyn Bridge! My friend and I chose this place because we didn't want to go out of our way to a more well known ramen place and have to wait in line for a long time. It is about a 3 min walk from the High Street Station. I came here right when it opened at 12 and throughout my whole meal there was never a wait. The ramen here wasn't to die for but it was pretty good and was a quality ramen; it didn't make me feel gross after. The broth was light and it wasn't over bearing. I got the Tonkatsu and my friend got the Red Tonkatsu. If you want a mild kick ask for some chili that you can put in the soup. The Tonkatsu came with thin noodles, I thought it was a little bit tougher, but I prefer the thick noodles. The meat was superr good, probably one of the best i've had. Normally the meat is overcooked and hard but this was tender (I just ate around the fat). I love that it came with the bamboo shoots, mushrooms and the soft boiled egg. Since I don't live near New York, I will probably not come back since I want to try other ramen spots but for a decent ramen nearby the brooklyn bridge it's super convenient.", "author": "Amanda B."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}