{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "This is a good, quick ramen option. Take out is inconsistent on broth taste- sometimes way too salty.", "author": "Alissa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Service is nonexistent here, but I never expect this for Asian restaurants in particular. The tonkatsu ramen I've had here is everything you would want in a good bowl of ramen--the broth is savoury, buttery, rich, all in one. The noodles were perfectly al dente and springy, and is also made in-house. The chashu was succulent, juicy and tender. The portion sizes are rather small here, but everything we've had from the grilled mackarel (which is awesome here, and one of the best I've had) and pork buns were absolutely delicious. Not too much of a bad thing though since you can try a bunch of different dishes without breaking the bank!", "author": "Lesley Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "This is a great little restaurant in the Heights. The service is excellent and the staff is very attentive. You can see right into the kitchen to know how they are preparing your food. The prices are really good for this area. I recommend the Ramen burger. The noodles taste great, the sauce they use is tangy but not too strong and the burger itself was juicy but not greasy. All around a great dish. We will definitely come here again!", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "My husband and I were very pleasantly surprised. We ended up here just craving ramen, so naturally we googled to see the nearest spot. Let me just say that for my husband to come home and absolutely fall in love with a bowl of ramen is a great way to relax and unwind. Definitely will be returning , next time to dine in. Yes! We ordered take out. That should speak volumes!The broth had depth and the noodles were pure love. I ramble - that's how phenomenal this establishment is!! Give it a try!", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-12", "description": "Four stars? Seriously? This place is so subpar. I had to return my Shoyu ramen as it smelled and tasted rotten. And the Tonkatsu I ended up getting wasn't much better. Maybe the kitchen was having an off day.  But I know I won't be returning.", "author": "Mark C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-02", "description": "This review is for the tonkatsu ramen. Broth was decent but not as flavorful compared to other notable ramen stops you find in the city (Totto, Ippudo, etc). Umami was definitely there though. The actual ramen noodles are their claim to fame; self made and perfect al dente. Pork was thicker than most places, had some texture, chewier than what I would've preferred and lacking the melt-in-your-mouth sensation I seek. Other ingredients performed as expected, not extraordinary. Overall I thought the quality was well above average and my expectations were met. Definitely a welcome addition to the pool of culinary options in Brooklyn Heights. Would I come back? Possibly, since there are many other things to try on their menu; but only if I happened to be around the neighborhood. For those who aren't from the immediate area, I would still recommend a trip to the city for any ramen craves", "author": "Alan Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "This is a good place for ramen , the broth is rich and noodles are chewy , not cook too long , it is just about right to have that texture, table and chair all made of wood, nice small atmosphere", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "This Ramen establishment was pleasantly a great find. I had the spicy miso Ramen and was taken by the depth and flavor of the broth. Was not too greasy or salty. Was delicious from the first slurp til the last. Also tried the takoyaki and chicken wings, was not disappointed with them. Both were OSHI. I will definitely come back even if I have to trek there from Flushing. I gave five stars because the service was great. There's a nice lady at the counter who's very personable. I always appreciate a good service.", "author": "Suzanne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "I ordered the special Miso Lobster Ramen and it was quite good. The broth was very well-flavored, the noodles were as perfectly cooked as other reviews stated. That salted egg? Delicious. My only gripes were that 1) I was given a lobster claw and then some part that included three legs? The leg part was inedible, the claw was annoying/messy and not easy to enjoy as it felt like a chore. 2) $4 for extra pork portion which is only two pieces. I would have liked a little more pork for that price, especially since the dish was already $15. Also it would have been nice to have a whole egg instead of half! This place is great but they're a little stingy with protein portion sizes. I'll definitely return next time I'm in the area or am looking for good ramen without the trek to manhattan.", "author": "Jazmin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "Rustic and real. #KoganeRamen in Brooklyn is a rare gem that shines. Small shop with large selection of handmade love-filled ramen and dishes. Just a few steps from the R train. Easy and surly to revisit :) #jkhknyc #goodeats #ramen #brooklynheights #happiness", "author": "Jimmy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "It's been hard to find a decent ramen place in Brooklyn, and this one is conveniently located close to DUMBO. About a 10 min walk from the park, it's a good place to eat and hang out with friends. I got the tonkotsu ramen, which was flavorful yet not too overpowering. But it definitely was more seasoned compared several other places I've tried. The meat was amazing, nice fatty pieces that  melts in your mouth. The portion was great for the price. Been here 3 times, and will definitely come back whenever I'm in the area.", "author": "Andy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "Excited to have another Ramen shop in Brooklyn. This place is small and cozy and feels very Japanese with the open kitchen. It is well kept and service was attentive. \n\nI ordered the Spicy Miso. Very tasty and flavorful broth as I had hoped. Noodles were nice and hot and cooked al dente style. Egg was warm and runny. Only downside is it did not come with pork so I had to order extra pork. It cost $5 for two small strips of pork which was disappointing as you usually get more pork for this much even at spots in the city. Overall a great hearty bowl of ramen and I will definitely be coming back.", "author": "Phuong P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "The ramen was good!!!! The service was fast as well. We also tried their dumpling, yummy!", "author": "Anh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Noodles were really great, you can tell that they're quality. They hand make them in shop. \n\nThe ratio of soup to noodle is great, just enough.", "author": "Kaye M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "Excited to find a good ramen spot in Brooklyn. The atmosphere is trendy with an East Village vibe. It's fairly small inside, but the hostess is very efficient in trying to get customers seated as quickly as possible. Service is very attentive and they served complimentary tea. The ramen burger was delicious. The meat was very tender and flavorful and the Ramen bun did not fall apart. The Shoyu Ramen bowl was excellent. Broth was flavorful and not overly salty and the white meat chicken was delicious. Overall, a nice spot for Ramen in Brooklyn Heights.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-26", "description": "I had the Tonkatsu ramen. It was sufficient. Not my favorite but I would definitely go back. It's hard to find ramen in Brooklyn Heights/downtown Brooklyn. The only other one is Ganso. Though I do find the broth at Ganso richer, the price point at Kogane is more palatable. I would go back and I'm very curious about the ramen burger.", "author": "Janice P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "It was our first time trying the Ramen rage. I can't say enough good about this place. There is limited seating, but we didn't have any issue, and the restaurant was very clean. Absolutely delicious!!!", "author": "Mary Jo B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "The Tonkotsu and Shoyu ramen were delicious, authentic and well-portioned. The egg was perfectly soft boiled, the broth flavorful, and the noodles well cooked. We came on a Saturday evening, had no wait, and were immediately served by their polite and attentive staff. The interior is cozy, yet classy with beautiful solid slab wooden tables. The location is fantastic in quiet Brooklyn Heights seconds away from the A,C,2,3. Would highly recommend.\n\nAlso, they now accept credit cards!", "author": "Evan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "Ordered the Brussels Sprouts and miso eggplant - above average.  The squid salad, dumplings and ramen were average.  The service and portion are way below average (so tiny that I wanted to ask the waitress where the rest of my ramen went).  The waitresses were not helpful, didn't want to be bothered, didn't pay attention to the bill splitting instructions.  I love ramen and I don't mind paying a premium for good quality food, but I don't think I will come back soon.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "One of the best ramen I've ever had. Great ingredients, home made noodles are very tasty, and everything cooked to perfection. Definitely coming back!", "author": "Davide B."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}