{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "The ramen was delicious. I tried the Red Tonkotsu ramen. This is probably my new favorite ramen spot in Brooklyn. Maybe even NYC considering the price. Ippudo and Ichiran are good but it will run you at least $20 a bowl. The egg was perfect. The broth was on point.\n\nI didn't have high expectations coming here because I've been to Japan. Ramen is $6 in Japan. Since my friend said this is his favorite ramen spot, I decided to give it a chance when we were looking for a place to eat.\n\nWe forgot to ask whether the noodles were made by themselves. Unlike most ramen spots in NY that use sun noodles, Kogane's noodles are different and much better. Thumbs up from me. \n\nThe interior of the restaurant is very relatively small. We sat outside because it was a beautiful evening. Outdoor seating is limited as well but we were lucky and didn't have to wait. Service was efficient and the wait time for food was short. \n\nI also tried the ramen burger. I've never tried a ramen burger, which is the only reason I ordered it. It is whatever. I would not recommend. It just taste like fried ramen and group beef... well duh... \"Ramen burger\". \nBrussel sprouts was good too.", "author": "Cheny N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-14", "description": "This place is SOOOO good. Their ramen burger is delicious. The staff is friendly and attentive and the food does not take long.  I live in bushwick but insist on traveling to Kogane for their delicious food.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "A friend said this was their favorite ramen spot so A and I wanted to see how it compares to our long list of places we've been. We were the first customers there when it opened at 11:30AM on a Saturday. Baby A was given a plastic cup for water, which I always appreciate. While it's not the best for either of us, it was good but the star was really the brussel sprouts for us. They were so good! We also got wings, the tonkotsu ramen, and kogane stir fried ramen, which was on the sweet side, but baby A enjoyed everything we had.", "author": "Brietta Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "Best ramen I've ever had and at a good deal. I recommend the tonkotsu ramen and the pork gyoza.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Very tasty ramen.\n\nA few vegetarian options !\n\nGood beer choices.\n\nAmazing spoons!!!\n\nGreat atmosphere and staff!", "author": "Karen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-18", "description": "It's not bad at all. Spicy is spicy which I really appreciate and often can not find. The staff was really nice. I'll absolutely go back or order again.", "author": "Jess A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-01", "description": "I ordered shoyu to go and was admiring everyone else's ramen. The restaurant is extremely tiny and I felt like I had to keep twisting and turning for people walking past and delivery men setting up orders. The menu consists of pork, pork, pork and more pork. I'm used to a bit more variety with ramen. This place is definitely overpriced for the quality and amount. I constructed the ramen when I reached home. The broth was amazing and I love scallions. The portion was extremely small and the two slivers of chicken slices were disappointing and the noddles were hard and dry.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "Ramen was great wish I had a pick of the after.\nSmall but very good spot gilled up really fast. Water glass is never empty cause they fill it up quickly. Lol so you wont go thirsty", "author": "Caroll W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Place is quaint. Tried the Tonkatsu ramen, the ramen burger, sweet potato fries, wings. \nRamen really filled me up n usually it doesn't, tasty broth, n noodles.\nFries were fresh n hot right out the frier! Good dipping sauce with it.\nRamen burger was interesting--they ask how u want ur burger -got it medium rare.\nWings came with a good sauce on the side too.\nNearby the Brooklyn Bridge so you can go walk off the food afterwards :-)", "author": "Lynie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "I went here last night for dinner with a couple of friends after walking around dumbo! We were looking for a quick and relatively cheap meal because we were starving, and this seemed like the perfect spot. \n\nLocation/Venue: We sat at their sidewalk tables, and it was really nice outside! They close outside seating at 10:45pm, but the inside is open until 11:30pm. I'd definitely recommend sitting outside during the summer! They had candles set up and overall the ambience was perfect for a chill night out.\n\nFood: Love!!! We shared the pork gyoza to start, which was pretty good. Nothing too amazing, but a solid appetizer. For entrees, we got the red tonkatsu ramen and the normal tonkatsu ramen (both were pork bone broth with pork belly and various standard ramen toppings) -- They were all so good! The broth is super rich, there were plenty of noodles, which were made well, and the pork belly was so tasty. \n\nPrice/Value: Such a great meal for the price, especially in the area. The ramen was around $13, it was delicious, the location was prime if you're doing touristy things in dumbo, and the service/venue itself was great! Will definitely come back :)", "author": "Vivian Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-09", "description": "No. \n\nI got the miso ramen and I was very disappointed considering the high ratings. Very misleading. The broth was watered down, the egg was over cooked, noodles were too chewy and overall not very enjoyable. Gyoza and shishito peppers were good! \n\nIt wasn't busy but for some reason, every time I requested for something, they would acknowledge it but then forget and I'd have to ask again 10 minutes later. Annoying. \n\nOverall, just no.", "author": "Joanne H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-04", "description": "Went here on Sunday with two of my friends after we visited cat cafe. The ramen was just ok-very basic and nothing too special. The decor was cute and it's only 15 mins from my apartment but I wouldn't go out of my way to eat there again.", "author": "Melle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "Cool affordable dinner spot on a street lined with higher priced restaurants. Friday night, both seating indoors and outdoors (opted for outside near the heat lamp).\n\nAgain, the menu is moderately priced, with a good selection of ramens/drinks to choose from. Decided on the Red Tonkotsu Ramen ($12) and a glass of Plum Wine ($8). The wine comes out first; a tart yet sweet drink with a large kick. Inside there is a small plum which soaked up the booze (great to save for the end). Ramen comes out in 18 minutes - a warm bowl of noodles, pork, mushrooms, scallions, and an egg. Noodles are a little tougher than I usually like, but the pork is tender and the rest of the ingredients meshed excellently with the broth.\n\nService started off well, then tapered off as the night went on (solid crowd on a Friday). Overall wonderful value for the area, especially on cooler nights.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-25", "description": "I've been here a couple times, and whether there's a line or not it's always a good idea. The other day we got seaweed salad, which was a touch spicy, very delicious, and included a couple pickles. The gyoza was perfectly prepared and portioned. My favorite is the spicy miso ramen which has a well balanced medium spice. My husband got the chicken and the meat was very tender and juicy and was more subtly flavored. Both delicious but we both preferred the spicy. I've had the pork buns before and they were also tasty. Nice service, clean and reasonably priced.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "Very solid ramen restaurant in Brooklyn Heights. We could smell the ramen from just passing by the restaurant. The weather was very nice the day we were there so we ate the ramen outside which I recommend, there aren't many ramen restaurant where you can do that! \n\nWe both ordered the Tonkatsu ramen ($14). They came out pipping hot and not as salty as other places which is a plus. Stop by for a nice bowl of ramen if you are in this area!", "author": "Siyun Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "Delicious ramen! Hidden gem you may walk right past if you don't know to stop. \n\nNot too many choices that you're overwhelmed, but just enough that you have options. The portions are large and it's difficult to finish, but definitely worth trying to. Had the spicy pork belly ramen--the perfect amount of spice.\n\nCan't wait to go back and try some others! Mmmm...ramen!", "author": "Garynn N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-23", "description": "Small restaurant with a big menu. \nRamen was good but suuuuuper heavy.\nI felt like they weren't very accommodating with the seating outside, the guy forced us to sit in the sun, didn't help shade us with the umbrellas, it didn't feel like he cared for our business.\n\nIf you're in the area, the ramen is definitely good enough to stop by and try.", "author": "Shayan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-25", "description": "Spicy miso was a bit too salty. Also, minced meat instead of slabs, which is fine, but not my cuppatea.", "author": "Tsekub B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "So good I was still thinking about this ramen days later. I try hard not to repeat when there are so many outstanding places to try. Couldn't resist. This time I'm having the Parco which is pork and ramen broth.   Spicy with a mild curry flavor.  Breaded pork on top. Yum! \n\nCome on by!!", "author": "Dina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "Found this place on Yelp and I had the Lobster Ramen!! It was so good! Service was great as well and that cream and melon soda amazing! I will go back for sure!", "author": "Scheniqua E."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}