{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "We walked as well across the Brooklyn Bridge, we wanted a warm hearty dish.  We found Kogane.  The wait was pretty long. It's a pretty small kitchen and indoor dining area.  We got the shoyu ramen, takoyaki, sweet potatoe fries and ramen burger.  We also got an extra noodles and egg.  The ramen was really good. It's the most friendly of all ramen, basically chicken soup with noodles. The chicken breast in the ramen was super flavorful. Normally I don't like the breast but it was so flavorful like a thigh. The ramen burger was OK. The ramen buns were seasoned with the Japanese curry but the flavoring could be stronger.  The takoyaki came with a sriracha mayo that went great with the sweet potatoe fries.  I also got a Sapporo draft.  Great meal, wish it was about  $15 cheaper but I expect ramen to be a quick and cheaper food like Japan.", "author": "Mike L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "Cute little ramen shop. We came at 11:45am on a weds and they were quickly filling up for the lunch rush. To start, we had the brussel sprouts, then we ordered the tonkatsu and lobster ramen. The lobster ramen was delicious, with great umami flavor from the pork bone and lobster broth. There was a whole lobster claw in it as well, and it tasted fresh. I didn't try the tonkatsu but my fiance and his father didn't like it. I wasn't sure why, but I assume the broth wasn't up to par, or maybe it was too early in the day for ramen? Overall, it seems like a solid place for a bowl of noodles if you're craving for some. I'd try this place again if i'm in the neighborhood!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "We go here all the time, the ramen and service are always great.\nHighly recommend the Parko and spicy miso ramen. Delicious!", "author": "Caitlin O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Delicious ramen! I had the red tonkatsu ramen and a can of sake. Food arrived in what felt like less than 10 minutes after I ordered. The portion was perfect for me, I was stuffed after finishing the bowl. As far as spice goes it wasn't too spicy, definitely made my nose a little runny though. The sake was strong and not too bitter, would definitely come back with friends! \n\nThe ambiance is very nice, it's a small place but not cramped there are also coat hooks so seating is comfortable. The heating is very strong in here so you won't be cold even when the front door opens. Service was 10/10 not too pushy but attentive.", "author": "Isabel V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Went there last night with my family and everything was delicious! We had the seaweed salad, pork gyoza, octopus balls (don't judge them, they're delicious) to start. For Ramen we had the Red Tonkotsu, Spicy Miso, and Parca. The last one is curry based and not up my alley at all, but my son loved it. I'm used to spicy miso ramen with pork slices instead of ground pork here, but it was a nice change. My boyfriend has had food here multiple times since he works in the area, so he's obviously a fan. Quick, attentive service, not a huge restaurant, but tables seem to turn around pretty quickly.", "author": "Chami V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-11", "description": "I've only ordered takeout from Kogane Ramen, so I can't speak on its service or restaurant experience. However, upon trying their food, I was left with mixed emotions. \n\nI tried one of their ramen items and also the ramen burger. For the ramen, no complaints there. The broth was flavorful without being overpowering to the other ingredients. I saw the ramen burger on their menu and was curious by the novelty of it. That was a mistake as the ramen burger was a mess. The whole thing was oily and greasy as it dripped all over the place. For new customers, I'd recommend sticking with the ramen items here; go with what you know.", "author": "Linda O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "The best ramen in Brooklyn heights ! Try the tonkatsu  ramen ! After walking the Brooklyn bridge , slowly enter the best dinning area in nyc where things are easy and classy!", "author": "chin keong l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Happen to walk across the Brooklyn Bridge and open up my Yelp app to find a local ramen place. Glad I did! Walked in and could immediately feel the authenticity of this place.  \n\nRamen was fresh cooked just right and the perfect amount of spice. The Miso spicy  ramen was to die for. Finished every bit of it and the price of beer  was extremely reasonable.  Everything was authentic all the way to the wooden ramen  spoons. \n\nIf I'm Brooklyn you must come here. Two thumbs up all the way!", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "This is my new favorite ramen place.  I don't need to go to Manhattan for good ramen anymore.\nVery clean and nice staffs.\nThey only accept cash, but no worries they have ATM inside of restaurant.", "author": "Jay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "The parco ramen was delicious. Loved the curry base for a ramen. Very flavorful and the ramen was cooked perfectly.", "author": "Maddy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Kogane is definetely one of my go-to ramen shops in the area. The broth always comes perfectly hot, not lukewarm, and I don't find anything too salty or oily. Their ice cream mochi dessert is super yummy and keeps me coming back!", "author": "Janli G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "I stopped by on a day while performing my civil duty. It is about a ten min walk from the courthouse so overall very accessible since lunch was 1.5 hrs long. It might be more rushed if I only had an hour.\n\nI was torn between the lobster Ramen VS the basic Tonkatsu or shoyu Ramen VS the red chili Ramen (my tolerance for spicy is on the mild side). Ultimately, I ordered the red chili Ramen and asked the server if they can make it less spicy. Yes they can! And it ended up being perfect for a cold rainy day. The service was fast and the Ramen was delicious. Price was also reasonable in my opinion, $12 and 15 after tax and tip. I will now be on the hunt for something similar near my office.\n\nThis is a nice alternative to the big chains near the courthouses such as potbelly and shake shack.", "author": "Lilly T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-10", "description": "Sat at the bar (with a direct view of the kitchen) and very disappointed to see that the takoyakis are not fresh-made...they are from a popular frozen brand you can get in a Japanese mart. The cook just dump them in a deep-fryer and add sauce...", "author": "Angela L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "They serve the Hakata style ramen which I love, though the tonkatsu broth is not as rich and thick, the slaps of fatty roasted pork made it all better. The chicken wings may take 20mins but it's worth the wait.", "author": "Bryan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "Given the lack of ramen stores around me in BK, this place offers a decent option to satisfy my ramen cravings. We came here for lunch on a Saturday, it was quite empty, but there were constant takeout orders. \n\nWe tried their pork buns, pork inside was very tender and juice, but I think it needed more sauce or more seasoning, because the flavor was a little bland. For their ramen, the broth was not mind-blowingly amazing, but it wasn't bad at all. I like \"al dente\" for all types of noodles, and here the noodle was cooked perfectly. I left feeling very satisfied. \n\nI will come back here if I need a quick fix for my ramen cravings.", "author": "Lu H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-26", "description": "I was not impressed. \nThis is a small hole in the wall restaurant with blah ramen. We waited a little before we were seated. Because its so small, there was barely any room to wait inside so we stood outside instead.\nWe started off with the pork buns. They were decent with good flavor. I was hoping the pork would be super tender but it was ok.\nI had the spicy miso Ramen. It wasn't bad,  but it wasn't that great either.  The noodles were al dente, which is good. The rest of it is barely memorable, the soup was OK,  the toppings were OK. \nBlah.", "author": "Stephanie Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Had the Miso Lobster Ramen and very much enjoyed it. Broth was semi-thick and there was lots of noodles and a huge claw hiding inside. My first ramen experience in NY and I was satisfied. Hopefully will be able to try another place before I fly out.", "author": "Edwin R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-10", "description": "Solid food but all that's etched in my memory are the itchy mosquito bites I got from eating outdoors one summer night. Not cool.", "author": "Jane N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "Spicy miso ramen was delicious! Very flavorful and savory. Red Tonkatsu ramen had a clean taste with ton of pork flavor in the broth. Definitely add the ton Toro (fatty pork) topping pieces to your ramen! You won't regret it.", "author": "Stephanie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Had the red tonkatso ramen and it was great! I'm so happy that there is a good ramen place in the area.", "author": "Kyle R."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}