{"aggregateRating": {"reviewCount": 294, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "First time here and I really enjoyed it. I've been on a ramen kick lately, but this is definitely the best I've had in NYC. Cute little place, efficient service, and the food was amazing! I got the spicy miso ramen- not too spicy, but my nose was definitely running, and they have extra hot sauce on the side if you need to add more. \n\nI have a huge appetite \u0026 ramen is never enough, so I ordered extra noodles, but the portion was very big and ended up being too much. Overall, a lovely experience. Will definitely be back!", "author": "Noelia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "I knew this place from the ramen fes, they served spicy miso ramen there and it was so good.\nToday I went there to enjoy a whole bowl. I got sth special, miso lobster ramen. They broth still tasted creamy, thick and tasty. I got a whole lobster, it was fresh and sweet. Pork belly was delicious too.\n1 more thing I love about this place is they have one chili oil jar every table so I can make my ramen as much spicy as I want\nI took 1 star off because of the egg, a little bit overcooked.\nMy friend got curry ramen and he said he liked it too.", "author": "Linh H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "We went to this Ramen place after a stroll underneath the Brooklyn Bridge.  I have to say this is the absolute best Ramen place I have been to.  My new favorite.  You can taste the quality not just in the noodle but in the broth, the soup is amazing.  The pork cuts have the finest marble; better than a Wagyu cut. If you have not been here, you need to at least try. \n\nI am going again next weekend. Thank you Kogane.", "author": "Ray T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "After all the ramen adventures in Manhattan I have to say this brooklyn gem is not any inferior if not better. We were seated right away even when not everyone in our party was there - super rare if in a tiny Manhattan ramen shop! Friendly service as well. \n\nBrussel sprouts were amazing. Got the grilled mackerel as a special - not mind blown. We ordered three different ramens and they were all so great. The tonkotsu and the red tonkotsu soup bases taste similar, but I liked the additional chili flavor in the red. They come with different pork parts as well. The spicy miso also has the bone soup base, which makes it rich and has a complex flavor. Amazing price for the amazin food. Will definitely come back to try the fried noodles and all the other appetizers and bowls!", "author": "Lucy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "I had the Tonkotsu Ramen which came piping hot in a nice, authentic looking bowl. The flavor of the broth was outstanding! Intense and complex, with the right amount of saltiness. The noodles had a nice texture and the two pieces of pork jowl, although not large, were tasty and nicely complemented by scallions and mushrooms. The staff is friendly and the decor modern but cozy. Highly recommended and a great value at $13.", "author": "Maciej C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Spicy vegetable ramen so amazing. Try ramen in so different places, but this one is really great.", "author": "Oksana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "To be completely honest, the ramen is good, but not the best ramen in NYC. Ramen and appetizers' portion are pretty big. The staff who work there are nice and attentive.", "author": "Chloe M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "Vegan ramen was ok. The place was calm on a Sunday. I would come again. Good food, good people working there. Quite fast.\nI totally recommend it", "author": "Loli L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "So the new ramen craze is definitely new to me-while I haven't had the opportunity to try a lot of spots I have nothing bad to say about this place. \n\nI ordered for delivery and had the edamame + spicy vegetable ramen. Let me tell you it will change your life. The mushrooms had the best texture I've ever had-and it was just spicy enough. While I was expecting more of a kick I could definitely tell it would have been hot for anyone with normal tastebuds (I'm convinced I can't taste spicy) \n\nThe ramen itself was very light and I didn't feel as though I was eating 7 pounds of crabs afterwards. So it was absolutely perfect for the chilly afternoon.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "I really wanted to like this place. I had high hopes as it was part of the Thrillist best ramen in nyc article i found online. It was a crowded friday night and brisk so it was crowded (it's a small spot) They were nice enough to let me put my name down ahead of time on the phone. We had the miso eggplant (fairly good, flavorful), the pork buns (meh, the buns weren't that great, and the pork jowl seemed lacking somehow), the seaweed salad (good, a little too salty). My hot green tea was lukewarm. I had the spicy miso ramen, really great. the noodles were excellent and had great flavor. My girlfriend had the tonkatsu ramen. also great flavor and good broth. The apps portions are small and the ramen portion pretty decent. I would realistically give this a 3.5, the noodles are great, but i wouldn't go back for anything else, therefore a hard decision to go back.", "author": "Ray C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Wonderful! I'm at the ramen spot right now and it's Sunday night and it's empty. The staff is lovely, food is on the spot. My boyfriend ordered the lobster miso ramen and i ordered the seafood ramen and it was so filling! We are gonna roll back to our hotel at this point. I definitely recommend this place if you want to dine at a ramen place away from the Manhattan crowd.", "author": "Alice V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Amazing Parco Ramen. Sometimes unluckily get bones instead of meat on my breaded katsu chicken, but generally it's good. Tonkatsu could use work, but Best curry ramen. Seafood is meh. But curry parco is good!", "author": "Raymond Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "This place was great.  The staff were tremendously friendly. The Chef was so warm, and happy.  I really enjoyed the Brussel Sprouts, the Wings and my Ramen.  It was legitimate Tonkotsu Ramen, the noodles and everything in it were great. They even were generous enough to give me a try of Eel Gyoza and something I can't recall for desert.    Tell your friends tell your friends..   I'll be back for sure.\nGreat noodles, Great broth. I am looking forward to the next bowl already", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Wow, exactly what I was looking for ! Tonkotsu ramen was worth the calories it took to get here. Pork gyoza is also pretty tasty! Only recommend ordering an additional egg since it only comes with half of one.", "author": "Katherine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "My favorite ramen place in Brooklyn. Though the restaurant is rather small, I've never had to wait for a table. Prices are much lower than other ramen places I've been to in the city and the food is delicious. My go to ramens are the Red Tonkatsu and the Spicy Vegetable, both amazing. Their pork gyoza and Shishito peppers are also quite tasty (though I've never gotten a spicy one...)", "author": "Lydia O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "I can not tell you how much me and my boyfriend enjoyed the ramen at this place. We're ramen enthusiast and try to snoop out the best ramen places. And I have to tell you this one tops all the ones we've tried. \n\nWe both ordered the spicy miso ramen and enjoyed it to the last drop of soup. Really good proportions and the place was nice and cozy. Thankfully we came in at a time where it was t to busy and got seated in less than five minutes.", "author": "Sally C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "Stopped here for lunch with some friends and our cravings for ramen were seriously satisfied! We went to their brand new location near Chelsea and it was just fabulous. Awesome service and ramen!", "author": "Viva V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "I've been to so many ramen places, mainly in the City, so I wasn't so sure about venturing to Brooklyn for some and how that would be. I must say, I'll never judge a ramen restaurant based on its location. This cute little shop that filled up very quickly, far surpassed the low expectations I had. \n\nI had the red tonkotsu and it was the right amount of spicy. The broth was extremely flavorful, the noodles perfectly cooked and the char siu was good. I always have a love hate with the char siu, but this one was definitely more on the love side. All in all, this bowl of noodles was exactly what I wanted and was the perfect way to kick off ramen season. \n\nThe price is right and the food was good, so I'd definitely be back. Get here when they open or expect to wait a little for a table. After you've eaten to the point where you can't even move, take a nice walk along the water as it's just a few steps away.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Great service and amazing ramen! Safe to say this place is better than Ippudo. Make sure you get an egg in your ramen, that was the best part. Ordered 2 bowls of ramen and two appetizers for $40. Cant beat that", "author": "Britini W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "This is a very cute small restaurant that serves good ramen. I got the yaki ramen since I felt it was too hot for soup (the place has ac, the day outside was too hot) and my boyfriend got the spicy miso ramen. My yaki ramen was very good. I wasn't too hungry but I ate everything. It tasted like it had a hint of curry or some other flavor that I couldn't really identify which tasted very good. The spicy miso ramen broth had a smoky flavor to it. I enjoyed the meal very much. I recommend this place to any ramen lovers. They also have a ramen burger. This is the first ramen spot that I've seen with it. I'll try it next time.", "author": "Vanessa G."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Kogane Ramen", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "76 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/HB-YOp80ilJJqyqRcFZ8Rw/ls.jpg", "@type": "Restaurant", "telephone": "+17188752828"}