{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Visited three times for wonderful coffee, gluten free baked goods and yummy, healthy breakfast bowl. Highly recommend the flat white. They also have a small selection of very fresh juices. Look forward to visiting again!", "author": "Teri K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Really wonderful addition to the neighborhood. Absolutely beautiful layout inside, with a surprising large amount of space. Free wifi. Yes, you will have to pay a bit more as it's Dumbo and I'm sure their real estate is outrageous. Welcome!", "author": "Mike P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "Great coffee, nice interior.  Good place to stay awhile and get some work done or to meet with others for a quicker breakfast (think avocado toast).  Really enjoyed the avocado toast, perfect spices and seasonings, and my husband enjoyed his toast and bacon.  Cant' wait to try the cold brew next!", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-11", "description": "I love what they sell \u0026 would love to rely on this for a treat but I've never had good customer service here. I'll probably skip from now on.", "author": "k m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "good vibes here, coffee, music, decorate, and service. the golden latte is the must try one. \nunlimited free wifi is the best attraction to me, since i used to stay a long time in cafe shop doing work. near subway, location is so good, few minutes away from dumbo park, good place to visit.", "author": "Harvey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "This place is nice to sit and have a coffee break. Also they have a plate menu for lunch. I like this place is not crazy busy when I go.", "author": "Yosi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-11", "description": "I was really happy with the coffee and the inclusion of Aussie-type coffee selections. I learned something new while there. the venue was really nice too. I spoke to 4 different baristas while there, 3 of them from Australia. All 4 of them were super nice. The only reason why this cafe got a 4 instead of a 5 is because our coffees were taken away before we had finished them AND after ordering one of the last Aussie type pastries, it was never delivered to me but given to someone else after me... I was shocked and disappointed considering my trip to this cafe took me almost 50 minutes to get to and hence, did not expect to not get what I had ordered. The wonderful staff did make up for it however. I will return but will make sure I get immediately what I had ordered :P Oh and one last note, the barista I asked where the coffee beens were from did not know :( He said it was roasted in Australis though.", "author": "Leo G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-14", "description": "too many options, too overwhelming. prices are fair. The cafe itself unique, nevr seen one like this. ample space.", "author": "Peyton R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-05", "description": "Had a coffee and a hot Chocolate they were both very disappointing. Not only it took a long time but I even think they gave me the wrong drink. It was super small and very pricey... sorry to say I won't come back or my friends", "author": "Tyler B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "AMAZING!!! my mom visited and i showed her around and after we walked the brooklyn bridge we wanted to just sit down for a bit and enjoy a coffee. we couldn't have found a better place!! got the iced chai tea latte (very sweet, just like i like it!) and i'm in awe!! this is one of the cutest nicest and reasonably priced places i've seen :-) definitely worth it!", "author": "Lydia Rosa G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-27", "description": "Excellent coffee and a very friendly staff.  But, $9 for a \"granola bowl\" with a a 1/4 cup of granola and 5 raspberries?   That is a travesty.  Waiting for Mulberry and Vine to open next door for my food options.", "author": "AK R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-28", "description": "$6 for a coffee and they don't take cash! Not worth the price at all. Food seems ok but everything looks overpriced.", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "It is awesome, go here!  The coffee is great, the space has a great vibe, pretty and good music playing, and the staff is fantastic.  Walter the barista is awesome, very friendly, and shared some latte art knowledge to go along with the coffee!  Great energy all around, and they do happy hour!  Check it out!", "author": "Dylan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-20", "description": "I don't think they're sure if they want to be a coffee shop or a restaurant. Now you have to wait to be seated at a table. I ordered something to go and then decided I wanted to check my email on my laptop so I sat down for a bit at one of the bar stools and the staff kept staring at me as though hoping I'd leave soon. I decided to give it another try thinking that maybe they were having a bad day. This time I decided to ask for a table. I got the same feeling that they were hoping that people would eat their food and leave... I used to love this place, the coffee is good, the staff WAS friendly and even though the food and drinks are way overpriced the ambience and location were worth it. Not anymore I guess.", "author": "V S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "I love this Bluestone Lane! I go here at least four times per week for morning coffee. The service is always very prompt, the croissants are delicious, and most importantly the coffee is delicious. It's also a great spot for a business meeting because the music is never too loud and there are plenty of outlets.", "author": "Brianna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Great vibe, excellent service, delicious avocado smash and the magic is magical. Music selection is on point as well.", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-31", "description": "First time at Bluestone Lane, since it was one of the only places in the area that sold matcha lattes. Ordered one, waited 20 minutes before I finally received my latte even though the people that ordered after me already received their drinks (which I don't even understand why, as their drinks were just as complex). Took a sip, and what a surprise- there were clumps and clumps of bitter matcha balls, because the barista didn't mix it properly with a whisk and used a spoon instead. As a result, I couldn't really enjoy this drink when every other mouthful was filled with bitter clumps. Tossed it out. This is what I paid $5.44 for? Disappointed, especially compounded with the wait time. Knew it wasn't an authentic place for matcha but still wanted to give it a shot since I was craving it at that time, but I guess I know better now. Can't speak for other drinks/food items but for matcha drinks and a fairer wait, stick to places that specialize in making matcha drinks (such as Cha Cha Matcha, Boba Guys, etc.)", "author": "Jade Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-27", "description": "Coffee is good enough. Counter staff could use a bit more charisma. I would give 4 out of 5 for coffee and ambiance and 2 out of 5 for staff service. The flamingos are a nice touch.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "This place should close until it can retrain staff.  You can order toast or a bowl for brunch and it still takes more than 30 minutes to serve. In the meantime, they close for table service and tell you it will come out in a bag. The staff is incompetent and rude in equal measures. Skip it and eat out of a dumpster instead.", "author": "Matthew J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Stopped in to warm up with a quick latte...LOVED it the staff was courteous and the \"magic\" was delightful!", "author": "K W."}], "servesCuisine": "Gluten-Free", "priceRange": "$11-30", "name": "Bluestone Lane", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/xZ_JE8vg052rCtm_EErp1Q/ls.jpg", "@type": "Restaurant", "telephone": "+17183746858"}