{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Solid matcha latté, a delicious matchagatto (matcha gelato), and a big open space to sit (with EPL action- a West Brom documentary- on Sunday)! Would totally come back for the beet latté.", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "Bluestone has amazing coffee. The iced latte is my drink of choice, regardless of the time of year. I've also tried the banana, almond honey toast and the salmon cream cheese toast. I love the latter more although they can afford to give you two pieces of toast. The service is always on point and the setup is beautiful. Download the Level Up app as a loyalty reward program. You won't be sorry.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Bluestone Lane is my ultimate happy place - arguably my favorite place in the city. I frequent Bluestone Lane every week (and try to hit every location in the city) and bring friends along each time too.\n\nThis morning, I trekked to the Dumbo location for the first time. Location is prime - right across from the Etsy HQ, and next door to the soon-to-open Dig Inn and a Row House. \n\nThe space is BEAUTIFUL. Familiar + similar to the other Bluestone Lane locations, this one feels a little more elevated (not sure why) - with flamingo wallpaper, a beautiful long counter of people preparing amazing coffee and bites. Ample seating, and WIFI + OUTLETS (no other Bluestone Lane location has these I believe). I camped out for a solid 2 hours writing, checking e-mails, and enjoying my iced soy latte (I get this every time) and the Dumbo-location special, the squash toast.\n\nThe squash toast was absolutely mind blowing. Thick cut multigrain toast, topped with a pureed squash w/ dukka spices, roasted beets + labneh. Literally a dream.\n\nWas an amazing morning, with perfect service, music, food, drink and people. So glad I checked out Dumbo - will definitely be back!", "author": "Roopa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "Stopped here for breakfast/brunch this morning.\n\nImmediately +1 for this place because it doesn't make it impossible to order something if you have dietary restrictions. I can't have dairy, so I was relieved to find out their beet root latte is made by default with almond milk. No special ordering for me! The latte was delicious and a great alternative to regular coffee, which I'm trying to stay away from. They seem to have a huge selection of other lattes and iced/hot beverages, so I'll be back to try some others.\n\nI also ordered the Market Bowl, which I believe was a special. Roasted squash, brussels sprouts, broccoli, and spinach with a poached egg (it also included feta, which I asked to omit). This was a great healthy brunch, and the poached egg made it so delicious that I didn't even need the tahini they included. Very flavorful.\n\nI only wish this place were a bit less pricy. I wasn't expecting to spend $20 on brunch, but I enjoyed it nonetheless.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "I am updating my review for Bluestone Lane because of their incredible customer service in response to my original two star review. I won't get into the details, but they took my review very seriously and more than made up for my bad experience. I have been in a few times since and have had only exceptional experiences with the staff, food and coffee drinks. I only hesitate to give a full 5 stars because it's so damn expensive. Maybe someday when my Bluestone splurges don't bankrupt me, I'll up it to 5 (:", "author": "Kristen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "I began my experience at Bluestone, which I have been eager to try for a while, by being greeted by the two most cheery, pleasant baristas! Note: it was 7:30 am on a Sunday and they were friendly! The coffee shop itself is decorated like a tropical oasis, so bright and inviting. I am both a coffee fanatic and matcha lover, so I grabbed an iced matcha with almond emily and a cold brew. All the hype was legit; matcha was rich and green with a great natural sweetness. The cold brew was stellar. Totally recommend this spot for any coffee and tea lover", "author": "Kat N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-07", "description": "I do yoga right around the corner. I normally pop in for a coffee to go. Which is fine. But lately I have dined in with my husband or a friend from yoga. Service is just bad and food is inconsistent. It's not a warm, cozy Brooklyn place. Feels corporate and off. Love the menu, but it needs an infusion of TLC to feel good. 2 thumbs up!!! But we expect more!", "author": "Kristy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "This place is my FAVORITE coffee spot in Dumbo! Exceptional customer service + Great food+My favorite drink (Aussie Iced Latte) = Life!! lol I recommend anyone is the dumbo area to check them out.", "author": "Louise J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-28", "description": "I never write reviews...but this place stood out like a sore thumb in my BK experience.\n\nWhile the hostess was incredibly friendly, that was the only redeeming factor.\n\nFirst of all the place is filthy, literally whole pieces of bacon on the floor, and several un cleaned table tops.\n\nThe food is very over priced, small portions, and pretty low quality produce. Their \"heirloom\" tomatoes are run of the mill tomatoes.\n\nFood took quite some time for what we had ordered (just two pieces of toast) and again very over priced (we ended up spending $50 on just two toasts and coffee).\n\nWe also mentioned our disappointment  to our waitress and they didn't so much as comp our coffees.\n\nThere are so many great places to eat! Id avoid this one.", "author": "J.Lucy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "Friendly staff and another coffee shop addition to the brooklyn neighborhood. \nDecor feels 100% like a West Elm Showroom from a few years back.  \nI still am confused as to why Australians do not put any salt on Avocado toast. There is barely any lemon either - just straight avocado - It just always has no taste. \n\nNeeds a place to put dishes once you are done as there are so many tables that are self service.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Friendly staff and nice latte.  Looked like a good spot to chill out.  Lots of seating.", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-15", "description": "Love the vibe and glad they opened one up in our neighborhood.... BUT past two times I've been there, they forgot my drink and would take 30 minutes to make a cup of coffee... One time I asked about my drink, the server guy kept saying, it's coming out and then brushed me off.. then 30 minutes later, he said sorry what was your drink? \n\nDespite the mishap, I will probably be back for the breakfast bowl and banana toast .. but hope they can get the stuff together.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-11", "description": "Coffee experiences influenced heavily by Australia's coffee scene are worth checking out. This one was a very nice experience. Definitely worth returning here", "author": "Gabe M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Amazing coffee, food, service, and atmosphere! Austin was so friendly and gave great recommendations.", "author": "Rebekah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "One of the best iced lattes I've ever had and the decor was so cute. Loved the atmosphere and vibe.", "author": "Shannon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Very friendly staff, lot of pastry options for people eating Gluten Free", "author": "Michael M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-14", "description": "Not feeling it. I had the avocado toast w bacon. This was maybe the most bland avocado toast ever, and for the price, that's not cool. My husband had the smashed pea toast, that was very mediocre as well. The coffee is on par with the dozens of other quality coffee bars in NY. The reason this place is popular is because it's \"Instagramable\". If you're looking to be basic and Instagram your brunch, this is your scene.", "author": "S L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-11", "description": "Ok food, not great service and mis-labeled green juice. On a scale of 0 to 10 I give the green juice a 0.5. If I were in a desert dying of thirst, I would drink it. Hard to think of another circumstance where I would consider it. It's 72% apple juice masquerading in packaging suggesting it's kale juice. \n\nThe food is fine but I probably won't be eating here again.", "author": "Diane P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Best chai in town- I'm not a fan of the ever popular \"Dona chai\" that every coffee shop in Brooklyn serves, it's not very sweet and overly cinnamon-y, leaving your mouth feeling super dry afterwards. I forgot what brand they use- but it's perfect!", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "I love this place! The food is really good. I can't get enough of the salmon toast. The restaurant itself is adorable - such cute decor. I will say, though, that the service is pretty slow... Other than that it's great!", "author": "Katarina D."}], "servesCuisine": "Gluten-Free", "priceRange": "$11-30", "name": "Bluestone Lane", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/xZ_JE8vg052rCtm_EErp1Q/ls.jpg", "@type": "Restaurant", "telephone": "+17183746858"}