{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "This breakfast was so delicious! It kept me full for hours, and the sweet, broiled carrots were absolutely wonderful. The coffee was really good too. The staff were really friendly and helpful when which item from the menu to pick. Would absolutely come back!", "author": "Mari Ø."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-18", "description": "This place does not accept cash. That is hilarious to me! But they have great iced coffee and there is almond milk and stevia on the counter available! That is rare! I will come back and try to eat here next time.", "author": "Minerva G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "The newest addition to the \"upswing\" of DUMBO, close to the newer DUMBO Heights office buildings including WeWork, so that you don't have to hike to Brooklyn Roasting (the best) or settle for Dumbo Kitchen (barely coffee, mostly water.)\n\nAlbeit overpriced, Bluestone Lane Dumbo has a very intentional, cute interior, and the service and eats are good. Australian accents, too.\n\nWarning: The cold brew is addictive!", "author": "Cassie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "I was in NYC for the weekend and wanted a good place to get brunch and mimosas. A friend suggested Bluestone Lane.\nThe entrance was a little confusing because it is attached to a hotel, but the entrance is just next to the hotel entrance. Inside it is a little tight and the tabes are small. So, I would not go with a big group over 4 people. \nI got the avocado toast, coffee and a mimosa. The food was amazing and the avocado was absolutely fresh. The coffee came in funky bottles and then you poured it into coffee cups. The mimosas were very good and made with fresh orange juice. \nThe price was a little high, but nothing insane for NYC.", "author": "Josh R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "I had a latte to go and it took almost 10 minutes to make with no orders before me.  But the latte was strong yet smooth.  I guess I will waste many 10 minutes here in the future.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Amazing coffee! Def. the best coffeshop in dumbo, great energy and food is d-e-l-i-c-i-o-u-s!\nI love the staff, specially a young african american man name Charles, I think, who was very attentious and was able to make me a SUPERB AB\u0026J toast super quick and a ( still getting over how good it was) expresso martini - pleeeease try it!! \nDef recommend for anyone who is looking for a chill place for work, or to ger a little break from their day or sight seeing in DUMBO", "author": "Bárbara E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-21", "description": "Part of the Bluestone franchise, it's a nice spot with a rustic chic decor.  Came here about three times so far since I work in the area.  I'm still getting familiar with the are myself as a newcomer to Dumbo; however there are better local coffee shops compared to this one.  This is comparable to a \"local Starbucks\".  Larger than typical coffee/tea breakfast shops, but have that similar quaint ambiance in comparison to smaller local shops around the city have to offer.  I would recommend this spot to tourist and newcomers to downtown BK, but for those who work in the area or live, it's boring and the food/beverages are over priced for what it is worth. The best thing about this shop is the service.  It's impeccable.  Which shop serves coffee to you as you wait in your seat texting your supervisor your running late, \"train delays\". Lol, continuing with my rant, I gave this shop four stars because of the decor and service. Besides, there is better food, tea, and coffee in your house using your Keurig coffee maker lol.", "author": "Stevie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "This place has a solid cold brew and you get in and out quickly. Prices are comparable to other mainstream coffee spots but the vibe is definitely better. The staff are all chill and friendly. All my experiences have been pleasant. One of the staff even remembered my name and I've only frequented this place a couple of times. Not a big deal for many but I appreciated the effort but it shows that they appreciate their customers.", "author": "Barney C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-22", "description": "The coffee is good. The seating is comfortable and spacious. But, the wifi is so bad. This place has everything to help you finish your work, but horrible internet.", "author": "Anshuma C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-23", "description": "Woman who made me a golden latte barked at me today. Very rude. Otherwise, like this spot.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "Cute decor and interesting and delicious Australian coffee drinks!  We got this drink called magic which is an Australian cortada and this amazing peppermint energy ball. Would recommend to any one!", "author": "Iris S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "I came to Brooklyn for a quick holiday and instantly fell in love with this place! The food, the coffee, and the customer service is amazing. The staff all make you feel so welcomed and are so friendly! Love this place!", "author": "Bridgette D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "Nice location - a block from the Brooklyn Bridge. Very close to the waters and a short walk to the Brooklyn Flea Market.\n\nThis Bluestone is spacious and has the cutest decor and furniture - gold metal chairs, marble-top tables, plants, mellow lighting. Good spot to grab a bite - absolutely in love with their wild berry donut. They have a good selection of pastries as well as other food items.", "author": "Judy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "I stumbled into here when jury duty didn't work out for me. I found myself a nice seat and just did work for hours. No one bothered me at all. I had a cute little beet latte which was so delish! Then I had a breakfast bowl when I got hungry. Everything was super fresh. An extra point for playing good music. I love how the Aussies do brunch. It's so good! Another thing was that the person at the register was so happy and positive. It makes a huge difference :)", "author": "Clarice Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "This place is near my office and it's where I go if I need an afternoon sweet treat or if I skip Starbucks on the way to work and still need some coffee. \n\nLike other Bluestone Lane locations, the staff here is mostly Australian and everybody is super friendly. The vibe is very Brooklyn chic. The back wall is covered in amazing flamingo wall paper and there are tons of brass accents everywhere. The space would be great for a coffee meeting (or first date if you're a coffee on the first date kinda person). \n\nI don't drink the coffee here much -- I actually prefer their lattes made with flavored powers. The matcha latte is thick and bitter in a good way, but the spicy, trendy turmeric-loaded Golden latte is my personal favorite. \n\nWhen it comes to food, don't expect a huge menu, but there are some solid lunch offerings. The avocado toast is hearty and feels like a treat (albeit a bit of an expensive one). I also love the Bircher Museli bowl, basically fancy overnight oats, but at $8 it's a bit of a splurge. Pro tip: They have Doughnut Plant doughnuts in their pastries case. Usually tres leches, blueberry, and carrot cake. \n\nIf you come here regularly, download their app. You can connect a card and pay by flashing a QR code at the register (heads up: they're cards only, no cash). For every $50 you spend, you earn $5.", "author": "Taylor C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Their coffee is one of the best I have ever had - flavorful, rich, satisfying and not bitter - one of the most satisfying cups of coffee :) \nThe avocado toast with a side of smoked salmon was delicious- freshly made with just the right amount of seasoning. \nTheir cold pressed juices are also pretty amazing - the beet and spinach, ginger celery are both delicious. \nI've visited their locations in DC and NY and I have to say they maintain their standards across the board and treat their customers with incredible respect and value. It makes you want to return and be loyal just for that reason.", "author": "Amy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-01", "description": "I'm really torn because the coffee is pretty decent compared to what's around the area but the service overall is pretty up and down. When I ordered only one hot cup of coffee the guy who took my order just stood around and started talking to other employees. Took me fifteen minutes to get my one cup of coffee even when I was the only person there...lol Get it together man.", "author": "Jessica W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-16", "description": "Went to bluestone lane after an amazing experience there 2 years ago in Greenwich Village.\n\nAs a tourist, I still wanted something not too crowded \u0026 on my way to see the rest of DUMBO.\n\nThat being said, I enter the place, it said wait to be seated, the waiter told me wherever i wanted, i sat down, and waited.... and waited.... and waited, the waitress \u0026 waiters passed by me 4 or 5 times until one of them aknowledged my presence in their restaurant. \n\nSo finally, I ordered the same thing, to find the same tastes I liked the first time. \n\nThe waitress didnt even come \u0026 serve in front of me, she passed the plate from behind me, to my table, not one, but 3 times.\n\nSo now that Bluestone Lane has plenty of addresses in New York, is there one of their place where I can have a good service? Or should I simply stop going there?", "author": "Eve L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Super friendly service plus they offered free cakes! They surprised me positively! Definitely will be back!", "author": "Nikola A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "This is my secret hangout spot whenever I'm hanging out DUMBO. They are known for their flat whites and it never disappoints. They even have oat milk! Great vibes and the most friendly staff!", "author": "Lawrence L."}], "servesCuisine": "Gluten-Free", "priceRange": "$11-30", "name": "Bluestone Lane", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/xZ_JE8vg052rCtm_EErp1Q/ls.jpg", "@type": "Restaurant", "telephone": "+17183746858"}