{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-08", "description": "I'm not really an avid coffee drinker but me and my friend just happened to need some caffeine while walking on the way to the flea market. \n\nPlace: the place was actually nice. If we had more time we could have stayed to chill.\n\nService: they were pretty friendly. The guy who served us helped us with the menu\n\nFood: we bith had cold brew. It was pretty strong which was great because it was what we were looking for. \n\nPrice: Kind of like Starbucks", "author": "Victoria O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-29", "description": "Ordered ricotta \u0026 berry toast + Avocado toast with poached egg + drip coffee = $27.00. Both toast came out with a thick cut of multi grain bread. \n\nBoth bread toasts were warmed and not crispy. \n\nThe berry toast has so little ricotta and covered with berry flavor, nothing to rave about.\n\nThe Avocado mash is just avocado, no other flavor in addition and the poached egg is well done solid.\n\nOnly the coffee serves hot!", "author": "Felix M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-28", "description": "First time at any of the Bluestone Lane cafes. Walking in, I was already super in love with the layout \u0026 aesthetics of the place. Everything was a bit pricey. \n\nI take my coffee and drinks on the sweeter side so I decided to get a small hot chocolate. It was more bitter than I expected and a lot smaller than I expected, definitely not worth the price. \n\nWhen you order in, you'll get a number \u0026 food will be brought right to your table! \n\nWe got the B\u0026E roll without tomatoes and the avocado toast with a poached egg. My egg was a bit over cooked so the egg was not as runny as expected, and there was a bit too much lemon/lime squeezed on top so I had to scrap off and/or mix the avocado spread. Nothing too special so again I thought it was a bit overpriced. Took maybe 5 minutes for the drink and 10-15 for the food (we ordered in). \n\nTips: bathroom is located in the back behind the flamingo wall, no cash just card accepted, sizes of the drinks are on the side of the bar facing the tables, and once it gets busy the tables can seem very close to each other. \n\nOverall: great service, cute aesthetics, pricer items on the menu, and more on the bitter side of things.", "author": "Allison T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-19", "description": "Pros: loved the chai latte! And I loved the vibe here. Also, it's outlet heaven here!! Aka you can actually be productive here. :)\n\nCons: only one unisex toilet, if there's a line and you really gotta go. Good luck!!", "author": "Catherine N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "Stop by here for a quick brunch on a Saturday. It was a little crowded but we were able to find a seat easily. The place is quite spacious. You have to order at the counter and get a number to put on your table. I love the concept of this cafe and love the different types of toasts they serve. \nWe ordered the salmon with cream cheese and dill toasts and the fig Jam toast. Both were delicious and were quite pricey for toast (about $10-15). It's hard to justify paying so much for toast. I do like the minimalist and blue decor. The cafe gets a lot of light too so it's very bright! I would stop by again if I am in the area and need a pick me up.", "author": "Siyun Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "Early breakfast spot for our foray to Brooklyn to get our touristy pics. Excellent service from Matt and the rest of the staff. We enjoyed our salmon toast and breakfast bowl along with some great coffee based pick me ups. Very happy with this choice.", "author": "John H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "They have a whole section of gluten-free pastries (banana bread, cinnamon banana bread, chocolate brownies), one of the reasons I fell in love with this place. My favorite was the banana bread! Staff is amazingly friendly and the place is super cute. If you subscribe to their mailing list you get $5 off.", "author": "Juliana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "Good cup of black coffee and vegan(?) banana bread.\nSat by the window; good spot to kill time and people watch.", "author": "Hana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-13", "description": "I've been here a few times for a latte when I am in the area and just recently tried their banana almond butter toast (I asked for no honey). The toast was pretty good and not overly priced, but the bread was really hard to eat, a little stale or over toasted. \n\nI would stop in again to get a drink but don't think I'm a fan of their food.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "So I came here because my friend and I had time to spare while waiting for our boxing class to start. We were hungry and wanted a chill place to eat and grab coffee as a pre-workout meal and found this place while walking to the boxing class (right next door to shadowbox). The interior is really cute and if you download the Bluestone Lane app, you get a $5 credit that you can use (definitely worth it to download it). \n\nThe menu has a variety of different food items as well as drink items. Although it may be a bit pricey for my taste, I was VERY pleased with my food. I got the ricotta and berry fruit toast. It was only one piece of toast but the flavors were absolutely delicious and I kept wanting more haha. But without the $5 it's on the upwards of almost $9 which was a bit...crazy for a piece of toast LOL\n\nAnyways, despite the price, I genuinely loved everything about this place. Definitely recommend if you're in the area and are in need for a little treat!", "author": "Sue S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-14", "description": "I'm always on the lookout for good avocado toast and coffee and find that Bluestone Lane does both well. It's a chain and known for their Australian coffee and while I've liked their other locations, the Dumbo one stands out more for some reason. That's not easy considering how many hip coffee spots are in this neighborhood. Bluestone has a chill inviting vibe and ample space and yes the good avocado toast, served on a thick slice of bread with oil and a healthy portion of smashed avocado (additional toppings optional).", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-08", "description": "The dirty chai only available for dine is what I dream about! Very clean and nice environment. My friends all enjoyed their coffee and tea as well. A couple in our group was from Australia and were excited to see some authentic menu items from back home.\n\nWe did not eat here, so I cannot comment on their offerings. \n\nGreat spot to warm up after walking the Brooklyn Bridge (NYC to Brooklyn)\n\nDisclaimer: I went to another location in Soho and was greeted with: We are out of ice! They also did not have the loose leaf chai. So, the review is applicable to the Prospect location only.", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Having spent the fall studying abroad in Sydney, I was delighted to find a little piece of Australia in NYC at Bluestone Lane.\n\nThe Brooklyn location is absolutely beautiful and very spacious. There are both outlets and wifi for doing work. The wifi unfortunately wasn't working too well when I went, but that might have just been a one time thing.\n\nThe drinks are Aussie-style down to the \"iced\" lattes having actual ice cream in them! I got the iced chai which was perfectly refreshing and my boyfriend got the Aussie iced chocolate which he enjoyed thoroughly as well.\n\nWill definitely be back to try more of the drinks on the menu and hopefully I'll be able to do work there too next time!", "author": "April C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Found NYC coffee to be rather lacking compared to Boston and other cities. But this was a wonderfully balanced and delicious cup. Also snagged a sweet banana bread and ricotta cheese breakfast. A bit pricey but alas you're in DUMBO. Terrific vibe and delightful staff.", "author": "Rob O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "I work in the neighborhood and visit at least once a day for my caffeine fix! To be fair, even if I didn't work nearby I'd still visit - the team is fantastic, and always has a happy, positive vibe which I love. I moved to New York from Melbourne so am used to amazing and reliable coffee and Bluestone always delivers - nom nom. Plus being able to pay through the app makes things really easy. High five, team Bluestone Lane!", "author": "Melanie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "I love the design of the cafè itself. The menú is pretty basic with many healthy options for breakfast, lunch/brunch. I got the avocado toast (8$) to which I added some feta, cherry tomatoes and a poached egg and a breakfast bowl with avocado, egg, feta, cherry tomatoes, quinoa and kale ( I'm not a fan of kale, but i have to admit that was pretty good in this bowl).\nPaid a total of 30$, not the cheapest, but it's good if you want to stick to your healthy plans.", "author": "Carola B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-31", "description": "Avocado smash is delicious! We got 2 along with a chai latte and a mocha. \n\nThe con is it's fairly expensive (not a great value) and the place is filled with hipsters (employees and customers alike). Not the cool kind. The kind that puts on airs and pretentiously carry on like they are winning in life but in reality the parents are paying their rent, phone, and insurance.", "author": "Lillian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "OMG for real, this place knocked my socks off! Put this in my list as a must try while I was in NYC for 48 hours and holy cow it did not disappoint! The coffee was on point and the gluten free salmon toast was RIDICULOUS! Truly, the most delicious gluten free toast I've ever had!  can't wait to go back!", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-02", "description": "A-ok! The place was nice and bright and welcome respite on a rainy day. The service was excellent as we received cheery smiles from helpful staff.\n\nBut don't go for brunch here as there's not much of a selection. The food was good but rather pricey. I got an avocado toast by itself and maybe I should have asked for poached egg or bacon or something to go with it coz I almost choked on it towards the end as I couldn't swallow the last bite. It was pretty overwhelming after if it's plain. I mean it wasn't bad and it had a spicey kick that I liked, but I think my husband makes better avocado toast so I don't know if it was worth it. \n\nI had a Bloody Mary to to go with it and it wasn't the best, felt kinda watered down but I guess it works. If I happen to be back it will be for a coffee and for a light snack.\n\nOther pros apart from staff and service are it's close to brooklyn bridge, the water, york station", "author": "Trina V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "A great little coffee shop in Dumbo! We wanted to grab a coffee before we walked across the Brooklyn Bridge, and Yelp pointed us in the direction of Bluestone Lane. Great coffee in a big, spacious location a block away from the entrance to the Bridge.", "author": "Alexis B."}], "servesCuisine": "Gluten-Free", "priceRange": "$11-30", "name": "Bluestone Lane", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/xZ_JE8vg052rCtm_EErp1Q/ls.jpg", "@type": "Restaurant", "telephone": "+17183746858"}