{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-13", "description": "Went here just to try the beet latte. I know I'm probably late to the party but I just heard about this \"pink drink\" few days ago and thru research found out this place makes it so I went. Not used to Dumbo so it took a while to find it but I did. Staff was friendly. Mind you I was there probably around an hour before they close on a weekday so there was no rush.   Lovely chill atmosphere. Decided to try it iced and... It was OK. Definitely tasted the beet and almond milk brought out a buttery flavor. Thinking about ordering it hot and see if there's a difference in taste. Though I felt healthy I was tempted to get something sweet to balance the taste. Lol. Don't know why but I'm also tempted to try the golden latte, though given the main ingredients (turmeric and other spices), I feel I may be disappointed but who knows? Only thing I was surprised by was that they don't accept cash. Could just be me but this is the first establishment I've heard of that doesn't accept cash. Weird. Overall not a bad experience.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "Looking for a casual, cawfee spot to park my behind and read for a spell I found Bluestone Lane- (Thanks Yelp!). After perusing through a few reviews, I noticed the most photographed and recommended item on the menu was the 'Avocado Smash'. I thought 'YAS! My kind of place' bc well, avocado. \n     The pictures pretty much speak for themselves so I won't bore you with mine. However, I will speak on the service- it was really good! I arrived around 2 PM and despite being packed (I had no trouble finding seating) there were only 3 patrons ahead of me and my avocado smash was brought to my table about 8mins after ordering. It was so good! Presentation, serving size, and taste. No wonder it's the most ordered dish. \n     I got caught up in my reading and stayed longer than expected. Noticeable was the staff's attentiveness to keeping the place clean- recently vacated tables were almost instantly readied for the next customer, the floor regularly swept. The music was BUMPING if you like R\u0026B and a little trap (not my thing, but whatever) music. I heard a little Drake, MJB, Alicia Keys and Chaka Demus \u0026 Pliers' 'Murder She Wrote' *bogles*. I stayed here long enough to use the restroom; clean and well stocked with the necessaries. \n     Bluestone Lane- go there!", "author": "Candice K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Great coffee. I would go to say that this is one of the best coffee chains in NYC. So much better than Starbucks!\nService - A\nFood - A\nCoffee - A+\nAtmosphere - A", "author": "Isabela C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Love pretty much everything about this place. Great coffee and food (love their \"magic\" coffee), a beautiful space, and the staff is always welcoming and social. Though it's Dumbo, there's also always a place to sit and it's definitely a welcome bright spot in a neighborhood that doesn't have a lot of options. I'd love this Bluestone Lane no matter where it was located, but if you find yourself hungry or needing caffeine while in Dumbo, don't waste any more time searching for where to go, just come here.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-28", "description": "This place is overpriced, but it's one of the only places in dumbo open during breakfast hours. I walked across the Brooklyn Bridge early to avoid the crowd and was hoping to enjoy a nice breakfast at the end. There's not a lot of selection and I ordered the bacon and egg roll. It's really bland and poor choice of ciabatta bread which made everything dry. $12 disappointing sandwich and $9 special juice later, I should have just walked back across the bridge for something better. Also this place is cashless and I had to tip in front of the waiter on an iPad - awkward. Inside looks cute though.", "author": "Diana T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Easily the best coffee shop experience I've ever had. Great food and coffee. Yes it's pricey, but it's definitely worth the price.", "author": "Colby H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "Nobody is perfect but it's always pretty sad when you get a barista or bartender with an attitude problem for no apparent reason.  Beverages are important but you're not saving the world.  One star for the semi decent coffee and the somewhat curated atmosphere.  If you're looking for truly good service and the best coffee in Dumbo, walk a few blocks down to Burrow where you can get a cup without a huffy egotistical barista on the side.", "author": "Eli E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "Great find during my stay in Brooklyn. Worth the 7 min walk from the hotel. Great cold brew, delicious and had me buzzing all night. Go slow if you are sensitive to caffeine this one is strong!", "author": "Red D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "The atmosphere is relaxing and so welcoming. I love their loose leaf chai tea. It's so smooth and comforting and fun to pour yourself. I would highly recommend this place for a coffee date or a place to go to relax and have a good cup of coffee!", "author": "Gayle T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-27", "description": "They seem to have perfected the art of selling you something simple (toast smeared with mashed sweet potato for $8 or a small simple spinach salad for $14) and making you think you had a good meal because it was trendy. Definitely not worth it. However, the food did taste good and servers were generally pleasant.", "author": "Matt P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-23", "description": "Solid food. Good coffee. Pretty big prices. I got a single slab of avocado toast and a plain (not cold brew) iced coffee for $21. That's a big bill for a half-breakfast. I understand the price of avo's is up right now, but after I paid $14.53 for my avocado toast (with tax) I looked at the prices up and down the menu. This place is a little gouge-y. Their coffee drinks are regularly a little higher than anywhere else by a buck or two, and their food is definitely priced at a super premium. The DUMBO tariff.  Anyway, the food is not bad. They will probably make a killing in Dumbo, where everything is a tad costier, but I won't be going back.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "After our wedding we took photos on the Brooklyn Bridge, but came into this coffee shop to warm up!! The service was absolutely amazing and the food was even better! Would highly recommend", "author": "Ruben M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "What a delight to head to the DUMBO location and find Bonnie from my usual Upper East Side location. \nAlthough the menu is a little disappointing with not as much choice as other location, the food as usual was excellent (try the pea smash for a change from avo, it was delicious).  I would make the trek to DUMBO not only for a little more of a quiet spot but for the outstanding and friendly service from Bonnie. A team member that should be recognized for her faultless service!", "author": "Tania F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Walter was amazing! Super knowledgeable and even gave us a demo on how to make a great latte and foam design! Made our visit even better. 2 thumbs up for Walter!", "author": "Katherine V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-02", "description": "Really want to like this place. I do. The coffee is good, and I can't speak for the food. My main gripe is that the music is just way too loud, to the point that it dampened the experience for me.", "author": "Francis Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-05", "description": "Nice space and friendly staff. I wanted to love it because everything on the menu looked good. The coffee was great but the breakfast bowl was a real mixed bag. It was your basic quinoa/kale/poached egg bowl. The problem was that the \"heirloom cherry tomatoes\" were very, very cold. And even the poached egg was somehow cool. The feta had also been just taken out of the fridge. If the tomatoes and feta had been at room temperature the whole thing would have been great but the super cold tomatoes wrecked it.", "author": "Dee B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-01", "description": "I had to remind the server 2x about my coffee that never arrived. After I finished my avocado toast, finally got my brew without an apology.", "author": "amy g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Beautiful inside, and the \"magic\" was recommended to me by the manager (i think). I added a bit of sugar, and it was divine! We were visiting from California, and it was pretty cold outside, so this place was a nice haven. Their restrooms were clean, and they had a copy of Artemis Fowl inside, on the ledge (SO CUTE). They also had a water bar available for customers (thoughtful touch). The barista was handsome and polite. Overall, I wish we could visit again!", "author": "Gray T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-19", "description": "This is a cute spot, but like another reviewer pointed out: this is a place to Instagram your brunch. The tea was okay-- I could buy the same experience at Wal-Mart-- but the toast was pretty good. We tried the banana with almond butter and the avocado smash. I don't know if I'd pay $8 for either of them again, but it was nice to experience once. The wait staff, however, was lacking; they're young and seemed to prefer staying behind the coffee counter compared to getting out to serve tables. Overall a good experience, but I would probably head somewhere else for my next Brooklyn brunch.", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "I like Bluestone- it reminds me of Sydney coffee shops. Good food menu and good drink menu. I'll definitely come back for the coffee and vibe (decor is great) and there's nothing like it in DUMBO - only problem is, they have a liquor license and promise a pretty cool coffee-inspired drink list but when I went to imbibe they could barely make anything on the menu.  It's a great concept but be a little more prepared!", "author": "Kimberly G."}], "servesCuisine": "Gluten-Free", "priceRange": "$11-30", "name": "Bluestone Lane", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/xZ_JE8vg052rCtm_EErp1Q/ls.jpg", "@type": "Restaurant", "telephone": "+17183746858"}