{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Great coffee and service. I had the market bowl with an egg. Definitely pricey for what you get but you won't be disappointed in your choice. \nI also got the magic (coffee) which is like a cortado. In addition, I got some single-origin Nicaraguan coffee to take home.", "author": "Christine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Walked across the Brooklyn bridge while on vacation to enjoy\nBeautiful breakfast here. Avocado toast, perfect Flat White and Gluten Free Zucchini bread. Cool space, great service and delicious food. Highly recommend.", "author": "Karen J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "friendly staff and such good food! I got the avocado toast with a poached egg. The egg was perfect and I love the chili flakes on top of the avocado! By far my fav avo toast that I've had", "author": "Ella M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-04", "description": "I may be being harsh as an Australian reviewing an Australian cafe in Brooklyn, but I wasn't impressed.\nThe food came out before our coffee, which tasted burnt.\nThe granola was way too sweet, and the brekky roll was on a bun that was way too soft (brekky rolls really should be toasted and firm). The tomato chutney was delicious though.\nIt was good to get some vegemite on toast but. \n\nNot horrible, but definitely room for improvement.", "author": "Samuel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "I can't say enough great things about this place! The food and drinks are delish and the service is even better! The vibe is great too, a perfect place to enjoy good food \u0026 good people. The manager Sharni is absolutely above and beyond and manages the shop and team with incredible grace and leadership. Every part of our experience was enjoyable. We were greeted with friendly faces, and ordered from people who were happy to answer our questions. The fact that they offer gluten free options is AMAZING \u0026 not only that but actually DELICIOUS!! I came to visit my sister and my friend and I came back multiple times because we loved it that much. I will be back every time I'm in town. I ordered the loose leaf chai lattes and loved the way it was presented. The gluten free spreads are so flavorful and I definitely recommend the avocado smash. My friend ordered the breakfast bowl and it was yummy! Everything is so fresh and delish! Even though the ambiance and food is awesome- its the team that made our experience so great!! Go- you will be so happy!", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-25", "description": "Good location and space, but it's the worst service I've had in dumbo. Came in just for toast sandwich, the staff took the order with moody and cold face. I asked if my order was ready to pick up, another cold staff just responded 'I'm not sure'. Obviously staffs need to be trained to be more friendly. \n\nThe bread of avocado toast isn't crispy and doesn't taste very fresh, it's very dry around the edges. \n\nDo yourself a favor, walk a few more blocks to almandine or burrow.", "author": "Rayu H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-16", "description": "As a restaurant/brunch spot, I'd give it three stars. Food was good but isn't exactly worth the price. I think the pull is that their breakfast options are healthier than what you'd get at most brunch places. \n\nAs a coffee shop, this place is great. Four, maybe five stars. Tea and iced chocolate were good. Atmosphere is really nice. It's a good place to read or do work. I did spot an outlet or two if you need to bring your laptop.", "author": "Mellissa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-13", "description": "Well, we crossed the Brooklyn Bridge to get here...nice walk, but the food experience at Bluestone Lane did not live up to expectations.\n\nWe had the granola and the smashed avocado. The food was not bad, but did just not stand out compared to e.g. Banter in NoHo.\n\nAbove said, coffee was great!", "author": "Philip R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Loved this place.\nIt has a perfect mixture of simplicity and just enough detail that gives them their own character! \nGot the avocado toast which was absolutely amazing. Their macchiato was really good too.\nThe staff was friendly and nice. Definitely going back. This just became one of my favorite places!!", "author": "Mohamed L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-15", "description": "Not the best Bluestone Lane location. \n\nI ordered the avocado smash ($8) with feta cheese ($1.5), cherry tomatoes ($1.5), and a poached egg ($3). An extra $3 for tomatoes and cheese? What kind of madness is this? Really not a fan of these Bluestone Lane Collective locations that tack on all the costs of these skimp add-ons. \n\nThe toast plus a latte set me back $20+. The avocado and tomatoes were fresh, but really nothing special. The bread tasted a bit stale. Also, the toast arrived way before the drink; I finished it before I got my coffee. \n\nOverall, overpriced and not worth your time. You'd be better off at other Bluestone Lane locations (West Village is great), or other Brooklyn brunch places in general.", "author": "Phoebe W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "I recently read in the New York Times that Australian cafes are starting to become more popular in NYC. Lo and behold, on a hot afternoon in Brooklyn, I stumble upon an Australian cafe. \n\nThe baristas, after extensive questioning from me, clearly knew their coffee and product, and were willing to have a discussion about their milk alternatives (go Oatly!, or any oat milk), their coffee, sourcing, and brewing. I drank their cold brew, and the wonderful notes of almond and caramel came through, a tricky business when brewing cold.\n\nBravo to the owners and to the hard-working staff, this is a must visit!", "author": "Elijah R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-04", "description": "Overhyped but it has good coffee.  \n\nThe good: \nCoffee options.  They have a unique gimmick where they serve the coffee deconstructed and you mix milk coffee yourself.  Looks fun.  I just had a latte and it was decent.\n\nThe bad: \nLatte was small, over crowded, and avocado toast was thin with barely any avocado.  I paid extra for tomato and poached eggs. The tomato it was like an after thought.  It was not worth it. \n\nI'd come back for coffee but it won't be my first choice.", "author": "Ahmed M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "Sometime, office coffee just won't cut it, and you need something stronger. Bluestone Lane has a hell of a strong cold brew which fit my needs. They have all your standard non-dairy milks and simple syrup. Staff is friendly. Menu is pretty extensive. Prices are pretty good, but don't include tax. You can also download their app for their loyalty program that gives you $5 for your first drink!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "I work in the building where this coffee shop is located, so visit frequently. The coffee is delicious. Usually I am in a hurry to get in and out, and the other morning as I was waiting, the barista making my latte started chatting me up. Normally I am not a great fan of small talk with strangers, but there was something disarming about the authentic interest he showed in passing the time we had together by making a simply yet genuine connection. I always find the staff here friendly and helpful, but this small act of openness really popped my New Yorker bubble briefly and made my day. Of course I didn't ask his name; next time!", "author": "Brenna R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "I love Bluestone Lane. I am not one to go to the same place twice when on vacation, but I ended up going here twice because the coffee was amazing. My partner and I were staying close to this location during a recent trip to NY. It was super convenient to be able to walk to this spot.\n\nThe service was friendly and the barista had some legit skills. I ordered an almond milk cappuccino and it was foamed to perfection with a darling little design. For food, I went for the avocado toast and added goat cheese. The bread was thick and yummy and the avocado was piled high. It was certainly satisfying. My partner had the breakfast bowl and was all about it. It was a mix of quinoa, kale, feta, avocado slice, heirloom baby tomatoes, and an egg. I ended up ordering this on trip #2 and still prefer the avocado toast. For me, the breakfast bowl wasn't all that, but I did leave the egg off so take that for what it's worth.\n\nThe decor of Bluestone Lane is clean and open. It reminded me of South Beach a little, but that could have just been the flamingo wall paper. There was ample seating both times we visited. They do not have table service but your food is brought out to you after you order at the register. \n\nWe ended up checking out quite a few coffee shops during our trip and Bluestone definitely had the best. There is a roaster right down the street so it doesn't get any fresher. They also sell their beans in the store.  Love this place!", "author": "Lindsey E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Coffees here are consistently great, at all their locations. I think the food menu at this bluestone might be a reduced one but (not 100pc on that) but it still has some very tasty brunch options with some pretty good value for money add-ons (bacon, feta, eggs etc...) if u need a little more protein on your avo and toast. \n\nGreat place just to whittle away a few hours working, reading the paper or just hanging out. \n\nIt's also very baby friendly.", "author": "Tommaso S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "Sure the space is nice, but wow it was expensive for what was served (see the photo). Food and drink were good, but not good enough to pay their price tags. They should either bump up what they serve or bring prices down. Unlikely I'm going back.", "author": "Gutten K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "Food: a little on the pricey end for what you're getting, but the bacon and egg roll is really delicious \n\nDrinks: cannot rave enough about the Aussie drinks (I've had both the latte and ice chocolate) \n\nInterior: The space is really nice, lots of light and open tables. There are cushions for the bench seats!\n\nMy only complaint was the AC was blowing right at me and I was freezing cold the entire time. Wanted to leave because of that. \n\nAlso, in order to connect to the wifi, I was asked way too many personal and unnecessary information! Name, email address, dob, zip code, phone number why???", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "The GF didn't like the fact that they don't have flavored Lattes but other than that this place excels.  There is genuine artwork put into the drinks and the pastrys are all fresh.   The coffee and tea selection is on point.  What distinguishes it from alot of other places in the area is the decor is warm and inviting and it is a large area (so you can get settled and not feel too crowded in the Brooklyn hustle and bustle).  I highly recommend you check it out.", "author": "Elliot R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-15", "description": "Spacious and less crowded space compared to everything else around Dumbo. \n\nI have been to different Bluestone Lane locations in the city but this location was rather disappointing. Ordered matcha latte and it was below average... matcha wasn't blended well enough and didn't have much of a flavor :(", "author": "S P."}], "servesCuisine": "Gluten-Free", "priceRange": "$11-30", "name": "Bluestone Lane", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/xZ_JE8vg052rCtm_EErp1Q/ls.jpg", "@type": "Restaurant", "telephone": "+17183746858"}