{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "Loved my banana toast! Got an almond milk latte as well- the ordering system has its flaws, i.e. They still called my name for my latte when I had a number on my table then they ended up taking the number without bringing my food. Otherwise I really enjoyed it! Super cute space and right across from Etsy HQ, and not a far walk from the subway!", "author": "Rebecca C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Such a great vibe, seating, yummy treats and beautiful coffee displays (avocado toast is the best)!!!", "author": "Allie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "So this place just resonantly opened up in Brooklyn.  My sister tried this place first and loves it and got me hocked too. It's a great fun space. \nI have only tried the avocado toast with feta and cherry tomatoes and it's so addictively good. They have a chocolate and coconut covered white fluffy cake with strawberry jam in the middle which is heavenly.  \nThe Bluestone does beautiful latte art even in the hot chocolate.", "author": "Gabby G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "The staff here is on point. Vibrant and friendly. You know why else was on point? #datmuffin Coffee is rich and velvety and the avocado toast is sexy but simple. Like, the girl next door of toast. Definitely will be back", "author": "Michael B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-05", "description": "I came here right around the Saturday lunch rush hour. The cafe itself is huge and bright, and I loved the decor. There was a constant stream of people, but in the two hours I sat there (yes I was a camper) there were always a few tables open at any given time.\n\nThe food itself was probably 3 stars. I got the avocado smash and a golden latte. The bread they used for the avocado smash was really good--thick and chewy and satisfying. The avocado on top though was a little too sour and mushy for my personal taste. I also decided to venture outside of my comfort zone with the golden latte, which I discovered was actually a tumeric latte. I couldn't quite get used to the tumeric, but the presentation was beautiful and I imagine the latte itself was well-made.\n\nBluestone Lane's service system is bizarre--I assumed it was some sort of organized chaos, but I think it was more just chaos. If you're ordering for here, they give you a cube with a number on it and bring you your food, then take the cube away. When the guy gave me my toast though, he forgot my latte and realized his mistake ~20 minutes later. He gave me a free croissant and honestly seemed a little overwhelmed and very apologetic, so I didn't mind, but heads up--keep your cube if you're still waiting on stuff, even if they take it away.\n\nI realize this place is famous for its coffee (which I didn't get), so the 3 stars may not be entirely justified for its star product, but for the prices ($8 for the avocado smash and $4+ for the very small golden latte) it was satisfying but not incredible.", "author": "Ziqin Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-15", "description": "food was so little and expensive. I had avocado toast with eggs and prosciutto which, the prosciutto, was $4 for literally 2 slices of meat. eggs came cold and the avocado mash was literally out of a box m. thats sad.", "author": "Lavinia I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "The latest location of this Australian coffee house.  Someone was passing out flyers for their 2-for-1 cold brew coffee at the York St subway, and I stopped by since I know how seriously Aussies take their coffee.  They didn't disappoint.\n\nIn addition to their cold brew deal, I also got a banana waffle.  The portion was a bit small, but the plating was noticeably nice for a takeaway order- they even garnished the bowl with flower pedals.  The flavor of the cold brew was refreshing without being too strong or bold.\n\nThe vibe of the café was nice too.  Big windows, lots of natural light, plenty of table seating, and friendly Aussie service.  The only reason I didn't give them 5 stars was the total was a bit pricey- I neglected to save my receipt but I paid $25.06 including a $2 tip for the 2-for-1 coldbrew deal and the banana waffle.\n\nAll in all, a great place to post up with your laptop for a few hours.  Welcome to the neighborhood, Bluestone.  Glad to have an alternative to Starbucks and BRC for my morning pick-me-up.", "author": "Richie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "I only use yelp for a quick search or tips on what I should order. I find most reviews to be hilarious and hollow. That being said, this place deserves a review, a gold star and all of your money.\n\nWalked in last weekend mid afternoon in need of food and it didn't disappoint! Grabbed a table  and asked my server, Bonnie what is easy and delicious. I guess she could tell I was getting hangry and suggested I get the avocado smash with salmon and a bacon egg and avo roll. It was just what I needed. Delicious and filling. Service was exceptional. I would be back.\n\nCame back on Tuesday and learned I now have to order from the counter? I guess they are having some changes internally but it didn't change the service. Ordered a red-eye, ate a pastry and relaxed. Not very often you find a cafe where you can chill without being surrounded by MAC books. A+!", "author": "Kyle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "I have been meaning to write a review for this location for quite some time and have not gotten around to it. After the West 31st Street location this one is my favorite BL. The cappuccinos are done correctly and never feel like a latte (I'm looking at you Starbucks!), the pastries are always fresh and tasty and the avo toast are def some of the best in NYC. The staff is always courteous and super friendly which is most definitely a plus and something that can make or break your dining (or in my case brunching) experience. Beautiful location, amazing staff plus amazing food and coffee? YES PLEASE!", "author": "Denise P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-08", "description": "Absurdly overpriced. I occasionally got the avocado toast for a ridiculous $8 (just a piece of bread with smashed avocado). Now they \"changed the menu\" and the toast is $13. Apparently they added feta cheese and tomatoes. For 60% more in price. And the plain toast is no longer an option. \n\nAs another proof point that they don't even care: one of the two doors here is always locked, but it's the one with the \"pull\" sticker on it. So naturally everyone pulls that one, just to tug and tug and realize it's locked. Absurd. I've seen this happen dozens of times. Either unlock both or place the pull sticker on the one that you can actually pull.", "author": "Andy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "My favorite is the Honey Comb Espresso.\nAlso, the breakfast bowl is a must.\n\nThe staff is always accommodating and willing to go out of the way for the customer.\nIf you are looking to get some personal work taken care of on your computer, it is the perfect spot. The vibe is not loud nor overwhelming. \n\nThe projector screen they use adds a nice touch.", "author": "Julian D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Tons of Vegan, Vegetarian, and Gluten Free options on the menu. The only vegan option in the pastry case was nut balls. The espresso was pretty decent and the decor was appropriately hip and cute. Mostly a toast-based menu, which was fine by us!", "author": "Nathan A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-21", "description": "The coffee is fantastic and the folks on the counter are friendly and helpful, but the food service is a different story entirely.  My wife and I tried brunch there at the weekend and were told absolutely no substitutions were possible to the menu items - no way, no how - so no way to get the breakfast bowl without a poached egg.  Very unfriendly too - I could understand if there was a polite explanation that all the food comes pre-packaged, with no food preparation capability on site, but we were told instead that the chef simply wasn't willing to accommodate us.  We'll stick to coffee in future.", "author": "Oliver B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "Stopped in for brunch after ImaxShift cycling up the street! Limited menu vs the Manhattan location but it did the job for the time being.\n\nFriendly staff and laid back, super cute atmosphere, great cafe to grab a quick bite to eat. \n\nI had the rainbow bowl - it was only ok- very basic and something you could easily make at home quick but looked nice! \n\nMy boyfriend had the avocado toast- it was amazing! The bread was similar to Sullivan street bakery whole wheat loaf - tons of flavor !", "author": "Janel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "Solid, spacious DUMBO Bluestone with a pretty bad matcha chocolate chip cookie but a solid chocolate chip cookie.\n\nTransaction Amount $5.74\nMatcha Choc Chip $2.75\nChocolate Chip $2.52\nOther* \n* tax or other one-off adjustments $0.47\nTotal Rewards -- $5.74\n$5 Birthday Gift -- $5.00\nGlobal Credit -- $0.74\nTotal Balance $0.00", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "My family and I stopped in for coffee and a quick bite yesterday morning. Food was very good, my mom loved the Breakfast Bowl, and we also had the Ricotta Berry Toast and Avocado Toast - also delicious. We all agreed the toast was amazing, so my mom asked Sharnie, the manager, what kind of bread they used and she explained the toast was actually gluten free. My sister has Celiacs so my mother was very excited to hear more about the toast. Sharnie was so lovely and gracious and actually came over to our table to explain that a member of her family also has celiacs, so she was more than happy to share her knowledge of gluten free products. Sharnie is a tremendous asset to Bluestone Lane Coffee and brought a level of compassion and professionalism that you don't see everyday. We can't wait to go back!", "author": "Laura H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-06", "description": "I ordered a latte and two coffees to stay along a beer, not only is the coffee burnt and sour, the mugs and cups they gave us were filthy. It was all cloudy and black bits all in the cups. The shop is has very cute decor and roomy, tons of seats and two blocks from where I live but the coffee just didn't do it for me. And this place is way overpriced, my total came out to $20+?!?? Nahh", "author": "Kaori S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Great spot! Delicious coffee and I love that they have non-coffee drinks like matcha lattes for times when I don't need the caffeine. Great healthy food for a reasonable price as well (like the avocado smash toast!)", "author": "Beth B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "This place is right across the street from my work. The avocado smash and Americano are the bombbbbb (yes, I still say \"the bomb\" - still old school).", "author": "Benish P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "One early Saturday morning I dragged my husband through a 40 min train ride from our apartment in Midtown to get breakfast here :) I do love Dumbo and how quaint it is by the water (It's even better when 100+ tourists aren't flocking here all at once) \n\nCoffee: I got the Matcha Latte and he just got black coffee. \n\nFood: Avocado Toast with Prosciutto for me and some sort-of egg and bacon sandwich for him. If you ever seen my other reviews for brunch, I usually can't decide what to eat and end up getting the avocado toast. Toast was a bit burnt, but still filling. \n\nFor me, Bluestone is not about the food, but the coffee. I never had a disgusting, overdone coffee at any of the Bluestone Lane cafes and this place is no different. \n\nThe place is pretty spacious, but please, hipsters living in Dumbo, refrain yourself from bringing your laptop and spending hours here", "author": "Alice K."}], "servesCuisine": "Gluten-Free", "priceRange": "$11-30", "name": "Bluestone Lane", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/xZ_JE8vg052rCtm_EErp1Q/ls.jpg", "@type": "Restaurant", "telephone": "+17183746858"}