{"aggregateRating": {"reviewCount": 58, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "Stumbled upon this lovely Sushi Chef, Taiki owned petit restaurant after an local event. Way later dinner time of 9:15pm than I wanted but tstk tstk aside it was my birthday! Besides two other tables, we were cordiality yet warmly entertained by both our lady server and Taiki himself! Visually minimalistic but full on texture, flavor, and perfect temperature. \n\nWe had the knockout 10-spice and lime crusted Edamame, Toro Tartare, Deep Fried Monkfish and chef special Sashimi Omakase + NegiToro and UniScallop rolls. Ok the Hokkaido Scallop wrapped in Nori was pure buttery bliss and Aji and ChuToro just were cut with a bit of bulk and tapering off to a fine stream of freshness. Chef continued with SalmonTobiko Toll and ended this culinary bed wetting goodness of,  of course, fluffiest almost pastry-like Tamago with a birthday candle (yes I turned one as in F21)\n\nThe Chef Owner was all convo and laid back since we were the last customers closing the place and disclosed his previous position at Bond Sushi which in my opinion had gone downhill from mass discount exposure. You can tell he's a chill and laid back and wanting to make not so much \"Sushi of Jiro Dreams\" journey but great food skills and appreciation a la Brooklyn vibes. \n\nThe music from Senegalese to Portuguese pop lent an audibly interesting landscape which we throughly enjoyed. \n\nWe will be back, Taiki!! K-dog in tow....", "author": "Jud Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "Can't believe I forgot to write a review.....we ate here after my Japanese neighbour raved about it and she was right !  Love the ambience - the white painted brick - the clean feeling - nice lighting with plants. Very modern and unpretentious. And the food was not typical sushi bar food. The chef/owner clearly has his own vision and creativity and also excellent quality.\nWe had the delicious edamame and the uni scallop roll was so good we ordered another.\nI had a beautiful cold sake and my husband had beer. Will definitely return.\nIt was very pleasant to sit at the counter and watch the chef", "author": "Kate P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Chef Taiki has such a charming character you will fall in love at once and not only his character, his sushi is his character itself..! The interior is unique yet not overly designed. Very simple and cozy. Not like one of those snobby restaurants you would not want to go back again atmosphere wise and price wise. I'm always excited to go to eat at Taiki. Best place to be in the neighborhood!!", "author": "Mika H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "I came here on a moderately busy night. It's a cozy spot, very sophisticated and inviting--great lighting. \n\nWe wer promptly seated by our bubbly server, Abilene. She was clear and attentive but not overbearing. \n\nThe Food was clean, well presented, and tasty! \n\nLooking for fly japanese with good service? Check out Taiki Fa'sho~", "author": "Stack D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Not suuuuch a high bar, unfortunately, but this is the best sushi place in Brooklyn. By a lot. My boyfriend and I have recently lost all sense of fiduciary responsibility/proportion and so tend toward the bonkers-$$$ omakase places in Manhattan...but when we're relaxing in our own borough, Taiki is a worthy substitute. The space is also lovely, dimly lit, and makes you feel like you're in the know for finding it in the first place.", "author": "Tracy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "South Brooklyn has developed a well deserved reputation  as a destination for high-quality restaurants of diverse cuisines. Taiki, which arrived in its Gowanus location two weeks ago, adds another sushi establishment to the select group of restaurants that define some the character of these communities.\nThe gold leaf restaurant name sobreposed on chalk serving the times, set the tradition-conscious but also adventurous tone of the sushi bar, right at its front door. Once inside, diners can choose to sit at one of the nicely spaced tables - no need for fighting for elbow space - or at the sushi bar, where they will witness Chef Taiki himself in action.\nThe sushi Omakase menu offered attractive prices ($50 for a 10-piece), for which Chef Taiki delivered a great selection. The sushis were traditional and in line with what you expect at high-end sushi places. Impeccable fish cut the right way, seasoned and served over a bed of warm rice.\nThe menu also offers an inventive selection of appetizers, twisting Japanese staples to include novel techniques or ingredients to bring out better flavors. Mussel shishito peppers, and the miso chowder (its thicker and heartier than traditional miso) were great surprises, full of flavor and fun.\nWe visited the restaurant the day after they received their liquor license, and the only two alcoholic beverages options were Aishi beer and one variety of sake, which turned out to be very good.\nThis is a very good restaurant that brings a new class o sushi dining to a neighborhood that hadn't seen it. The prices are inviting, and anyone should save to visit this place. It's an absolute delight for mind and soul.", "author": "Denis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "Nice sushi restaurant in Brooklyn. Interior is nice and clean too. I sat at a counter, and i loved it.  Friendly people and had fun time.", "author": "Atsuko Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Super yummy!  The edamame was best ever.  We sat and watched him work which a blast.   The toro was amazing and sushi was super fresh.  We are on to dessert but a neighborhood must have.   Mommy daughter date night was a success.  Thank you Taiki for a break from the ordinary.   Check it out!", "author": "Allyson K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-04", "description": "We really wanted to love this place but everything took way too long and most of the food was mediocre for the price. Made a reservation for 8:30, weren't seated until 9, and then we had to wait another half hour to put in our food order. Once we did put our order in, our appetizer (crab risotto) was very good and came out fairly quickly, but the rest of our sushi was less than amazing. \n\nThere was one poor woman hosting and waiting the entire front section, and one other waiter in the back section. The restaurant isn't huge, but it was obvious they didn't have the staff available to handle a weekend dinner rush. With only one sushi chef, it seemed like the kitchen was backed up as well. \n\nAll in all, we want to give this place a second chance, but did not have a great first experience.", "author": "Nicole R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "I just returned to Brooklyn after living in Tokyo for many years.  Was so happy to find Taiki... seriously delicious nigiri sushi. The counter is recommended... watching them at work makes the experience. Make sure you try the chutoro and Uni!", "author": "Chad P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-07", "description": "I wanted to love this place and was really looking forward to going. The main reason for the two stars on this - was that the service truly didn't match the price. This is quite sad, because the food truly was delicious.\n\nAtmosphere: A quiet walk through Boerum hill will lead you to this super cute, clean, whitewashed brick interior with fairy lights and greenery. The Chef greets you with a big hello and a smile. Our party of 3 was sat in the back - I think every table in this place is a nice one.\n\nService: We were greeted within a few minutes with some water and instructed to take a look at the drink menu. We ordered Sake and wine. When I asked about the profile of the Sake - I was told it was great. We ordered the corn and mushroom risotto for an appetizer -and then the server recommended the Edamame. Since we were hungry - it was a good idea. The edamame was delicious - the risotto, ok. We ordered our entrees at the same time,(2) 10 piece Sashimi Omakase and (1) 10 piece Sushi Omakase. I mentioned that I hated Makerel - and he said \"Well we are so busy tonight, we are running out of all of the fish - we will see what we can do\". Pretty crazy that you pay $50 for a tasting menu of the best - when you might just be being served the leftovers. The waiter pretty much disappeared after that - no water or drinks for a while. 90 minutes after our order - dying of starvation - the server let us know that it would be ready in 10 minutes. Clearly, we were forgotten about. \n\nThe food came, the server drilled over the types of fish - but not super sure about which was which. The Sushi came out as a 5 piece - and I asked if another plate would come - and he was like no this is it - oh wait - no it will come out later. Just strange.\n\nThe fish was buttery, delicious and well cut. We paid. $300 for 3 people - I have had better service at Gramercy Tavern -- or Applebees.", "author": "Jaclyn V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "One of the best Japanese restaurants I've been to in the city! Amazing service and food. Jonno was a terrific server. His appreciation of Taiki's  food and hospitality was superb. Definitely coming back again.", "author": "Ran T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-22", "description": "Omakase to me is when you sit in front of the sushi chef and they serve you piece after piece and dinner ends up being about an hour and half at a minimum because you're taking your time enjoying every piece, having some sake, and chatting with the chef or chatting amongst yourselves.  This was NOT the case at TAIKI.  Their version of OMAKASE is really just chefs special sushi.  It was not served piece after piece.  For $60, it was a glorified assembly line sushi deluxe order.  Definitely not the true omakase experience that you get at places like CAGEN or ONODERA.  OK, maybe it's not fair to compare this place with the likes of CAGEN or ONODERA.  Fine.  I will compare it with the omakase at UOGASHI which is more in the price point of this place, but still I think that was 10 times a better omakase experience than this.   Fish quality was average here.  The toro had some tendons in there that were not handled properly.  There was a bit too much rice in the sushi.  Rice quality was a bit hard.  The ikura which was not part of the omakase turned out to be quite good and the only memorable piece for me.  It was marinated well with a hint of yuzu.  We had the tamago brulee with yuzu sorbet for dessert and it was good but I feel that there was a bit too much brown sugar torched.  The egg turned out a bit too wet for my liking.  The Chef was not very engaging or attentive.  We tried to get his attention to order extra sushi and had to really make an effort to do so,  The waitress was somewhat passive aggressive.  She popped up and interrupted our conversation several times.  ONE-DONE!", "author": "Sylvia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-22", "description": "We've been a couple times and are fans of this neighborhood spot. The sushi is excellent but don't sleep on the rest of the menu when you go! The Tofu Bomb is great, as is the Monkfish Karaage. Still pretty easy to score a table here last-minute.", "author": "James C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-09", "description": "Unfortunately in my opinion this place is not close to 5 stars.\n\nA few reasons why:\n\n1) Omakase experience is mediocre. It is not served piece by piece. The time difference between the first piece of sushi he made and the last was about 20-25 mins (he was making other orders too). I don't really want my raw fish sitting here for 20+ mins before I even get to start eating it. The 12 piece omakase for $60 also does not include uni and also there is no soup or handroll. There are places in Manhattan (and also bklyn) that offer more and piece by piece at this price point\n\n2) The quality of the pieces was weak. The quality of the fish was ok (a few pieces were slightly fishy)  - but the texture for some pieces seemed off (otoro was pretty good though). The rice is way too hard and not enough flavor. The chef doesn't apply the soy sauce for you (too much time?) - but the soy sauce he gives is actually kind of weird - it was much thicker than what I'm used to. \n\n3) Service was not as good as the reviews would suggest. First of all they have a waiting area but it's one chair - so one of us was expected to sit while the other stood I guess. But the bigger problem was that she messed up our order. We had two people and somehow she thought we wanted 1 omakase instead of two. When we indicated confusion instead of apologizing and fixing they just insisted that we only ordered 1. That worked out for us though since it didn't end up being good value anyway.\n\nSo all in all not the best experience. I recommend Sushi Katsuei in Brooklyn instead.", "author": "Louis B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-18", "description": "Like other reviewers mentioned. It's not a true omakse, basically a sushi deluxe. The rice was lacking flavor -- served cold, though the fish was fresh nothing spectacular from what I was expecting from an traditional omakase. \n\nThe service needs some work, our server had no idea about sushi but he was nice. \n\nI really hope it would be a gem, unfortunately it wasn't executed well for the price point they are charging. \n\nThe best traditional omakase so far in Brooklyn is Katseui.", "author": "Jay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "We sat at the bar and had the summer miso and ten piece sushi. It was all delicious and beautifully presented.", "author": "Andrei S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "First thing to note is the decor. The menu is short and sweet. Sushi is very good. The neighborhood needed a place like this.", "author": "Andres B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Wonderful from start to finish. I've had amazing sushi in Japan and our meal at Taiki was a lovely reminder. We were a group of four, sat at the bar, and all got the 12 piece omakase, plus some more pieces at the end. The scallop and toro were absolute stand outs on the night we went, but every piece was perfectly textured and bursting with flavor. It gives me joy to just think back on that meal :) \n\nRegarding small details, yes, the sushi is not served piece by piece, but the reason is easy to find. With one chef only and many tables, that's not possible unless you're willing to be at the restaurant all night long. Another review complained that there was no uni in their 12 piece set -- but we actually had uni in ours. It clearly depends on what's fresh the night you go. Also, I've never had a hand roll as part of an omakase meal in Japan, so I'm not too sure what other reviewers are complaining about (but if you want a hand roll, the chef will make one for you as an extra! He did for us). \n\nThe price point is great for this quality. I agree that the service needs a little improvement, but the sushi was so good I don't even care. We'll be back soon!", "author": "Branfa B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-24", "description": "Don't understand what the hype is about. We love finding new spots and usually yelp is on point. But at Taiki we were truly disappointed. The menu is extremely limited and rather pricey. I don't mind an expensive meal if the restaurant is special. Not only did everything take forever but the toro roll had to be sent back. The miso chowder was interesting and the salad was fresh. Sushi pieces and uni roll were average. They should also hire more knowledgeable servers.", "author": "Bruce K."}], "servesCuisine": "Sushi Bars", "priceRange": "$31-60", "name": "Taiki", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Nevins St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/BB3p38UnRa2Z_Gv-jMv8uA/ls.jpg", "@type": "Restaurant", "telephone": "+13475353726"}