{"aggregateRating": {"reviewCount": 58, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Probably the best edamame I have EVER had and the sushi was top notch. We got the omakase and we're both floored by the quality of the fish and the rice. \"Belly three ways\" was AMAZING and the staff was so so nice. Thrilled that a really good sushi place is in our neighborhood! We will be back for sure.", "author": "Brooks M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "Great for my fiance and I's first \"omakase\" as it isn't that pricey. But I believe the omakase here is always the same sushi selection so when we were up for the next omakase, we looked elsewhere for a more varied experience.", "author": "Steven H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Delicious! Such a cute place. The food is delicious (monkfish karaage), the sushi fresh (omakase), and the servers are friendly and attentive. This is now our go to sushi place in Brooklyn.", "author": "George A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-17", "description": "Taiki is one of the better sushi places in South Brooklyn.  It has very reasonable prices, lovely ambiance, and helpful, service-oriented staff, and is located on a very cute block in Boerum Hill.  Unfortunately, the sushi is only okay, and the omakase isn't really omakase.  It's akin to a sushi deluxe that you might get at Ki Sushi or Osaka on Smith/Court Streets.  You don't receive the pieces one at a time; rather, it's presented all at once on a plate.  And there is no hand roll at the end, or any of the ceremony that makes omakases feel special.  The rice is too compact and cold, and lacks flavor; the fish seemed a little dry; the fish-to-rice ratio is low; and they don't apply the soy sauce directly onto the pieces.  I guess it's all fine given that the prices are very reasonable ($40 for 8 pieces; $50 for 10 pieces -- which included a piece of uni sushi).  \n\nWe'll likely go back to Taiki because it's okay and it's nearby.  There are just not a lot of great sushi places in Brooklyn, which I don't get.", "author": "S_Z_ C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "Hands down the best omakase I've had in Brooklyn. Almost as good as Sushi Nakazawa. The trio of fish belly was the most smooth and flavorful I've ever had! The sushi rice is also incredible. Taiki really knows what he's doing here.", "author": "Lisa X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "Great new gem in Brooklyn! I've been twice since they opened, and it's been great both times. The place is pretty small and intimate. We've tried the omakase twice, I would recommend asking to get it piece by piece at the bar. It makes a difference. The toro was our favorite piece. Also the sushi on the menu is 2 pieces per order!!", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Low key home town sushi place. Chef was cool and funny, love watching him make sushi, fast and precise movements. Affordable prices like in most sushi places I go to. Make sure to order sake, goes well with salmon sushi", "author": "Frank C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Love this place! The fish is so fresh and the chef puts so much care into presenting it in a beautiful way. Lots of unique combinations of flavors. The ambiance is chill and inviting, really great playlists. The staff is super nice too. Also it's BYOB booze (for now)", "author": "Love B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Loved our recent meal at Taiki. A great space, wonderful staff and truly delicious food and drinks. The monkfish, crispy rice, omakase and sake sangria were excellent. A not inexpensive but very welcome addition to the neighborhood.", "author": "Sara E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "Delicious. Excellent sushi chef. The edamame is addicting (which is hard to do). The atmosphere is soothing; service isn't ideal but it is good. I also lived in Manhattan for 11 years before moving to BK so I am used to everything happening quickly. It's relaxing and each dish is very good. I highly recommend.", "author": "Kara K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "I recommend you sit at the bar so you can watch chef Taiki work his magic. We ordered the fried monkfish, edamame and eggplant appetizers- all fabulous. We then had the 10 piece Omakase which was delicious. Johnathan, our server was really amazing and the whole meal was wow!!! They only have 5 small tables and maybe 10 seats at the bar so do make a reservation.", "author": "Julie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Easily the best sushi for miles around.  This unassuming but beautiful spot hits all the right notes -- inventive, unpretentious, clean and simple in both the atmosphere and the flavors.  I've been twice and had the Imamate once, sitting at the bar.  It was exceptionally good, served up by the chef.  The uni scallop roll is delicious and the appetizers make nice twists on traditional fare (the eggplant is my favorite).  It's not an inexpensive night out -- don't let the casual atmosphere mislead -- but from the staff to the food, it's a great find and has a hint of the \"undiscovered\" about it...for now.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Some of the best sushi I've ever eaten. Had the pleasure of being hosted by our server Jon, he was the best! He recommended the best sushi and drink combination for my friends and I. I definitely will be back!", "author": "London M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Excellent sushi and great ambiance. Very friendly staff too. Really loved this place and will be back soon.", "author": "Matthew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "This place is incredible! It's fairly new but I'm shocked it doesn't have more reviews. We've been here 4 times now and plan on returning at least 1x a week. Right when you walk in, you're warmly welcomed by the chef himself and the entire team. You have the option to sit at the sushi bar or at various intimate tables around the restaurant. During the several times we've gone, we've tried various appetizers, omakase and sushi rolls. Highly recommend the edamame! It's the best edamame we've had. The omakase offers a variety that never disappoints. You can tell them which varieties you don't like and they'll happily accommodate. We're especially partial to the various tuna including Otoro and the uni. The sushi is incredibly fresh. The tomago dessert is unique and a must try. I never write reviews but this place deserves a solid recommendation.", "author": "Mary C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "I came here for the first time and was really impressed with delicious sushi and good service. I never liked sushi and was made visit this place. But afterward, I was glad that I came here. I definitely will come here again with my friends.", "author": "Dmitrii O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Welcome to Brooklyn, shokunin Taiki!  I was dining solo without a reservation and Jon Smith the maitre d' was kind enough to let me sneak in at the counter.  The nori was crisp and the rice was delicious.  I had the 12 piece omakase, but I didn't want it to end, so I finished with a negi toro roll, which was very well balanced and prepared thoughtfully.  I will be back very soon.  Thank you!", "author": "J M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Great place, atmosphere. But the best is the food! Amazing! If you are at the bar taiki explains everything about what he serves. The place to be for me now!", "author": "Davide D."}], "servesCuisine": "Sushi Bars", "priceRange": "$31-60", "name": "Taiki", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Nevins St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/BB3p38UnRa2Z_Gv-jMv8uA/ls.jpg", "@type": "Restaurant", "telephone": "+13475353726"}