{"aggregateRating": {"reviewCount": 58, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-24", "description": "This place is a hidden gem; you'd never expect this amazing little restaurant in this neck of the woods (quiet side street with not much going on).\n\nLove the minimalist decor, intimate setting, and the EXCEPTIONALLY high quality of the fish. On the eve my dashing hubby and I dined, we enjoyed the Otoro, Japanese Butterfish and Rainbow Runner. All were amazingly fresh. The Tuna Tartar was fantastic. Sake as well as cocktails equally amazing. One sushi chef (the owner!) and a few support staff including the server; that's it.\n\nHighly recommend without reservation.", "author": "Barbara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-27", "description": "Amazing sushi and great service.\nCame here for dinner during the week and was able to order off the happy hour menu (6-7pm). Cocktails were unique recipes made with sake and tasted great but the cup size was so small - honestly this is why I'm not rating this place 5 stars. The drink was smaller than the portion given in a glass of wine, which wasn't worth the $9 hh price let alone the $12 regular price. On the other hand, the 6 piece omakase from the hh menu ($24) was really good. The fish was fresh and the sushi was well made. \nThe other things we ordered off the regular menu was the monkfish karaage, yellowtail and scallion sushi roll, and bluefin tuna tasting otanoshimi plate. The monkfish karaage was good but not great and was just fried in normal fried chicken batter and could've used a sauce - nothing like typical karaage batter. The yellowtail and scallion roll was really good and the bluefin tuna plate was amazing - 5 pieces of different tuna sushi with varying degrees of fat and flavor. The 3 fatty tuna pieces (otoro, chutoro, and hagashi Toro) were so amazing and melt in your mouth.\nOverall, the sushi and the service are a 5/5 and I would definitely come back again", "author": "Kristin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-30", "description": "This was our first visit to Taiki.  We arrived a little past 8 pm and several items were already not available. The waitstaff were extremely pleasant and helpful despite the restaurant being crowded. We enjoyed our eggplant appetizer and the crab cakes. Once we finished our appetizers Chef Taiki began yelling and screaming across the restaurant at a female and male wait persons. He continued to yell and demean these employees in front of a nearly full restaurant. This made us extremely uncomfortable. As it turned out the waitress had given our order to other customers causing the Chef to yell and scream. While friends of mine love this restaurant I will not ever patronize this \nPlace again. No it's not alright to treat anyone the way Chef Taiki treated his employees in front of me and many other customers.", "author": "Ken K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-23", "description": "Sushi was good but nothing special. Probably would not go back unless I was in the area", "author": "Mindy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-14", "description": "Came for a celebration dinner, which proved to be an excellent choice. Didn't try any sushi, but I can say that of the gluttonous number of small plates we ordered, every one was fantastic (the risotto was unforgettable). Very good sake too. I do wish NYC restaurants in general would give the loud music a rest already, and I can't say Taiki's seating is comfy, but the service is terrific, and for the quality of the food, the prices are totally reasonable. A little gem.", "author": "Jenna Leigh E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "So we're cheaters. I admit I felt bad about it but got over it since it was sanctioned by my wife. Actually, it was her idea \u0026 reservation. We went to try a new sushi place a bit of the path. \n\nWas it worth it? You bet. \n\nVariety is the spice of life they say and we're such sushi lovers that not having a deeper bench didn't benefit us in the least. So enter Taiki. \n\nWe dove right in and ordered the Gazpacho \u0026 yellowtail sashimi salad. Both great starts and the Gazpacho gets an extra bump because it's so not what you'd expect, but in a really good way. The sashimi salad melts in your mouth. I mean, it's ridiculous. For our mains we had to have the blue fin toro tasting. Then we opted for sushi of Japanese yellowtail, golden amberjack, salmon \u0026 toro scallion roll. It took a bit of time to come out but our server was so on top of things it didn't matter. Water filled consistently and appropriate check-ins. \n\nWhen it did come -all we could say was wow. That and where'd it go. Yes, we are it all, possibly too quickly. After digesting we realized we had to do a second round. It may have been gluttonous but it was worth it. \n\nIt's only been around a little while and not in the usual mix of Carroll Gardens/Cobble Hill/Gowanus restaurants. But if you're after fresh fish that melts in your mouth check them out. It is glorious.", "author": "anthony r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-10", "description": "Amazing birthday celebration for our daughter. Had the 10 piece omakase . So fresh and delicious. Ambience was great, the servers were so attentive and friendly. Loved everything we had.", "author": "JEANNE L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-08", "description": "A perfect newish hood sushi joint. Everything on my plate brought me happiness. Our waiter Jonathan was well knowledge, friendly and very welcoming with recommendations. I am happy to have found this spot and will for sure come again.", "author": "Stefan B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-10", "description": "The fish is pre-sliced so it is not as fresh as it should be.  The restaurant is not so busy so the chef should be able to manage to cut the fish in front of the customers esp the ones sit at the bar.  If you like rolls, this would not be applicable to you.  Only to someone that really care about eating fresh sushi.", "author": "Calvin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "I just had one of the best meals I've ever had tonight at Taiki. Simply superb and so well executed.\n\nMy date and I decided on the tasting menu for 2 - at $150 it was worth every penny!! From the yellow tail to the miso chowder, to the eggplant \u0026 shishito in soy broth to the sushi \u0026 sashimi entrees. I cant say enough about how delicious, fresh, beautifully arranged everything was. If we weren't in public we would have licked the plates!\n\nI would highly highly recommend Taiki to anyone looking for a low key sushi experience that is anything but low key on the palate!", "author": "Amber E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Delicious, melt-in-your-mouth sushi. Highlights included the seared belly sushi trio (see picture - we ordered two), and the uni scallop roll. I also lived their innovative use of shishito in a sushi roll! Service was fine and the restaurant itself is beautiful and peaceful. Only downside was how pricey the food was and portions were small. I could've kept eating and eating but my wallet just couldn't handle it!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "We love her!!! The fish is poppin, the vibe is intimate, the aesthetic is gorgeous, the price is reasonable... eat here, drink here, omakase here. You're welcome.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "I am just handing out these five stars right now. Come get them while I'm feeling nice.\n\nMy dad took me to Taiki as a special treat. As a broke millennial, sushi is not something I can easily come by. So I was prepared for this meal. My dad happens to know Taiki, the head chef, so he just asked Taiki to give us whatever he thinks is best. I love doing this because I certainly trust the chef more than myself.\n\nI was sitting at the bar so I could see the whole process. It's an ART. It was incredible to watch him calmly make one order after another. I cannot actually name everything I had but all of it was really beyond anything I've ever had. The fish is not too fishy but still carries so much flavor. The texture was always on point. I had an eggplant appetizer dish and the flavor was the perfect mix of sweet and salty. They have a dessert that was insane. I can't remember it right now (will update later).\n\nI was very shocked that someone came in and started asking about vegetarian options. I love my veg friends but I gotta keep it real right now. Don't go here if you can't eat fish. It's just kind of .... pointless! The true experience of this place is appreciating the fresh fish. This is not tofu teriyaki bento box type of place (love me some of those as well, not throwing shade) so there are way fewer options. But if you want to be in the presence of Taiki, I understand you ;)", "author": "Lynn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Surprised that a new restaurant can immediately find a spot amongst the best Omakase in New York, but here we are. One of the more intimate sushi bars in the city, the main attraction is the bar itself, where chef Taiki works his magic and masterfully dispenses tasty morsels from the sea.\n\nWe had the extremely reasonable $60 Omakase on our visit, and every piece was stellar - no misfires. The tuna and uni, in particular, were very strong and induced us to add a negitoro and uni/scallop roll to our evening, and neither disappointed. \n\nThe monkfish karaage appetizer was completely standout and a welcome take on the chicken dish. We'll be ordering that again. We went before the liquor license came through, but we're eager to go back and try what they offer there too.", "author": "Leslie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Taiki is outstanding. The servers take time to explain the dishes. The kinds of fish that go into the sushi are very different from what you will find in a standard American sushi restaurant and they are all delicious. Decor and ambience are excellent. Good for dates or a family night out. Kid-friendly options on the menu. The owner himself is behind the counter, working hard. If you want to experience authentic Japanese cuisine that is unique to the area, don't hesitate to go!", "author": "Stoic D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Awesome spot, super surprised there weren't more people, we had no trouble getting a table!! Great sushi, good value. Toro appetizer was incredible, charring the edamame brought something new to the classic starter. Only negative is the very limited drinks menu.", "author": "Gabrielle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "The fish was incredibly fresh, and the service top notch.  Found this place just walking the neighborhood and am so delighted to have quality so close to home. This is also a kid-friendly restaurant. Yey!", "author": "Reina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "I've spent stupid money at some of the best sushi restaurants in Manhattan, and I can confidently say this is the best sushi I've had in New York. EXTREMELY fresh, insane flavors, and surprisingly affordable. Go there now, because you won't be able to get a table pretty soon.", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "My only hesitation for giving a stellar review here is that I have no doubt as time passes, this sushi spot will simply be harder to get in to.  It's so great to have a high end sushi joint in our local neighborhood.  While it's more expensive than some of the other local places, it's far superior (yet still much less than NYC sushi spots).  I recommend the omakase. Amazingly fresh selection.  The waiter was super friendly and clearly as passionate as the sushi chef about the food he was serving us.  Be sure to order the edamame (this isn't the same old steamed version). truly unique.", "author": "Jared H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "So happy to give this place 5 stars. The food is A+ and the service is excellent. I was super skeptical coming into it since it was an ad on Yelp but I couldn't be more pleased! The decor was very Brooklyn and very clean and organic. We got the omakase sushi and sashimi with some specials of the day with sake. So good! The only thing that was a little off for me was the eninem rap. I would have liked a little more peaceful music, but the hubby loved it so maybe don't listen to me on the music sitch. I can't wait to come back again!!!", "author": "Amanda C."}], "servesCuisine": "Sushi Bars", "priceRange": "$31-60", "name": "Taiki", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Nevins St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/BB3p38UnRa2Z_Gv-jMv8uA/ls.jpg", "@type": "Restaurant", "telephone": "+13475353726"}