{"aggregateRating": {"reviewCount": 24, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-20", "description": "Best sandwich shop in Fulton street right next door to Burger King lets get it !! I Just put y'all on the map !!!", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-13", "description": "Not bad!\n\nI actually prefer Blimpie over Subway. I am so mad with Subway; Their sandwiches on the commercial never look like the sandwiches that are made for me.\n\nAnyway, my sandwich was fresh and delicious. No complaints. I think may have even been a little cheaper than Subway?", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "$5 for footlong, 8 different varieties of sandwiches.  For the $5 deal.  Other options available. \nI usually get the turkey club or the plain turkey.\nI don't eat Subways because it tastes horrid........Blimpie takes me back to my childhood. Years ago besides the neighborhood deli, and in the morning I would have a class trip, my parents would get us a Blimpies sandwich and that would be the highlight of the trip.  \"Yes class this is the reptile house..........yadda yadda.......\" Me drifting off and thinking about lunch.  Later for this trip lady, I'm ready for my Blimpie sandwich!!! (Sniff sniff, those were the days.)\nI digress...... \nYou have a choice of wheat or white bread, mini........\nIt tastes the same as it did years ago, there is just something about oregano and oil and vinegar that is added to the sandwich.  The meat and cheese is better than subway IMO, its much more flavorful.  Make it a combo add a soda and some chips.  \nBlimpies are few and far between and whenever I see one, I always make it a point to get a sandwich and also to keep a mental note of where they are located for return visits.  \nWhat are you waiting for, hop on in, you won't be disappointed! *-*", "author": "Amy W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-03", "description": "Small, dingey establishment in downtown Brooklyn. The tables are usually occupied by students and others who buy a token item and consume food purchased elsewhere so you may not get seating.  Nothing spectacular about the food. The fact that they charge for extras such as pickles sends me straight to Subway.", "author": "R M."}], "servesCuisine": "Sandwiches", "priceRange": null, "name": "Blimpie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "24 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/RpTnQOfmZZPtsPF7OtEl0A/ls.jpg", "@type": "Restaurant", "telephone": "+17182540703"}