{"aggregateRating": {"reviewCount": 24, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "Blimpies made me fall in love as a boy with cold cut sandwiches yum. Blimpies best was heaven to me the mayo, the different cuts of deli meat the cheese and my favorite that actually taught me on how to make a stand out cold sub was the red vinegar , olive oil and black pepper especially that was used to dress the lettuce tomatoes and onions oh yes and loved those banana peppers. This was in the late 70's in the upper west side of manhattan 86 st and broadway to be exact. I felt compelled to write this on a blimpies page as an ode to that first blimpies best that bedazzled my taste buds and showed me the way. Peace and Love BB.", "author": "Jose B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-01", "description": "Ordered a bacon egg and cheese on a roll . Did not taste the hard bacon on it . It left a bad taste on my mouth. Not good for breakfast!!!  Waste of money !!!", "author": "Jhoanne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "You don't know how much you appreciate a really good sandwich till you've had really subpar ones. Subway to me is very subpar. I accept Deli sandwiches from around the way but even those are hit or miss most times. Blimpie's is a NYC almost forgotten gem being that there are so little of them now but so many of subpar Subway's and other less than stellar hero sandwich spots. \n\nOnly found out about this Blimpie's recently after having a discussion oddly enough on Facebook with a few others about an article about Subway. A shredded burger kind of sandwich he mentioned he got from here. I didn't get that but I got an F'N great roast beef and provolone hero from here. So good that I came back a few days ago to get the same thing lol. Well worth it and being that it's inexpensive I see myself coming here more often for other sandwiches soon.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "I love Blimpies. I stop at this when I was in Brooklyn heading to the studio. I am shocked that there isn't any NYC location. These use to be the best and that sandwich brought back some memories.", "author": "Totallysam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "Glad to know the Blimpie sandwiches franchise is still alive !!!!!!!", "author": "L L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-27", "description": "Better than dingy SUBWAY. They should consider opening more locations.", "author": "Richard S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "My lovely deli staff are now my family. They make you smile as soon as you walk in I absolutely love them. At Blimpies you will be greeted as soon as you arrive and they are happy doing what they do. Why in gods name is blimpies under appreciated or atleast that's the way it seems. Subways cannot stand next to blimpies. Fortunately I've been around long enough to know what a REAL classic sandwich looks and tastes like. Give them a try n you NEVER go back to subways", "author": "Nia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Very friendly staff no rush. The place is very nice and clean. I had a turkey sub on poppy seed bread toasted the sandwich was yummy.", "author": "Rifatul C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "This is my go to sub stop whenever I'm downtown in Brooklyn. Looks like the managements changed because the customer service has improved ridiculously. When I used to go to High school around there the old employees used to be perverted especially one who would never stop talking.  Three years after graduating high school I stop by downtown Brooklyn and I noticed the immense change. The store is also much cleaner now.  The old tables were like my grandmothers age, but the new tables and chairs are nice and made of wood. Keep up the work guys and gals.", "author": "Erin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "Words cannot describe how much I love Blimpies. Subways can never compare. A blimpies sandwich tastes how a hero should taste. I cannot wait to get another sandwich.", "author": "Chanille C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "This is my favorite place to buy a sandwich when I'm in this area. This location has been here for years, but the quality of food and service has remained stellar. The staff is professional and friendly, and the dining area is always clean.", "author": "Jeannine I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Why would anyone go to Subway when there is a Blimpies around. The sandwiches are much better then Subway. For the same price of Subway you get a better quality sandwich at Blimpies. When in downtown Brooklyn do not go to Subway or Shake Shack or Burger King for lunch. Blimpies is a must and this is one of the last Blimpies in NYC.", "author": "Mark B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "This Blimpie is the absolute best at making a hero taste just like the one I had as a child.  Brings back great memories when my mom would buy me a Blimpie for class trips.  So very yummy!  All the Ingredients are fresh.  The restaurant is clean and so are the workers.  I highly recommend this location.  More Blimpies are needed.  The Blimpie that was near my house closed years ago.  I hope the Blimpie Corporate office decide to open more Blimpies.", "author": "Anita T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Blimpie has been one of my favorite fast food places since I was a child.  I like the tuna salad hero, and while Subway's tuna is good Blimpie's is way better as they use solid white albacore in their tuna salad,..not yellowfin like Subway. I prefer solid white albacore tuna.", "author": "Art K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-13", "description": "i went to blimpie twice.  \n\nthe first time i went there, the service was good.  the food was mediocre.\n\nthe second time i went there was today.  i was upset after i went there.\n\ni am an asian guy.  here is how my visit to blimpie went:\n\ni went to the server/food attendant who was at the end of the counter (the attendant who was furthest from the door).  he was hispanic.  i told him i wanted a meatball parmigiana sandwich.  i was thinking about what type of bread i wanted.\n\nhispanic: what do you want, chino?\nme: my name's not chino\nhispanic: sorry, sorry, sorry.  what do you want?\nme: i'm good (walking away towards the door).  don't be calling any asians \"chino.\"\n\n\"chino\" means \"chinese person\" in spanish.  \n\nthat motherfucker was saying racist shit to me in spanish, and he thought he was being so smart.  he thought i wouldn't understand, because i'm asian.\n\nfuck this place.  i told my coworker, who was actually going to go to blimpie for lunch.  he decided to go to subway instead, because of what happened to me today.\n\nmanagement should fire that motherfucker.", "author": "Fred M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-09", "description": "Meh, subpar. Haven't had Blimpie since I was a kid because the location near me went out of business. I suppose I'm not surprised... I wasn't missing much over the years. \n\nI'm sticking to Subway if I want a fast food sandwich.", "author": "Rick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "I haven't had Blimpie in ages. I stopped by and got a veggie sub. The good thing is this don't just offer lettuce, tomatoes and onions. They actually have green peppers, hot peppers, sweet peppers and cucumbers. YUMTASTIC", "author": "Tomi C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-02", "description": "The sandwich is overpriced for poor quality. $8 for a 12 inch hero. I looked on the receipt, it said customized item?? I asked why is a turkey \u0026 cheese hero, a customized item?? They couldn't answer me.", "author": "Natalie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-04", "description": "I literally eat breakfast at this location DAILY. I'm obsessed with their ham, egg and cheese wraps with banana peppers! The best part about this location is definitely the guys working behind the counter: friendly, funny, efficient, and just plain old happy to be there. \n\n-1 star due to the dingy exterior- Otherwise, I love this place!", "author": "Caroline S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "I received stale bread from here and if the bread is stale there goes your appetite. I called in made a complaint to the manager. Boy was I a bitch I sure have him a piece of my mind.Lol but he kept his composure and was professional about it so let's see what happens tomorrow -____- with this free sandwich I'm suppose to be getting. DONT MESS WITH A GIRL ANS HER FOOD! LOL.", "author": "E M."}], "servesCuisine": "Sandwiches", "priceRange": null, "name": "Blimpie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "24 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/RpTnQOfmZZPtsPF7OtEl0A/ls.jpg", "@type": "Restaurant", "telephone": "+17182540703"}