{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-11", "description": "We were really impressed. We got a little scared when we were walking in the neighborhood, wasnt sure if we should trust the food. But it was fantastic, everything. My boyfriend has a meat allergy and misses chinese food, this place helped fill that void!", "author": "Katrina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "I ordered kimchi udon noodles, they were so good! Order this! And enjoy the calm peaceful environment this place has to offer, it has a nice fancy vibe and the staff is sweet!", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "High quality vegetarian junk Chinese food.\nNice appetizers, fresh vegetables, lots of soy product. Hot and sour soup nice and acidic. Sizzling soy protein is delicious. Bi Bim Bap! Nice noodle soup. Lately they've been selling pies from Clementines in Clinton Hill which are awesome.\nRichard is a sweetheart, but service can be uneven (I think that's fair...).\nAll told, I've been going here since they opened, and I'm really glad they're here.", "author": "malcolm e."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-08", "description": "Went to this location months ago and was great. Plenty of things to close from and they all taste good. Gladly would back. Went to the Williamsburg location recently and was glad to see it was just as good.", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-03", "description": "Thanks to the MSG, the food tasted great!  It's 1:45 am and the only reason i'm up right now is because after 19 cups of water my mouth is still as dry as the mojave desert.", "author": "mich k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "Sometimes when you order delivery from a place, you just assume it's not a great place to dine-in. Not so with Wild Ginger! The space inside is totally cute, and it looked like they had a nice patio out back for warmer nights. Great spot for a casual yet sort of intimate meal in on Smith Street that won't break the bank. The service was stellar too. Best part - the food is great! You can bring meat lovers here and they will leave satisfied, I swear. The basil soy protein is delicious and filling. I think the soy protein dishes seem like the way to go over the noodle dishes, but that said I haven't tried them all. Usually I don't get dessert at asian places but the peanut butter bomb is, well, the bomb. \n\nWould be better if entrees were a couple dollars cheaper, but on the other hand they all come with a soup/salad appetizer.", "author": "Laura Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-24", "description": "Being a BIG steaks and burgers kind of guy I was skeptical of a vegetarian restaurant.  I have been to one in Chinatown, which was delicious, but not every place can do it right.  The restaurant had a nice space in the back leading outdoor.  When it is crisp and cool outside, that is the best place to be, though during windy times it can be a pain, blowing the napkins around.\n\nOverall the dishes were developed well, tasting as good as the meat counterparts.  The curry samosa and eggplant were good but the summer roll was a miss.  The general tsao's soy protein and malaysian curry stew were good as well.  \n\nNot a bad option if going vegetarian for a while...", "author": "Donald E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-27", "description": "Not many places are 100% vegan, and with the selection of items available, this place is absolutely outstanding!\n\nEverything I've tried is delicious \u0026 appropriately made - not overcooked, not drowning in sauce, etc. I eat here regularly \u0026 have had most of their menu, including the desserts, which are AH-MAZ-ING!\n\nIf you took someone here \u0026 didn't tell them it was vegan, it would be VERY hard for them to figure it out!\n\nAlso, I live about 7 blocks away, \u0026 when I order delivery, from the second I hang up, it's at my doorstep no more than 13 minutes later, \u0026 piping hot! I'm convinced they only send out one delivery at a time :)", "author": "Just M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "Yummy vegan food in a nice environment! Good lunch specials. Try it. :)", "author": "Coco S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-07", "description": "BEWARE: just waited ONE and A HALF hours for a delivery. the food is pretty good but the delivery always takes a long time. so many other great options out there with good customer service.", "author": "sundy p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "Made same comment about their Manhattan location... Admittedly not a devote vegetarian, :( but their food is amazingly good.  Will choose them over any Asian restaurant, meat or not.  Bravo.", "author": "Elsa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-28", "description": "They had, literally, one of the best pad thai's I've ever tasted, and their mango lassi is amazing. I usually steer clear of \"pan-asian\" food because it's usually a whole bunch of mediocre dishes. But everything we had was really good. Their service is also top-notch. My three year old also loved the food.", "author": "Adrian G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-30", "description": "I've been having a really hard time finding a good restaurant, especially an Asian one, to order from since none really deliver to my area, and, if they do, they pretty much suck.  Usually, there's Nicky's...and then there's Nicky's.  But now I'm happy to say there's also Wild Ginger!  WOOHOO!!\n\nI went to Seamless Web to see what places would deliver to my area and went through the list of 65 restaurants.  Saw high marks for Wild Ginger and then came to my trusty Yelpers to see what their reviews were as well.  High marks again!  I was still a bit wary since I've ordered from other spots that had lots of stars, too, and they turned out to be not so great.  But I decided to take a chance since I'm daring like that.\n\nI was about to order miso soup to help my nausea, but then I saw one Yelp reviewer who received a response from the manager.  The manager was basically trying to prove that they were an authentic Chinese restaurant since the Chinese workers in the area go to them for hot and sour soup when they're craving it.  I'm Chinese, and that response got me to not only order the hot and sour soup instead, but to also have some more confidence in my decision to order from them.\n\nWhile I did my laundry and watched some tv, I ended up getting a weird call from the delivery guy.  And by weird I mean that he couldn't really speak English so I didn't understand a darn thing he was saying.  \"Blah do da blah blee boo!!\" he said.  \"Excuse me? I don't understand what you're saying,\" I responded.  \"Blah do day blah beep boop!!\"  \"Excuse me?!? I don't understand...\"  *click*\n\nThis is an instance where lack of communication didn't matter, and I got my food!  Hooray to that!  And the hot and sour soup, although not actually spicy (better for my ailing tummy anyway), was actually GOOD!  Hooray to that, too!  And the vegan dumplings had a delicate spinach skin/wrap, which was maybe a bit too thin but at least it wasn't the crazy thick and chewy skin that some restaurants make.  So, hooray again!  (Never mind that the insides of the dumplings were a tad mushy for some reason.  Ruins the flow of \"hoorays!\")\n\nNeedless to say, I was pleasantly surprised and will definitely try ordering from here again, especially when there's only an $8 minimum.  I like, I like!!", "author": "JaShin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-16", "description": "Gluten free comments\n\nMacro plate is delicious! Kale and carrots were crunchy, broccoli was very crunchy - next time I order it I will ask for the veggies to be well done.\n\nAvocado salad also delicious and very healthy (romaine, sprouts, avocado, citrus i think, soy cheese) although the ginger dressing isn't gluten free. I split with friends so they got dressing on the side, and I got GF dressing. There are three GF dressings/sauces - mango (didn't try), spring roll sauce (tasty, clear sweet sauce w cilantro), and red sauce (too salty, gross).\n\nNot everything on the gluten free menu is actually gluten free - I ordered the gluten free mushrooms and they came breaded so I had to send them back. The waiter explained at a lot of the appetizers had been changed.\n\nMy friends said pad Thai and pineapple fried rice were both good (neither is GF).\n\nSo my complaints are\n1. Update the gluten free menu. Seriously.\n2. A place with so many gluten free options ought to invest in a $5 bottle of gluten free soy sauce (tamari). A lot of the entrees on the GF menu said request no soy sauce. How hard is it to serve GF soy sauce? They sell tamari in every grocery store in the soy sauce section.", "author": "Catherine H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-07", "description": "I was really excited to try out this place after reading the yelp reviews. I was staying in Downtown Brooklyn and looking for an Asian-inspired restaurant to eat at. Turns out there are several on the same street as Wild Ginger, which only made me regret going here even more.\n \nThe restaurant gets two stars for decoration and service, both of which were great. I don't understand the great reviews on Yelp about the food. My boyfriend and I thought the food didn't have ANY flavor. On top of that, we both got sick after eating here. We ordered a couple items on the menu and the only thing we liked were the spring rolls. I was disappointed because I was really craving vegetarian food and wasn't expecting the tasteless food at Wild Ginger to give me the runs.\n \nP.s. The \"ginger ale\" they have is not really ginger ale, but some other mixed concoction. Try it and see!", "author": "Ming F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-30", "description": "I've never eaten anything I was disappointed with here. My husband and I are vegetarians, and I do not eat dairy. I always feel safe and satisfied eating here. The food is reasonably priced. The portions are a good size. We love the summer rolls and the wontons. The king oyster mushrooms are fabulous!! The pumpkin soup is hearty and delicious, and my favorite entree is the basil soy protein. MMMMMMmmmm!", "author": "Abbi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "Oh how I love their food. Kid friendly they also provide u with high chairs . Food is quick! The maître de is a bit weird lol. Sometimes their dishes come out messy but pretty much has awesome food . If your not happy they won't help you much so try not to be so picky lol. Their not that great with their customer service but the food is still good. The peanut butter bundt cake is awesome", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "Excellent atmosphere and delicious vegetarian Asian food. Delivery is always fast and correct. Prices are great. Service always friendly. Our faves are General Tso's and black pepper seitan.", "author": "Myrna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-24", "description": "No way can you leave this place hungry, I have a hard time finishing the whole serving. \nI've been staying in a nearby hotel for 3 weeks on a business trip and Wild Ginger has fulfilled my dinner needs on multiple occasions. Maybe the General Tsao is my favorite dish, but I still have to work my way through the whole menu before I pick a definite favorite.", "author": "Eli C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-13", "description": "Ah vegetarian heaven! But not for me. I enjoyed some of their dishes, but  hoooboy, I love my meats. Jessica, my waitress, was super duper awesome!\n\nThe appetizer Jessica recommended was pretty good. The triangle looking thing with curry - Curry Samosas.\n\nThe main course I had Black Pepper Seitan which sort of tasted like beef.\n\nAnyways, pretty decent experience.\n\n*edit. 3/13/2010-I originally had this place down for 3 stars - but I just bumped it up to 4. Here's why: my friend told me to go back and try their fried fake chicken nuggets-look-a-like. And...you guys got me. It tasted like chicken. I'm like \"dood, no fudging way\" Oh. You guys got me real good.", "author": "Kent W."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}