{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "Been here a couple of times now and I have not been disappointed the slightest bit! First of all, they win kudos for having a gluten-free menu that includes several appetizers, entrees, sides, and desserts which means there is plenty to choose from. Nearly everything is vegan and those items that are not are clearly labeled. \n\nThe Jap-Chae and the Mei Fun that I've had are absolutely delicious and generously portioned. Lots of vegetables and a good amount of yummy marinated tofu.\n\nService was also great and pricing very reasonable. I would eat here on a weekly basis if I lived closer.", "author": "Barbara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "Tried this place because of the good reviews. They have interesting dishes. We really like the pineapple fried rice. The pumpkin soup was delicious too. Dumplings were a hit too! We also had the curry and the yaki soba. Because it was vegan we were hungry after an hour! Lol service was good and the food came pretty quickly. Would come back to try to the other dishes.", "author": "Lily S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Excellent vegan menu! Lots of interesting choices. Generous portions. Cute restaurant, very comfortable. Excellent service.", "author": "Cara D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "My favorite vegan restaurant in NYC. Everything on their menu is amazing!! I always try something different every time I go and i am always satisfied.", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "We have eaten here a dozen or so times. We have brought a handful of friends that are not vegan and they suggest we meet there again! \nOnly problem is deciding what to get....it's all so good. Desserts are huge if you have room for them!", "author": "James Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-08", "description": "Wild Ginger seems to have changed their menu from the last time I ate there in 2017. The pumpkin soup is still outstanding, but I found most of    the sauces to be loaded with sugar and artificial tasting. They seemed to have been made with cornstarch. The garlic sauce was the only one I liked. The tofu and vegetable plate I got was mediocre. The vegetables seemed to be frozen, and the tofu was not particularly tasty. They no longer had the sushi rolls and many of the vegetable side dishes I had the last time. I would not recommend this place.", "author": "Carol L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-22", "description": "I'm sitting here in the empty restaurant waiting for my lunch after forty five minutes. There's only one other customer. What could possibly be taking this long?\n\nWhen it finally came it was pretty tasty, but way too small a portion.  Slow and stingy is not a great combination. \n\nThe service was inattentive. Again: no one else here.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "As a carnivorous omnivore, I have no hesitation to say that this restaurant is one of the best finds on all of Smith Street and the surrounding neighborhood. In fact, LuAnne's Wild Ginger All-Asian Vegan, which serves up vegan Asian fusion cuisine, surely must qualify as one of the best vegan-vegetarian options in the city! \n\nFirst of all, the service is kind, attentive, and accommodating (we were able to book a party of 12 for a Saturday dinner on the same day!). Second, the atmosphere is very relaxing and conducive to family meals and first dates alike! (I'd imagine the outdoor patio would be a fun place to eat during the warmer months.)\n\nAnd then there's the food... it's affordable (half the price for what you'd expect to pay for dinner in solid restaurants throughout the city), comes in big portions, and is healthy and delicious! The flavorful seitan skewers were absolutely delicious; a blindfolded person who has never tried it would easily mistake it for an actual meat kabob! The mango avocado roll and the orange seitan (much better and healthier than the orange chicken that American Chinese restaurants serve up) were also big hits at the table. Finally, the organic ice cream (made with coconut milk) was creamy, rich, and delicious even though it wasn't made out of real dairy.\n\nNot a vegan? Don't sweat it, and don't let your wallet feel strained. A visit to Luanne's Wild Ginger All-Asian Vegan offers delicious and healthy food at an affordable price for families and friends alike!", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Such a great vegan spot. I've gone here multiple times in a week more times than I'd like to admit. My non-vegan parents came to visit and I took them here, and they really liked it despite being meat eaters.\nMy personal favorite dishes are the cold green tea noodles and the Sweet \u0026 Sour Sesame Soy Protein. It's so crispy and always piping hot. \nThe menu is not the cheapest, but it's worth it. The staff is always very nice.", "author": "Riley A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "The food here is pretty good. Im not a vegan but i followed my friend who wanted to try this place out. I got the teriyaki seitan and the texture is passable for meat. My friends black pepper seitan texture wasnt really passable but taste wise was good. The samosas were crispy and good as well", "author": "June N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "I've eaten here twice, first time back in February. I'm neither a vegetarian nor a vegan but it's fine as I don't eat (or like) too much meat anyway.\nThe first time I ate here was on a cold day in February. I ordered a pot of herbal tea and the Malaysian Curry Stew. I remember liking it very much as it was hearty and real good comfort food.\nToday, I had lunch here with a friend. We sat in the backyard patio as it was a beautiful day. \nI ordered the mint lemonade along with the Bibimbap. The mint lemonade was not too sweet but really refreshing, tart and minty. No skimping on the mint leaves! The Bibimbap was real good. My friend (who has eaten it many times at other restaurants) said it was more like a fusion style-as she also ordered the same dish. Nevertheless,  we both enjoyed it a lot. A pumpkin soup was served before the main dish which was extremely good--light but flavorful. The Bibimbap portion was quite generous (but also $15) and I'm still full as I write this, hours later. The service was excellent and our food came out minutes later!!\nAll in all, I really like this restaurant and would definitely recommend as well as return again.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "I stumbled upon this restaurant and I'm glad I did. The atmosphere and music was great! It wasn't too loud, just a nice ambience. I had the fried dumplings filled with veggie, it was very delicious! For my main course of meal I had the Jap Chea, it was so delicious. The vegetable seafood- flavored cakes takes so good, I thought I was eating \"meat.\" This place is perfect for vegan and vegetarian. I highly recommend and I will be going back soon. The waitress was very sweet and pleasant.", "author": "Tashana J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "Okay so this is my second time eating vegan food, and by no stretch of the imagination am i a vegan, I am 110% a carnivore. But this was some bangin Asian food I just devoured, I was extremely skeptical coming into the restaurant but my girlfriend assured me it'd be fine. Well boy oh boy was she right, I had the scallion pancakes to start, with the mango salsa on the side. The main course however was the orange seitan with brown rice on the side and steamed broccoli. All in all it was really really good and I would def come back, if I find myself in the mood for good asain vegan food again. Two thumbs up, and I ain't just saying this, it was bangin, if you stop by make sure to get what I ordered. I gotchuu", "author": "Alexander R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "This place is perfect for Saturday lunch. The interior is cozy, and the small size of the place makes it even more private. Good menu for those who like healthy vegan, and enough junk to satisfy if you're feeling like fried food and carbs :) Friendly staff. And last but not least, addition if nice music would make this place perfect.", "author": "Vinika K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Wow really good place excellent tasting food. If your a vegan or not does not matter this is just better tasting then non vegan food. All made fresh to eat, get the miso eggplant !!!", "author": "Joel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "Get the Singapore Mei-Fun. You will not regret it.\n\nSome other honorable mentions are the sizzling soy skillet and curries with that protein. Delicious option for vegans, non-vegans, and curious carnivores. The flavors are mostly bold, but if you want, you can always ask them to make things spicier.", "author": "Bagmi D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "The service - no complaints.  The staff was very nice and attentive.\n\nThe food - varied for me.\n\nThe grilled eggplant appetizer was good, taste wise.  \nPortions to cost ratio: it was lacking.  It was 4 half pieces (small).\n\nThe cold green tea sesame noodles was good enough, taste wise.  \nPortions to cost ratio:  it was also rather lacking, not as badly as the grilled eggplant.\n\nThe japchae was too salty to me thus very disappointing.\n\nThe tofu teriyaki was ok.  \nIt was not as salty as the japchae so it was a great relief.\n\nDuring dinner we overheard people at another table talking about going to Wendy's after their meal. \nAfter dinner one of us had to get pizza slices.\n\nA return visit is unlikely but one of us did prefer to have meat to be content.  (The one who needed pizza afterwards)", "author": "Orange S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Consistent, creative, vegan meals. We order from here at least once a week!\n\nTop dishes: vegan bibimbop, veggie curry, and kale/avo/shitake bowl.", "author": "Elana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "My girlfriend and I found this restaurant on our first night staying in Brooklyn. We only chose it because it was the closest to our hotel, and it turned out to be the best of the seven vegan restaurants we sampled while  in New York for the week. \n\nIn short- the menu is creative, the food is delicious, the portions are good-sized, the value is good (for New York, at least), and the service is very nice- a blend of personable, formal, and cordial. \n\nOn each of our three visits (you've got to keep going back if you find a restaurant that has everything you want), we had appetizers, entrees, and dessert. All of those things, from the dumplings to the pad thai to the brownie and the bundt cake....were fantastic. \n\nReally looking forward to returning. \n\nOne note for the establishment's owner/manager- the lighting is so dim at night that it detracts from the visual experience of the cuisine. Additionally, we had to use flashlights to read the menu (neither of us require glasses to read or for any other purpose). \n\nOh, and one other note- the music selections and sound system created a really nice ambiance. It was quite relaxing to eat there; the music did not overwhelm at all (in contrast to some other places we ate, where the music was concert hall volume and was way over the top).", "author": "Rick L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "I've often come here in times of great hunger. They have never failed to satisfy, except that time that they were closed.\n\nHighlights include: 1) Bibimbap; 2) Tofu-skin wraps\n\nI see they've recently gone off Seamless.com and now use an alternative service, ChowNow.com\n\nI'm totally fine with it. Took me about 10 seconds to create an account.\n\nKeep up the good work LuAnne.", "author": "Ernesto P."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}