{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-11", "description": "With all the meat places my boyfriend drags me to I decided to exact my revenge and drag him to this cute vegan restaurant for dinner one night. I'm not a vegan myself but prefer to eat vegetarian most of the time (I eat fish and sometimes chicken). \n\nI think we were both relatively pleased with Wild Ginger. The service and decor are great. The menu is pretty long and everything on it looks good. Everything we ordered had a lot of flavor. After a full meal of appetizers and main dishes we left completely stuffed. \n\nI would definitely come back for more. The boyfriend, probably not. He complained of hunger like an hour later claiming it was because there was no meat in his system.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "This place is cute, people are friendly, and the food is delicious. What else is there to say?\n\nWell okay there's a little bit more to say. General Tsao's soy protein - dude, I don't even know. It's damn fantastic. I don't live in NYC, came here twice last time I visited, and every time I think about General Tsao's my heart rate goes up and I salivate. And it's been weeks. The soy protein texture (i know, it sounds weird but it isn't) is firm and juicy and meaty (better than a chicken nugget) and the sauce is the perfect mix of sweet/spicy. Plus, it comes with nicely blanched broccoli with which you can cleanse your palate (to maximize your General Tsao's flavor experience).\n\nTheir other dishes are good too, at least the ones i've tried - scallion pancake, crispy tofu skins, and especially the Fisherman's protein (the faux-seafood is bouncy and has nice seafoody flavor). We got an order of Jade Mushrooms (sliced oyster mushrooms) once and I thought they could have been cooked a little more, but otherwise everything's good to go. \n\n\nLook. If you're searching for \"authentic Asian\" cuisine, why go to a cute and chic vegetarian fusion place in Cobble Hill? \"Authenticity\" is vats of live fish on the street in Sunset Park - awesome, but it's not for everyone and that's fine. And if you're seriously looking for everything to be like real meat, then go eat some real meat. Bottom line, the food at this place tastes good and that's that. Get the General Tsao's for me.", "author": "April S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-11", "description": "Hands down the absolute worst customer service ever.  Found a staple in my soup and they refused to give me a fresh soup NOR refund me!!!  Instead, they cursed me out in Chinese, which I know because my first language is Chinese.  Absolutely insulting and appalling.  Vegetarian Ginger on Montague (not sure if it's owned by the same people) is a million times better both in food and service - they're always warm and kind and their food is wonderful.", "author": "Brooklyn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-01", "description": "I've been a loyal customer of Wild Ginger's for the last three years. Until...one night a few months ago...I found a MAGGOT nestled into my take out.\n\n I called the manager, who was profusely apologetic and immediately refunded me. He asked that I \"set aside\" the maggot so a staff member could come collect it (not sure if he just wanted proof, but he said it would help them with their \"investigation\")  I told him I had already thrown it away, and he stated the staff member would come collect the bag from me and they would sort through it themselves. I felt bad having some poor staff member doing this...so I ended up digging through my  trash and finding it. Fast forward two and half hours- still no staff member. I ended up calling the manager back, who told me - \"Oh, we don't need that. We figured out it was from the box the kale was in.\" (it would have been nice to receive a call telling me to forget about it, given that I had waited around for these people for 2.5 hours. Also the sudden shift to a casual attitude about a customer finding a maggot in the food was disturbing). I reported this to the health department and  took a Wild Ginger hiatus for a while.\n\nI still didn't want to give up on the place COMPLETELY...but I still  waited a few months to try it again, hoping that my little incident was just a freakish fluke.  Unfortunately, my experience last night proved what I feared- the hygiene of this place is seriously subpar.  While I didn't find a maggot in the food again, I did experience what it was like to eat a mouthful of sand. I took one bite and the vegetables were as if they had been picked up off the beach and sauteed. There was no sand or grit visible (trust me, I spent a while visually inspecting the food- but was initially more focused on finding maggots than dirt).   Wild Ginger  is clearly struggling in the food safety and sanitation departments. \n\nTo Wild Ginger: I really wanted to give you another chance, but c'mon...this is unacceptable! Get it together and at least attempt to rinse your \"organic\" produce before selling it. You've now lost several frequent customers!", "author": "B S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "In all my years as a vegetarian (15 and counting), I've never been to a vegan/vegetarian restaurant. Shocking, I know. After getting a failed attempt to see Harry Potter 7B (it's been out a month and it's still sold out!!?), my husband and I decided to walk around the Hills (Cobble and Boerum) in search of good eats. We passed by a bunch of places that just didn't feel right, when we came upon Wild Ginger. I was surprised when my husbands suggested going in, but delighted.\n\nLiterally, I was squealing with delight realizing that I could eat EVERYTHING ON THE MENU!! Do you know how many times that has happened in my life? Once! That time. It was awesome. Srsly, I've been talked out of throwing vegetarian birthday parties and having a vegetarian wedding reception (because it wouldn't be fair to my guest? Apparently they wouldn't have anything to eat?), so this was quite an experience for me. It took us a quite some time to decide what to order (normally my husband is a big meat eater, and I'm used to having to decide between two or three things on a menu), but the waiter (Tom) was quite nice. \n\nMore points because he would politely ask \"may I?\" before filling my water glass (I went through three glasses while pouring over the menu). Ian (my husband) eventually ordered tofu teriyaki (which he was surprised to find that he enjoyed) and I had the bi-bim bap which was AMAZING. Seriously, the mango salsa bits in it were some of my favorite parts, and I don't even really like mango all that much. My leftovers still tasted great the next morning for breakfast, unheated.\n\nOh, and I forgot to mention the seaweed salad that we split and I can't stop thinking about.\n\nThe food was amazing, the service was great, and the atmosphere was nice (Bob Marley music, mixed with James Brown and some old timey 40s stuff? All good in my books).\n\nI cannot wait to go back here. Hopefully we'll have Tom again as our waiter.", "author": "Megan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Very nice place on Smith st. The mojitos are amazing (try the sake one). \nGreat place for an asian meal and as a vegetarian I really enjoyed the variety of asian dishes you usually never get without flesh.", "author": "Ergodyne T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-18", "description": "My favorite place for delivery.  They work really fast and my order is always downstairs in no time.  I don't live too far away but what I love about this place is that they are super consistent and organized.\n\nDining in is a real treat.  The waiters are friendly and accomodating and service is efficient.  Peaceful ambience.  Always a great place for me to eat at when I'm in the mood for not only something relatively healthy but also a meal that will appeal to my taste buds.  \n\nMy favorite dish so far is their bibimbap.  Super filling because it's a pretty big dish, they give you two sauces (I pour both in, I don't know if you're supposed to do that), and it includes a healthy variety of veggies.  I also really like the pumpkin soup that comes as a side.\n\nIf you're into salads, I recommend their watercress salad.  When I'm really hungry I order that with my dish.  It includes super healthy greens with avocado, a bit of shredded beet, and what really tops it off is the sesame dressing that comes with it.  Just pour it on, close that lid (if it's to-go), shake that salad, and off you go!\n\nI also had a taste of my friend's order of Jade Mushrooms (batter-dipped shiitake mushrooms!) and that was delicious.  Their General Tsao's Soy Protein is pretty good too - and like other reviews, yes it really does taste like chicken!  I think I've tried all of their noodle dishes too, which are pretty simple in terms of taste.\n\nOk and last night I tried their mango lassi for the first time and really liked it!  It made a great dessert.  I think I'll have a go at their dessert menu soon.  I saw Peanut Butter Bomb on it - that intrigues me..", "author": "Joyce L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "Really enjoy this place. Flavorful meat alternatives. I like the setan. Always had it delivered so I'm not too sure about ther service or look inside. But the food is good.", "author": "Leonard S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-04", "description": "Horrible Service!!!\n\nThe so called \"fresh\" drinks - I brought a friend of mine to this place yesterday/Sunday to wow her. Well, it wow-ed her, but in a negative way!  Firstly she asked for orange juice. The OJ came out, she tasted it and it was awful. The server kindly brought out another. It was also awful so I took a sip...and she was right!! Ok, so don't get juice there.\n\nThe food - We planned on sharing plates which were a couple of salads and an entree. The salads were alright - definitely not impressive, but we did eat some mainly out of being hungry from the gym. However, we both did not like the entree, at all. We were honest with the server who didn't know what to do so she brought over her manager. Her manager was extremely unprofessional with handling the situation. He said he would take out the OJ - which at times he said could be sour (really??? you serve sour OJ???) but not the entree (which we did not even touch after a couple of bites.)  Still charging us when he could have recommended another dish, apologized, or anything else other than charge us a plate we BOTH didn't like is beyond me. It was not worth $16 whatsoever. I'm sure the ingredients itself was less than a 1/4 than what  of what the meal cost. We were friendly even to pay for the meager salads but finally after going back and forth with the manager who offered excuses, he finally took off the entree after asking his \"boss\" who the other server said earlier wasn't even there. Get your story straight, stop with the excuses and be professional. I did not expect ridiculously bad customer service from this place. \n\nThe customer service - If the customer service was better, I would have thought about going back. But not now. Thanks for making my experience and my friend's experience really bad.  We had to go to another restaurant which was amazing. Sunday was redeemed. \n\nI would not recommend this place at all. Not worth the price and the service is bad. I usually don't even write bad reviews, but this warranted it.", "author": "Gypsy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "My new favorite restaurant! The Malaysian Comfort Stew is amazing, and the service is always great.", "author": "Paula C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-07", "description": "I don't understand the hype.  I had literally the WORST Pad Thai ever when I ordered from here.  I was excited to order from Wild Ginger, but immensely disappointed by the food I received.  Never again.", "author": "Rebecca E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-23", "description": "On a rainy Friday evening, when all the trains were FUBAR* it took me half an hour to get from Canal Street to Pacific Street (that's about triple the ETA, MTA). After meeting with my friend, we realized with her iPhone map that we had a ways to walk to Wild Ginger in Cobble Hill.\n\nBut it was worth it.\n\nWatercress Salad -- described as the \"mineral-rich queens of greens,\" this salad came with avocado, some sprouts, and a sesame/peanut butter dressing. It was so-so, but would've been better with more salad dressing to counterbalance the natural bitterness of the watercress. That would be my problem, not Wild Ginger's.\n\nScallion pancakes -- came with mango salsa; i was preoccupied with my salad, but it came in a pizza form. Decent, light, my friend ate most of it.\n\nWe split the Fisherman's Vegetable Protein Main Dish, which came with an assortment of sauteed mushrooms, asparagus, sugar snap peas, and fake shrimp, that actually tasted like Shrimp. I'm allergic to shellfish, so eating this, without the ugly side-effects was a Plus.\n\nFor dessert, we said \"Why not?\" and split the Peanut Butter Bomb vegan chocolate cake. It was Huge. This is a huge lesson in vegan treats I should always adhere to: avoid after eating a nice big meal, because these things are HEAVY. At the end, I thought \"Why?\"\n\nService was spot-on. My friend was even courteously invited to charge her blackberry and iphone on their outlet. \n\nWIll definitely come back.", "author": "Kendra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-26", "description": "Be prepared to drop some serious coin when you eat here.  Just doesn't seem right for Vegan food. \n\nIn any case,  I would highly recommend the Black Pepper Seitan.  Also got the bimbimbap and I would probably never get that again.  Their mango lassi was uber thick!  had to water it down with water.  \n\nWill probably to return to see what their veggie samosas are all about.  Who knows, maybe my rating might change then?", "author": "Iris Corine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-19", "description": "I find the best vegetarian food is cooked by people who specialize in it, and Wild Ginger is a shining example. They've got a diverse selection of veggie dishes with strong flavors and great textures. \n\nWe've ordered delivery from their LES location before but this was our first time dining in. The service was excellent -- kind and gracious and speedy. We were a group of four and they turned all of our orders into family-style dishes and also tossed in two miso soups gratis (only two of us ordered dishes that came with soup).\n\nWe shared the spring rolls and the samosas, two very tasty and light appetizers, as well as the mango and spinach salads, both of which were really fresh and flavored well. \n\nThe Malaysian Curry Stew was awesome. The seitan is perfectly prepared, the coconut curry is so flavorful, and the pumpkin and potatoes were cooked just right, firm but not tough. \n\nWe also split the Yaki Udon -- really amazing flavors and also excellently cooked, and the tofu teriyaki (strips of tofu filet with broccoli spears in teriyaki sauce, over a bed of bean-sprouts and onions) -- so fresh!\n\nGrab some dessert too. The green tea ice cream has such a strong flavor while remaining really sweet and creamy and delicious. The soy-based mint chip ice cream was excellent too.", "author": "Nico P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "Tried some new things from the menu when ordering takeout with my boyfriend (the tofu skin wraps - crispy, sweet dipping sauce, very good) and the cold noodles (also very good).", "author": "Siv L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "Simply amazing vegetarian food. I don't have enough words to describe how awesome my meal was at Wild Ginger!!!", "author": "Arlo T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-06", "description": "The only memorable thing about my experience here was the piss I took before leaving the restaurant. The scallion pancake was the only edible thing.", "author": "Uri T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "My boyfriend and I visited Wild Ginger for the first time last night and had a fabulous experience. The decor and ambience is really great. Lots of bamboo and soft lighting. Very romantic! The music was also top notch. It ranged from Malian music, to delta blues, to the Vivian girls. Good mix!\n\nThe food itself was piping hot and tasted super fresh. We tried the fried tofu skins for an appetizer which was a pretty hefty amount of food. I could eat that and a miso soup and be full! The flavors in all the dishes are amazing and nothing was bland. We had the Jap-chae noodles and the Singapore style Mei-fun. Both were flavorful and they give you a good amount. We had leftovers to take home. \n\nThe service was great. The waiters are all really nice and attentive. The food came out fast, too.\n\nOverall, a great experience. Would recommend to vegans and non-vegans a like. My boyfriend and I aren't vegan, but still really enjoyed the food and will definitely be coming back!", "author": "Jenny B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "I'm a very adventurous eater, but when I'm hungry and looking for a great place to eat, a vegan restaurant is never at the top of my list. After my meal at Wild Ginger last weekend, it moved up a few notches - or ten.\n\nWe arrived at the restaurant for our reservation, and were greeted by the host as if he received telepathic messages that we were about to cross the threshold. Another yelper described the decor as peaceful and I have to agree that is the best description. Granted, it was a little empty but the vibe was just right. I was slightly envious of the patrons sitting on the lovely back patio, and kept longingly stealing glances wishing I were as well. \n\nWe opted for the crispy tofu skins, which were remiscient to me of eggrolls, and cooked very well. Of course, anything fried increases its chances of deliciousness but I enjoyed them thoroughly. We also sampled the Seitan Skewers. They were tasty, but I didn't finish them and the satay sauce wasn't like traditional satay, albeit decent.\n\nWent with the Orange Seitan over Broccoli for the main course. I've never really had seitan before but was DELIGHTED to find the consistency much firmer/meatier than tofu. It really did taste like chicken, and the sauce was yummy but they could have scaled back on it a little. \n\nDessert: Pumpkin Cheesecake. How did they do that?!? NO, really - HOW DID THEY DOOOOOOOOO THAT. *heaven* \n\nWait staff was very attentive and EXTREMELY professional and courteous. My experience at Wild Ginger made me hope that vegan restaurants in Boston can provide me with the same nomnom-i-ness.", "author": "Blair M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-07", "description": "3.5 stars\n\nMy boyfriend and I were in major disagreement over what we wanted to eat, but somehow we decided on Wild Ginger after perusing the many other restaurants on Smith.\n\nInterior is very dim, with some tables by the front, booths down the narrow middle, and more seats in the rear.\n\nHe ordered the sweet citrus soy protein ($13, comes with a bowl of rice and soup/salad), and I ordered the jap chae ($11). The soy protein sounded extremely unappetizing but was surprisingly good and meat-like. The jap chae was okay (noodles cooked longer than I prefer), and included fish cake things that were extremely.. fish cake-y? No idea how these crazy vegans make it feel so real, but it really was impressive.\n\nOverall, food is good (especially for vegan food) though slightly more than I'd like to pay.. good thing I have a boy to take care of that kinda stuff for me (jk! sorta..) :)", "author": "Alice C."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}