{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "All our food was amazing, especially the black pepper seitan. I was previously a regular at the another restaurant (I probably can't mention the name but it's on W 4th) but stopped going there because the level of service dwindled ever so slowly to completely below par. The service here was amazing. Our server had multiple tables including one very large party and still he almost magically appeared every single time we needed something. Excellent new find! We will most definitely be returning.", "author": "Jamie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-21", "description": "I did not order a full meal when I went to Wild Ginger but the pumpkin soup I go was good. I hope to go back again. The items on the menu looked good.", "author": "Jenn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-13", "description": "I love finding yummy vegan food, and this was no exception.\nOur waiter made superb recommendations.\nThe food was wonderful and filling.\nGo here when you're hungry!", "author": "Adrianne E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "My wife and I have eaten here more than a dozen times and never had anything but the best experience.  Other than this restaurant, I'm not typically into vegetarian/vegan food, but they've convinced me that it can be made to satisfy any taste. The black pepper seitan, curry puffs, pumpkin soup and the bi bim bap are the best things on the menu, especially the latter. \n\nThe restaurant has a really relaxing, homey ambiance, and the music is always surprisingly eclectic and high quality. I would recommend dining in, as opposed to take out/delivery, just because of the great feel this place has. However, we've also ordered delivery several times and they went way out of their way to correct a small mistake in our order.\n\nIt took us several years of living in the neighborhood before we stopped in here, just because there are so many other options. Now that we've found it though, we're there all the time.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-17", "description": "WARNING: NOT ALL VEGAN!\n\nWith the name \"Wild Ginger Pan-Asian Vegan Cafe,\" as advertised on their website, and, since the front page of the website also touts \"Our menu is 100% vegan - no meat, eggs, or dairy products used,\" I expected the food to be all vegan. After ordering online tonight from the Brooklyn location, my food arrived with a menu revealing that a few items, including one I had ordered, have whey; again this information differs from the menu listed on their website, not to mention their name.  \n\nWhen I called to double-check, the woman who answered told me the item did have whey AND was vegan... troubling.  I insisted that whey was not vegan, and, after consulting someone else at the restaurant, she apologized and admitted the mistake.\n\nThe food really is good and MOSTLY vegan... but I feel ok speaking for vegans and taking issue with any restaurant labeling their establishment as vegan, expressly claiming such on their homepage, and then having menu items that are not.  Also annoying that there was no warning on Seamless (online ordering) that the items contained dairy.\n\nSo, enjoy, but know that some items DO CONTAIN DAIRY.", "author": "Holly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-17", "description": "I'm not vegan but consider myself an equal opportunity eater.  Usually that means I'm willing to eat strange parts of animals, but last night it meant I was wiling to eat at a vegan restaurant with a friend who is vegan.\n\nI have to say, it was good!  We started with the crispy soy protein served with a sweet and sour sauce.  My friend who is vegan said it took her back to eating chicken Mcnuggets at McDonalds.  It actually tasted like a chicken nugget, a good one.  It was kind of scary.  I had the black pepper seitan served over thinly sliced Chinese broccoli.  Whatever they use as the pretend meat was juicy and had the texture of chicken but still tasted like soy.  It was great.  I love Chinese broccoli, so I already had a bias for this dish.  My friend got the Malaysian curry stew made with an assortment of vegetables including pumpkin in a coconut sauce.  She didn't seem to be a fan of the faux meat, which meant I got to eat it!  She really enjoyed the vegetables though.  All the main entrees were served with brown rice.\n\nI'd go back the next time someone wants to go, but on my own, I'd probably pay $20 to eat somewhere else with my law school budget.  I don't get to eat out much as it is and don't eat much meat now that I'm living off of loans (as in, I only eat meat a couple of times of a week if that) so when I go out, I like to eat a little meat.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-24", "description": "I am a true blue carnivore who's fallen for a vegetarian. Yes, this means that although I used to scoff at vegan food joints as I walked to get my Argentinian skirt steak, I've been finding myself in more veggie restaurants than ever before. \n\nLike most yelpers out there, I love to eat, so I have been happily embracing the adventure of trying new restaurants. Plus every now and again, it's nice to go to places where both of us will be able eat anything and everything on the menu. \n\nSo we were very happy to have happened upon Wild Ginger the other night after playing big buck hunter at Angry Wades. (After slaughtering 32 animated bison, eating vegetarian was simply the right thing to do.)\n\nThe ambiance was lovely, dimly lit, and mellow. The house white wine was $5! and I ordered the bi bim bap which came with a pumpkin soup. I never knew pumpkin soup could be so light and tasty! I was a huge fan and the bi bim bap was damn tasty and filling, too.\n\nMy veggie companion ordered seitan in a spicy orange sauce which was reminiscent of sweet and sour chicken. The seitan pieces were nice and crispy and sweet. Yum!\n\nOh, I still love the skirt steak at Coco Roco, but I'd go seitanic at Wild Ginger any day of the week.", "author": "Kara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "My first experience at Wild Ginger in Brooklyn was a fine one. My mom and I stumbled upon this Vegan restaurant while visiting the area. \nOur waiter was very polite and courteous, which made up for the host who sat us. I don't even think he said, hello. If he did, we both didn't hear him. Ehh, maybe he was just having a bad day.\n\nMoving ahead to the food. Yum! \nWe began with the King Oyster Mushroom appetizer. This dish was delicious and they gave us a generous helping. The mushrooms are fried so if you're watching your waistline, beware! ;-)  There are just a few though, so you'll be ok. (A motto of mine lol)\nThen we each moved on to a bowl of pumpkin soup. This soup was outrageous!!!\nI can't wait to have it again. When I revisit, I may even take some to go to have later in the week. It was not a puree like I had expected. A must try!\nThen (nope, we're not done yet)  mom and I split the General Tsao's Soy Protein. I really enjoyed it, however if you haven't had soy protein before the \"meat\" of the meal may take some getting to used to. It reminds me of a chicken nugget minus the chicken. I recommend it though to my veggie friends.\nIt's been about 6 years since I've eaten meat last, so it was a lovely surprise to feel like I was eating the real thing. It was truly satisfying. And finally we had a side order of kimichee. It was my first time eating this spicy dish...ooooh but I liked it.\n\nSo, overall the food was great, the helpings were generous (we took leftovers home)and the decor was fitting.\nMy only complaints: the grumpy pants man at the door and the iced mint tea, it needed to be seeped longer, it was terribly weak.", "author": "Audrey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "As a general rule, your waiter shouldn't say, \"I'm confused...\" when serving you. He really shouldn't say it multiple times. But he was nice and got everything right, so I couldn't get angry at him.\n\nRegardless of the very confused waiter, the food was pretty great. They run a lunch special until 3 pm, and it's even valid on the weekends. That gives you miso soup, a delicious spring roll, and your entree. The soba noodle deal is good, but it has a little too much sesame. The curry stew is also great. The portions are filling, and the flavors are good enough to satisfy vegetarians, vegans, and meat-eaters alike.", "author": "Jess H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Still discovering various vegan dishes so far best place i've been to. The Jap-Chae was great the noodles were slippery and savory. The mango avocado rolls and green tea noodles were excellent as well. Very first intro to Seitan nice surprise great atmosphere speedy service as well will be back soon.", "author": "Prentiss C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-01", "description": "Food was great, however, the manager was HORRIBLE. He told us where to stand when we first arrived and had the personality of a fly. Your product can only get you so far. Service needs to be top notch, especially in the neighborhood you are located.\n\nLastly, please do not instruct me how to tip. 15% is for good service. Approaching me after spending $200.00 and telling me that I should give an extra 3% is an insult. You are lucky I did not ask for the whole tip back. This is directed at the manager as he approached me. It was completely improper and that one action will result in me never going to this restuarant again. Tipping is up to the customer not the manager!", "author": "Melanie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-01", "description": "nice cool place to have good food with good friends. Can't complain. It's a vegetarians haven :)", "author": "Kathryn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-07", "description": "I always go in here with those restaurant.com gift certificates that I buy on sale, which probably annoys them like crazy, but they never let it show. This is a great vegetarian/vegan-friendly generic Asian food. \n\nWe always get the age tofu appetizer and a bottle of house white wine, and they're both delicious. I love that lightly fried tofu so much, I would eat it every day for each meal, if I could get away with it. \n\nI've had the shredded tofu appetizer, which is better than it sounds. It's delicious. It's light and fresh-tasting while still being flavorful and filling. I also love the udon noodle soup, though my normally adequate chopstick skills always get put to the test when I get this (and they usually fail... but that's okay). The noodles are chewy and fat, and the broth is yummy without being too salty. My boyfriend likes the Bi Bim Bop and most of the food that sounds spicy enough to make my eyes water just thinking about it. I've never been disappointed by the food, even a little. \n\nThe service is always friendly, if tough to get a hold of when they're busy. I've been in there when it's empty and when it's packed, and the waitstaff is always courteous and accurate. We usually end up waving them down for water and whatever, but they never seem to mind the interruption. \n\nAll around, it's a great place, and I always look forward to going there. If only they delivered all the way to Park Slope...", "author": "Shannon M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-03", "description": "Considering I am not a vegan, I was nicely surprised by how much I enjoyed the food (although I must say, for vegan food, it bloats me just as much as other foods if not more). \n\nI didn't really even bother to read the concoction that they use to create the \"meats\" but we had several dishes (one that was untouched was miso soup because well, it's vegan).\n\nLettuce wraps were pretty refreshing, the sweetness of ingredients like the corn and the gloppy brown sauce was decent. What really threw me for a loop was the \"beef\" with chinese broccoli which had a nice texture and an admirable effort. It could have been a little more flavorful with maybe some salt. \n\nThe place itself is very calming, it's dark and feels pretty gentle, and overall, for a Saturday night, was just kind of quiet with conversation. The server was friendly and accommodating. \n\nFor me, if I were to do vegan again, I could definitely consider this, it was a nice little surprise. However, I'm probably not the best judge of vegan food having so little knowledge of it.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-02", "description": "I don't think I've had any dish here that I didn't love. . . my favorites are the miso eggplant appetizer; the seaweed salad; the bean curd with peppers  entree; and the bi bam bop (sp?).\n\nThe decor is calming - BUT the music is not and that would be my only complaint. Way too loud and annoying - I seem to remember a techno-beat more than once. I don't know where restaurants get the idea that people want to dine under these conditions.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-14", "description": "I love this place. Definitely one of my favorite restaurants in NYC.\n\nI recently had a birthday dinner for 18 folks - I was very impressed that they took the reservation and there was a comfortable place for us to sit all together.\n\nYou MUST order to tofu skin appetizer; I also highly recommend the Bi Bim Bop that comes with pumpkin soup. Also the Peanut Butter Bomb dessert (as well as chocolate cheese cake) is to die for.\n\nTwo awkward things happened during dinner which has kept me from giving 5 stars:\n\n1. A guy I'd never seen before wearing a plaid shirt kept walking by and staring at the table. When he leaned in I freaked out because it looked like he was going to snatch my phone; in reality he was taking away some dirty dishes; apparently he was a manager just trying to help. \n2. I ordered a beer with my meal and it never came. When I asked the waitress about it, she was completely unapologetic. She claimed she'd brought it out and yelled across the table \"Sapporo? Sapporo?\" with no answer. I got it eventually, but it was unfortunate that she couldn't just have been cool: \"Ahah! That was you - let me bring it to you now.\"\n\nThe decor, music and general vibe make it quite a classy place. Those friends of mine who don't eat meat definitely were satisfied with the options. Try it!", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Walked in on a Tuesday night. We were seated right away and service was very fast throughout. The venue is cute- modern Asian feel. I got one of the specialty iced drinks which was good and a few appetizers (spring rolls and vegetable dumplings), both were really good. My husband had one of the noodle/soup bowls and liked it. Really nothing bad to say about this place, nice venue, fast service, good food.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "The decor is little dated I feel but honestly its a neighborhood restaurant so not expecting much. The food is some of the best vegan food I have ever had. I really enjoy their creativity of flavors and everything I had here has been spiced/seasoned just right. Problem with a lots of Asian vegan food is that they can go overboard on the salt. I think the choice of dishes are really interesting (or at least I haven't I had them elsewhere) It has been quiet at the times I have visited so I have always had good service. Overall a good find!", "author": "Sushma A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "I was a vegetarian for a number of years, and I'm still a girl who would rather eat tofu than steak (or chicken or pork or whathaveyou).  That said, I'm wary of places that serve faux meat.  My squeamishness with the entire idea of faux meat* aside, faux meat is more often than not served up tasteless and kind of rubbery.\n\nThankfully, that is not the case at Wild Ginger.  I chose the mango soy protein, and the soy protein was juicy and tender with a good flavor.  It was in a mango-plum sauce and sitting atop slices of mango, asparagus, zucchini, peppers and onions.  All of the vegetables were crisp-tender, just the way I like them, and my dish came with brown rice.  The boyfriend had the lettuce wraps, and both of our dishes came with miso soup.  (We had the option of choosing green salad, but we were cold.  It was definitely a soup kind of night.)  The miso soup was good; it wasn't over-salted as miso soup can so often be.\n\nWe had less than desirable seats -- we were seated in what seemed to be the entryway, but the restaurant was crowded, and I appreciated those seats over having no seats at all.  Oh, and our plates came garnished with flowers, which I just love!  \n\n* I don't think serving faux meat serves anyone very well: it reinforces the idea of the Standard American Diet that we must have a hunk of meat on our plates, it doesn't convince dedicated carnivores to eat vegetarian protein because it's not a convincing substitute for meat, and it's disconcerting to (many) vegetarians to be faced with a menu full of names of animal parts.  (For the record, Wild Ginger is not one of those places that refers to its faux meat as \"soy chicken\" or \"chik'n.\")", "author": "Kathleen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-12", "description": "I went to that restaurant b'coz it is said they had the best pumkin soup in the town. I tried the soup, it was not as what I imagined.\n\nHowever, the salad there was a delicious surprise. They added some ginger in it and it tasted very special.", "author": "Kejia Y."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}