{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "Great Asian vegan spot. Will definitely be going again. The Bibimbap was so good. Loved the sauces on the side, really added some kick+sweetness. The Mango Soy Protein Lunch special was awesome!", "author": "Jagjit S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "Fantastic! I order from here all the time for lunch. I've never been disappointed by the quality of items delivered, and they have a decent array to choose from to keep you from getting bored. The teriyaki seitan over snowpeas is my favorite so far, but looking forward to trying more.", "author": "Jonathan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "Absolutely no complaints! We got 3 apps, 2 dinners and dessert. Everything was prepared wonderfully, had great flavor and at a good price! Would love to go back. The menu was interesting but had classic dishes as well. The server was friendly, helpful and didnt rush us. Great ambiance.", "author": "Amy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "One of my favorite vegan restaurants in the city. I recommend their house bipimbop \u0026 their Malaysian curry stew. Their desserts are also delicious. Their prices aren't too expensive. And it is a very cozy, pretty and relaxing space.", "author": "Sam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "Fantastic food!!!! My mouth has not been that happy for a long time. Cannot wait to come back. Flavones are just out of this world.", "author": "Itusia J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-29", "description": "Beautiful, relaxing room with really soothing GOOD music. A great place to decompress. With the high-back wooden booths you can almost pretend you are at a resort somewhere. Good place for meetings too because it is so quiet.\n\nLunch special prices are under $10. Regular menu prices are pretty reasonable. Good selection and you won't miss the meat. Portion sizes are generous. Staff is professional, competent , and pleasant.\n\nI had the soba lunch special. It is served with a spring roll \u0026 miso soup. Everything was hot \u0026 fresh. The flavor was OK. But the noodles were drenched in oil. I heard the lemonade was \"the best\" someone had \"ever had\". Perhaps that person is not used to having real lemonade. My drink was made with fresh lemons. But it was amazingly sweet. With all this oil \u0026 sugar I am reminded of why there are fat vegetarians out there.\n\nBut because of all I said at the start, I will come back. Maybe the next selections will be healthier.", "author": "Kim R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "When you are in the mood for a healthy asian vegetarian FRESH meal this is the place to go. I had the Malaysian coconut Curry which was delicious, filled with  squash, broccoli , peppers and soy protein. The main courses come with brown rice and a choice of miso soup or salad. I ordered the ginger salad as I always do, mainly to rate the ginger dressing- which earned a B+ in my opinion.   The fried samosas were a little disappointing, and not worth ordering again.  However the Pumpkin soup is Amazing, anything with pumpkin or squash seems to be top notch!  \n\nEverything here is vegan but my non vegan BF was very happy with his meal- the General Tso's Soy Protein dish.  it's true that the dishes are so well made it is hardly noticeable there is no meat in sight. The Menu is extensive, and the service is very good.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-05", "description": "My boyfriend took me here last night and we both loved it. He ordered the jade plate which consisted of kale and mushroom in garlic sauce. I'm not the biggest fan of mushrooms but it wasn't that bad. I ordered the general tsoy plate which was really good. The spices were hitting the spot! I even took some of my food to go so that I could enjoy it today. I do wish the portions were a little bigger, but I'm definitely coming back !", "author": "A B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-18", "description": "I had a hankering for some Thai food because I know I won't be able to find anything in my new neighborhood at the bottom of Brooklyn.\n\nSo I stopped here. It was not a bad idea at all. I loved the atmosphere. The space was dimly romantically lit and the music was not loud. It's great for a date or just to relax by yourself. I've been to their other location in Williamsburg with my boyfriend and we both enjoyed the food and the interior there, too. \n\nTonight, I ordered the bibim-bap. The pumpkin soup that comes with it is delightfully light with toothsome chunks of pumpkin floating in a sweet flavorful broth. The cilantro with its assertive presence is what made it for me. Bibim-bap came not too long after the soup. It's not a traditional recipe of course but, the vegan version is as good as it'll ever get. Although, the kimchee in it was only so-so. \n\nI'd say if you're feeling really hungry and you want to try something super healthy, go to Wild Ginger and order yourself the bibim-bap. Oh yeah, this restaurant is kosher in case you're wondering.", "author": "Lisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "This place has a nice ambiance, good for a date, or a night with the girls...food is very tasty and the service is good too.  I went before a concert in BK and everything moved quickly and we got to the concert just in time...", "author": "Aida A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-22", "description": "Really Good\n\nI hate vegan/vegetarian food in most instances.  I'm the type the groan internally when a vegan friend suggests it because I'm a huge carnivore, but generally I try to be polite about it and try it out.  This place was a pleasant surprise.  The food was tasty and well put together. Nicely presented too.  The appetizers were particularly good, and I could well see myself going back and just ordering 2 or 3 appetizers in place of a main.  The other 9 people we were with enjoyed their food immensely too.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-25", "description": "I really enjoyed the food at this restaurant, and they also had fabulous service. I have a wealth of dietary restrictions, and instead of being annoyed, the person helping us went out of his way to make excellent suggestions. Usually this means sweet and sour sauce, stemmed vegetables, and brown rice, but the kitchen was extremely creative, and ended up serving a really excellent spicy sauce made of ginger and scallions. Everyone was just very nice, and the food was great and quite inexpensive. They also have an excellent, appropriately-sized lunch special. \n\nI saw Jason Schwartzman here once. I didn't say anything because no one likes that person. That doesn't earn it a star or anything, but I thought it was at least worth mentioning for some reason.\n\nI also like the franchise in Manhattan. It's a solid place all around.", "author": "Lucy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-14", "description": "Food was good but not as flavorful as other Asian vegetarian cuisine in NYC.  The yaki soba was not yaki soba - the soba was boiled, not fried soba noodles like true Yaki soba.  The bi-bamp-bim was supposedly over coconut rice, but the rice lacked any coconut flavor.  The food was good and reasonably priced, but somewhat of a flavor disappointment. Atmosphere and service were very good.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-05", "description": "We were wandering around the neighborhood and decided to go here as the reviews were good. Perhaps we have a much more refined palette than we thought but frankly, Wild Ginger was just okay. For whatever reason, whenever an asian restaurant creates a great ambiance like Wild Ginger, the food always suffers. Either it's really bad or it's just okay. Wild Ginger provides just okay which makes it a little insulting as their pricing is a bit much for just okay.\n\nI probably should've said something when they asked but I guess being asian, myself, I figured no one would listen anyway. It wouldn't take much to elevate the food, organic ingredients and more time to increase the flavor. They already have the presentation down. I just wish the presentation in the food and the decor caused the taste to be better.", "author": "Jenderon T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-19", "description": "I went here recently with my boyfriend. I was scared at first because looking in the windows, it appeared to be closed. However, the front of the restaurant is kept dark, and there's a curtain in front of the door you must pass through to get into the restaurant.\n\nWe were seated by a window. The decor was distinctly asian and the restaurant as a whole had a very nice vibe to it.\n\nWe came for the lunch special, and ordered a starter of curry samosas. The samosas were delicious, and it was the mint chutney that was spicy, not the samosas themselves.\n\nThe miso soup was delicious, as was the coconut rice we had to replace the brown rice. We weren't given raisins with the coconut rice, but it was still yummy, if slightly bland. I wish I had ordered fifty of the spring rolls, they were very good.\n\nMy boyfriend ordered black pepper seitan with Chinese broccoli, and his only complaint (if it's that even) was that seitan is apparently spongy.\n\nI ordered the basil soy protein with zucchini, asparagus, and peppers. This dish was very flavorful, but the soy protein was extremely filling.\n\nI'd like to go there again sometime and order something new. The experience was amazing.\n\nAlso, credit to the very patient, kind waiter we had who was quick on his feet.", "author": "Gabrielle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-17", "description": "Some friends and I were in town for a design conference and wanted a break from all the noise. Walking just around the corner we found this place and instantly the quiet calm of the restaurant was the first thing I noticed. It was a much needed break from everything going on.\n\nWe started with a few appetizers, the edamame and the seaweed salad, both of which were amazing. For the main course I had the pad thai and it was one of the best I've had. It almost had a licorice flavor with the way the basil and the pad thai sauce mixed together. The tofu in the pad thai was seriously my favorite part.\n\nOur waiter couldn't have been better. He was the nicest, most helpful, waiter I've had in a long time. And this coming from someone who was born and raised with southern hospitality. I would go back just to have him as a waiter again, it was that good of service.", "author": "Kyle S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-17", "description": "We were hungry, the menu looked good and there wasn't a wait at 7pm on a Saturday night in Brooklyn.  I now know why.  This place is just so-so.  If you like greasy mediocre thai-like vegetarian food then sure, give this a shot.  But if you are hoping for a tasty, healthy alternative to a meat-lovers place, this is not the spot.  \n\nOur waitress was nice so I didn't have the heart to tell her that it wasn't good, even when she asked us.  She seemed really excited about our appetizer orders and the dessert - which was a vegan chocolate cake from baby cakes.  It was super sweet and though I know it was called \"crumb\" cake, it was kind of hard to eat because it fell apart.  \n\nFor $50 it felt like a waste of money.", "author": "D P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-11", "description": "I love this place so much. I made the subway ride up from Brighton Beach about once  a month now when I visit my friend who lives in the area. I really love that the food is so healthy, delicious, and hearty! \n\nWe always get the BiBamBop with Hot \u0026 Sour Soup. The desert is incredible!!! Peanut Butter Bomb is one of my favorite desserts out there!! SOOO GREAT!", "author": "Brian G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-21", "description": "I am not a vegan but I love to try different types of food.  My friend brought me here (one of her fave places). Most of the dishes are made with seitan or soy protein, neither of which I like.  But I love their miso mushroom soup and the tofu skin wrap appetizer was awesome, especially the spicy dipping sauce. I got the Yaki Udon as my main dish. It was delicious! Very flavorful, although it had tofu.  I'll be back because I love the ambience and they also have a nice selection of organic teas and other Asian drinks I'd like to try.", "author": "Bethany P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "Amazing menu for a vegan place and food is generally better than average.  The place itself is nice and very chill vibe to it.  The waitress was very nice...although sometimes a little too attentive (as she stopped by constantly)...before ordering we told her three times we needed water and she kept stopping by without water.  Basically, it get 4 stars because its hard to pull off good vegan...but service and food could be a tad bit better.", "author": "Chad R."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}