{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "Very nice place, and good food! Romantic atmosphere and good service, they are all very nice. I would recommend it for sure!", "author": "Nicole P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "By far the best and most delicious food ever. My non-Vegan family and friends when I suggest to come here have an aversion simply because there is no \"meat\" on the menu. I eat and love meat too but if its protein and a yummy full feeling you want, then come here!! There's nothing better than a guiltless meal that will leave you feeling oh so nice. This time around I told the waitress I was pregnant and she immediately pointed to an entree (forgot name...something like bimbam) and oh my goodness was it goood. Being pregnant, it can be very difficult to find something I can look at to eat. But apparently the baby loved it too! This place is amazing.", "author": "Leo G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "I absolutely LOVE this place my boyfriend brought me here for Valentine's Day last year since he knew I grew up vegetarian and this restaurant was by far the BEST vegetarian restaurant I ever been too ! Every plate they have is very distinctive and delicious !! I brought my parents here since they are vegetarian and they love it we come here mostly every weekend to have family dinners !", "author": "Bharati C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "The 4 of us ordered the tofu skins, oyster mushrooms and scallion pancakes. The oyster mushrooms were our favorite, with the tofu skins coming in second\n\nFor entrees, we ordered the black pepper seitan, the Korean bim-im-bop which came with a side of pumpkin soup and the eggplant. The Korean bim-im-bop was delicious. It came with a side of sesame and hot sauce. The portion was also huge. The black pepper seitan was the best seitan I've ever had. It came with a side of Chinese broccoli.\n\nFor dessert, we ordered the pumpkin cheesecake and the apple crumble which is shipped in from a vegan bakery. The cheesecake was topped with walnuts and won hands down.\n\nThe interior is cozy and intimate. It was decently packed and would make a good date spot.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "This is my boyfriend's and I go-to restaurant and he's not even vegan! We both love everything on their menu and we are never disappointed. The service is always prompt and the atmosphere is great. We recommend the king-oyster and seitan skewers appetizers and really anything as an entree, they're all good!", "author": "Valerie Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-25", "description": "While all I want to do is support vegan restaurants, I have a few major problems with wild ginger. Asian and vegan is usually a great place to eat at and trouble free for someone who is gluten intolerant. Two servers hadn't a clue about what gluten free is. There was no mention of it on the menu, and they kept talking about soy products not being okay. When even the most uneducated person knows it has nothing to do with soy. Soy sauce yes (because there is WHEAT IN SOY  SAUCE), but soy products, not soy much ;-) they were clueless and I find this rather irritating. I wish they'd pay more attention. But the food we ordered was tasty. We had the jap chae which was delish. And the big miso soup. Not sure if I'll be going back.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "A friend suggested this place for lunch the other day, as we typically stick pretty close to Montague St. establishments and felt like something different.  The decor is very cool - a bit dark and hip with whimsical touches, like the curtains you walk through on the way in.\n\nI had the tofu and vegetables with brown rice, and it was really good.  Lots of vegetables, and not just your standards - I was happy to find delicious lotus root, yum.  The lunch special comes with miso soup, which is okay.  My dining partner had the curry stew, which smelled great.\n\nA lot of things on the menu looked awesome, and I can't wait to come back the next time I need to take a long, peaceful lunch hour.", "author": "Hope M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "I'm not a vegetarian or vegan, but this is one of my favorite places to eat. There is never a wait, and the food is always really solid. I tend to bring people here who don't normally eat vegetarian food and they always find themselves pleasantly surprised. Quiet and pleasant atmosphere, although you could probably bring a big group here if you reserved in advance, and would have no problem. I highly recommend the spring rolls, scallion pancakes, and bbq seitan skewers. For mains, all of the bowls are fantastic.", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "Finding the right Vegan stop to eat is not an easy task.lol Not only is the food phenomenal, It is right around the corner from me.... Awesome!!! The menu is great. The service is humble and inviting and the seating is romantic and private. Deserving of all 5 stars. Please grab a menu before leaving, I did. :)", "author": "Darnell D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-31", "description": "This is, and always will be, one of my favorite places to eat in Brooklyn. 9 times out of 10 when someone asks me where I want to go to eat, it's Wild Ginger. I would gladly eat almost anything on this menu. My favorites are the cheesy wantons, the pad see elw, the avocado smoothie, the peanut butter bomb. I just absolutely love it here.\n\nThe only thing I'm upset about is not eating there right at this moment. Love you guys!", "author": "Charlene O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-24", "description": "Amazing Vegan food.  I mean even if i were not a vegan which im not, id go eat here the food is so awesome.  The spinach dumplings are incredible, the hijiki salad is the best ive ever had..and the curry with pumpkin outragously dlish!  \nI cant understand why it has a B health rating.  The place is meticulously clean and the food comes out piping hot and the service is quick and friendly.  All i know is that this is some of the best food in Brooklyn.  I love it and you will too!", "author": "Susan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Reliably good thai food.\n\nDon't be distracted by the vegan label. This is just good thai food, but better cause it's vegan.  Pick your favorite thai dish and they do it well here. \nMy favorites are the sweet and sour sesame soy protein and jade mushrooms...so many mushrooms.", "author": "Tom K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "Their delicious food is matched by their excellent service and comfortable ambience.", "author": "Oscar J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "i normally avoid fake meats due to general lack of enthusiasm, but the seitan here is amazing delicious, the texture is perfection. the black pepper seitan is so good, i'd rather have it than normal real meat asian food.\n\ni've been here a few times in the past, and have always had solid service and delicious food. everything is always plated nicely, and the space is very clean. happy this place exists.", "author": "X Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "My wife and I dine here at least once a month, and we're not vegan. The food is excellent and very consistent, service always quick and friendly, and the prices very reasonable.\nMake sure to try the Peanut Butter Chocolate \"bomb\" cake for desert, and pair it with ginger tea.", "author": "Morris T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-26", "description": "This is one of my fave Veg-Asian restaurants in NYC - mostly since The Greens closed a few years back.  Alas, unlike The Greens, it's always one of the most expensive. That said, man, the food is so fresh and so good.  My first recommend: the Tofu Skin Wraps appetizer.  Like most of the other items (I've had) it's simple but still kinda complex in ingredients and looks, respectively.  The Curry Momosas are also on point, esp. with the Mint-Chutney dip.  \n\nAs far as the entrees, I've had the Orange Seitan, which is very tasty and filling, as well as the Pad Thai which was pretty good.  The Basil Soy Protein is really good, but I'm impartial to almost anything cooked well in basil.  I would rate this spot higher, despite the price, but both the servers and cashier are kinda lame, and I'm big on service.  It's not so bad though that I'd never go back, so check it out when you can.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "Fresh, delicious, flavorful. Was totally into it, even though I am not vegan. Recommend the veggie curry soy protein and the shiitake soy protein. Will definitely order from here again!", "author": "Zalfa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "Really liked this place. I had the bibimbap and the soy sizzle platter. Both were large portions, filling, and delicious. This is a great place to go if you're trying to eat healthy, but don't want to give up the taste. I'm not vegetarian, but I don't feel like I'm missing out on anything.", "author": "Helen P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-16", "description": "One of the worst meals I've ever had. The coconut cream on the apple pie was disgusting. Tasted like pure coconut oil. The spring rolls were decent but texture was soft and not crispy. The king oyster mushrooms had a nice flavor but the mushroom was tough and chewy. Made it hard to eat so I threw them out. Lastly the sesame noodles were so so gross and awful!!!!!", "author": "Sally P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Gorgeous decor, and excellent service.\n\nIt's just like every other vegan restaurant, same menu and all. I got the black pepper beef - it was good.\n\nThe best part about our meal I would have to say was the samosa appetizers - they were to die for. I wish I had just a whole plate of samosas for my meal. \n\nMy only qualm with vegan joints is: Why is it ALWAYS the same menu, and why so expensive?", "author": "Christine S."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}