{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Neighborhood staple!  I'm a die hard carnivore but I order from here once every couple of weeks.  Basil soy protein with extra protein, scallion pancakes and hot and sour soup are as good as any (meat containing) pan-Asian dishes in the city.  People have always been friendly and the delivery is much faster than Seamless's estimate.  Go!  You will not be disappointed.", "author": "Ech A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-15", "description": "Delicious.  I'm recently vegetarian and try to eat mostly vegan so I have become a regular of this restaurant.  My favorite dishes are Watercress Salad, Bi-Bam Bap, and Malaysian Curry Stew (which is much improved since the first time I ordered it).  Great non-alcholic drinks like Wild Ginger ale and Passion Fruit Ice Tea.  Do not miss the pumpkin cheesecake!  \n\nThe ambiance is relaxing.  The music is always great and Richard, the manager, is a debonair, charming, gem of a human being.", "author": "Pepper P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "I went here with a couple friends and I was totally impressed. We split the age tofu, mango wraps, fried mushrooms, and a couple other appetizers. Everything was so mouthwatering and flavorful, I couldn't believe it was vegan. For desert, I'd recommend the chocolate bundt cake.", "author": "Naomi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-25", "description": "PRETTAY PRETTAY GOOD\nstaff was very nice.\nfood was fresh and delicious. \n\nGeneral tsao was the item of the night.\n\nhot and sour soup YUM\n\nsteamed dumplings - damn good.", "author": "Jose S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "This is the best vegan food restaurant I've ever tried. It's not authentic Asian food, more just Asian inspired, but the dishes are flavorful and satisfying. I'm a big fan of the bibimbap, and the pumpkin soup it comes with is delicious. \nThe black pepper seitan is also extremely good. \n\nI'm not vegan, but I order from here on Seamless regularly. I've also been to the Brooklyn location a couple times and the service is friendly and the atmosphere is casual. Seriously though, I don't even think of this place as a \"vegan restaurant\" because it's interchangeable with any other good restaurant in my mind.", "author": "Zoey F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "The food here is amazing! They have a huge selection and it's all vegan. It is also good for groups with people with different tastes. I was even able to order a dish that was reminiscent of seafood and was quite impressed. However, the service here is not the best. The waiters were a little slow and awkward and then would overly apologize for a mistake. I will certainly come here a lot, but because of the food and not because of the service and atmosphere.", "author": "Emily L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "Best dish : basil ginger soy\nWorst dish : sizzling tofu\nOverall nice atmosphere ..: food pretty good", "author": "A C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-11", "description": "What a find! This place saved my friends and I when we were all hungrover (hungry and hungover) last week. Delicious food, constantly refreshed icey-cold water, and a nice peaceful atmosphere.\n\nAs a vego, I obviously appreciated the extensive menu but all my non-vego friends enjoyed their meals as well. I can recommend the teriyaki seitan, and the miso that came with the lunch special was really tasty. Only criticism is that there was too much ginger in my grapefruit, apple and ginger juice - but hey, it's good for you.\n\nReasonably priced too, particularly at lunch time.10/10 would Wild Ginger again!", "author": "Alexandra P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-12", "description": "It seems this place is under new management, new wait staff, new chef. it used to be good, now keep your distance. The surly waitress asked us to eat our meal quickly so they could seat others, I replied - \"That depends on how quickly you bring it.\" Not quickly it turns out. Then I asked for no broccoli and get a plate full of it - Ms. Too Busy To Be Nice, says - 'Can't you just give it to your Husband?\" I say, 'but I'd like vegetables with my meal.\" She goes back to the kitchen and my meal comes back dripping in a sweet sauce with zucchini, basically ruined. I ask for another plate so I can salvage a few lone pieces of soy protein from Monsanto's sugar rush, but I don't get it. Put the sauce on a napkin, NO ONE comes to ask me anything, to clean the mess or to offer condolences. AVOID THIS PLACE.", "author": "Lucia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "Twice. Eaten take out from here twice and finally feel comfortable raving about the food!\n\nBest is the orange seitan, sizzling savory and full of zesty orange flavor. Im a poultry eater, and this tastes very much like meat, and is delicious.\n\nAlso, the Miso Eggplant, seriously the most amazing preparating of egglant ive ever tasted.", "author": "Pan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Obsessed. Everything on the menu is to die for- and this is coming from a major meat eater. Really romantic date spot, too!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-28", "description": "Dinner here on 19 November. Pretty tasty dishes but a bit bland. General Tsao soy and brocolli needed more spice. Service was a bit rushed and disorganized.", "author": "Philip S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "This is my faaavorite hangout. The food here is incredible, I come here with friends and order even just a bunch of starters and then dessert for a fun evening hangout session with the gals. I come here and order a full blown lunch when I can grab my sister for an hour or two midday. I come here on date night with my fiancé and enjoy a delicious dinner. I'll be coming here on a daddy-daughter date my father and I are planning for the night before my wedding. The food is great, the water is great, the service is even better, the atmosphere is cool and authentic. Love love love!!", "author": "Sarah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "Peanut Butter Bomb Cake is THE best dessert I have ever had. \n\nThat being said, I've never been inside but I used to order from them regularly. It was a $10 minimum but all I wanted was that cake. It's a rich chocolate cake with layers of whipped peanut butter cream. Skip the pad-thai (it's not very good here), bypass all the other funky vegetarian options (unless, that's your thing), and head straight for the dessert. Nothing else like it. I moved out of Brooklyn Heights and I still dream about that peanut butter bomb cake.", "author": "Nina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "Really good, really healthy. My partner and I live out of town but would definitely go back if we lived in Brooklyn - I wish we had a place like this in Pittsburgh.", "author": "Bill W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "Everything I've had is delicious. I work nearby and ordered many times since there are very limited vegan options besides salads near by. The brownie is amazing. Best vegan brownie I've ever had.", "author": "Cariane F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-15", "description": "To all the vegans who have a carrot stick up their butts about the faux meats, get over it. This place offers the best choices of vegan Asian dishes bar none! I travel in from Connecticut to visit my mom in Brooklyn and make it my point to dine in this great restaurant. The waiters are always helpful and extremely friendly and will suggest dishes to those who are not very familiar with the abundance of yummy vegan choices on their menu. \nSave room for dessert, they will not disappoint in that department either. \n\nBy the way I am a vegan and have been for many years, many of my fellow vegans unfortunately have to bitch about something and for some \nreason the \"faux\" meats are not politically correct,,,oh well, eat somewhere else!", "author": "Mia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "This is the sister restaurant to Dao Palate which I love.  I ordered mushroom Miso soup and Pad Tai. The Pad Tai here was spicier than it was in Dao palate but it was a good thing not a bad thing. Just different. The mushrooms in the Miso soup were also different, I liked the mushrooms Dao Palate used. The decor is nice, the staff was attentive, place is clean and has outdoor seating in the back. They have an \"A\" rating from the health department. No complaints, good vegan food!", "author": "Matt F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "I am not vegan nor vegetarian and this place is delicious \u0026 filling!! We got a wide range of food, from starters to entrees \u0026 everything was SO GOOD!! I was stuffed by the end of our experience! Also, unlike other comments listed, the wait staff for us was amazing, very friendly \u0026 helpful in recommending great options. A must when in NYC!", "author": "Chanelle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "I have had take out and sit down dining in this restaurant. Everything is delicious. I personally love the Sweet-Citrus Soy Protein but I have had lots of other stuff too and enjoyed it every time. I live in Carroll Gardens and the delivery is always super fast (under 30 minutes). \n\nI have only dined in once. The atmosphere is very relaxing and calming. One thing I noticed is that whenever the waiter brought something for one person he would bring it for the other as well. For example, a spoon or an extra tea cup to share, I thought it was a nice touch.\n\nAlso, make sure to try the peanut butter bomb dessert...because it is so so so delicious!", "author": "Adina D."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}