{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Unbelievable. Delivered in 15 minutes, fresh. Smoked Seitan was better than nearly any real smoked meat you can get. Love this place.", "author": "Patrick F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Kale and avocado bowl was fantastic...spot on. First time to the city and couldn't be more pleased by this place. Server was super attentive, friendly and gave our group great suggestions. Ambience and the music playing were both fitting and enjoyable", "author": "Nicole D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "I did take out on this trip. Not my favorite vegan spot. Not sure if I'm returning. But the Roasted Banana Walnut Ice Cream made almost  every other qualm disappear. So creamy and delicious. I've had aleast six of the apps at this point \u0026 if I am pressed to choose here, then: the vegan ice cream and mango avocado roll. The dishes here seemed to be more plant based which may be important for you. I just care about taste. Nice place. Super friendly staff. Ok, food.", "author": "Me 2."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Ok first off, their Pumpkin soup is bomb and super filling. Like whoa I wasn't expecting to even try it but it came with the House Bi Bim Bap, featured in the pictures and it was delicious. The bowl I got was great as well, however I did not eat the soy/wheat meat it was not good no flavor and looked like it was cold and chewy. But literally everything else in the bowl was tasty. I also ordered a small Green Jasmine tea, very yummy and it's served in a cute kettle with small cup all to yourself. I had about 7 cups from the small, and there was more tea in the kettle. Very happy about that decision. The only disappointment was the fake meat...the atmosphere was cool, I went there by myself, I was starving and wanted something healthy. It was quiet and the servers weren't that friendly but they weren't rude. Just regular service. I would recommend this spot for Veggies or vegans or someone wanting to try a different type of Asian.", "author": "Brittany M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "The place rocks. We went on a Sunday and enjoyed it so much. We got a pot of tea after our delicious meal. It was a nice touch. The black pepper dish was great. The server says it was her favorite too.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "I dined here on a Tuesday night and was seated right away. It's a cute little spot that's warm, and comfortable. The staff are friendly and attentive. I'm not vegan but my friend just recently became vegan so I was being supportive. We ordered the crispy soy protein, pumpkin soup and bibimbop. The crispy soy protein was alright in my opinion. I feel like it lacked flavor. The pumpkin soup and the bibimbop, however, were to die for. It was so unbelievably good, I finished every last drop of my soup and every last bite of my bibimbop. I would definitely come back to explore other dishes on the menu.", "author": "Jessica A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "This restaurant has an extensive all-vegan menu. The food is excellent. The service is decent. There is an outside seating area. Good beer and wine choices.", "author": "Gráinne O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "I love this place - all asian/vegan spot with a friendly staff, comfy booths and seats, and lovely decor. Also they always play Mazzy Star and I'm a fan :) I've had several things on the menu and never been disappointed. If you're veg, you'll love it.", "author": "Abeer H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-27", "description": "Ordered delivery - the food was vile and the delivery man attempted to charge me cash after I had already paid by card (and got very angry when his scheme didn't work).\n\nThe food was rubbery and tasteless - and the dishes we ordered (the general tso and the bibimbap) reminded me of 10-20 years ago when vegan 'meats' tasted and looked like a used shoe insert. Restaurants like this make us vegans look really bad. Two thumbs down.\n\nThere are significantly better options in Brooklyn.", "author": "Sil L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-12", "description": "Get your shit together, LuAnne. Figure out when you're open and be open. Use your signs properly, update your yelp with your new hours.\n\nIt's not hard. People make plans and travel from all over the city, then are let down by you.", "author": "Kris P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "I was a very loyal customer , even before they got a ramp (I'm in a wheelchair) I would order from here all the time , today I called to order a side of veggies and the lady gave me a meal when my dad picked it up (comes with rice and soup more money) so I called to correct the order and the lady was VERY nasty , told me it was my fault she didn't want to fix it and when I said I order here all the time she told me that she never saw me before and that she was not fixing it , I told her my dad was bringing the order back and she hung up on me , I will never be back again. What a shame they really should hire people who aren't going to bully customers", "author": "Bethie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "The serving speed is pretty fast. The waitress put in the order for appetizer right after we ordered. The potion of each dish is good for 2 people to share but not get too full so you can try different dishes.", "author": "Janet K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-17", "description": "I've been here for dinner many times over the last few years, with excellent service and delicious food. Today I went here for lunch with three friends and the service was so bad we couldn't stop laughing. The waitress was almost like the \"soup nazi\" from Seinfeld. So uncaring, unfriendly. She had zero patience. My friend is very visibly 9 months pregnant and had a question about a dish containing sugar since she had diabetes and the waitress said \"I don't have time for questions. I come back when you read the menu again.\" We asked for water 3x. Finally the water arrived and one of the glasses were filthy. I ordered a soup and was brought a salad. The food was practically thrown at us it was pretty hysterical. Food was mediocre at best today.", "author": "Ali H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "I'm nowhere near a vegan (nor do I plan to be), but I absolutely love this restaurant.\n\nI walked in here at around 1pm for my lunch break on a weekday, and the hostess, seeing a book in my hand, asked if I wanted to be seated under the skylight so I could have natural lighting. Talk about notice to detail! \n\nWhen I asked my server what the passion fruit tea consisted of, she immediately somehow knew that I was asking whether or not it was sweetened and addressed my concern right away without me even asking! And when I was conflicted between the passion fruit tea and the passion fruit lemonade, she offered to get me a lemon to drink with my passion fruit tea (since the latter option was sweetened whereas the former was not). \n\nAs for my house bibimbap- wow. I couldn't believe I had paid similar prices to eat mediocre bibimbap at the Korean restaurant just several blocks down when I could have had the one here all this time. It had all my favorite ingredients (i.e. kelp, kimchi, avocado), as well as my not so favorite ingredients (i.e. chickpeas), but the combo worked so well that I didn't even realize I was eating a super healthy bowl. \n\nAnd the complementary pumpkin soup- deeeelicious. I was skeptical of how good the soup would be because korean pumpkin soups had set such a high standard for me, but the one here was quite nice. The stock had a deep flavor to it- I could tell they brewed out onions and other goodies to make the stock taste more complex. And the pumpkins were oh so sweet and soft. \n\nI did spend twice as much on lunch as I would have elsewhere, but it was well worth the money (though I'll probably skip the tea next time). Can't wait for the weekday to come so I can eat here again:)", "author": "Gahee L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Another great vegetarian restaurants!! I actually prefer vegetarian restaurants over the normal \nFrom the recent change to vegetarianism I have found that it's difficult to eat out with friends when you share dishes, as you almost always have to order an additional vegetarian appetizer, side dish to share.  Not wanting to put people out, you put yourself in a precarious position where you either need to share your vegetables (my food!!) or you just leave semi hungry (hobbits second dinner?), so why not try to best of both worlds and eat at vegetarian restaurant instead?  \nThat's what you find at luanns wild ginger, there's great food, you leave full, and you can order all those side dishes your belly and heart desire... \nwhat I have tried...\nBlack pepper seitan, wonderful texture, flavor and you won't even miss the meat.\nSalt pepper king mushrooms, it makes me do the happy dance under the table, enough said.\nGreen tea noodles, flavorful and fresh, it's light with the greens included and makes me want to eat the entire bowl with the rest of my many entrees\nTofu skin wraps, delicious \"healthier\" option of an egg roll\n\nThese are the more memorable items, but everything I have tried has been amazing, waiting for my next opportunity to get here..", "author": "linda y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-08", "description": "Great substitute for Chinese food. I had the sweet and sour protein with brown rice and spring roll. Scallion pancakes with mango is good. Lunch special is like 10 bucks. The pad Thai was a little too dry", "author": "Kiesha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "The Food is amazing,  the ambiance is great and the service is good. I would definitely be coming back to eat here in the near future.", "author": "Sho-out B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "I got the Bbq Seitan \u0026 subbed in broccoli for the sugar snap peas. My wife had the mango avocado rolls (not a fan) but she really liked the dumplings. We'll be back!", "author": "Christopher A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Omfgggg really good vegan food. I had glass noodles with peppers and seitan it was effing incredible!!! Big portions and super delicious! Besides the food the staff was absolutely perfect! Completely attentive but also gave us space to eat and be comfortable. It was a very laid back, relaxed environment-I lost myself in the experience.", "author": "Ariel T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "I have been meaning to come here for a while now.  I was headed to a concert at Barclays center, so it was a perfect opportunity to pop in for some dinner. Upon entering, I was pleasantly surprised at how nice it was in there. For some reason I was under the impression that it was small and cramped.  I had a hot and sour soup mainly because I haven't had one in year since I became and vegan and it used to be my favorite soup.  I was NOT disappointed!! It was so delicious and besides the egg missing, I don't think any carnivore would disagree with me that this tasted legit.  My husband and I shared the green tea noodles which were perfect.  I had the general tsoys seitan nuggets. Mmmm!!! There were so many things I wanted to try, but alas, my stomach can't hold an entire menu of food down in one sitting.  I will be back!", "author": "Tanya P."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}