{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "I have never really been fan of vegan food. I found it sort of bland at times but wow trying some food from here really changed my mind .\n\nI had the scallion pancakes with mango salsa and I'm usually not a fan of fried salty stuff with someone thing like mango but it was a really good mix.\n\nI also tried a \" chicken\" dish I don't recall the name I'll try to remember to later and modify. But it was good came with cucumber and red pepper. \n\nThe food and service here is seriously on point.(y)", "author": "Gabby S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "We had the wontons and dumplings for starters. The wantons have a very \"seaweed\" flavour but I loved them with the dip for the dumplings. Both were very good!\n\nI had the noodle soup with mushrooms, tofu, and seaweed. It was exactly as I expected.\n\nMy partner had the grilled seitan over peas. The strips were very chewy and meaty and it was very savoury. I enjoyed it a lot.\n\nFor dessert we shared a slice of the chocolate bundt cake. You get a big piece so it's definitely good for sharing!\n\nWe had a good time and would come again.", "author": "Stella S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "I am not a vegan myself but if I could eat here for the rest of my life, I feel like I would be. LuAnne's has everything you could want and then some. The \"All-Asian\" part is right. There are dishes from all different cultures - Chinese, Thai, Malasian and beyond. You can't go wrong with anything here!\n\nThe service was great, the food delicious and good size portions. When in the area, I'll be back. The area of Smith Street is really, really cute so I imagine I'll be back very soon.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "Giving this place 1 star only because the food is really good. However the woman working at the desk was extremely rude and unprofessional. When I walked in I asked her where to order- she said right there at the desk. Without asking me if I'm going to stay or take out, she hands me my food in a bag. I told her I'm staying. She got extremely nasty and slammed my food on the table and started to open my bag. I grabbed my food back and left. She yelled and threw her hands up basically telling me to leave. So if you want your money appreciated and good service DONT GO HERE", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-16", "description": "We did an impromptu lunch here one day because the place we originally went to had too much meat (my lunch partner is a vegetarian). \n\nHe ordered the black pepper seitan and I had the eggplant basil with greenbeans.... it comes with a salad or miso soup (we had the salad - the dressing was a bit grainy, but tasty) and the main dish comes with a little veggie egg roll.\n\nEverything was phenomenal and I can't praise the food enough! The only catch was that service after we got our food was a bit slow(er) - we should have mentioned we were in a rush since we had quite a walk back to the office.", "author": "Heather H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Vegan options, while there are making headway, they are still small players, especially in NYC, and even still, very lacking in the outer boroughs. However it's good that a place like LuAnne's is doing good things. Fear not, worrisome vegan, everything here is good to go and tasty. Pull enjoy pad Thai and other great noodle dishes, mains, sides and other great stuff.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "I've been in Brooklyn for a month because of work and I've ordered delivery from here around 98% of the time---when I adventurized elsewhere I regretted it every time. \n\nI've ordered most of the menu and I can honestly say there isn't a single dish I've had that wasn't great. The veggie dumplings, Mekong bowl, and japchae stand out as my favorites, but like I said, I've enjoyed every dish. The delivery is also very reasonable--my food always arrives within 30 minutes. Honestly this is a solid vegan, vegetarian, all-around good food spot. Definitely recommend!", "author": "Maria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "Vegan gf healthy fusion Asian?! Yes please. Had lunch here on a frosty day and enjoyed the casual atmosphere, prompt (but relaxed) service and the GIANT bowl of noodles and veggies! I could hardly Finish it...but I did. Also very reasonable for lunch. Can't wait to go back!", "author": "Sheila Joon O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Yes, Yes, and Yes to this Asian Vegan Oasis! I loved every single bit of my food but the mango sushi rolls were heavenly! I also ordered the scallion pancakes which were surprisingly sweeter than I expected but still very good. \n\nThe interior was dark and low-lit...perfect for a date night with the girl-friend from work. :-) The service was super...the waitress was respectful, attentive, and patient with my friend's food allergy requests. \n\nIf you are planning to try a desert, you must try the pumpkin cheesecake before the menu changes for the season! I was shocked it was completely dairy free; it was delicious!", "author": "Vivian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "By far one of my favorite restaurants. Its really great, staff is nice, and peanut butter bomb cake amazes me every time!", "author": "Annie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "I love to come here for lunch! Affordable lunch special, decent size, delicious food. The black pepper seitan is great savory. And I love to get the shiitake tofu skewers!\n\nCan be a little salty.", "author": "Danny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "All vegan Asian restaurant. I visit every time I'm in Cobble Hill! Huge menu, so many choices! A good selection of gluten free options as well.", "author": "Sonya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "Amazing vegan food! Everything on the menu is vegan, so order away! Service is super friendly, food comes quickly, and ambiance is calm and relaxing. \n\nCurry Samosas $6.50: (6 pieces) Crispy, flaky, and delicious! Comes with a minty chutney dip which gives it a nice kick. \n\nBlack Pepper Seitan $15: Think of this as your vegetarian/vegan beef and broccoli\n\nJap-chae $12: Stir-fried sweet potato noodles with vegetables. Has a hint of spice.", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "Love love love LuAnne's Wild Ginger. One of the best vegan restaurants in Brooklyn. My wife and I took our daughter in law who's a non vegan and our 2 year old grandson out to dinner at Wild Ginger and they loved it!!! Food was on point!! We ordered so much food and ate it all! Service excellent! Everyone was so nice and accommodating. Definitely going back ASAP!!", "author": "Luisa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "I went here twice just to try it, and I've loved my meals both times!! The service is great, the restaurant itself is cute and small, and the food is great. You've got so many options to choose, and I like how they incorporate other Asian cultures like Korean and even a bit of Indian, which I normally don't see in Asian Fusion restaurants. Also, it's all vegan, which is great! For my first time, I had mango soy protein with miso soup. So flavorful and it didn't even feel like I was eating soy. The \"meat\" is pretty accurate, which is creepy but cool. My second time, I had Jap Chae, which also had lots of flavor, and I love noodles. I would totally go back again to try more dishes.", "author": "Sophie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "This is my favorite vegan asian spot, the food is so tasteful and the serving size it just right for your buck.  My favorite is the curry stew with seitan and vegetables.  The atmosphere is cool, although I always grab my food to go.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "Yum! Went to lunch on a nice afternoon. About a 15-20 minute walk from work but worth it. Picked out what I wanted to get (Malaysian Curry and the Peanut butter bomb) before I got there. We were early for lunch so we got a good seat (a booth). Curry was well cooked,  the ladies were attentive and knowledgable. A bit expensive for a regular lunch spot. A great first time visit, will definitely head back.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-16", "description": "Delicious vegetarian food in a lovely setting. Restaurant is very pretty with great atmosphere. Service was okay.\n\nThe food is great and menu is huge so you will always want to come back to try something else. The steamed spinach shumai dumplings are excellent while the scallion pancake was not very good. There was no taste of scallion, the portion was small and it tasted simply like fried dough.\n\nThe bibimbap is amazingly tasty, though. A big bowl of coconut rice topped with a variety of seaweeds, tofu, avocado, chickpeas and sauces. Fantastic and it comes with a cup of great pumpkin soup. A ton of food for $15. I enjoyed it and like leaving full but healthy.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "_ PUMPKIN SOUP\nClear soup, not pureed, with cubes of pumpkin and a tiny sprinkling of cilantro.\nTasty, not salty = good! Proving that soups, and food in general, does not have to be salty to taste good.\n\n_ TOFU SALAD\nVery simple salad: greens, long beet shavings, dressing and a sliced chunk of soft tofu.\nAlthough it was refreshing, I could make it at home and will try the more exciting HIJIKI SALAD next time. (I could also make this at home, but not as quickly.)\n\nNice decor.\nLoving the menu options, will return!", "author": "Grace P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-19", "description": "I went here on a Saturday for late lunch/early dinner. There weren't many other diners, and I was served by two members of the staff.\n\nI ordered steamed vegetable dumplings, which were tasty but not superlative. After that I had the black pepper seitan, which was delicious. The greens underneath were good but a little too al dente. The brown rice on the side had some soft beans, which was a pleasant surprise. My drink was oolong tea served in the most adorable little pot, and they kindly refilled my hot water. For dessert I had the MONSTER chocolate peanut butter bundt cake which I SOMEHOW managed to finish!\n\nOverall, my items arrived in a timely manner, and the staff was friendly and accommodating without being intrusive. I sat for a while after I finished, answering emails, and wasn't bothered or rushed into leaving. I will definitely be back.", "author": "Jean M."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}