{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "I am an avid meat eater and not close to becoming vegan, but this place is fantastic.  I ate dinner here last week and have previously been to the lower Manhattan location.  The food is fresh, delicious, and very clean.  We started with the hot and sour soup which was very flavorful.  The bibimbap was delicious as well - a great assortment of veggies, protein, and sea veggies.  I also loved the general tsao's protein which was a seitan-based dish with a nice orange/brown sauce and broccoli.  The restaurant itself was very quiet and had a pleasant ambiance.  Highly recommend for vegans/vegetarians and meat-eaters alike!", "author": "Joshua L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-08", "description": "placed order via seamless and got confirmation email, waited for one hour before calling the restaurant. the lady on phone told me that my order has never been sent to them, but seamless representative told me a different story. either one of them is a lier, the result is a hungry and angry customer.", "author": "Shijun K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "Still loving this place.  It's my go-to weeknight delivery order.  So quick, service is friendly and the food is delicious!", "author": "S M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-31", "description": "I've been to the one in Williamsburg with friends - which I enjoyed extremely.  Our table was packed with non-vegans, actually we had only one vegetarian on a table of six. However everyone was satisfied with their dishes. Delicious! The watercress \u0026 soy cheese  wontons and the peanut butter bomb were excellent! I love the spices in their dishes as well. And another personal plus - the restaurant in Cobble Hill is just a block away from my apartment! I will become a vegan by default due to the good food and proximity of Wild Ginger =) !!", "author": "Swati R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "how can someone voluntarily stop eating cheese?  i do not know either...but this place is good and it is cheese-less.\ndown with the vegans, up with this place.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-11", "description": "Watercress avocado salad and sesame peanut dressing was delicious.  But the meal I ordered and ate in-house couldn't have been wrapped and served in more layers of unnecessary garbage, headed straight for a landfill that today's poor or future generations will have to live on or near while contending with its impact.  I do wish places would start showing more consciousness and responsibility around that", "author": "Ja T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-29", "description": "Almost gave it a 4 star.  I'm just a tough grader.  I expect to come back here soon and try more things.  This IS your health food (and vegetarian) restaurant.  It's one of those places where you certainly feel better when you walk out of the restaurant.  Everything tasted fine, but nothing blew my mind.  Tons of other good restaurants nearby in this neighborhood.  This is one of the good restaurants.", "author": "Brandon R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-11", "description": "If you want lots of great vegan options in a very pleasant setting and don't mind that many recipes deviate from their traditional Asian origins, this is a terrific option.", "author": "Nathaniel Elijah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "I'm pretty much an anti-Vegan but damn this place is amazing. My best friend is recently a vegan covert so talked me into trying this place out last weekend. My expectations were lower than low but man, everything was so delicious! On the recommendation of our waiter (really sweet and friendly!), I got the General Tso's and it was way better than anything I've gotten from the neighborhood Chinese joints. I've very pathetically been thinking about it all week - it was that good. We also got the scallion pancakes and mushroom appetizers. Everything was delish.", "author": "Becky S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-26", "description": "Great restaurant. I ate here this afternoon for a late lunch. The place was empty and I was a bit concerned. But the good reviews from Yelp gave me comfort.  The reviews were spot on.\nI started with the miso and mushroom soup. Very nice size portion and very tasty. The soup was hot, the mushrooms and tofu fresh, and the broth delicious. \nNext came the salad with ginger dressing.  The greens were crisp and the dressing flavorful.  Nice size portion as well.\nFor my entree, I ordered the stir fried tofu and veggies (snap peas, cauliflower, carrots, lotus fruit, celery, and more).  The tofu was cut thin (1/4\") and in 1\" squares.  All was mixed with a light brown sauce with hints of sesame, garlic, and ginger. After tasting the dish (it was very good) I added some hot sauce.  The veggies were very fresh, not overlooked, and the tofu cooked perfectly (not overdone or hard/dry).  Served with steamed brown rice. My only complaint is the portion was average, not at all like the soup and salad.  Would have been nice to have a bit more, especially since this was the priciest of the items on my menu. But overall very good and at a fair (for NY) price.  \nI will definitely be back!", "author": "Bob D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-19", "description": "This was fantastic. The best Vegan Pan Asian food I've ever eaten. Not greasy, all the sauces didn't taste the same. \n\nI wouldn't get the black pepper seitan though. it wasn't anything special. \nInstead i would go for general tsao's , the sweet and sour sesame, and the spring rolls were AMAZING. \n\nRestaurant.com offers some coupons too, so we splurged on desert. Peanut butter Bomb is good, so is Pumpkin cheesecake, just share it with a friend, its heavy. \n\nThey have these really aromatic teas that were also quite yummy. \n\nGood job!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "This is my go to vegan place since moving to Brooklyn. The food has consistently very good. There is an Asian fusion vegan menu and provides good variety. This makes Wild Ginger a better regular choice than many other vegan places that have shorter menus.  The pumpkin and hot and sour soups are both excellent starters. Mains include several varieties of Asian cuisine. The curry stew and Pad Thai are favorites of mine. They do accommodate special requests. I always ask fro the kitchen to go light on the oil everywhere I go. Here they do it. Many other places only give you lip service and cook as usual.", "author": "Randall M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-15", "description": "It's cool food but everything seems quite bland in its flavors. It's alright", "author": "Omari M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "I dig this place. It has a nice, zen ambiance when you dine in, but I mostly do takeout and they are quick and friendly. I love that it's vegan with tons of interesting options. My sister and I are huge fans of the jade mushrooms--seriously addicting. But I also like the veg dumplings, general tsao's soy protein, and the various salads. I'd skip the Fisherman's protein though. The peanut butter bomb for dessert is amazing. I'd give it five stars except I think it's a tad expensive for what it is.", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "Great variety, all very fresh, well prepared, tasty and satisfying. Nice decor, decent service, ok prices. A good time had by all in my group.", "author": "Sharon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "Great, clean, and good for you food.  I love eating here and getting takeout.  I also like the way I feel after eating from Wild Ginger.  Prices are great, and food is always reliable.  Love this neighborhood go-to.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "Black pepper seitan was so delicious. $14 is kind of pricey, but I want to say that it'll feed two people. It's actually a very big portion. I went in during lunch time and it wasn't busy at all. Pretty much empty. There's a patio, so take advantage of that, especially during the summer.... at least this week's weather! Bathroom is super clean and spacious too, if that was any of your concerns.", "author": "Samantha Sydnie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-22", "description": "General Tsao's Soy Protein is the bomb.\n\nI went with several friends and we also tried an eggplant and string beans dish which was flavorful and cooked to perfection. All the noodle dishes I've tried are great, as are the shumai, summer rolls, and salads.\n\nMost of the chinese restaurants in Cobble/Carroll suck, so this place is not only vegan, it's leaps and bounds better than any other Asian place in the 'hood! \n\nThe beer/wine list is simple but good, and the staff are friendly. Only downside is that it's a little pricey.", "author": "Penny K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "After a long trek through Toronto, Montreal, and Boston, I drove into Brooklyn around 7 and parked. As luck would have it, I parked just down the street from Wild Ginger and by 7:30 my table was full of this delicious Thai vegan fare and a bottle of beer. Yum! If you find yourself in Brooklyn, you'll be happy here too. The Malaysian Curry Stew is especially good.", "author": "C N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-08", "description": "This place is GORGEOUS!\n\nThe husband and I walked over to Wild Ginger on a Thursday night and were shocked to see a well decorated spacious all-vegan cafe in NYC. The huge all wood tables and beautiful lighting are worth the visit alone. \n\nWith tons of faux meat and veggie choices, we were pretty much in love. The shumai were a little squishy for my tastes, but the wontons were amazing. I went for a simple entree; steamed vegetables, and they were cooked perfectly (I refuse to eat over-steamed broccoli). \n\nThe mister had a delicious heaping plate of general tsos faux chicken with more perfectly steamed broccoli (which of course I stole). \n\nThe chunk of Vegan Treats cake we got was a bigger slice than most places, so that was awesome too. \n\nOnly complaint is the overly-sweet ginger dressing on the salad. Can't wait to go back!", "author": "Amy G."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}