{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-16", "description": "This won't help everyone, but a note for folks with celiac/food allergies: I went here months ago and had a long, polite conversation with a not-very-helpful server about gluten-free options and was served a sauceless plate of sweet potato noodles with what turned out to be chunks of pure gluten as the protein. \n\nAfter I took a big bite and realized \"nope, this isn't tofu or tempeh\" and asked what it was, the same server I'd ordered from said \"Oh, yes, that's gluten.\" When I explained that i couldn't eat gluten, they casually brought me a new plate. I got really sick, it sucked, and I'll never go back. \n\nSide note: I totally understand that a lot of people with celiac/food allergies/intolerance annoy servers, and I absolutely get that and try to always be clear, super-friendly, and non-entitled about the whole thing. But if you say you're bringing someone a gluten-free meal and you feed them pure gluten and then seem unconcerned, that's just lousy. If you're good with all the foods, this place is probably awesome, but if you have allergies or similar trouble, I'd avoid it.", "author": "Erin K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "I believe that this a chain of vegan restaurants that are scattered throughout Brooklyn and Manhattan. I've been to the one in Park Slope and the one in Williamsburg. They offer the same assortment of dishes in all of the locations I had been to, but I would say that this particular location looks the nicest.\n\nMy friend and I came here after work last week for dinner. We were seated in a nice, intimiate booth. She chose the pad thai and I chose the pineapple fried rice. My dish was just okay but my friend liked her dish quite a lot. For dessert, she got the peanut butter bomb cake, which is absolutely amazing but incredibly decadent, and I got the chocolate hazelnut ice cream, which was okay.\n\nNot the absolute best vegan food I've had, but the interior is quite nice and if you happen to be in the area and also happen to be craving pan-Asian cuisine with a vegan twist, you should probably stop by here.", "author": "Cinthia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-03", "description": "We started with the mango-avocado rolls; enjoyable but an unexpected set of flavors as you can probably guess by on the combination. I had the Bibimbap and loved it per usual (it's a standard seamless order for me) and my boyfriend had the tofu vegetable sauté, which he said was \"the best tofu he has ever had.\"", "author": "Haven B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-12", "description": "I was hungry and I was in Brooklyn (a rare occurrence), so I searched my bookmarks and decided to check this place out.  \n\nI was too late for the lunch special. Started with the fried vegetable dumplings. Super yummy. They appeared to be full of carrots and cabbage, were nicely seasoned and very crunchy. Typical dipping sauce.  I ate all of them.\n\nThen I had the black pepper seitan. I am not sure why it's called black pepper seitan when I didn't taste even a hint of pepper...the sauce was vaguely sweet, no spice whatsoever.  It was good, but not great. The serving was HUGE and I could only eat half of it. It came over a bed of chinese broccoli with some mushrooms; the veggies were tasty.\n\nThis was my first time eating seitan and I can see now why my steak-loving friend said, \"It's not so bad.\"  It isn't. I usually hate mock meats because of their spongy texture, but this was chewy and the way it was sliced made it look like little beef medallions.  I can rock with it.\n\nFor dessert I had the crispy brownie with a scoop of vanilla soy \"ice cream.\"  I was not impressed with my first bite, but as I got closer to the center of the brownie, it was warmer and tasted more like chocolate.  The ice cream tasted more like coconut than vanilla, but that's cool because I love coconut.\n\nAll that along with a glass of plum wine, and my stomach was pretty happy.  Service was great, but I was the only person there so I don't know if that really counts.  Nobody hovered over me, though, and my water glass was refilled several times.  The bathroom was clean and the decor was gorgeous.  \n\nI'd go back if I ever find myself in Brooklyn again.", "author": "Keisha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "Wild Ginger creates a nice asian experience of vegan food. Their food is pretty tasty- but if you're a vegan health-nut, this may not be the place for you (They have a lot of fried food and heavy sauces). If you don't care if your food is fried or not, then this is a place for you. The black pepper seitan is very tender- it almost resembles a nice cut of roast. General tsaos soy protein is sweet and spicy. Also, if you're staying for dessert- GET THE PEANUTBUTTER BOMB. You will not regret it!!", "author": "Odette K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Love this place. Their bimbimbap is delicious and I'm obsessed with it. Their desert is made with agave. I came here with non vegetarian/ vegan friends and they still loved it.", "author": "Joana F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-04", "description": "A pretty good vegetarian dining experience.  Started with the scallion pancakes and the hot and sour soup, both decent.  The mango salad was uninteresting, and the mango itself didn't taste very good... too green.  The black pepper seitan seemed to be the hit dish, although I also found the Malaysian curry stew quite good as well.\n\nNothing mind blowing but a solid contender on the veg list.  I'd go back.", "author": "Ajay R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Great vegan restaurant. Food is great, delivery is quick and accurate, and they have a cool little backyard for when you dine in and the weather is nice.", "author": "Paul B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-02", "description": "Do not order delivery from this restaurant, they would cheat you. I've ordered the lunch special today around 12:30 pm (prime lunch time), which is standard for asian-cuisine lunch places to include soup, spring roll and rice, which was clearly on the menu and was selected through Seamless. However, I didn't get any of these items to deliver along with the core lunch. First, how can they totally forgot to include something so standard like rice? Secondly, I'd called them about the missing items, the staff talked to the kitchen, which I can clearly overheard the kitchen staff lied that this is non-lunch time special order. No sir, it's clearly on the order and receipt. They totally try to brush me off by asking me to order again in the future, and they will give me the extra items -- which totally sounds like a fake promise. They just simply refuse to just redeliver the missing items. I told the phone staff that I will never ever ordered from this place again. This is also not my first time having bad experience from this place.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "ok il be honest here i've eaten at the soho location quite a few times but have only every ordered from the brooklyn location via seamless. either way the food at both locations is fantastic. im not vegan but this is my go to order spot for dinner. the food is fresh and always delivered so fast. \n\ni highly recommend the hot \u0026 sour soup paired with their soy protein nuggets. on seamless these choices are both listed as appetizers but they give you generous portions that make for a full meal. \n\nYELP TIP: if u are rolling with friends skeptical of vegan restaurants, bring them here and order the soy protein nuggets. they look and taste like real chicken nuggets. BOSS!!", "author": "Shaiyanne D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-10", "description": "I ended up placing an order to-go here before hopping on the subway late one night. I ordered the Aged Tofu Appetizer as well as the Bi Bim Bap! \nI placed the order with the hostess and within a few minutes my order came out and I was on my way home to eat. \nEven after 5 stops on the Subway the food was piping hot for a cold NY night. \nIt so hit the spot and there's plenty left over to feast on tomorrow. \nDelicious, Fresh and Fabulous Service! Thank you LuAnne's Wild Ginger!", "author": "Jeny W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-10", "description": "Sweet, quiet little spot. Amazing menu.\n\nAt the waiter's recommendation, I tried the bi-bam bap, a Korean-style coconut rice bowl with two types of sea weed, avo, chickpeas, spinach, kimchee, mango salsa and tofu (instead of seitan) with kimchee AND the best peanut sauce I've ever had.  Seriously - what was in that sauce? Cumin? Ginger? Honey? I couldn't get it out of my head for days after.  I also got to sample the pumpkin soup as an app.\n\nDef worth checking out.", "author": "Amber K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "I had to consider longer than usual whether to give this restaurant three stars or four stars. You see, all I had here was the Vegetarian Bibimbap. Bibimbap being a dish that a Korean friend of mine would make fun of me for ordering because it is such a simple dish to make. But what can I do, I do love the dish.\n\nI have never had bibimbap with seitan and avocado before, so when I saw that those were ingredients in the dish, I had to order it. Along with seitan and avocado, it also contained green and black seaweed, chick peas, spinach, mango salsa, and kimchi. \n\nI am going to give Wild Ginger four stars here, but do note that it is based on one easy-to-make dish. There's no secret recipe to it, it's just a variety of ingredients mixed with rice and gochujang. But I did appreciate the idea of using seitan, avocado, and mango salsa - that made for a delicious combination.\n\nOn a side note, being that there's not really much of recipe or technique to creating a bowl of bibimbap, would not bibimbap be defined by the ingredients it contains? So if the dish used ingredients that are not part of an array of traditional elements in bibimbap, can you still call it bibimbap?", "author": "Radford T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "I've never been inside of this wonderful vegan place but the food is always cooked thoroughly with delicious seasonings and the portions are larger than most.", "author": "Brittany R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Love this place. The food is consistently delicious and healthy. Attentive wait staff.", "author": "Eve B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "I love this place.  I'm not vegan and fake meats are definitely not my thing, but there are plenty of menu items that don't have \"vegetarian\" chicken or duck or whatever. everything I've had here has been awesome.  My favorite so far? Mu Shu.  The veggies are really well cooked and the tofu strips are not overpowering.  The sauce is great.  The only thing I might suggest would be thinner crepes.\n\nThe Summer Rolls were good, but not great.  I would have like the vegetables and tofu cut thinner and I missed the class noodles usually found in summer rolls.\n\nThey also have really good vegan ice cream (based on coconut milk).", "author": "Greg S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "I'm not a vegan or vegetarian, but when I lived in the neighborhood, I ate here at least twice a week. Now that I'm a bit far away, I do still order delivery on occasion, which seems to get here within seconds of me hanging up the phone.\n\nThe udon noodle soup is a must in the winter months -- with hot sauce if you're feeling under the weather. The peanut butter bomb is a huge mistake because you'll find yourself waking up in the middle of the night NEEDING one more than anything in the world. I've tried most things on the menu, and my repeated repeats are: black pepper seitan (yum!), general tsao's soy protein, mango soy protein, basil soy protein, and the curry samosas or crispy soy protein to start.\n\nThe staff is definitely curt, as many negative reviewers have pointed out. I've been here about a hundred times though, and I don't get the impression that they're being rude as much as they're being overly attentive and efficient. (They're in no hurry to rush you out the door.)", "author": "Renee P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Excellent food, sweet staff. Miso eggplant's my favorite. This place is perfection. It's affordable, extremely tasty, and not unimportant: the music is tranquil and the decor is has a good feel to it.", "author": "Kate H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-12", "description": "Two friends and I stopped by on a Saturday evening for dinner, and we were seated quickly. We chose the place because one of my friends has been trying to be vegetarian for some time now, so we thought we'd give it a shot.\n\nWe split the samosas and the mango scallion pancake for appetizers, and they were fine. Nothing particularly outstanding. For my meal, I had glass noodles with kimchi and seitan and vegetables. It was decent, but nothing that I don't think I could get at any Korean restaurant.\n\nIt has quite a few interesting options for vegetarians (the bibimbap was pretty good, having tasted a little bit), but I don't think it's a place I would go eat at with non-vegetarians; I think I would prefer Blossom over this.", "author": "Dennis J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-15", "description": "We went for a little Valentine's Day lunch here. The food was vegan and it was very nice. The spring roll was very impressive. Cute decor.\n\nJust one server for a slow lunch time hour. The food came very fast. Plus the lunch special prices were reasonable.\n\nAnnoyed with the woman's bathroom door lock. They just need a new lock and fix the mirror decoration, minor things, but yea, I noticed...", "author": "Anikha R."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}