{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "In my (limited) experience, 95% of vegan food that wasn't vegan in the first place (cheeses, meats, cream based soups/sauces, desserts) is pretty disgusting.\n\nLet's face it, there's only so much processing that can be done before it no longer resembles food. Some things are just meant to be non-vegan. Like bacon.\n\nHowever, for the remaining 5%, there's places like Wild Ginger that do it well and do it beautifully. Even my omnivorous self will gladly pass over the questionable takeout places in my neighborhood and go here to get my Chinese food fix. Meat? Don't really miss it with this place.\n\nI'm still amazed that they can make dishes that actually have the taste and texture of chicken and beef. The dishes are fresh and flavorful and depending on the dish, are somewhat healthy! (Sorry, but you can't put a dish of greasy fried carbs in front of me and tell me that's healthy, vegan or not. But at least it'll be delicious.) The hot and sour soup is legit. The soy protein nuggets are a winner, as are the soba noodles. Pretty much a win for dietary restrictions (or lifestyles) all around.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "My entire family loved it!! There are 6 of us so we basically had the entire menu between our drinks, apps, entrées, and desserts. Every dish was exceptionally flavorful and the menu truly catered to everyone's individual preferences. My little sister is very picky, and both of my little brothers love meat- but they all loved Luanne's! (My little brother even thought the General Tsoy's was actual chicken haha). I initially planned to detail everything we got, but honestly everything was a hit so feel free to order anything. However, I do feel the need to specifically push the fudge brownie. I still think they just said it was vegan so we would get it (kidding) because it was insanely moist and chewy on the inside, crispy on the outside, and just overall purely decadent. I almost cried. \n\nAlso, the ambiance of the restaurant is cozy- dimly lit, nice but still casual, with intimate seating. The service was superb (we had a lot of questions), and the music was great. The food came out quickly and somehow there were absolutely no mistakes! Had an amazing time and will definitely return!", "author": "Zari W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "It's been years since I've lived in Brooklyn but I was back visiting for the holidays and wanted to have a healthy lunch in the downtown area near Hoyt. I stopped in around 2pm and was surprised that it wasn't that busy, and I chose a seat near the back patio area.\n\nThe waitress was incredibly friendly and the food was served pretty quickly, which was incredibly. The portions are normal and incredibly filling, which is great. The food was flavorful but definitely not the best vegan food I've had - solidly average and tasty. It was less than $10 for their lunch special, which included miso soup and a veggie roll. A very good deal and wonderful atmosphere overall.", "author": "Morgen B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-29", "description": "The portions got fairly smaller . ... now the dinner looks like a lunch special . Food is still good but they need to portion better", "author": "Tamika C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Jet lagged and needing food- ordered delivery.\nAll excellent! The shumai, cold spinach was so flavorful and delish with the coconut raisin rice. Hot and sour soup to Sooth my tired soul. Had left overs the next day.", "author": "Amanda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "I'm not vegan, but I'm glad I was curious. The house bibimbap was delicious, but the menu said it was supposed to come with soup and it didn't. Regardless, this chain serves up some delicious vegan pan-Asian cuisine and this meat-lover will definitely be back for more.", "author": "Colin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "If you are looking for a great vegan meal - LuAnne's Wild Ginger is great. It is quiet and quaint. I went during lunch time in a Friday and was seated immediately. The wait staff is good. Very friendly. Although this place is know for their Bi-bim -Bap, the waitress suggested Yaki Noodles. OMG!!!! So good.  I definitely recommend this place. You will not be disappointed", "author": "Bertrice L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Came all the way from Long Island to try this place . Two of my friends are vegans/vegetarians. It's a small place but , the food was amazing!! We were all stuff and had no complaints what so ever . Staff is super friendly and great . We recommend the general tsoy and the sweet and sour . The brownie!!!!!! You can't even tell it's vegan. It had to be one of the best brownies I have ever had!! Everything was just perfect", "author": "Doris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "Great asian cuisine. I and my husband are not vegans/vegetarians but found this to be an exciting find. I for one love vegetarian food!!\n\nThe restaurant has a great feel and decor is spot on. The waitress was nice the food came out in a timely manner. The owner was super friemdly and asked if we liked everything.\n\nStarters came out right away which I was very happy about. As for the food, I got as recommended on the reviews I found on yelp. \n\nFor starters we got the dumplings, chose to get them fried which I was hesitant on doing as I am health conscious, but found they were not deeply fried and perfectly crisp and savory. I liked that the sauce on the side it was very light and not thick in consistency at all, more liquidy. We also got the spring rolls they were equally as good and crunchy, fried as well. They were both very nice sides, equally great. \n\nNext we had the black pepper seitan because of all the great reviews! And yes it was the best thing we got. Thumbs up. Get it!\n\nWe also got the bibimbap which we were not crazy about.. The seaweed in there through us off and was not good. It came with the pumpkin soup which had pumpin chunks in it and was sweet. It was pretty good. \n\nThe cheesecake dessert did not like... It tasted like I was eating butter, the consistency was too thick \u0026 intense vs smooth and creamy. \n\nOverall had a great experience looking to expand my horizons and try more stuff on the menu next time. Most definitely coming back!", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Super fresh vegan food with tons and tons of menu options for everyone. Great soups and rice dishes. Affordable prices. \n\nEven non-vegetarians would enjoy the food here!", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "The entire menu is vegetarian. I had the hot and sour soup along with General Tony's Chicken. The soup was delicious. It was spicy enough to satisfy most people. If you really like spicy food then ask them to make it hotter.\n\nThe staff was friendly and efficient. The restaurant was clean. My only complaint is I would have liked to be offered regular utensils in addition to the chopsticks they provided.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "I love this place. I always get exceptional service, I always sit in the same place, and I always get the mango avocado rolls and the noodle salad bowl. \nI am not one of those people who orders the same thing but these two dishes are just spectacular and you can't get anything like it anywhere else. \n\nI've sampled the other appetizers and entrees. Standouts include the samosas, and spring rolls, the curry is great and the vegan desert options are awesome! Vegetarian, Vegan or Meat Lover you will love this place. Especially if you are transitioning. I periodically give up meat for awhile and detox this place helps me get through the first few days. \n\nIt's hard to believe but great tasting, healthy Vegan options are not that hard to find! This spot proves it! The price is right and the lunch specials offer a great deal! Perfectly priced and the food is great! Why haven't you been here yet!? You're tripping!", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Cozy, very friendly personnel. It does not take them too long to prep the food, even when it's busy. My husband and I absolutely LOVE this place. Amazing staff. Amazing food. One girl who works here is so fast and very professional. Their food is vegetarian/vegan and tastes delicious. Definitely a healthy choice. Definitely check this place out.", "author": "Gigi K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-15", "description": "ANTI SEMITIC AND RACIST! Called ahead with a food order (stating we were planning on staying and eating in the restaurant) so that when my friends and I got there it would be ready to eat as we were in a bit of a hurry. When we arrived, the server had misunderstood and packed it to go. We said no problem well just sit and unpack it ourselves its totally fine. The restaurant was maybe half full and there were many open tables. ELMA refused to let us sit and said we had to leave the restaurant. We asked for a manager and ELMA said that no we cannot speak to anyone else and she refused to give us any information. We did not want to cause a scene so we said well just eat in the car, paid for the food and were on our way out when the worker named ELMA turned to another worker and said only Jewish people would try do that. I said excuse me do you have something against Jewish people? She paused and then looks at me and says yes, yes i do. My friends and i just walked right out, not wanting to engage with her anymore. I have been here many many times and will no longer be coming here. Anyone who values kindness and inclusion should bring there business someone else. This is a place of racism and exclusion.", "author": "Elisheva K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Fantastic vegan place in Boerum Hill. Great portions, reasonable prices, pleasant ambient. \nMain dishes are 14-17$, appetizers 5-8$. The meat substitutes are fantastic, truly taste like chicken or beef. The Malaysian stew is probably my favorite. Personnel super nice and attentive.", "author": "Giuseppe T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "Only had LuAnne's via GrubHub but straight fire every time. Food is fast, fresh, and more than reasonably priced. Last time, I thought I'd get slick and order on the way back from JFK. Food showed up 30 minutes early. Whoops!", "author": "Richie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Amazing kosher vegan spot. Intimate and hip. Very reasonably priced with a nice full menu. Great cocktails too. Parking always easy to find.", "author": "Tali K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I'm so excited that this vegan gem has multiple locations. I've been a loyal patron of the soho restaurant and was pleased to see not 1 but 2 other locations in the downtown Brooklyn area. Came here for dinner twice with a friend. Delicious Asian vegan food. Will be back again and again. The house bibimbap and the seitan skewers are my favorites.", "author": "Vanessa Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-19", "description": "Great atmosphere and there are usually tables on weekends, so I will continue to go even though the food leaves much to be desired. Waitstaff has been difficult twice about providing their gluten free menu even though they provided it upon other visits. Most of all, food is generally just okay on the spectrum of vegetarian Asian fusion. Points for having vegan options but minus a few to the waitstaff who gave me a hard time about finding out what they are. I'd recommend going for lunch as their lunch specials are the best value, but please don't order take out. The three time we did it arrived cold and over cooked in its own juices over two hours later.", "author": "Brooklyn L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "Back in the day before the cows got to me, vegan was my chosen food. So LuAnne's was a restaurant I frequented often. \n\nFirst of all I have the say, even though it's downtown Brooklyn, there is always parking available on Smith Street. That's a star in itself. \n\nThe decor is great, with most tables being private and nice classical music in the background. The waitstaff is also very knowledgeable about the foods and drinks they serve. \n\nFood is absolutely phenomenal. I love the black pepper seitan and the teriyaki tofu strips as main dishes. They also have this amazing orange chicken that could totally pass as real. Prices are really decent too. \n\nIf you ever have a vegan friend but you still want to feel like you're eating real food, this is the place to go eat at.", "author": "Rebecca A."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}