{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "\"LuAnne's Wild Ginger\" is an exemplary vegan restaurant including all the nuances that come with a well crafted, thought out, and simplified menu-- Solid A. \nNot only is the staff accommodating, and attentive, but friendly as-well. Their prices are on point (rare!!!!), the quality is superb, seating area is comfortable, and the dishes are healthy. Can't really beat that combo.\nThough I am not the biggest fan of the area, \"Wild Ginger\" certainly make it worth the trip back to Brooklyn Heights. \nMark has had certain questions regarding the specifics on the kosher supervision, but with enough research, Marquis concluded that \"Wild Ginger\" was indeed up to par with his supremely thorough level of supervision (this took some time). Though Mark is a tremendous meat fanatic, he was pleasantly surprised with the excellent level of quality, attentiveness, and prices. He said \"Wild Ginger\" was \"BRILLIANT\".\nThe \"Chosen-'chain'\" (\"Chosen Island/Garden .. ) has this absurdly disgusting practice of harassing the customers for more tip  -- consequently resulting in embarrassment on both sides (though it is obviously much worse for the restaurant, since the customer will most likely never return). It's important to understand that this starts with looking at the tip given before the customer leaves. \"Wild Ginger\" treats the customer with nothing but respect, and has NEVER once taken away the signed check before the customer has left. Also, some (an understatement) restaurants have this ridiculous 'policy' of treating a customer worse than they treat livestock being thrown into a coop: aggressively dictating where the customer can and cannot sit REGARDLESS if the restaurant is empty or not. Again, \"Wild Ginger\" allows the customer to freely choose where they choose to sit (unless, of course the seating is limited). \nI want to begin by mentioning the quality of the rice: skillfully prepared. It's quite humorous that I have to mention this very fact, mainly owing that rice is such an EASY dish to prepare (speaks wonders for the restaurant industry). Both the jasmine rice and brown rice have a pleasant taste and consistency. Portions are sized well.\nIt remains impressive that their lunch menu items have just the right amount of food. \nSmoked Teryaki Seitan w/ sugar snap peas, Black Pepper seitan w/ Chinese broccoli, Sweet \u0026 Sour sesame soy protein, and General Tsoy's protein w/ steamed broccoli (make sure the broccoli isn't dripping with water though) are all fantastic choices that you couldn't go wrong with. \nEven though I don't particularly care for miso soup, \"Wild Ginger\" does it very well.\n\nHIGHLY RECOMMENDED\n4.65/5.00", "author": "David W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-05", "description": "Food is great but service is consistently something left to be desired. Need to train staff better, 1000%.\n\nCalled yesterday, 5/4 at around 6 or 7p, to order pick up. Referencing the seamless website for the 112 smith location the person who answered couldn't be bothered to do her job. Described a dish with pumpkin, ginger and in a bowl, to which she responded \"we don't have that. You're probably looking at the wrong location\". Even though EYE know I wasn't wrong I didn't argue and opted for something else which she again, couldn't place. I said I would call back when I get the names and she just banged the phone on my ear. Clearly didn't call back to order because of how unbothered she was. I went back online and the dish is literally called \"wild ginger macro bowl\" with pumpkin in the description. Learn your menu for crying out loud and figure out a job you don't need your masters in to excel at. Thanks.", "author": "Lola C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-31", "description": "I'm insanely forgiving* when it comes to bad service. You can mess up my order, leave plastic in my soup, pour water on my lap, flatulate in my general direction, hit on my wife, and/or sneeze on my sandwich. \n\nBut Wild Ginger Waiter, if you ever just take away my food before I've finished it again, I will [violence redacted for the innocent]. \n\nGlad that's settled.\n\nThis is a nice little spot on Smith Street. Entirely empty on a Monday night, but that gave us the prime seat in the window so I'm not complaining. We started off with the curry samosas with the mint chutney and the scallion pancakes, topped with a homemade mango salsa. Both were wonderful, as only fried carbs can be. I would order either again in a heartbeat.\n\nFor the main course, we decided on the General Tsao's soy protein, which our server eventually stole. I really can't blame him; it's quite good, and honestly uncanny in its resemblance to actual chicken. If I got to eat people's leftovers, I would be whisking this dish away from every table that ordered it.\n\nAs a complement, we also opted for the cold green tea noodles tossed in a sesame sauce. They were delicious at first, but as I continued eating, they shrank** on me. I'm not sure what you should make of that, except perhaps that they are best shared with a large group.\n\nIf this is vegan food, I'm converting to veganism. At least for the duration of all of my meals at Wild Ginger.\n__________\n\n*At least in part because I waited tables for six years; I realize what awful human beings exist in the dining community, and I'm just trying to even the score.\n**Assuming this is the opposite of growing on me.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "First time trying vegan anything and I absolutely fell in love with the cuisine. The dumplings are delicious, my kimchi pumpkin gumbo was simply amazing, I couldn't get enough. Service was fast, staff nice and professional.", "author": "Vanessa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-22", "description": "I must say.... I like the setting of the restaurant and the environment... I ordered the General Tso soy protein and it was great! My partner ordered the Malayshian curry stew and it was very bland, I wouldn't order that ever again. The service was bad, the waitress Walked around like she had an attitude from the minute we walked in. You can sit where you please which is cool. I prolly wouldn't ever come back to this establishment again, so they should be thankful for my 3 stars.", "author": "Paulie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-21", "description": "I order here alot, good vegan food for an economical pricing!", "author": "Sophia O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-14", "description": "Very cool that the front desk lady was upset with us for being in there a few minutes after 11:30. They are open at noon I guess.\n\nI let her know that happy cow and yelp didn't have the correct hours.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "Okay so this place is clean and really good tasting! I had their bibibap which was very good and fresh tasting. Couldn't finish it all Bc it was huge! Thai iced tea - they use soy milk for milk substitute. I personally would've preferred another type of milk. Samosa (eh... I've had better) over all I did enjoy the food and vibes from this place. I see myself going back w my vegan friends for sure.", "author": "Mira R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "I came here a ways back with some friends who were experimenting with a vegan diet. I was really blown away!\n\nTheir soy protein dishes are good and their seitan dishes are really unique. I ended up coming back here again at another time because it was that good!\n\nIf you're looking for vegan, flavor, and a hearty meal (which is a hard combo to find sometimes) then this is the spot to check out", "author": "Vishal P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-29", "description": "This review is for a recent takeout order - which included yaki noodles, pad Thai and scallion pancakes.\n\nThe yaki noodles were ok but lacked flavor. I thought the sauce lacked flavor honestly and was even a bit watery. The tofu was also super bland. \n\nThe pad thai didn't have much flavor and we had to add soy sauce to bring a little more life back to it.\n\nThe scallion pancakes were really oily but the flavor was pretty good.\n\nI had high hopes but it didn't totally pan out for me. I think the other locations may be better.", "author": "mike G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "This is perfect spot for healthy bees and vegan people. We went for date night and it turned out to be perfect place because the ambience is romantic and zen. We received our order right away. The portion size is fantastic. They have many options on the menu which sounds so delicious. I got so confused because everything looks good. I will re visit this place again and again.", "author": "Ivy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "Best vegan kosher place around. I recommend the big miso noodle bowl or the yaki udon (not the spicy one cus your mouth will burn for the next hour lol)", "author": "Joe H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "Came for lunch today with a friend and the service and food were amazing. There are not too many vegan choices in this area so I had thought about it before but never tried it as it looks a bit dusty from the outside and it's hard to tell as one can't really look in much. Some sort of brown curtain in the door etc.\nInside it's a bit of a mix or brown and brick and woodsy touches but a super modern mirror wall in the bath area. I wish it was a bit more inviting looking...\nBut that is about my only complaint. Everything we tried was fresh and delicious. \nPrices are not bad either\nI'd go back for sure", "author": "Felicitas O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "I chose LuAnne's to celebrate my birthday with some friends because of its rating and proximity to the Court Street movie theater and I give it two thumbs up! \n\nIt does what it says it will do: offer plant-based asian cuisine. The menu is varied and complete with enticing appetizers, soups, salads, entrees and desserts.\n\nThe pumpkin soup was more brothy than I anticipated (I was thinking a creamy soup) but was still tasty and light. The BBQ seitan skewers were also full of flavor and served as a great hold over until the entree. I went with the noodle salad which I was a little nervous about but was so glad I got.\n\nI'm just someone that needs to eat warm food when it's cold outside so I can't eat a salad as an entree in the fall/winter. But the noodles are served over a bed of greens so I got the best of both worlds.\n\nThe dessert was also a huge win! The apple pie with coconut ice cream was a very strong ending note to a great song. Apple pie ala mode is my favorite dessert and this vegan version was good and good for you too! \n\nThe waitress came out and sang happy birthday with a candle when she brought it out which was a sweet touch and indicative of the thoughtful, warm, and knowledgeable service we received the whole time.\n\nMy one critique is that the menu is dominated by soy! I found myself actively looking to avoid soy on the menu which was tough to do.\n\nIt was possible and the seitan options were good. \n\nI'll be back!", "author": "Rasool B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-22", "description": "I went for a quick lunch and the food was great! I loved the nuggets, they were seasoned. It was so tasty. We got the famous yaki yaki noodles which were very yum. The black pepper sesame chicken with brown rice. I will definitely go back and try more food. Also loved the mango lassi and lychee saki mojito!", "author": "Deepakie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "I dined by myself and once I looked at their delicious menu, I wished I had my friends with me so we could order tons more dishes. If you want something full of flavor, filling and with a kick, definitely try their kimchi Yaki udon. Mmmmmmm!", "author": "Marian B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-21", "description": "Just left and I am highly disappointed due to the service. The waitress during today's lunch hours spent no time at my table of one. I initially assumed that the restaurant must be packed and she was busy but I soon realized that no one else was having the same experience. I had to ask twice for a straw, received no follow up regarding my meal, no refill on the water, and had to request her to bring the check after I realized she would continue to walk past the stack napkins and utensils on my empty plate. Even then she placed the check out of my arms reach on the table. I ordered the Mango Soy Protein that came with Miso Soup and a spring roll. I really can only recommend the spring roll.\n\nI won't be back.", "author": "Lauren O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Lu Anne's is my go to Asian Vegan spot. The decor and service is great, and love how there is a cute outdoor seating area for when it is nice out. Ordering from here is also very good and fast. Most of the food here is tofu or seitan based. I have had a variety of dishes from here. The lunch special is the best and so affordable. I've had the Black Pepper Seitan which is pretty good and the broccoli in the sauce is tasty. The Pumpkin soup is okay. The eggplant and string beans are also very good and I would order this dish again. The Bi-Bim Bap is a good, healthy alternative to the real one. I think the only thing that throws me off with this one is the seaweed. The sesame-peanut and kimchee sauce definitely elevate the dish. \n\nOverall, the food here is really good. I have come here with meat eaters and they seem to enjoy it so that is a good sign. The prices are reasonable and I enjoy each dish that I get here. I have never finished a meal and felt unsatisfied.", "author": "Lateefah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "Wow.\n\nJust W O W. No sarcasm at all. \n\nI ordered the Jap Chae and my girlfriend ordered the kimchi udon noodles. We both are vegetarians and we're just so impressed with the quality dishes, generous plates, and overall experience.\n\nMy dish was described as sweet potato noodles, stir fried with an assortment of vegetables and tofu / setan. And it was spicy! Just the way I love it.\n\nI just love noodles too. Oddly enough my friends who also dine as frequently as i do said the food and menu was \"eh\" in the fort Greene location, but I really enjoyed this restaurant.", "author": "Chary S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-23", "description": "After seeing a movie at the Court Street movie theater, I decided to come to LuAnne's as I'm \"veganish\" and always looking for great options. The walk was about 5 minutes which is super convenient. The ambiance is cozy and intimate. I had the Kimchi Yakki Udon- DELICIOUS, especially if you love spice as much as I do. So so many great options.", "author": "Nicole W."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}