{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Excellent drinks - mango lassi and mint lemonade\nDelicious with authentic sauces - favorite starters were salt \u0026 pepper oyster mushrooms, eggplant, curry samosas and entrees: black pepper seitan and sizzling soy cutlet platter. \nAmbiance / Service - top notch.\n\nI'm not a vegetarian but would definitely return!", "author": "michael h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "I'm a carnivore. I love my meat. But, after attending a conference with a couple of staunch vegetarians, they convinced my husband and I to have dinner with them at Wild Ginger. Now, I had really zero (maybe even borderline low) expectations as my experience with vegetarian food has been minimal or just \"meh\" at best.\n\nHowever, Wild Ginger provided one of the best meals I've had in New York! What a surprise!\n\nOur friends and I shared some dumplings and fried tofu: they were divine, and the dipping sauces were super tasty. My hubby and I both ordered a bowl of their version of \"bi bim baab\" which is basically a rice bowl with everything but the kitchen sink on it -- it was incredibly tasty. I enjoyed my entire bowl and it felt hearty and flavourful!\n\nHowever, what blew my mind almost more than the mains were the desserts. We shared a vegan pumpkin \"cheese\"cake that was essentially indistinguishable from the real thing. If I hadn't known we were in a vegan restaurant, I would've thought this was a genuine, rich cheesecake! Then we had some peanut butter \"bomb\" -- it was huge! Actually, the cheesecake was, too, so keep in mind that they don't skimp on the dessert portions.\n\nIf I were in the Brooklyn area again, Wild Ginger would be something on my radar. I encourage everyone to try it out, veggie fiend or not!", "author": "Lea A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Love the food! The decor, the light, the chill music and service! This is a whole palate/senses experience! For an appetizer we had the Bbq tempeh which had a nice crunch and an amazing glaze (it was crack!) in a bed of greens, which was the perfect pairing.\nI had the Malaysian Curry with soy medallions. Hubby got the Orange Seitan with broccoli. The Passion fruit Lemonade was refreshing and homemade.\nIt was amazing! Everything was impeccably spiced. We will def come back!", "author": "Tatiana A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-02", "description": "I went here yesterday after reading my fellow Yelp reviewer's comments and decided to take a Vegan colleague of mine out for some dinner after he got a job offer.\n\nThe decor is very simple and yet cozy enough that you feel like you're not in Brooklyn.  The waiter service was fairly good; did have to track him down for some water every now and then, but that was because it wasn't the dinner crowd yet.\n\nWe had the pumpkin soup, which was a nice surprise, and the curry samosas.  They were a little greasy, but a nice take on the Indian appetizer.  We got for the entrees the General Tso's soy protein and the bi-bim-bap.  The general tso's had me SOLD!  I had a hard time believing it wasn't chicken and I had to swear up and down to my colleague that it really wasn't meat.  The Bi-Bim-Bap was a bit too different for me, but my friend liked it; good first time.  \n\nWe washed everything down with a glass of plum wine and shared the double chocolate brownie (ohhh I love you!) and the green tea ice cream.  \n\nWe left happy and still had money in our pockets!  Yay!", "author": "Jaclyn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "This is my new favorite restaurant!!! The food was awesome. I enjoyed everything I ate. My favorites were grilled eggplant and pumpkin soup. Simply superb! The service was solid but nothing amazing. I would say you will not be disappointed at this place.", "author": "Amara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "This place is awesome. \n\nThe food comes out so quickly, the servers are knowledgable about the menu and are very helpful (which is important in a place like this when you dont really \"get\" half of the menu) and I have a great experience every time I come here. \nWhat I really love is how the appetizers come out in seriously 2-3 minutes and are always delicious. The food just tastes fresh. \nThe entree sizes are not huge, but they are definitely big enough for one person. I like getting a few things and sharing them better than I like getting my own thing. The chicken and seitan type of stuff really tastes like chicken!! Its awesome. \nOf course, you can't leave here without trying the peanut butter bomb. Seriously. \nI love this place too much.", "author": "Sally S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "Ordered delivery. The pumpkin soup is delicious. Whereas most pumpkin soups can be heavy and overly sweet, this one is composed of a light broth that packs a lot of great pumpkin flavor without the density or weight. It's accented with fresh pieces of pumpkin and white beans. All in all, very satisfying and warming on a chilly evening. \n\nI also got the macro bowl. It was solid, but still a far second to Sun in Bloom in Park Slope. It came with garbanzo beans, whereas I would I prefer a more authentic bean choice such as adzuki. The highlight included in the bowl was the hijiki salad. Absolutely delicious. That can also be made overly sweet by some places, and here that was not the case. Will order a separate portion of the hijiki for next time. \n\nOverall, a good spot. Will order again.", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "Great food here. I like the Malaysian Curry and General Tsoy's the best. I'm not vegan and I do eat meat. I have eaten a lot of food that vegan friends are really excited about, and realized that they might have just forgotten what the original version of their old favorite really tastes like (ex: some doughnuts I had the other day).  That's not the case here, would recommend to anyone.", "author": "Zack L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-25", "description": "The decor is pretty good, unfortunately thats about it. \n\nGave this place a few chances hoping that maybe I was trying the wrong things on the menu, but was unfortunately let down by cold bipimbaps, bland noodles, and what could be potentially be a semi rotten mango. \n\nOverpriced food left me sorely underwhelmed.", "author": "Paul Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "there are very few places i have been in my life where the atmosphere is cool, the food is incredible and the service is great! i came here for the first time with my boyfriend, who is vegan. we were looking for a vegan asian place with okay prices and good food-- we were not dissapointed! the appetizers are one of a kind, try the bbq seitan skewers! i love getting the noodle salads here. its always a great night out and you cant forget the authentic vegan ice creams and desserts. wish I could dine here every time i went out!", "author": "Lou G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "This has become one of my favorite spots since I've been forced into becoming dairy-free. However, it would have been a favorite before then. All of the food is fantastic! My 3-year-old niece is a fan as well! She loves jicama now. Also having the option to have a delicious dessert that is dairy-free is fantastic!", "author": "Marianne S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-06", "description": "I am not a vegetarian but I thoroughly enjoyed my dinner here. They served us a salad that I didn't expect as part of the prix fixed deal I had from bloomspot deal. We requested steamed dumplings instead of the regular fried option on the menu and it was no problem. I liked that they were green, probably made with spinach. I ordered vegetables and tofu with brown sauce and it came just as I ordered, without peppers or onions. The tofu was cooked to perfection, slightly crispy on the outside and firm on the inside. The brown sauce was light yet tasty, not nearly as boring as it sounds. We shared green tea ice cream that tasted as authentic as you can get without going to Asia, without any additional sweetener. \n\nService was good, even if I couldn't always understand the waiter.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-26", "description": "I am a vegetarian who came here with a friend who has a gluten free diet. \n\nPros:\n1. Nice looking place\n2. Nice presentation of food\n3. Decent menu but lots of mushroom (if you love mushrooms, I don't). \n\nCons:\n1. Why was I starving after paying this much for food? We devoured the bar food at a nearby bar. \n2. Small portions.", "author": "Lady C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-08", "description": "So this was the first time in an extremely long time that I've gone out to dinner. \nMy standards I must say have been raiwd a bit, the service was extremely slow, they do not bring plates when clearly the foods we ordered are not for one whole sitting with 3!\nGoing through the Neal the service is getting worse by the course. Finished up the meal and it was great I must say. Eggplant garlic basil sauce was great(even though its basic allege eggplant miso on top of string beans).  \nCrispy Soy dish was delicious paired with a great tasting sauce. Pumpkin soup was extremely flavorful, could have used a bit more cilantro. General tso seitan was good. \n\n6.5/10. I would give it another try", "author": "Mark A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "I have never met LuAnne but if I did would kiss her!\n\nThis place is right in my neighborhood and one of the few where I have the luxury of ordering anything on the menu. Though moo shu vegetables are the lifelong favorite that I usually order, the times I have strayed I have never been disappointed.\n\nThe quiet atmosphere is a great place to spend the evening unwinding from the day. I never leave without being in a zen-like state of mind (or stomach).", "author": "AJ B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "They do a good job with eat in or take out. I particularly like the Bim Bim Bop and the Mekong Noodle Salad. The pumpkin soup is also really good. The grilled eggplant with miso is tasty, but very rich.", "author": "Molly P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-03", "description": "It seems this restaurant pretty much went down hill and I'm not exactly sure what caused it. From the abruptly abrasive greeting at the door to the hastiness of the waitstaff it was pretty much an unpleasant dining experience.\n\nThe waitstaff seemed rather impatient when we were deciding on what to order. There were two waiters serving our table and both seemed like they were in a rush to go somewhere or as if we were wasting their time. So within the first 7 minutes, they approached our table 3 or 4 times. After telling them a few times we needed a few more minutes, they disappeared for 10 to 15 minutes.\n\nQuestions about the menu were offered with a quick yes or no as if to say \"Why are you asking? Just order.\"\n\nThe icing on the cake, was when the waitress added a 20% gratuity to my check before I even signed. She tried to tell me it was normal and the computer does it by itself.\n\nI had to explain that I had been to Wild Ginger on multiple occasions before she fixed my check.", "author": "Ant R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "Black Pepper Seitan has me reconsidering my omnivore status. Who knew wheat meat could taste this good?\n\nWashed this down with a pot of Genmai cha tea and all was good in the world.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-15", "description": "Pretty good. The ambiance was the best part. The house bibimbap was very fresh, but the sauces were bland and the kimchi was fair. The orange 'chicken' had a pretty good flavor and crispness. Lemonade is very sweet, be careful! Not worth the price. Overall, fair", "author": "Caroline D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-24", "description": "This place never let's me down. Now that it's warm outside the outdoor area perfect for an after work meal. I went with a date on a Monday night. Our food came out quickly and everything was excellent. We finished, paid the check and just sat and chatted. The wait staff didn't rush us out or anything. Get the curry samosas they are the best.", "author": "Melia P."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}