{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-30", "description": "Not very impressed. The hot and sour soup was very good but the general tso's entree left a lot to be desired. The faux chicken was in big pieces and did not have a good texture. The service was good but for the price I would not come back.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-01", "description": "My favorite appetizers to get at Wild Ginger are: the pumpkin soup (when it's cold out) and the summer rolls with the haru sauce.  They have a separate gluten-free menu so make sure you ask for it.  A majority of the dishes can be altered to meet your dietary needs, and the staff seem to understand the seriousness of allergies/intolerances.  For your main course, try the BiBamBop or the Mei Fun noodles. The lemonade is really refreshing too!", "author": "Tara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "I love Wild Ginger more every time I go. It' a simple, unpretentious restaurant that makes up in affordability, quality and overall deliciousness what it lacks in trendiness. The service is always quick and attentive, and the ambiance is family-friendly and not too fancy, but still nice enough for a date or a dinner with friends. I love pretty much all the food I've tasted, but here are some standout dishes:\nStarters - this is the most fun part of the meal. Order a whole bunch of little dishes to share. I recommend the miso-glazed eggplant (melt in your mouth delicious), the scallion pancakes with mango salsa, and the spring rolls.\nEntrees - There are a whole bunch of classic American-Chinese dishes like General Tso's, all done with seitan, tofu and other meat replacements, as well as some new and interesting vegan entrees that aren't about replacing meat as much as just doing something different. My favorite entrees, though, are the noodle-based dishes. The udon noodle soup is a huge portion of mild, but savory broth packed with udon noodles, tofu, greens, etc. It tastes healthy and clean. My other favorite entree is the yaki udon - a giant stir fry of udon noodles, slivered veggies, chewy tofu and a spicy sauce.", "author": "Debbi I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-30", "description": "no no no no no no no!\n\nis there something up with the soya sauce here?has anybody else noticed that it's ridiculously sweet?!\n\ni've been here 3 times, and every time i get seated in the very back right in front of the door to the kitchen. why so so many reviews say this place is 'gorgeous'? because there is some stereotypical colonialists interpretation of the orient decorations from pearl river mart?\nwhatever, it's always loud and i swear to god, the last 2 times i went the very same large group of middle aged adults who looked like either the jersey shore grown up, or 'real housewives' types with about half as much money, and annoying accents to match. anyways they kept picking on one of their friends who was having a fit about ordering only steamed seitan, which she had to yell SAY-TAN every time she said it, with sauce on the side. her husband kept telling her that she was not eating like a normal person and blah blah blah this went on for an hour and was the most uncomfortable thing to listen to while eating.\n\noh, yeah, food sucks, too.\ntempura, which was yam and i think taro, was SOOO dry. and there was only soy sauce to dip. no daikon, no ginger, no lemon. seriously, this could have been microwaved tempura.\nthe orange seitan or whatever was so sweet i sent it back and asked for the check because i didn't want to test my luck.\nthe bibimbap was again, dry, had some fake meat in it, which i asked to leave out, and was soooo weird, nothing special, rice and some steamed tofu and vegetables and it just didn't really go together.\nthe udon miso soup which should have been great was the worst though. the noodles tasted like saltine crackers, but that's probably because they were sitting in miso broth which i can almost positively say came from a $0.99 miso soup packet boasting a ridiculously salty and fake taste.\n\ni wanted red ginger kombucha sorbet for dessert(Steve's ice cream!) but they were out (bitches) so i got mango sorbet. it was bright orange really sweet, and actually pretty damn good sorbet. best part of anything that has ever happened to me there-mango sorbet.", "author": "Evan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-24", "description": "One of those evenings filled with the flesh-eating company that might usually whine about their plates, with that pathological need for our cultural prey-for-profit at every meal. One of those evenings where those so often downright antagonistic to vegetarian cuisine found themselves well contented, plenty happy, with no complaints.\n\nAnd all the better than the table was so long that we had plenty of pocketbooks enough to try a wide variety of savory dishes. The cocktails were popular all around, though the various ginger beverages and other house concoctions had their dissenters. And no one could get enough of whatever was on their plate and everyone else's.\n\nThe staff were impeccable, all smiles and positive energy. And the ambiance was that typical nice energy, classy but not exclusive, soft lighting and calm.", "author": "Rocombey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "BYOB, friendly service, good food, always good to accommodate (replace this side by another), window is opened on summer... good local hang-out!", "author": "Nicolas R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-09", "description": "I was very skeptical about eating here since this is a vegan restaurant, but my girlfriend read good things about it and they were right.  I forget exactly what I had, but I was really impressed that vegan food could taste so good.  I normally balk at the slightest mention of vegan food, but this place has me sold.", "author": "d t."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-30", "description": "I went there before a movie the other night with the bf.  The restaurant itself is actually really beautiful.  Unfortunately we were seated by a large party that insisted on being VERY loud.  Especially this one broad who kept talking about her \"food blog\"...  Sometimes Brooklyn really gets to me...\n\nAnyway...  the highlights of the evening were the spring rolls and the ginger ice cream.  Really delicious.  \n\nI had the Black Pepper seitan which was a gigantic portion...  there was practically a whole bush of greens under it.  On the downside, it was a little bit too saucy for my taste.  \n\nI also ordered lavender tea at the end... and am pretty sure that the tea I received was not lavender.  My bf's thai iced coffee was also incredibly strong... it tasted like my Grandma's old percolator coffee.\n\nI wouldn't run back there, but I enjoyed sitting there in the pretty atmosphere with the love of my life.", "author": "Steven O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "Ok, full disclosure - I've only ever come here for dessert.  I am not vegan, and I'm extremely skeptical of any vegan so-called cheesecake.  A co-worker wanted to go here after work, so I gamely followed and ordered the pumpkin cheesecake.  People, I was impressed.  It's not EXACTLY the same, but it tastes great, so who cares?  Order it with coffee sweetened with condensed milk, and you are in dessert heaven.  I've been back a few times just for this dessert.", "author": "Rebecca E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-18", "description": "This place really is stunning. It's delicious. It's affordable. And I'm led to believe it's healthy. \n\nI'm not a vegan--far from it. But I have several friends who are. And thank God! Without their push I never would have tried great New York City restaurants like Angelica Kitchen and Wild Ginger. And now, in between hamburgers and salami sandwiches, I CRAVE these places.\n\nIf you come across another review saying the food here is flavorless, just give that person an imaginary look of pity and let them go back to salty fast food or whatever. Wild Ginger's food is VERY flavorful. The mus shu vegetables are my go-to, but I also like the vegi-seafood and vegetables and all of the appetizers and... everything.\n\nThis place delivers to my house and I often order from here instead of my favorite chinese place. This is healthier, tastier, and cheaper! Not sure how they do it.", "author": "Glen T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-15", "description": "Think twice before you try this place! I ordered takeout and I got a meal with a metal staple logged in my broccoli. We called to complain and ask for a refund but they refused. Seriously? We will never, ever order from this place again. I hope my credit card company will stop payment.", "author": "G B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-02", "description": "Recommend anything with mango. Wonderful sauce and great combination. This is a great little place at the north end of Cobble Hill. Quite and quaint.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-14", "description": "Good solid vegetarian cuisine. Not my favorite (It's more expensive and in my mind not as delicious or exciting as Red Bamboo) but it's my local go-to joint when I'm craving fake meat. I've done both delivery and eat-in and both services were fine - quick and friendly. And the food is well prepared and presented. All in all a very good dining experience.", "author": "Jill P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "The best Vegan place ever. Pricey but Restaurant.com certificate is honored. All dishes we had were great: Kimchee stir fried noodle, Udon soup, King oyster mushroom, Scallion pancake with mango garnish, Pineapple fried rice, and birthday (Cheese) cake made with tofu!! Among 5 adult and 3 kids, we finished all of them, I mean ALL!!", "author": "Terry P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-03", "description": "Perfectly cooked vegetables. Just absolutely perfectly done. Really great flavors and textures plus although they have few waiters they are just so accommodating that you don't mind the wait.", "author": "Illya V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "Fantastic vegetable protein. I recommend the kimchi yaki udon.", "author": "joe j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-18", "description": "I'm not a veggie or vegan so worried it would be vegan first food second. Happily the food was great and the service was good.", "author": "Justin H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-08", "description": "I'm a regular at Vegetarian Ginger (the only other downtown Brooklyn vegetarian/Kosher sit down option). I've been to Wild Ginger a few times, and although the prices are a drop higher, it's not enough of a difference to deter me.\n\nI've generally had the lunch specials, and they're pretty good, but not incredible. The lunch special selection is relatively small (maybe about 10 options, of them 3 are noodles and a few are just vegetables). \n\nThe food is good, but not great. They have nice ambiance, nice presentation, fast service for lunch - but I can't say it's good enough to go for regularly.\n\nMost food has slightly different flavors than you'd expect. I'm a big spice fan \u0026 detector, and in my shredded soy protein with bean sprouts there were spices that didn't mesh - like basil or something else savory. Reminded me more of a Thai style, which it might be.\n\nMiso soup is bland but good enough, seaweed in it was a little fishy.\n\nSpring roll was different but really good.\n\nThe pumpkin was weird, was creeped out by the black soft skin that looked like mold (but I'm sure is normal if you're used to this).\n\nGeneral tso's is good, but not available as a lunch special.\n\nSo in conclusion - if you're on smith st. \u0026 need something vegetairan or kosher - it's there. If you have 10 minutes to walk to montague \u0026 henry for vegetarian ginger, go for it. Save money \u0026 have better food.\n\nWould have been 3 starts - but lost one on this account:\n\nOn a last note: They sell non-kosher wine. As a kosher consumer that's creepy, made me afraid they might cook with it.", "author": "S S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "Compare if you will the crowd at Outback Steakhouse with let's say; Wild Ginger. There must be something in the water or rather the cuisine that pitts plant life against carivore fare. One cannot help but notice the sedate demeanor of the vegan oriented crowd vs. the rather more feisty hunt and gatherers that frequent the more aggressive venues. No boisterous, raising their voices or getting soused, inebrieted to the point of obnoxious or whatever you want to call it. No one \"gets in your face\" at a Vegan restaurant so if you are crusin for a bruisin this ain't for you. So being the peace loving person that I am, we figured we would give it a whirl. Not bad, food was fresh and crispy, mushroom things for starters, veggie dumplings, some soy protein stuff was very very good. The pumpkin soup well, sorry guys, keep trying on this one. Too bland, did not have that pumpkin zip. Other than that, a very pleasant experience and the proprietor was such a nice guy. Really aims to please. Certainly  we would return if in the area and try a different soup. Very casual, cool atomosphere so wear your Nike's and leave your bow and arrow at home.", "author": "Michele R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "Great for takeout - turnaround is super fast. Love the curry stew and the samosas.", "author": "Tabby M."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}