{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "My first Vegan Experience...What a Delicious Surprise!\nFood and Service were Spot On. Each Dish was Different and Tasty. Looking forward to coming back. Soon.", "author": "Dasi K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Going to make this short and simple. Great entrees and soup! I just ordered delivery from here and I plan on trying out more of the menu due to my recent experience. \nHappy to have found a delivery place that offers less-guilty ordering out. They also delivered within their promised time. Order from here if you want good delivery.", "author": "Heidi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "Omg the food was absolutely amazing! My girlfriend and I enjoyed the avocado salad, lettuce wraps, Kale bowl, hot and sour soup. Sadly when the food was delivered there was no salad dressing, not even the one it came with, plus I paid for an extra dressing, which made the salad a LOT less enjoyable. Maybe I'll get to try the carrot ginger dressing when I give it another try and actual fine in rather then carry out/get delivery.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Great food, good prices. I've been going here for years and love the outdoor space in the summer.", "author": "Jane J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "This is a great place for a variety of vegetarian Asian food. I came here with a couple of people and ordered three items to share: the black pepper seitan, teriyaki tofu, and pad thai. I thought the prices were steep, but the portions were large. Every dish was flavorful, but in different ways. \nThe seitan was sweet/savory but the greens balanced it out really well. \nThe teriyaki tofu came out on a sizzling plate and had a nice texture to it. \nThe pad thai noodles were tasty and not overly seasoned. \n\nService was also great--our waitress was attentive and friendly. Overall, this will be my go-to vegetarian restaurant.", "author": "Yen N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-27", "description": "Had the vegetable medley wrap which turned out to be loads of turnip and smattering of all others (tofu, etc) . The pineapple fried rice was also a let down.", "author": "Sandeep M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-16", "description": "I'm beginning to think I bring omnis to pan-asian vegan restaurants for a reason -- they are really good and filling. \nSo I brought my omni friend here who has never tried vegan food. I was really hoping she'd be impressed with the offerings and LuAnne did not disappoint. Service was wonderful and the restrooms were clean, just like I remember it two years ago. This restaurant also has a really nice ambience with mood lighting and clean, comfortable booths. It's more of a date night spot, but there is ample seating and you can get away with bringing a group here.\nI recommend the curry stew, it's not too spicy and it's very flavorful. I also really liked the Ginger soy protein, the razor thin slices of ginger played well with the sauce, which wasn't a salt bomb like other Asian restaurants. It was also pretty affordable for dinner, but if you come in for the lunch special you get a combo meal with soup or salad for a little less. It is probably a dollar or two more per entree compared to the nearby Vegetarian Ginger. \n\nMy friend was impressed and though she probably won't become vegan anytime soon, know LuAnne's definitely dispelled the notion that vegan food is for rabbits.", "author": "Steph Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "Food...AMAZING ...environment...stable,grounded,peaceful,welcoming and dark and romantic or bright and sunny in patio.. Ok wine selection. I really enjoyed myself! Must Go!", "author": "Farrah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "I love this wonderful little gem. We had the cold green tea sesame noodles, and the spinach shumai---both very tasty. The General Tso's chicken with broccoli was very good as well, though I'd prefer it to be cut in smaller pieces. The Lavender Rose tea was delicious and Mango salad fresh and light. The Peanut Chocolate cake for dessert was the BOMB. Omg delish! Being Vegan has never been so easy.   YUM!", "author": "Ma S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-02", "description": "I wanted a healthy, light dinner, so arrived here at 9:30pm.\n\nI was seated, greeted, order taken quickly but the server gave me Cote de Rhone wine when I had changed my mind and requested Pinot Noir.\n\nThe owner or manager asked me how the wine was, I explained it was nice but probably not my final answer after change of mind, and he gave me a sample and then entire glass on the house of Pinot noir. I greatly appreciated this gesture.\n\nBut then, while eating my Malaysian comfort stew, which tasted slightly of the way moth balls smell, I had to listen to the owner/manager lecture his servers on when they should ask customers for their bills, as they were trying to close.\n\nHe was nice to me, but I felt these conversations should be respectful and not within the ear reach of customers. It was awkward.\n\nI don't think I'll return because of the awkwardness and moth ball undertones.\n\nBut thank you for the wine!", "author": "Charlou M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Great food and atmosphere. Great service. Great place for a date. Unfortunately,  I will be dining alone for a while. LOL", "author": "Ijha J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "This place is officially my hot pick of the week. It shocked me into loving it despite me reluctance to enter.\n\nOutside, from across the street the place looks boring. The menu said vegan and I said no....i wanted meat but I gave it a try. (fyi, if you go there at night watch out for the black bench next to the mirror...i almost missed it)\n\nOnce inside my excitement grew, everybody was having a good time and the atmosphere as welcoming. There was indoor and outdoor seating....i suggest outside. The wait staff here are quick, courteous, funny, and not to mention helpfully detailed. My glass was always full, the drinks do creep up on you though so watch out (you can get sake or non-sake drinks). \n\nStart with the seafood salad and a breeze tini.....follow up with either the mango soy protein or the black pepper seiten. I took some home with me and I must say the taste didn't diminish one bit.\n\nThis place is really top notch.\n\n*cash and credit(except discover)*", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "Oh boy! That was good!!! We were two people and had a variety of starters, one main dish and two desserts. The starters tasted all different and fresh and were so delicious. We had the fried dumplings for example and I ate two in a row so quick that I was able to say: \"what?? no. I only had one yet\" and got another one. Maybe not the nicest way but I wanted it to so badly. We also had the eggplant which were very hot, so be cautious. \n\nThe service was good and the portions were surprisingly big, especially the dessert. Definitely a place I recommend checking out.", "author": "Svenja W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "Delicious clean awesome atmosphere with an open window front seating area, middle cozy warm area and an open door back of the house and then a terrace seating area in the back outside. Smells great and tastes as great as it looks. Veggies galore, a variety of appetizing dishes and get this even my meat loving friend Javi adored it. Plates are huge. Javi had the Pineapple fried rice and I had the kale pumpkin rice bowl assorted with other delights!", "author": "Monica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "The food at this place is spot on. Nice atmosphere and good prices as well. Certainly worth your vegan stop.", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-08", "description": "I found the food to be great in the restaurant but the take out was very bad. I just ordered the pad thai and a flavorless blob showed up. I couldn't event get the noodles on my fork because they were so dry and they had fused together. There was no sauce or flavor, and it was overpriced. Not going to be ordering from here again.", "author": "Kate A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "I have only gotten take out from here but everything has been absolutely delicious. If only my boyfriend would agree to try out a vegan spot, we would probably be here far more often. I definitely recommend this to anyone who is looking for good vegan food in the area.", "author": "Samantha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Hands down the best vegan food I've ever had, and I've been there three times already. Still exploring the menu and haven't eaten anything that wasn't excellent--wait! no, that's not true: I'm yet to eat a baked or processed vegan dessert that I've ever liked. Best leave that kind of stuff to the non-vegans. This is now officially my go-to spot.", "author": "Paul P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "I really enjoyed the pineapple fried rice - but there was lots on the menu that looked great. Good prices and service as well!", "author": "Stuart F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "Food was good and tasty. I wish they used less soy meats. Lunch special is well worth it and filling.", "author": "Kenald B."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}