{"aggregateRating": {"reviewCount": 340, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-28", "description": "We're big fans of Wild Ginger.  The ambiance is nice -- not crunchy the way lots of vegetarian restaruants are.  The produce tastes fresh.  The restaurant is clean.  The owner/manager is friendly.  I wish there were more organic items on the menu, but that's my only gripe.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-09", "description": "was not in the mood to cook tonight and had credit on restaurant.com/  Decided to try it out, although D and I are not vegetarians.  It was really quite good.  All the appetizers that we had were yummy, especially the scallion pancakes and the protien nuggets. The mains also like  the Pad Thai was really good, and the pumpkin cheesecake for dessert was tasty as well.  Really stuffed though at the end.  Wait staff was super nice and ambiance was really romantic as well, and zenish to boot.  Highly recommend.", "author": "M F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "A much needed addition to the neighborhood, Wild Ginger easily moved in on Smith St. An eclectic asian fusion menu reminiscent of Zen Palate but much broader, tastier and healthier. They get seitan right with their version of General Tso's. I loved the bi bim bop with seaweed, chickpeas, and kimchee. The hot \u0026 sour soup is the best veggie version I've had thus far, and nothing says good vegan restaurant like peanut butter bomb cake!", "author": "luvsbklyn k."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-29", "description": "This is one of a continuing legacy of poor/mediocre vegetarian restaurants.  \nBLAND BLAND BLAND!  How is it that flavorless is so often synonymous with \"asian fusion vegetarian\"?  I grew up vegetarian, and remember how hard it once was to simply go to eat at a restaurant that had options to please the whole family.  When these sorts of places first emerged, their novelty greatly overshadowed their lack of creativity or culinary talents.  In a city with a vast amount of delicious and varied vegetarian options, I am baffled as to how such flavorless food can still be so easily peddled.\nI like the design of the room.  The service was friendly and extremely nice.  A really great and creative neighborhood option that recently closed was Jill's on court street.  Wild Ginger is NO substitute.", "author": "Kristopher N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-12", "description": "Great food (the orange seitan was fabulous).  Nice looking place. However, the music in there was a bit strange and really loud...  e.g., Lionel Richie ballads followed by euro-techno beats.", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-05", "description": "Since my wife is a vegetarian we rarely get to share dishes at restaurants, but here we can share everything - what a treat! General Tso soy is the best.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-16", "description": "One of my favorite vegan restaurants in the city. And this is the best Wild Ginger location. Great service and very friendly. Also very very baby friendly. We have a 6 month old and Wild Ginger is a great to go with him.", "author": "Ray J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-26", "description": "HAHAHAHAHAHA I Laugh as I write this review because Wild Ginger lost four great customers.  Group of four tonight - 3 appetizers, 4 entrees, 3 drinks, and 3 desserts.  The entrees were good.  The appetizers...meh.  The drinks...watered down.  The desert...yuck.  Overall, my friends and I sat and talked for about 3 hours.  The place wasn't packed. There were no lines.  We gave them business. We paid our bill and we left a normal tip. We were leaving happy with intentions to make it our regular lunch special take out spot UNTIL the nasty rude poor excuse of a worker TRIED to humiliate and bully us into giving more money.  You would think, after being in this business long enough, that being polite to paying customers is the best way to go. Instead, the snotty waiter was very nasty and loud which lead to other customers in the restaurant to become silent probably wondering what this dumb lady is yelling about.  I'm sure the manager soon realized how stupid her actions were but now its too late.  She certainly had a lot of balls to do what she did because we could have crossed out our original tip and gave her $1 and she wouldn't be able to do anything about it.  We would have given this place 4 stars but that tactless worker will cost Wild ginger more than her paycheck.  Sincerely, never getting our business again. HAHAHAHAHAHAHA", "author": "Jay B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-30", "description": "So delicious! We got the fried shitake and kale dish and the mango plum sauce dish with soy. Both were amazing and as good as any meat dish at a Thai or Pan-Asian restaurant. I would definitely go back here again. And the service was great. It was a little expensive, but worth it.", "author": "Alison O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-26", "description": "To be fair, this is strictly a delivery review. My first experience with their lunch special menu was decent (no worse than Zen Palate), but I just got home from the airport and needed vegetables ... and a shower. I ordered the spinach salad and steamed vegetable dumplings from Wild Ginger. Spinach salad wasn't so much a salad as a plastic to-go container full of spinach, a couple of chickpeas, and a few beet slivers. Yuzu dressing was good, but it can't justify $7 for box of baby spinach. Dumplings were the ubiquitous, limp green goyoza you get at every corner sushi place. WG, I needed your salad to be substantial and you failed me.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-15", "description": "I really did not like this place. The service was fine but I have had much better Thai food elsewhere. I do not think I will be going back. The scallion pancake for an appetizer was disappointing. My entree was tasty with decent flavor but I think it is what made me feel sick in the middle of the night.", "author": "Jammy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "This is the best vegan food I have ever had. The pumpkin soup, veggie dumplings, teriyaki seitan and soy nuggets are my favorite things on the menu! We have never had a bad meal the service is great too.", "author": "belinda l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "Mellow atmosphere, reasonable prices, tasty fisherman's vegetable protein.  Eating here made me a believer that good quality vegetarian or vegan restaurant may indeed be possible in New York.", "author": "Nikolas K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-17", "description": "Very good food. Steamed Vegetable Dumplings are excellent, Basil Soy Protein as well. Prices are reasonable. Ate here over 20 times and the only negative is that the owner wants to punish you by forcing you to listen to the godawful racket he calls music. It sounds like a combination of country music and dying animals. By the end of the meal you want to stab your ears with the chop-stick. And they refuse to lower it.", "author": "Alan Horatio A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-06", "description": "This is a nice place and I will definitely return. My friend and I had just completed a cleanse and wanted to ease back into eating solid food. So we opted for this vegan restaurant. The atmosphere is very mellow and zen like. Great eclectic world music selection. If available, I recommend grabbing a booth. They didn't seem to have a problem seating doubles in them. I had the eggplant and string beans in a basil sauce. Very tasty although the eggplant was a little soggy (and very, very hot). My friend had the coconut curry stew. I wasn't as keen on the curry but it was still good. We also ordered 2 glasses of house  Chardonnay which were not very good. Total tab before tax/tip was about $40", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "Always a good bet for a tasty meal in a very friendly and relaxed atmosphere.  There's no loud music so you can hear your table-mates.  The food is fresh and inventive.  Overall an excellent experience (also from a non-vegetarian).", "author": "a a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-03", "description": "Delicious food for us vegetarian folks is often somewhat hard to come by, but this place definitely delivers.  From the welcoming atmosphere to the endearing wait staff, you feel great before the food even arrives!  My personal favorites are the Steamed Dumplings and the General Tsao's, but there are a ton of tasty options to try out.  It's our favorite spot in the neighborhood!", "author": "Josh L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-19", "description": "This review is only for delivery-- I've never been inside. But this place is shockingly more healthy and fresh than any of the Asian-ish restaurants in the neighborhood (or anywhere else around here). It's not Asian comfort food-- it's something totally different, and harder to come by. It's more like, when you decide to go on a health kick yet still occasionally feel like ordering in on a rainy night, Wild Ginger allows you to get a little bit of lazy gratification without doing anything you'll regret in the morning. Steamed greens, buckwheat noodles, pumpkin soup, brown rice encouraged, that sort of thing. The bibimbap entree, while not really anything like traditional bibimbap, is a work of art: six or seven different vegetable-type things (spinach, seaweed, avocado, mango, chickpeas, can't remember what else) chopped and arrayed palette-like on a bed of yellow rice, a kind of cold/warm/savory/sweet combination that feels like some important Eastern philosophy manifest in a black plastic takeout box. But just when you thought you were safe from all dangerous temptations, they offer something on the dessert menu called a peanut-butter bomb. I have not yet tried that, but I know that if I find myself trolling the menu on the wrong day, it's bound to happen.", "author": "M T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-30", "description": "Since the day Wild Ginger opened in our neighborhood we are regulars! The food is great, their soy protein dishes one of the best faux meats in the city! Everybody who looks for excellent and reasonable priced vegeterian and vegan dishes should check out this place. The decoration is modern with a nice Asian touch and the staff always friendly.", "author": "Tobias L."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "LuAnne’s Wild Ginger All-Asian Vegan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nx_ToYYzJG32Tr6gbrzU2g/ls.jpg", "@type": "Restaurant", "telephone": "+17188583880"}