{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "The Good: The food is incredible, we had the Lamb Haneeth \u0026 the Hafsah and both came with sides, naan, soup, and tea. I am so happy. The wait staff are pleasant.\n\nThe Bad: Not clear about the fact that we can get our own water in the back for free, never offered us any drinks, so odd.\n\nThe Ugly: When it's busy, it operates like organized chaos. If I had a larger family, I would be annoyed. But it was just the two of us.\n\nCANT WAIT TO COME BACK FOR ALL THE FOOD.", "author": "Yahya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-15", "description": "Came here on a packed day watching families break fast. What a beautiful moment. The tables adorned with giant dates and soup and salad with delicious clay pot bread. \n\nTried two chicken dishes. The Chicken Haneeth and the Curry. Personally I felt the curry imparted more flavor. I saw tables with beautiful platters of lamb. I would definitely try those next time. The soup was my favorite. Filled with earthy spices. Really hit the spot!", "author": "Helen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-20", "description": "This place just fell below the mark for me. My friend from Brooklyn convinced us to give this place a try. We were down because we never had Yemeni food before and the place was packed. We figured it had to be good.\n\nOur experience here was doomed from the start. It was the month of Ramadan and we were nearing the time you break fast and there were no seats in sight.\n\nWhen we finally got seated and we're served our food, we were mildly disappointed. Usually after fasting all day, anything edible tastes good, but I just couldn't enjoy my meal here.\n\nI didn't enjoy the soup, the bread with dipping sauce, or the lamb chops. I didn't even know lamb chops could taste bad. My other friends enjoyed it a lot and claimed Its because i didn't order the lamb hanif, which happens to be their most popular item. \n\nMaybe I'll go back in the future for the lamb hanif but as of now, this place gets a no from me.", "author": "Tasnim C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Amazing food! This was an unexpected stop after a group of us went to the transit museum nearby. We walked past it while going to another restaurant, but our first choice was closing for an hour between brunch and dinner so we decided to come here since we've never had Yemeni food before. \n\nThe street where Yemen Cafe and Restaurant is located has several other Middle Eastern establishments which is always good to see. When you have a cluster of restaurants and shops, that must mean there is a population that lives nearby and therefore, it should be authentic. \n\nWe walked in and the decor is very simple which is fine with me since as long as it is clean, I don't care much for decor. The staff was friendly and put two tables together for us. \n\nLet me just start with the fact that the free tea is AMAZING. It's self serve so you just pour it yourself into a styrofoam cup and you can put in dehydrated milk. I think I drank 5 cups throughout the meal. \n\nI got the Chicken Agda (Loubia) and it was tasty and the chicken was falling off the bone. It was not dry at all. The rice was perfectly cooked. The portions were so large that I ended up taking about 1/3 of it home. \n\nI also tried the Fahsah and it was delicious and came out bubbling in a hot stone bowl. \n\nThe price was really good and I would definitely come back again", "author": "Gaoxiang C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Bread upon bread upon bread. \nThe naan like bread was continuously replenished at no extra charge. It was very tasty. \nYou also get complimentary green spicy sauce and a lamb soup and a salad. \n\nFyi the (marag) soup looks vegetarian but it's not. The lamb soup was very flavorful and tasty. My friend who hates lamb actually loved this soup and ended up eating the whole thing before she realized it was lamb. \n\nI also really liked the complimentary tea. It tasted like chai but was somewhat different. Some sweet and sour notes. \n\nI got the Fahsah, which was about $13.95. This was really good and my favorite from the stuff I  tried from friends. This dish includes shredded lamb and it is served bubbling hot in a clay bowl. The meat was very soft and not too overwhelming. \nThey also gave us some cold spicy sauce that went well with this dish. \n\nThe service was so good. Everyone was very nice and courteous. They accommodated our large group. \n\nThe inside is nothing fancy but it's one of those gems that you should try out because the food is worth it.", "author": "Suzanna H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-30", "description": "I LOVE THIS PLACE! For anyone who loves middle eastern food, THIS IS A MUST. The soup they start you out with has to be one of the best soups I've ever tasted in my life. It's flavor is off the charts. The salad they provide is average, nothing special. However, their entrees are amazing. I ordered the Lamb Haneez and I could not put my fork down. It was incredibly delicious. The meat was so tender and flavorful, I just kept wanting more. They also provide free tea, which is also quite good. They are a bit pricey though. All in all, amazing food and will definitely come back again!", "author": "Ahmad I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "YEMENI FOOD IS SOOOO GOOD. I was a bit nervous coming to this restaurant because I had never tried Yemeni food before and I wasn't sure if this place would give me a great introduction.. thankfully I learned my lesson: never judge a book by its cover. Although this place isn't the fanciest, the food sure makes up for it. \n\nBefore even ordering, you are given a good portioned side salad and soup. The soup was absolutely delicious, I'm not too sure what was in it but it was very good. The salad was good too but I'm not really a salad type of gal. As for the entree, I ordered the chicken haneeth but please order the lamb! I had a taste of my friend's lamb haneeth and fell in love. It was juicy, tender and did not have that gamey smell everyone is scared of. My chicken haneeth was good too, but the lamb definitely stole the show. The meats were on the side to a bed of rice with some sort of vegetable stew on top. \n\nSuper good! Yemeni food is very comforting and hearty, perfect for a cold day. I also highly recommend the tea! I normally don't like lamb or tea but this place made me question who I was because I loved both. Please give this place a try!", "author": "Fariha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "This spot is legit! Every time I've been there, there has been a small wait. The staff is always so inviting, courteous and prompt.\n\nDo not make the same mistake of over-ordering like we did the first time around. Yemen Café brings out complimentary freshly baked fatah (clay oven bread), soup (marag), and special house salad.\nWe ordered the Lamb Liver (Kibdah), sautéed cubes of lamb liver, with onions, tomatoes served with their clay oven bread. The appetizer was big enough to share with 3-4 people. It was the best liver I've ever tasted in my life! It was so good, it didn't have the typical liver taste.\n \nThe entrée we ordered was the shredded Lamb stew (Fahsah) served bubbling hot in a clay bowl. Once again, they bring out the warm clay oven bread. This stew is amazing! It's full of flavor and perfect for a cold winter day. \n\nDon't forget to taste the complimentary tea! You can drink this spice-infused tea with or without condensed milk. \n\nIt's like a hidden gem in the middle of Brooklyn.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "As am devouring this meal, happy foot dancing, I would take a trip to New York again for this. Great warm environment, nothing fancy but the incredibly good food", "author": "Jack S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Words cannot describe how quickly I managed to fall in love with this place- seriously. My cousin suggested this place for a large group of us (7 I total) and they were more than accommodating and helpful to us. Our server immediately gave us bread, lentil soup, and zhug (a cold spicy sauce, has a lot of cilantro) to start. In regards to how they were, let's just say it was hard to not fill up easily on them. Now, time for the entrees!\n\n1. Lamb Haneeth- literally mouthwatering. I wish I lived closer to this place solely for this dish because trust me, it really is that good. I don't know how long they roast the lamb for but it literally falls off the bone and is perfection. Have every bite with the rice given as well!\n\n2. Zorbian Lamb- this is one of the few dishes that doesn't have the lamb separated from the rice but \"ready to eat\" as is. Simply put, there's no mixing of the lamb with the rice because they're already mixed in. This dish was also solid but was pale in comparison to the Haneeth. What I did like was the incorporation of scallions with the lamb to give it an extra kick. It was super flavorful and relatively spicy as well. \n\n3. Lamb Glaba- similar to the Haneeth in the sense that the lamb and the rice are separate but again, it couldn't compare to it. It tasted great don't get me wrong, it just wasn't anything special. Me being me, I also like dishes slightly different than the basic meat served with tomatoes and onions.\n\nSo why five and not four stars? Because, surprise surprise, the Haneeth is truly worth it. I see myself coming back if I'm ever miraculously in the area solely for this dish. On top of that, as mentioned, the service was wonderful and there's free tea in the back- help yourself because it's pretty damn good. Lastly, take note that the portions are gigantic so yes $23 for a meal seems like a lot BUT trust me when I say it's truly meant for two people so it's actually very reasonably priced. Enjoy!", "author": "Najwa G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-13", "description": "Our first taste of Yemeni food (did I say that right). So take this review with a grain of salt. Also, we ordered delivery, and based on the pics I've seen, the experience in the restaurant is superior. In any case...\n\nThe food was decent. We had the chicken and lamb haneeth dishes. They were both pretty good. Not our favorites, but pretty good. The fasoolia was \"different\" for us. And we had a vegetable dish.\n\nLike I said, we don't know Yemeni food. So, it was \"A-OK\" for us...", "author": "Art C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "Have a lot of free time on my hands because of the government shutdown and decided to try out a new restaurant each day. I'm really picky, so generally scared to try new ethic food, but man am I happy I tried Yemen cafe.  I came for lunch, and for $11.95, got a delicious, home cooked chicken stew.  It came piping hot and felt like comfort food to me.  I also got a free mini soup.  I couldn't tell you what kind of soup it was, but the flavor was unique and the soup comforting.  I also got a huge pizza size bread which was fresh.  I couldn't believe how much was included in the $11.95 meal.  The flavor of the chicken stew was just okay -- I'd order something else next time, but my overall experience was 5 stars.  Come here if you want homemade comfort food at a great value!", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-06", "description": "I have never had Yemeni food before. It was Very good. The service was great. It was very much family friendly. For food, it was Amazing!!! The pita bread was to die for. The lamb was very good. The chicken was okay. The vegetarian dish was amazing. The Fahsa I highly recommend. The Lamb Haneeth was excellent. The rice was good too. I also loved the Marag Soup. It is mixed Yemeni spices and homemade lamb broth. This restaurant was amazing and I enjoyed the experience. \nThank You.", "author": "Denis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-03", "description": "This s my second visit in a while and the only thing that has changed is the floors.  It's a rather small but popular place: you'll see groups of friends and families.\n\nYou get complementary salad and tea which you serve yourself.  We ordered soup and two types of chicken dishes.  Portions will definitely fill you up.  \n\nStaff is friendly and helpful.  Service is quick.  I enjoy visiting and appreciate a great meal.", "author": "Monica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "The starter soup, the lamb the chicken the tea, all of it is INCREDIBLE. This place, from the service to the food, is just perfect. It doesn't have the chicest or hip-est of decor, it's not even \"ethnic\" looking, but the food will transport you to a magical mystical Arabesque landscape. It's always really crowded so expect to wait for a table regardless of the day and time, but it's worth it.\nEach entree is enough for two people, the servings are enormous, and the prices are really decent. The meat is fresh, I mean almost gamey fresh. A must try for anyone who enjoys a hearty meaty fresh cooked meal from a clay oven.", "author": "Jay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "this place is great! They have wonderful lamb kidney. Delicious! We two people ordered two plates of kidney and eat them all! The staff here is very helpful and friendly. We lost credit card there, and they kept the card for us! Amazing food and staff!", "author": "Qiong L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "Pros:\n- Delicious food, I recommend the minced lamb (forgot the name) and lamb habneeth \n- free Yemeni tea! It is really good. I recommend putting a little milk and no sugar as it is pretty sweet already\n- friendly wait staff\n- cheap for the amount of food you get. I paid $22 with tip and we had 4 dishes between 4 people\n- most of their dishes are family style (at least 2 people can eat off it)\n- restrooms are clean\n- at least during the weekdays you can walk in and grab a table easily\n- plenty of space in the restaurant the tables are not that cramped together. One of my pet peeves with restaurants that cramp together tables\n\nCons\n- none really \n\nEnjoyed the Yemeni food very much. Definitely will return.", "author": "Viren G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "I've been here about three times and it is so different to me. There is this homey, warm feel and you just feel like you've entered a different realm. \n\nTypically, there is a soup and salad brought to you. I must say that the soup is so delicious. You can taste the meat broth and it soothes your soul. They also bring freshly made bread which is a huge plus.\n\nEverytime I have been here, I ordered just about the same thing. And they have been consistent in taste, texture, and flavor. I ordered the lamb haneeth and it came with rice. The lamb is so tender, like it melts in your mouth. I have also ordered the chicken haneeth, but the lamb is far better. Everytime, they are consistent with the way they make the food. \n\nThe ambience is like you are in the middle east. It is pretty casual dining. I really enjoy coming here and would definitely recommend it.", "author": "Zahra W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Come for the Haneeth, stay because you ate too much Haneeth and can't get up. \n\nYemen Cafe is my go-to Yemeni restaurant in NYC. The portions are enormous, the food is spectacular, and your food comes with complimentary tea, bread, and lamb broth. Good place to get a few dishes and share them with friends - beware of overordering because it's easy to let your appetite get the better of you.\n\nSolid five stars.", "author": "Juan Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "I was in NYC for the Toy Fair at the Javits Center, and also had a long list of items my sister (who used to live in NYC) wanted from Sahadi's across the street, so I set out from Manhattan to Brooklyn on a Tuesday morning.  Before doing my shopping at Sahadi's I saw Yemen Café across the street was open, so I popped in for an early lunch.  After walking in the cold for 15 minutes from the subway station to Atlantic Avenue I was in the mood for a hot soup or stew, so I ordered the Salta, a stew made from pureed fenugreek leaves and lentils and lamb stock that contained eggplants and zucchini.  Delicious and perfect for a hot day.  The Salta was flavorful and hearty but not overly filling, and the house-baked laffa bread (a flat bread baked in a tandoor-like clay oven) was pillowy, chewy and perfect for sopping up the Salta sauce.  \n\nNot 5 minutes after my food arrived the waiter walked past me with 2 plates of the lamb Haneeth for a table of Yemeni men next to me.  As the smell wafted past me I wished I'd ordered the Haneeth - the smell was amazing and the lamb looked tender and juicy.\n\nThe spiced tea was perfect for a hot day, although it was a tad too sweet for my liking.  \n\nThe restaurant was visited by the fire inspector when I was there - the owners kept offering him lamb but he kept turning it down and I'm sure he's been regretting it ever since!\n\nThe service was a tad slow, but not in a way that negatively affected my opinion of the restaurant, and I never complained, but nevertheless the house comped my meal.  So not only did I get a hearty, tasty, authentic Yemeni meal that I can't get anywhere else in this country, but I got it for free.  Next time I'm in town I'm ordering the lamb and paying double!", "author": "Jeremy K."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}