{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "Sooooooooo good! 4.5\n\nI randomly stopped by here after a doctor's appointment nearby and have been wanting to try Yemenis food and I didn't regret it one bit. I tried a chicken stew dish, which came with rice, and it was the tastiest chicken stew I've ever had in my life! They serve a soup side as well as a side, which were good, not crazy yummy though. \n\nService\nThere weren't many people in the actual restaurant, but the servers were incredibly friendly and helpful when I was ordering. \n\nTimeliness \u0026 freshness\nThe food comes out very quickly and it tastes super Duper fresh. \n\nThe restaurant \nThe actual restaurant is not somewhere I would recommend to sit down and enjoy a lovely meal. It's pretty standard and slightly dull, but filled with love, good people and food. I'll def come back!\n\nThe diverse Filipina Foodie, \nRenee Rises", "author": "Renee R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "I LOVE Yemen Cafe. I do not normally like lamb but the lamb there is so soft and tender and flavorful. And the foul is so delicious. And I wouldn't mind living off their soup and tea. This is my favorite place to eat. Oh and their clay oven bread, ugh. If you are in Downtown Brooklyn do not go to those super expensive just okay restaurants. Yemen cafe is where it's at. It's a super welcoming environment and absolutely delicious.", "author": "Xiomara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "This place is amazing.  I don't live in Brooklyn but whenever I'm in town I make a point to visit.  I have taken both business colleagues and members of my family here and all parties have liked it thus far.  Simply a gem.", "author": "Julian A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "I have traveled from Jersey City all the way to this cafe multiple times just to sink my teeth into their awesome fatah bread! Just mind blowing! They have excellent staff and I would recommend stopping by here any day! The only complaint I have is that it would help to keep the place a tad bit cleaner.", "author": "Jay V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "Wow....! Wow...! Wow...! I walked in and I wasn't sure what to expect! There is open seating so grab a seat and prepare for a ride! This place is like beautiful organized chaos!!! (If there is such a thing)\n\nAt first we were almost afraid to order and weren't sure if we had to go up to the counter and order or if someone would come by... Thankfully someone came by and took our order... Since I'm vegetarian the choice was easy for me... (There is only one vegetarian option) My boyfriend had the more difficult task of navigating this almost confusing menu... He ended up getting the chicken skewers... Everything seemed to have lamb in it and he wasn't feeling too adventurous. \n\nSo we order and brace ourselves for what was to come next... We were afraid as we looked at other tables piled with food and men scarfing down whole green onion stalks... \n\nSo our bread, lamb soup and salad, oh and hummus we got that too! all arrives and we dig in... I had a sip of the lamb soup just for the sake of being able to YELP about it and I'm not ashamed to say I nearly licked the little bowl clean... (There were no actual lamb pieces in it... I am hoping it's only made with the bones but either way.... I ate it all and I am not ashamed) and the bread!!! Lord dipping that bread in the lamb broth must be equivalent to Oreos and milk in their country because goodness it was GOOD! \n\nThe salad had the most amazing vinegary dressing I've ever had... I ate that all too... Then comes dinner... I definitely saw Jesus when I tasted the basmati rice... I wanted to go in the back and kiss whoever made it!!! Yes it was that good!!! \n\nI could continue to ramble on and on but I think yelps about to cut me off... One more note... As if dinner wasn't good enough the sweetest boy comes over to us and he is getting what seems to be tea... He then looks at us as if we are clueless which we were and he says... You guys haven't tried the tea!???? No.... We haven't..!  he proceeded to bring us cups because as he professes it's the BEST! He wasn't lying it's better than chai tea, delicate and the perfect amount of sweetness to end the meal and its complimentary... I've been dreaming of the basmati and tea since coming here... Now stop reading this and go eat here!", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "I don't usually give 5 stars, unless the food is absolutely MINDBLOWING! And yes, this place achieves that job!! \n\nBest of Brooklyn's Hidden Gems! Mind you, it doesn't look like much from the outside or inside, but the food will take you to another level of having an foodgasmic experience! Granted it was my first time having Yemeni Food, I felt like no stranger as it felt quite similar to my own cultural food. \n\nMy in-laws told me to pick a place I wanted to go to for my birthday dinner, being that they only eat halal, I found a few nice places in Brooklyn, but when I came across Yemen Cafe and saw the pictures, I could not simply resist and had to come here. \n\nWe came here on a Friday night around 9pm and the place was packed, however we were seated promptly. We started off with the Babagnoush as appetizer, the soup, bread and salad, all of which came along with the meal. \n\nThe bread is huge and they will give you more upon asking for it. Tandoor baked, soft and delicious! The soup, has a distinct taste, seemed to be more of a broth from the meat, either way I loved it! Add some lemon and some of that spicy sauce they give along with the bread and Bam! The Babaganoush was also pretty good, but I'd probably opt for a different appetizer the next time! \n\nFor entree, all five of us decided to go with their World Famous \"Haneeth\". Lamb simmered in Yemeni spices for 5hrs, atop of flavored, Yemeni Rice (similar for Pualo/ Biryani), with some veggie gravy on it. first bite into the lamb, OMG! This is SOO GOOD!!! Tender, soft, flavorful, juicy, falling off the bone, fatty, cholesterol city Yumminess that melts into your mouth! At about $21 bucks for a plate, this is well worth it!! \n\nThe service was not bad, it started off a bit aloof, but as soon as we let them know we were waiting, it went well from there on. Our waiter was very friendly, even offered us their classic Yemeni Tea at the end of our meal. Everyone in my family enjoyed the tea, except me, guess because It was too strong for my taste (cardamom, cloves, cinnamon, etc).\n\nAll I can say is that I simply can't wait to return and tell ppl about this place. This is a MUST, if you love Lamb!!! With all that being said, I see no reason why this place deserves anything below a 5 star rating, because really, it is as good as it gets!", "author": "Farhana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Best lamb I've had in a long time. Even those with me who said they didn't like lamb liked it.  Lots of food for your $$. If you are going unfamiliar with Yemeni cuisine, be sure to try the masoub/fatah with honey. It's like Thanksgiving stuffing only sweet. So good!", "author": "Kristie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "They went above and beyond, making us a dish we remembered from another continent many years ago. The food is terrific, as is the hospitality.", "author": "Laura D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Flawless Flavors. If there is one thing you need to hear to convince you to go here, that's IT. If there is a second thing to convince you, VALUE. You get so much amazing food for a very reasonable price. This area of Brooklyn isn't notorious for \"cheap\" food, so having a couple places that you know you can always rely on to have a inexpensive filling meal, you have to embrace these gems like the crown jewels. Yemen Café is kind of a perfect example of why I LOVE this city! I can play boche ball with hipsters one minute, then cross the street and share a meal with a beautiful family from Yemen the next. It warms my soul to have such amazing options and surprises at every turn. Now it goes without say you need to get an order of the Haneez, slow roasted lamb shank. AS tender as lamb can EVER get. All entrees come with soup, salad, and fresh fresh fresh naan. They just keep the naan flowing like wine. And on that note I want you to know because of culture and religious reasons they do not sell alcohol. But that should not even pop in your head if you ready for an amazing meal....and if it is, maybe you have a tad of a problem. What I would even recommend is getting a platter to share, an extra order of Haneez, and then just tear into the dishes all finger picking stylee. It is the way of the people, and somehow it just makes it taste EVEN BETTER! Just like I have to eat Thai food with chopsticks, I must eat Yemen food with my fingers. So much goodness....I just....can't go on. So go here. Like, yesterday.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Hands down one of my favorite bars. I've been going since they first opened. No frills bar that makes a great cocktail. Can't go wrong here.", "author": "Eleanor R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "Sexy, saloon type of place. Dark ambiance, great drinks. The con: long wait for a table so I can't comment on the food.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Having never tried yemeni food before, I was excited to find this place and see where my tastebuds would take me. \nUpon entrance you can already tell its a super authentic and feels very homely. You are served lamb soup and salad complimentary which is always great.\nThey have a big variety of dishes, but very few vegetarian options. I went with a vegetarian and she had the only vegetarian dish and found it really worth it.\nI had a chicken salta dish which was really really good. The chicken was cooked to perfection and very flavorful. It also comes with the biggest and best naan like bread. The quantity is enough for two or even three people for one dish.\nI was craving it the next day, which meant it was definitely worth it.", "author": "Moha A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-29", "description": "This place does not deserve 4.5 stars. I'm south asian and my in-laws are muslim but lets get a few things straight. 1. The lamb is by far not the best I have had. 2. Although the waiters try hard the service is mediocre. The soup and salad was mediocre at best and the bread was ok. Either yelpers are not honest or being a bit politically correct. Either way, the rating of this restaurant needs to come down a few notches as this neighborhood is chocked full of great choices.", "author": "Pratik P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "So I was in Brooklyn with fam that just came from overseas and we were hungry. Had this place bookmarked and glad we picked this place. It is self seating and after we sat down we were given complimentary naan type bread, some dip that was spicy n yum and also some kinda soup. We ordered shakshooka, Hummus and lamb w rice. Everything was super sized portions n tasted yummmmmmy!! The lamb and rice was insanely bomb n their rice was possibly the best rice ever. The hummus n shaksooka were also really good. We also got an order of the Yemeni tea which was also very good. The service was super friendly and prices very reasonable for the quantity of food. Got to experience a diff part of the middle east through their food and thoroughly enjoyed it.", "author": "Ankeet G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "Super fast service even when the place was packed.The staff were very friendly as well. Food was good.", "author": "D B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "There are not many ethnic restaurants who serve authentic ethnic food. Yemen cafe is definitely go to the top of the list. Great food, you can tell by the taste that no shortcuts have been used for cooking.", "author": "Amna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "Location: In the center of the block off Atlantic Ave in Borough Hall / Downtown Brooklyn area.  \n\nService: Yemen Cafe came a long way!  Their food has always been good but their service was grimy!  They were notorious for throwing your food on the table and walking away but they stepped up their service game 100%.  Finally they provide good service.  I guess they realized that more american people were coming and they focus on service.\n\nFood: This is traditional Arabic food like soups, breads, rice dishes.  If you are coming here please get \"Fahsa\" dish which a slow roasted lamb broth with shredded lamb.  Its eaten with \"Malooga\" which is a traditional Yemeni style flat bread.  Fahsa is very hearty and comes in a large portion.  If your eating with a group, this could feed 2-4 people depending how hungry you are. \n\nAnother food which is a must try is the Haneeth!!! Haneeth is slow roasted meat like chicken or lamb. Check out my pics to see the chicken and lamb.  Its sooooooo juicy and falls off the bone.  The rice is mediocre but who cares, you are coming for the meat.  \n\nHonorable mention: Hummus here is good and worth a try. \n\nThe only down fall is that there is no dessert.  However there are a few Arabic stores nearby where you can pick up something sweet.", "author": "Ahmed M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "OK, this place may not look like much but the food is fantastic! If you like lamb, you will have your socks knocked off. The lamb soup was delicious, as were all the dinners. Perfect for a cold night.  \n\nI had the lamb shish kebob and my husband had the lamb Haneeth. We were both really impressed. The lamb Haneeth is slow roasted for maximum flavor and juiciness. We shared, so we were each able to enjoy everything. My friend also ordered the lamb Haneeth and couldn't get over how good it was.\n\nService was not only incredibly good, but extremely friendly. The guys were all smiling, happy, eager to explain the menu and very helpful. I couldn't have asked for a better experience.  We tried the dessert - didn't get the name - but it was great, buttery and warm with honey and cream over something grainy. \n\nPortions were huge and we took a lot home. If you're on Atlantic Ave, try this place, it's so much fun!", "author": "Adele P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "What a fantastic spot! Food is fresh, service is quick and the prices are quite reasonable. Worth the visit!", "author": "Matt H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "I've enjoyed everything about this place. The food is great and the service is good. Honestly I  can't ask for more. \n\nI will definitely be going back. Actually I already have several times! :-)", "author": "Michael B."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}