{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Delicious food , sometime busy so order come late avoid weekend, some time they throw one extra side on the house no charge", "author": "Ahmed H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Haneez with Fatah are the best of the best,\n\nMake sure you're going to sleep after having this meal, I just can't move anywhere!", "author": "Nader A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "Came here on NYE with my girlfriends family, who are Bengali.  It was crowded, but they made space for our grandmother's wheelchair.  Atmosphere is ver lively - not a place for a quiet private meal, but has great energy.\n\nThe service was excellent, and the food was even better.  The slow cooked lamb dishes were incredible - my family is Greek and (as blasphemous as it is), I have to say that this was the best prepared lamb I have ever had.  The meal is cooked with bone in, so the meat is incredibly tender and moist. And the portions are huge! One entre comes with soup, salad, meat and rice. We ordered three entrees for four people and still had leftovers to take home.", "author": "Derek K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-04", "description": "Yemen Cafe is a well known establishment that's famous for their moderately priced and extremely authentic cuisine.\n\nThe restaurant itself offers nothing in the way of decor or ambiance, but they make up for it with amazingly tasty chicken and lamb dishes. The owners are extremely friendly, and very proud of the dishes that they offer. They'll gladly talk your ear off about any and all facets of Yemeni culture.\n\nI ordered the chicken loubia, a Yemeni stew in a tomato based sauce with potatoes and vegetables. The portion is more than enough to share and comes with a generous serving of both basmati rice and bread. It's comfort food at it's healthiest. The chicken was boiled until very tender, and mixed with chopped carrots. While not one of their more popular items, I enjoyed it and can see that it would definitely hit the spot on a chilly day,\n\nMy Mom ordered their most famous dish, the Haneez. Her leg of lamb was slow roasted to the point where the meat fell away from the bone without her needing to use her knife. Days after we had dined here, she remarked that the dish was still on her mind. \n\nBoth dishes came with a salad topped with their own special dressing, a small cup of lamb soup and a cup of their sweet tea at the end of the meal.\n\nFor now, we all have to travel into Cobble Hill to enjoy a taste of Yemen. But, the owners confided that they're looking into opening a place in Astoria soon enough.", "author": "Camille M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "I've been wanting to try this place for the longest time but SOMEONE was too scared to try it.\n\nIt ain't no fancy smancy place, it almost seems completely out of place in the neighborhood.\n\nIt is true, the amount of food you get is ridiculous. See photo with hand for scale reference. For this alone I feel compelled to give it four stars based on value alone.\n\nOne appetizer and one entree will feed two people for dinner and leftovers for lunch the next day. \n\nIncluded in your meal are a bowl of lentil soup, HUGE pita bread and a salad.\n\nLentil soup - wish it was a bit thicker with more substance\nBread - no complaints except that I can't see how anyone can finish this.\nSalad - refreshing\n\nFor appetizers, we ordered the shakshooka. I would skip this. It is literally scrambled eggs with tomatoes, peppers, onions. Not special at all.\n\nEntree we ordered the lamb habeeth. Meat was definitely fall off the bone. I wish it was a little warmer, and I wish there was more sauce. But overall, pretty solid. And again, HUGE.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "amazing and delicious.. The best Arabic food I've ever tried.. It's almost house cooking . I like it .", "author": "Manea A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "Authentic Yemeni food. It took my taste buds back home which is something that is a truly amazing experience. The liver is the bomb. The lamb falls off the bone and the chicken is so tender. This place is a must go when you are in Brooklyn. When I land at JFK it's straight to Yemen Cafe!", "author": "Osamah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "We came here with some friend and we all enjoyed our food. They served us a small salad and small soup to begging with then we got our main course. \n\nReally good food and service. We ordered a Harissa plate with rice. The food was really tasty. Loved the meat. It was exactly what I expected. I recommend this place. I'll be coming back.", "author": "Azalia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "I ate here for the first time a few weeks ago and I haven't stopped thinking about it since. So so so yummy. The babaganoush was so smoky and yummy that I wanted to lick the plate. The chicken was so perfectly cooked. Everywhere I looked, people's dishes were amazing. I can't wait to come back and try it all. Our waiter was very sweet. This is a bit of a hidden gem. I don't know if I would have gone here if I hadn't been tipped off about it. Ok so glad I did and can't wait to return.", "author": "Rose N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-19", "description": "While searching for \"soup \u0026 salad,\" this place showed up - due to its complimentary soup \u0026 salad.\n\nFood is unique and the portions big.  Had the saltad and foul - both of which I would eat again.  Veg platter was nothing to write home about.  Then again, is it ever?", "author": "Adam R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-07", "description": "Excellent lamb haneth, excellent bread, and nice place. Not fancy tho if ur looking for class! Also it's really affordable!", "author": "Tina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "I love this place. \n\nGood for both meat eaters and vegans. \n\nOther reviews cover the basics well. \n\nI usually skip the lamb shank because I want something more saucey to go with the lovely bread. \n\nI come back to the hummus with chicken or lamb and the lamb or chicken curry. \n\nI love the free soup the give with entrees. \n\nMy vegan gal puts together sides and loves it. \n\nI always eat too much bread and leave stuffed. \n\nIf you are shy about ethnic restaurants that seem like a clubhouse,  don't be here. The staff is very friendly. \n\nMostly families and couple eating here. Very celebratory meals.", "author": "Erik F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Their lamb hanith is the best dish. So tender and juicy and the bread is even better. Great legit Yemeni food.", "author": "Halla D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Authentic food. Quick service. Friendly staff. Could be a little cleaner. Rest everything is good. Do check it out.", "author": "Alshami A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "Amazing food, great quality, at an unbelievable price. This was my wife and i's happy Christmas surprise with most other places closed. The place was packed yet we only waited a few minutes. We had their lamb house specialty made for 5 hours in a slow cooker....mmm mmm good. This also came with traditional flat bread, soup, and salad. This was enough for two to share. Great choice when your craving middle eastern.", "author": "Sean W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Its the first time I try Yemeni food it was very good! I had the haneeth meal, its mainly a piece of lamb that comes with rice, salad, bread and side sauce. The portions are huge enough for two! I ordered it to go, they were pretty fast to prepare the meal", "author": "Yasmina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "The chicken and lamb haneeth are amazing!!!!!! So is the free tea, bread, salad and soup!!!!", "author": "Reem S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "Everything here is the best!\n\nI've been searching for a good place that serves well prepared lamb (on the bone), not that Gyro or that kebab \"cubed\" lamb on a stick... No, I've been searching for authentic Middle Eastern style \"fall of the bone\" Roasted lamb and I have found it here at Yemen café.\n\nIt is a little intimidating as soon as you walk in the restaurant because everyone seems to know each other and you feel a little bit out of place, but they welcome you with open arms.\n\nFirst and foremost I don't even know how Yemen Café can stay in business giving away so much complimentary stuff, bread, soup, salad, tea, etc,  as soon as you sit down you get complimentary \"Clay oven\" baked Bread, (Fresh \u0026 piping hot), Hot Soup, and a large portion of complimentary salad for you to share with your table, before even ordering anything.\n\nI enjoy ordering a Pot of Bubbling hot Fava beans which is also made in their famous clay pot and come out piping hot with yet another order of freshly baked bread, and \"Haneez\", which is Roasted Lamb Leg over rice and Sauce is the Best here at Yemen café, I Love Love Love the food at Yemen Café, everything is always Fresh Tasting, made to order, and always provided with fast service and friendly service.\n\nAt the end of your meal they give you complimentary Hot Tea which is the best damn tea I have ever tasted, the Tea is served sweet and tastes like you are in the Middle East.\n\nI have visited Yemen café twice this week for dinner and I can't wait to visit the Middle East again!", "author": "Leo L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "It's not an experience of eating food at this place. It's an experience of embracing a new culture. I love the simple local Yemen photos on the wall. I also love eating next to Yemen guys under the same roof. \n\nI am not a big fan of grilled meat. But I found three things amazing at this place. If you order any entry, you will get complimentary nang, soup, and salad. The special chicken soup has a dark green color and it's so good! There is also complimentary Yemen black tea but they don't serve it to you on the table. You have to take it by yourself at the counter. The tea is amazing as well, full of flavors. Don't miss it. \n\nIf you enjoy the soup, the tea, or any special meal at this place, I have a good news for you -- there is an original Yemen grocery store right next to the restaurant. If you have ever been hooked to food not from your own or familiar cultures, you know what I am talking about.", "author": "Cecille C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-08", "description": "Just had dinner there and the starter of the soup and bread were both tasty. The broth had a richness to it which I found out later was due to it being lamb broth.\n\nThe appetizer of sizzling foul was very good, but with the addition of hot sauce, which you need to ask for, it makes the foul almost perfect. If you eat it while sizzling, it will burn your tongue. For the meal, had feitah and leg of lamb. The feitah was ok (I have had better) but the lamb meat fell off of the bone. It was cooked to perfection.\n\nThere is warm spiced tea in the front - just add a little condensed milk and it's a great after dinner digestif. The decor is minimal but the food is certainly worth a trip to Brooklyn.", "author": "Tony T."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}