{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "This place is special. From the service to the ambiance to the FOOD its all superb. My friend ordered the Lamb Haneeth and I ordered the Lamb Salta: both were delicious beyond belief. And it came out very quickly. Definitely a place worth checking out!", "author": "Syed A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Very authentic atmosphere and food.  The food at this place was awesome. Lamb is the name of the game here, the babaganoush was complex and addicting -- and the bread was incredible.  Next time I want to try the hummus as an appetizer as well.  Make sure you get yourself some of the complimentary tea, it's sweet and strong and a perfect compliment to the down-to-earth and yummy food.  Relaxed and family-friendly atmosphere.  Please also note the place is alcohol-free.  Reasonable prices for the quality and quantity.  When you order, ask to see the size of the dishes, they are large portions.", "author": "R H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "I am very picky about my Middle Eastern food.  I have eaten some of the best Middle Eastern/Arabic food in Jordan, Turkey, and Israel/Palestine.  Especially coming from a family where my grandmother made homemade fasolia and other Middle Eastern dishes that they serve here at Yemen Cafe, this is some of the closest to home cooking I have found.  My grandmother's food was different, but the food here is definitely full of love. \n\nFrom the freshly baked bread to the tender lamb and vegetables, you can taste the love. The spices are familiar yet always new in my mouth.  And for the price, how can you go wrong?  Where else in NYC can you get fresh lamb soup, delicious fresh bread, and a nice green salad are all included. Nowhere!  My friends that had never had Yemeni cuisine loved it as well, which made me happy.  The only thing is the service  could be better.", "author": "Marissa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "My favorite middle eastern restaurant. Their lamb dishes are consistently delicious. The service is quite quick.", "author": "Aisulu M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Love this spot. My go to quick yummy middle eastern spot. \n\nFood is delicious and the staff is friendly. \n\nA small group of us went and ordered the Lamb Haneeth. It is a must try. They give you huge portions and the meat just falls of the bone. Their chicken dishes are good too. Their rice is delicious too. \n\nThey actually start you of with a traditional lamb broth soup and humongous pita bread. You can also have free unlimited Adana tea. \nThey only have one type of dessert. If you have a sweet tooth you should try.", "author": "Promee K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Very hospitable restaurant. They gave us a free soup right after we sat down. The entrees are also very generous. My wife and I shared the Lamb Haneeth, which was delicious. It was tender and fell right off the bone. \n\nTheir prices are very reasonable. Great place for authentic Yemeni food. Would love to return soon!", "author": "Brian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-01", "description": "Had a long layover in Brooklyn a few blocks away and was dying to try this place because of the stellar reviews. I decided I had to order the lamb haneez, which happened to be what everyone around me was eating also. In addition to the ginormous hunk of meat, the meal also included rice and veggies, a green salad, lamb soup, and bread the size of a large pizza - a slightly embarrassing amount of food for one person but so worth the food coma it put me in.  \n\nThe lamb soup...oooh...t's just broth, but seriously the most flavorful liquid you could slurp an entire pot of. The haneez itself was amazing. This was my first experience with Yemeni cooking (though I am an Arabic food connoisseur), so I'm no expert on haneez, but I can't imagine it could get any better. The lamb was so flavorful and tender, no knife necessary, and perfectly seasoned and complemented by the rice and veggies which were cooked in traditional Middle Eastern spices. Every bite was even tastier than the one before it. This dish will keep me coming back every time I'm in town!", "author": "Josie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "I do not eat lamb. But I did. I ate it here and I loved it. That's all I'm gonna say. Coz the rest have been covered by the rest of the folks here - the humongous pita bread, the amazing everything else. Just go and eat here. Period. You'll never view lamb the same way. If you do eat lamb - you'll love it even more. And if you didn't - you'll start eating it!!!!", "author": "Roj A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-02", "description": "Definitely worth the trek! The lamb is so tender and literally will fall of the bones. The broth is gamey but worth it. It's light but packed with flavor. You will want to dip the bread is everything. It's nothing fancy but you will feel like you are at home. Comfortable and delicious.", "author": "Eve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-09", "description": "This place was super yummy. This was my first time having yemen food and I am definitely going back to yemen cafe. I had the Haneez - slow roasted lamb with rice and veggies. Slow roasted to perfection, and was super moist. The bread was warm and huge. I think I need to try the hummus next time. You also get free soup.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "It's a great restaurant. It's contained many kind of Arabic food and it's very delicious.", "author": "Mohammed K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "Before I talk about my experience here I want to talk about the experience of the guy who sat at one table away from me. \n\nWithin two seconds after he sat down, the waiter immediately handed him the menu. The guy said\" I don't need the menu. Just prepare a dish that can be served within the next 5 minutes.\" Just like that, this waiter came with the usual free appetizer which is a salad served with a spicy red tomatillo sauce and the dish of piping hot flavored basmati rice with some sort of chicken. Yes, 5 minutes on the dot. Talk about efficient! These guys know how to hustle! \n\nOn the other hand, I took my sweet time and ordered the appetizer Fassolia, which is a white kidney beans sautéed with onions, tomatoes that is served with this gigantic fluffy pie of bread. The appetizer blew my taste buds away with the complexity of its flavors all jam packed into this dish. This dish could have easily filled me up if I only ate that and the free salad. Of course, I had to also order the only vegetarian dish on the menu-mixed veggies with special sauce served with rice. And let me tell you, I licked that plate clean!\n\nI left that restaurant feeling overstuffed and walked like a pregnant lady with a food baby for the next few hours.", "author": "P-law S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "You can never go wrong with their lamb haneeth. We're here often just to have the delightful lamb served with rice and vegetable stew. The meat is flavorful, soft and tender. I usually have issues with the smell of lamb, but not here. They know how to get it right.", "author": "Tuba H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "Best soup, best foul, best curry dishes, best bread, the kababs are not like, the best, still pretty darn good though. Love this place, it has never disappointed.", "author": "Anjali T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "This place is what i call ( BEST OF THE BEST ) amazing food , great smooth meat \nMy favourite maindish Lamb Haneeth , my favourite place to have such an khaleeji arabian food, friendly staff.", "author": "R A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "I'd heard stories about how great Yemen Cafe was, but for whatever reason, I was reluctant to check it out. Shame on me!\n\nThe food was really good. I had the Haneez for my main course, and it lived up to the hype. Tender, juicy, great flavor. Maybe a little too fatty for me, but I was still really happy with it. The rice pilaf that they served was a bit on the dry side, but the lamb soup that comes free before the meal worked really well on top of it.\n\nHummus was fine. Baba Ghanouj was light and flavorful. At eight bucks a plate for each, a bit on the expensive side, but they have to pay for that free bread and soup somehow.\n\nThe atmosphere was the rare combination where there were families eating together, and tables of just adult friends, and neither seemed to be bothering the other. The severs were very cordial and they did an excellent job at making the place feel inviting.", "author": "Adam R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "Recently ate here and the food and portion is great. The rice is really good with the perfect amount of moisture and the lamb and chicken kebabs are great as well. You should try the specialty lamb, it was so tender it just falls apart so easily. I'd eat it everyday if they had delivery but unfortunately they only offer take out, which is quite the dilemma even though i live 2 blocks away lol.", "author": "Ralph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Lucky to get seated at a table for 4 at 8pm on a Thursday night. Immediately served the flatbread and soup (what a great idea!). Two appetizers and two entrees was plenty. Thanks to our city hosts for sharing one of their favorite restaurants.", "author": "Nancy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Excellent food, incredibly nice service, amazing authentic ambience, what more could you want? From the rich lamb soup that arrives at the table to start to the sweet spiced tea at the self-serve table to end the meal, this was one of the most fun and delicious meals I've had in Brooklyn in quite a while. Portions are huge so divide the price by two for the per meal rate! Don't miss the babaghanouj which is easy to overlook, it is as smoky and tart as any I've had and is absolutely delicious with the house bread.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-08", "description": "This is a 5 star place - I am giving a low rating to keep it under the radar and prevent foodies from mobbing my neighborhood favorite. Stay away yelp hordes", "author": "N T."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}