{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "I love this place and have been coming for over 2 years. You know this place is legit because the clientele seem to be mostly Yemenis and people from other Arab countries. Yemeni food is unlike any food you've had - it most reminds me of some combination of Middle Eastern, Ethiopian, and Indian. \n\nAll their dishes come with a tasty soup, a salad, and unlimited homemade bread. They are most famous for their haneeth, which is a delish slow roasted lamb with rice. However, my go-to dish is the glaba which is minced lamb sautéed with onions and tomatoes and flavored with a combination of spices that are out of this world. The loubia stew will knock your socks off.\n\nFor drinks, they do offer Hawaiian Punch but this is a Yemeni restaurant so you should get the Special Yemen Tea. It is located in a self-serve thermos in the back. I was a fool and poured the tea into one of the metal cups. Those are for water. Use the styrofoam cups for the tea and your experience will be much more pleasant.\n\nThere is a secret dessert hiding out in the appetizer section called Fatah with Honey. Get this. It is a divine combo of soft sliced Yemeni bread, honey, and black seeds. Make sure you get it with cream.", "author": "Nick T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "This place is definitely one of the stops for food if you are in the area. True Yemeni food. Clean and generous. I am a heavy meat person and I got to say wow. The cleanest lamb meat in town! Hummus is also one of the finest around. I will definately make another trip.", "author": "Young Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Why was I not aware how truly amazing Yemeni FOOD can be...?\n\nThis place is truly a hidden gem in brooklyn and I'm not sure if many are truly aware of how amazing a food experience one can experience here. \n\nFrom fresh, piping hot food in generous portions to the caring and hospitable service, this place is the real deal. \n\nOn the table served that day was the Small Sauteed Lamb (Lehm Segar) for appetizers, followed by lamb chops and the phenomenal Fahsah, which is a traditional dish combining shredded lamb \u0026 served bubbling hot in a clay bowl with warm clay oven bread. If i could post the video, it would do justice to the presentation and the magnificent creation. The fresh clay oven bread accompanying all the meals \n\nEveryone def. needs to check the place out and I surely look fwd to returning very very soon...!", "author": "Asim F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "My favorite spot in downtown Brooklyn. I always go out of my way to come here. Fresh food, friendly service. The wait might be a bit long depending on what time if day you go. But it's totally worth it!", "author": "Nina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "I don't know why I'm only writing this reviews after almost 2 years of visiting them.  I need to go back and relive the sweet memory of being the only non-Yemeni customers sitting in there.  Food was amazing both in taste and portion.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "On the very last day of my Dining Room class, we went to eat at a little, Middle Eastern restaurant located in the heart of Cobble Hill/Brooklyn Heights in Brooklyn.\n\nI've never really had Middle Eastern cuisine before so this was very new and different to me. There was 14-16 of us, so we had a family style for appetizers and salad and we ordered our own entrees.\n\nWe were each given a bowl of lamb soup which I thought was sauce for the pita bread at first, but I suppose you can drink it as a soup or use it as a dip too. Any way, it had the right amount of seasoning with just a hint of spice and tasted similarly to curry. The pita bread that was given to us is similar to Roti Canai. It had a bit of a crunch to it and tastes really well when dipped in the lamb soup. The waiters also gave us a plate of hummus and Baba ghanoush which I absolutely loved because there's eggplant in it. It complements well with the pita bread.\n\nThe Lamb Haneeth is one of the most popular dishes at Yemen Cafe and many of my classmates ordered it as did I. The lamb is slow roasted and served with mixed vegetables and basmati rice. I was really excited in trying this dish since it's one of the popular dishes and I love lamb! Everything was on point and seasoned just perfectly! The lamb was so moist and the meat had a nice shade of pinkness to it, really light, moist, and the best part was it fell right off the bone. This dish was really super filling!\n\nThis was a nice experience. It was different, but I liked it. I think I would give Middle Eastern food.Now that I have tried Middle Eastern food, it makes me wonder how Australian or even Portuguese food would taste like.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "OK kebabs and lamb chops but the clueless service detracts from the experience. Overall, not much better than what you'd get off a midtown food cart", "author": "Nic N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "We ordered foul - mashed fava beans in a scorching hot clay pot - and lamb heneeth - slow cooked lamb with rice and slow cooked vegetables. The lamb was soft and succulent. I've never had lamb fall off the bone so easily. Both dishes were flavorful and filling. Our dishes came with flat bread, salad, and a curry soup. The service was very quick.", "author": "Joseph T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-09", "description": "I want to say that I have been here twice. \n\nThe first experience was phenomenal. I came alone and it was a great surprise. I had never tried Yemeni food before and loved it. \n\nIt is a pretty busy atmosphere full of a large I believe to be Yemeni people, although I could be wrong. I don't want to stereotype. Regardless it seems to have very authentic food based on the staff and crowd. \n\nEverything I tried, which was largely whatever the waiter recommended to me was amazing, really flavorful and delicious. \n\nThe second time I came I was super excited to bring a skeptical friend and man was I disappointed. The place was super busy this time borderline raucous , there were kids literally walking on tables, which made us hope that they clean them all very well after each customer leaves. \n\nWhile that would have been enough to reduce my original five star impression it was really the food that was disappointing as well that dropped my review all the way down to two. \n\nThis time I tried to  order myself and ordered to lamb dishes which were described elaborately and seemed amazing. The first one was decent, very tender although not as flavorful as I had expected or desired. The other was the kababs which really were only one star quality. \n\nThey were extremely tough way over cooked more than a little charred on the outside and completely flavor less. We didn't even finish them they were so bad. \n\nUltimately, I was super embarrassed I brought someone here and also completely disappointed by experience.", "author": "Carlos P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-16", "description": "Food is below average \nWe had the fahsah and lamb haneeth which apparently were their best dishes and we were not impressed \nWe also had the kibdah \"lamb liver\" which was great \nService was great as well", "author": "Osamah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Don't know where to start. The Haneeth is good. The Saltah is good. The khubz is good. The fatah is good. And nothing beats Yemeni tea.", "author": "Yasir A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "A classy and pure middle eastern delicious food.serving is nice fast service.their lamb dishes are marvelous super tasty.i would highly recommend if you are looking for some sort of authentic middle eastern food.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Tried lamb and tea.\nGot complimentary bread and soup as well, bread and tea was really good, lamb was just right softness", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "If you have ever had an encounter with a Yemeni person you probably know that they are extremely hospitable and they are wonderful hosts.\nYemen's Cafe is not at all fancy, but it has that cozy feeling as if you have been invited to a Yemeni's house!\nEverything is served in trays and is sharing size.\nEverything is exploding with flavors.\nAnd everything is so insanely good I am getting hungry as I am writing this review.\nI highly recommend going here in a group of 4-5 (even more if you are lucky enough to have more awesome adventurous foodie friends).\nif it's your first time here and you have no idea what to order, try the foul for appetizer (keep in mind that they bring you a lamb soup and a big bread (for the table) and a salad (for the table) on the house for starters) and the chicken zorbian and the lamb haneeth as your main dish.\nAnd get the number 10 on the menu as a dessert (Unfortunately I was too focused on the flavors to memorize everything on the menu!!)!! It is listed under the appetizers but it's sweet and makes a great dessert, that is of course if you still have room after all that yummy food. ^_^", "author": "Nazanin Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "We went as a family a few nights ago. Checked the reviews here before we went but were also referred there by a friend. The restaurant did not disappoint. The lamb was cooked to perfection and fell off the bone. Great restaurant.", "author": "John D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-26", "description": "I simply can not see why this place is so highly rated.  The place was packed when we got there so we had to wait for a table.  Once we were seated in the tight, dingy looking dining room, the food right away started coming out.  The meal started promising, a wonderful lamb soup and a nice salad.  Then, as quickly as our orders were taken, our entrees came out.  Chicken haneeth was over cooked, dry and not seasoned at all.  Even worse, chicken agda had absolutely no flavor what so ever.  Could've benefitted from being served with a more fragrant basmati rice instead of the plain white rice they served with it.  Service was quick and friendly.  Prices are fair for the large portions you're given.  I just wish the food wasn't so bland.  I do not recommend this place at all.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-24", "description": "Great food and service. It's pretty rare to find a place that serves fresh food and it comes out fast \n\nTheir most famous dish is the lamb Haneeth. You will surely walk out of here with a full stomach. I have been coming here for years.", "author": "Ed M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Really tough to review this place, took the train with couple of friends @ lunch time to get a bite there, been there been before and liked the place. \n\nThe place is a typical Arabic (gulf region) restaurant, don't expect a fancy place, it does not look super clean nor super shiny, it has almost cheapest type of tables \u0026a chairs, \nbut the food really really really hit the spot, a fusion of middle eastern, Indian and maybe a hint of African food makes the Yemeni cuisine one of the most amazing kitchens in the world. \n\nGreeted by a friendly fella who ran to get us a beef broth soup (spicy) and bread. We all ordered Haneeth (a fall outta bone beef or chicken with rice). Food came cooked perfectly and spiced to perfection, tea was free after the good meal, and the bill did not have astronomical numbers no surprise :) ( we asked for the lunch menu which they don't offer unless you ask for it) \n\nHighly recommended.", "author": "Ameenii M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "We went to Yemen Cafe after it was written up in the New Yorker, and there seemed to be a lot of people there who had read the same review. I had a great experience and would definitely go again.\n\nTea - the tea is serve-yourself, and was really good. It's worth it to try.\n\nThe meal starts with a lamb broth soup that is automatically brought out. It was delicious and one of the best parts of the meal.\n\nWe had the Foul to begin, which is a mixture of fava beans, tomatoes, and onions that is cooked in a stone bowl and comes out bubbling. You eat it with the flatbread that the servers bring out. It was good, but not amazing. \n\nWe then had the Lamb Haneeth with basmati rice. The rice was just ok, but the lamb was the best lamb I have had in my life. It was extremely tender and really well seasoned. \n\nI cannot say enough about the service. The waiters were really nice, friendly, and helpful and everything came out very quickly.", "author": "Carolina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Great restaurant! Welcoming ambiance and very friendly service. You get free soup and salad before your meal and unlimited flat bread throughout. And the food tastes amazing. The chicken curry was hands down the best I've ever had. It was so flavorful - almost like a firework in my mouth. The lamb haneeth is a little dry in places, but overall a good dish. I will definitely go back to try other dishes!", "author": "Tina S."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}