{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "Went here on a lazy Sunday since I wanted to mix things up a bit. got the roasted lamb that everyone else on here recommended and it did not disappoint - fell right off the bone! I also ordered some sort of bread/honey thing, but the waiter actually brought us something else saying it was better and if we didn't like it he'd bring what we ordered. Glad he did - it was great! (sort of like a bread pudding with honey thing, wasn't even on the menu so I'll have to describe it when asking for it again).\n\nIts a good mix of regulars who the owner goes around and chats with and random other people who are equally as welcome. Definitely has the save overall flavor profile of other middle eastern stuff but with a few different twists. It breaks up the regular kebab/shwarma circuit and offers something a bit different!", "author": "Graham R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "This is an absolute gem of a restaraunt. The best lamb I've ever tasted in my life, I couldn't stop thinking about even after I left New York. Also, the atmosphere is very laid back, and the free tea refills were great. The next time I visit New York, I will most definitely return to this place.", "author": "Joshua D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-18", "description": "Soup and tea is yum. This was my first experience with yemeni food, so I was expecting it to be somewhat like the food I've tried in Saudi. This place is very authentic yemeni food and huge portions for the prices. This place is worth it for someone who wants to give yemeni food a first-try (this is def better than the other places) and good for people who like yemeni cuisine. \n\nFor me, I just wasn't too impressed with yemeni food. It seemed like a mix of egyptian, lebanese, and Pakistani food and I think somewhere in that mix it became dry and bland. Good luck.", "author": "Asma S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-28", "description": "Try the delicious foul (pronounced, more or less, the way Mr. T would say \"fool\"), a large bowl of hearty fava beans that are stewed with garlic and topped with a drizzle of olive oil. It's served with a large, slightly smoky flatbread about the size of a tennis racket and similar to naan in flavor (though a touch chewier and a wee bit sweeter). The $5 appetizer easily makes a filling lunch.\n\nAlso of note is their zoug, the green Yemeni hot sauce that, I think, might be the single greatest new food item I've tried in at least a year. It's a crisp, slightly zingy mix of tomatoes (just a tiny amount), jalepeno peppers, cilantro, raw garlic, and blended onions that made me think, \"If I could marry a food item, this would be it.\" If you want just a little idea of how amazing this stuff is, try a spoonful of the house soup without it first, and then add a few teaspoons in before your next spoonful. You'd swear it's an entirely new recipe.", "author": "Dave L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-04", "description": "This was my first experience with Yemenese food last year and I didnt know what to expect. Im definitely glad I was brought there because their food was delicious. It's decently priced and the portions are huge, enough for two people or for dinner and leftovers the next day. Nice little place in bklyn heights, its worth trying, u might fall in love with it. Their chicken Zorbian is my favorite meal.", "author": "Omar A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-19", "description": "THE best Yemeni food in America! this is about as close as you can get to homemade Yemeni food. The roast lamb is BANGIN! the lamb chops were off the hook and the soup was delicious! I've had about everything on the menu and nothing disappoints. Who cares if the place isn't decorated and fancy, it's all about the quality of the food that counts....and the owner was kinda cute. Highly recommended!", "author": "Ahky A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-18", "description": "Very disappointed with the place. Draw long way to get here. Made my order and I got something completely different.  And the chicken they brought me wasn't even cooked good, still with blood by the bone.", "author": "Monika A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-03", "description": "The bread they give with every meal, it seems, is huge, and delicious-probably a week's portion of carbs right there. It's like a delicious naan, only tinged slightly more to a middle eastern palate. \n\nFood from the little I've tried has been great-full of spices and flavors. I just took out the shakshouka (pretty much an omlette) and it was mmm mmm good.\n\nMinus one star for the fear factor you kind of feel as a woman walking in there if you're not totally covered. During the day, when I walk here (it's really close to school), it's pretty empty, and there are only a couple of random arab dudes in there-old school arab dudes. This didn't happen to me today, when it was busy and I was also all covered up, but a couple of times that I've been there alone, during a weekday, and in a skirt, I felt kind of uncomfortable.\n\nOther than that-pretty much a great place. Also-they give free Arabic tea-great plus.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-25", "description": "Yemen Cafe is a wonderful place. There's not much by way of ambiance, but the service is always very quick and you can take matters into your own hands if needed (feel free to walk to the front and grab some of the complimentary spiced tea from the dispenser).\n\nThey don't have my favorite hummus or eggplant dips, but getting anything as an appetizer is worth it for the huge round of freshly baked Yemeni flatbread that they serve them with.\n\nAs for main courses, you really do need to go with the roasted lamb. The prices have crept up a bit for the dish in the past few years (I think it's up to $16 now?) but you'll get enough roasted lamb for a serious meal, and likely enough to split between two people. My wife orders one of the chicken sautés that she usually likes as well.", "author": "Jeffrey P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-13", "description": "Ahh yemen cafe! So much to say about this place, where to begin :) Rarely have I had a bad experience. I say the busier the place, the better! Their roasted lamb and chicken pull apart like butter, served on a bed of pilaf or with bread. I've tried pretty much everything on their menu. The hummus with lamb is delicious, as well as most of their slow roasted lamb and chicken dishes. I also love their salad dressing, almost like a spicy, minced garlic chutney which goes great with pretty much everything on their menu. The complimentary spiced black tea is definitely a plus, I always have several cups before, during, and after my meal :) A great place to have a filling meal. Be sure to come on an empty stomach, as their portions are pretty huge!", "author": "K M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-01", "description": "Holy cow, or should I say...holy lamb!\nSo much food in one meal!\n\nCame here with a group of 6 the other night.\nWe were seated quickly and given menus.\n\nWe ordered some hummus and our dinners and waited for just a few minutes..and then the feast of food began!\n\nAs we were snacking on our hummus and the traditional bread (which is like pizza sized), out came some lamb broth.\nImagine chicken broth, but lamb-y and tastier.\nThen some salad with a herbed dressing. \n\nThen our actual meals.\nAs someone who had ordered off the appetizer menu for her entrée (the small sized lamb dish), I was impressed that I still got the soup and salad.\n\nI only finished half of my small dish (which was really tasty!) because of all the extra free food that came with the meal. \n\nEveryone else seemed to really like their food as well. \nMenu seemed a little pricey when we first entered, but after leaving with  1/2 of my appetizer sized meal in a container I felt pretty happy!!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-08", "description": "15, Yemen Road, Yemen.\n\n.....\n\nNever in my life would I have ever thought that I'd be eating Yemen cuisine AND LOVE IT!  It's restaurants like these that makes these little ethnic bubbles in Brooklyn makes these neighborhoods worth visiting.\n\nWe stopped by here after a morning of rock climbing at the Brooklyn Boulder and it was definitely a hearty well deserved meal after much upper body exertion. \n\nThe restaurant looks like a chinese take out joint.  No frills. \n\nThe service is top notch.  So friendly.  No awkward conversations.  Always asking us if we needed anything.  More bread?  More soup?  Napkins?  Take out with extra green hot sauce?  On point, awesome.\n\nWe ordered the staple dishes, all delicious.  Always get the green chili sauce.  It gives all the dishes that extra acidity you need to put it over the edge into deliciousness.", "author": "Emma L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-25", "description": "I would like to give 4 stars for the dishes I prefer on the menu, but other dishes there (curries) are not so memorable (bland). Maybe it is in the Indian in me, but I need it hot and spicy!\n\nAnyway, let me boss you around and tell you what to order....err ..I mean some of the menu highlights:\n\nfoul madamas (fava beans \u0026 olive oil)\nfatah - try this as a dessert instead of appetizer\nroasted lamb - not highly seasoned but so tender, it falls off the bone...literally\naseed - dumplings w/ lamb\n\nThis place is very casual, and full of families. There is one waiter for the whole restaurant. Once you get your food, you will forget about the noise, the cold, and everything else. Major plus: soup on the house!", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-20", "description": "My husband and I were visiting Brooklyn, so I searched Yelp for restaurant ideas and found the previous reviews for Yemen Cafe. Thanks you guys.  This place is terrific. When we walked in the door, we were immediately hit by the fabulous scent of spices.  \n\nI got the curry chicken and my husband got the lamb. We both loved our dishes.   The complimentary soup is the yummiest brothy soup I've ever had.  We also got the to-die-for bread.  I'd love to go back and just try the foul, some hummus, soup, and bread. Aw, but then I'd miss the yummy chicken.\n\nI wish we had some place like this in the Boston area.", "author": "Dirgni J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-05", "description": "We went at 10pm for a late night meal. The place was packed. The single waiter really had his hands full. The only unfortunate thing about going so late was that they were out of the dumplings and fish plate special. \n\nWe ate the chicken curry, plain salad and hommos plate, which came with a type of Naan. Both were very large and tasty. The curry came with rice. There was more than enough food for the two of us.  I will go back just to try the dumplings. \n\nI wish I ate lamb, because that is the special and everyone was ordering it. \n\nThe sweat tea is pretty good.", "author": "oWEN w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-10", "description": "This is not a fancy place, it's a fucking canteen.  The food is truly delicious hearty fodder and it's served by charming badasses.  I also like the prices.", "author": "Tommo L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-15", "description": "I love the slowly roasted lamb and chicken with the freshly baked kubs (bread). The staff are friendly and all real food, no drama. I live in long Island but I drive here once in a while craving for my Arab Gulf food enduring the bumpy road and the shady neighborhood leading there but once you get there, it's heaven dude! Halal, undoubtedly.", "author": "J. M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "Yemen Cafe is just an awesome neighborhood cafe. If you don't get this place then you're just a dork, and you should be shopping at Sahadi's across the street. \nYes, the complimentary soup is usually salty, and the free tea is WAY too sweet, but those are FREE. \nEverything else is superbly done: from any of the meze, to the salteh, to the fatah. Although lamb is always the favorite dish, I think Yemeni restaurants understate just how well they dominate fish. So don't overlook the fish. It is VERY good! I usually ask to trade rice for bread as an accompaniment. They have their own tanour, and the bread comes out hot and fresh. (I'm salivating already)\nIt is GREAT for brunch. One time I walked in there after a wild night, still with the same clothes I left the house the night before, and had the honey fatah with some Baba Ganoush, and I swear it was one of the best breakfasts I've ever had!\nThe service is good. People treat you like they are happy to see you, and they mean it. The best time to go is around Ramadan, when everybody is breaking fast. It's also a very family-friendly place. \nI do have to say they have some competition now in Bay Ridge, with Bab Al-Yemen...", "author": "Jose E. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-23", "description": "Wow! This place is the real deal. I lived in Yemen for a year ages ago, and was absolutely transported back when we ate at this place. Everything was perfect, from the delicious lamb broth to the warm, soft bread and the lamb selta. The service was very friendly as well. Can't wait to go back!", "author": "Jen W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-12", "description": "This place recommended by a book (Food Lovers - Brooklyn) was a dismal disappointment.  For lunch, we took our guests from California excited to savor sme Middle Eastern fare.  We all ordered the roasted lamb.  Since I was famished, I eagerly dug in.  But after a few bites, I realized the food was LEFTOVERS from the night before.  It lacked the freshness newly cooked food offered.  For this restaurant to do this is an egregious faux pas.  Needless to say, we will never venture there again and warn other diners to beware of their ethical compass to stretch their profits...", "author": "William L."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}