{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "The Chicken Zorbian from Yemen Cafe is my favorite take-out dish in the neighborhood. It comes with a small side salad, a cup of lamb broth, and enough pita bread for 4 people. The dish itself is good for 2 meals (or more, depending on your appetite) and tastes fantastic with a fried egg over it the next morning. I feel very lucky to have a gem like this so close to my apartment.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "Located above a barber who also has his sign in Arabic, Yemen Café \u0026 Restaurant has been a mainstay on Atlantic Avenue for quite some time. If it were not for the tables and chairs everywhere, it would seem more like a travel agency, with pictures and posters showing off the Islamic republic and all of its sights.\n\nA group of six hungry men (that would later become eight) was feasting on bread and salta as we walked in, exactly the dish I had returned here for. Yemen's national dish is a slightly spicy meat-based stew that is spiced with fenugreek and served still boiling in a clay pot.\n\nShortly after we ordered (which consisted of two long waiting periods before and after receiving the menu), we were treated to a lamb soup, on the house. They also provide sweetened Lipton tea for all customers, free of charge. We felt welcomed despite the slow pace.\n\nAt lunch, the salta, served with a large bread called malouj, is only $9, but rises to $17 at dinner. The mixture was still boiling three or four minutes after arriving at our table, and neither of us had any trouble heeding the waiter's warning that it was indeed hot. Once we were able to mix it, we found the all the delicious ground meat, vegetables, and one lone piece of okra all waiting to be scooped up with bread.\n\nOur other selection was the loubia ($10), tender lamb pieces, some still on the bone, with a red tomato sauce that was subtley sour. The okra definitely stole the show of this dish, and outperformed the other vegetables and potatoes it sat next to.\n\nIn general, all the same dishes were almost twice the price on the dinner menu, so we decided that lunch was definitely the time to get a meal here. I look forward to returning to try some of the fish and chicken dishes that look interesting.", "author": "Jared C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-27", "description": "The food is ok. Nothing to go crazy for. They are a bit pricey. $40 for few pieces of chicken and lamb chops.", "author": "Anam K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "my friends kept ravin about this place and kept pushin me to go.  but its in brooklyn so i kept saying no.  you're tellin me there's no yemenese places in queens?\n\nso i agree to go finally one day and i gotta say, its pretty damn good.  well my dish was just ok.  i had the zorbian, lamb with rice.  meh.  but my islamic friend recommended the habeez.  shut up, i tell him.  i order what i want.  u don't own me. so the appetizers came out, lamb liver, yummmm.  very tender and tasty.  good start to my meal.    then my zorbian came out which was very average.  whats so special about this place?  i yelled on top of my lung.  i came to brooklyn for this?  my overreactive drama queen nature continued.  my islam friend passes me a piece of his habeez (big chunk of lamb...ass?) and says, eat this.  i ask why and he says you act like a diva when you're hungry.  \n\ni took a bite of the habeez and my legs quivered.  my pants soiled, my eyes rolled back and i fell to the floor shaking.  i found the holy spirit.  in yemen cafe no less.  might very well be the best thing i tasted ever.  well no, i still prefer king crab legs from city island.  but damn this is pretty close.  WHY DIDN'T U TELL ME TO GET THE HABEEZ, i yelled at my friend.  at this point, he's ignoring me.  how rude.\n\na few of my other friends ordered chicken dishes which were also just ok.\n\nso long story short, go here and order the habeez.  nothing else.  habeez and water.  thats it.  do it, do it now.  then head home fast, as its in brooklyn.", "author": "Steve W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Basic run of the mill southern-ish yemenite food. It's great. If you want to experience southern yemen at it's finest, wait  until you're seriously sick and go in for their brothy soup. It'll help big time.", "author": "M B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-13", "description": "The chicken kabob I ordered was fairly bland and the rice more so.  The hummus was good, but too fluid and dripped off the bread it was served with.  Speaking of which, the bread was the best part of the meal.  It was served piping hot and fresh.  \n\nThe decor (or lack thereof) at Yemen cafe could use some work.  I felt like I was eating in someone's living room, and not in a cozy, \"homestyle\" kind of way.  The service was friendly but not very attentive.\n\nOverall, not a bad experience, but a forgettable one.  I'd rather try one of the many other middle Eastern restaurants in the area next time.", "author": "BT F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-12", "description": "Usher - Oh my Lamb\n\nHaneed got a flavor like pow, pow, pow\nHaneed got a meat on stick wow, oh wow\nBaby let me order lamb\nThere's so many ways to eat ya\nBaby you can have some more\nThere's so many food on this plate\nGot me like, oh, oh, oh, oh oh, oh, oh, oh oh, oh, Oh My Lamb", "author": "Jim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-15", "description": "Please please please come here. There's no reason why you would not.\n\nI wish I could've reviewed this place like five minutes after walking out the door because it was probably one of the best, if not the best, eating experiences in my entire life. I can only remember the shredded-bread-lamb soup, the lamb shank, the delicious broth in the beginning, the bread in the beginning... and I just remember thinking, \"I know I'm Jewish and American and all... but can I please move to Yemen?\"\n\nBrooklyn's probably the next best thing though.", "author": "Gadi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "If you're looking for authentic Middle Eastern food, this place certainly will not disappoint! Walking in you feel like you're in the middle of Yemen, and it can be quite intimidating. But once you sit down and talk to the waiter he makes you feel right at home. We are vegetarian and although most of their menu is meat based, they have some great options for non meat eaters. We ordered the Fasolia, Foul, Babaghanoj \u0026 Hummus and all was DELICIOUS. They bring out complimentary bread and refill it without even having to ask. It's piping hot and literally the most amazing bread I have ever tasted. This place is definitely worth trying and although it might be a bit intimidating when you first walk in, you quickly forget everything when the food comes out!", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-18", "description": "This emporium of roast lamb with rice is a little dingy for the $18 price tag. It does remind me of cafe's in the middle east, but for my money it could use a little presentation. The lamb soup was spicy and tasty. Greasy atmosphere, happy clientele.\n\nMy girlfriend walks in and says to the first arab looking gentleman she sees \"2 please\". Of course he wasnt a waiter. Who knew hunger breeds racial profiling? I apologize.", "author": "Jack T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-22", "description": "I struggled to choose between 2 and 3 stars, and eventually settled on 2 just because of my own personal preference and expectations. Read on for details.\n\nThis place was highly recommended to me by a co-worker. I went with a few friends and found it to be very unassuming. The restaurant was a bit confusing when we walked in: there was nobody to tell us where to sit, yet it wasn't clear to us that it was a seat-yourself kind of place. The back wall has a window to the kitchen that looks like it's for to-go orders.\n\nThe menu was interesting because they printed the prices in the middle, with english writing on the left and arabic writing on the right. Since english flows left-to-right and arabic right-to-left, it has a really cool effect.\n\nChoosing what to order was difficult because it's hard to guess what you're going to get and there are no pictures for a Yemeni food novice like myself. I eventually settled on a semi-arbitrary lamb dish which was \"smothered\" in sauce. Another friend went super safe and ordered lamb shish-kabobs.\n\nBefore the meal, soup and salad were served. The soup was really just spiced lamb broth, as far as I could tell, simple but tasty. The salad was iceberg lettuce and some shredded vegetables with a splash of salad dressing. Then the main dishes were served. Each meal came with bread, which meant that we got two flatbread loaves for the table (1/2 for each of us, I believe was the intention). My lamb was literally that: an assortment of slow-cooked lamb hocks and rib-racks and parts, served in a bowl. It was not what I was really expecting when I read \"smothered in sauce\" because it was not covered in sauce at all. Don't get me wrong, it was tender, but not saucy. It was something like lamb carnitas, if such a thing existed.\n\nI guess I wasn't really expecting a bowl of lamb parts. But, maybe that's just my naivete when it comes to Yemeni food, or my fault for not ordering shish kabobs. Part of me wonders if this dish is supposed to be a for-the-table sort of meal where everyone grabs a chunk of lamb. Anyway, if you know what you're doing and you're ready for excitement I'd say go for it, but if you're looking for something predictable and you're not an expert, you have been warned.\n\nThe final thing that was mildly irksome was that the menu prices were inaccurate. After ordering and halfway through eating, we noticed that there was a sign in the back of the restaurant by that kitchen port that said \"due to the increasing prices of meat, all menu items cost $3 more than on the menu.\" I would have gladly paid $3 more, especially after seeing how much meat came with my meal, but I wish the pricing was more upfront.", "author": "Robert M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "My boyfriend and I came here on a Friday night. The place feels very authentic, the lighting is a bit too fluorescent for my liking, and the tables/seating are very simple. The service is very attentive, but not too friendly (which is completely fine since they were attentive enough to serve well and fast). \n\nWe ordered a TON of food not knowing that a salad and soup (vegetable?, dark, green, with a distinct flavor that I can't pinpoint exactly to describe accurately) and tea (very very very sweet) were complimentary. \n\nWe ordered the hummus for an appetizer, which came with a ton of naan-like bread (but a bit thinner and crispier and a bit burnt which I didn't mind). The hummus was good. For an entree, my boyfriend ordered the Zorbian which is a south Yemen dish with boneless chicken and rice -- the portion size was huge. I ordered the lamb chops which came with rice and a bed of vegetables in this fairly sweet sauce. I thought the Zorbian dish was just OK. The lamb chops were very but I ate them anyway (I eat anything!) but I really liked the vegetable flavor and texture with the rice (would most likely not order the lamb chops again).\n\nEverything was so hearty and carby and heavy! Although very good, I ended up not feeling so good the next day. I can't attribute it to the food here because my boyfriend was feeling fine and had no GI issues - and for that reason alone, I have to give Yemen Cafe 4 stars (although I still have bad memories of the day that followed). I would come back and eat here again!", "author": "Siv L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-11", "description": "I wanted to like this place much more than we did. I had Yemen cafe booked marked for over two years based off the great reviews and we finally got around to making it here on Atlantic avenue. Our table was dirty and had looked like it had been dirty for several rotations. It's tight spot, where when ppl walk by their butts are practically in your food.\n\nHighlights:\nThe soup everyone talks about\nHummus-super creamy\n\nLowlights:\nChicken curry \nDirty\nBad service \n\nWouldn't come back when there are so many great places in Brooklyn/NYC.", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-29", "description": "Exceptional food! This is not a romantic setting, and not sure if the folks don't speak English or like to make it seem that way :), but wow - the bread, salad, soup, and lamb were all mouthwateringly great!", "author": "Saira K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-25", "description": "15 mins walk from my apt, awesome Mideast dishes. Lamb, lamb, lamb, lamb, ok their chicken dishes \u0026 hummus are good too. But I love their lamb!\n\nQuick tips, don't order main dish for everyone, you will waste food unless each of you are really big mouth like i am. lol\n\nI think it's my start of discovering Brooklyn. ;)", "author": "Shijun K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-25", "description": "A decent place, with a bit of a cafeteria vibe- not upscale but tasty enough. Soup, salad, and flatbread akin to naan [but possibly called something else in Yemen?] come gratis as soon as you order. The soup was delicious and it was hot enough [which many restaurants can't manage] that it took time to finish without burning our mouths. The appetizer [I quite honestly am unsure if he were brought the foul or the fassolia, though we ordered the foul] was absolutely splendid- it arrives sizzling in a battered iron dish with another round of flatbread. It was arguably the best thing we had, in fact, particularly when spiced with the tiny dish of salsa-like green pepper sauce. I tried repeatedly to flag down the waiter for more of the sauce, but it was regrettably difficult to get his attention. The Yemeni Galabah was tasty, but regrettably a bit overcooked, rendering the lamb a bit chewy. The Saltah [with yet more flatbread! we couldnt' finish it all] came inexplicably vegetarian [this about halves the price, so one hardly feels cheated] but was still tasty so long as one didn't get -too- much of the whipped fenugreek in a bite- the stuff is exceedingly bitter on its own. Hoping for something sweet, we ended with a dish of fatah- chopped bread with butter and honey that was an interesting flavor and, as with everything else- a generous portion. In short, the place has tasty, generous portions for reasonable prices, but the service isn't terribly attentive.", "author": "Meredith B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "This place made me smile. The bread was ample and delicious (and gratis!) And the meet was perfectly tender. The chicken in my dish was so tasty but I didn't love the sauce. I had that meal for lunch and dinner the next day because the portions are huge.\n\nThe chicken and hummus appetizer was amaaaazing - I'll be getting that next time for my meal. Lastly, there was self-serve Yemeni tea that was very sweet but was a nice end to the meal. \n\nWe went on a very busy Friday, so we had to get someone's attention to take our order, but they were on it when we asked. Will definitely be back!", "author": "Carlyn W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "Got the Haneeth and Fahsah, it was amazing.", "author": "Ahad M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Awesome awesome awesome. Their haneez is stunning, esp with the tomato chilli sauce. Also have the fettah, and the sarta. This has been one of my favorite meals in a long time. Definitely coming back. FYI the haneez is basically the typical Yemeni mandi.", "author": "Zina A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-28", "description": "This is not a place for a date. You will be surrounded by people who are very loud and very rude. The food portions are ok. They serve you a big roti with soup which is complimentary. It's always crowded whenever I pass by. Just be ready to yell constantly because they will forget about you.", "author": "Salim K."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}