{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "Good: serving size.\nBad: slow service, overcooked meat, smoky air.\nTip: Come for a smoke and not for a meal.\n\nTheir lamb platter had more than decent size, rice and salad were flavorful. Though I'm still not sure if it was lamb, it tasted like seasoned overcooked pork to me. And I had to wait 20 minutes for my food to arrive. Meantime I inhaled quite a bit of smoke, almost every table there had a shiba on it. Its not a restaurant, it's a hookah bar. Nowhere near 4.5 starts from other reviews.", "author": "Peter H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Wandered into this middle eastern family restaurant around 6pm on a Saturday after reading the great reviews.  I was very hesitant until I stepped in and noticed that the crowd was mostly middle eastern.  We were lucky to be seated right away, but 15 minutes later there was a line.  \n\nWhen you sit down, a large falafel like bread about 14 inches in diameter, salad, and lentil based soup is brought out to you before you order.  I asked the waiter for his recommendation and told him it was our first time here.  Without hesitation he said number 19, the lamb, slowed cooked for 5 hours with a side of rice.  The dish is for one person but with one baba ganoush appetizer it was enough for two along with the presets.\n\nOne of the best baba ganoush I've had in my life and I've had many.  The lamb was very flavorful, moist, and fell apart with the touch of the fork.\n\nI would definitely stop in again if I was in the area and craving middle eastern cuisine.", "author": "Howie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-28", "description": "I've been here on multiple occasions and it's about time to review this place. \nLet's just put it out there... you don't come for the ambiance, you come here to experience some homey soul fulfilling Arabic comfort food. \nAfter growing up in the Middle East, specifically in the gulf, I can assure you that this place serves up some pretty authentic and delicious Arabian gulf cuisine. The menu isn't really varied enough, but what they do make, is made well. I typically order the lamb haneeth: a slow cooked lamb shank with pungent spices atop a bed of ghee infused basmati rice! It's so simple in its form and presentation but the flavors are developed, complex and delicious! I've had the chicken haneeth, the chicken tawook as well, though the lamb remains my favorite. It's really hard to find a lamb well cooked! If you are not a lamb eater, I sure think that this should convert you! I don't fancy their appetizers much, except their broth soup- I think you should save that valuable belly space for the main event. \n4 stars for food, prompt service and consistent quality, but still find that the management could improve restaurant appearance and also work on prices and portions as I feel it's too expensive! \nSahten", "author": "Mae A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-11", "description": "Oh man I did not expect this meal to be this good. The lamb was like butter, the salta was so hearty and soul nourishing. Even the little things like the lamb soup and unlimited tea were excellent. Plus this place seems very family friendly so bring everyone if you come!", "author": "David H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "This place was delicious! Omg! I ordered Lamb Haneeth and it was the most tender fall of the bone juicy delicious roasted meat. It's so well seasoned, unlike other places I've tried lamb shanks from. The platter comes with soup (also delicious) and salad. I think the soup is made with lamb broth so it's very hearty.  To top it all off, they have milk tea that's so light and tasty. It's the perfect balance of tea, milk, and sweetness! I would totally go back again, but only for special occasions because this place is quite pricy! Lamb haneeth is $22.95.. after tax and tips, it's almost like a $30 meal!", "author": "Farhana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "The most authentic Yemeni food in New York City hands down! Love going here for some homey comfort food and enjoying their oh so addicting tea with milk (karak)! I always get their hummus and their lamb haneeth which is super tender. Don't forget to get their spicy sauce which gives a nice kick to the rice.", "author": "Deanna A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "The taste is ok  and tasty but not wow\nThe quality is good\n\nThe quantity is very little especially the quantity of rice and even the portion of the lamb\n\nOverpriced \nI guess $22.5 for one meal like that is very expensive \n\nThey give you choice of tip start from %15 \n\nNot from %10", "author": "Elon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "This place is superb! I had the best Marag soup in my life. So flavorful and tasty. Everyone was super friendly. I finished off lunch with a chicken kebab. The meat was juicy and the rice was super fresh and yummy. You gotta come on down!", "author": "Sam R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "Their lamb soup is so delicious and so good for you! I absolutely recommend the place. Go for early lunch if you can- it's less busy then!", "author": "Ruta S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "A treasure. We were walking around the Brooklyn Bridge park on a pretty day and went in search of a late lunch. Once we sat down, items started appearing - bread, lemons, lamb broth (if you want it, I refused because vegetarian/vegan) before we even ordered.\n\nThe two of us shared the vegetable main (which I didn't deeply inquire into vegan-ness, I just went with it) and a starter of hummus. I was easily really full, and my friend who was on the edge of hangry, hunger-wise, was satisfied. Lovely place, has a nice bustle to it without being too overwhelming.", "author": "Pam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "My friend speaks very highly, and ever since we became friends has vowed to take me here as it was the best Yemeni food (outside of his mother's!) he's had, hands down. Finally, our schedules aligned and he was able to take me here! It's a far commute, but the area of Brooklyn is really nice and I don't mind it too much. We went near the tail end of lunch (~2 pm), and expected no wait (which held true). We were seated immediately, and since my friend speaks the language he was able to order everything for us (we were a group of 3, one of whom is vegetarian). We took a quick look at the menu but he ended up ordering for us: he got the lamb shank for himself, me the minced lamb, and our vegetarian friend the grilled vegetables. They served us their form of \"bread,\" which I don't quite know the name of but it looks like a thin pizza sized crepe that's crunch on the outside and soft on the inside (so.. good.. and it's unlimited through the meal!!) served with a small salsa of sorts. They also have this red tea that is self serve that is inherently a little sweet, to which you can add condensed milk (which I guess is a common tradition in the Middle East, that was also super good and complemented our meal perfectly). Each entree comes with a small lamb broth based lentil soup that was good but a little strong for my taste (I'm not much of a lamb person), but I was glad to be able to try. Our entrees came out pretty soon after that soup, and those portion sizes were HUGE. I'm a big eater and I couldn't finish my food! The plates are big, and your entree meat/veggie is served with rice. I had enough for lunch the next day. I had no complaints, my minced lamb was super well spiced and I enjoyed it very much. For dessert, again I don't know the name but it was the \"oatmeal-like\" consistency with honey and fresh whipped cheese. It was so soothing. I appreciate desserts that aren't super sweet, and the way they present this dessert was just perfect. A good end to a heavily spiced meal, I would definitely come back again, I wish I lived closer!", "author": "Carol L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "Every meal comes w salad soup and bread (Mediterranean hospitality). We had roasted chicken babaganush and fasulia. Everything was very fresh and delicious. We will be back very soon", "author": "Müge M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Middle Eastern restaurants are not that common in Manhattan, but I spotted a few of them in the Cobble Hill section of Brooklyn near Court Street. Yemen Cafe features the eponymous Yemeni cuisine. The country sits south of Saudi Arabia between Africa and the Indian subcontinent. Thus, Yemeni food would be expectedly cosmopolitan and differ from Levantine cuisine and its Mediterranean influences.\n\nAs soon as I arrived, the waiter served not just a glass of water but a bowl of soup. Marag (or marageh) is a lamb soup. Don't let its pale green color fool you. It's really good. It's also served hot, which I recommend letting it cool first. Immediately after ordering, the waiter gave me a giant bread that resembled naan. But it was the size of one's face! The bread was not awfully chewy and tasted good when I dipped parts of it into the sauce mixture that came along.\n\nI ordered the chicken zorbian, which reminded me a little of the chicken and rice platters that have become a staple at halal carts. But this is the real deal. The chicken wasn't dry and was cubed. According to the menu, it's curried chicken made with tomatoes and onions. They also used basmati rice, spring onions, parsley, and onion. The rice was colored red, presumably from the preparation, seeing that it was mixed thoroughly with the chicken. \n\nPrices for lamb are steeper than those for chicken. Every lamb entree is $21.49 compared to chicken, which was set back at $15.95. There is a huge discrepancy of the prices if you come during lunch. You'd pay $12.95 for lamb dishes and $11.95 for chicken. \n\nService was really quick and my food came in within 20 minutes of ordering.", "author": "Henry M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "If you're looking for a warm delicious middle eastern meal that reminds you of home, you're in the right place! Service is fast. Salad, soup, and bread is served to you as you sit down (a meal in itself, really!) and the portion sizes are large so split with a friend unless you're really hungry . Delicious yemen spice-infused tea (chai) with or without condensed milk is free as well. Also the patrons tend to be yemeni folk as well, which is a great sign. Good for big parties as the space is really big.", "author": "Isabella D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "After reading all the great reviews, I decided to try this restaurant as a change of pace from Sultan (my go-to place on Atlantic). The atmosphere was casual but nice adorned with pictures of the Yemen countryside (pre-bombing). I got the Lamb Haneeth. The lamb was fork-tender and the flavors of the stew/sauce were great and unlike what I have had in other Middle Eastern restaurants. Dinner was about $30. I really enjoyed it and would return.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "Really amazing lamb Haneeth.  Really amazing Kabsa, skip the kebabs it's not the kind of place for that.  Yemeni cuisine is unique and not at all suited for grilled meats but rather slow cooked desert meats.  Here is how it's done.  Lamb is spiced and slow cooked for hours until fork tender and the Kabsa is a rice dish slow cooker with chicken scallions and other delicious spices.  Tastes like it was cooked under the ground in a desert, just like in the Arabian desert.  Really delicious food I highly recommend.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Outstanding. Not only is the lamb the best lamb I've had (Lamb Haneeth), but the saltah (vegetable stew) is great, and the freshly baked bread keeps on coming! You also get a bowl of lamb broth when you sit down, and it's really satisfying--you might want to save it so you can dunk some bread w/lamb into the broth for an 'au jus' experience!\n\nI recommend ordering the Lamb Saltah that comes with a choice of Haneeth lamb or Massloug lamb instead of Lamb Haneeth dish itself: The only difference is you get a bed of rice for the Lamb Haneeth dish while the Lamb Saltah gives you a large bowl of the wonderful vegetable stew-- just keep enjoying the bread if you want a starch!\n\nFinally, don't forget to try the spiced tea!", "author": "Charles C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "The Lamb Haneeth and the Fahsah are incredible. The soup and bread they serve are worth coming in for alone. The place is absolutely delicious. I come every time I'm in the neighborhood. Service isn't super quick but always lovely.", "author": "Dee W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "Modest ordinary sitting place with great tasty food !!!\nI've been eating at the place for years and they always kept the same taste and the same quality, and I hope it will stay forever", "author": "Karl D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Love love love love love this restaurant. The staff is amazing, the food is made with love and always fresh. Everyone should try it!\n\nTheir tea is so nice, and they always welcome you with some warm broth. Their specialty is lamb soup, which is simply delicious. I would not recommend their chicken dishes since it's not really a specialty there. \n\nAppetizers are nice, and overall is greatly and fairly priced. We love having this restaurant in the neighborhood. \n\nPlease support your local restaurants!", "author": "Cristina M."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}