{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "I've craved this soooo many times since having it for the first time about 2 months so! The complementary bread and soup were my favorite parts of the meal, but the lamb stew was also delicious.", "author": "Jennifer O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Five stars don't come easily. Yemen Cafe earned them. Fantastic food, solid (if a little slow) service, and worth a trip back.\n\nThe amount of food they give you is INSANE. I got the Salta and the thing must've come with a pound of lamb. The dish was amazing, but I took home half of it. Bro got the mixed grill and loved it. Parents got lamb dishes, too.\n\nFor the appetizers, we got the hummus (delicious!) and shak-shoo-ka...which isn't really shakshuka. It was basically an omelet with peppers, tomato, and cilantro. it was good, but not traditional shakshuka in the Israeli sense of it. Still, excellent.\n\nOh, and the BREAD! Massive, fresh, and delicious. I could've eaten that stuff all. damn. night.\n\nWeird observation of the night: the male to female ratio here is ridiculous. I noticed hardly any women in the entire restaurant. Bizarre? Sure. But hey, whatever. Food was great, prices great, and I'll be back.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-06", "description": "Came in for lunch. There were only 3 other customers there and we placed our order for chicken curry and Lamb chops. The bread and soup were good (not sure if we were supposed to get salad too as part of the lunch special). 10 mins later 6 groups came in and they all got their food first (including a salad). When our order arrived 30 mins later they gave me a chicken kebab instead of my order and the lamb chops were tiny and were half bone.... the check came fast though.  Totally caught off guard because of the great reviews. Not worth the $28 lunch. We left hungry. Never going back.", "author": "Adeera T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "The classic yemini cafe, where you learn to share food. The spot is great. Food taste amazing. Very pricy though.", "author": "New Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "Wonderful seasoned comfort food, I ordered take out recently and the delivery was prompt and the food is scrumptious!", "author": "Sonya G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Awesome place. Super authentic. Nicest staff and the good is excellent. Super affordable. Very casual place and service is slow, but you will be enjoying so no need to rush anyway :)", "author": "Maria R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-27", "description": "I was motivated because a man I know is away from home and I wanted him to have authentic food from his homeland in celebration of Ramadan. I have never had Yemen food but after today, I will. The food was delicious. The servers were pleasant to this newbie to the cuisine. Most importantly , the restaurant is clean and the vibe inviting !!!", "author": "Cat N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Everything was delicious. Soup and hummus were excellent. Meat came right off the bone and was very tasty.", "author": "Brandon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "They gave us free bread, soup, and salad to start the meal - it's like we were in an Arab Olive Garden! But all jokes aside the meat was very tender. I ordered the Chicken Haneeth and it literally melted in my mouth. The portions are huge though so it might be a good idea to split it with somebody.", "author": "Humayra M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-13", "description": "The food is pretty good for what it is, but you really have to know what you're doing when you order. I found some of the dishes underspiced and did not appreciate having to pick through bones in the meat, but these seem to be deliberate choices that come with the territory; they don't make it bad, they just make it not right for everyone. The atmosphere is strong, and can be really great on a cold day. There are always people inside and conversations going on. I recommend giving it a shot if you live in the neighborhood.", "author": "Bernard S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "The haneedth is simply delicious and mouth watering! Pretty busy place and quite courteous too, they will give you free bread, salad, and soup before they serve your dinner and there's free tea aswell which is delicious.", "author": "Tauseef S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "Yemen cafe is one of my favorite restaurants every time I visit NYC both locations are amazing food and service the lamb haneeth is my favorite dish meat very tender this time had to order fahsah with tuna and have no words to describe bread is amazing and don't forget about the tea, staff always very welcoming as soon u walk in ur welcomed like ur home best of luck", "author": "Najm J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "My husbands choice to celebrate his birthday. The soup was delicious. Overall the food was very good and huge portions.", "author": "Arshiya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "Visited this place on a humble last night....and was I ever glad we gave it a go... a friend of ours from Yemen suggested this place to us. We arrived shortly before 10pm and the place was nearly empty. Within 15 minutes tables were filled with regulars and family alike. We were instantly greeted pleasantly and given the most delicious lamb soup one could ever have. It came with a spicy sauce and slices of lemon. The sauce is indeed spicy but somehow blends into the soup marvelously if used sparingly. Shortly thereafter, we were given with Naan bread and a Salad with dressing on top (all complimentary by the way) ....My partner and I wondered if we had ordered it without knowing...ha..turns out we didn't. \n\nFor the main course he had the Haneez and I ordered the Chicken Zorbian....I was accidentally brought the Lamb Zorbian and upon realizing it was the wrong dish he quickly hurried to replace the dish for what I ordered...after quick thinking, I decided to go with the Lamb Zorbian as I didn't want them to go through the trouble in preparing another dish. I am so glad I stuck with the Lamb because it was so delicious!!! The rice and lamb were seasoned to perfection. It was mixed together with a fusion of spices and flavor...I almost can't wait to try it again. \n\nTo sum it up, all aspects of the experience were one that I would not hesitate to indulge in again. The place is authentic in that you get a sense that they have been there for a while (good sign), the service is friendly and attentive and the food is delicious...AND the prices are decent considering all the 'complimentary' appetizers you get with your entree....so if you're up for a good meal, I would definitely suggest this place.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Amazing food!  It's loud, busy, and kinda hectic, but it's worth it!  The portions are large, and very flavorful, and the prices are very fair.  It's in the middle of Brooklyn, too, so it's easy to get to.", "author": "Yoshi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "I don't usually use Yelp much, but I'd feel ungrateful for enjoying their food so much if I didn't give them a glowing review. This is some of the best food I've ever had. \n\nLet me walk you through how your visit should go. \n\n1.) You come in and get seated. The first thing you should do is get a cup of amazing sweet tea up front. It's self-service and free. They have some evaporated milk you can add if you feel like it, and they'll bring you some lemon slices, I'd definitely recommend squeezing some lemon into the tea. \n\n2.) They bring out a house salad and lamb broth, also free. The house salad is okay but nothing special. The lamb broth is absolutely fantastic, especially when you add a lot (and I do mean a lot) of ground black pepper to the broth. They also bring out a sort of salsa that I really don't know what to do with. It's good, but I'm not entirely sure if you're supposed to eat it with the salad, the soup or the bread that you'll be getting with your appetizer. I generally just put it on/into everything. \n\n3.) Now, there's the agonizing choice. To appetize or not to appetize? You don't really *need* an appetizer, the entree is plenty of food, especially after the broth and the salad. But a lot of the appetizers are fantastic, and almost all of them come with limitless free bread hot out of a tandoor, which is absolutely amazing, too. Ideally, you're here with several people and can share an appetizer. If you're alone, I've gone several ways-- I've ordered an appetizer and an entree if I'm starving, and as a large guy with a healthy appetite I can generally just barely finish both without bursting, I've just gone with an entree, and I've even just gone with an appetizer and not eaten an entree at all. All valid options. \n\nIf you do get an appetizer, the lamb liver (Kibdah) and the hummus with chicken or lamb are stand-outs, but everything is good. The fatah with cream is also fantastic but more of a dessert thing, really. The appetizers are fine to share between two people or maybe even three-- they're like small-ish entrees in terms of size, and, again, come with limitless amazing bread.\n\n4.) Whatever you do, you should get the Lamb Haneeth as your main dish. That's not to say the other stuff isn't fantastic, it is, but it's their signature dish, it's great, and there's really no reason not to get it if this is your first visit. You can experiment with other stuff next time. \n\nIt's very simple-- rice with a little bit of sauce and lamb on the bone-- but really, it's so tender it will fall off the bone if you just look at it too intensely. Just peel everything off the bone-- the cartilage and fat, too, and if you're lucky enough to get a bone that's easy to crack so you can get the bone marrow out, do that. Just mix everything together so the rice can absorb the juices and fat from the lamb, and dig in. Would also be fine to share between two people, although at that point I'd probably share an appetizer as well unless you're both not particularly hungry. \n\n5.) I severely doubt you will have any room for more food at this point. If for some reason you do (maybe you just got an appetizer and skipped the entree, or shared the entree and no appetizer?), the fatah with cream (chopped bread sauteed with honey and topped with sweet cream and poppy seeds) is fantastic for dessert.\n\nJust enjoy and people watch during your dinner and I'm sure you'll be planning your return visit before you even leave.", "author": "Lucius Sergius C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "This place was my first time trying Yemeni food. The two things I tried here were safe choices.\n\nOne was salta, which is the national dish. This was a brownish and greenish stew served in a metal bowl. It comes with a very large pizza sized flatbread that you tear off and use for dipping in the salta. Taste wise, this dish was a little bitter due to the fenugreek, one of the main ingredients. It was okay, but did not impress.\n\nThe second entree we had was the haneez, which we got because it is listed on their menu as their \"most popular dish\". This was actually better than the salta. The roasted lamb was very tender and soft. It comes with rice and potatoes. The portion was average size. Other reviews mention receiving huge portions, but that was not the case with either of our entrees.\n\nIt was interesting trying Yemeni food. The food overall was average. There may be other dishes in this cuisine that might wow me more, but that is to be seen.", "author": "Tyler L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "I am so glad that I discovered this wonderful place! Upon first glance it's a hole the in wall, you might even pass it up walking by. Now this is a go to place for all of my friends and family visiting from out of town. \n\nFor $15 you can successfully have two people feeling stuffed when they leave. Unheard of in NYC! I like to order the chicken gelaph which comes with a soup, salad, and pita bread the size of seriously a medium pizza. \n\nEnjoy!", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "yum! I got the lamb haneeth and the meat literally slipped off the bone. so good, especially with the green sauce", "author": "Magdalene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "Delicious, authentic, very abundant portions.\nThe bread is sublime. Each lamb dish was excellent.  Self-serve herbal tea is always available from an urn.\nThis simple restaurant is filled with Yemeni folks, so it must be good.", "author": "Tina F."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}