{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "Best lamb on the bone I've ever had. The meat just falls off the bone. The bread is freshly made. I've never been to Yemen but the restaurant has a truly authentic feel. Go there you will not be disappointed!!", "author": "Samurai G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "Food is your typical middle eastern food with a twist.  We got the salta which was delicious and nicely seasoned.  It went incredibly well with the flatbread (which basically the size of two heads).  For appetizers we ordered the lamb liver which is mixed with a little bit of vegtables.  I usually do not like liver too much but I could tolerate this.  We also got an order of kabobs and the lamb kabob was good, however the chicken was a bit dry.  The rice was delicious though and I want to go back to try more food!", "author": "Sara H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "Arafat guided us the very international group to try Yemeni cuisine inside Brooklyn, at a warm, foggy night!\n\nGood place if you want to have all kind of lamb dishes. \nThe entry soup is amazing but be careful don't add two much lemon juice in it.\nAnd we even had special desert made of bread chops, honey, butter and cream, beautifully tasted!!!\n\nThe restaurant is also warm and family like.", "author": "Yi F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Great service and amazing food. Much better than their other location. Although it can get busy but the food time is pretty short. The only clean authentic Yemeni restaurant I eat at", "author": "Andy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "Every single part in the menu is fabulous !!. i recommend just having rice with a chop of meat,then, drink the most delicious Adani coffee afterwards\n\nDon't look at the furniture and decor, just look at the food and that's it :)", "author": "Faisal A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "Amazing wonderful food. So authentic. People don't understand the history of this place. It's been here for decades. It went through all of the many neighborhood changes that bococa went through. This place is authentic as it gets. Looks beautiful inside with great pics and a wonderful salt water fish tank. Gas service, kind service, free tea, free soup, free bread. Amazing!", "author": "Ali F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "Love this place! A friend of mine just moved into the neighborhood and we are making our way through restaurants on Atlantic Ave. The food is authentic, the restaurant is cozy and comfortable, and the portions are generous. On top of that, the bread and soup they give you with your meal is the perfect complement. Looking forward to going back soon.", "author": "Leila M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-21", "description": "2.5 stars... \n\nAt this point Indian food is the closest cuisine I've experienced to Middle Eastern food so I was excited to try this place down the street from me (which is in a block full of Middle Eastern businesses). I'm also a fan of lamb which is their specialty. Sadly I was very disappointed. Let's Tarantino this... \n\nI walk into the restaurant on a Tuesday afternoon, the place had about 14 people eating but was still fairly empty. Everyone there was Middle Eastern and many of the people seemed to be regulars, there wasn't a lick of English spoke except me and the waiter when he was talking to me. There were only men there, from the young to the old and it was interesting to see a couple of the older gentlemen in the corner picking the remnants of meat off a lamb skull (obviously not on the menu). The first menu I was given was the dinner menu. Luckily I had checked this place out on Menupages first and knew there were lunch prices as well. Once I asked for it, my menu was swapped for the less expensive lunch menu (I don't know if this was a subtle way of sticking it to whitey). \n\nI ordered their most popular dish, Haneez ($12 during lunch), which is seasoned and roasted lamb with mixed vegetables and rice. As with all entrees, I was given a soup (a tasty heavily seasoned green-ish heavy broth) and a giant (probably about 11\") naan type bread to start. My entree came, and the portion was ok but definitely not a lot by any ones standard (maybe dinner portions are large). The rice was good, the mixed vegetables consisted only of a couple pieces of carrot and a few green beans, and the lamb (the \"star\" of the show) was incredibly dry and under-seasoned. \n\nNext to me was a table of a few Middle Eastern guys my age eating what looked to be moist, juicy, large portions of lamb. I asked the waiter what they were eating. He told me it was the same thing as me. I don't know if they were giving me the crappy dry leftovers of something that was cooked a long time ago because I wasn't one of them and a smaller portion because I ordered off the lunch menu or what the deal was. I know if I ate here a few more times I could possibly have more attentive service and better food, but you know what? There are plenty of places in the city where I wouldn't have to make the gamble if I'm going to get awesome or disappointing food.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-24", "description": "Crap. This is my third 5-star review out of five total. I don't want to be that person, and I don't anyone to get the impression I am an overly positive person.\n\nBut got-dammit! I can't help myself. Yemen Cafe saved me from a recent Sunday afternoon hangover-related contemplation of suicide. Literally. One of those where your head hurts so bad that you start hallucinating and where your breath smells of a mixture of alcohol and stomach acid. The only consolation was that the previous night's events leading to this feeling of death were so wonderful that I really did feel like it might be ok to die. Maybe I really had lived my life to the fullest. But we all know that's BS and our instinctual struggle to survive and live another day keeps us from giving up even when we want to. \n\nAnd that's what I was dealing with in my head while stepping into this unassuming Middle Eastern cafe with three Ethiopian friends and a 5-year old Ethiopian brilliant basketcase knowitall girl (long story, let's just say I'm a proprietor of NYC's first Ethiopian vegan cafe http://www.yelp.com/biz/bunna-cafe-brooklyn. And yes that was shameless and I don't care). Mosque service had just ended and the place was packed with sober healthy people that just spent the morning pretty much doing the opposite of what I had done. We find a table though and within 3 minutes it went from empty to overflowing with food that we didn't even have to order. \n\nNaan -- as big as the table, combined with simple salad and a lamb broth soup and spicy pico-de-gallo-esque chutney to spoon inside. This was like spraying windex on the booze-filthy window of my abused brain. After three or four spoonfuls I remembered what it meant to be alive again and that was good, because this was merely an appetizer for the feast that awaited. \n\nMuch of it was a blur, but here's what I remember:\n\nFoul (fava bean hummus) -- flavorful, gentle, perfect warm temperature.\nHaneez -- succulent charred lamb with a rice pilaf. Seasoned perfectly, amazing.\nBone-in chicken -- don't remember the name, but juicy and tender. \nSweet tea -- self-serve, simple yet effective, I had about four cups.\n\nStaff -- friendly, attentive. The place wasn't by any means a visual masterpiece but there was an air of sophistication, confidence, and respect given by the owners and patrons that compelled you to do the same. And those aesthetics are the vary makings of a good restaurant that one wants to return to.\n\nI wish I could explain the dishes more, but this review is more about the spiritual satisfaction the food gave a near-suicidal man and how that might help other downtrodden souls down the road. All I can say is I will return again when sober and healthy and I expect to garner the same feelings of contentment and optimism that I received from this experience. I recommend you do the same.", "author": "Sam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Loved the atmosphere and loved loved loved the food. Tastes amazing, real authentic Yemeni food, friendly staff and very generous portions. We didn't even get charged for the refills of soups,  seconds of their awesome fresh baked bread \u0026 spicy dip. We had the Lamb Henez  , the meat was super tender and delicious, perfectly seasoned and rice. You have to have a cup of tea when you're done with your meal, their signature black tea with Cardomen is a great finish to a great meal. If we lived closer by, we would go more often but, i don't regret the 3 hour drive, it was well worth it =)", "author": "Zeinab H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Great food. Love their soup and salad before the meal!", "author": "Pratyush M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "The Kabsa Lamb meal, with incredible lamb soup, salad, and delicious tea included, is not to be missed.", "author": "reuben s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Honestly I recommend this place to all my friends. They have amazing verities of middle eastern cuisine. Starting with the heart warming soup they serve as an appetizer and ending it with a sweet cup of traditional Yemeni tea. The most famous dish they are very well known for is the haneez. It is the most tender roasted lamb I have ever tasted.", "author": "Nemah N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Lamb shank very tender.  Try the lamb salta dish which comes with an awesome stew.  They immediately bring awesome lamb soup and salad and large whole wheat pitas to your table.  Service is excellent.", "author": "Stan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Food was excellent. The meat was tasty and tender. Great soup. Bread was fresh. Flavor was just right.", "author": "Kris K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "Relaxed family and community atmosphere with a chance to order an affordable all-lamb mixed platter for your party accompanied by delicious rice, salad, flat bread and terrific bowls of lamb broth surrounded by travel photos, bejeweled daggers, and endless free cups of sweetened tea...", "author": "Marko H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "The Food is above delicious. Every dish is Heavenly made. Our Family's Favorite Restaurant.  Try every dish one by one. DELICIOUS.", "author": "Carolyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "I went into this cafe on my own and I was the only woman in the place the whole time! Totally reminds me of being in the Middle East. Authentic experience. Tried the lamb soup and the lamb rice. Both very good. The middle part of the lamb was very tender, but outside got slightly dry. Overall I would recommend.", "author": "Murphy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "this is a gem of a place, love the food. this is food you will not find in most place. the soup they gave with the meal was great, and salad was good. the bread was also very good. the lamb was moist and very good you could tell the food was made with love and care. the service was great. would go back in a heart beat.", "author": "Wendy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-28", "description": "We got there after 8 P.M. and this place was packed! The service was decent and their plate was huge!! We ordered Fassolia for appetizer, and Haneez, Chicken Kabab, Shish Kabab, and Chicken Zorbian for 5 of us. Every plate was yummy and tasty. Spices was just right...not too much. The reasons why I gave them 4 stars is because they always have bathroom issues.", "author": "Mami I."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}