{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "Hey! I wonder if this place in Cobble Hill is affiliated to Yemen Cuisine restaurant on 5th Ave corner of Senator Street in Bay Ridge Brooklyn?? In their reviews I have seen they moved to Bay Ridge. Anyway..... just an FYI .... the Yemen Cuisine in Bay Ridge is amazing too! Lamb Haneeth is on point! The Lamb Soup is heaven in a bowl!\nGo to the reviews for Yemen Cuisine and you will see my pix and all the great reviews also. Definitely blessed to have this spot near me in Bay Ridge! Maybe Yemen Café and Yemen Cuisine are sister restaurants?! Don't miss out and try them both!", "author": "Lorraine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "This is the best ever, friendly wait staff the owners are the nicest people. The food was out of this world", "author": "Katherine K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "I read about it in the New Yorker a few months back and Yemen Cafe has been swimming on the edge of my mind since. It did not disappoint. First, the lamb soup they give you at the start is delightfully gamey and spiced and I wish more places did a free bowl of soup with every meal as a palate cleanser. Second, get the foul appetizer. Foul is a pretty common dish across much of the world, and the Yemeni version is smooth and comes in a molcajete (I'm sure they have a different term for it).\n\nMy friend and I split two entrees. The lamb shank was excellent, but this other lamb stew, made of tiny cubes of lamb was forgettable. Prices are kinda high ($20) a plate but the portions are large enough that any plate could be two meals.", "author": "Misha T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "huge portions, friendly service, the openness to having guests linger after a meal even on a busy night, and incredible food and drink all make eating at Yemen Cafe a huge pleasure!!!!\n\nI would definitely go back. \n\nWe got:\n--foul ($9.95): sauteed onions, tomatoes, mashed fava beans served hot in a cast iron cauldron-like thing and eaten with tasty warm bread from the oven -- great start to the meal\n--chicken glaba ($15.95): minced chicken sautéed with potatoes and other vegetables in a curry sauce, served with rice -- not too spicy, just delicious \n--fatah with honey ($8.00): halva-like bread minced up with honey, served with cream (DO IT!) for a small fee -- so yum\n--chicken stew (can't remember the specific name, and the online menu isn't exactly like the one we used in person), but it was super tasty and served with rice \n--roasted half chicken with vegetable stew on the side -- my friend who ordered this ate it up so quickly \n\nThe small salads and soup that they gave us as extras for our meal were great, too! Honestly, we could have been fine with just the foul, two entrees, and the fatah. We had so many leftovers! The food was all great as leftovers, though..", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "This gem on Atlantic Avenue is one of my favorite places in the city, and given how busy it is every time I go there, I'm not the only one who feels that way. The service is friendly and accommodating but entirely unimposing - once you have your food you'll be left alone until you signal for the check. This makes for a lovely, unhurried experience that leaves you to free to linger at the end of your meal and have a cup of tea (or several) with your dining companions, rather than being rushed out the door so the restaurant can turn your table over quickly. The food itself is simple and delicious - everything I've tried has been flavorful and fresh. Soup, a simple salad, and bread are all included. Don't let the nondescript appearance/decor fool you - Yemen Cafe is well worth a visit, and then many more.", "author": "Kyra Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "Best authentic Yemeni/middle eastern food on the whole nation.\nDon't expect a very fancy atmosphere though, but who cares if you know that will have the most delicious food ever!\nI have tried almost everything on the menu and I lived the food.\nBreakfast: I would suggest Yemeni shakshooka and lamb Kebdah (liver).\nLunch/dinner: lamb hannez \n\nI live in New Jersey and don't mind driving to Brooklyn everyday only to eat this Yemeni food.\n\nDon't forget to try their tea/ or tea with milk after you fill your stomach.", "author": "Muayad A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Exemplary!! Authentic Yemeni food. So so delicious. Service is great, the waiter was very knowledgeable about the different items on the menu and helped us make our decision. We went with chicken salta and lamb haneeth. Both superb! We got our food in 5 mins, it was sizzling hot \u0026 fresh. Will come back when we're in Brooklyn!", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "The best Yemeni food in NYC hands down, generous portions, fine taste, excellent service and hospitality is perfect !", "author": "Rani S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "What a treat! Everything we ate here, lamb soup, minced lamb pastry and chicken and hummus plate was exceptional. A must stop for a flavorful middle eastern authentic experience!", "author": "Sara I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Lamb shaneeth-delicious. Super tender, juicy and flavorful lamb. Pretty moist rice. Stewed vegetables of tiny portion. Huge naan. Very chewy. It gets cold so fast. Complementary lamb soup. Mild taste. Lemon juice gives it an interesting twist in a delightful way. Salad-very good. Homemade dressing has a very exotic taste. Fattah with honey-excellent. Interesting dessert. Soft and sweet bread pieces topped with honey, butter and sesame.", "author": "Susan X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "Really tasty delicious food and great service! They started us with complementary soup (pea soup i think), we ordered baba ganoush for appetizers and fish of the day, which was a delicious trout. The only reason I did not give this place a 5 star is its a no frills kinda place, in terms of deco, food presentation, and overall vibe.", "author": "priya s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "I had a fabolous experience here.   My first time having Yemenese cuisine and it left me craving more!\n\nI had the Lamb Haneeth, it was perfect. \n\nReminded me of my mom's birria!\n\nThank you Yemen Cafe!", "author": "Jairo B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "Really delicious.  Funny enough, the main reason we came (lamb haneez) was probably the least memorable dish.  The foul was outrageously delicious - piping hot, the edges getting blackened - if you've ever made refried beans it creates something similar to the ring of slightly dried and crusty beans around the pot.  But these weren't dried and crusty, just crisp and delicious.  The soup they bring you to start was also fantastic.  I have to try the fatah next time, that looked great.", "author": "Edward J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Been a long while since I've ate here. Use to grab the occasional lunch here when I worked in the neighborhood. Was always a platter of various meats I preferred that day over rice. Was delicious but nothing extra noteworthy. This time around, came for dinner and tried something new. \n\nOrdered the saltah and lamb. Apparently saltah is the national dish of Yemen. Nice thick stew consisting of various spices, potato, eggs, and different veggies. Served piping hot and I really can't emphasize the thickness of the stew enough (when it cools, it solidifies). Dip the unlimited flat bread into it. Really really delicious. Definitely missed out on this the previous times I came. Don't make the same mistake I did. \n\nLamb was stewed forever. Extremely flavorful and the meat just sheds off. Friendly service and quick. Only thing I would change is bringing my own hot sauce next time. Provided hot sauce is not even remotely spicy", "author": "Leo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "BEST LAMB IN TOWN, EXCELLENT CHICKEN TOO.\nThe food is really tasty, the service is nice, excellent.\nBest value for money.\nI recommend, they deliver too !", "author": "Louiza H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "I went to eat here before a going to see a movie. The food and the service was absolutely amazing. Had I known that the portions were so ENORMOUS I would have come here after my movie because I would have loved to take my leftovers home. The prices are extremely fair due to the great taste and large portions. The pita is massive. My friend and I barely finished a whole pita. The menu is large, everything on that menu seems delicious and most of all authentic. You can tell this place is popular amongst the Arab community because it was packed for lunch. Even during such a busy lunch hour,  the service was prompt. The lamb is tender and full of flavor. I like that they use basmati rice. I'll def be frequenting this place.", "author": "Muhammad H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "The minute you sat down,  the waiter brings you the complimentary bread and spicy dips.  It chases the night chill away quickly.\n\nWe moved on to order a couple lamb dishes and looked at what other tables are enjoying and ordered the same.  They were all good and tasty and good portion.  No meal is complete until we had a sweetened tea drink (served yourself).  Just keep in mind, this place does not serve alcohols.", "author": "Kin N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "In the comfort of our car, we were looking for a place out of the ordinary, something different. That's when we came across the Yemen Cafe. \n\nWe walked inside and were seated pretty quickly despite how crowded the restaurant was and especially since we were a hungry table of 5. \n\nFood came really fast and the waiters kept giving us plates of bread after bread after bread. BEST DAY EVER! Bread was popping out fresh and warm out of the oven! \n\nI chose to get the lamb but it was a little dry. (The bread made up for it.) Overall, the food was pretty awesome! It was fun trying something new! Will be back!", "author": "Mikayla N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Good service. Enormous portions. Worth going to Brooklyn from queens at 8am type food", "author": "Sally G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-31", "description": "I don't get it.\n\nGiven this place was packed at 10pm on a Saturday night, I had high expectations. To add to it, the patrons there looked like people who would be familiar with Yemeni cuisine, which is always a good sign in my book. I felt like I was in good hands. However, I didn't find myself actually loving any of the dishes we ordered and rather disappointed by the sloppiness of the cooking. It may seem ungrateful to complain about complimentary sides, but the clay oven bread they gave to us was lukewarm and hard, with none of the fluffiness or chewiness I typically find in freshly baked pita bread. The Lamb Haneeth, though sizable, was not exactly fall-off-the-bone or melt-in-your-mouth tender. \n\nI suspect Yemen Cafe is one of those places that became famous for serving nostalgic, home-cooked food and then after establishing its reputation, recessed to mediocrity overtime. The sheer massiveness of the portions and the complimentary sides help to tip the scales, I suppose, but regrettably, Yemen Cafe does not live up to its 4.5 star rating.", "author": "Isabella S."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}