{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "One of the few places I would give a 5, but if you don't mind a hole in the wall and no frill \"service\" it doesn't get much better. The food was simple, unpretentious and spectacular. \n\nI had the Lamb Haneeth and the Saltah (vegetable and lamb broth stew). The lamb was perfectly cooked. It was fatty, salty and fell right off the bone. No knife necessary. The rice was fragrant and perfectly cooked and complimented with a meet and vegetable sauce. \n\nThe Saltah was flavorful with a great spice blend but you could still taste the vegetables and it wasn't too salty. The bread was amazing and perfect for sopping up the stew. Also definitely try the sweet honey tea. \n\nYou're not really assigned a specific waiter but anyone can help. They don't really speak to you but they're not rude and get the job done which is more than ok with me. I left with a big smile on my face.", "author": "Obediah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "You have never tasted lamb like this. The meat is well cooked and soft,you never need a knife to cut it. Don't come to this place looking for fancy decor,or fancy water glasses. Come here for the food. If these are your intentions, you'll leave a happy man. The complementary bread is to die for. The soup-complementary as well- is also to die for.", "author": "Mohamed A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "The food here is unlike anywhere in New York. Especially if you are on the hunt for some good, authentic Yemeni food, you need to come here! The lamb shank (haneeth) is super flavorful, tender, and goes very well with the okra topped rice on the side. The bread is huge, so bring all of your friends to share!", "author": "Sara A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "This place is sooo amazing i would have eaten there every weekend if i could!!!\n\nWe searched for yemeni food and found this place..the reviews were too good and we were tempted to try it for ourselves so me and my husband drove from Stamford just to have dinner there and it was WORTH it!! \n\nWe usually prefer chicken but we tried the Lamb and Chicken Haneeth over here and we were bowled over by the Lamb Haneeth..the lamb just literally melts in your mouth..\n\nThe complimentary soup and naan was good too...\n\nGreat portions...reasonable prices and amazing food.. I just can't wait to eat here again....you have to try this place !", "author": "Wafa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Great hummus, impeccable soup. When you dine in, it's very hospitable. I've been going here for years!", "author": "Mena A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "With a frame of reference I can safely say that IT IS BY FAR THE BEST FOOD AWAY FROM HOME.  A low-key and very simple restaurant. \nI travel from Philly just to tame my to die for Chicken Zorbian craving. Unbelievable!\nFour and half Yelps!", "author": "Sari A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "This place is no joke AUTHENTIUC yemen food. \n1. Enter with an open mind if you are closed minded culturally you will not like the enviornment. Lots of people eating there from the middle east, and its completely awesome.. It onlty adds to the great feel. Just walk in and find a clean table. Don't stand by the door confused like we did, just make sure its okay with the staff.\n\n2. Help yourself to all the tea your little heart deisres with some evaporated milk!\nThe tea is just plain awesome. \n\n3. Hummus straight ADDICTING! They also bring these huge oversized breads that they bake in a special oven to your table. The best part they keep asking if you want more(no they dont charge).\n\n4.The staff is so so nice and help explain what you are ordering if you aren't familiar with food from Yemen. \n\n5. Portions are big so i split an appetizer(hummus) with my friend and the chicken salta. The chicken was soft and great but nothing super special I ordered the Salta which was interesting it is a must try.\n\nOverall awesome place. very authentic yemen food. Not a romantic date spot but its tottaly somewhere to chill out relax and eat some authentic Yemen food!!", "author": "Marlena K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "Great food and service is on point! Our server recommended some really amazing lamb dishes and was super attentive. So much food and the prices were beyond reasonable. Will definitely be back!!", "author": "Kristin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "One of my fav restaurants when it comes to Middle Eastern food! The haneeth (lamb) is my top choice, followed by the shish kebab skewers. They give you so much unlimited fresh oven baked bread and the soup alone stuffs you up. Also suggest ordering a side dish of baba ghanoush! THE TEA IS A MUST!!!", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "Very unassuming place but delicious food, pleasant service, and great value! Came for lunch with hubby and our 1 year old. There are some steps to enter the restaurant, but once you enter plenty of room and high chairs to use. We had the lamb haneeth and the chicken stew. My favorites are the complimentary lamb broth they serve before the meal, as well as the fresh, clay oven baked bread that comes with most of the entrees. We had two large entrees, with enough leftovers to feed me for one more meal all for under $30.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Whenever the urge for Yemeni food kicks in, I'm glad and really thankful to everyone that recommended this place. It's flavor heaven, and my wallet sings its praises every single visit.\n\nThere are two locations, so make sure you take this over the other one that is too deep into south of Brooklyn.\n\nThe decor is straight up Yemeni, with the flair and feel of a very local mid-east kitchen from back home. Pure nostalgia for me, and their flavors are not easily forgotten.", "author": "Lou K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "While there, we saw a newly wedded bride in a simple traditional wedding dress having lunch with the family... Soooo cute... That was nice to see and the place is big enough for a big group of friends to gather.\n\n\nThe food was well seasoned... You get complimentary soup and salad before your meal... The bread is baked fresh and arrives super warm to the table which makes the appetizers more enjoyable. You can taste the seasoning in the food, got too full to order desserts or check for some but I'm sure it's traditional and good... :)", "author": "Fatima M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "Fantastic, unique dinner at Yemen Cafe. Come early because by 8 pm on a Friday every table was full with more people forming a line at the front!\n\nEvery main dish on the menu (mainly lamb or chicken options) ranges from approximately $15-20 and is served with soup, salad and unlimited bread. Let me repeat: unlimited bread. Huge, flat, warm, chewy loaves of bread. The friendly waiters walk around with these loaves fresh out of the oven and replenish your supply every time they see you are low. \n\nSoup comes first (very tasty) with your first serving of bread, then the salad, and then main dishes (with more bread of course). We shared a few haneez plates and salta plates. The lamb is incredibly flavorful and soft. The salta was my favorite as it is the tender lamb shank with a bowl of delicious, bubbling stew (okra and potatoes in a wonderful thick broth). The waiter was kind enough to explain how to properly eat it by wrapping the lamb in a piece of bread before dunking it in the soup. Fantastic!\n\nEverything was delicious, the amount of food was absurd (so much food we bought home enough for two more meals), it was inexpensive, and the staff was welcoming...looking forward to coming back and trying more dishes on the menu!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "I'd been meaning to come here for a while and it did not disappoint! Right away I was handed a wonderful savoury soup-- lamb broth-- a fresh salad, and a positively brobdingnagian roasted flatbread. But of course it paled in comparison to the tender, succulent, and perfectly flavored lamb haneeth, every word of praise all previous yelpers have heaped upon it entirely deserved. Considering this came with all the previously mentioned food, the lunch menu was an exceptional deal. You're also free to help yourself to the Yemeni tea, which, neither too sweet nor too spiced, is the perfect finish to a meal. I can't wait to come back and try more of their specialties, especially the fatah (which seems a cognate of a similar Ethiopian dish, fetira).", "author": "Kyle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "This is one of my top 3 restaurants in the city and for the value you can't beat it.\n\nThe staff is awesome and so friendly. The minute I walk in the door, they know my order and the soup (lamb based) is on the table with a good salad within 2 minutes. \n\nThe fresh bread comes out within minutes and the portion of the Lamb Haneen is giant and I never leave anything on my plate. The lamb is cooked low and slow and falls off the bone with the most rich flavor. I bring new people here all the time and people beg me to go back when they are in the city. \n\nThis is a place where I have never asked to see a menu. My Yemenese friends brought me here years ago and ordered me the lamb and I've never ordered anything else because it's so good.\n\nFor after finner I order the Fatta which is very unhealthy but so good- chopped bread soaked in butter and honey and baked with sugar on top.\n\nYou can't go wrong with Yeman Cafe, and I mean it!", "author": "Peter K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Just the best. The waiters are so kind and helpful, the whole experience is un-rushed and unpretentious, and the (complimentary) lamb soup and bread, plus our order of foul and lamp haneeth, were all warm and rich and delicious. It was such a treat to feel so welcomed and to try a cuisine so new to us, and we cannot wait to go back to sample everything.", "author": "L B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Wonderful experience! The restaurant had an authentic, homey feel and the customer service was genuine and friendly.\nThe food was awesome! Mind blown! It was my 1st experience eating yemenis food. I'm adding this as adding frequent spot when I'm in downtown brooklyn", "author": "Nadine A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "I had the saltah, and it was great. Flavorful but not picante spicy. Piping hot for a long time in the clay pot!\n\nThe bread was delicious. \n\nThe waiter was very friendly. \n\nI would most definitely go back.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "Mmmmmm the food was REALLY GOOD. We were recommended the Lamb and it was definitely a hit. Big enough for 2 people to share. It comes with Rice and a veggie sauce. The lamb meat is so tender and it really just comes off the bone. The honey bread with yogurt sauce is amazing as well. Omg, so sweet and moist and delicious. \n\nYou get pita as and soup as soon as you sit down. Service is really fast. \n\nThe tables are mostly in groups of 4, you can combine tables for larger groups. It was PACKED when I was there. It was also Ramadan so courtesy seating is 30 mins. or around that time. Lots of people were waiting inside and out. So be quick, at least during Ramadan. \n\nI think it's a great place to get some delicious Middle Eastern food. =)", "author": "Yuchen Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "2 options: fahsa or haneeth. Don't even bother looking at the rest of the menu, this is what everyone comes here for! My husband and I have been coming here for ages. We take everyone who visits us in Brooklyn here for dinner and they're always blown away. Food is always consistent. Expect a long wait time if you come here for dinner on a weekend. Service is ok but you come to places like these for quality of food, not service. Come here if you're looking for a hearty meal, you won't be disappointed! Bay ridge location is pretty solid as well.", "author": "A Z."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}