{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "I love this place. Unassuming, warm, friendly, fresh baked bread, incredible lamb, a homemade soup that I could eat every day. I only wish I had discovered this place sooner.", "author": "s. b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Definitely somewhere I'll come back to a lot! The food was juicy and perfectly flavorful.  Especially the rice (and being Iranian I have very high standards for rice), but I can say this was one of the best rice dishes I have ever had. \n\nThe chicken haneeth was absolutely perfect. The place was truly authentic food cooked to perfection. Complimentary soup and salad was also a nice touch!", "author": "Marian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "say whAAaaa???  I wish I came here sooner.  If you're looking for real authentic Yemeni cuisine, you must come HERE.\n\nWhile figuring out what to order, our server generously served a large piece of warm naan with their house made spicy tomato \u0026 parsley sauce AND...lamb soup. Comforting.  They didn't stop there, we got complimentary salad.  AND more naan bread.\n\nGet the...\n\n- Chicken Curry\n- Lamb Haneeth\n- Hummus!\n\nHeard the Saltah is good too, will be back. p.s. they do not serve Alcohol.", "author": "Helena W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "This place is fantastic- I love finding a spot like this with all sorts of customers conversing in the casual dining area. The foul is served in a clay pot and has a smoky flavor that is out of this world. Lamb haneeth is fantastic- tender and cooked over a long period almost like American pulled pork (although obviously no pork in this cafe!). I loved the fresh ingredients in this salad dressing. And the Graphic Design of the Arabic logo (which gives a shoutout to the founder Said) is cool too!", "author": "Jane S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "Stumbled on this gem. Doesn't look like much from outside or inside, but damn do they make some great food. \n\nIf I had a mother from Yemen, this is what I imagine my mom's home cooking to taste like. The lamb was falling off the bone tender. The chicken curry was very fresh. Everything we ate was delicious. \n\nHighly recommended.", "author": "Gregg M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "Lamb Hanith is outstanding. Rich flavour, melt off the bone tender.\nTheir lamb soup is also excellent. Warms you up on a cold day with a big spicy flavour punch.", "author": "Bing C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "This spot has some seriously good food and you know that when it advertises that they open until 11PM on the weekends but the kitchen was still serving food well after 11PM on a Sunday night when I'm there. First of all, they have some awesome tea. I could drink that tea -- All. The. Time. The tea is a little minty and when you pour the evaporated milk in, it gives it a little sweetness to it. It may also help to sit at a table close to where the tea is so you can refill on your own. \n\nWe placed our order and we each got a bowl of the hot lamb soup. It is a rich broth and cooked with a lot of spice. It was good to dip the bread in it. The food also came out promptly after the order: hummus, lamb with rice and fatah with honey (sliced bread with honey and butter). They are pretty big portions but everything is very tasty. I love hummus and this is pretty standard. I was pretty full just eating the hummus. I tried a little bit of the lamb (as lamb always reminds me of my friend's joke about \"eating my own kind\"). The lamb was cut into little cubes and I thought it was cooked a little tough for my liking. While it does have that trademark lamb-y taste, the spices and veggies that it was cooked in balanced out the lamb taste. They also make the same dish with chicken, so I think I would try that next time. I think the best thing I tried was the fatah with honey. I've never even heard of it much less tasted it so I was skeptical about it. It's hard to tell what it really is by the look of it. But once you try it, you just can't stop eating it. The bread is cut into little pieces and drizzled with honey and baked and then topped with this special flavored butter. It's like a cross between french toast and bread pudding. I think that may be the only type of dessert they have. \n\nThe downtown location is a bit out of the way for me, but they also have a location at Bay Ridge.", "author": "Nilsa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-16", "description": "I really liked the food here but I think a part of me wonders about the cleanliness.\n\nOnce you order they serve you a salad with this naan looking bread and hot sauce, oh and lamb soup. The soup and salad (with hot sauce ) was tasty. I once took a piece of the bread and there was this black thing inside. Not sure if it was part of the oven debri (which is expected) or some black moldy item. I cut that piece away and decided I was done with the bread.\n\nMy meal was the Haneez. The lamb was tender and delicious. The rice could have been better but it was warm and tasted like they got the rice from the bottom of the pan and then microwaved it. It was tasty but if it appeared \"fresh\" would have made it taste better.\n\nMy friend for the lamb liver app. I am a fan of these types of meat so I enjoyed them. \nHe also ordered dates..one was rotten (lol..he found as he took a big bite out of it..good thing he looked it at..ewww). \n\nI liked the iced tea. \n\nOverall I enjoyed the food. Many locals were eating there so that's a good sign for any ethnic restaurant. There was even a fight amongst to two customers (one owned the other $300)...dinner and a show? Who knew!\n\nOverall, I would come back but a part of me prays the food I'm enjoying is clean. I didn't want to ruin the experience by closely examining my Haneez. Didn't want to find anything that would make me hurl...like a toe nail..lol", "author": "Kemi A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-09", "description": "I went for lunch. But ended up getting a dinner dish because they only had what I wanted for dinner not lunch. Which was kind of disappointing because we had to pay a lot more and it was too big of a portion.. I couldn't finish it. One more thing about the menu if you are looking for Aseed they don't always have it they \"don't always make it\". Back to my dish.Honestly it needed more salt or spices or something it was REALLY bland. My sister had the same dish without the meat (she had the lunch porition we both had Salta) and she loved it. So maybe it's just me. But I need something with a little more kick and flavor.. and perhaps salt. My sister commented maybe they know people are worried about their blood pressure. Who knows. But restaurant was clean. I hear it is usually crowded but it wasn't. The waiter kind of deserted us but when they were around (several people waited on us) they were nice, polite and funny.", "author": "Andrea K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "This was my first time having Yemeni food and it was delicious! The lamb broth and salad (lettuce, cucumber, and their spicy and fresh tomato salsa/dressing) which was a nice surprise. We shared the shak-shookah and chicken haneeth which was plenty of food for the two of us. I wouldn't recommend getting the shak-shookah - it's just scrambled eggs mixed with veggies and no special spices or flavors... The mark up for this was pretty significant (nearly $10). The chicken was so tender and really fell off the bone, but the vegetable sauce that's mentioned in the description for the dish is very very minimal. Maybe a bite or two of the rice had it drizzled.\n\nAll in all a good spot to check out!", "author": "Mariko K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "My family and I had a great lunch at Yemen Cafe!  We found it by chance while wandering around Brooklyn, and everyone loved it. \n\nNever having had food from Yemen before, we didn't know what to expect, but we were all dazzled right away by our appetizers.  We had some sort of lentil dish and something else with bread/honey, and both were gone almost immediately. We were licking our chops while waiting for the main dishes. \n\nAs a vegetarian, I only had one choice, which was a bit limiting, but the mixed vegetables with rice was surprisingly flavorful, given the sauce they used.  My mom and aunt shared a fish special that they raved about and my other aunt really enjoyed her lamb.  Everything was excellent. \n\nThe staff was friendly, although not overly so.  Many of the other patrons appeared to be regulars. \n\nI would definitely come back here if I were in the neighborhood, although I would be sad that I'd be doomed to repeat the only vegetarian offering.", "author": "Jacky D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Walked into this place when I was in brooklyn to see a friend. What an authentic place!!!! Ambience, staff and food. So cordial. Lamb soup and house salad unlimited. With any entree unlimited house baked bread. The bread was by far the best part of the meal. Also, their honey and bread dessert is amazing. Coming back", "author": "Nish S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "If you love lamb then you must visit for the lamb haneeth. Wow! The meat falls from the bones. Juicy and loaded with flavor. Friendly service and bargain priced.", "author": "Sd W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-22", "description": "The positives- They give you a ridiculous amount of food to eat here. Too much. For starters they give you broth. It had a hint of curry. The hummus \u0026 flatbread is very tasty. Salad is ok. The main course was chicken salta \u0026 chicken kabobs. The kabobs were burnt. The vegetable sauce for the salta was unrecognizable \u0026 very salty. The dishes didn't have a distinctive taste. Everything tastes the same.", "author": "Fran D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "The best Yemeni food in NYC. This place is as authentic as it gets......delicious food ,great service and an amazing experience!  Love it!", "author": "D M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "We randomly stumbled across this restaurant as we were looking for a place to eat near the Borough Hall area. In fact, the whole street is a strip of Middle Eastern shops and restaurants. We decided to give it a try and it was a great decision. This restaurant isn't honestly that fancy in terms of appearance but that did not lower the quality in any way. For people from the Middle East and Southeast Asia, this place would give a \"homely\" feel as if you're back in a simple restaurant in your home country. Unsure if the portions would be large, I ordered the Chicken Zorbian (Chicken with yellow rice) and my boyfriend ordered the Chicken Kebab. He also ordered foul as an appetizer. It is basically a thick vegetable soup that resembles curry. We got SO MUCH complimentary appetizers while waiting. We were given a huge naan that was about 7-8 inches in diameter, lamb broth, salad, and a couple of other dips that we couldn't identify to be honest. Those were all good but we were shocked at how much they were giving us. The entrees came out right after and the portions were so huge. I cannot describe how much rice I got. I knew I wouldn't be able to finish it! Both our dishes were delicious. The chicken was fresh and had the right texture and flavors. We were stuffed and it felt like being overfed by your grandma. The food was not only amazing but evoked some emotions in us! The foul (soup) came out and that was interesting! It was sizzling (literally) hot and frankly were afraid it would explode in our faces. That tasted so good too! Overall I'd highly recommend this place and it's a great value considering both the portions and prices! Please check it out!", "author": "Ann P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "OMG! Lamb galore is more like it! The best lamb of any kind of lamb dish ever! Try the Lamb Haneeth, Lamb Chop, Lamb soup (free starter) \u0026 free amazing tea!", "author": "InDo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "Best Yemen food ever\nThe Haneeth is amazing. It is better than the food we have back home", "author": "Salman F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-07", "description": "For two years, I cultivated a relationship with the man who ran the bodega across the street. We'd tell jokes, or more accurately use small phrases like \"weird weather today,\" and then smile has he placed my two or three items in the bag. He saw me on the weekday mornings, bedhead still in tact and late for a meeting, he saw me three sheets to the wind, grabbing a too large bag of Doritos to consume before passing out. I requested a couple of items and they showed up a couple weeks later, and forever became part of the inventory. \n\nThen, one day, this man pointed a picture that sat next to the counter. He'd showed me this picture before, it was a small cabin in Southern Yemen, a home he built. \"I go back to Yemen,\" he said, and two days later he was gone.  A younger man with shoulder-length hair and fewer jokes took his place.\n\nI thought of this man when ordering from Yemen Cafe the other day. The restaurant is open long into the night, presumably to accommodate the taxi drivers, travel agents and bodega managers who frequent the place. I'm sure they are joined by professionals who live in Boerum Hill and points further afield, slowly working through their oversized meat platters and cups of sweet tea. As I went for takeout, no one seemed particularly close to entering or exiting the restaurant; this was a  place of respite. \n\nWe were in the mood for a haram alcohol to accompany our Arabic meal, so we took our containers to a bar three blocks down the street. Once I started packing did I see how much we erred in the ordering. Our chicken platter, lentils and lamb were enough to feed one fully grown camel, or eight or nine human adults. Each entree came with a large soup and a side salad, which we had foolishly augmented with a side of baba ganoush. \n\nUnfortunately this feast probably wouldn't pass muster with the majority of Sana'a diners. Even accounting for the transfer of moisture in transport, the chicken was a bit too dry while the bread wet. The baba ganoush was nice, but didn't meet the city-best offering at Hadramout. Speaking of that restaurant, which now seems permanently closed but is popping up (sans oven) in a nearby hookah bar, someone from the waitstaff should go over to kitchen at Yemen Cafe and teach them how to make a properly spiced fool. Like nearly everything else on the menu, Yemen Cafe serves up a reasonable but not exceptional take on the dish. \n\nOther, better options are available. You don't even need to head home for the motherland to get them.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-11", "description": "Went on Saturday night with my picky dad--he only eats super authentic ethnic cuisine--cue eye roll. He absolutely loved it. The dips were great, we got babaganoush and hummus and the fava beans. Fava beans could've used some salt. We also got the slow roasted lamb and it was so tender it melted in your mouth. \n\nFor people who enjoy Middle Eastern food, this is the spot. Not pretentious, not fancy, and super legit.", "author": "Gabriela M."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}