{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "My three friends and I came on an afternoon, the place was pretty empty aside from a few regulars. It's hard to rate the atmosphere beacause we only went once and were from out of town. The waiter was very sweet and helpful, and like most people, asked us where we were from and partook in smalltalk. Two of us ordered lamb and two of us ordered chicken. The lamb was delicious, hence my high rating. The atmosphere could be improved, but I'm not a good judge of that as we were only there for less than an hour at probably a slower time.", "author": "A B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "Yemen Café is located in Brooklyn Heights. This restaurant is very known for its Middle Eastern cuisine. This restaurants waiting distribution got mainly four and five stars. A tip would be to come early because this restaurant does not accept reservations. Some popular dishes at this restaurant include roasted lamb shack, bread, and hummus. While others really enjoyed the lentil soup and salad. The prices at this restaurant have increased but the portions have increased in size as well. The noise level at this restaurant is average but they do allow kids so sometimes it may get a bit noisy. This restaurant has no outdoor seating and it's best to go for dinner. When going to this restaurant make sure you dress in casual attire. The waiting time for this restaurant varies depending on what time of day you go but the most people usually wait would be 10 minutes. The staff at this restaurant a very friendly and the service here is very decent. You will not leave this restaurant hungry.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-26", "description": "I would have given four stars to this place a few years ago, but recently went back and was struck by the high (er?) prices.  Ah, such is the life of discovered restaurants.\n\nYemen Cafe is special for its atmosphere.  Mostly, you will find male patrons but sometimes women can be seen as well.  By far the best part of the dining experience is the flat bread which is more like pizza crust.  As a vegetarian, the only option for me is the vegetable stew which is perfectly fine.  \n\nThey have nice cardamom tea which you help yourself to at the counter.  You can pour the evaporated milk in it on the side.", "author": "Nikolas K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-09", "description": "When my friend and I went to this place, we were in the mood to try something different. This place, was just that! Although it was a bit on the pricey side, it was definitely a cool experience. We shared the Salta and the Haneez. The dinner came with unlimited bread, which is some of the BEST that I've ever had. It is extremely addictive, and light so save room for dinner. The salta was pretty good, a bit on the bitter side for my taste, but still good. The Haneez, a big lamb chop with rice and potatoes was AWESOME! the lamb was very tender. If you're ever in Cobble Hill or Downtown BK, check this place out. You won't regret it", "author": "Brian Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-09", "description": "I was heading down towards the river in DUMBO to have a solo dinner. No friends, no cell phone, no books- just me.  What more could anyone ask for?\n\nAfter being verbally and graphically accosted by some of New York's finest, I lost all sense of direction, made a few wrong turns, ended up on Atlantic Avenue and just went with it.  As I walked, I saw some Mexican and a little Asian Fusion, but I was not in the mood for either. A few blocks down,  I came across a little room with an awning that read \"Yemen [something or another].  \" This was great as I had never had Yemen food.\n\nUpon entering, I had quick second thoughts and almost leaped for the door. This place looked like some grandpa associated dominoes hangout-  flimsy tables, eclectic mix of chairs, and the poorest looking salt and pepper shakers I had ever seen. Not being one to shy away from a whole in wall, I ignored all this and decided to give it a taste. \n\nPerusing the menu led me to the lamb chops, which were accompanied by rice.   The food was made right on the spot, before my very own eyes.  \n\nLittle did I know that what was to follow would be none other than one of the best meals of my entire life to date.  The food was simple but incredible and awe inspiring. Succulent lamb, perfectly seasoned rice and some condiments that I am not too familiar with married well as I scraped the plate.  This is poetry in motion.", "author": "Timothy B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-20", "description": "DO NOT WANT, as the meme goes. I had a greatly underwhelming takeout meal there and I won't be back. I'm sure they probably do other things well, but my curry and naan was the worst I've had in both categories, and I won't even mention the rest. If my area was starved for options, I'd probably go back given all the great reviews of this place, but luckily that's not going to be a problem in and around Boerum Hill.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-24", "description": "This is by far the best Middle Eastern food I've had in all the 5 boroughs. There's nothing touristy about this place. Every time I go, it's packed with the local Arabs. Occasionally, you would see women in burqas. This is a good sign the food is ethnically authentic and don't conform to Americanized flavors.\n\nBefore you go, I do have to warn you this is not a place for romantic diners, stylish posers, or the rowdy sports crowd. It's pretty much no frills \u0026 very low key. Anyone would feel comfortable dining here alone. The decor is 70's bland, you would often see big families dining here, and there's no alcohol in house. Service is swift, friendly, and not so annoyingly chatty....5 stars well deserved! \n\nDinner comes with a complimentary bowl of lamb stew + a salad of lettuce, tomato, \u0026 olive with vinegar dressing. We ordered the foul madamas, a huge dipping sauce of crushed fava beans with tomato paste and olive oil. It comes with a large sheet of flatbread the size of a Wimbledon trophy. I love playing with my food :)\n\nMuch to our my surprise, there was so much foul madamas leftover we didn't have any more bread to dip it with. Not wanting to let it all go to waste, we each ordered a bowl of long grain rice \u0026 poured the remaining foul over it. It goes very well with rice. I keep coming back \u0026 order the same thing.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-17", "description": "I love lots of good food.  If you love lots of good food, this place is perfect for you too.  They mostly serve a variety of Yemeni lamb and chicken dishes.  I'm always a sucker for lamb and got a slow-cooked lamb dish served with rice and vegetables.  My friend got a chicken curry dish with rice.  Both were very tasty.  Both were very healthy-sized portions.  I don't know if this is typical, but they also served us a lamb broth soup and salad on the house.  The bread, which looks like a giant piece of delicious naan, comes with the food for free.  If i had known how big the portions were going to be, my friend and I probably would have just split one of the dishes.  Never fear, they can give you doggie bags for a reason!  I got another meal and a half out of my portion of the leftovers.  Even though I usually try not to take too many leftovers home with me, I was happy to have been able to try two dishes. I will definitely be back with my man.\n\nThe only thing that you might want to be aware of is the spotty service.  Everyone is very friendly, but I think it's another one of those great restaurants that has foreign food and likewise foreign ideas of customer service.  That's okay, though.  Sit back, relax, enjoy the food, and don't be afraid to ask for whatever you need!", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-05", "description": "Wow, total hole in the wall, didnt even give it a glance until it was highly recommended to me, and on one too tired to cook day, went to check it out.  Delish!  Started with lamb and chicken soups ( lamb especially was rich and tasty), good clean salads.  App was the hummus with lamb ( huge, warm breads with it)- was soooo  good!  The mains we had the most tender fall of of the bone lamb with rice, and boneless chicken with rice.  Both were very very good.  High accolades to this place.  Portions were big, so left overs for lunch tomorrow to boot,", "author": "M F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "Yemen food is new to me and I'm immediately in love. We had both bean appetizers - the charred whole beans and 'volcano style'/clay pot ones, while they look similar (although one is fava and the other white), they both tasted fantastic. My husband had lamb salta and his claypot smelled like salsa verde with a hunk of meat. The fresh bread, friendly service, delicious tea, and yummy bread/honey/butter dessert all made me want to go back. Soon.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "This place is one of the reasons I will miss living in NYC! Huge, delicious, portions, very reasonably priced. Very different from your default Arab food which is usually Lebanese or Egyptian. Most tender meat I've every had, great just-baked bread comes with everything. Great humous, and I'm sick of humous!", "author": "Peter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-20", "description": "So my wife and I were walking on Atlantic Avenue, no special occsion, we just wanted to have a meal.  We started discussing cuisine options (which, by the way, is a tough discussion between two Libra).  I'd say Indian, she'd say Thai, I'd say Tex Mex, she'd say Sushi...well, to make a short story long, we stopped in front of the Yemen Cafe, looked at each other (Neither had tried food from Yemen before) and decided to give it a whirl.  Needless to say, the food was amazing.  The tea is nice, the lamb was cooked to perfection, the Naan bread was fluffy and thick...yum... we decided on an appetizer of Hummus with Lamb (Very good)...I'd give it 6 stars, but the site won't let me...Keep up the great work Yemen!!!", "author": "Frank T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-23", "description": "I'm not Yemeni but I'm from the region and I know good Gulf Arab food when I see it.  I've been wanting to make the trek to Brooklyn for the past year or so to check this place out but I'm always outvoted by friends who want to go eat some Palestinian/Lebanese/Syrian or Egyptian food instead (which is more common in the US).  So when I was able to convince my husband and two friends to go yesterday, I was estatic.  The place did not disappoint.  The food was amazing and really cheap for the amount of food you got.  We were four people and we ordered one appetizer and three entrees.  That was more than enough.  We could have fed at least one extra person with that food, as we had leftovers.  \n\nWe made our way into the restaurant at 8:30 pm as everyone was busy breaking their ramadhan fast.  We seated ourselves and our waiter quickly came and brought out some free salad and soup.  The salad was simple but good.  I really liked the dressing that they used.  The soup was delicious.  I'm not sure what it is made of exactly but I'm guessing its some sort of spiced lamb broth.  It was really velvety and the spices they used were really good.  They also gave us some freshly baked yemeni bread (similar to Naan) which we could dip into the soup if we wished.  \n\nNext came our appetizer which was foul which is basically mashed dried fava beans with spices.  I'm used to eating the Egyptian version at home so the Yemeni version was a welcome change.  It was really yummy and I highly recommend ordering it.  Of course they brought  new freshly baked bread to eat the foul with.  Shortly after, they brought our entrees.  There was no room in the table because their portions were huge.  The entrees served family style which is great because I got to taste everything.  We ordered the Haneez, the Masloug lamb and the Chicken Salta.  The haneez and the masloug came with rice and a vegetables.  The salta was basically roast chicken (you can order your chicken in a different style too) and vegetable curry. It also came with yet another bread.  Everything was excellent.  I absolutely loved the rice and the vegetables.  The rice was so flavorful as it was cooked in chicken stock and the vegetables were really tasty.  I just couldn't stop eating.  The meat was excellent.  The haneez was so tender that it fell off its bone and my friends and husband were obsessed with it.  My favorite though was the masloug.  It is basically boiled lamb which sounds boring I know, but it tasting amazing.  It was delicately spiced and so delicious.  I am still thinking about it!  The chicken was really good too.  It was cooked perfectly and I absolutely loved the vegetable curry that it came with.  We kept eating and nibbling even after we were full because we just couldn't stop!  After a while though we reached a realization that we better stop because it was getting late.  We ended our meal with some amazing freshly brewed tea with milk that was complimentary (you just had to get up and serve yourself).  The tea was spiced with cloves and is meant to be drunk with milk so make sure you do that.\n\nJust a warning - people don't go to this place for the ambiance, so if you want a beautifully decorated place you should go elsewhere.  The decor is sparse with a few nice pictures of Yemen hung on the walls.  The restaurant is clean though which is always good.  Oh and also - they don't take credit card despite the sign that they have on the door.\n\nI don't suggest ordering more familiar (to western palates) Middle Eastern food when you are here such as Hummus and Baba Ghanouj.  They are not part of traditional Yemeni cuisine and originate from the levant area (Lebanon, Syria, Jordan and Palestine).  \nWe are definitely coming back here again!", "author": "Rasha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-12", "description": "If you are fond of lamb, then I would highly recommend order the Haneez at Yemen Cafe.  It is out of this world! The meat falls right off the bone and has a delicious taste to it. The soup, salad, and bread are also excellent! If only Yemen Cafe was closer to where I live, I would be visiting it more often.", "author": "Rivan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-11", "description": "I give it three stars because the complimentary lamb soup was really good...almost like an indian haleem and it also comes with naan. portions are big, and i got the lamb like everyoen recomendded...but i didnt really like it. it was fall of the bone tender, but i think it lacked flavor. service was good too, the man who served us as very nice. I just dont know if ill eb back just for the soup and naan maybe.", "author": "Sam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-03", "description": "love the food (tasty), love the people working there (not tasty, but they palliate with their kindness and heartwarming smiles), love their free refill tea (heartwarming, just like the people, and tasty just like the food).\n\nthey also have a nice aquarium. \n\nand good bread. i've tried a good deal of their dishes so far and i liked every single one of them. their chicken salta kicks ass. some of the best middle-eastern food around. \n\ni noticed some people complaining about their curry, but why go to a yemeni place for curry? go to an indian place instead.\n\nnot the kind of place that'd catch your attention while passing by. so unpretentious. you'll basically be hanging out with lots of arab people (which says a lot in and of itself).", "author": "Mugwump S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "This place is amazing! Delicious food, served up quickly and hot. Free soup, salad and huge amounts of hot doughy bread. My boyfriend and I ordered one chicken salta.. More than enough for 2. And did I mention the unlimited sweet tea?  The meal was to good to be true- don't let the decor fool you!", "author": "Christina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-29", "description": "Yemen Saeed :)\n\nThis restaurant is a must everytime I head to New York.  I always order hanith - the meat is fall off the bone tender and the service is so consistently fast that the food comes before you even order it", "author": "Kathryn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-22", "description": "Terrible service! You would think that an ethnic minority used to being discrimated against wouldn't have such a pissy attitude towards other ethnic groups. This place sucked in terms of service and I refuse to spend my hard earned money to be treated like crap. My husband and  I were the first to enter this restaurant, our order was taken, then a group of yemeni's rushed in a few minutes later, about 6 tables worth... from that point on we were abandoned. All the Yemenis who came in after us received their soup, salad, naan, and entree immediately and we were still sitting there waiting and waiting. Our  food finally came out after all their tables were tended to and it wasnt even hot, which lets me know the waiter was too consumed with serving the yemeni's first even though our order was taken 10 minutes prior to the rush. Also, we were not given soup, salad, or naan with our order. When we asked why we were served last and did not receive everything with our order, the waiter gave us a BS excuse!!!\n\nI will not tolerate disrespect from anyone, let alone pay for it,  Too bad...the food is decent when its served hot, but nothing ground breaking. NEVER AGAIN", "author": "Carissa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-20", "description": "This place is a must visit among people from the Arabian Peninsula. I've been there twice. The food is good but not great but its nice to have something different every once in a while. Esp something hard to find like well prepared Yemeni food. All my friends think the food is great so I suggest you take the majority's opinion.", "author": "Mohamed A."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}