{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "PERFECTION. I suggest you go with a bigger group so you can try more things on the menu! Lamb haneeth goes great with the salta, and try the Loubia/stew as well it really goes well with rice. The tea is very fragrant, it's self serve so don't be shy to just grab them, unlimited!!!", "author": "Umi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Wow! The best middle eastern food around! We had lamb and chicken haneeth and saltah. It was amazing. The lamb melts in your mouth as it is really perfectly prepared. The meal comes with tea, soup, salad, and some bread to start off, which is filling so save room for lamb haneeth. Definitely worth the trip to Brooklyn.", "author": "Victoria N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-12", "description": "The lamb is amazing !!!! The fetah with honey is a great dessert! They workers always make you feel welcome.", "author": "Tabbiey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Love the food here! The bread is excellent and all of their lamb platters are so flavorful and soft. My fiancee and I got the lamb haneeth (amazing) and one of the chicken dishes. The price was higher than expected, but the portions were large. \n\nWould go back!!!", "author": "Eugene F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "First the lamb soup; almost enough for a meal.  Good flavor with a mix of spice.  We both ordered chicken glaba.  They served us chicken agda.  We did not care it after one bite and then realized chicken with bone was not what we ordered.  Flagged the waiter and told him.  Back came the glaba in ten minutes.  We ate every bite including the fresh brick oven bread.  The chicken included fresh ingredients.  Not spicy but my husband added the table spice to his.  The long grain rice was light and fluffy, perfect.    Included tea was spiced and flavorful but I skipped it because sugar was abundant in the tea. So glad we ate here. Enough said.", "author": "Susan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Came here after visiting the transit museum. Really fantastic food and the portions are huge. Three friends and I shared the lamb haneeth, baba ghanoush and chicken haneeth and it was more than enough food. The meats were absolutely divine and the tandoor bread was super tasty. Finally, an amazing house soup, salad and tea also came with the meals. Can't beat that!", "author": "Gab G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-15", "description": "I go to a lo of Yemen restaurants in NY. I usually go with my Yemen business friends and I get the royal treatment. Today they barely even looked my way.On top of that they might have given me the worst piece of lamb in the kitchen. Brother please don't think the black customer understand how proper service and and Yemen food should be. God bless.", "author": "Mat M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "This place will forever be my favorite halal food. Best Arabian food I've ever had. Lamb haneeth, the various lamb stews and sizzling clay pots loaded with fenugreek and okra and other flavorful things, the tea, the rice the flavorful pepper sauce \"Zahawiq or salata hara\" and the bread cooked in the clay oven. Everything I've ever had here has been amazing", "author": "Dan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "I went here for lunch with several coworkers. Nice place, good food, clean restrooms. The lamb soup that came with our lunch was a bit spicy (good spicy!) and they brought out their fresh made flat bread, delicious. I had the Lamb Haneeth with basmati rice. It was a nice large portion and the meat was falling off the bone tender. It was tasty but I'll definitely be trying something else next time with more flavor or spicier. Everyone enjoyed their meal.\nThe restaurant is up a flight of stairs so if you're handicapped, think again.", "author": "Sal L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Oki so I loved this place... fresh naan/ bread , soup is awesome and then lamb haneth is the bomb .. please please if you by Brooklyn do yourself a big favor come here and try their food . Yes it's expensive but it's worth every penny .. I also got lamb liver with hummos it was awesome with the bread... this is hidden gem. Try it out", "author": "Ali A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "I love this place! Our foodie friends introduced it to us recently and now I will forever be craving Yemini food.  Everything we got was flavorful and delicious and they just kept throwing pans of that hot tasty bread on our table.  I definitely don't need that many carbs in my life, but who am I to say no when they just keep showing up all hot and chewy like that?!  Add on free soup, salad and sweet Yemeni tea and I am sold!  Because there's nothing I love more than good food and free stuff. For four people and a ton of food, it was less than $50 with tip and we all left stuffed and satisfied.", "author": "Joy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "I felt at home with the no-nonsense way my order was taken and subsequent briskness of food coming out.  I felt maladroit after repeatedly asking my waiter for water before I walked to the bathroom and realized that the sweet tea and water were self-serve.  In terms of the food, the bread was crispy and felt really fresh; my entree was the Lamb Haneeth and I was blown away.  I've never had such tender lamb before nor did I know about the pleasure of eating an animal's anterior cruciate ligament until then.  I honestly dreamt of that lamb for several days afterwards.", "author": "Ken W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "Really great dishes! I tried the chicken glaba and the lamb glaba. Each dish is enough for 2 people, in my opinion (:", "author": "Izzy I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-04", "description": "Great food and busy area. Come with an empty stomach because the portions are huge! The staff is great with their service and complimentary bread was the best.", "author": "Tania K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "I have been to this place a couple of times when I went to visit Brooklyn Bridge. This place is 1 mile away from the bridge. You eat nice food here, walk for a mile, and cross the bridge. They have complimentary tea. And it is real nice with a lot of flavors. I can distinguish cardamom, but it has more. There is a small can of evaporated milk on the side. I always have my tea with milk, so I added it. The can has a tiny hole to pour the milk. So I had to pour for a while to get a decent amount of milk. I at least have 3 cups of tea every time I go here. My favorite food here is Fahsa. Minced lamb is served sizzling hot. Ask them to make it spicy if you like spicy food. Either way it tastes very good with the complimentary bread. Lamb haneeth was ok. It was a lot less spicier than I would like it to. As per the waiter the only difference between lamb zorbian and lamb kabsa is that zorbian is boneless. I had lamb kabsa. Rice and lamb had good flavors. I would have loved it a bit more spicy though. There is a complimentary lamb soup. Surprising thing is only if you order the soup, they will give it to you as complimentary. Soup has good flavors as well. Fatah with honey is a kind of a sweet appetizer. As it is sweet I went for it as a dessert. But it was not as sweet to be treated as a dessert. It was more apt as an appetizer. It was mildly sweet. It is good for 2 or 3 people. The service in this place is almost the level of indifferent. But I think they are exactly behaving like how it was in Yemen. The waiters generally dont come to you. You have to call them if you need anything. They will keep a glass of water, if you need to refill, you need to take it and fill it yourself. They don't tell you about the complimentary soup or tea. In fact they don't even bring you the check. You need to walk to the counter and pay. For a first timer it is a bit frustrating. But still I like the food here.", "author": "Sho R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Probably one of my favorite restaurants in NY. I heard of this place through a Youtube video on Eater. First they give you a soup on the house which is really flavorful plus salad and this huge naan bread. The bread is so good and it's like the size of a tire. I dip their bread in the spicy green sauce that is also complimentary. We ordered the chicken salta, lamb haneeth and fatah dessert with cream. The lamb was my favorite. There was no gaminess and it was so tender and flavorful. I'm usually not a fan of lamb but this time, I preferred it over the chicken. Additionally, I think fatah is one of my favorite desserts now. It's amazing; not too sweet but so delicious.", "author": "Jenn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "We were looking for a good dining experience near the Court Street Movie theater and Middle Eastern cuisine sounded enticing. This was my first time trying Yemeni food but it won't be my last. The place was packed - always a good sign - yet we only had to wait a couple minutes to be seated. Middle Eastern culture is informal so we were just told to sit at \"table 9\" once it was cleared. \n\nAfter ordering my wife and I both were promptly served a seasoned soup that was unassumingly green like split pea soup but much better in texture and taste. \n\nNext was a salad with a Yemeni-style house dressing that was really good. The delicious warm flat bread came next followed by the main course. \nI ordered the fahsah (lamb stew in a clay pot) which came out bubbling hot. It was our favorite. This stew was the perfect comfort food on a frigid winter day. \n\nMy wife ordered (#30) a stewed chicken dish with a hearty sauce and basmati rice. It was also well-seasoned without being too spicy or strong. \n\nAnd the price, $15 per person was a good bargain for the food we received. We plan to be back. Highly recommended!", "author": "Rasool B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "It was a cold Monday morning, when I had to go to that part of town for a doctors appointment. I had a cold and was feeling sick. I thought a cup of hot spicy soup would do a lot of good, so I decided to go to Yemen Cafe. I had never been, but it was on my list of places I wanted to try. Too sick to try a big dish, I opted for a hummus plate, and their house curry soup. OMG. It was so amazing. I need to go back and order like a soup x3 - which would only come to $6. (plus a main dish, because I'm dying to try it for real)\n\nThis soup is comped with a main dish, and when I paid he told me he's not charging me for the soup, just because. I sat there for an hour after eating, on my phone, sipping free chai tea, too sick to move. \n\nThe waiter was attentive, and while sitting here I observed the friendliness the staff showed to all their patrons. \n\nI better go back there soon.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-07", "description": "Where can I start. If you go to NYC and don't stop here, you are missing out on your life. These folks know whats up. The soup is heavenly, the hummus is amazing, the lamb haneeth (Mendi) is out of this world. This is the place to eat in whole NYC. Don't tell me french or Italians and 5 star BS restaurants. This food makes you happy and that is what it is all about. If I can give this place ten stars I would.", "author": "Sean M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "This is why I wouldn't move to the burbs. This is an authentic and bustling. Lots of Middle Eastern folks eating here.Portions are huge. Everything is great quality, fresh, tasty, but not over salted. It's like going to your Yemeni friend's grandmother's house. The lamb soup and the roasted lamb are delicious.\n\nHot tea at the end, with evaporated milk, on a chilly evening, was perfect.", "author": "Andrew K."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}