{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "I just wish I had more time left in Brooklyn, if but to try every single thing on the menu. The chicken zorbian, lamb fahsah, hummus, and baba ghanoush are among my favorites. The bread, my goodness. It's a flathead about a foot and a half across, and when piping hot, soft and fluffy. I could live on that alone. If I have one gripe, and perhaps it's my own ineptitude, it's that when I've gotten takeout, the bread becomes incredibly hard soon after cooling down. Still working on tweaking my technique for reheating it. \n\nThe staff are incredibly friendly and hospitable. When I come here with friends, it feels like we're being greeted and treated like family.", "author": "Sarah-jo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "If you love lamb and large portions of it cooked in numerous different styles.  This is the place for great flavors and as close to home cooking as it gets.  The owner told he drives to the market every day to purchase fresh lamb and chicken.  You taste the difference.", "author": "Derrick H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "Overall the atmosphere at this place is really nice.  Great food served family style. So delicious. I think that is 4\\5.", "author": "Kyle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Yemen Cafe is a real gem. Enormous portions of excellent food, friendly service, and all at a great price, especially considering the neighborhood. \n\nWhen my friend and I came in, the waiter immediately brought out a dip, lemon slices, soup, and bread (and this was before we ordered anything). After we ordered we got a small salad. Tea is unlimited and complimentary, though you're expected to serve yourself from the samovar in the back. \n\nWe ordered the salta with lamb haneeth, which was way more food than the two of us could consume in one sitting. It was a bubbling stone pot of the stew plus a huge side portion of their slow-cooked lamb. I preferred the lamb to the stew (not a fan of okra), so I might get just the lamb next time. Some of the dishes on the appetizer menu also look great. Looking forward to coming back already!", "author": "Calvin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "\"I am already full I just keep put stuff in my mouth cause it is so good.\" \n\nThis place has been here forever, (1986) so I finally decided to try for lunch and found out why.\n\nThe white bean fasoolia dish was warm and comforting crunchy bits of onion and pepper. \n\nThe lamb haneez platter came with a large platter of rice pilaf, the meat was very tender lamb breast and shank, not too much fat on the brestn\n\nEach entree came with a salad, warm lamb and (pureed lentil? )soup and a large pita. \n\nDining room was clean beautiful pictures of Yemen on the walls. \nGrab a spot by the large saltwater  fish tank \n \nThe only downer was they did not serve me hot sauce just some extra house salsa. A little extra spice was needed to make the meal perfect in my opinion.\n\nTip, get some black tea after the mean and relax.", "author": "Carl T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "This place is quite something!! Fresh food, delicious fresh water served ice cold in chilled silver glasses (great on a hot summer day) . . . authentic Middle Eastern cuisine! When you walk in you are met with the smell of delicious spices, freshly baked clay oven bread, and a special kind of homemade tea that is unique to Yemen. The servers are warm and welcoming, and the restaurant is thoughtfully decorated. The hummus, baba ghanoush, complimentary soup, fatah with honey, and chicken agda (loubia) are incredible!!", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-15", "description": "As a family we generally are not lamb eating people and like to stick with run of the mill  beef, chicken and fish diets; So, primarily it was good reviews that compelled us to give this place a shot and we were not disappointed: We ordered Lamb Haneeth, Lamb Fahsah and Humus. Haneeth came with the rice and it was totally delicious. We had lamb Fahsah with the oven cooked fresh bread and really loved it. \n\nNow the bread, soup and salad come free with the order. For desert, we had Fatah with honey and it wasn't bad either though I don't think I'd pay $10 anywhere else. The Yummy-Yemini tea came free and you are allowed to have as much as you want.\n\nI'd say the environment was casual demonstrating authentic Yemini culture but the service was polite and professional. Generally speaking, I enjoyed my dining experience with this restaurant and will surely recommend it.", "author": "Asad B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-30", "description": ":( I'm so sad my time here was disappointing. Service was fine. But man. I split the lamb haneeth for dinner, already knowing it was that much more expensive for dinner (22$ versus 16$ at lunch). Based on photos here and what I've heard, the entrees are large enough to split. However we got the most measly piece of lamb. Barely a serving and half of it was fat. The vegetable over the rice was the smaller DOLLOP ever. Like as if someone had accidentally spilled some on, not like it was meant for the dish. So essentially we were left with a huge amount of rice and barely any meat or sauce. I will say the lamb so super tender but how disappointing. I don't know if it's because we weren't Yemenite(although being North African, all the food and flavors are familiar to me) but that's what made it that much more disappointing. I know there's supposed to be more sauce and even more lamb. The soup that came with it was very familiar tasting, but also really salty. Bread was great. On the fence about if I'll return. I can eat the same food at home so", "author": "Sacha-Avi S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-04", "description": "I lived in the Middle East for years and had Yemeni food 2-3 times a week.  After trying many other Yemeni restaurants in NYC and the US, Yemen Cafe isn't really that spectacular.  I think it's the most friendly for people who don't know about Yemeni food or don't speak Arabic.  The other Yemeni restaurants in the area have the same or even better food and are much cheaper.  Yemen Cafe is way overpriced and the last few times I went the service was terrible.\n\nYemen Restaurant (http://www.yelp.com/biz/yemenrestaurant-brooklyn-2) in Bay Ridge has waaaay better food (including dessert), it's half the price, and the staff are super kind (and speak perfect English).  Be careful not to accidentally end up at the other Yemen Cafe also in Bay Ridge though!  Totally worth the extra bit of trek.", "author": "Lissa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "The was a fun day trip to Brooklyn.  The soup they served with the meal was awesome and full of flavor.  We ordered the Lamb shank and it was tasty by somewhat dry.  I wish I would have asked for more soup to soak the lamb in to add more flavor.  It was a great experience to try Yemen food.", "author": "Sam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "My go to for comfort food...large portions, good prices and warm vibes. Always go for the lamb haneeth. Always!", "author": "Sophie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "In love with Chicken Zombian and Sautéed lamb liver with cilantro, pepper and onion. Of course bread and hummus are always needed :)", "author": "Pepper P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "Fantastic!  Service exceptional!  Food outstanding!  We had 3 lamb dishes and nothing left. We wanted to bring home leftovers but couldn't stop eating.", "author": "Greg S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "I ate here last night for the first time in over ten years and frankly the food was better than ever.  The clay oven bread is wonderful, the babghanoush was smoky and perfect, and the lamb salta was delicious.  Soup and salad are served gratis.  The decor and service aren't anything special, but the food was as good or better than at expensive, upscale and widely reviewed Middle Eastern restaurants. I'll definitely be back.", "author": "Rebecca H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "We came here based on a relative recommendation. We tried chicken and lamb haneeth. Both cooked to perfection! The taste was fabulous and the quantity was very good. We also tried the Yemeni tea and dessert (fattah) all tasted really good. Friendly staff and quick service. Will definitely come again.", "author": "Sally H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "Although I don't like busy and crowded places, this is one of my favorite places that force me to come to even on weekend days. Food are delicious and the staff are outstanding, super-nice!!\nHaneeth and Fattah are my favorites here!", "author": "Maria I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Craving for some delicious Arab food \u0026 ended up going to this famous Yemen cafe on Atlantic Ave for a delicious plate of their popular Lamb dish which is my favorite  \u0026 thoroughly enjoyed it. It's the first time my husband had it \u0026 he enjoyed it too. \n\nThis is probably the 20th time I came here \u0026 would certainly not be the last.", "author": "Olivia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "My Yemeni friend said this was the best Arab food in the neighborhood-go figure! So I had to prove him wrong. Boy was u wrong. The lamb dish haneeth and fahsa were the top recommended dishes. The lamb was literally falling off the bone. Would come again and again.", "author": "Ahsan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "What a great place.  We have had Afghani, Lebanese, and Iraqi food many times and love them all, but never tried Yemeni.  I am now adding Yemeni to my list of favorites.\n\nThe hummus was very good and portion was large, the complimentary soup (vegetable or chicken broth based) was very good and came with a wonderful home made salsa to spice it up.\n\nWe both had the lamb haneeth lunch portion.  A large amount of food for the price.  Haneeth is slow roasted lamb served with a side of wonderful lot seasoned basmati rice covered with a great vegetable sauce.  It was all so good.  The lamb was extremely tender and tasty, and the rice was cooked perfectly.\n\nService was friendly as well.\n\nI can wait to come back and try some of their other dishes.  If you have never had Yemeni food and are in Brooklyn, NY you should check this place out.", "author": "Dustin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "One of the best food places. The service was friendly and responsive. The food was delicious and portion sizes were large. For a party of 4 we ordered a mixed grill, vegetable stew with lamb, and hummus. The mixed grill had chicken, steak, gyro slices. Everything was tasty and well cooked. The vegetable stew with lamb was a little more mild, but still tasty with vegetal sweetness and very tender lamb. The restaurant is located in a busy road so parking is a little tough, but the place is worth it. Go give it a try.", "author": "Ying G."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}