{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-01", "description": "So after many recommendations, I decided to check this spot out for lunch. A lot of chicken and lamb options but I wasn't in the mood for that so I decided to try the \"salta\" (sp) which is a stewed veggie dish with clay oven baked bread. I loved the bread. Very scrumptious. The veggies were a bit bland at first until the owner/waiter offered the hot sauce which definitely helped.\n\nI don't like the ice berg lettuce salad. Would be better to have romaine.\n\nThe waitstaff was very courteous. I can definitely say that I will be back but I will have to give the meat dishes a try next time. OVerall, its worth checking out.", "author": "Cali D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "The lamb haneeth is amazing and will definitely fill you up, It comes with rice and a veggie stew that comprises of potatoes and okra. It's definitely enough for more than one person and expensive at more than 20 bucks. Wish they would have smaller and less expensive portions, so I don't feel like death after walking out, and it would give me a reason to come back here more. I've tried their liver before and it was ok, the pieces were too big and it didn't have that crunch that I've been accustomed to in the Middle East. The salta is also outstanding although I usually only get it during the winter. If your Arab you will not receive good service and they will not bring drinks to your table you have to get your ass up and grab it yourself. If your not Arab then the servers will smile and laugh with you and bring you whatever you want. You get a cup of soup when you sit which is amazing, and don't forget to grab a cup of complimentary tea before you leave which I quite enjoy especially when it's cold outside. I don't like how they bring the food out so quickly like I just started on my soup and salad and they already bring the food out, granted its still hot which I appreciate.", "author": "Abdulaziz A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "I love this place! I work nearby and go every chance I get. The service is excellent. The food is great. The bread is dangerously good because I tend to eat way too much of it. The lamb liver appetizer is one of my favs. I've also had the Haneez, which is their specialty, the galabah, and the fatah. All are excellent. As you can see lamb is my favorite. I also enjoy the self-service tea table they have. I need to try the Bay RIdge location. But this place has def brought Yemeni food to the top of my list.", "author": "Andy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-29", "description": "HOT NEW FLAVOR! Yemeni cuisine In Brooklyn Heights, New York! Be sure to come hungry and eat like a savage with your fingers. This type of food has been devoured by tribal people for centuries. Soup, salad, rice, vegetables, lamb, bread, and tea with a hint of cloves and cardamom. Oral Ecstasy.", "author": "Leyla A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "I first visited this restaurant after my co-worker recommended it and I came back on several occasions. This is not a restaurant you take a first date to, but a place for awesome Middle Eastern food. The decor is basic and nothing special; few painting of Yemen, chairs and tables. Yamani Cafe is popular with families and groups and can get a bit loud, which I don't mind when I'm stuffing my face with great food. \n \nI love the free soup, salad and bread that comes with every order. Especially the soup on a cold/rainy day, yummy! Since I'm not much of a meat eater, I get the vegetable platter. The rice and veggies are always cooked perfectly. I've tasted several of the other items on the menu and they're all just as good.", "author": "Ming F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "I tried this place for the first time today and loved it! The lamb was absolutely perfect and delicious, as was the bread and soup. Abdul was so friendly and give me some great suggestions. I'll definitely be a regular for lunch here.", "author": "Waj A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "we tried lamb kabsah and haneeth. both were very delicious. lamb haneeth was very tender and tasty. A little pricey though. Will definitely revisit.", "author": "Emad J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "If you want tons of excellent, no-nonsense homestyle Yemeni food that you can share with friends, this place is the best. I've probably eaten everything on the menu. In an area where affordable, exciting cuisine in a setting with character is fast dwindling, Yemen Cafe is a standout.", "author": "Alexandra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "Came here with an arab friend which recommended it. He ordered everything but it was delicious. We had some liver and goat and it was soooo good. If u have the chance, for sure go!", "author": "Gabriel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "my first experience with Yemeni food.  my friend took me here and I was amazed by the flavors and the bottomless cup of tea.  the portions are large and the food is great,  as long as you don't mind eating goat or lamb.", "author": "Johann F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "the best food I have test in NY and all USA.\nvery honest peoples very clean place very testy food I mean all the foods.\nhope you open branch in Boston MA.", "author": "Tariq A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "While the haneeth was good but not great (a bit bland and dry for my taste, though I liked the rice it came with a lot), the hummus with lamb was perfectly spiced, and the  fatah with honey (ask for cream on top) is one of the best desserts I've ever had anywhere, even though it's listed as an appetizer. The serve-yourself spice tea on the side is also a great touch. Also, I loved the atmosphere (very warm and welcoming, even though I'm not Yemeni or or Middle Eastern descent), and the service was also welcoming, helpful and responsive.", "author": "Alexander Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-01", "description": "Yemen's a pretty fun place unless you need to BYOB.  Which isn't tolerated.  As a matter of personal preference, I'm less a fan of epic meat cooking techniques.  Most of the stuff here reflects regional taste, and is slow-cooked to the point of obviating the need for knives (and forks).  The salta is very good, though, depending on your tolerance of fenugreek.\n\nMy primary reason for going to Yemen is the broth and bread.  I don't know how to describe or categorize the bread.  Levantine khubz?  Whatever it is, it's perfectly charred and transcendant.  I think about it often.\n\nSome of the appetizer salads aren't quite up to the standard of other places in the city, but I think the foul, fassolia and hummus with lamb stand nicely on their own.  The prices may seem high for the cuisine and decor (irrelevant, in my opinion), but bear in mind that 2 appetizers and 1 or 2 entrees can well feed 3 people.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "Excellent Yemeni food near the Brooklyn Heights area.  Cannot go wrong ordering any of their delicious lamb dishes, including the \"haneez\" -- tender marinated lamb over rice.  To start, order the hummus and ask for their freshly baked naan bread.  They'll bring out as much naan as you'd like during the course of the meal.", "author": "J K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-06", "description": "Haven't been here in over a year, I'll have to review the next time I go there, Insha Allah.  Haneez!", "author": "Qasim G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-10", "description": "Super friendly staff who gave us soup on the house - just because!! Free refills of delicious Yemen Iced Tea. Food was all seasoned to perfection and absolutely delicious - most entrees costing $10. One thing on the menu that is a MUST TRY is the sliced Yemen bread with honey and butter. Not what I was expecting - I was expecting some sliced bread served with honey and butter on the side. This dish (see attached picture) is actually slices of bread that butter and honey have been poured on and then cooked and garnished with black onion seeds. Mildly sweet and subtely savory, served warm - this is how you must end your meal at Yemen Cafe!!!", "author": "Mireille R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "Amazing food and huge quantities. The lamb  haneeth was phenomenal. The lamb literally fell off  the bone and the little fat fell off the meat with ease. The rice was better than I've ever had. Looking forward to the lamb chops next time.", "author": "Ramy E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "I went here some months ago and it was full of patrons. The soup that came with the meal was a bit sour but I don't mind that. The food and service was pretty good. Definitely one of the top Yemeni places I've had.", "author": "Shirley W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-02", "description": "I'm pretty surprised the reviews are so great here. The soup was pretty good as a starter, but the lamb haneeth (billed as their signature dish) was barely edible. The meat was so tough and the seasoning was lacking.", "author": "Annie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-30", "description": "My visit was August 28, 2010.  We had reached the tail end of the dinner service and it was hectic.  It was a little wait, but got seated.  Yemen tea was delicious and taste like sweet tea without the sugary after taste.  The dishes we wanted to ordered was not available, but I am not sure if it was because it was late or they didn't make it that day.  \n\nI got the Haneez platter.  The platter was worth it since it came with yemen bread, salad, and yemen soup.  The lamb was boiled and cooked (i think, b/c lamb meat fell off the bone) so it tasted differently  from how the Greeks prepare lamb.  I think I would have preferred ordering two of the appetizer size minced lamb dish.  I believe cilantro was used in most dishes so be aware.\n\nOverall, I got the impression I got authentic Yemeni food by the patrons who frequent this restaurant.  This looks like a great late night place in the Brooklyn Heights/Cobble Hill area for lamb.  I would not recommend for carb-conscious or vegans (rice was with practically every dish and can't be sure if vegan dishes were prepared separately).", "author": "PJ Y."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}