{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "I changed my plan on that day to visit this place instead of a high fine dining place just because one of my friends was visiting and wanted to try it so let's talk about the quality of the food was good enough wasn't bad and wasn't perfect, I feel that this place can do better and I know Yemeni food is amazing and I've tried one in Chicago and knew that they're great with this type of food but the problem was with the service wasn't good enough and they didn't really care, this place can be improved with adding more stuff in the menu or at least have good presentation with the food and salad, I asked for a coffee and I got tea that's not a smart thing to do but it was good though. \nI would give this place from 3 to 4 stars because they really can improve their self and be better. we came all the way from NYC in a rainy day, it's not worth it unless you live around but you can find better places if you're coming to NYC for few days save this place for later maybe.", "author": "Mishari A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "This place is amazing! Not only do they give you free salad soup and tea, they also have delicious food and appetizers. I recommend the lamb haneeth, foul, babaganoush, and chicken haneeth.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Absolutely delicious. Great prices and portions and it taste amazing. Salta with a side of Chicken Haneeth is what I usually get, because I am not a big fan of lamb but my friends loves the lamb a lot more so I'm guessing if you don't mind lamb, lamb is the way to go.", "author": "Larissa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Amazing food.Great service.Good ambience.Authentic Yemen food.Love it.Definitely recommended.", "author": "Gino S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "This place is Amazing . I had lamb , and that lamb is one of the best I had in NYC . Service is good too . Will come back again .", "author": "Alimu M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Great food in a place buzzing with friendship and the wonderful spectrum of New Yorkers.", "author": "D C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "I had the lamb shank, it was very tender. The tea on the side is delicious, and I loved the nan. I was very pleased with my first Yemen experience and I will go back again.", "author": "Chris T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "We drove all the way from Northern Virginia to eat here, and it was worth every minute!  The place is a hole in the wall, but the hole contains diamonds.  The lamb haneeth is amazing, the chicken gulaba is scrumptious, and let's not get into the lamb chops.  I will definitely make the trip again!!!!", "author": "Tariq A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "Great food.\nGreat service, friendly staff.\nHanid is so awesome and the liver too. The portion is so generous.\nDon't forget, there's a free Yemeni tea or tea with milk. \nDefinitely I'll come back \n\nCons: parking", "author": "Majed A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "This place takes the cake. \n\nI have been here numerous times and dunno where to begin.\n\nits a popular place so give sometime to be seated. however they have lots of seating so 90% of my visits we were seated within mins. \n\nI always go for my fav dish Haneez. the portions are huge so order accordingly. they serve free lamb soup, bread and salad with each entree. the lamb soup is heavenly on a cold day and as amazing all year round. their green sauce is good if you like it spicy. \n\nThe tea near the cashier is free and self serve so definitely give that a try. \n\nI go to this place once every few weeks and sometimes even more frequently. definitely recommend it!", "author": "Mohammad A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Love this place. Love the atmosphere. Love the culture. Love the people and love the food. I love going to a place where the waiter continuously comes and asks if everything is ok. I felt at home and in good hands!", "author": "Abid M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "Complimentary lamb soup, tea, and salad? C'mon!! The food is very delicious here and it seems like the locals knows what they want to order as soon as they sit down. It's definitely a great place to visit during the winter when it's cold out - the lamb soup tastes home-made and the entrees/appetizers are savory  The lamb haneeth is very flavorful and they serve it over rice and some kind of curry/veggie mix. I almost always order babaganoush (which is equally delicious as the lamb) to complement the entree. I give this place a 5/5 because they've been consistent in food quality, customer service, and price (easy on the wallet).", "author": "Marc L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Great, authentic place in the Arab enclave of Atlantic Avenue. The foul medames is recommended: distinct from the typical Lebanese/Levantine take. The lamb is cooked to perfect and the bread is fresh and puffy and warm.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "BEST AUTHENTIC YEMEN FOOD! We had the lamb haneeth and the chicken haneeth. The meat just falls off the bone. EVERY TIME. I don't know how they perfected cooking meat perfectly EVERYTIME. The staff is very welcoming and helpful. The food is just amazing. With the entree, they give you a complimentary salad, lamb soup (MUST TRY and add the lemon) AND bread. Like where can you get great food and at this deal? Also try the tea. It's sweet and just try it and it's FREE. Fave middle eastern food hands down.", "author": "Mace L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-16", "description": "The food was not that great, but it wasn't bad either. My problem was with the service and the sexism of one of the staff members.\n\nThe servers were not welcoming or warm. Food was put on the table without even an acknowledgment that there were people seated there. \nWhen we were done with our meal I and a man from our party went up to the register. I wanted to split the check and he wanted to pick up the tab. The host completely ignored me, not even acknowledging I was there, took my friends card and swiped it. When I asked him why he was ignoring me and listening to my friend, he said it was because he was a man. \n\nThat was the rudest and most sexist remark I ever received from anyone working in service. I most definitely would not be going back and would never recommend this place to anyone.", "author": "Hajar A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Always looking for new cuisines to try and this one definitely is a new fave. Got there early on a Sunday evening and there was only one other table seated. By the time we left, it was packed. Fatah with Honey might be my new favorite thing in the world. The Lamb Haneeth falls off the bone and is perfect. Nice staff and the free bread keeps coming!", "author": "Maisie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Ana and I had baba ganoush to snack and it was delicious. Service was friendly and fast.", "author": "Guilio Ñ."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "The food and tea is out of heaven. We had faseeh and haneth laham. The adani tea is yummy too.", "author": "Isra J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Um wow the Lamb haneeth is so succulent. The morsels of flavory goodness just fall off the bone. I literally pulled the bone out of the meat with no effort. It's delicious, it's open late, what's not to love? I can't believe how soft this meat it/.", "author": "Josh C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "I might have to put Yemen Café on the list as \"Best Restaurant I've Discovered in 2014.\" This place has been on my radar for ages so I finally got a friend to come with for dinner on a recent Thursday night. Having been lauded in various local publications, I already expected it to be good, but what struck me also was how truly authentic it felt. \n\nThe menu presents an interesting variety of Middle Eastern cuisine anchored by poultry and lamb dishes. I tried the Chicken Agda which is an exotically spiced stew with vegetables served with a big side of rice. My friend had the chicken kebabs which also looked awesome. We shared the fatah with honey (though I see now it's more of a dessert) which was probably the most interesting thing - A Yemeni pita chopped up and mixed with honey, and topped with this amazing yogurt-butter mixture. Whoa, just an awesome and satisfying flavor combination. Combined with the complimentary pita and delicious soup and salad they give you when you're seated, it was a sumptuous meal.\n\nThe service at Yemen Café is a little gruff (I remarked to my friend that no one greets you as you walk in, and you basically just seat yourself) but I chalk that up to more authenticity. The crowd dining here was a mixture of families (mostly Middle Easterners) and a handful of hipsters because we are in Brooklyn after all. The prices here are downright cheap too, so this is really an excellent, interesting option in Downtown Brooklyn and one I certainly look forward to coming back for.", "author": "Justin S."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}