{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "So. Dumb. Good. Just as good as the one in bay ridge for sure. This might be my new favorite restaurant.", "author": "Shira G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Yemen Cafe is worth a trip because you'll get food here you won't find anywhere else! The service is super friendly but very hands-off, making this a good place to linger. Tea is unlimited and bread and salad are included with your entree. The food is hearty, saucy, and delicious, although it is a bit basic. The portions are quite large so, although the dishes are expensive, you can certainly split!", "author": "Tom F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Hummus is great\nChicken with rice is good\nSoup is okay \nNice warm bread \nQuick service \nCan be pricey", "author": "Rokeya B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "Highly, highly recommended. Food is delicious, had lamb haneeth and also chicken. Service is very good too and the ambiance is just so relaxed. We were waiting for a friend who was late and they didn't bother us at all. Great place to sit and sip your self service tea.", "author": "Yussef A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "Delicious and authentic Yemeni food. Friendly staff and delicious tea. Very busy, so expect to wait.", "author": "Hugo Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "This is the best place I've been to for Yemeni food. The lamb is always great no matter what dish I've gotten and the portion sizes are generous. Add to that the soup, salad and bread you get before your meal and it's definitely a bargain for the price. Don't forget to get the complimentary tea while you're there. The service is courteous and prompt as well. This is a great place to eat if you're looking for authentic Yemeni food.", "author": "Tanzeem S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Traditional, delicious, flavorful food with fast service and large portions. Had the Lamb Glaba w rice. It was like having a warm home cooked meal.", "author": "Kristin A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "This place is really great! The food was unbelievably good. The Salta, Fahsa and especially the Haneeth were so good. Also very affordable for the amount of food. Greatly recommended!", "author": "Ayman A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Awesome food , and unbelievable hospitality, and above all the price is extremely reasonable , have been there twice already in two days, \n\nLamb meat lovers (not me) would have a decent menu options to select from . The style mostly home cooked food such as stews and rice pilaf and mild but salty flavors.", "author": "Umer A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "The food is excellent.  Prices are reasonable. Saff is friendly.  Great location next to staten island ferry, in saint George.", "author": "Rose J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Really great food. Best lamb I ever had in nyc and not to mention the portion is huge. The free soup is pure lamb goodness and the bread is hot and delicious. Also please try their stir fry lamb liver. So good!", "author": "Yuan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "This restaurant is a MUST-GO for everyone. The waiters are super kind and courteous. The portions are huge. The menu may be on the more pricy side; however you get more than what you pay for. Usually I go with another person, and we get one order of Lamb Haneeth which is slow roasted lamb seasoned to perfection. Served with mixed vegetables and rice, and an order of the Lamb Fahsah which is a traditional stew combined with shredded lamb \u0026 served bubbling hot in a clay bowl with warm clay oven bread. Putting this over my rice was a lethal explosion of flavors. \nBut this is not what makes the experience amazing.\nIt is the lamb stew they give complimentary, with the bread. You also have unlimited Yemen tea. This tea is the best thing to drink after your heavy and satisfying meal. I come here at least once a month, since it is also near the theaters. \nThe place also donates a portion of their profit to the Yemen famine crisis that is happening right now. They also donate to the local masjids.", "author": "Jaheen H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-11", "description": "Street Meat moved indoors. The Yelp crowd gets excited about the comped sweet tea, the free  muddy dishwater they call \"soup\"  and the \"comped salad\" consisting of wet iceberg and supermarket quality tomatoes but the food here does not really rise above the filthy e. coli carts you find on midtown street corners. Typical charcoal and lighter fluid flavored kebabs and nauseating stews filled with low quality cuts of meat. Of course the service is pleasantly and entirely clueless. You will observe others who arrive up to 30 minutes after you get served before you do, items are missing and your food is likely to get passed to the wrong table.", "author": "Antoine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Just go. Yemeni food may not be the first one to pop in people's minds when they think restaurants. But honestly, just go. Gorgeous delicious lamb haneeth and lamb salta, succulent lamb falling off the bone comes with seasonal vegetables sizzling in clay pots, and endless supply of Yemeni bread, foul (favs beans) and Yemeni \"bread pudding\" for desserts and you'll be set. Service is attentive and generous. Reasonably priced. Good for small or large groups. Very accommodating.", "author": "Sara E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Word of advice, it's easy to fill up on the crisp airy piping hot flat bread that arrives to your table.  The lamb soup greets you first as a complimentary starter while you wait to take your order.  Squeeze some lemon and add some of the spicy Yemeni sauce that they also provide to the soup.  It's so savory and warming as you tear pieces of flatbread and dunk them into a rich lamb based broth.  I always make the mistake of ordering too much food, especially apps such as hummus with chicken on top or the hot lava garlicky and tomato foul.  What you really need to do is bring people to share in the experience.  Share 1-2 orders of lamb haneeth on a big platter.  Wash it down with some heavily spiced tea which really compliments the array of spices your palate will experience.  You will leave feeling satiated, and if you're lucky, you will also have leftovers to reheat the next day.  Their flatbread and foul make a great breakfast with some runny eggs.", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Ummm yum. You walk in and it smells so good if you are hungry it makes it so much worse. I love middle eastern food and I'm so happy to find a new place! \n\nThey serve you a broth and salad when you sit down which right off the bat is simple and very yummy. I also had the hummus with the fava bean dip on top of it. It was sooo good. I put it on the salad. Highly recommend. I'll be back for sure!", "author": "Rachel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "warning ... the bread! \n\nits so good but will put you in a food coma and fill you up so fast... like everyone says get the lamb!", "author": "Ryan Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "This place is the definition of a hidden gem. It's well worth the trip from anywhere in the city! Walk into this Yemeni restaurant and experience one of the most authentic meals of your life. Start off with some Marag lamb soup (perfect for these cold, NY winter days) and be sure to dip their doughy, house made bread into it. My absolute favorite entree is the Lamb Haneeth. This house specialty is a generous portion of roasted shank, and when I say roasted, I mean to absolute perfection! The meat falls right off the bone and is so juicy and tender. It's served with rice and vegetables including bamieh (okra). As the portions are so generous, we were too full for dessert but had room for some chai, which is self-serve in the back of the restaurant and out of this WORLD. Since I live in Miami, I made sure to swing by on my visit to Brooklyn. This was my second time here and I was still blown away! A must try!!", "author": "Alexandra T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "If you want great middle eastern food for a great price I would highly recommend this spot. Great and fresh tasting hummus and great quality meat. The only negative I must point out is that it is a little unorganized and too fast paced. Other than that friendly people and really good tasting food. Highly recommend!", "author": "Mateen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "This is now my new favorite go to Middle Eastern spot.They have a selection of delicious appetizers and lamb and chicken entrees that comes with free soup and salad.They also give you a complimentary oven baked flat bread that is soooo good.Its crispy on one side and nice and soft on the other.I recommend the Lamb Agada which comes with either bread or rice.The lamb is so nice and tender and it just falls apart.The vegetables that are in the dish goes so well with it and the rice is super fragrant and flavorful.The service is also great and the place is nice and clean.Totally recommend.", "author": "Sophia S."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}