{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "One of the best place to eat out if you're into Arabic food. The service was excellent and the food was delicious. Can't wait to go back.", "author": "Ammar Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-12", "description": "I had the hummus and lamb, which comes with their clay fired bread, and a great soup/broth I don't know the name of. It was a great meal, and very authentic to a person who lived in Saudi Arabia. They also have free self-serve yemeni tea, which you should try with the condensed milk. You'll most likely be the only non-arab here, which just lends to the authenticity,  unless you're  xenophobic.", "author": "Jesse H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-10", "description": "It's always a good sign when you walk into a Chinese restaurant and all the patrons are Chinese. So imagine how happy I was walking into Yemen Cafe and we were the odd ducklings. I knew dinner was going to be good.\n\nAt the advice of other yelpers, we shared a lamb haneez and ordered an extra soup on the side and babaganoush. Honestly I can't think of one bad thing to say about the place. Everything we had was amazing. Plenty of food for two people and it was well under $30. Our waiter, the busboy and the owner were all super friendly and helpful. I highly recommend the hot Yemenese tea! I couldn't get enough of it. It's free of charge and you help yourself in the back. Can't wait to bring my family and friends here.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-24", "description": "Service was borderline terrible. Doesn't really bother me as this is one of those super casual places, and so, I do not expect 5 star service. Apparently, this is a popular restaurant well-known for its lamb.\n\n1)Complimentary bread: as big as a round pizza-- decent\n2)Complimentary salad-- good\n3)Complimentary lamb soup-- soo delicious\n4)Sizzling foul: fava beans-- good\n5)Haneez: roasted lamb with rice and potatoes-- good\n6)Chicken w/ salta: national dish-- chicken was good, salta was okay\n7)Yemen tea: cardamom and cloves-- good", "author": "LV C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "Yummy Yemen.\n\nYesterday was my first experience with Yemeni food. I had an idea of what the meal may taste like from my past experience with Moroccan cuisine - damn good. However, the food served here greatly surpassed my expectations.\n\nBased on Yelp reviews, my date and I ordered the Haneez with lamb. I am a sucker for lamb and order it over chicken every time, especially with Indian and Moroccan food.  Our entrees came with complimentary bread, salad, spicy sauce, and soup.\n\nOkay, I'm gonna have to break this review down for y'all because the food here needs to be properly addressed so you can fully understand how fucking good this meal was. I'll try to be descriptive as possible.\n\nThe Soup:\n\nWhen the soup arrived at our table, I'm not gonna lie, I was a bit nervous to try it based on its color. But it sure did not smell they way it looked- It actually smelled quite delicious. I watched my date take a sip and after his go-ahead I plunged in. MAN OH MAN. Why haven't I had this shit before? I can eat bowls of this soup, dipped with the bread, with a touch of that spicy sauce. MM MM MMMM! The soup is a simple light broth but so flavorful with a mild boldness to it. It has you guessing the whole time what ingredients are inside. But drink it quickly because it gets cool fast. That's what happened to me, but it was no big ting! I just simply began sopping up that brothy goodness with the perfectly baked bread pieces I tore off with my bare hands. YES! I love eating with my hands, I like to get to work when I eat!!!\n\nThe Haneez:\n\nThe Haneez, a slow cooked lamb served with rice and potatoes, came in a a huge ass plate and as I stared at the enormous chunks of lamb goodness, I thought to myself,\n\n\"TIffany, you couldn't possibly eat all this. Especially not with the soup and bread you just scarfed down in a moment of weakness. Hmm...Fuck it, I'll make room.\"\n\nAnd room I did make! Let me tell you- I poked the lamb with my fork and meat literately fell off the bone. I was so shocked. I just stared at my plate in amazement. I couldn't believe that this meat was so tender, so succulent and juicy, so flavorful and all for me! \n\nI was so in love with my food that I started to marry them together. I put the rice in the soup and ate it like that for a little while. Then I got creative and tore off a piece of bread, placed some lamb inside, and dipped in the soup. It was a beautiful union. Amen.\n\nSo yeah, this food is the bomb and it blew up in my mouth. Nuff said.", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "One of my favorite Restaurants of all time. Lamb is so good the way they slow cook it, its tender and juicy. All the food is amazing and a very clean place!", "author": "Alen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "Yemen Cafe................\n\nFirst and most importantly.. You've got to ask yourself.. what do I want to experience today.. do I want fine dining or do I want a nice place to impress a lady or whomever.... if you come here understand that this place is very.... I repeat very relaxed... very casual.\n\nI entered the cafe and I was bumping into little kids running a muck!!!! it looked like a playground. Kids ducking under tables while people are eating all that! (Family owned \u0026 ran business) Everyone seemed very loving, it was obvious they put family before business. That's a great quality.. I can tell alot of love goes into their meals.\n\nWhen we entered we were greeted with awesome hospitality... the waiter brought out Soup.. Naan..... Salad.... and most importantly Haneez!!!! Listen to me.. I don't care what you came here for.. I don't care if you're sitting in Yemen Cafe right now and you already ordered your dish... LISTEN TO ME YOU MAKE SURE YOU PLACE AN ORDER FOR SOME HANEEZ!!  Shit was delicious!\n\nI eat lamb often,, I've also got my Masters in Lambology... this by far was thee best Lamb I've ever eaten. (no bullshit) I enjoyed every single thing they brought out. The damn meat came off the bone on command! I whispered to that shit and it deboned! EFFORTLESSLY. I left nothing behind.. I loved the meat to the fat to the bone! SAVAGE!\n\nI loved it no complaints so that's what I'm basing my 5 Stars off of the Food and the Service.\n\nThe decor and presence of the place.. ehh. it's not much to look at but it's clean. The decor reminds me of a buffet. Nothing fancy at all, but the place is clean.. no flies... no bugs... no funny smells....it's all good!", "author": "Dre D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "Reminds me of back home.  Makes me miss yemen so much. You have to come here at least once if you live or visiting New York  selta with lamb and hummus w/ lamb is amazing. Great service too.", "author": "Meriam E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "It's excellent!!! I know Yemeni food so well and I would say its like home! I almost tried everything on the menu and everything is good. Plenty of seating for big and small groups. Good place too if you were by yourself. Servers are polite and great!!  The best thing is you don't have to leave the restaurant after you finish, you can get FREE hot sweet tea (the best)", "author": "Ali H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Best food I've had in NYC so far. The lamb haneeth is delicious, and the hummus is too.", "author": "Dave V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "The sweet tea was delicious! I could drink that all day. I also love their bread! Friendly service. Definitely recommended!", "author": "Mattie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "Some of the best lamb i have ever had. Excellent lamb stew, haneeth, rice and tea at the end was an excellent touch. I will definitely be back when in NYC. This place just got added to my list of \"must eat when in NYC.\"", "author": "Ahmed A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Every time we come to this resto, we're never disappointed. Even though we order one or two dishes to share amongst each other, we are provided with a bountiful plate of food that would describe us as gluttons if we'd tried to eat it all at once. The food is PACKED with flavour \u0026 the customer services is the most humble.", "author": "Sacha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "Enjoyable lunch. Friendly hospitable and welcoming. Soup was fragrant and delicious with some zhourg on the side to add heat to taste.  Humus tasty enough to help finish the large bread. Chicken kebab was soft and grilled perfectly without drying out and kabsa lamb dish had many pieces of soft tasty lamb in delicious rice.  The spices were delicate and balanced for any one's taste.", "author": "Elaine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "Yemen cafe is the best Arabian restaurant you will ever dine into in the United States. When I say this, I am NOT exaggerating because it is. Haneeth is the best of the menu but the other main entrees are delicious as well. My second favorite entree is the kibdah. The prices also aren't that bad and the staff is very nice and friendly. Trust me this restaurant reputation is spread all over the United States POSITIVELY of course. If you are visiting NYC, don't miss the chance to visit this place. It is an experience you will always remember.", "author": "Moneer A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-08", "description": "The food was way too salty. The meat in the lamb sughair was chewy. The bread was too doughy tasting. I feel like this place was probably awesome in the beginning, but the production has become mechanical and salty. I get the sense they are resting on their laurels. Time to put the heart and effort back into your food people. On a positive note, the meat of the lamb haneeth was very soft and tender.", "author": "Mini A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "Tasty food, friendly staff, casual atmosphere, what's not to like!", "author": "J J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "Was looking at apartments in the area and the broker pointed this place out as we walked by, citing \"The best lamb in the city\", which totally turned me on, as lamb is not only my favorite meat, but really the only animal I enjoy eating. So after a long day of trekking around bk, we headed here for dinner. \nThe line was out the door at 8pm on a Saturday (a great sign), but moved quickly. Service was super quick and efficient, but that's it. Love getting soup and bread as soon as you sit, and having the bread replenished without having to ask. \nFood: solid. Well-cooked, big portions for reasonable prices, good taste with delicious hot salsa, but none of our dishes were absolutely mind-blowing, I'm not sure why. The meat was very moist with authentic spices, but I guess I wanted the meat to be lambier. I like big, hard, lamb punch in the face when I eat it. This lamb was a little meek. \nDecor is... just don't look to closely, especially back by the register/kitchen area. Also \nworth noting: there were a LOT of young, well-dressed, good-looking Middle Eastern guys here when we went, if that's of any interest to you. It was to me. \n\nOverall, I'd probably give it another shot, especially if I wind up moving to the 'hood, but it's more about the whole experience and value than about the food at this point.", "author": "KJ W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "Delicious food! The lahma haneeth is great, as well as the chicken. It often gets packed, casual seating and casual yemeni theme. Family oriented. The area is perfect!", "author": "Lella M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "I tried out Yemen Cafe with my buddy and fellow Yelper. We wanted to try an ethnic food we haven't had before and decided on Yemeni food. The location was nice, easily accessible by mass transit, and the second floor restaurant offered a nice little view of the quant block it's located on.\n\nWe were greeted and seated by a nice young kid, probably a teenager. We decided to order two entrees and share them, because we wanted to try multiple things, but not knowing how big the portions were, how they taste, etc. made us decide to share. \n\nOur first entree, Salta, is apparently the national dish of Yemen. It tasted good, had a little bitterness, due to the fenugreek (think broccoli rabe). It was served with a large piece of flatbread, which is used to dip in this stew-like dish. My only qualm with this dish is that it was listed as an entree, but seemed more like an appetizer to me. I know me and my friend shared it, but even if I had got this dish to myself it definitely wouldn't be a filling enough meal for me. So the Salta was ok, nothing to write home about.\n\nThe second entree we got was Haneez, which was listed as being Yemen Cafe's most popular dish. I was pleased with how great the roasted lamb was cooked, it was tender, juicy, and flavorful. It was served alongside white rice with potatoes and a delicate tasting sauce that I'm not sure of the name. Once again, I know me and my friend were sharing, but if I had this dish alone, without having ordered another dish I would not have been full. I'm not sure if it was an off day as far as the portion size is concerned or if that's the size of portions they regularly serve. I've seen reviews stating that the portion size is large, but this wasn't really the case as far as me and my friend's visit is concerned.\n\nWhen paying the bill, the young man who seated us and I got into a conversation, and he's a really cool kid, talking about middle eastern cuisine, and just general pleasant conversation. He's definitely has a future in the restaurant industry if he's that friendly with all his guests. \n\nAnyway, like I said, the food was alright, nothing to write home about. I might return and try them out again, I'm still undecided.", "author": "Scott K."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}