{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "the food is awesome and the atmosphere is completely laid back and welcoming. \n\nporch ordered this lamb dish/stew that looked amazing and i had some chicken dish with the best hummus i have ever eaten in my life!!  \n\nthat being said: my sister had the machine gun turd drops minutes after getting home, but she can't eat gluten so maybe avoid this place if you are as sensitive as a boy in a bubble.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "authentic!! and the bread\nthey are always busy  not fancy but delicious food", "author": "Susan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "Went here last night with some friends after dropping by Mocha for some hookah. Had the lamb haneez and it was spectacular. Seriously, I just found my new obsession. Very good prices, amazing food, good portions. love love love love love it!", "author": "Princess S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-10", "description": "I came here once before about three years ago and I remember how big the portions were and how good the food was. Unfortunately in three years, things have changed a bit. No salad was given with the meal and the portions were much smaller. Also my haneez was supposed to be a lamb shank, but instead I was given some kind of lamb chop instead. The food was still decent, but a bit pricey and not as good as I had hoped. Not sure if I will return.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "I think this place could be downright terrifying if you're overly sensitive and come in on a busy day.  \n\nMy first time there, I'm not sure that our waiter said a grand total of more than three words to us.  Before we ordered, he came over, slammed (and I mean slammed, with some authority) a huge round loaf of hot flatbread, some lemons, hot sauce, and two bowls of soup on our table.  When it was time to order, he pretty much just stared at us until we blurted out our orders.  He then screamed our orders back at the kitchen like a drill sergeant.  When we'd almost finished our bread, he just slammed some more on the table, no questions asked.\n\nThe weird part?  I thought it was awesome.  The man was efficient, not rude.  He gave us amazing fresh bread and soup before we even ordered our meals.  Tons of good food before we even order anything?  Hells, yeah!\n\nThe food was great, too.  The haneez (roasted lamb) was ridiculously moist, among the best lamb dishes I've ever eaten... and I'm Greek, so now my ancestors will haunt me forever for dissing Greek lamb.  The roasted chicken and salta (sizzling cauldron of vegetables and fenugreek) is amazing, too.  The portions are obscenely huge, which also makes me happy.\n\nSo Yemen Café isn't warm and fuzzy, exactly.  I don't care, I ate my weight in fresh bread and roasted meat.  Screw the warmth and fuzziness.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Amazing delicious food! Definitely recommend this place. I ordered chicken shish kebob and my husband had their famous lamb dish. I should have ordered the lamb dish because it was so good! Juicy, soft, flavorful, falling off the bone lamb. Mmmm mmmm yummy!!", "author": "Sabrina J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "Yummy yum! I love the lentil soup,salta and lamb with the huge bread.. I just wish the interior layout/environment was formal", "author": "Tuba K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "Don't come here if you want to go to a nice place, have a few drinks and chill with friends. You go to Yemen Cafe to eat and only eat.\n\nThe place does not have any sort of taste in decoration, and the tables and chairs are very very old and worn out.\n\nThe food on the other hand is why I come here over and over again. They have amazing food. Very authentic.\n\nThe portions are large. You also get salad and soup with your main dish.\n\nI usually get the meat or chicken fatteh. IT IS SO GOOD! I have tried other dishes but I always go back to it.\n\nIt can get pricy here though, so be careful.", "author": "Sera A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "The atmosphere is very laid back and friendly. This is a great place to take some friends. Then there's the food. Eye poppingly huge chunks of buttery and succulent lamb on a bed of perfectly seasoned rice. I couldn't finish it all but gawsh I tried.", "author": "Ari Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "The best kabsa lamb in Brooklyn! Any lamb dish has lamb so tender that it falls off the bone. They start you off with a cozy lamb broth that is perfectly paired with the unlimited, fresh pita. End your fulfilling meal with their top notch, self-serve hot tea!", "author": "Lauren E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "God, do I miss Yemen! So, I go here every time I get nostalgic. I love the decorations, the waiters, the food. The haneez is delicious. The lamb broth is great as well. During Ramadan this place is crazy crowded though! A+", "author": "Milushka E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "This place is consistently good. Love the lamb fahsa (shredded lamb in clay bowl) and of course the Yemeni tea.", "author": "N E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "This place was phenomenal and the portions are large. I think anything on the menu is spot on but I would suggest lamb. The yemeni tea is a real treat.  It is a kind of place you do not expect great service and the prices are high but the food is very good.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "The best Hummus I have eaten in NYC. That is saying a lot since it has been a large part of my diet for about 5 years now. The entrees here are hearty and filling and they all taste great, but I could make a meal out of just their soup, hummus, and fresh pita. It is cheap too, and to finish the meal off they serve you some of the most delicious tea I have ever had- it's something like a clove cardamom tea sweetened with honey. I've been going for a while and it is very consistent. The space is shabby, but the top notch food and the diligent waitstaff make up for that. I don't even live near Boerum Hill and I travel up to 45 minutes to eat at this place. Some serious good food going on here.", "author": "Will R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-16", "description": "I just finished my leftover Kibdeh (Lamb liver) from Yemen Cafe ::drools:: \nMost of you cringe at the very thought of liver because you're served some squishy and smelly version of it. Don't worry, their liver is far from such. Think exotic spices, tomatoes and onions- its a celebration in my mouth every time. I hate saying this, but their food is serious competition to my mother's... and we're Yemeni.  \n\nIf you can't make it to Yemen, this is the next best thing. Yemeni hospitality at its finest! Where else will you get soup, salad and hot cardamon sweet tea on the house? \n\nTell the waiter Sideeq the Yemeni from Texas sent you! I'm hoping I can get a point system going for free kibdeh for life! Dream.Come.True.", "author": "AHLAM S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "You can't get more authentic than this.  From the marag (the soup appetizer) to the Yemeni home cooked flaky doughy irresistible bread, it's hard to keep an appetite for the feast that is soon to be on its way.  Order the haneez it's an amazing lamb dish with a generous portion of rice and zahawig.  My best friend and I are originally from Sanaa and enjoy treating ourselves everyone once in a whole to Yemen Cafe's delectable cuisine, not to mention the staff are extremely polite and more than happy to serve!", "author": "Mary W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "Went there before \u0026 it was great and it's always great. Went there today and I told them I'm in hurry. They were quick and impressive. Love their food and service :) best option for arab people and cultural people.", "author": "Noah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "This restaurant really surprises me. I was in the area for trader' joe and went into this restaurant out of curiosity. To be honest, first impression wasn't too good. Yet, their lamb dish is absolutely delicious!! I ordered the Haneez, and it is quite a big portion but still managed to clean the whole plate. I highly recommend to try their salta, I was too full to order that, but it smelled really good from other tables. If you are a fan of lamb meat, this is one place that you cannot miss. Hope you guys enjoy it! I would love to know if my review fits your expectation...", "author": "Gavin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-28", "description": "I had dinner at this place food was okay compared to other Yemeni restaurants in the area. Service is poor as expected. Unfortunately they include service charge (tip) with the bill for their poor service. Even though I love eating Yemeni food if I don't have any options and this would be the only place open I will pass. Sorry but not coming ever again. I rather have a gyro sandwich than eat here.", "author": "Sami A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "This place is a solid choice for neighborhood dining. The place has a cafeteria feel to it, but that's made up for by the super friendly atmosphere. We came here at about 5pm or even earlier and it was packed, which already tells you a lot. I am not a person who cares about the service component that much but I have to say that the service was very friendly and very genuine without being fussy or overbearing. At the end of the meal, an elderly gentleman, I forget if he is the owner or the chef or the manager, came by and chatted a bit about the meal and the restaurant. The food was fairly simple, but definitely a pleasure. You get a complimentary spiced lamb soup, which is delicious, and piping hot, wonderful flat bread. I am difficult to impress with hummus but the rest of my party said it was awesome and even ordered a second round. Another detail which I hugely enjoyed was that they have complimentary tea which you can serve yourself. I am a tea lover and while I have no idea what exactly is in there, I thought it was delicious. It was quite sweet, which I usually dislike, but here it worked because the tea tasted very strong. Overly strong tea can be not just unpleasant to taste, but can even make me feel sick, but this was somehow balanced. I should go back and ask them how they make it. On to the food. The dishes are not cheap for such a simple place but they are quite big. I ordered the slow cooked lamb and it was a huge piece of lamb, cooked to falling off the bone perfection with great flavor.", "author": "Aliz C."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}