{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-18", "description": "Good food, can be busy at times. The complimentary tea take the cake.", "author": "Omer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "The best place to refuel after food shopping in the neighborhood! First off, the included \"starters\" are delicious and will fill you up. With a small appetite were almost satisfied just eating the starters, the freshly baked Malooga, delicious tea, etc. but once the food came we HAD to make room since it smelled and was mouth-wateringly good.", "author": "Jocelyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Rishi my son and I had a good dinner here a long ago and I forgot to give a review. I loved their beans and their pita bread that they freshly made. We had such a good time and will now be taking my daughter there.", "author": "Yuvaraaj J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "Cannot for the life of me remember specifically what I ate here, but it was SO DELICIOUS that I feel absolutely compelled to give this place a rating solely based on my one dining experience here. The staff was so sweet and I felt like I was being treated as a guest in their own home. We had some kind of a soup for an appetizer, with a flaky, crunchy bread for dipping. Main meal was pure, delicious LAMB.. wonderfully spiced and marinated. \nWould love to come back here and scope out their other dishes, but that soup and lamb sold me on this place!!", "author": "Janet M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-23", "description": "I grew up for a few years in Sanaa so it's been awesome getting to re-experience their phenomenal cuisine here in Brooklyn. This place is great- friendly, fast and delicious.As many have said- the Haneez is off the hook- fall off the bone tender and a huge portion. My personal favorite is the Salta however- a fenungreek stew that is entirely unique and delicious. For $15 you get a huge cauldron of the stuff PLUS a quarter of a chicken, bread, salad and soup. More than enough food for 2 people. I was there by myself- haha.", "author": "Austin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "Love this place!!! Food is great and service is great!' Come on down and enjoy a great middle eastern meal!!! From Yemen to Brooklyn NY!!!!", "author": "Omar H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-05", "description": "This restaurant is famous among my middle-eastern friends (especially the one's from Saudi and Yemen). The first time I heard about it was back in Indiana when I was in college with a bunch of Saudi friends. They decided to pick up one weekend and drive all the way to New York just to eat at this restaurant (10 hours). They swear by it and so I had to try it for myself. A couple months back, I did just that with one of those Saudi friends... and I couldn't believe what I was experiencing. The soup was so full of flavor and the lamb simply fell off the bone. The owner takes pride in his food and knows his customers well.\n\nAs for ambiance, I wasn't expecting fine-dining. This is more like a hole-in-the-wall middle-eastern style dive. It is hard to tell the owners and employees from the customers at times. Everyone is just chilling and chatting and they all seem to know one another. Don't expect high class service... but do expect your taste buds to go berserk! Your mouth and belly will have been in heaven if you go here.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "i came here 4 years ago with a friend and oh my never been to a yemeni place before. well priced, good food and traditional. definitely coming back. only to get vegetarian food this time.", "author": "Anindita D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-30", "description": "Soooo good. The lamb stew is amazing.\nMaybe the most authentic restaurant I have ever been to. Certainly the best Yemeni restaurant I have ever been to.", "author": "Sam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-20", "description": "I tried Yemeni food for the first time here on Friday night. I love the atmosphere in this place, it's very casual and friendly. You seat yourself when you walk in and stare at the photos of Yemen on the wall and wonder how come you never knew how beautiful Yemen was.\n\nI ordered a lamb dish and unfortunately I cannot remember what it was called. It came with rice and potatoes and everything on the plate was extremely flavorful and fresh. The complimentary bread is AMAZING. I would recommend sharing here because the portions are huge.", "author": "Catherine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "I've bee going here for a long time and it never gets old. My favorite dish is the salta haneez. The lamb is fall-off-the-bone delicious, maraq is so flavorful, staff are very polite and attentive. Great service excellent 5-star food and one of my favorite restaurants in all of nyc", "author": "Jes M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "This was far and away the best experience with Yemeni food I have ever had.*\n\nThe naan-y bread was delicious, especially with the hummus, and the haneez was tasty, but a little tricky to separate meat from fat and bone. \n\nFor 4 of us, we split the haneez and chicken curry entrees (which came with 2 soups and 2 salads) and the hummus and something that was under the appetizer section, but came out as a dessert (it was honey and sesame seed soaked soggy bread strips (not the best part of the meal, but it was edible)).\n\nThe food was pretty good overall, but I'd say the highlights consisted of 1) eating yemeni food (look how multicultural we are!), 2) the atmosphere (lots of Arabic floating around the room), and 3) the friendly local service (I'd say our waiter was 16, and nice, and a Knicks fan (bonus star)).\n\n\n___________________________\n\n*Disclaimer: The only other experience involved me trying to go to Yemen Cuisine around the corner during Ramadan. They were closed for Ramadan... so by far the worst experience I've ever had with Yemeni food.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-18", "description": "Yemen Cafe was good. I had the haneeth, which was good. The restaurant is extremely cultural and you feel as if you're in Yemen. The food, the people and the language made the meal more exciting", "author": "Eric G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "Amazinggg!!!! I loved it. Now Yemeni food is one of my favorites and it definitely just proved why Middle Eastern food is one of my favorites. The people were really nice, friendly and helpful even though when I went, it was quite busy. The food was awesome! The only thing that's kinda \"bad\" in a way is that it's a small place. Since it was packed Saturday night, it just made the whole room seem cramped up but other than that, I loved it and I will be going back there again. It is also very affordable. I also want to add that they give a lot of food which is amazing because everything tastes so good!", "author": "Jalisa J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "The staff here was friendly. The waiter brought out delicious soup and bread as complimentary food, while we placed our order.  The chicken curry and rice was very tasty and filling. The price was very reasonable for the quantity and and experience.", "author": "Rick S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "This place is nothing to look at but do not let that dissuade you. Upon arriving we were immediately greeted and brought water and a lovely green soup. It was a lamb brith with scallions and onions any other ingredients were a shrug of the shoulders when asked. The chef just kinda does his thing and makes it to taste. Next was the salad very simple iceberg lettuce cucumber and tomatoes but whatever they dress it with is so good that it was delicious. I didn't get a starter and for that I'm glad. Next time I may get a few apps and not a meal. I decided on the chicken salta. The stew that came with it was bubbling in the clay pot...so so good. I actually ate all of the flat bread myself(which is quite the feat trust me) it was perfection. The give you a knife with your meal which is totally unneeded, I grabbed the chicken none to move it on my plate and ended up with a clean bone in my hand. Lastly it's not offered but after I saw people helping themselves I helped myself to some tea with a splash of condensed milk it was so sweet and fragrant. I'm already planning a trip back.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Good lord, is this place good. If it were possible to get a blood transfusion with that lamb broth soup, I'd do it in a heartbeat. One of my favorite restaurants in the whole city, and the people who work there are sweethearts. Lamb falling off the bone, that amazing fresh baked bread, and the babaganoush is ridiculously delicious.", "author": "Zach E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "All things lamb are amazing here. Yemeni cuisine is a unique type of Arab cuisine and here it is done right. The Haneeth which is a big chunk of lamb and rice is very famous here. They give you a free spicy soup before your meal. Overall this is one of the gems of New York City and Brooklyn. Top quality food for an affordable price. The service is also extremely fast. Don't let the appearance of the restaurant fool you.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "We were visiting NY from bay area and saw the yelps reviews for this place. Oh man, the food is amazing! they have alot of good lamb dishes and it will not disappoints you!", "author": "Ali T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "A couple of friends visiting from Saudi Arabia brought a couple of friends and me here. This is not a fancy restaurant; you sit wherever you want, preferably where the seats are empty, and if you're lucky, someone comes to you to take your order, or you can make the trip to the counter and order from the guy there. \n\nMy friends handled all the ordering (in Arabic of course), but the food they ordered -- lamb with rice, chicken with rice and a couple of soups -- was ALL DELICIOUS. The food was not spicy, but well-seasoned. I would recommend it to friends, and will definitely be going back.", "author": "Juan M."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}