{"aggregateRating": {"reviewCount": 460, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "Went here for the first time and loved it! The server was friendly and quick at bringing us hot bread and soup while we decided on what to order. The atmosphere was very friendly, homey and lively. We ordered Fahsa and Fatah with honey to share among two people, which was the perfect amount for a light meal. The complimentary tea with condensed milk was a tasty bonus! Will definitely be back again!", "author": "Jessica W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-24", "description": "This was my 3rd then going there and it never disappoints. Absolutely love the lamb Haneeth! It was so delicious. They gave me a complimentary lamb broth type of soup which was really good.", "author": "Lima P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "I'm sure I wouldn't be mistaken if I said, \"In New York, you could find a restaurant that serves any and every cuisine imaginable\", which is basically like saying \"from any country\" imaginable. Say even Greenland or Bhutan or Yemen!\n\nSuch was this delicious dinner tonight in the Clinton Hill section of Brooklyn - Yemeni. \n\n\"Slightly\" simular to other middle eastern foods, it goes radically its own way quickly after the word \"slightly\". Starting with a bowl of soup that was so unique, I sipped it extremely slow trying to identify even one spice. I failed this mission but no matter, as it was scrumptious. The included salad was just a basic green salad with a tasty dressing I could once again not identify any of the spices or flavors. \n\nMy son and I shared a baked chicken and rice dish and a lamb rib and rice dish. He thought the meats were too well done and a bit dry until I explained to him that this was \"Bedouin\" food and this is how they cook there halal meats. \n\nMy heritage is Tunisian so he trusted I knew what I was talking about. Once again both meat dishes were delicious. \n\nBoth of these ample selections were extraordinary and by ample I mean you will not leave here hungry.\n\nA large urn of Yemeni sweet tea is ever so present to sip as you digest the meal you just devoured.\n\nI love trying \"New\" tastes and different cuisines. I'm really happy I came here last night. This was a lovely visit and as close I will probably never get to Yemen!", "author": "Sidney Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-10", "description": "Yemen Cafe is a pleasant Yemeni restaurant in Brooklyn.\n\nThe clientele consists of lots of Arabic speaking people, which is always a good sign.  \n\nI really wanted to like the food more than I did, though.  I tried a chicken kabob, and besides tasting like charcoal, it didn't taste like much.  I enjoyed the rice though, which had some sort of orange sauce with vegetables on it.  \n\nMy wife said she really enjoyed her lamb dish though, and our friend loved her veggie platter, so perhaps I just got the wrong thing.\n\nIt's definitely a place I'll be back to and will hopefully enjoy more next time.\n\nRecommended!", "author": "Dimitrios D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "I'm so in love with this place. Everything about it was stellar! When looking through the menu I noticed everything was pretty pricey and wondered why. Was the food that good? Big portions? Are they snobs? Well you won't know till you go in for yourself right?\n\nRestaurant is pretty quiet. Me and my friend entered the restaurant and the server said we could sit wherever. We decided to split the mix grill and I got the shakshuka. Everything happened in a blur. Server brings us these Frisbee sized flatbread with lemon and this type of salsa. Then comes the soups (for both) and one order of salad. All this is complimentary. While we're sitting here getting full off the free stuff, I'm here thinking we have more food coming. \n\nTheir definition of shakshuka is scrambled eggs with tomatoes and a couple other ingredients. Lmfao. I didn't say anything. The mixed grill came with rice, lamb and chicken with veggies. The food was flavorful but the meat was charred a bit too much. It was tough. You mix scrambled eggs with rice and it feels like you're eating a hearty Chinese meal. We ended with the Yemen tea (complimentary and unlimited.) I think that was my favorite part of the meal. The tea was sweet without any use of milk or sugar. There was definitely some spices used to make it. It had a nice aroma. \n\nSo that's the reason why. With all the other complimentary stuff you're getting, it's only reasonable that they charge as they do. It's a very welcoming environment. Certainly new experience to have if you're not used to Yemen cuisine.", "author": "Waheda I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Cannot say more than excellence.. this restaurant has been in Brooklyn since the 80s, and still kept its great tasty food and phenomenal service.. I ate lots of bread, and their Yemeni fool all was great", "author": "Nada S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "The tea here is utter crack. Must have had at least 4 cups during my quick lunch here today. \n\nGot the hummus and the lamb haneeth, which was ever bit as tender as reviews suggested. Lamb brothel served in the beginning is super flavorful and thick, and the naan pairs perfectly with hummus and the soup. \n\nGood service and very good food. Would come back just for the tea!!", "author": "Elizabeth L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "This place is soooo good. If you're in New York it's a must try. The complementary tea with condensed milk is so good. We ordered a few dishes to try like the foul, the lamb was soooo tender it falls off the bone. The fresh bread was amazing. Wish I had more room to order the fatteh cause it's different than traditional middle eastern fatteh. More like a dessert in this culture", "author": "Marwa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Lamb haneeth (lamb cooked for 5hours till it falls off the bone, over rice) is to die for. So is the foul (thick bean porridge you eat over bread). Chicken korban is ok, would not repeat. Everyone talks about the Fatah (bread, cream and honey) but we didn't like it at all. The meal starts off with free bread (huge and naan like) along with a delicious curry leaf soup and salad. So much free stuff! \n\nThe lamb haneeth was around $22, the foul around $8 (it's an appetizer), the chicken korban around $16 and the Fatah is around $10.", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-12", "description": "The food was good. We had the hummus, the foul and the vegetarian dish (which is okra, potatoes, carrots and eggplants with basmati rice). Quality is good but nothing special. The hummus was flavorless. \n\nThe problem is the bad service. We didn't feel like we were welcomed at all. \nThey took 15min to take our order but regulars guests/friends were served first while we were there before them. They were having a good time with their friends while ignoring us.\n\nAt the end we tried to say goodbye but it seems it was very hard for them to at least wave back or say a word. It's a shame to ignore respectful customers just trying to have a good time. I don't recommend.", "author": "Eric O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-29", "description": "If you want to expand your taste buds and go for something non traditional, this is for you! Authentic Yemeni food at its best. Order the lamb haneeth. Every meal comes with a rich lamb broth as well as flat bread and salad. We liked this place so much during our trip we came back the day after! Also tried the curry chicken which was perfectly cooked and hearty. Portions are very generous for the price especially since everything is halal/kosher. Expect a line or a wait if you're coming during peak hours. They seem to always be busy!", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Hands down my favorite authenic Yemeni, roasted, melt in your mouth, falling of bone, lamb meet in the whole USA. You won't go wrong if you order \"LAMB HANEETH\",  that's what they famous for. This is a family owned and operated restaurant. All employees were very courteous and inattentive.\n\nEverything was cooked and served with such care. As others have said, the Yemeni tea was heaven, Free and self-serve, so don't forget to get some at the end of this wonderful meal. So long Habibi !", "author": "Mo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Hello to all my Yelpie frands.\n\nI have been visiting this spot for sometime ! This place is mecca for Yemeni cuisine at its finest and my lord they do a good job !\n\nWalk in\nSit\nLamb soup\nSalad\nBread\nMeat (Roasted lamb)\nMeat (Lamb Ribs) Ba freak'in zingaaaa ( just order close eyes ) must must have ! Just do it....\nMeat (bbq Lamb)\n\u0026 kinda sorta meat ( chicken )\nTea and alot of tea !\n\nAgain order lamb ribs w basmati rice and lamb soup.\n\nSkip the hummus, blah appetizers \u0026 bread ! The reason is that this resturant is predominantly known for its fine meats. Eating bread and appetizers will fill you up. The service has always been top notch ! Place an order and things start showing up in order. Super cool staff. Price vs the ratio of food is justified \u0026 quality too. Btw have you ever wonder how they eat with there hands. Well this is the place to know why. Also have Lipitor ready after the meal because you will need it. :D\n\nGood atmosphere. Enjoy", "author": "Ahmad F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Yemen Café in Cobble Hill, Brooklyn is the perfect spot to indulge in a Yemeni feast.  Not only is it easy accessible by public transit, it is open seven days a week from morning to late night. The Yemeni food here is indeed tasty.  Starting with the famous Marag Soup is a no-brainer. A salad often follows this.  For the main course I had the national dish which is a vegetable Salta (served bubbling hot in a pot) and accompanied by Khubz oven-baked flat bread.  Chicken haneez goes so well with a Salta whether you mix it in or eat it separately like Yemenis do.  Of course I had to have the spicy Yemeni sahawiq sauce which I used with everything.\n\nService was totally pleasant from the moment I walked in.  Go hungry to Yemen Café ... but def go!", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Was here earlier with a few friends highly recommend coming here the staff is very friendly and food is really good fresh and delicious we got haneeth beef and chicken rice also got a soup and salad with fresh baked Arabic bread and a spicy sauce Definitely stop by here if you're in the area and are craving some Arabic food!", "author": "Lindsey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "Incredible Food, Fantastic Prices. Truly Authentic. Service slow, Ambience not a fancy restaurant but nice. Overall excellent experience.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "We came all the way from Jersey today to try this place. We sat quickly (on a Friday night), as a party of 4. The place is very small and packed. All seats were taken. Order was taken right away and the soups (delectable!) and salads (ok at best...) came out right away. Their bread is so so amazing though. Reminds me of my mom's bread. We are Egyptian and we make similar bread as well. My 2 year old ate it all and was double fisting it. I don't blame him. He's probably a baby foodie himself!\nWe ordered 2 lamb haneeth, 1 chicken haneeth and one app: lamb liver. \nWe were so stuffed! I'm on keto so I didn't touch the rice (which was very massively portioned) but the lamb is very filling. The meat fell off the bone. My only criticism here is that my lamb piece had a lot of bones. It was also very fatty. My husbands plate however was perfect. Meat was so good and very little bone. Overall, I liked the place and the fast service.", "author": "Christina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Heard too much about this place from my family before arrive to NY. attempted to go a few times until we actually made it.\nPlease feels like a restaurant that I've gone to years and years ago. feels very homey, loud but tolerable. Service is great and staff is super friendly. the food is something you would have back home, same feel, same attitude and an over all great experience.\nplease offers unlimited bread and soup which are AMAZING. portions are very generous and the quality is fantastic. \nits good for kids and groups.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "Did a job in the kitchen welding  The  guy made me some food a lamb plate  That was the softest lamb  I ever tasted", "author": "Robert C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "Food is delicious, I usually get the chicken saltah but get full from the complimentary soup and bread side. Also complimentary tea which is too sweet for my liking but still good. Its a great place to bring friends to, especially out of towners.", "author": "Muhammad S."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Yemen Cafe \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vslOvCtDTQrVpozoKYH02A/ls.jpg", "@type": "Restaurant", "telephone": "+17188349533"}