{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-20", "description": "I used to get delivery or dine inhouse here at least once a week for about a year when I lived in the area and I miss this place greatly now.  The Obanzai specials are generally pretty good and always interesting as are the rolls and entrees.  I can't remember ever getting anything bad in the dozens of times I ate there.  The food was always top notch and the environment very pleasant and warm.  I had a bit of a crush on the hostess too - she was so sweet.", "author": "Scott S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-18", "description": "This is definitely one of my favorite neighborhood places.  You definitely should try to get there earlier in the evening especially on a weekend night since they sometimes run out of certain items which is fine since it just means everything is fresh. I usually get a couple of the obanzai dishes and then the beef kakuni. On most nights, the beef kakuni is absolutely beautiful- it's tender and juicy. However, there have been a couple of nights when it was a bit overcooked. I also had the organic teriyaki chicken. The chicken was tasty (clearly good quality chicken), but I thought the actual teriyaki sauce was a little on the salty side. The sushi is simple and fresh, but if you're looking for  just a a sushi meal in the neighborhood,  I'd hit up Ki Sushi instead.", "author": "Angie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-15", "description": "Unable to find authentic Japanese food in Brooklyn Heights, I was elated to discover Hibino in nearby Cobble Hill, just a few blocks away. The oshi (pressed) sushi of Kansai is colorful and beautifully presented, and the nigiri-zushi and sashimi fresh and tasty. On each visit, I have tried at least one of the obanzai (small plates) and all of them reminded me of the home-cooked meals I shared with my host family in Japan. My personal favorite dish is the Beef Kakuni (short rib) which comes in both appetizer \u0026 entree size, the latter being such a generous portion, I brought it home for lunch the next day. Tofu is handmade here and do not miss the creamy soy pudding (like a custard) for dessert. It is served in a miniature milk bottle - kawaii (cute)! In addition to the rotating menu of obanzai, miso soup is served with different ingredients (potatoes, tofu, daikon, etc.) each day to further sustain your palate's interest. No delivery as of this review, but they do have a take out menu. My only other hope is that they improve the ventilation and start accepting AmEx soon. Otherwise, look no further for the real deal for Japanese in Brownstone Brooklyn. Umai!", "author": "Christine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-11", "description": "My favorite Japanese in Brooklyn. I will never forget the creative and at the same time traditional Kyoto-flavor of their tapas and sushi. I strongly recommend their desert too.", "author": "Asian I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-26", "description": "I ordered takeout from Hibino, so I cannot comment on the service.  The food was ready 15 minutes after I phoned in my order.  It is well priced -- $21 for dinner for both my roommate and I.  We shared two of that day's obanzai (small plates that change each day) and two sushi rolls.  One of the obanzai was a seaweed salad with tofu that was exceptional.  I generally don't care for the texture of tofu, but this was great!  The cabbage roll obanzai was also quite good.  The portions of both were much larger than my roommate and I had expected for $4 each.  The sushi (spicy scallop and tuna jalapeno) rolls were good, but nothing exceptional so I will stick to their other offerings next time.", "author": "Angela H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-07", "description": "Wonderful, fresh, inventive. Service lovely although sometimes slightly haphazard. One of three favorite Japanese places in NYC.", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-18", "description": "I have dined at Hibino a number of times and have been consistently happy.  The food is very inventive and carefully made, yet consistently tasteful that I have been willing to try all the specials.  In fact, the only problem is that I gravitate towards the specials (listed on a chalkboard daily) that I rarely get to the menu items.  There is always 4+ chefs behind the bar cooking and they are always so friendly and attentive.  Service is gracious and attentive too.", "author": "Brigette r."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}