{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "I found Doraemon's food in here, the dessert Dora...\nI'm too excited ! My favorite Doraemon and his favorite Dora pancake. :')  \nHappy tear. :')", "author": "Felicia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "This is my favorite place in Brooklyn. All their dishes are clean and fresh tasting, and prices are reasonable. The homemade tofu and peach veggie juice are stellar. I highly recommend.", "author": "Kristine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "These people are so awesome. We had a party of 7 and everything came out on time and the server was so attentive. Had a mix of nigiri, rolls, Kyoto style hot appetizers (rotating specials it seems, with really nice creative touches) and more traditional Japanese hot entrees like katsu and teriyaki, and it was all wonderful. Atmosphere is pleasantly vibrant. Nice touches but nothing contrived. It's apparent that they are just focused on providing you a really nice, timely, carefully and thoughtfully prepared meal with good ingredients.", "author": "Jerome T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "I've been to Kyoto and just found a little Kyoto in Brooklyn. This restaurant is minimal and zen which makes it quite authentic. It's not overdecorated or trying too hard to feel Japanese. This is as Japanese as It will ever get. We enjoyed the food and the atmosphere. The staff was pleasant too.", "author": "Tomas K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "I've eaten here a couple times, and tonight I ordered dinner to go. We ordered teriyaki chicken, rice, edamame, spring rolls, and seaweed salad. The only edible thing was the rice. The food was extremely disappointing. The chicken was so dry, the spring rolls were fried and had no flavor, and the seaweed salad was drenched in dressing. Really disappointing considering it was over $50.", "author": "Lindsey H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-11", "description": "Went here for lunch and was not impressed-- i cant understand why people rave about this place that's clearly overpriced even in the Brooklyn heights neighborhood where it resides. Got two rolls for lunch one a tuna roll which tasted fatty (like to the point where the tuna was actually chewy) and a spicy tuna roll like I've never had before-- and not in a good way. I've never had a spicy tuna roll that is literally a regular tuna roll with spicy mayo on top. That's NOT a spicy tuna roll in my book! I sat at the counter area and can understand why they have a \"grade pending\" in the window. Everything looked very messy and not organized. Won't be returning. Just disappointed at my high expectations.", "author": "Elle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "Perhaps one of the best sushi values in Brooklyn from a cost-to-quality perspective. The kitchen eschews familiar watered-down fare that plagues most other sushi establishments in favor of simple approaches and screamingly fresh fish. Forget the mushy overly sauced spicy tuna and crab stick filled California rolls--though Hibino serves stellar versions of both--and instead look to the uni hand rolls, fresh oyster, or sushi and sashimi combos for the best deals. Don't let the \"combo\" fool you though, the chef has latitude making these as close as you'll get to a miniature Omakase, if a bit more rote (but for $25, who can complain). The menu is authentic and manageable, with a rotating Kyoto-style \"Obanzai\" specials to round things out. As with any Sushi place, sit at the bar, order a mid-priced sake (there are fancier options, but they plateau) and watch the masters at work, enjoying a meal that unfolds at exactly the pace it should.", "author": "Gee B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "Awesome place that my hubby found for our Brooklyn date night! We decided on this place last minute and tried calling in to make reservations (for a Thurs night). Sadly, they did not take any reservations, but told us we should not have a problem getting seated. We got there around 7pm and we were able to be seated right away. They have daily specials that is displayed on a board.  The setup of the restaurant gives a pretty chill vibe.\n\nWe started with the seaweed and field green salad. I liked the variation in the seaweed salad. The field green salad was also yummy we both thought the crispy potato chips were a nice touch.\n\nWe then shared 3 rolls (spicy tuna roll, salmon avocado, yellow tail jalapeño) and salmon hako sushi with sides of spicy mayo. Our favs were he spicy tuna roll and salmon hako sushi. The sushi didn't taste fishy at all. The salmon hako had a very pleasant taste and the miso was a nice sweet touch. \n\nWe then had red bean ice cream for dessert which was also very creamy and delicious. The server also gave complementary hot soy bean tea at the end of our meal. The hubby wasn't too crazy about it, but i enjoyed it!\n\nThe menu is a bit pricey, but it's a nice place to go to for a date night with your significant other or just to catch up with a friend. Service was pleasant and the entire staff was very helpful if we had questions about the menu. \n\nWould definitely come back!", "author": "Irene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "Always good food, and good service. Expect a wait! The short rib appetizer is delicious. Moderately priced for the area.", "author": "S. K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "This restaurant is a great little gem, hidden in cobble hill. The atmosphere is very casual and warm. Service, is super friendly and accommodating. I brought our daughter along in her car seat, they were nice enough to put us in the corner with a bit more room to place her car seat. Food is pretty good, we started off with a order of the seaweed salad. The salad was nice and refreshing, but the sauce may have been a bit heavy for my taste. Then we had the agedashi tofu, surprisingly still crispy on the outside and silky smooth on the inside. Along with a side of edamame. My gf had the Hibino chicken teriyaki chicken, which was exceptionally good when they include the slightly charred chicken skin along with each pieces. I appreciated that part the most! I had the Hibino sushi platter, nice assortment of sushi. Accompanied by 1 order of roll of your choice, I chose the yellowtail scallion roll. Fish was fresh, rice was at nice temp. Pretty straight forward and nothing fancy. Just how sushi is suppose to be. Overall it was a good pleasant meal! Will be visiting this place again, whenever we're around the neighborhood and in the mood for  lol", "author": "Davis N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Return? Yes, local, relatively inexpensive, good food\n- Atmosphere 3: No frills which I like. Crowd runs the gambit - young families, couples, friends - typical neighborhood haunt\n- Service 4: Attentive, responsive, quick table turnover but not in your face about it\n- Food 3+/4: Very good but not great sushi (nice fish - eel, shrimp tempura, tuna, yellowtail), also offer American staples w/ a Japanese twist - pot roast (4 - beef tofu), lasagna (4 - tofu), etc, green salad (3- not a big fan, served w/ potato chips), chicken teriyaki (3+ - $3 w/ rice), root vegetables (2+ mushy)\n- Drinks 3: $6 draft beer, $11 white wine\n- Cost 4+: Very affordable, $60 to $70 pre tax/tip for two w/ a beer and a wine", "author": "Will S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-07", "description": "A neighborhood restaurant that's a bit of take-out factory.\n\nWe sat at the bar, so we could see the food getting prepped. The chefs seemed a little miserable, and because of the sheer volume of the takeout orders, it was very hectic. They also don't have a dishwasher so there were two people running around the whole time washing dishes and putting them away. The kitchen area is pretty tiny.\n\nThe service was adequate but rushed. When food was brought to us, it was just set down and there was no explanation of the food. We had the fresh tofu, and it comes in a jar with ginger and sauce on the side. It would have been nice to have an explanation on how to go about eating it, but we were just left on our own. I mean, it's not rocket science, but it was our first time getting a dish like that, so a little guidance would have been nice.\n\nWe had the stewed chicken obanzai. It was bland and not memorable. The box pressed mackerel was also underwhelming.\n\nFor our entrees, we had the beef kakuni and the sashimi plate. I think I wanted the chirashi, but they said they didn't have it. The fish was ok, not great quality, but it was edible and I didn't get sick. The beef kakuni was a huge portion. It was tender, but not very flavorful and not seasoned well.\n\nThe whole experience was a dud. I felt almost anxious from the staff running around and all the children crying. There also is a lot of people coming in and out asking for tables and picking up their takeout. And without a proper waiting area, if you are sitting somewhat close to the door, this can get annoying.\n\nBonus: A family of 5 was there and their daughter had a tantrum and threw her bowl of rice and other food all over the floor and splattered on the guests at the next table over. If it got on me, I would have been angry, but seeing it from afar was kind of amusing. Be prepared to sit next to lots of children!", "author": "Diane Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "Bit disappointed as this place was recommended by my Japanese friend.\n\nI got the eel avocado roll, it was really just okay, tasted the same as the ones from Korean deli. \n\nI also tried beef kakuni, one of the more popular entree. The portion was big. It just did not hit the spot, I would say it was okay (again.)\n\nI'm not sure if it is just me or this place is overrated. In any case I will give it another shot when i'm around next time.", "author": "Erika C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "This place was a rare find! A truly authentic Japanese place with some really novel takes on standard Japanese restaurant fare.\n\nMy boyfriend and I split a spicy tuna roll so good, we ended up ordering a second. Most of the time, spicy tuna rolls are kind of cold and chewy but this one was soft and warm and the sauce on top was a little more tangy than spicy.\n\nFor our mains, he got the tonkatsu, which was pretty good, according to him. I got the teriyaki chicken, which was fantastic. The chicken skin was crispy without being crunchy, and the chicken was soft and tender. The sauce was delicious, a sweet but more savory blend. And the chicken sat on top of fresh vegetables, chosen to perfectly complement the chicken. Delicious.\n\nThere seems to be a bit of a wait during the summer dinner hours so be prepared to not be seated right away. Also, it can get rowdy because they have an extensive drinks menu. But - definitely worth a trip.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "this place has ABSOLUTELY the worst service also the food sucks. we ordered a spicy tuna roll that took about 40 minutes to come out also the tuna was warm (CONCERNING) and it was plain tuna with just spicy mayo on top. save your money, go elsewhere", "author": "Janice S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "This is my favourite Japanese restaurant in NYC. It's got some amazing dishes, some of which I haven't had as good since being in Japan. The service is wonderful--every member of waitstaff has gone out of their way to make it a good experience. Overall the most delicious food and friendly service around. It's my favourite restaurant in Brooklyn--seriously don't miss it!!", "author": "Nurit A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "We actually originally decided to eat at Ki Sushi due to their high reviews on yelp. However, when we got there, they had a B grade; immediate turn off. \n\nLuckily there are many sushi spots in that area and the next place that came up with great reviews was Hibino. Thankfully when we got there they had an A!\n\nMy boyfriend ordered the chicken teriyaki entree which came with miso soup and an obanzai appetizer which was like stewed mackerel. I didn't taste the miso soup but my boyfriend liked it. The stewed mackerel was so good! It wasn't fishy, was well seasoned, and the broth was great! The chicken teriyaki, which came with a side of white rice, was extremely flavorful as well; we loved that sauce wasn't too sweet or salty as teriyaki sauce tends to be - it was very well balanced. \n\nI ordered a lobster tempura roll and shrimp sushi with a side of white rice. Both were quite tasty and I especially enjoyed the shrimp sushi. \n\nThe best part was that everything cost $47.40! Not too bad for the quality and quantity of food that we got. We eat a lot and we definitely left satisfied.", "author": "Gladys A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Dear Hibino, you are consistent in delivery and quality, thank you for staying in the neighborhood all these years. You are my go to for sushi on any night and In fact you are! I have not been to your LIC location on Vernon Blvd., but I suspect your chef is charming the heck out of that crowd in Queens. Thanks for being consistent and aware that some of us have food allergies, your yearly accommodation speaks to your smart business acumen and operating sensibility, may other so called sushi operators, specifically on S4th in W'Burg, learn something from you. You grace us with your talent, taste and elegance in true Japanese cuisine. \nどうもありがとうございます", "author": "Gif A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "This place has been one of my favs for many years. It's the best Japanese in town. I love the simplicity of all their dishes. I ordered the seaweed salad, the tuna sashimi salad, housemade tofu (of course) and the sashimi plate. All of the sashimi was delicious. I loved the seaweed salad and the tuna sashimi salad. The tuna salad comes with mixed greens, incredible dressing and avocado. It is so good!!!!! and fresh!!!! I got the pancake ice cream sandwich dessert that everyone gets. The pancakes were a bit stale but overall, it was yummy.\n\nHibino is as stroller-nation Brooklyn as it gets. Every single table had a little baby doing all kinds of crazy things... I love babies but sometimes I couldn't hear my thoughts.", "author": "Lynn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "Went here with family on Friday night.  The service and the food were both excellent!!  We waited longer than what we were told was the norm (due to a party just sitting on their check) and were given a free app due to this.  Very classy of them to do that for us!  \n\nThe avocado roll was definately in my top two avocado roll experiences.  The roll that was the squash was to die for!!  I can't even explain how good this roll tasted, it was just THAT good.  Their wasabi sauce was killer.  It made my sinus issues clear right up!  We will definitely be back when we are back in the area!", "author": "Brandy B."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}