{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Very nice local restaurant, gets very busy and I went on a rainy day! The owner lady was very nice and came to apologies many times that our food was taking so long. The sushi was fresh and the warm food was very tasty. The best thing about this place is how it changes its menu daily. They really put effort into this place!", "author": "Tony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "This place is great. Our waiter last night was amazing. Great food, vibe, staff. Order the Obanzai and you will be so happy.", "author": "Frank S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-08", "description": "This is the best Japanese restaurant in the neighbourhood. It's quiet; services is attentive; food is expertly made, and the prices are, well, too darn reasonable.\n\nI highly recommend going at lunch and getting a bento -- they're terrific values. Do get the yellowtail collar (excellent), but avoid anything battered (meh).", "author": "Paul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "This is my favorite sushi spot! There can be a wait during rush times, but the service is always good once you get a table. A tad expensive but worth it in my mind. I love that they make their own tofu and all their tofu dishes that I've tried are delicious, (I love agedashi tofu) including the tofu pudding for dessert. Also love their Japanese tapas and of course their sushi rolls.\n\nI've heard the lunch specials are good too but haven't been for lunch. Can't wait to try lunch.", "author": "Ariana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "Went here the other night. The food was pleasant, I had the beef kakuni as an appetizer and the tonkatsu as my entree, and some tofu. The servers were nice. I went on a Tuesday night, and it wasn't too busy but we did wait 20 minutes to get a seat for two. They were out of the salmon croquettes which I really wanted to try. The food was good, the pricing was okay, but nothing spoke out to me like I have to go there again.", "author": "Allen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-04", "description": "Really lovely Kyoto style cuisine, with rotating obanzai (daily tapas -style specials). Tofu is made in-house. One of the only authentic Japanese places to eat in the 'hood.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-08", "description": "Came here for my sisters birthday , wait for around 20 minutes which was fine , we had cakes and were notify that their would be a 8 dollar charge for a cake which was fine also . The food was average small portion of sushi sashimi , the Uni was really good and I really recommend the chicken teriyaki . The reason I gave 3 stars was because usually the way I give tips is by giving 20-23% of the total before tax . The waitress came and ask if something was wrong and stated that we should give 20% of the tip with the price after tax . Anyways I might come back", "author": "Niki Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-23", "description": "The food was super fresh and good and I wanted to eat about 4 more of the little homemade tofu things, but I thought that might be weird. I'm not going to try to reinvent the wheel and tell you things that all these nice people already told you: there's a chalkboard! Chalkboards are cool! Order stuff off the chalkboard!\n\nThe only thing that sucked, and sucked immensely, was that we were there at the time of day when apparently the entire neighborhood brings their many adorable toddlers here to shriek loudly/wail mournfully for some reason during all of dinner. Maybe try to avoid that time of day unless that's your \"thing.\"", "author": "G Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Hibino is one of the best Japanese restaurants in Brooklyn. The Kyoto-style sushi is always fresh and delicious, as are all of the cooked small plates. The agedashi tofu is some of the best I've ever had. The fried oyster roll is the best thing I've ever tasted. The service is friendly and attentive. I would go every day if I could!", "author": "V P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "Nothing negative to say about the place, though we steered clear of the sushi options so I cannot comment on those portions of the menu. \n\nWhat we came for was the tofu, and Hibino has the best tofu I've had in the city so far. We tried the standard hot and cold as well as the agedashi (fried) to get the full experience, and they were all fantastic. Smooth texture, nice consistency, and a full and complex flavor of its own that's really rare. \n\nFor entrees, we had the beef kakuni and the miso salmon. The beef kakuni is rightly featured in a lot of reviews, and I agree with the hype. The slow cooked pork is appropriately soft and flavorful, and when paired with the house tofu and a full/salty broth, every bite was a complete and delicious experience. The miso salmon which was a nice example of the dish. I'm less enthusiastic in my review because it's something I've seen done in similarly positive fashion at a number of other Japanese restaurants, but it was very good and a nice option if you're in the mood for Japanese-style cooked fish. \n\nWe weren't terrifically impressed by the obanzi (spicy shrimp and a mushroom soup) - fine but nothing amazing. The tskemono was fine and is highly recommended as a counterpoint to the richness of most of the entrees. \n\nIn terms of ambiance, brightly lit room full of people clearly enjoying themselves. Our wait staff was very friendly, explained the options and provided additional details when asked. All in all a very nice experience. Probably a 6-7 on the formality scale - I saw some people a little dressed up for dates but I felt perfectly comfortable in my jeans and flannel.", "author": "Daniel E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-25", "description": "The tofu was excellent as everyone says. Really good date spot or in a group. The atmosphere was great, and prices are good. The food is solid, nothing super spectacular, but definitely deserves a try. \n\nGet the tofu cold AND hot!", "author": "James P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "We have been here twice in the past month. The food was really good, all the dishes we ordered were tasty, fresh, and good quality. It seems like a family friendly restaurant. We came here on both Friday and Sunday nights, and noticed there were parents with their toddlers. It did really bother us. \nThe only issue that we had was the service. When we came here the first time,  we ordered the sushi plate which came with one roll and assorted sushi. It was surprisingly delicious that we wanted one of the tasty sushi. So we asked our server about what specific sushi we got in our plate, since we didn't know all the name of the fish. The server told us that pinkish sushi should be Skip-jet, so we ordered it. However the sushi came out different from what we ate. So we told the server, she tried to say that is what we wanted. After we explain to her again, she changed it to bonito sushi and warned us that we can't change it again!!! I don't know what's wrong with her!! Seriously, wee didnt know whats on our first plate, so we asked her which sushi was it in our sushi plate and would like to order one more piece. Now she is telling me that we ordered the wrong thing!! Super rude!!!!She didn't really apologize at all. I think that service was only 1~2  star.\n\nOne more thing, the waiter and waitress collected the plates without asking us if we finished our food. They just sneakily reached to The table and took the plates or menu away. That's extremely rude. \n\nThe food is really good but the service still needs to be improved!!", "author": "Sharon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "I am absolutely enchanted with Hibino. I went here for dinner once with the hubs then took lunch to go a month or so later. Dinner was amazing. The sushi was just so delicious and the I was so surprised by the tofu (which we ordered on a whim because of all the outstanding reviews). This is one of our favorite spots now. \n\nHowever, the shining star in my mind is the lunch special. You cannot go wrong. I was in the mood for a nice little bento box one afternoon, and what I got far exceeded my expectations. I was absolutely blown away by the finely prepared yellowtail and the humongous portion! Even the rice had a deliciously different flavor. All for $10! This should have been three times as expensive. \n\nGo, order, eat, enjoy... you cannot go wrong with this adorable gem of a place.", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-06", "description": "my husband and I went to Hibino on a Thursday night and were seated right away which was nice - there were people there, but it wasn't packed.  we'd been meaning to try this neighborhood place for years, and finally made it.\n\nthe homemade tofu is seriously to die for.  I squealed in delight over it - easily the highlight of my meal - so creamy.  my husband got several fish dishes which he thought were pretty good, and I opted for vegetarian that night - I was pleasantly surprised to see an umeboshi type of roll and really enjoyed it.  I love that their menu changes often, and the service is fantastic - really cute smiley women.\n\nthis place is very authentic Japanese so don't come in asking for chicken terriyaki or you're going to embarrass yourself.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "My boyfriend and I discovered Hibino on the way home during the \"snowpocalypse\" last winter; I was a shining little square of warmth in a whole lot of wind and snow. We have gone back pretty much weekly since. The staff are all very friendly and the food is incredible. The sake selection rotates so there are always new parings to try. Recommend the daily specials, their tofu appetizer and the sashimi dinner.", "author": "Isabel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "I eat sushi at least once a week and this is probably the best sushi in New York I've experienced. It's a sushi hipster place! maybe a little bit more pricey than other regular sushi place but don't care because it's really really good. When I used to live in BK heights I came 3 times and i wish I lived closer so it could be my weekly sushi restaurant;", "author": "Thalie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-14", "description": "Better than Ki/ http://www.yelp.com/biz/hibino-brooklyn\nWhen we went there was an all Japanese staff. That is so important for a good Japanese restaurant. Japanese food is not just food it's a way of life that really can't be duplicated by other cultures. \n\"There are only two questions about food. Is it good? And is it authentic?\nWe are open (to) new ideas, but not if it means destroying our\nhistory. And food is history\"\n- Guiliano Bugial\nIn NYC ,all 5 boros included there seems to be an idea that authentic is better as long as it is authentic people will eat there. But even to the point where they will sacrifice quality and taste and eat in any trash hole. I beg to differ. I want Japanese food to be authentic and good not just authentic. And this is authentic and good! A rare combination in Brooklyn which is the reason for 4 stars, \n Clean restaurant,  and gracious service. It is not the level of Soto or Ushiwakamara in Manhattan  but the best in Brooklyn that  I have tried.", "author": "Pinky And The B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-26", "description": "We ordered yellow tail, cucumber avocado, ume shiso, eel avocado and shrimp tempura roll and none of them were good, seriously I had better sushi in stores like wholefoods or cheap sushi places. There was nothing special about this place. Not recommended at all", "author": "Jasmine M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-15", "description": "The sushi tasted well enough, but I couldn't get over how unattractively my fish was cut and presented - as if it had been torn by a five year old from the larger piece of fish rather than cut with a gleaming, sharper than a razor Japanese knife.   I've never seen such ragged pieces of sushi in my life.\n\nOther than that, the home made tofu is delicious, but the restaurant is on the whole too expensive.  \n\nI will try again and see if I like the sushi better on another occasion.\n\n* I see from the other reviews that people liked their non-sushi food a lot.  Perhaps that was my mistake.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-08", "description": "Yelp Score: 3 Stars\n \nHibino - that random Japanese owned Japanese restaurant nestled neatly away from the bustling streets and boisterous crowds. The restaurant is small; there is definitely a cozy feeling to it. Large windows surrounding the place allow for a lot of natural sunlight, which I personally like a lot. The décor is pretty standard, nothing that really stands out but it gets the job done.\n \nAlright, onto the food! The menu here isn't large, and that's a good thing. Many Chinese and Korean owned Japanese restaurants (for some strange reason...) tend to blow up their menus with dozens, if not hundreds of items. Hibino focuses on what they can do. \n\nService was prompt, and I ordered the Chirashi bowl (sashimi cuts over a bed of sushi rice). Took about 10 minutes for the order to come, and my first impression was \"Wow, this bowl is small...\" I'm a kind of guy who will compare and contrast the food I eat, so when I realized that the serving size was quite small, and the sashimi cuts were, instead of the traditionally layer cut I was accustomed to, cut into cubes, I was staring into a bowl with fish cubs on top of a bed of rice. It  wasn't what I was expecting, and I felt a little let down. To make matters worse, there was a piece of shrink wrap still stuck on one of the pieces of fish - not a good sign. That sort of derailed my appetite - I guess when I brought it up to the waitress, I expected a free appetizer or even a drink, but all I got was \"Oh that's there, it's to keep the fish fresh, but I'll take that piece away\" and nothing more... ok so proceed to eat, and I'm already disappointed. \n\nThe sashimi wasn't that great - sort of bland and rubbery tasting. If you've ever had sashimi that was frozen and then hastily thawed, then you know what I'm talking about. The cube of tuna wasn't fresh at all, and didn't have that \"melt in your mouth\" feature that most fresh, blue fin tuna cuts have. The rice was pretty tasty though, but you'd have to screw up REALLY badly to mess up the rice portion of a chirashi dish.\n \nI left Hibino poorer and still hungry. It was an underwhelming experience to say the least. The prices are unjustifiably high for the portions you get along with quality of the sushi/sashimi. Too bad, this place seemed like it could have been so much better, but the fish they served just didn't cut it for me. Perhaps their other non-sushi/sashimi dishes are of a much higher quality, but I tend to stick to sushi when I hit up \"authentic\" Japanese joints, only because I COULD eat the other non-sushi/sashimi dishes elsewhere like at a Chinese owned joint, whereas sushi is best left to those who grew up eating it or at least know a thing or two about it. \n\nHibino, for the most part, was lackluster and was not worth the price I paid for my food, but given the lack of high quality Japanese restaurants in Brooklyn, I'm willing to give it another go.", "author": "William W."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}