{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "Hibino , although being popular had only about a fifteen minute wait.  The sushi menu is not as extensive as other places I frequent but the sushi is fresh.  It's definitely a good experience.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "To start, we had the Obanzai dishes of miso flank steak and home made tofu with kimchi and raw tuna.\nEverything was delicious and the servings were surprisingly large for the $5 price tag.\n\n We followed this with the chirashi bowl. Wow - amazingly fresh variety of fish and vegetables with perfectly seasoned rice. It also included the best piece of sea urchin I've ever had in my life.\n\nService was fast and friendly.\n\nWill be back for sure!", "author": "Anjoli P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "Excellent flavorful Salmon Miso Zuke. The vegetables were fresh and perfectly cooked. The yellow sauce that comes with the fish has a subtle sweet taste an pairs perfectly. Kagua beer was great. For the value it was an awesome experience.", "author": "Obediah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-05", "description": "With a vibrant atmosphere with dim lighting, the combination of  small tables and an open bar created a lounge-like feel to the restaurant. The air was stuffy upon entry, but it gradually gave way to the cold air blasting from the A/C unit above our heads. The wait time was a reasonable 15-20 minutes, but patrons were still waiting for tables as it approached 10pm.  \n\nThe biggest selling point for this trek to Hibino were the obanzai dishes for $4 each (thanks to Yelpers' recommendations), The pork skewers were tender and juicy, but there wasn't too much lean meat to speak of. The tri-color yam noodles had a ramen-like consistency, which made it fun to try (as long as one don't expect any yam taste).\n\nThe sushi rolls (salmon avocado and negi toro) were fresh but a bit heavy on the rice. Also, one should be cautioned that the soy sauce very salty as we automatically assumed we would be given the low sodium version. How presumptuous! The fresh (home)made tofu was served warm in a small jar,  and it had a very smooth texture. It was suitably complemented by a sauce in a separate container.\n\nA friend ordered the chirashi, which came with a solid assortment of raw and cooked fish, including uni. However, since when did places start serving chirashi with duck? It seemed odd and the chirashi felt impure (to me personally). \n\n100 for 3 people including tax and tip seemed reasonable for all this food (including a glass of great tasting sake and bottle of Yebisu beer). Note that Hibino accepts credit cards but not accept American Express. In the end, it was good first-time experience with awesome drinks and atmosphere, but a mixed opinion on the food. Yet, I would look forward to coming back to try the other daily obanzai specials.", "author": "Nelson W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-15", "description": "This is my fav Japanese places in Brooklyn and since I was in the hood during their lunch hours, I decided to try their lunch for the first time.  It's quiet, it's inexpensive, and $10 lunch set is very simple.  I'm not a big eater, but even I felt I could have ordered a side dish.  The portion is small.  I was also disappointed they didn't have their tofu for on the lunch menu.  But I'd come back here again; food is pretty good.", "author": "Harue J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "Each time we go, don't mind the wait, the food is constantly crisp and a great deal of work goes into making every menu thing. My husband and I hang out at Henry Public as we sit tight for our table, the staff recalls that us every time when we go on Fridays. I generally get the most recent buster tempura roll and a couple pieces alongside a decent icy brew. Can hardly wait to retreat once more, ideally soon.", "author": "Tammy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "I've been eating here since 2008 and its one of my favorite restaurants. The sushi is amazing and the obanzai are really special. The homemade tofu is fresh and delicious and i crave it basically constantly. The rotating chef selection sake has always been worth trying. Also long live the danbo pictures, they are so cute!!!", "author": "Graziella M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "I couldn't live without this place. Their yellowtail scallion roll is the best I've ever had. For lunch if you can get the salmon collar you're in for a treat. I wish they were open on weekends for brunch. I want Japanese breakfast!!!!!", "author": "Sarah O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-17", "description": "I'm so glad this place is within walking distance from where I live. I grew up in Japan, so I'm pretty picky about my Japanese food. This place is Kyoto-inspired and definitely a bit of a fusion. I got the beef kakuni, and while I feel like it wasn't the most traditionally Japanese dish, it definitely invoked the same savory goodness that I remember having as a child. It's also nice to see the place actually being run by Japanese owners/waiters. They definitely pay a lot of attention to detail, and the waitstaff was super courteous. I can't wait to go back and try more dishes!", "author": "Mei Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "I thought the food here was good with a lot of options and daily specials. There was also a good sake list. I wasn't a huge fan of the space since it was a bit cavernous and I would not come here for the sushi but the savory hot foods well done.", "author": "Ian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Fresh Tofu!!!!\nEverything is so good. I am still working my way through the menu with each visit.\nLovely staff. There can be a wait on certain nights, but well worth it!", "author": "Emily B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Best sushi of my life. Life changing. I don't have anymore words. But I'll try. Fresh. Inventive. Creative. Did I say fresh? Incredibly. Just go.", "author": "Julie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "Great quality, more interesting menu than the average sushi place.", "author": "Kristin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "I love Hibino. Me and my family go out to eat here all the time so I thought I should write a review about how great the food is. \n\nPersonally, I think the sushi is some of the freshest sushi I've had in all of Brooklyn Heights. The prices are also very reasonable for how great the food is. Every single one of the special roles are incredible and the spicy tuna is the best I've ever had!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "I heart Hibino. Its my new favorite sushi restaurant in Brooklyn.  The fish is extremely fresh and as my husband said, he hasn't had toro this good since Japan.  The toro (which was a special of the day) literally melted in our mouths. I'm salivating as we speak. \n\nThe sushi rice was also the perfect temperature and extremely delicate and I think they make their soy sauce in house.  \n\nFor starters we tried the tofu and the short rib beef.  The tofu is as delectable as all of the reviewers said but the presentation was a bit awkward. I wish it was in a bowl rather than a mini jug.  I thought the short rib was dry and overcooked but my husband loved it.\n\nHowever everyone comes here for the sushi and Hibino really delivers.  We had the Salmon and Anago Hako sushi rolls along with the Spicy tuna and Yellowtail Jalapeño rolls.  EVERYTHING was very fresh and delicious.  My favorite was hands down the Salmon Hako and I can't wait to go back and try the Tuna one.\n\nOne tip - they run out of the daily Obanzai quickly.  We arrived at 9:30pm on a Friday night and every one was gone so make sure you get there early!", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-17", "description": "Had a weekly dinner outing with my daughter.\nFood was reasonable.\nAlso I am glad that Japanese people work here.\nThere is one major problem.\nI had beer and appetizers in addition to entree.\nThey brought entree while I am still eating appetizer with beer at half way.\nThey must understand how and when to serve dishes.", "author": "Charlie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-04", "description": "We had:\n1) Beef Kakuni, it was tender and bit on the sweet side\n2) Sashimi, really fresh buttery fish\n3) Aged Tofu, FANTASTIC!!!  please note that the tofu is homemade!\n\nI don't understand other people's amazement behind the Obanzai here, the curry noodle we had (special of the day, as they change the menu daily) was nothing but ordinary.  However, I do appreciate their effort at cooking with the freshest local ingredient!  :)\n\nThe restaurant was simply decorated with a semi-open kitchen.  Its got a zen feel, but yet inviting vibe to it.  I would come back and bring friends here!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-10", "description": "I have very mix feelings about this place. I ordered the Hibino Kyoto sushi plate. It came with Yuzu mayonnaise, 7 pieces of nigiri sushi and 6 pieces of the Kyoto futomaki roll. The futomaki has tuna, shrimp, and cucumbers in there. On the menu it says it has avocado but I did not taste it nor see it in my roll. The futomaki roll is delicious. I like the tuna and shrimp combination and like most of the yelpers here I never had a futomaki roll like this. The mayonnaise with yuzu taste very light and it is a nice addition to the futomaki. The seven pieces of nigari included, mackerel, salmon, tuna, assorted white fish. I thought these nigiri were rather small and the fish were very bland. The quality is not good. For the price I thought it would be the type of fish that would melt in your mouth instead it was rather chewy and rubbery.  Not what I expected at all. For a dinner entrée it left me hungry.\n\nI also ordered the anago hako which is eel box sushi. That was okay. It has a lot of rice with the eel on top. The Kyoto Hako is also box sushi with mackerel. The mackerel was shredded and tasted and looked just like canned tuna. \n\nThe wasabi has a strange texture and is much more dry than what I am use to. I thought Wasabi supposed to have a creamy texture that melts easily into the soy sauce. This wasabi would like mix into the soy sauce and I had to scoop a piece of it on top of each nigari.\n\nThe décor is rustic and I noticed that lots of families dine here and they do have a lot take out orders, service was nice and prompt. The price does not justify the quality. The sushi here is a hit or miss, Kyoto hako taste very cheap, wasabi is weird, nigiri is skimpy and rubbery but the futomaki is good.", "author": "Luna L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-13", "description": "Dirty, loud and hot. Bone in my yellowtail jalapeño roll, bug in my beer. Very small pieces of sushi and sashimi. Nothing special. \nDid I say dirty?", "author": "Ben P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "Overall good solid Japanese food.\nObanzai are very good as they change every day.  Lunch is good value as well.\nWe also get rolls for take out quite often.\nEntrees are bit on salty side in my opinion.", "author": "Wataru I."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}