{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-22", "description": "Disappointing.  Hibino was recommended by a coworker so I thought I'd try a new sushi place in the neighborhood.  Following the advice from others, I went with the salmon croquette special on the board, only to find them oversized and greasy.  I had a salmon roll with it and think it was the fattiest piece of sushi I've ever had.  It wasn't terrible for neighborhood sushi but doesn't come close to Ki sushi on Smith St.", "author": "Richard S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "THE BEST!!!! Be prepared to wait for a table Thursday- Sunday nights. Totally worth it. The best sushi in the city. Unpretentious, warm and welcoming service. The daily specials are interesting and varied, the fish is outstanding. Never had a meal here that didn't impress. It's flawless.", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-02", "description": "Hibino is a great addition to Cobble Hill, and I think everyone agrees.  Pass by on any given night and the restaurant is filled with families, couples, and other people from the neighborhood. \n\nAnyone who dines here MUST sample the homemade tofu, which is served either cold or warm (I recommend having it warm) in cute little glass jars.  It's served with a shoyu-based sauce and is simply divine - light with an incredibly fresh flavor I've never tasted before.  And it's only available at dinnertime (I looked for it when had lunch, and it doesn't make an appearance on the take-out menu).\n\nHibino specializes in obanzai, which are Kyoto-style side dishes or small plates. The $4 obanzai offerings change daily, and you can see the offerings for the day on the restaurant's blog.  It seems to serve 3 kinds at dinner, 1 at lunch, and each obanzai I've is interesting, creative and tasty. \n\nI'm in love with the beef kakuni, a braised short rib with an almost caramelized daikon radish.  I tasted it and wanted to settle in for the day (even on a warm summer afternoon, it's just THAT comforting!)  Hibino's sushi is wonderfully fresh.  If you're someone who wants a crazy, wacky roll with 10 ingredients, I think you'll be out of luck here, as Hibino's sushi and sashimi offerings include just the simple and classic.  You can, however, get interesting pressed sushi and a delicious \"sushi salad\" with an ingredient I just can't put my finger on. \n\nThere are always lunchtime specials, and prices are very reasonable at dinner.  Service is very quick and polite.  (And frankly, one time it almost bordered on smothering. I could feel one server's eyes on our table, ready to pounce on any sign of a dropped crumb, finished plate, low waterline, etc. Ok, maybe smothering is too harsh -- I'll call that server...enthusiastic!)", "author": "Caroline B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-10", "description": "Went on a Friday night at about 6:30 p.m. There was no wait, and the staff were friendly and attentive. The place is adorable and small, tastefully decorated, and peaceful. The prices were so reasonable, and everything was fresh and delicious. All the other reviews that mention the warm, fresh tofu are spot-on: it's amazing. Unlike any tofu I've ever had, and I've tried a ton of tofu. Do it! I'll be going back shortly.", "author": "Claire M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-23", "description": "This is the worst place in the world in a very dangerous part of the city. People from Manhattan should not venture here - unsafe and bad food. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDon't tell anyone else - it's the best Japanese food in America.", "author": "Anita B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-21", "description": "Although I am naturally risk averse, once in a while, I like to try a new restaurant. I had learned about Hibino thanks to Yelp. When S and I arrived, we learned first hand that finding parking in this area is a painstaking process.\n\nAs we entered, the restaurant looked cozy and sleek with the mahogany (chocolate? doodoo brown?) tables and chairs. As we sat down, there was a small chalkboard with the daily specials, with a handful of the popular items crossed out. Fortunately, Hibino participated in \"dine in brooklyn\" and offered a pre-fix. We accepted and I requested an additional order of sashimi (I heard a snicker, but I was feeling ambitious).\n\nIn the prefix, we received the fresh made warm, field green salad (consisting of mesclun, daikon, carrot, crispy potatoes with ginger dressing... it was salty), obanzai  of the day - spaghetti (are you serious?) and pumpkin salad (potato salad with orange food coloring). I gave a double-take with the obanzai because Monsieur Chef Boyardee would have laughed out loud.\n\nOur entrees were good. The Kyoto style futomaki was a sushi roll with an array of items: tuna, shrimp, eel, avocado, cucumber, tamago, and tobiko. The beef kakuni was a braised short rib in a soy broth with scallion and daikon. Furthermore, the sashimi was of standard fare with exception to the squid; that was very impressive in taste and texture (it was a novel experience since I eat the yellow tail, salmon, toro, makerel, eel, etc regularly. Out of many desserts, we selected soy milk pudding and a fish (pancake) with red bean. These were fine but far from mind blowing desserts. Regardless of the volume, we completed the entire meal without having to be assisted outside via ambulance stretcher.\n\nService was slow. The restaurant does not accept AMEX. For neighborhood  residents, congratulations. This is an adequate Japanese restaurant for a quick fix. I'm not sure I'd make the extra effort to return.\n\nIFHTP 1", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-06", "description": "So, I actually found this place on Yelp. I have been searching for Yebisu beer since returning from Japan a couple of years ago, and I cannot find it anywhere in DC. Thinking that I might find some in NY, I found Hibino.\n\nSince I had been walking around all day in Manhattan, I was in prime shape for a beer, and the years of waiting and searching paid off. The Yebisu was as great as I remembered (although not the 100 yen-like price I remembered). \n\nThe just as great news is that the food was also quite good. My boyfriend and I split the Kamo Salad, which was very similar to carapaccio, a favorite dish of mine. We also had a couple obanzai, including the lotus root, which was also good.\n\nFor sushi we had the Spicy Scallop roll (wonderful) and the Yellow Tail Jalapeno roll (lethal). I like hot, but this was seriously ridiculous. I was actually in a lot of pain after eating just one roll. I would highly recommend telling them to go light on the pepper or just taking the pepper out once it arrives at the table. I don't think I have ever felt my esophagus go numb, but so it was.\n\nDessert was soy milk pudding, which we ordered after seeing every table down the line next to us order it. This was a great decision. It was the perfect ending to a delicious meal. I also capped it off with a glass of plum sake (no ice needed), which was subtle, lovely, and not too sweet.\n\nIf Hibino is representative of Brooklyn in general, I will certainly return.", "author": "Lydia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-03", "description": "The main draw of Hibino is the Obanzai, but we did a little sampler to get an idea of how well they prepared different dishes. We started with the Agedashi Tofu, which is made with their homemade tofu. The pieces of tofu were perfectly prepared. The skin was like a brittle piece of silk and the center was smooth and tasty. The shredded daikon was fresh and plentiful. It came with two shitaki mushrooms that were as good as I've ever had. The dish was really masterfully done and a perfect way to start a meal.\n\nNext cam the seafood harumaki from the Obanzai menu. The outer layer was lightly fried, airy, and delicious. The shrimp and mushroom filling was also solid.\n\nAt this point we made the switch to sashimi to see how the chef could handle raw fish. We kept it very simple: salmon, tuna (maguro as they had neither otoro nor chutoro), mackerel, and squid. I was damn shocked at how good the fish was. The slices could have been more delicate, but it was impressive considering that Hibino is not a straight sushi place. I would be comfortable going _just_ for the raw fish.\n\nThe atmosphere strikes a good balance between sophistication and comfort. The staff is dynamite. Our waitress was attentive, helpful, and very funny.\n\nThey now have sake and beer. We had a couple glasses of Sake from Fukui, way out on the west coast of Japan. It was really nice to see such a local brew.\n\nPricing was fair. We paid $67 and change, which I thought was a damn solid deal.\n\nWe were pretty amped when we left. There is no reason not to check this place if you live in the area. Please go.", "author": "aitsu i."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "I'm really lucky to live around the corner from this little sushi gem! It's  really popular when the weather is nice, with over an hour wait on a Friday/Saturday at prime time. The sushi is very fresh, they have some really interesting rolls and my fiancé is obsessed with their hot tea. I give it a four because it's a really really good meal, but not a destination spot.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-31", "description": "My new favorite restaurant in Brooklyn. Been here 3x in as many weeks! (I'm a late-comer...)\n\nI have tried many many different dishes and the only not-perfect thing was the seaweed salad -- I found it a tad salty, though the seaweed itself was great.\n\nDaily Kyoto home-style specials -- a mere $4 each -- are listed on their blog: \nhttp://hibinobrooklyn.blogspot.com/\n\nThey are unexpected and fabulous.\n\nThe sushi is way above average. Saki selection is affordable and well-chosen. Atmosphere is great -- nice music, nice lighting, etc. Service tip top.\n\nThe place oozes integrity, pleasure, and goodness -- thank you for opening, Hibino!", "author": "amy s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "This review is long overdue as we go here often and it is my favorite sushi joint in our neighborhood.  Fresh and simple.  Great service and wait-staff.  Good sake.  Fun and unique tapas-like daily specials.  \n\nI rarely order spider rolls as I have found they are hard to nail, but I went for it when they had it listed as a special here and was quite pleased.  My staple is the vegetable futomaki roll - it is jam-packed with great veggie choices (although one time okra was used and I had to take it out...not a fan of slime in my mouth).\n\nThe non-sushi options are creative and plentiful as well for kids or those who can't seem to find a place in their heart for sushi.", "author": "Brooke S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-28", "description": "I don't think this is the best and freshest sushi in NYC. But its Obanzai absolutely rock, the sushi is really quite good, and a number of the rolls and entrees are stellar (as is the duck salad). I'm not a huge fan of the move to crispy rolls and sweet sauces/mayonnaise-type stuff and a number of their offerings float too far that way, otherwise they'd be five stars in my book. Kyoto, pressed square sushi can be awesome, but again beware overly sweet/fatty sauce tendencies. Meat-based appetizers and tofu rock uniformly. Nice small selection of sake. Great service and attractive place. Hibino is awesome. Get there relatively early so the obanzai don't run out!", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-06", "description": "Went to Hibino last Friday night and sat at the counter. Always fun to watch the chefs at work! Started with a refreshing, cold glass of sake (can't remember which, but there were I think only 2 by the glass). Nice way to unwind at the end of a long week!\n\nI love fresh, homemade tofu, and Hibino serves theirs in a tiny little jar with a tasty sauce (bonito, soy, probably seaweed, and perhaps a bit of sake and sugar, I think) which you pour over the soft tofu. Since obanzai is their thing, I had the Simmered Squid \u0026 Satoimo (Japanese Taro), which I enjoyed - the satoimo had absorbed a lot of the flavor from the simmering liquid and the squid. Also had the Zucchini and Sastumaimo (Japanese Sweet Potato) Tempura, which was served in a bowl of dipping sauce. My only complaint here was that the lovely tempura became soggy if you didn't eat it within the first couple minutes - might have been better to serve the tempura and sauce separately. \n\nLastly, I ordered the Shrimp Toji Maki, which was delicious, served with a spicy mayo. \n\nThey finish your meal with a complimentary cup of hot tea. I had good service and really enjoyed the food, particularly the authentic Japanese feel of the obanzai, and I can't wait to go back to try some of the other food, especially the sushi everyone is raving about.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-25", "description": "Loved the small plates, the prices, the sushi, the Tofu. It reminded me of a place in LA called Musha that I love. Really great restaurant. Long waits often.", "author": "Sir M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "AMAZING Japanese food.  Definitely as good as it gets in this neighborhood.  The fish is SO fresh.  And the obanzai (they describe as Japanese tapas) add another level to their restaurant that a lot of Japanese places don't have.  \n\nI would absolutely recommend their seaweed salad (it's not the seaweed salad you're thinking of) and the marinated beef just falls of the bones....YUM!", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-04", "description": "This is probably the most authentic Japanese restaurant in Brooklyn. The service is excellent, the sushi is real-deal, and they have so many other things worth trying. I wish I came here more often. This is not your Chinese-run sushi restaurant. This is real deal Japanese cuisine.", "author": "Jen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-29", "description": "Very cute, very affordable Cobble Hill spot. Open and airy, chic decor with small plates at $4 each! The housemade tofu is incredible but it arrives looking like milk. You're supposed to mix it with some ginger.\n\nThey're doing 4 course $23 pre-fix through April 2 for Brooklyn Restaurant Week and $7 sake specials where you get a unique glass and probably a buzz on. Great servers and nice people make it worth a trip for stellar Japanese food.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-07", "description": "We were surprised by the 40 minute wait for neighborhood sushi in Brooklyn but it was completely worth it.  The staff was nice enough to take our number and call us when a table was ready while we escaped the cold at the British style Public bar nearby (had delicious Two Cent Fancy champagne cocktails with fresh pear and honey!). \n\nWe sat at the sushi bar--which I love because we can ask the chefs for recommendations on the freshest options--and enjoyed chef's choice sake and Sapporo, two delicious tofu plates, braised short ribs and some fabulous sushi!  I wasn't the biggest fan of their \"box pressed\" sushi rolls, but they weren't bad.  Their sushi and signature rolls were fantastic though.  Next time we go, my husband and I agreed, we will forego all the tofu and focus on the sushi.  I can't believe how yummy the sea urchin was--it melted in my mouth!", "author": "Jane V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-10", "description": "Had a really good time. Great simple atmosphere on the edge of a corner, near Atlantic but seemingly far far away (it sits opposite a hospital, which has the feeling of a college building, brick and vines).  The other obanzai we had -- agedashi tofu with mushrooms, in a mushroomy broth -- was delish.  I loved the pressed salmon sushi, with shiso leaf tucked inside.  Absolutely wonderful.  The seaweed salad was good, the fresh tofu was quite good, yellowtail with scallion roll quite good -- the soy milk pudding for dessert was out of this world.  Throw in some sake and it was a wonderfully convivial place.\n\n My GF not quite as impressed as I, and if one rated this a la Michelin one could find flaws (1) the panko breaded shrimp obanzai was not good, 2) service was not very good, friendly but they were very distracted and forgot some things, brought cold tofu app instead of warm, I had to go up and get menus after trying for five minutes to get one to order something additional, 3) it was noisy, albeit in a friendly way, 4) my GF's short ribs were too fatty, she says, 5) it's a small place, so you get some cooking smell in your clothing, 6) the cooked mackerel sushi was overcooked in my opinion)\n\nSo, it wasn't perfect by any means, but the highs were better than any Japanese I've had in a long time.  Recommend.", "author": "W A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-05", "description": "Ah, it was ai'ight...  2.5 Stars.\n\nMaybe if they hadn't run out of everything on their 'Specials Menu' (and a couple things from their regular menu) I would be able to give them a higher rating.\n\nTheir Beef Kakuni was tough, so we told the waitress because it was like chewing, chewing, chewing on jerky. Not that we asked for a replacement, but she nicely brought out a second attempt at the same dish...and I hate to say it - but it too was aTMJ nightmare.\n\nLast thing - I know there is beginning to be a derth in the supply of wine corks in the world so manufacturers have to resort to synthetic...but it just makes me feel duped when I'm paying $40+ for a bottle of wine and the waitress presents it tableside unscrewing the cap like a 40 oz.", "author": "Van Ness D."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}