{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "The cooked food is the jam here!  The chicken teriyaki is by far the best I've had and comes with fresh, beautiful, seasonal vegetables.  The fish is delicious too, although the rice is a little tough.  And of course the place had a perfect aesthetic, proper Brooklyn charm.", "author": "Gabriella K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-30", "description": "I came here bc of the overall reviews.. However I was disappointed... The tuna salad was drenched- even each tuna had a glob of dressing.  The edamame was WAY over salted. Staff was - ok not very helpful when asking for suggestions but really didn't have anything to suggest (not very many special) .  The decor and layout was cozy and pleasant.\n\nIf your looking for a full selection with sushi and a variety of rolls go elsewhere.", "author": "Sovi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "Chilled restaurant with solid sushi selection. Fish is amazingly fresh and delicious. Spicy tuna highly recommended. Tofu offerings are tasty as well. Great service and yummy food= one of the best in the neighborhood. Highly recommended.", "author": "Burcu B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-13", "description": "Disappointing.  Was attracted to the atmosphere and neighborhood, but was not impressed with my food, maybe I should have ordered a little more adventurously.  I just had the spicy tuna which was so-so, the only flavor came from the spice and the yellowtail with jalepeno and again, the yellowtail was bland and kind of chewy.  My friend ordered pieces and she enjoyed it more.\n\nI will try it again and live a little more dangerously and try one of their more imaginative rolls.  But I'll probably keep going back to Ki for sushi in Cobble Hill.", "author": "Meredith K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "Really liked it here. Awesome that it was a block away from my friends apt. Five of us went on a chilly night, I enjoyed the chill, low key vibe\n\nObanzai options are a must. $4 each we got all three. Caramelized potatoes were crunchy and tasty, and the beef stuffed mushroom caps and pork and cabbage obanzais were also awesome. \n\nI had a yellowtail hamachi salad and also the appetizer portion of a braised short rib, which was still bountiful and I definitely left stuffed. Also had the chance to try an awesome fried oyster roll and an interesting seaweed salad. Haven't eaten much in Brooklyn but I'd love to have a place like this a block away", "author": "Charles B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Hibino resides in a quiet part of Cobble Hill, Brooklyn and specializes in authentic Japanese Homespun food including housemade tofu, Obanzai (home style tapas) a variety of sushi, and a great saki selection both hot and cold. In Japanese Hibino means \"daily\", which is the reason why the menu changes from day to day. I found the restaurants atmosphere to be very friendly, spacious, simplistic and warm. Will return no doubt.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-14", "description": "I would have given Hibino only a single star, but the delicious homemade tofu (a tiny jar for $5) deserved a star of its own.  The roasted vegetable obanzai, which included lotus root and kabocha, was drenched in a goopy sweet sauce;  with some soy sauce and grated ginger on the side it might have been quite good.\n     I had the Kyoto box sushi with Spanish mackerel as my main dish.  As another reviewer remarked, it might as well have been the lowest grade of canned tuna .  It also was slathered in another goopy sauce, this one dark and overly salty.  In addition, concentrated soy sauce, of the type usually served with nigiri sushi, was presented on the side.  Generally, box sushi is already flavored and needs only a little dab of a much lighter soy sauce.  I have never eaten box sushi in Kyoto or anywhere else in Japan that had any kind of sauce poured over the sushi.  Just disgusting. \n     There was also a pair of screaming twins (terrible 2s?) a couple of tables away, and in general a lot of children--not particularly something you expect to see in a place with an interesting saké menu (I don't drink, so didn't sample it).  This is the second time I've been there and strongly put off by one of the dishes I ordered, so I don't expect to go back, despite my longing for real Japanese food.\n\nPlease don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees.", "author": "amanda S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-30", "description": "No idea what people are raving about. Place is cute and all but nothing food wise was memorable. Staff was friendly and utensils were clean. Looking a little shabby though. Can't believe I went out my way to come here. Left hungry since things weren't hearty enough to keep me full. Bill came up to be $90. Egad, that's just crazy. I could've eaten like a king at another Japanese restaurant. Never returning.", "author": "KL Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-14", "description": "What can I say that hasn't already been said about this delicious little slice of heaven in Cobble Hill?\n\nThe housemade tofu is simply divine and it's always fun to try their special small plates.  The Kyoto-style pressed sushi is what sets Hibino apart from other sushi joints in the neighborhood.  Staff is nice, and food is always good.\n\nExpect to wait up to 20-30 minutes during the weekend dinner rush, but it's worth it.  (Better yet, go on a weeknight, post 7, when the families have gone home!)", "author": "Emily M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-22", "description": "After I went to Hibino for the first time, I had vivid dreams about it all night. Maybe I didn't, but if I did I would have seen the following running through my mind:\n\n1. Chalkboards everywhere, all with the daily specials. There would be nobody with chalk or fingernails because that would ruin the fantasy. I think they just have one chalkboard in real-life, but these handwritten slates show the special three obanzais for the day, a special soup and special rolls and sushi. This changes every day and you can even check their website each day to see what is new.\n\n2. Shrimp Toji maki (shrimp wrapped in tofu skin) falling from the sky. This is a great way to start a meal. There are four large pieces and a dipping sauce. The shrimp is excellent and the texture of the tofu skin is the perfect jacket. It would be hard for me not to get this every time I go here.\n\n3. The word Obanzai in white Helvetica on a black screen.*\n\n4. A life-size Kyoto Style Futomaki which differs from the normal futomaki by adding tuna and shrimp and a dipping side of Yuzu mayo. The flavor was great in this roll, it was constructed well and it was very fresh. I got this roll as part of the Hibino Sushi Plate which also had 7 pieces of sushi.\n\n5. Anago Hako Sushi (Oshi sushi, pressed Kyoto style, with anago, egg, shiso and kanpyo) stacked one after another in a row of 100. I'm not sure if I could get through 100 pieces, but it seemed like I could the other night. This combination is perfectly done at Hibino.\n\nThis location is nice and quiet although the restaurant is not necessarily quiet. On a Saturday night at 730 there was  table for two right away, but by 8 there were about six people waiting outside. The service was prompt and courteous. The prices are very good for what you get.\n\nIn terms of the sushi, it is very fresh and tastes great. The sushi pieces are fairly small, but they are not overwhelmed with rice which makes it better, the rice is sized to the sushi. The ambience is nice even though, as with so many restaurants, the two-tops are jammed pretty close together. You are basically on a date with your date and the two tables next to you. Fortunately this means you can look at their food and silently judge their choices as well as their conversation.\n_____________________\n\n* If you keep saying the word, it just gets better and better or possibly I just have a word fetish.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "Nice stylish.,attractive decor.  Excellent service,   great seafood.", "author": "evelyn w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-21", "description": "A Japanese tapas restaurant! After something like 5 years of living in the neighborhood, I finally made it to Hibino. Hibino is one of those places you've had bookmarked forever and make a mental note to try every time you pass by it but somehow it never comes to mind when you're trying to make a dinner plan and want to try something new. Well for once I remembered it's there and the hubby and I made our way over for an early dinner around 7pm thinking the place would be half empty. We thought wrong because there was a 45 minute wait for a table for 2. The wait was well worth it as the food turned out to be unique and delicious. We've been to Japan and have tried a variety of Japanese foods but are still far from being able to call ourselves afficianados in the cuisine. In fact I had no idea what the proper way to eat tofu is, but who cares, the point here is to come with an open mind and an open wallet and try everything in sight.  Especially the amazing sakes and daily specials. Everyone talks about the tofu, it was fresh and interesting but tofu is tofu to me. The really outstanding dish for me was the trigger fish sushi. Mmmm. Even the regular Japanese food staples that you're used to like miso soup taste different here. I'll definitely return the next time I'm in the mood for something different.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "I come to Hibino about once a week and I don't even live in this neighborhood. It's a small Japanese restaurant that's charming without being too twee and the food sits in the Venn diagram sweet spot of: homey, authentic, a little aspirational and delicious.\n\nHibino specializes in Kyoto-style small plates called obanzai ($5 each). They change daily but the options usually include one vegetable dish like miso eggplant, one broiled or grilled fish like salmon collar, and one fried tempura thing. They announce the particulars on Twitter but I just let myself be surprised. My dining partner and I usually order all three obanzai to share then move on to sushi.\n\nFrom the regular menu, my favorite things to eat are:\n- agedashi tofu -- Their version uses fresh tofu made in house, lightly fried. it sits in a sweet-savory dashi broth with shiitake mushrooms and shishito peppers.\n- sushi plate which includes one futomaki served with Kewpie mayo\n- salmon hako sushi -- thin sheets of salmon layered with rice and shiso leaves then pressed into a box and cut into squares\n\nThey offer a varied list of sake by the glass, Sapporo on draft as well as other bottled beers.\n\nService is casual but competent. \n\nI like that Hibino has a casual neighborhood restaurant vibe but the food is a notch above that--which is why I hop on the train to dine here.", "author": "F. A. Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-24", "description": "This is my favorite Japanese place in my neighborhood. I love their banzai (daily special menu). We had the special marinated beef from banzai. It was tasty and a great deal.\n\nTheir sushi is decent and fresh. But I am more excited about their daily specials!\n\nOnly one opportunity: this place has small space..so on the weekend, if you want to try during the dinner time (7-8pm peak), you may need to wait for an hour! plus no delivery - you need to pick up..", "author": "Grace C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-22", "description": "It's good Krazy Eyez.... I like it...I just have 1 little comment.  I'd drop the muthafucka' at the end because you already have 1 fuck...you don't need 2 fucks and replace it with \"bitch\" because bitch is something you'd say to someone whom you don't like...whom you disrespect.  \n\nYa just 1 comment:  It's hard for me to go out and eat good Japanese food and not be somewhat disappointed by the fact I spent $30 a person and did not fill up.\n\nLikely, my second visit here will come soon and it won't be on a devastated stomach.  But for now, I'm left thinking I just ordered an array of sashimi over rice that was delicious and widely varied and a couple Obanzi and it just wasn't that much food at all.\n\nI guess I'm a bro\n\nI guess I'm a big dude\n\nI guess I'm a selfish American\n\nA gluttonous American\n\nA fast eater\n\nA shoveler\n\nAnd in the words of my Danish friend Jonas: \"a fatty...\"\n\nBut maybe I'm not (only 163 lbs @ 6'-1\") because maybe I just want value for my $.  \n\nAh but value sir...is it measure qualitatively or quantitatively?  My answer is BOTH.  And Hibino qualitatively hit the 4 star mark!  But quantitatively hit the 2 star mark.\n\nOr maybe I was just TOOOOOOO hungry.\n\nI shall Taunt Hibino a Second Time!  You're mother was a hamster and your father smelt of elderberries.\n\nWe'll see...\n\nStill searching for Japanese STUFF MY BELLY FOR CHEAP IN NY!  (Outside of Ramen this is tough the world wide!)", "author": "Gino M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "Still going strong.  If you go, you MUST have the Tofu Agedashi--utterly sublime velvety gently fried tofu in the tastiest mushroom broth imaginable (and I don't usually like mushrooms).  Everything is first rate.  For dessert they have these very cute homemade puddings served in small milk bottles.  This is not a gringo sushi joint; it's the real thing, yo.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-04", "description": "Love everything... Braised shortribs is amazing... All the Kyoto dishes are amazing... Fresh warm tofu and tofu pudding melts in your mouth... love the salmon hako sushi.Ok I hate this place so don't eat there so I can have a seat available at all times....", "author": "apple m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "Best Japanese in the area. Always order all three obanzai; they're consistently delicious and an amazing value for the money. Then use the rest of your stomach space for their standout sushi and sashimi.", "author": "Jeffrey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Don't order your usual here unless you're a Hibino regular. Do order anything from their obanzai menu. That's their daily specials. Those dishes are amazing.", "author": "Maddy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-06", "description": "Holy-homemade tofu you will make believers out of the most serious meat-eaters.  Also awesome was the miso-salmon.  \n\nNot your average sushi spot but rather Japanese tapas(there is sushi too) and other small plates. \n\nCome on a weeknight- Fri and Sat this place is packed.", "author": "Becca F."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}