{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "I love it here and I think it's probably by far my favorite Japanese joint in the area. The food here is so fresh and the service is great. I think what gets me the most is the fact that they are authentic.  They are real Japanese people cooking and making our food which is important for me. I love their specials. Go early to avoid missing out!", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Hibino is one of the best sushi places in all of NYC. The quality to price ratio is unbeatable. The staff is super friendly, attentive and all around great. The environment is warm and nice. \n\nGo late if you want to avoid a festival of babies and children. If you have kids, go early and join the baby party.", "author": "David H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Great food and great service!\nI sat by the bar. From there, one can see the staff cooking, the kitchen is nice, so it's a nice view. I ordered tea and edamame. Then I had the special of the day: Lobster roll...Delicioso! The portions were great. And the staff was super friendly and attentive. \nThe general sitting area looks ok, nothing spectacular or fancy. \nI'm going to do this my neighborhood spot.", "author": "Rocio A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Best Japanese restaurant in Brooklyn! The miso salmon is my favorite but the rest of the menu is also very good. High quality for a great price!", "author": "Ester L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "I came on a Sunday night at 8PM with a friend. They ran out of any obanzi (a kind of tapas dish) so I ordered the beef kakuni which was a pretty tender and delicious alternative.\n\nI ordered one of the sushi plates and though it was tasty, it really wasn't anything exceptional. \n\nWhat I really liked was their dessert. The green tea ice cream sandwich with strawberries and red bean was amazing and it's worth visiting this place just for this dish.", "author": "Tracy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "I hereby dub thee...the best Japanese food in the greater NYC metropolitan area. \n\nSadly I lack these powers of 'knight'-ing, canonization or even some sort of well-known listing of top restaurants. I rate myself several levels above anything Zagat's ever done but then I've not been asked my opinion there - sad really. \n\nBut I digress - I have been wanting to check this place out for a while because any place that makes its own tofu is probably headed in the right direction. But lo and behold, the best fish I've had in NYC. Well, Japanese style (Bernardin scored well too - but seriously different price point) at least. The sushi was off the charts, the sashimi, nigiri and, well, everything. \n\nWe're talking 5 stars here, right? \n\nI just don't go sending out that level of rating any time, any where. \n\nDon't be foolish like I was and wait forever to check this place out, get moving chop-chop.", "author": "Sean K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "This is one of the very few low-key, right-priced places for good sushi and amazing Japanese small plates in New York.\n\nMy girlfriend and I have been three or four times and, each time, the special obanzai dishes have been wonderful. We've mostly had the grilled and fried fish ones but all have been done perfectly and were quite substantial for being only $5. We also had the tofu and it was great.\n\nAs to the fish, we've had particularly good experiences with the nightly specials. But everything has been fresh and good.\n\nAdd in a friendly and responsive staff and you have our go-to neighborhood sushi place.", "author": "S E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "I had a strange experience at Hibino. I really wanted to like it given the rave reviews, but I just didn't enjoy the taste of the dishes. I feel I probably ordered the wrong things. But the service was wonderful! \n\nWe ordered the beef kakuni, which was actually quite good, but the obanzai dishes just missed the mark. We had one seaweed-based dish that was far too slimy and salty. \n\nI'm going to give this place another shot and perhaps order some sushi and different obanzai.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-11", "description": "The service was excellent and restaurant had a line even on a Tuesday at 6pm.  The food was however average, not bad but nothing to rave about. Tried the eggplant special, which was tasty. I got the Hibino sushi plate. The seafood was fresh, but the futomaki had very little seafood and was mostly rice. Also the rice under the sushi did not stick together well. I have been to a number of sushi restaurants and this was down the list for quality. Again, not bad for a neighborhood place, but would not go out of my way to come here. However, I have to admit it is better than other places in the immediate area.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "I came here for the first time recently. My date and I shared a bunch of vegetarian options including the house salad, the special squash appetizer, and veggie roles. The house made tofu is to die for!", "author": "Maille C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-03", "description": "Went out for drinks with my sweetie then to Hibino - we told our server about my garlic allergy. Japanese is always a go to for me as they rarely use garlic. We confidently order sushi, some tofu and a duck salad. After consuming the salad \u0026 tofu, a woman (not our waitress) comes over to say I'm so sorry the chef did not read the ticket \u0026 the duck is marinated in garlic. I'm looking at her, thinking, are you f'ing kidding me?!? For the rest of the meal the staff was staring at me waiting to see what my reax would be. They should have compensated our entire meal and only took off the duck salad when I insisted. I spent the rest of the night sick, with a swollen stomach in pain which ruined date night. When the bill came she clearly wrote garlic allergy in red pen. I really wish people would wake up and listen when you tell them - I am allergic and can not eat garlic! Arghhhh so mad. Such a disappointing meal the sushi and agadeshi tofu were qui", "author": "SK H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Great Japanese restaurant, offering authentic everyday Japanese food.\n\nI frequented this restaurant over 30 times and not one occasion was I disappointed.\n\nEverything in this restaurant is top-notch but don't forget ordering daily Obanzai offering at 5 dollar each dish.\n\nLove Hibino so much and it is a true gem in BoCoCa and NYC.", "author": "Erin Eunjung L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "Met friends here per their recommendation, and it was my first experience with sushi at a Japanese restaurant. We had a variety of dishes: seaweed and cucumber, salmon and potato, sushi with crabmeat and salmon, handmade tofu...that was so silky smooth! And beer and tea. All delicious.", "author": "Mary B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Amazing food\nNice fusion and traditional Japanese selections\nRate to find of this quality and price", "author": "Jonathan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Love pressed sushi ( Shiso leaf and warm rice ) also love Japanese pancake ice cream and freshly made Tofu.  You should get there early for dinner since the place gets packed real quickly ( always wait 20-30mins)", "author": "So S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "A casual neighborhood spot.  That's what I think of when I think of Hibino.  Its brightly lit and often times not too busy- you could just walk in and still get a table on most nights.\n\nWhen this place first opened I was so excited about it, but when I walked in, I realized that this wasn't your typical japanese spot.  They don't really have a sushi menu, but they do have these larger block sushis.  They're not bad, but if you have a true sushi craving, this place might not hit the spot.\n\nThe service is nice, but the restaurant isn't very big- there are a few booths and bar seats, but most of the seats in the restaurant are at a communal table.  It's not really an intimate dining experience.\n\nIf you do come though, my favorite thing is their homemade tofu.  It's so delicious and smooth.  I could eat a dozen of those on my own.  Try out their specials of the day as well.  They change on a daily basis.", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Simply amazing spot for a Japanese obanzai experience in Cobble Hill. I came in for lunch and had the Obento Box which consisted of grilled marinated mackerel and an assortment of sides. The broth for the miso soup was very flavorful without being heavy. The mackerel was delicious, albeit a little bit bony, and the pickles and salads complimented it well. The traditional decor and atmosphere and excellent service rounded off the perfectly portioned and low priced meal that only results from good execution of deeply rooted Japanese culinary philosophy.", "author": "Eric H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "I went to Hibino for Valentine's Day dinner with the boyfriend and it was pretty good. The housemade tofu everyone raves about here is okay. I've had better at places like Zenkichi. The tofu here is a bit grainer and less smooth than what I'm used to. \nThe sushi was a-okay. There wasn't anything particularly special about it. The salmon did melt in my mouth - very buttery. \n\nThe highlight of the night was the Ume-Shu Plum Wine that is only sold to restaurants. It was so sweet and delicious! I also really enjoyed the special roll of the day - a Negi Toro roll. The toro melted in my mouth - I barely had to chew! \n\nDessert was also quite good. We opted for the soy milk pudding and the green tea ice cream sandwich. Both were a nice finish to our meal. \n\nOverall I enjoyed my meal at Hibino but it's quite a trek for me. I don't know if I'll be back anytime soon but the wine here will definitely make me think about Hibino every once in a while. \n\n\nPs. They don't take Amex. So make sure you bring cash or a Visa/Mastercard.", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-13", "description": "Rather disappointing. Sushi wasn't bad, but nothing special.\nMy daughter ordered pork, breaded pork - really bad", "author": "Tania S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-23", "description": "My friend recommended this place for many times.  So, I went there for a quick dinner. I saw a lot of take out orders.  I like the cold tofu and majority of the meal are in good portion. So, you would have the stomach for the Ice-cream pancake.  A lot of local and great family type of restaurant.  Parking is difficult, but doable if you there before 5:3o pm. \n\nIf you are in the area after work meeting or just want to give it a try.  This is one of spot.", "author": "Ken C."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}