{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "Hibinio is top notch Japanese. \nNot just sushi and the usual suspects, but REAL Japanese fare.\nTheir obanzi's are adorable seasonal and outstanding. They strive to include local ingredients in their Kyoto style menu as well.\nWho could ask for more? On an adorable street on the border of Brooklyn Heights and Cobble Hill? C'mon! \nThe wait staff is the perfect blend of attentive and easy going. My friend and I sat at our table for almost 2 hours eating, having some delicious sake, and enjoying the atmosphere.\nWhen we got the check and left, it was smiles and thank-yous all around from both parties.\nThis is Brooklyn casual dining at it's best. GO NOW, and get the fresh homemade tofu. You won't be disappointed, I promise!", "author": "Jill M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-23", "description": "Outstanding.\nHave tried most of the menu and yet to be disappointed.\nService is stellar.\nMy only complaint is that the menu hasn't changed much or maybe i've just been going too often!", "author": "N T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-23", "description": "So I read all the reviews and my wife and I decided to go here for my birthday dinner. First impressions of the space itself was that it's clean and a little sparse. No art work on the walls and pretty basic lighting. Everything seemed very clean and I liked that. The tables are a little too close together for my liking and I wasn't so keen on hearing the conversation going on next to me. The ambient music was too low and if it was a little higher, it might have been the solution to my unintended eavesdropping of our neighbors.\n\nSo, here are the things that were not so great. \n\nFirst, they have no white tuna. A sushi place without white tuna is like a cafe without espresso, IMO. And it wasn't that it's not in season or they ran out; they just don't have it. This is a big point against this place for me. \n\nIn general, their sushi menu was surprisingly basic, without a lot of exotic sushi or crazy rolls. Now this is not necessarily a bad thing, but I think it's important to know. Don't expect a new sushi experience here.\n\nSecond bad thing is that they have no low sodium soy sauce. This is inexcusable IMO. Also, they don't put any soy sauce pots/dispensers on the table. Huh? The waitress brought over an already filled soy sauce dish to the table when our food arrived, but  it was not filled enough to my liking. I asked her if she could bring over a pot of soy sauce to the table and she said that they did not have enough to put on every table. if I wanted more I needed to call her over. Huh? I go through soy sauce like it was water. Now, every time I needed more, I had to call her over and ask for more. This makes no sense to me. \n\nThird issue is fruit flies. Lots of them. They must be breeding inside the restaurant somewhere because it's November and freezing outside. These flies would not leave us alone. Kind of puts a little damper on things when you are trying to swat flies while eating. Now I know this is something that is hard to deal with for these places, but still. C'mon now.\n\nWhat was good about this place was the food. The sushi tonight was quite fresh and wonderful. The pieces were just the right size (although I do like them big, this was okay with me) and did not leave me too filled up after I finished. The plates were quite attractive and the sushi chefs made a nice display of the food. Not too crazy, but nice. One strange thing was a steak tartar dish that we ordered was cooked. Not what we expected for steak tartar, but it was very tasty.\n\nSince I don't live in the same neighborhood as this place, I probably would not make a special trip to it again. It's probably a great neighborhood place to have, and if it were in my neighborhood, I'd probably order more take away from them then actually go there just because the food tasted so good but I was not crazy about the dining experience.\n\nAnyway, I hope this review is helpful. If I could give this place two ratings, i'd give it a 4 or 5 for food, but a 2 for the place itself. I averaged it out to a 3-star rating.", "author": "Antonio R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-16", "description": "My brother brought me to Hibino a couple weeks ago telling me that I would thoroughly enjoy it.  Located in Cobble Hill, it's off the beaten path of Manhattan japanese joints.  The place is a bit more Izakaya like, with a good selection of sake and beer.  Yebisu is available here, of which I had more than a couple.  This was the first place I've had Born sake, which was quite a good Daiginjo.  \n\nhttp://www.urbansake.com/sake/born-muroka-nama-genshu.html\n\nWe had Sashimi and Nigiri moriawase as well as a beef stew and fried beef cuts.  Agedashi tofu and a boiled spinach dish were also good.  We also got a chirashi sushi which was artfully made and fresh.  Rice was well prepared and delicately seasoned.  We also had hakozushi or oshisushi, which isn't always that easy to find.  We had two orders.\n\nPrice point is a bit on the high side, but it's in line with Japanese restaurants run by Japanese.\n\nI really enjoyed looking at their symbol, which is basically a wordplay.  Hi - \"Sun\", bi - \"compare/compete\" and then surrounded by the hiragana \"no\".  Very cute.\n\nI liked the musical selection as well as decor, both spare and tasteful.  Service was also friendly and prompt.\n\nGreat experience...\n\nI've had two dinners here with my brother now.  And it will definitely be a venue the two of us will remember for all time.", "author": "Ferdinand H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-03", "description": "Cozy neighborhood place--my friend tells me it's one of the few Japanese owned-Japanese places in Brooklyn.\n\nThe decor is elegantly simple and comforting, and service was efficient and warm. And the food--is of course, amazing. There's a daily menu of various small dishes, which often feature their homemade tofu. The day I was there, I sampled the edamame tofu (firm with a coarse texture, $4) and a piece of horse mackerel sushi (very fresh, $3.50).\n\nOur table also had the agedashi tofu (small for $6, but loved the sauce), fried shrimp rolls (disappointing--a bit dry and bland, $9), sashimi plate and sushi plate (both $18--I'd recommend the latter, as it seemed to come with as much fish; the sashimi pieces were very small).\n\nTip: Check out their website--there's an animation of their adorable logo that makes me smile every time I see it.", "author": "Serena C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-19", "description": "Hibino is one of our favorite go-to restaurants in the neighborhood. I hope it never , ever goes away. The daily selection of obanzai is wonderful. Their homemade tofu sublime. Their teishoku (set menus), though a little expensive, very filling and lovingly prepared. This is not your classical sushi spot, so we rarely get sushi, but if there is fatty tuna as a special, I go for it. Also, their chirashi is fantastic (sea urchin!). The staff is so nice and they know what they're doing. Be prepared for a wait on weekends.", "author": "Branfa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-23", "description": "Hands down best sushi I've had in NY. (I did have one disappointing takeout experience here, but let's be honest, sushi is not meant for takeout anyhow. )\n\nWe ordered a couple of the daily obanzai, which were tasty, but not the most delicious part of our meal. I sampled the Agedashi Tofu, which my sister ordered, and it was one of the tastier things I have ever consumed. I think I could live off of that broth alone for the rest of my life, and the mushrooms in it were super savory. Definitely a MUST-order  item on the menu here.\n I ordered a  few rolls, along with the hibino sushi plate to split with my boyfriend for our entree- all delicious and tasted very fresh. \n\nI do wish the desert menu had a few more interesting options (we had a pear compote, which was good but somewhat ordinary), though I was so stuffed after the meal that I barely had any room left for sweets, so perhaps that was for the best.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "Food: Tasty and filling for the Obento box (well priced for lunch too, 9bucks i believe). Miso soup was not salty. Potato croquette was well fried. Crunchy shell, soft steamy interior. Homemade tofu was tender and a nice change of pace from the usual. My girlfriend vouches for her sushi/sashimi. From the looks it did look fresh with nice thick cuts. Food is served slowly, so come with plenty of spare time and enjoy. \n\nDrinks: Did not order nor pay attention to listings. I had work!\n\nService/Ambiance: Friendly service with a smile. Large windows with sunshine during my lunch break. Don't know about dinner. \n\nCrowd: White-collar workers during the lunch time. Hence the setup of many small individual tables for individual people busy on their Blackberry, laptop, or reading the papers.", "author": "Leo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-27", "description": "I find Hibino to really have become my neighborhood go-to Japanese restaurant. I like the home-style cooked dishes, the presentation of sushi on ice, and I like that they remember you when you walk in the door. Overall, I'm glad I keep going back.", "author": "Zoe H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-03", "description": "Fantastic dining atmosphere - friendly service. Sparingly decorated but quaint enough for a romantic dinner or a small get together with friends. Tofu was extremely fresh and delicious and the prices were manageable. Definitely try their daily specials!", "author": "Larry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-12", "description": "I ate very well here in October 2009. Note that even though it has tons of tofu, strict vegans can't eat it because it's all made with fish flakes for flavor. \n\nBut I had the tuna sald and the duck salad, and my parents had steak and tofu. all were good. very good. High-quality ingredients. I usually don't like tofu but theirs was actually good. Some of these may have been specials, I don't remember.  \n\nthe space is super-cool, the plates and dishware are all really nice and interesting. But when we arrived it was 5:20 and they said \"we don't open until 5:30. Come back in 10 minutes. Like we couldn't have gotten a drink and chilled in there? but it was cool, we got a beverage at Henry public.", "author": "Josef K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "I come to this place probably way too often. They have the BEST lunch special, especially the pork sausage things. I think the sushi is a little over priced, but I'm cheap so what can I say. The rolls are delicious too.", "author": "Cami B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-16", "description": "amazing japanese food!  the most memorable dish i had there was the beef kakuni.  i didn't know beef could be so tender! mmm!\n\nvery cute decor...definitely a nice place to go on a date.  \n\ni've been there a few times already, but I can't wait to go back!", "author": "Akiko I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "My fav local lunch and dinner spot by far! Homemade tofu amaze. Tuna hako the best.  Great happy staff. Best sushi around. I bring everyone I know here. Always a hit!", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "Best sushi in the area. Offensively low prices. A staple and a gem at the same time. 5 stars due to price, terrific service and above average sushi.", "author": "Thadeus P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-24", "description": "Amazing Obanzai (small plates) where we tried the soy-marinated pork ribs, rice croquettes w/ salmon and basil, and fried tofu with greens.  That beef kakuni dish?  I thought it was a bit tough.  Appetizer tofu in a little glass container was cute.  Service was good but my waitress was a bit faked.  Line starts around 7:30 on the weekend.", "author": "Yvonne Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-28", "description": "I was so excited when I found this so-called \"authentic Japanese restaurant\" in Brooklyn. The food was very disappointed. Food wasn't expensive. But I can cook way better than this restaurant.", "author": "Meg F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-23", "description": "Great little place.\n\nSushi isn't even their forte, but their rolls were still very delicious and the sushi fresh - although on the bland side.\n\nClearly, when you're at Hibino, you've got to rock the Obanzai.  One of the hosts comes around with a little chalk board and tells you their daily offerings.  Our guy spoke very little English, but I felt that was part of the charm of the place.  A little as though we'd found a bit of Japan just off Atlantic Ave.\n\nWe tried the Beef, Tuna, and Tofu.  The Beef was my favorite.  The homemade Tofu was very good.  They serve the Obanzai in small bowls, filled with appropriate broth, potatoes, mild peppers, egg, and daikon.  Even though I'm Korean, it reminded me of great home cooking back in the Mother Land.\n\nOf course, fine Japanese Dining isn't complete without a bottle of quality Sake.  We tried a bottle of Ugo no Tsuki, or \"The Moon After Rain.\"*  Smooth and clean.  The name does not lie.\n\nOverall a great dining experience, minus a few minor complaints:\nThe restaurant definitely can use some better Air Conditioning, my friend's Rolls were served on warm plates rather than chilled plates, and they served the Sake in stemless wine goblets.  \n\nYou can check out their daily specials online: http://hibino-brooklyn.com/blog/index.html.  \n\n* Sake reference from: http://thesakediaries.blogspot.com.", "author": "Arthur O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-24", "description": "Great sushi, but the real star is the chicken teriyaki.  Exceptional!  Totally fair prices.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-21", "description": "The food is amazing, great sushi, great service!  We'll be back again for sure.", "author": "Brenna B."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}