{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-20", "description": "People rave about this place, but I'm just not sure. What I had on my first visit was alright, but I was not blown away. My friends suggested I start with the miso soup... and that it would change my life. Well, sad to say, it definitely did not do that--it was just alright. Sure, it had onions added to it, but whoopdeedoo =) For an appetizer, I ordered their special tempura lobster roll. I'm not sure if it was even real lobster meat. It had absolutely no flavor. Finally, for my main entrée, I had the pork katsu (Tonkatsu on the menu). While the pork was plump and lean cut, it was kind of dry, which made it not that great. Plus, it was served at room temperature... and I was expecting it to be served steaming hot. \n\nI will say that the restaurant was packed, which makes sense because this is a popular place.... and perhaps I just ordered the wrong thing. Nevertheless, so far, I'm not convinced that it's all it's cracked up to be.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "Venue - small and cozy, with enough seating. If you don't have reservations, you may have to wait.\n\nFood - They have daily specials on the board. The appetizers (aside from the tofu) are quite large in portion and should either be shared or treated as a meal. They have homemade tofu that is really good and comes in a cute little pot. Can't go wrong with anything here!\n\nService - Friendly.\n\n+ Homemade Tofu\n+ Daily specials\n+ Accepts Credit", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-13", "description": "The tofu was good . . . like, really good, for tofu. That said, I can't imagine craving it and making a special trip to Hibino for my tofu fix. \n\nOtherwise, the sushi and the ice cream sandwich were totally, 100% fine. I'm starting to think that maybe my sushidar (radar for sushi? can i make that a thing?) is just totally off. I have a hard time discerning between what people call excellent sushi and what people call mediocre sushi. So, anyway, this sushi was either excellent or mediocre depending on how broken my sushidar is.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "Okay so before you even dine here, you must lower your expectations a bit. The prices are great for the neighborhood its in. Granted, Cobble Hill is not really known for its Japanese restaurants. The fact that there is even a Japanese restaurant on Henry Street is a feat in itself.\n\nThe sushi and sashimi tastes great (not mind-blowing) and the other items on the menu tastes great too. I can never compare a place like this to a place in Japan. It wouldn't be fair since the seafood, rice, water, etc. is just different.\n\nIts very relaxed and laid-back, almost like a neighborhood diner. Come early because there ain't no reservations. Try the weekdays because weekends are full of downtown Brooklyn yuppies and their kids.", "author": "Miguel R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-01", "description": "I ordered this via Postmates (great and fast service!) to SoHo.\n\nI ordered the Hibino Sushi Plate and edamame. The sushi were okay, they were on the fishy side. The Kyoto Style Futomaki roll that came with the sushi plate was good. It was big so you have to figure out how to eat it. The edamame is normal, can't go wrong with that.", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-05", "description": "Meh. Womp. \n\nAt the recommendation of my authentically Japanese friend, a group of us walked over to Atlantic Avenue and Henry Street for a sushi lunch. Hidden and kept away from the hustle and bustle of Montague Street and Atlantic Avenue, I was hoping for a great dining experience that catered to those in cobble hill who are \"in the know.\"\n\nSo we get there at 1:20, right during the peak lunch rush but we were seated within a couple of minutes. The restaurant is small so you really shouldn't come in with anything larger than a party of four. \n\nAfter a lengthy wait to order, my friends each ordered the two roll combination for $10 while I stuck with the $10 obento box. I opted for the grilled pork sausage as my entree (The offerings were grilled salmon collar, pork gyoza, shumai and the sausage.) The daily obanzai (think of it as a side dish) was black seaweed with cucumber, and that comes with the obento, which already includes rice, a small salad and miso soup. \n\nOkay the miso soup was fantastic. I have never had above average miso soup before. I've been to Japanese restaurants that cost $10 to $40 to $150. I have never had above average miso soup. I don't know what it was. It was smoky and had real silk tofu and not the diced cubes of tofu you may be used to having. \n\nAnd that's where my experience ended. The grilled pork sausage was grilled pork sausage. Not very dissimilar to what you might have at a friends BBQ. The only difference being that the skin was still snappy, and it's always satisfying to hear that snap when you bite into a piece of sausage. The rice was rice, the salad was salad and the black seaweed was black seaweed. \n\nOne or two dollars cheaper than the sushi offerings that line Montague Street, it really wasn't worth the walk from Brooklyn Law School. Mitoushi on Atlantic and Nanatori on Montague continue to be my two favorite Japanese spots in the area. \n\nOh well. Always great to try new things!\n\nPS: they accept credit cards but limit to TWO cards a table with a minimum of $15 for each. Just a tip.", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-21", "description": "I still really enjoy this place and love it dearly. I returned here for dinner to have another taste of their fresh homemade tofu. I tried the cold and the warm versions. Yes, one is cold and the other is warm, those are the biggest differences. However, due to the heat the texture of the tofu also tastes different. The warm tofu is much more silky and smooth, more of a \" melt in your mouth\" taste. The cold tofu has more texture and is not as smooth. I feel it has a little more character since you can really taste the tofu. This version tastes more \"homemade\". Both were served with a scallion and ginger garnish as well as with a light and savory pouring sauce. My boyfriend decided he liked the warm tofu better. Meanwhile, I think that I will let the temperature of the season determine whether I will have cold or warm. \n\nI knocked out 1 star due to the fact that our pork katsu was disappointing. It was dry, hard, and overcooked. I also had the mackerel box press style sushi. The flavor was great - salty fish with fresh shiso leaf - but it fell apart quite easily and was hard to eat. \n\nAll in all I still adore this quaint nook and will return when I can.", "author": "Stacy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Nice little spot near henry.  We didn't wait too long.  We got a mixed of things between the soft hot tofu, agedashi tofu, kanuni beef and then a few sushi and sashimi entrees.  We were dying to try the ice cream, but it wasn't anything too crazy.  Everything was very neat here, and clean.  Food was very tasty and prepared well.  I think we will have to venture and try some more of the specials next time.  The hanger hamber steak was really a hit.", "author": "Jeff L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "Second time visit and again the food and service was great! However, four out of the five things we ordered on the menu were sold out! It was on the later side but would have liked to have know this before waiting 20 mins for a table to become available.", "author": "Tara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Great food.  Excellent service.  A bit pricey but ultimately was worth the quality of food and service received.", "author": "Kimberly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "My favorite Japanese restaurant in the area. Never had a bad meal here, everything is very fresh, super cool trendy efficient staff. Typically a wait, but they take your number and text you when tables ready. My favorite is the salmon entree and I love that you can get it on it's own without the sides if you want something on the lighter side. Chicken teriyaki is delicious as well for those who aren't into fish. Good selection of sake and usually have a few hidden gems on the beer menu.", "author": "ALLISON L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Great for lunch and dinner! Fresh ingredients, reasonable price, simple and authentic Japanese food! Will come back if visit Brooklyn again!", "author": "Jean H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "I love this place! The Sushi was incredibly soft and fresh. Chicken Teriyaki was great as was their home teas.\n\nIt's a great place to dine solo. Get a seat at the bar, bring a book and relax", "author": "Sriram K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "Very authentic feel to the restaurant. Got the peach mixed veggie juice, sushi dinner and soy milk custard for dessert. Sushi set was the standout- it had great variety and I was really impressed by the quality of the fish. I loved the citrusy mayo on the side - definitely unique. Also the price is great for the quality, so I'll definitely be back. It was really nice to sit at the bar and watch the chefs make all the sushi. \n\nMixed veggie and peach juice was ok. Wouldn't get it again but I didn't have much veggies so thought it was a good nutritional supplement.\n\nSoy milk custard was great - well presented and had a nice layer at the top that added complexity to the taste. Not too sweet and exactly what I was looking for.\n\nService was excellent, very friendly.", "author": "Su G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "I have been here twice. Definitely one of my favorite Japanese restaurants. It is not one of those sushi joints by Chinese. It is real authentic yet creative Japanese dishes. The tofu pudding is the best. My tips is to try ALL their today specials.", "author": "Fanny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Hard to beat for the quality and price. One of the few authentic Japanese restaurants in the area, Hibino offers $10 lunches which come with entree, mini obanzai (small portion of a daily special), miso soup, rice and salad. It's a refreshingly full meal that is perfect for those who want variety. \n\nThere used to be a male head chef but now it is a woman. I heard that the male chef left to start his own restaurant elsewhere, or perhaps he is heading the LIC branch of Hibino which opened last year. The atmosphere and food did change slightly, and not for the worse. It now feels more like a friendly neighborhood dig than a high-end Kyoto-style obanzai and sushi restaurant. But the quality is still there. \n\nDefinitely go with more comfort-food offerings in the menu, including the daily obanzai specials. If the chef is offering specials, there's probably a reason. The sushi did seem like it fell a notch since the chef changed. But stay with staff recommendations and comfort-food side of things and you won't be disappointed. It's hard to beat the $10 lunch.", "author": "Kit K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Best sushi in NYC! Better than Yama, Koi and all the other pretentious Manhattan sushi spots. This is the real deal. Friendly service and great if you have kids because they don't discriminate. Go for lunch and get the special!", "author": "kh G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Amazing! Their strong spot is really the obanzai (small plates), and you can order several to make a meal out of it. Also, those are a good option if you're going light on fish for environmental or other reasons. The ingredients, flavors, are really so much more interesting and delicious than most neighborhood sushi joints. I appreciate the thought that goes into these dishes and the homemade tofu. It's busy and no RSVP, but you can get a drink next door or go for a walk and they will call you. The service is great, the staff is enthusiastic and very sweet. My new fave!", "author": "Alison C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "Loved the food at Hibino. Unassuming spot in Cobble Hill. Earthy and cozy dark wood interior that felt a little like a machiya in Kyoto. Everything we ordered was oishii. \n\n-the warm homemade tofu tasted of fresh sweet soybeans\n- obanzai was roasted summer vegetables in onion/soy sauce. Healthy and flavorful.\n- the shrimp wrapped in yuba was the standout. Original and a generous order too. \n- the rice from the sushi was nicely flavored and not too much vinegar like many places\n\nHighly recommend this place for people who want more than sushi and edamame. Not a full on izakaya but everything tasted homemade.\n\nCannot wait to go back. \n\nSugoi oishii!", "author": "darren n."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-05", "description": "Being huge Japanese food fanatics (I lived in Japan for a little while), and having tried to come here 3 different times to eat (it was always too full), my fiance and I had high expectations by the time we actually sat down to eat. There aren't many authentic sushi places near us, and we were encouraged by the fact that Japanese people actually run the place - always a good sign of authenticity. We ordered a few starter dishes which were fine (agedashi tofu, edamame, miso soup), and a chirashi entree each.\n\nThen we received our chirashi. I wish I had taken photos, but we were too surprised to react. It came in a tiny bento box, consisting of a layer of rice, julienned tamago (egg) sprinkled liberally around, various peas and beans, and the SMALLEST amount of tiny, ragged pieces of fish. Each piece of fish was about 1/5 the size of a normal slice of sashimi. All in all, the total amount of fish presented was equivalent to 2 1/2 slices of sashimi. For $21. I've never seen chirashi presented that way. The fish wasn't even very good. My fiance and I left hungry and extremely disappointed, and we will likely never go back there. We actually ordered takeout chirashi tonight to try and erase our disappointment of the previous night's meal, and there was 10x more fish for less money. I'd steer clear of this one, folks.", "author": "Bettina B."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}