{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "Awesome food great service fantastic Sake ! What more could one want? Why do reviews on Yelp need to be longer?", "author": "Michael A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-03", "description": "Hibinio is a cozy eatery located in Brooklyn Heights. Cons \u0026 Pros: While intimate, the space is a bit crammed and unfortunately, having a open kitchen allows for the temperture in the space to varry \u0026 there was enough kitchen noise on this day at least. Design element was simple yet warm, with few touches ofJapanese designs, but lets talk food \u0026 service. Arriving on a crowded Friday evening, I was never rushed. The food and customer service here was great. They offered a unique selection of rolls, dishes, Japanese beers, and the dishes of the day which are prepared with traditional Japanese receipes.(Will definatly return to try). The fresheness and flavor of thier sushi \u0026 sashimi was quite tasty and while the cut of the sashimi was perfect, i would say that i wasn't a fan of there \"cheif special\" cube style sushi. Tasty, but I guess just a preference. Ending my night with a complimentary warm cup of green tea and i was a happy camper. This place was overall charming and worth the visit and cost. Looking forward to another drop in... Maybe see you there.", "author": "Pamela H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Just love Hibino so much. Their homemade tofu is absolutely divine. Sushi is always the perfect temperature and delicious. The staff is always lovely. Can't recommend more highly.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "By far my favorite sushi spot in Brooklyn and I can go as far as to say even Manhattan!!! It's operated by Japanese men and women who have clearly brought back the beauty and culture of Japanese cuisine. I haven't had such good sushi since I have been in Tokyo about a year or so ago. \n    Usually there is a long wait, so I recommend getting there right at opening to get a spot. It gets crowded and busy pretty quickly. The specials are always delicious but our go-to are the fresh rolls. Eel avocado, yellowtail/jalapeño, spicy tuna and shrimp tempura...all 5 star choices!! Paired with a dry sake and matcha green tea its a delicious, meal for under $75.", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-06", "description": "Decent food, slow service, and throughout the meal some sort of alarm/smoke detector was blaring from the kitchen. Really hard to enjoy a meal when an ear-splitting and intermittent sound makes it difficult to have a conversation.", "author": "Patrick T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-07", "description": "I really really wanted to like this place, and it's super cute inside.  Unfortunately they serve really bland, warm sushi.  Because of the quality, my boyfriend was afraid to finish his meal, and we wound up getting a second dinner elsewhere.  I'm giving two stars because they're non-fish dishes were good, particularly the tofu.", "author": "Emily W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "Hibino delivers excellent small plates that change daily with seasonal variation. The sushi and sashimi are always very fresh. Some reviewers don't like that they are not cold. They are not supposed to be cold. Room temperature is ideal, but means you have to be working with very fresh fish, and fast. The best thing on the menu is the fresh tofu, hot, cold or sweet for dessert. It is addictive, and at $5 the best value on the menu as well. The kitchen is small and intense because they have limited space, and it would be great if you did not have to see all the used foil containers piling up - landfill nightmare.", "author": "Ella S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-03", "description": "Came here on a Saturday night with a few friends last weekend. The wait wasn't too long given that we showed up at 8pm (only about 30 minutes), and the ambiance was great, but the food was very average for Japanese food in NY. \n\nWe ordered two obanzai to start with: one was a pork meat sauce with noodles, and the other was a sort of tofu gratin. The tofu dish was very unusual and didn't taste or seem like tofu at all. It wasn't bad, just not something I'm used to. The noodles dish had a good and simple flavor. It tasted like something my mom would make! \n\nWe ordered various combinations of sushi, which were again fine but not incredible. The temperature of the rice was off and the presentation could have been better. \n\nOverall I had a good experience at the restaurant, but I wouldn't rush to go back.", "author": "Aelita P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "This is my fave sushi place in town with the freshest fish and best quality rice. I adore their little obanzai appetizers which they change daily, and their age dashi tofu is the best I've ever had.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-07", "description": "A friend and I went here because of a recommendation and the reviews on yelp. I was not impressed at all. We were seated and attended too pretty quickly. I got the peach and vegetable juice which was good. I got two rolls and neither were impressive. They were kind of falling apart and were nothing amazing. I got the shrimp tempura roll and it was literally a piece of shrimp with rice around it. I have had amazing sushi at Sushi Gallery on Clark street and this just did not compare. Once they gave us our food they never came back to check on us unless we waved them over. We also wanted separate checks, which seemed easy but they struggled doing so. So we did the math and split the bill accordingly, which wasn't a big issue.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-02", "description": "This place is inconsistent in quality and lacks good service.\n\nFirst time my husband and I went on a Saturday, they had $6 tasting plates. We ordered the Mabo tofu and the Mackerel, which were decent sizes and tasty.\n\nSecond time we went on a Friday, one of the waiters came up to us with food in his mouth and while chewing asked us what we wanted to eat. I felt like saying, \"nothing, as long as I'm looking at you chewing like that\". Twice we were shown the menu, asked for something, and only then told that they were sold out of it. Why wouldn't you tell your customers ahead of them choosing which items were out?!\n\nWe ordered one of the tasting plates comprising mackerel expecting roughly the same size as last time and it was ridiculously small-- it might as well have been finger food. The service was extremely long. We ordered 3 tasting plates, sushi and sashimi plates. The rice was soggy and the temperature was off. We were there almost two hours. It's ridiculous. Never coming back here again.", "author": "Cindy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-29", "description": "Another great visit to Hibino. Its a bustling neighborhood joint with warm staff ice cold beer and fantastic sushi rice and the freshest fish. The Obanzai are always intriguing.", "author": "Matt B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "The only place my wife and I will go for sushi in the Brooklyn area. Everything is always fresh. They make simple dishes but done just right and not overdone. Simple is good and they do it right without extra fluff. Pair meals with their selection of Japanese beer and enjoy.", "author": "Edmund L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "Amazing Obento Box with Yellowtail Collar.  Pork Katzu curry and Lobster Tempura Roll", "author": "A V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Really delicious sushi. Great ambiance. Everything was fresh and tasty. And the wait wasn't too long either. Three cheers for Hibino!", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-05", "description": "Food is good but the experiences is not. It's very loud in the restaurant and the food look sloppy and rushed. I do recommend the Saba sushi. They are known for that and the box sushi.", "author": "Orange P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "I really like sushi and thought Hibino would be a nice place to take my friends to. The host sat us down and when we were ready to order our waiter ignored us and took orders from two other tables who arrived 10 minutes later than we did. Additionally, they charged us for condiments which are typically free at the majority of sushi restaurants in New York. The food was ok but concerning, my tuna was very warm which is a major public health concern and disappointing considering that the food and portions aren't cheap. After we finished our food, we asked for our checks for nearly 20 minutes even though the restaurant wasn't busy at all. We asked the host for checks because the waiter was no where to be found and the host glanced at us and rolled her eyes multiple times. We decided to go to the front to get our checks and our waiter was on his phone in the corner and then also decided to roll his eyes. In simpler terms, the service was horrible and this place is not worthy of anyone spending an hour or two trying to have a nice dinner. It was horrible.", "author": "Aleksei K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Hibino is a gem! Try the homemade tofu (warm) and whatever specials they have on the board. \n\nThe tekka don (tuna sashimi over rice) really hit the spot, and their sushi entrees are cute and rectangular. If you're coming here on a date, definitely order an appetizer + entrees + some sushi to share.", "author": "Isabel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "This is the most authentic Japanese restaurant in Cobble Hill.  That being said it is already ahead of the game.  The other so-called Japanese restaurants in the area are Chinese or Korean run and have pretty much the same standard fare.  It's the homey atmosphere and obanzai selections that make this place special.  \n\nThe miso salmon zuke, grilled perfectly with an obanzai add-on of daikon and pork belly, was the right amount of food and flavor.  \n\nThe Hibino sushi plate of 7 pieces and a Kyoto futomaki were very fresh and oishii.  The scallop was especially smooth and sweet and the Kyoto futomaki which had eel, shrimp, tuna, tobiko, avocado and cucumber and yuzu mayonnaise was a nice departure from the standard California roll in most sushi combos.  \n\nThe lighter fare gave us room for dessert which consisted of their signature soy milk pudding served in a miniature glass milk bottle which was not too sweet but still satisfying and a substantial Japanese dorayaki ice cream sandwich.  \n\nAll in all, it was fulfilling without being too filling.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "This was the worst service I've had in New York. The waiter came to our table maybe twice throughout the whole dinner and took forever to get the checks. When we asked for separate checks, he rolled his eyes. To make matters worse, it took about 20 minutes to enter the credit cards and the whole kitchen stood around and watched. The food was okay, a bit ridiculous, you have to pay for standard sushi condiments (spicy mayo, eel sauce). I also ordered the agedashi tofu, which was cold. Do not recommend to anyone, even my worst enemy.", "author": "Nora H."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}