{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Great sushi, the quality of the fish amazing. The apps and salads are just ok so if you want a complete Meal this place is just ok. But I come for the sushi and order up a storm. This is a great place to go if you want great quality pieces of sushi, rolls and sashimi etc.", "author": "Jaclyn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-26", "description": "Came back here for Dine In Brooklyn and now love this place even more.  For $25 you get the 3 course meal which is essentially the same items they offer on their regular menu.  They do not skimp out on the portion size or quality here.  I had the tuna tataki which was so good.  The tuna was lightly seared and you can taste that it is a fatter richer cut of the tuna rather than the lean tasteless part that many restaurants use.  My sushi plate was also delicious with a very interesting futomaki roll which I've never had before.  To round off my meal, I got the mochi balls which came with 4 on the plate.  I was ready to explode after eating all that, and for just $25!", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "Conveniently located a few doors down from Henry Public, Hibino was the second stop on our Brooklyn food/drink tour. \n\nWe received some strange looks when we stated we just wanted to order the house-made tofu. Our thought was if we were truly going to eat our way through a variety of Brooklyn gems, then we needed to take it easy at each stop. \n\nThe tofu didn't disappoint. Like EN in Manhattan, they offer both both warm and cold varieties.\n\nThe jars in which the tofu was served were so cute. I wanted to take a set home to use as vases, cocktail glasses, pencil holders and whatever else I could think of. However, when I asked if they were for sale, I was told no.\n\nHibino had a nice neighborhood feel, complete with a warm and friendly staff. If it weren't for trying to save room for stop number three, I would have ordered a number of items on the menu. But alas, we were able to show a bit of self restraint.", "author": "Lee H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Great sushi and my go-to spot in the neighborhood. Gets busy sometimes but definitely worth the wait. And the home- made tofu is killer.", "author": "Micah R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-22", "description": "I was a huge fan of Hibino for the longest time. For the last five years, it's been my neighborhood go-to for sushi and one of my favorite sushi spots in NYC. I've been to Nobu and Blue Ribbon. Hibino was definitely up there. Unfortunately, starting back in October 2016, the quality has gone down ten-fold. The size of each cut of fish has been halved. What once was a gorgeous and elegant and by no means huge piece of sushi (salmon and scallop were my faves there), has now become a fraction of a piece. I used to go to Hibino every week. I'd swallow the price because it was just that good and the staff was so lovely. But both times I've been in the last six months have proven that they are cutting back on size - and quality. I'm sad to see such a wonderful place go so far downhill. I hope that the chefs return to the spot-on quality they provided for so long. If they revert to the excellent quality I enjoyed for so many years, I will definitely be back.", "author": "Caitlin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-18", "description": "I've eaten here on  four occasions and feel confident I can faithfully report that it's: meh", "author": "Jill H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-14", "description": "I will never, ever, ever cheat on Ki Sushi again. First, service is standard. Smiling faces. Very nice. However, the food is bland and completely matches the ambiance: nothing going on. \nI started to write this review with the nobikaki dish and was hoping it would get better...but nothing, nothing, nothing is worth writing about except how much i wish I was at Ki sushi right now. \n\nGood company and the door 20ft away,  are the only saving graces. By the way, did I mention how awesome Ki Sushi is?", "author": "Hilary L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "I would literally write a song about Hibino. An ode. \n\nI am an LA native who's lived in NYC for 3 years, and I can honestly say that Hibino is the best and freshest Sushi I have ever had. For the quality, the prices are completely reasonable. The futomaki is outstanding, as are all of the other special rolls. The spicy tuna is better than I've ever had. Do yourself a favor and hurry there.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Great service, delicious food and sake, what else do you need to be happy? Went there couple times, went there again today for lunch and were super happy. Ordered salad, couple sashimi and rolls. Food came out pretty fast even i could see kitchen was kinda busy. Staff is very nice and attentive. Green tea + sake = love. Will be back. Definitely.", "author": "Alisa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Best sushi in BK Hts, super fresh, super nice, super cheap, been here for sure ten times (at least), have never left bummed. \n\nGet the Soft-shell crab roll. And amazing lunch specials, go", "author": "The M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "This is probably the best Japanese food in the neighborhood. The chirashi is excellent and the lunchtime bento boxes are a great deal. The prices overall are reasonable, the Japanese staff is courteous and the restaurant is very accommodating when it comes to children.", "author": "Alissa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-09", "description": "You could go here for sushi, but that would be a little bit besides the point.\n\nI have been here 3 times over the past year and each time I end up ordering everything off the \"Obanzi\" menu as well as the housemade tofu.  Perhaps some sushi, perhaps not.\n\nNot sure the japanese translation for Obanzi, but mine is \"small composed plates of deliciousness not unlike what you would experience at a traditional japanese kaiseki dinner\". \n\nThe obanzai menu changes daily, and if you go towards the end of the night, say perhaps from 9pm on, expect some disappointment in the form of X's across some of the obanzi choices.\n\nThe sushi is good... fresh.  Often times local. Perhaps better quality fish than any other place on court or smith, but still... its an afterthought. \n\nLove this place.", "author": "Gabriel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "Best sushi in the neighborhood -- hands down.  Their box pressed sushi with tuna and shiso is amazing.  So is the warm, house-made tofu.  The cooked entrees are great, too. love this place.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "Most authentic Japanese food in all of Brooklyn! My Japanese friend said he will be bringing his Japanese mother here when she visits!  Food - both the sushi and salmon dishes we ordered - was delicately and carefully prepared. The meal was topped of with a creamy soy-based custard with just the right amount of sweetness.", "author": "Mare J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-06", "description": "I love sushi, but unfortunately can't really eat it. I have heard nothing but good things about Hibino, so finally decided to take my fiance here as a surprise and for being patient with me when I deny his sushi cravings. \n\nI got the chicken teraki and we got the beef short rib appetizer--both were delicious, and rectified the fact that I didn't have any sushi. My fiance loved his sushi. \n\nBeyond the food, we were seated toward the back, in a nook with a loud larger party. The hostess graciously offered to move us to a quieter table, but we stayed put. It was a very appreciated and unexpected offer. The service overall was attentive, despite one blip when my fiance spilled his beer and wasn't offered another. \n\nA great source for authentic Japanese food in Cobble Hill !", "author": "Jill D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "Absolutely excellent on all counts: quality, service and price.  The Obanzai rotation everyday is awesome and the sushi is fantastic and they have a fresh menu.", "author": "Bam Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-29", "description": "I used to love Hibino. Thought the food and service was great until they fraudulently charged my credit card (one charge for dinner and a separate charge for $60) apparently the workers there are criminals. Don't take a chance or pay cash!", "author": "M. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-17", "description": "Yes Hibino definitely deserved it's listing in the L magazine's best restaurants issue.  The best value is their lunch box special.  The yellowtail collar is AMAZING and very affordable.  Just go early because they run out of their specials very quickly.  My only gripe is that there tend to be a lot of moms with loud children here so be mindful of that.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-05", "description": "Little Japanese place in downtown Brooklyn. Food is authentic and tasty. Price is medium.", "author": "Big B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-27", "description": "This place was great - I wish they would take reservations...I once tried to walk in when the wait was over 1 and half long! Thankfully they had an open table for two the other night. \n\nThe sushi was excellent though the portions run on the small side. \n\nThe ambiance is very casual [welcome to Brooklyn], but I liked it - I definitely never felt the need to raise my voice.", "author": "Heather F."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}