{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-30", "description": "Vegetarians Beware.\nEven the most vegetarian-safe sounding item on the menu such as the \"Field Green Salad\" is made with a fish-based dressing, with absolutely no indication in the menu descriptions as to its presence.\nI've visited this place many times, always advising the waitress of my vegetarian requirements, but was falsely led to believe items were veggie-friendly when they were in fact fish-based.  Only at my last visit was I properly told that the green salad, along with the various tofu dishes, and in fact 95% of the menu, was non-vegetarian.\nBeing that Hibino is in an area which has a reasonably large presence of vegetarians, they should make it apparent from the descriptions of the items, or better yet have a key that indicates that an item is vegetarian.  Otherwise, I'm sure that many diners, just like me, were led to believe that an item was veggie-safe from their misleading menu.", "author": "Christian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "Japanese food by Japanese cooks.  The obanzu dishes are great.   Sushi tastes fresh and clean everytime.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-23", "description": "The best thing about this place is their homemade tofu. If you can get it on a salad, go for it. If they have the tofu pudding dessert, definitely get it. \n\nThe fish is pretty fresh here. Most of the dishes we've had have been 'quite' good. Their to-go menu is slimmed down but they still offer enough to satisfy when in a pinch. The soft-shell crab we had was yummy. The fried eel roll was a bit odd, with the eel being on top, deep fried, and not really working with its 'parent' roll. \n\nThe sake list is limited but some good selections and not overpriced. They have more beers than most sushi places as well, which is great. Overall, it's nice to have this place in the neighborhood. We'll go back, I'm sure many times, and for the price-point I think it's a great place.", "author": "Adam D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "The first time I went to Hibino, there was something of a scheduling mixup with my convive, so when it became clear she wasn't coming, I could do nothing but stare longingly at the blackboard listing the daily specials. Amongst other distinguishing traits, Hibino serves an ever-changing list of \"obanzai\" -- a term denoting seasonal, Kyoto-style home cooking -- at the insanely reasonable price of $4 each. Simmered kabocha, a sake kasu soup, ebi katsu... None would be mine that night. I left with a heavy heart.\n\nOne week later, I returned, this time with convive firmly in tow. Despite the prior tantalizing glimpse at the menu, some doubts nagged at me. My own neighborhood is chock-full of authentic Japanese restaurants; could Hibino justify the trip out to Cobble Hill (and back; twice, in fact)?\n\nI am pleased to report that, for the right taste buds and moods, yes. Hibino purports to serve Kyoto-style specialties, an exciting prospect for me all by itself. Kyoto may lose out to the likes of Tokyo where sheer freshness of seafood is involved (it's an inland city), but few places in the world place more of an emphasis on seasonal ingredients. The knock against \"Kyo-ryori\" in Japan is that the flavors can be so subtle that they border on tastelessness. So Hibino is not a place for a slam-bang, shock-me-with-flavor convive.\n\nTake the tofu, for example. For a variety of reasons -- excellent underground spring water, good quality soybeans in the area -- Kyoto is known for its tofu, and Hibino pays homage to this fact by devoting an entire section of the menu to the ingredient. We chose the purest form, labeled simply \"fresh made tofu\". It came plated with the never surprising but always delightful attention to detail that high-quality Japanese restaurants bring to the table: the tofu was nestled inside an exceedingly cute miniature milk bottle. A few garnishes came along too, but the tofu hardly needed them: silky and smooth, almost sweet but strongly redolent of edamame. It put lie to the assertion that tofu lacks flavor. This may have passed over the head of many a lesser convive, but I had chosen wisely, as my dinner companion loved it. It can be safely mentioned in the same breath as Aburiya Kinnosuke's version. (I have yet to try it at EN Japanese Brasserie.)\n\nA kamo (duck) salad followed, the Japanese mustard greens dovetailing well with a shiso-based dressing. We chose the asparagus tempura off the aforementioned obanzai section of the menu. I'd seen a man walking in earlier with bales of fresh asparagus tied up under his arms, and with a very light batter the dish let that freshness shine through. Then a couple of sushi rolls: the spicy scallop roll had fine raw scallop inside but went a little too heavy with the dollop of mayonnaise on top. I ordered the striped marlin roll out of curiosity, not remembering the last time I'd seen it in sushi. Maybe for good reason -- it's not a sustainable commodity at this point. A shame, because the roll, done negitoro-style, i.e., with the flesh chopped up, revealed the splendid fattiness of the fish. The rice in these rolls was unspectacular but fine.\n\nAnd then, the reason I wanted to come in the first place: the Kyoto hako sushi. Hako sushi, sometimes seen rendered as \"box sushi\", was one of the original forms of sushi wherein rice was laid into a shallow box and then the fish packed tightly on top of it. Hibino offers several versions, and I thought the Spanish mackerel sounded like a winner. It was. The fish was minced into tiny bits yet was somehow cohesive when later sliced into rectangular pieces reminiscent of the more familiar nigiri sushi. The oiliness of the mackerel melded nicely with the vinegared rice and the bits of sweet shiso hidden inside. A heavily reduced soy sauce and sugar sauce drizzled on top completed the palette of flavors. A lovely dish, and one I wish I could get closer to home.\n\nTrue, Hasaki in the East Village has a version, but that restaurant lacks the charm of Hibino's setting. It's situated on a quiet corner, across from a nice little playground, and the space itself is done in an austere dark wood that simultaneously exudes serenity and welcome. It's the kind of NYC Japanese restaurant that could only exist in Brooklyn. You guys over there are lucky.\n\nProbability of return within 1 year: 50%", "author": "Lawrence C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "I finally ate here!  I've been checking out this place since it has been reviewed from Time Out NY - so I guess that was around in May-ish and have been meaning to eat here but never had the chance to.\n\nThe restaurant is located on a corner (please excuse any vagueness since I am still learning the neighborhood or just Brooklyn overall) and we arrived at around 8sh.  I thought that a group of 4 could not be seated immediately because it was packed but they found us a table in the back corner.  \n\nWe sat down and they provided tab water in a glass bottle.  They had three types of menus - the Sake menu, Wine menu and the entree menu.  Because I dont drink sake, I didnt browse their list.  But we decided to order a bottle of the \"Rathead\" wine - red wine, which was delicious but a bit strong in its flavor and content.  \n\nI ordered for myself two rolls - the spicy tuna and shrimp tempura roll and just wanted to make sure that when I was ordering the tempura roll, that it wasnt mostly tempura batter and the waiter confirmed that it was a good balance of tempura and shrimp.\n\nWe also ordered a platter of the edamame (which was half lukewarm t half cold). The tofu was also ordered but I didnt care for that (preference matter).\n\nI had wanted to order the chicken teriyaki but promised myself to get that as another meal when I come back.\n\nOverall, the experience was great, great rolls, good wine and great service.  \n\nIt is defly true what other reviewers have commented about the restuarant running out of the specials or menu items.  But even though it is annoying, it could be a good sign that they are always getting their items fresh and it is a highly requested item.", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-19", "description": "Perfect.\n\n...and thankfully my brother picked up the bill.\n:D", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-15", "description": "Solid joint.  Fresh sush and nice little apps.  Will come again", "author": "Jordan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-20", "description": "We tried this restaurant this week while in NYC. What a gem!\nEverything was so fresh from the greens to the sushi.  The best part was their homemade tofu dishes, especially the dessert! Highly recommend if you find yourself in the area.", "author": "Norman C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "Yummy food, attentive service, kid-friendly and spacious dining (even with a large stroller.)", "author": "Kathy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-04", "description": "Went here today with three good friends of mine. The four of us just decided on a whim to grab some Japanese (one of my friends LOVES Japanese food for its simplicity and taste). Well, we drove out there, and arrived at 2:29 PM, right before their advertised \"lunch - closing - time - of - 2:30 PM.\" \n\nI decided to get the Chirashi Sushi on the lunch menu. Seeing that there were a bunch of 4 and 5 star reviews on Yelp, I thought that this place was going to be \"off the hook.\" NOPE! Big disappointment. I mean, the atmosphere is nice, it's not a bad place to dine in, it's small and cozy and it's got good decor, but the food nowhere matches the appearance of the restaurant. I was thoroughly disappointed by the Chirashi dish, as it came in a small bento box, and the cuts of sushi were like cuts of chicken breast cubes. Small, and lacking. The presentation of the meal wasn't that great either - I mean, for 5 dollars more I could have just gotten the sashimi platter lunch dish and had 12 slices of sashimi and a bowl of rice... which is basically the same thing as the Chirashi with small little cubes of fish and \"shaved dried eggs.\" Bummer - the rice was also SUPER vinegar-y, way more than what I was accustomed to with the Chirashi...\n\nOh, and here's the kicker - you know how in many Japanese restaurants to preserve the raw fish they'll wrap the fish in wrapping...? Yeah, well, there was a huge piece of wrapping still stuck to my fish in my Chirashi dish, and that was definitely not cool. The waitress saw me pluck it off and she was just shell shocked, saying \"Oh, I'm sorry...\" and not really doing anything else for me. \n\nI was disappointed for sure in this restaurant, but that could have just been the singular dish I ordered. My friends thought the food was great, so... I guess 3 stars is okay. I might go back again next time, despite all the crap, but it'll definitely not be my first choice.", "author": "William W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "Enjoyable lunch spot with nice specials. I really liked both my salmon-avocado and my spicy tuna roll and felt that the fish was fresh and of high quality.", "author": "Irina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-19", "description": "Hibino is a godsend for people living in the Heights. It's my go-to restaurant. Always interesting, always good, with a very nice energy.", "author": "M L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-09", "description": "If you like fresh, homemade tofu, you must come here. It's their specialty and never fails to hit the right spot. Their daily specials are always superb, matched by their incredible, attentive, \u0026 friendly service.  The variety of obanzai dishes makes it so hard to choose, but you can't go wrong. The flavors are delicate and the presentation simple.  \n\nI've had a pleasant experience on every visit, and I'm grateful to have a place like Hibino so close by!", "author": "Yasmin E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-22", "description": "Really surprisingly good sushi here.  The \"pressed\" sushi is good to get just for the novelty of square shaped sushi, but also delicious.  The tofu pudding is similarly strange but delicious.  The price is also good for the quality of the sushi.  \n\nI'm only giving 4 stars b/c of the quality of the service when we were there.  Slow, scatter-brained and uneven.  One member or our party  was even served the wrong dish.  Thus, the four star rating is a testament to the great sushi.  We left full and happy despite the service.", "author": "Allison S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "Great food and reasonable prices too. I loved the Salmon with miso. And the tofu was amazing. Finding this kind of good Kyoto food in the US is not very common so I'm thrilled it's in my neighborhood. The only problem is it's a mad house. Extremely busy, even on a Tuesday night, and it's hard to relax. The waiters seemed a little flustered sometimes.\n\nOtherwise I would have given it 5 stars for the food and value.", "author": "ET B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "Extremely good authentic japanese. Whether you're looking for savory, choice sushi, or fabulous traditional dishes, the meal is exquisite. Lunches are a particularly great value.", "author": "peter H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "I really like the vibe in this casual sushi place. The staff is very friendly. The food is great and I recommend you try the daily specials written on the chalk board. You will be rewarded for being a little adventurous. The homemade tofu is also fantastic!", "author": "Sutipong S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "I really enjoyed the meal. Sashimi was so fresh.Every dishes were beautiful and elegant. More the service was great!!!I'll definitely go back again.", "author": "Brenda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "Best sushi in the Cobble Hill/Brooklyn Height area.  Extremely friendly staff, creative menu (changing appetizers each day), and delicious rolls.  A meal for two with an appetizer, 3 regular rolls, 1 specialty roll, and a desert totalled just $37!  Very reasonable for a top quality sushi restaurant.   Will certainly be back.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "Great neighborhood spot! I love it. Best salmon I've had in a sushi joint. Waitresses are great. I've been to japan and it reminds me of those neighborhood restaurants.  My wife calls it hibini.", "author": "Charles B."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}