{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "The best cold tofu I've ever had.  Since 2005 when they opened, it's still the best I've ever had.  \n\nGreat sushi and beef as well but the tofu is just hands down amazing and worth a trip on its own.", "author": "Ryan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-20", "description": "pros: It's nice. Sushi is always nice, and this place serves all the familiar rolls. There are a few interesting bentos for their lunch specials, such as the lobster tempura roll the day we ate there.\n\ncons: Hibino is in the same neighborhood as Ki Sushi, and I can't help but compare the two. When I do, Ki wins. There was less variety and quality in the food we ordered from Hibino. There is also a notable difference in service -- when we were at Hibino for lunch, there was only one waitress at the time, and she served all 5 to 6 occupied tables.\n\noverall: From other Yelp reviews, it seems there are a lot of Hibino fans. If you know what you like, by all means, stick to it. Otherwise, go a few blocks down to Ki Sushi and get something better for the same price.", "author": "augin s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-26", "description": "My vocabulary word for yesterday was \"obanzai.\"\n\nThe staff and menu at Hibino (together with some web searching on my own) tell me that obanzai are little side dishes native to the Kyoto area. Hibino calls them Japanese-style tapas. They *are* like tapas in the way that they're these delectable little morsels to sample.\n\nOne particular standout was a salad of squid, wood ear mushrooms, seaweed, and cucumbers in a vinegar dressing. There was also a salad made up of crispy chicken pieces on a bed of dressed lettuce that was a lot like cole slaw.\n\nA broccoli rabe salad with Fuji Apples with a sesame dressing was great, too.\n\nI'd recommend just coming in here and ordering the obanzai of the day (which you order from a chalkboard list that they bring around) and a bottle of sake. They do have a full menu of sushi, salads, soups and entree items, too. \n\nThe soft shell crab sushi special was very tasty, although the individual pieces were almost too big to eat in one bite. I've become a huge admirer of soft shell crab sushi.\n\nI think this restaurant's only been open a year, but they have a very self-assured, confident style and they're very friendly. It's a nice space, too. Bright, clean and attractive.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-09", "description": "Good God this place is amazing. Way better than any expensive sushi place in Manhattan. Went in for the real thing this time - kicked it off with 3 Obanzai (Japanese tapas): garlic soy cooked mushrooms, agedashi tofu (this was a repeat because it was SO good last time, and was as I remembered if not better), and mini fried chicken wings. Thsi was a prelude to an omokase that included soft shell crab roll, octopus, uni, fluke, and salmon roe, all of which was face meltingly fresh, supple, and exquisite.\n\nThe staff are about the sweetest people you could meet, too. I love them, the food, and everything about this place.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-10", "description": "I cant believe someone had the nerve to say this place compared to ki sushi!! def not a good experience..the wait staff was unfriendly and unwelcoming.. and the sushi was just ahh.. def wont be coming back.. its sad", "author": "Dima L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "I love Hibino. Yes, it is a tad pricey, but the quality is so good. Plus, there are some pretty good non-sushi items that you don't find at the usual sushi spots. The wait can be a pain, but on weekdays you will fair a lot better.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-16", "description": "Love this place. Great sushi, and lots of other things too. Check online for the daily specials--small plates change all the time, according to season. Variety of freshly-made tofu dishes, including desserts! Nice welcoming atmosphere, especially at the comfortable bar. Lovely service too. Crowded always, but not so that you can't get a place with just a little bit of waiting.", "author": "Elizabeth K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "It's spacious, the service is fine. Food is ok. It's a bit expensive side for the quality unless you order the $10 lunch. It's not fabulous, but it's better than most places in low NY standard, so I give 4 stars.", "author": "Athena G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-01", "description": "My quest to take advantage of Dine-In Brooklyn began here.  Porkchop and I arrived on the lateish side on Saturday night and didn't have to wait at all, though we did opt to sit at the bar.\n\nThe first thing I noticed is that Dine-In Brooklyn is far superior to Restaurant Week in Manhattan.  The options are awesome!  They include some of the most expensive items on the menu.  Like, whoa.  Even so, Hibino is definitely on the affordable side, and I'd doubt a meal to come out to more than $30/person (pre-drink).  It looks kind of tapas-style with many small dishes that range between $4 - $10ish, and then larger entrees that are still reasonably priced at around $20.\n\nThe Dine-In Brooklyn menu gives you an obanzai (Kyoto-style appetizer), and choice of appetizer, entree, and dessert.  Since I came with Porkchop, we each got a different obanzai to sample.  I don't remember either one, so I guess they weren't great.\n\nFor appetizers, I had the shrimp toji maki, which was basically a glorified eggroll, and Porkchop had the tuna tataki.  Both were good and generously portioned, but nothing special.  For entrees, we had the salmon and mackerel hako sushi meals.  These were kind of interesting: the rice is pressed in a box around some ingredients (shiso for the salmon, shitake for the mackerel) and the fish sits on top.  It reminded me a TAD of Bozu's sushi bombs, since it's more of an interesting idea than anything really fabulous.  The fish was't particularly fresh or delicious, but once again, the food was fine.\n\nThe best part of my meal was the soy pudding dessert.  They serve it in a tiny jar with a tiny spoon, but I could have eaten a whole vat of that.  Porkchop enjoyed his red bean pancake w/ green tea very much as well.\n\nAll in all, a solid and satisfying meal, but not quite worth our trip out here.", "author": "Deborah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-13", "description": "Hands down the best Japanese food I have had in Brooklyn or Manhattan. \n\nThe freshly made tofu is light and has a wonderful texture. The fried tofu comes in a light, flavorful sauce. The mushrooms it was cooked with were SO good.. savory but light and perfectly cooked- soft but firm. \n\nThe tuna tataki (seared tuna salad with avocado) is one of my favorite dishes and I was impressed. The dressing was, again, very light but completely flavorful and was not over or under-dressed on the salad. The tuna was perfect in texture, almost buttery and so fresh. The same with the piece of tuna they had as a special..  The japanese yam tempura was made with a sweet white potato, and was perfectly cripsy. \n\nThe adorable waitress was very attentive without being forced or trying to upsell anything. If you've read that NYTimes article (http://boss.blogs.nytimes.com/2009/10/29/one-hundred-things-restaurant-staffers-should-never-do-part-one/), you'll be impressed with how FEW of those habits these staffers have.", "author": "Annabelle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "Japanese home cuisine, reminds me of my time in Japan eating home cooked food. Plus some sushi, which is fine for an authentic Japanese restaurant. Not outstanding, but fine. That's a compliment though, bc most sushi restaurants serve sushi that is subpar by authentic japanese restaurant standards. Love the home made tofu and the teas. Pressed sushi.", "author": "Nyuta N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "The menu here is always something new and delightful. There is hardly ever a  wait and the place has a nice atmosphere. It was a sweet twist on the Japanese food I've had in NYC.", "author": "Dingin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-23", "description": "I was told that the lines start to build soon after they open, so I took my family (and the gift certificate that I had) to Hibino for a weekend dinner upon door opening. Seated right away, we were treated to tepid tap water, asked for and received hot tea.  After reviewing the menu and specials, we chose the tuna tataki appetizer, which was good, but nothing to rave about.  The kids both had the salmon sushi entrée, which was sparsely garnished with thin slices of salmon. My wife opted for the teriyaki chicken as a safe dish, but was unimpressed.  I couldn't tell that it was roasted at all, and it just seemed to be sitting at the bottom of the dish, swimming in a sauce that didn't seem very complex at all.  My beef kakuni short ribs was tasty.  I should have prefaced the review with the fact that my wife is native Japanese, we've eaten all over Tokyo and NYC. I kinda get it that so many inexperienced hipster families would consider this place worth waiting for on a summer night, especially considering the neighborhood...but still, hardly worth waiting for, and I was very glad to use the gift certificate that I had.  The bill would have left a bad taste in my mouth if I had to pay out of my own pocket. I am shocked that someone gives this place five stars for serving cold tofu.  get some life skills.", "author": "Weber J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "My friends took us here for dinner one night and it was pretty packed for a saturday night at 9:30--the first good sign.\n\nI happen to adore sushi. Traditional and the funky kind, and this menu had a good mix of both. Of course, I was with my boyfriend who loves the wild and crazy sushi that you can only find for $12 in California (ie. Alameda Sushi house!) so we split 3 different rolls. Sadly, I forgot what the names were so I can't recommend them, but they were gooood.\n\nSo if you happen to come from a similar background like me who can appreciate both traditional and crazy, off-the-wall sushi that most New Yorkers seem to disdain, then this place is worth a try.\n\nI don't know if it's quite good enough that I'd travel here if I were all the way in Queens, but if you're in the area, why not.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-18", "description": "Hibino makes the best tofu in the five boroughs. My favorite is the cold tofu, served with scallions and ginger. I also like the Osaka-style box-pressed Sushi, which have shiso leaves inside.", "author": "Andrei S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "My Japanese husband and I have been living in Brooklyn for over 25 years and have endured many awful \"Japanese\" meals served up by Chinese or Korean restaurant owners. Hibino is the real deal, THE best Japanese restaurant we have experienced in Brooklyn. We especially enjoy the lunch special bento boxes, including salmon collar.", "author": "Pamela T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-25", "description": "My favorite neighborhood restaurant though now that I moved, I have a nice 30-min drive to Hibino.  But worth every mile.  \n\nLove the obanzai (Kyoto-style dish) as well as the Shira-ae (Veg with silken tofu sauce) and sushi is always fresh and well-made.\n\nGood reasonable selection of wine/beer/sake as well.\n\nAnd sometimes they have tofu cheesecake --- very rich but with tofu!  Delicious.", "author": "Hannah A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-19", "description": "I would have given this place five stars had it been JUST a bit cheaper or we'd gotten just a BIT more fish for the price. Other than being a mite overpriced, this place is fantastic! The servers were really nice, the home-made tofu is amazing, and the salmon-avocado roll my boyfriend and I shared was delicious... but his chirashi and my tekka-don had like... four small pieces of fish in each of them. It was the skimpiest tekka-don I'd ever had, his chirashi also, and I was very disappointed because the tuna in it was so delicious (soy marinade I believe, so good) that I wanted more! I think if they had 6-7 pieces of tuna in the Tekka don it would be as good of a deal as it is delicious. By the way their rice is to die for, very flavorful, and their miso soup is amazing as well. Everything tasted unbelievably good.\n\nAll in all a great place, 5 star taste, atmosphere and service, but a 2-3 star value, so I gave it 4 stars to compensate.", "author": "Bee P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "This is a cozy and cute place with great unpretentious Japanese food at reasonable prices. The highlights of our dinner were three Obanzai dishes - bacon wrapped yam, mackerel, and stuffed mushrooms -  agedashi tofu and the hamachi salad. The service is good.\n\nWe left feeling very stuffed and satisfied! I would come back to this place again.", "author": "huong n."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "obanzai sells out (so be warned if you get there late or end up waiting for a table around 8 or 9 on a weekend). \nthe fish is amazing and fresh. \nthe  tofu is worth the hype - particularly the agedashi tofu (which comes lightly fried in a delish dashi broth).", "author": "Maia D."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}