{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-24", "description": "Have now found my hands down favorite sushi restaurant in Brooklyn. I ordered the tuna tataki to start, sushi plate and the soy milk pudding for dessert while my date had the seaweed salad, sashimi plate and mochi. The tuna tataki was slightly seared, well cut and the dressing on the salad was a bit spicy without overpowering the lettuce. The sushi plate was great but would definitely recommend the sashimi plate as the cuts of fish were excellent and the scallop sashimi was out of this world. It was ever so slightly seared, just enough to add a bit of color and the scallop just melted in your mouth. Service was attentive without being intrusive. Overall a great experience.", "author": "Christine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-01", "description": "Hibino is definitely worthy of 5 stars, I've only eaten here one time however. Service \u0026 prices were really great. We went her for lunch, i had a bento box with the entrée being salmon collar, It was cooked perfect, so fatty \u0026 flaky,even the skin was tasty. The box came with rice, salad, some other really good shrimp fish thing that was amazing and miso soup with homemade tofe, not the little cubes. If in town, a must to try!!!", "author": "Steve D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "This spot used to be my 3 times a week lunch spot when I lived in the area. I still go for lunch anytime I'm in town on business and they remember me years later. Couldn't be more friendly and I have yet to find anything close to replace them!", "author": "Jin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "Hibino is one of the best dollar-for-dollar values in the city. Even thought hey recently raised all of their prices by a few dollars, I still don't know of any other option where you can get as fresh, tasty and interesting Japanese dishes at the price point. The sushi is simple and perfect, the soft shell crab roll being my favorite. The staff is the nicest around and the daily obanzai specials usually offer the option to try 2 or 3 small dishes that you've never had anywhere. I couldn't recommend this place enough, I've lived in the neighborhood for 6 years and never had a single bad meal here.", "author": "Matthew F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "Love this place. Immediately when you enter the restaurant, you just feel calm and relaxed. Their menu is delicious and it's all really fresh. Their hamachi salad as an app is really good and for sushi, I would recommend he Kyoto Hako or the Chirashi plus the miso is pretty good too. One of the best Japanese in the neighborhood.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-30", "description": "Best Sushi in Brooklyn! Spicy Tunal roll is tuna with spicy sauce on top, not day old tuna pices cut up with spicy sauce mixed in. (Kii does this) The fish is sooo fresh. The rice is on point! AMAZING! (and not that expensice)", "author": "Hilary B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-07", "description": "This is my favorite restaurant in Cobble Hill. The homemade tofu is absolutely incredible, the sushi is always fresh and I have never had a less-than-stellar obanzai.", "author": "h n."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-25", "description": "Hibino is adorable but, for me, not amazing.\n\nI'm not a sushi-eater, so I can't speak to that, but I found the service quick and responsive, and was comfortable sitting at the bar in front of the kitchen. The food was quite good, too -- but I had to order a side of rice for my tonkatsu (what???) and as it was a special, it didn't have a \"set\" option... bummer.", "author": "caitlin o."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-13", "description": "Hibino is our favorite sushi restaurant in Brooklyn!  The fish is always wonderfully fresh and well prepared.  There is also a comprehensive sake menu.  Our favorite part is the appetizer menu, which changes every day.  We go every weekend, and are always pleased.", "author": "Anna H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-26", "description": "Sadly, I have barely visited this joint since I moved out of Cobble Hill and my best friend relocated from Brooklyn Heights to London. I remember coming here for the first time with said friend before I even lived in the neighborhood, a few weeks after a  break-up that had destroyed my appetite. Miraculously, Hibino restored me to my ravenous self with its delicious homemade tofu (served hot in an adorable jar) and sushi so fresh it's as if the fish jumped right out of the ocean and into your mouth. Ever since that day, I have been smitten with Hibino. There are no special, fancy rolls here, but there's no need for them either. It would be a crime to obscure the esoteric delicacy of Hibino's fish with some Asian-fusion creation. For this reason, the menu is quite small, sporting about as many sushi roll choices as tofu and obanzai (Japanese tapas that change daily). The restaurant's decor is as understatedly elegant as its food: just a handful of cozy dark wood tables, soft lighting, big picture windows that look out at quaint Henry Street brownstones, and a traditional sushi bar where you can watch the artists at work. The staff is quite friendly but also refreshingly aloof, allowing you to enjoy your meal without much interruption (while still being attentive). The service is fast and the presentation magical; each piece of Asian plateware efficiently delivered to the table seems to be more eye-catching than the last.", "author": "Sandra G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-29", "description": "We are new to Brooklyn and went to see a movie at Cobble Hill Cinema, then walked to Hibino.  It was all the reviews said and more.  The Japanese Sweet Potato Salad Obanzai and the sushi special the Lobster Roll were to die for.  Most impressive however was the beef kakuni which was a tangy, savory japanese version of pot roast.  My boyfriend and I shared everything and the incredibly tender beef was a perfect compliment to the cold sushi and obanzai.  This is the best place we have eaten in NY, and I cannot wait to go back.", "author": "Tara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-28", "description": "***4.5 stars***\n\nHibino has set a high standard for Japanese fare in BoCoCa*. I found myself here for lunch with friends - one who had just seen Hibino featured in the local news that very morning so we knew it was meant to be. \n\nThe lunch obento box is only $9 which includes Entree of the day + Mini Obanzai + Miso Soup + Rice + Salad. I went for the Beef Kakuni Teishoku since Hibino's kakuni is its specialty. For $12, this bento box includes Beef Kakuni + Mini Obanzai + Miso Soup + Rice + Salad. Obanzai is Japenese for tapas and Hibino switches up its obanzai on a daily basis. There are also sushi lunch specials but I was all about the comfort food and authentic dishes that day.\n\nThe miso soup is ordinary except they put in a tiny chunk of silky, homemade tofu. Yum. The bento arrived with each compartment filled to the brim. The rice had little flecks of purple on it - I have no idea what it was but it added a subtle sweetness to the rice. I gave my salad away but apparently it was good. The beef kakuni was heaven. It was still stewing in the sweet soy sauce. There were three generous pieces, lined with fat and each piece just melted in my mouth. Much to my surprise, they also included some homemade tofu in the kakuni compartment. Score! It was on the firmer side because it wasn't in a totally contained space. It was fine but nothing beats the super silky, soft homemade tofu. The mini-obanzai of the day was the Hijiki Salad - Simmered Hijiki Seaweed, Age (Fried Thin Tofu), Renkon (Lotus Root), Chikuwa Fish Cakes and Carrot. So healthy but surprisingly good. No doubt about it, this was a great amount of quality food for $12.\n\nThe service was good and the space is small but open. They have wooden disposable chopsticks but they're branded (literally, with a heated stamp) with the super cute Hibino logo. I love when restaurants pay attention to that kind of detail.\n\nHibino is also all about the social media which is awesome. It's on myspace with video footage. On the website is a link to its Flickr page with photos of the employees and food. They also blog about their daily specials and obanzai (http://hibinobrooklyn.blogspot.com/) - gotta love the food porn! I think it's great that a restaurant is using all avenues of social media for marketing. Now Hibino just has to link to the highly-rated Yelp reviews! \n\nI'll be back here for sure for lunch or dinner. Fresh made tofu on the dinner menu is only $4!\n\n*Has this awkward portmanteau caught on? Years ago I found some marketing materials on my BKBFF's nightstand promoting shopping and eating in Boerum Hill-Cobble Hill-Carroll Gardens so I'm assuming BoCoCa is not an organic creation of residents but a label by a tourism marketing machine. Which explains why I've never heard it said in real life. Anyways, I'm going to use it.", "author": "P W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-04", "description": "I loved this place. I went there on a Saturday night and only waited 20 minutes for a table. The sushi was great and the freshly made tofu was the best. The wait staff and hostess were really helpful and sweet. Nice selection of sake. I would have preferred a more extensive wine selection though. Seaweed salad was very good too. It has a really great atmosphere inside. My husband and I will be going back soon!", "author": "Silva S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-15", "description": "Ambiance, Food, Service. The best ever. REALLY good Japanese food is hard to come by as we're bombarded with Boat Sushi and \"fast food\" Japanese places. I can tell the restaurant puts their heart and expertise into their food. Love the Obanzai and melt in your mouth fish. Soooo good.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "Really great Japanese food with creative specials. Fast service.", "author": "Kaite M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-18", "description": "This is a solid 3 star place, the sushi is NOTHING to write home about its just OK and there are no real fancy rolls, just the standard tuna, yellow tail, shrimp tempura (the kind thats literally just one shrimp tempura fried rapped in seaweed n rice, no cucumbers, avocados, caviar, eel sauce, you know none of the stuff that actually makes it good). The prices are waaaaay too high for quality of sushi, and the best part, they ONLY have full sodium soy sauce, and it makes everything taste INSANELY salty, i had to mix mine with water just to make it edible.  The reason why I did give it 3 stars is that the apps were good (tuna and yellow tail salads were deelish) and if you're a big tofu person surely you will enjoy this place.  If you're coming for the sushi, please turn around and go elsewhere. Oh also it was about 110 degrees outside and about 95 inside, loosen the purse strings Hibino and get some real air conditioning!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-25", "description": "Yes, we know this place has awesome sushi. Pretty much everything is delicious here. But the service and organization of the place is lacking. I put my name and number in and was told it would be about 20-30 minutes. After about 15 minutes of waiting in the cold, I asked if I could sit at one of the many empty seats at the sushi bar and have a drink. Please... let me support your business by drinking some of your delicious sake. But alas, no! Those seats were being used. (They sat empty the rest of the night.) I saw many unhappy people turned away for tables when there were empty tables sitting there. I guess they were waiting for the people the called back to show up. Once we finally were seated, it took forever for our waitress to come over and take our order even though she filled our full water glasses twice. \n\nAnyhoo, with all that said, there are many delicious things here. Just don't be starving and have some patience, because it will take a bit to order and get your food. The yellowtail was very fresh and the Agedashi tofu was... wow. My friend had the beef short-rib entree and he was very impressed. We tried the fish-shaped cake for dessert. The waffle part was delicious, but red bean paste just isn't for me. I'm sure some people would like it though.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-16", "description": "Looks nice, good crowd, and magically delicious - Hibino could charge 2x and it would still have customers", "author": "Buckner G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-14", "description": "The food here is really great, especially the tofu. The staff is really friendly. The hours are a bit strange, and it can sometimes be a bit of baby zoo but it's worth it.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-28", "description": "Great sushi, best in the neighborhood.  Creative dishes are prepared with love.  Also very attentive and courteous staff.", "author": "Josh G."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}