{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "This place has excellent food. I've had the Teriyaki Chicken over rice which was very good. I would recommend checking this place out.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "This is my favorite restaurant in the neighborhood. Every day, three new obanzai items are offered, featuring seasonal vegetables and meat or fish - and we almost always end up ordering all of them. In what I imagine is the Kyoto style, these tend to showcase earthy umame flavors, and they are beautifully presented in tiny bowls. \n\nI also love their fresh tofu. It's served in a tiny glass carafe, like a kid sized yogurt cup, and the flavor is so subtle and delicate. Everyone who's tried it has fallen in love. It's not a wild and crazy food, but it's a soothing treat.", "author": "Myrtle W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "Hibino is the platonic ideal of a New York neighborhood restaurant. It has absolutely delicious, fresh sushi in the \"box\" style of Kyoto. The house speciality -- homemade tofu -- should be able to convert even tofu haters. We love the fresh tofu in a small glass jar, which is served with soy sauce, fresh ginger, scallion and other flavors to pour over it. The agedashi tofu, in a savory broth, is also excellent. The Obanzai, or small plates, are more hit or miss, but fun to try.", "author": "Dana G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-30", "description": "I often passed by Hibino in the neighborhood but never been inside so over this weekend for my birthday, with my parents, we decided to check out the place. \nAppetizers are a bit pricey for the portion, I thought. \nSushi at Hibino in general are not as great as I thought it would be since the place is run by Japanese.. \nFor desserts, we've had Black Sesame Ice cream \u0026 Green tea Ice cream which was very tasty.\nThe service was good. In general it's a place for small portion appetizers and light meals.", "author": "Liz H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-24", "description": "On the weekend this little restaurant is packed, and with good reason.\nIf you are craving Japanese food this place is certainly worth the wait.\nThis is my favorite Japanese place in my neighborhood, and here's why:\nthe prices are VERY reasonable, the fish is always fresh, and the obanzai specials are creative, and keep the menu interesting, and the staff is friendly and attentive.\nAlso, i think i am addicted to their seaweed salad.", "author": "Marina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-13", "description": "There's nothing I can say about this place that hasn't been said already. It's so good, just go already and see for yourself, and get the house-made tofu", "author": "Michael S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-29", "description": "The best sushi in this part of Brooklyn. But skip the raw fish for once, and try the Kyoto style tapas instead. It's really great. We had four tapas, a couple of appz and a crab roll - as well as a couple of beers - and paid 100 quid incl. tip. Very affordable.", "author": "Per P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "I first heard of Hibino when my friend got us take out from there. Beyond the delicious food, we were amazed by the attention to detail. Everything was so carefully wrapped and each pair of chopsticks had a little sticker with the restaurant's logo on it. \n\nSince then, we've been back to the restaurant a few times. The sushi is solid but I love the variety of home style, cooked items on the menu. And the mochi for dessert! Finally, the lovely all Japanese staff enhances the experience. I wish that I live in this neighborhood so I can go more often.", "author": "Angela C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "Thrilled there's a new Japanese offering in the neighborhood ! Been dying for one since a couple bad experiences, checked out Hibino for the first time... Loved the Chirashi, Tofu offerings + a couple good rolls. Also, the presence of Ichigo and other japanese beers make this a win in my book.  Wait wasn't too bad either, will definitely be back.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "I thought the rolls were just okay, but all the obanzai we tried were great, and the housemade tofu was the best I've ever had, bumping this place up from a 3 to a 4.  \n\nI'd go back again, but I'd stick with whatever obanzai specials they have going on that night, and would get more tofu dishes.", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-03", "description": "Is this the best sushi restaurant in Brooklyn?  It is one of the few authentic Japanese sushi restaurants.  The sushi and salads that we had were delicious and prepared with care.  Presentation was very traditionally Japanese, although not the breathtaking work of art that you might find in some places.  I had the sushi combination platter so that I could try an assortment.  Portions were right-size and the fish was very fresh.  My friend had a selection of vegetarian sushis that were very good.  I love sushi and will be going back.", "author": "Cary R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-20", "description": "Hibino is a good option for fresh sushi in the neighborhood (certainly overtowering the terrible cheap sushi place on Atlantic and Clinton). I give it an a-ok for the freshness of most of the fish that was presented to us. However, a few things were awry in my visit - first, the tuna roll (I believe it was a simple tuna avocado) didn't taste very well. Not sure if it wasn't fresh, or if just simply wasn't a great tasting fish that day, but it was not very good at all. My pressed salmon sushi, while overall quite tasty, wasn't prepared very well. It fell apart literally the moment I picked it up with my chopsticks. Our other roll - a simple shrimp tempura - was very good. \n\nOverall, this place is pretty good, but I wouldn't make a trip for it.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "Wonderful neighborhood Japanese restaurant. Welcoming, friendly staff and delicious food. The wait can be a bit long on Fridays and Saturdays, but they're highly efficient with their system of texting you when your table is ready \u0026 the neighborhood is cozy, conducive to pre-dinner strolls.", "author": "H D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-26", "description": "This is quickly turning into one of my favorite sushi spots. The fish is really fresh, the tofu is excellent, and the japanese tapas dishes (obanzai) are very creative. Any time I'm craving sushi now, I'm itching to go to this place. As other people have said, definitely try the tofu.", "author": "Dave K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "This place is amazing! I am super picky about sushi...and I think this is one of those few places that made my mark!\nThe space is lovely clean lines....spacious..and the hostess..is mysteriously striking!  \nThis was the first time I experienced Kyoto style Obanzai (Japanese tapas)-they were like $4 each and they change almost everyday. We had the eggplant with pork, bok choy, and the tofu (which is Hibino made). I usually hate tofu but this was just delightful!\nThe sushi was fresh, I had no complaints about it! The Toro was just perfection-we went a little crazy and ordered 2 rounds..but it was totally worth it!! The SAKE was also just perfect, nothing like some cold sake on a hot summer day. We just asked our hot hostess to recommend us some! So excited about this find! Thanks to my foodie friend! :)", "author": "Maria F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-30", "description": "Seems a little Hipster to me but the Hibino Teriyaki Chicken was excellent as was the tofu. Hako and Panko Eel roll good. Miso soup pretty good. The Beef Kakuni was dry and tough. The Sashimi was fresh and cut well. It is a nice place to try if you are in the neighborhood.", "author": "Jack Straw S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-21", "description": "This is my favorite casual sushi joint in Brooklyn.  \n\nThe sushi is extremely fresh and reminds me of the sushi at fancier places like Blue Ribbon or Sushi Yasuda.  \n\nThe space is also really clean and the sparse layout is nice.  \n\nI also love their lunch specials -- especially the grilled fish ones. \n\nThe place is a little hidden, but a great find.", "author": "Susan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "Love the place.  It was totally real Japanese.  Tried the tofu, tako wasa salad, gyukaku, soft crab and lobster roll.  Everything was really tasty and the service was quick and good.  Can't wait to go back here!", "author": "Su S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-26", "description": "So glad I decided to come out here after an afternoon of enjoying the cherry blossoms at BBG. I was craving Japanese food, but not your average  corner sushi joint sushi. I wanted something special. And Hibino delivers. BF and I shared the tuna tataki, special lobster tempura roll, agedashi tofu, tuna roll, and Spanish mackerel box sushi. Everything was so delicious, .\nAt first we thought we under-ordered but it quickly became aparent that we had done just the opposite. We decided to stop with some pieces left over and switch to dessert. They were offering ice cream, tepanyaki, soy pudding, and a pancake ice cream red bean sandwich. We went with the sandwich...its basically tepanyaki and mochi had a baby and their baby was delicious!\nThe decor is very basic, nice jazzy music  playing, attentive but not pushy staff. \nThis is ideal for a couple or double date dinner. I wouldn't blink at coming here for a solo lunch either.", "author": "Dina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-08", "description": "Very clean tasting Japanese sushi.  The cooks are japanese and legit.  Their small plates are great and well priced.   This is a regular for me.", "author": "Alec R."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}