{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "As good as it gets....I would trek out of manhattan to try this gem of a place. everything that has to do with mushrooms, tofu, and fresh fish is amazing and delectably priced. also try the seaweed salad. second only to koi.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-29", "description": "hmm, really  more of a 4.5 star review.  \n\nwe ate:  agedashi tofu, braised beef with tofu (appetizer), braised pork in cream sauce (obanzai), pressed yellowtail with shiso entree, sushi platter, red bean ice cream.  \n\neverything was very good--i was surprised at how good the fresh sushi was.  the braised pork was the best dish--perfectly flavored and melty, served atop this crunchy mushroom thingy.  the seared baby spicy peppers accompanying the agedashi tofu were super tasty too.\n\ni am simply holding out my 5 star sushi review for something more mystical.  is that so wrong?", "author": "Joan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-25", "description": "Worst sushi I have had in a long time.  Probably worse than Sushiboy, at double the price.  Fish was medium to low quality - some pieces were tough and with too many veins.  Sushi rice was over cooked, mushy, and almost unseasoned with vinegar.  And what's up with the watered down cheap tea they serve at the end of the meal?!  It's completely unpalatable.  Would not go back.", "author": "W C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-03", "description": "Great food, service, ambiance. Love this place. Have excellent vegetarian options too. Really enjoyed Hibino!", "author": "Steffany E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "Best sushi in Brooklyn. The obanzai provide fantastic value and variety. The tofu dishes are a treat.", "author": "Tabby M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-07", "description": "I love this place. The food is amazing. The service is great. I wish I could afford to eat here everyday.", "author": "The L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-04", "description": "probably one of the best places you can go in brooklyn for decent japanese but the food is hit or miss.  the fresh made tofu was decent.  the salmon sashimi was one of the best i've had. the uni was excellent.  the packed mackeral shiso roll was really good. but the so called toro wasn't even belly tuna and it was nothing special.  the renkon lotus root was kinda slimy and it had a little piece of hair in it.  obviously i didn't eat it, they apologized for that but they never offered to bring us a new one nor did they bother taking it off the bill.  what the hell is that?  on top of that the wait staff was very abrupt with us as if we were a nuisance to them.\n\nother points: seeing a microwave oven used frequently on the counter was a big turn off.  parking is absolutely hell and it doesn't help that there aren't any garages nearby.\n\nbottom line, would i go back?  not on my dime.  i'll go if you provide the limo and we get drunk on two bottles of their born jun daigin (which was the best thing there).", "author": "Norman S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-18", "description": "Fresh and tasty sushi and sashimi, the only reason I give it a 3-star is because there is not a lot of variety on the menu. Also, I feel as the service gives extra attention to certain tables and for some reason I always get the crappy service. A convenient place for me because its across the street from my workplace, def a good recommendation if you are in the heights because the quality of the sushi here is good.", "author": "Asma S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-15", "description": "I really like the ambiance, food and service at Hibano. Love trying the obanzai even if they're not always amazing (although they're usually great). Fresh sushi. Friendly servers. It's a good one.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-29", "description": "Far and away my favorite sushi spot in the whole city.  The quality of the fish is beyond reproach, especially for the price, and the restaurant itself has a very comfortable and relaxing atmosphere even on a Friday night.  The best part is the ever-changing menu of obanzai; if you're sick and tired of the same old shumai and seaweed salad appetizers these traditional small plates will rekindle your love of Japanese cuisine.  And don't forget to order the fried dough fishy dude for dessert!", "author": "Joram S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-21", "description": "This is very surprising, I've had sushi in many places, and this is the best I've ever had in North America, everything 's brilliant, simple, with little interesting flare here and there. The price is decent, and waiters are friendly, make sure you make reservations before you go though.", "author": "Bo D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-14", "description": "Obanzai!\nHomemade tofu!\nThis is just about the most inventive Japanese gastro-pub I've ever been to.  Who needs the giants of Japanese/New York cuisine when you can eat this well for so little (well, relatively speaking anyway; don't expect a bargain, all-you-can-eat-sushi-type of place).\nThe staff is really nice, knowledgeable, friendly, has a good sense of humor, and the place has a nice laid-back kind of feel.\nSimple style, that matches the slightly humble but really well executed food. \nWe were 4 people, so we were able to share a number of plates, including a Spanish mackerel dish that was perfect, broiled eggplant and zucchini with a miso and mirin sauce, and the version of tofu we had was skin wrapped around shrimp.  Yum!  Almost Chinese, in a way.\nLoved it; recommend it.  We had a great dinner.\nOnly issue: there are better Japanese beers out there these days; that would help for them to match small batch beers to their clearly artisanal food sensibilities.", "author": "Alexis K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-02", "description": "Really great sushi and really great prices. We started with the warm homemade tofu. LOVED. Then we ordered a bunch of rolls and pieces - all great/ high quality. Would go again and again.", "author": "lysa p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-27", "description": "I've yet to sample the best of Hibino I fear. My first experience was marred by a poor/comical wait staff experience but the food (that was left) was so good I knew I'd come back. It was later in the night and they had run out of many of the Obanzai dishes but we just went for raw fish and found it to be very fresh and definitely ahead of the other sushi places around. Sorry Kotobuki. You've been downgraded. And my second experience was also later in the evening and they were out of our initial choices. But the service was exponentially better which I was relieved to see. Will definitely be going back, just earlier in the night.", "author": "carl g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-12", "description": "Everything about this place rules--the cooks are cool, the servers are super nice, the food is delicious and unpretentious, they have a blog with the daily specials, and their website features a little animated dancing chef that is so adorable, you'll want to curl up inside one of their mini cheesecake jars and go to sleep.", "author": "M T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-11", "description": "Delicious! This is not your average Japanese restaurant. Their homemade tofu, served in small glass jars, is so light and fresh that it melts in your mouth.  The rolls are excellent. You must also try their tofu cheesecake, also served in small glass jars, with a small biscuit on the side.", "author": "Leslie Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-16", "description": "Really?  An average of four stars?  I do love that there is a Japanese owned Japanese restaurant in my hood.  Lets start with the pro's.  Yes Japanese owned ( anyone who really knows Japanese food knows there is a vast difference), clean, not a cookie-cutter name ( like something stupid like Tokyo, or samurai, or other generic names), decent  fresh food with rotating menu.  While I like all of these things, the food is really mediocre for Japanese food, the lunch specials are just bascially riding on filling people up with lots of rice, salad, miso soup with left over veggie cuts.  If going for lunch opt for the sushi, at least you know you are getting your money's worth somewhat.", "author": "M F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-12", "description": "Hibino was highly recommended to us by neighbors- and we couldn't wait to try it for dinner.  Truly a genuine experience. One of my favorite dishes, homemade tofu (chose warm) alone, is a great reason for anybody to dash over.  We had cold sake, seaweed salad, mackarel, eggplant, edamame, and the braised beef (ours was a bit overcooked).  Yum!  The dishes are served beautifully , and the place was abuzz with lots of happy diners of all ages.  The only important improvement would be if they had some ventilation- the kitchen is open, and we smelled like fish and oil when we left.", "author": "grampa g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "Excellent sushi with a great atmosphere.  Very attentive staff.  It is a gem in the neighborhood.", "author": "Jonathan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-19", "description": "LOVE THIS PLACE! Their lunch special is amazing and really reasonably priced! It changes daily, but it's always really good. Inside it is clean, modern and everyone is so so SO friendly! It's always a joy going there---you almost forget you're in New York City (service wise, not food wise)! I also love their appetizer, shrimp toji maki; tofu skin wrapped around shrimp and fried---the best! I just wish they DELIVERED (but then I'd be officially broke)!", "author": "Cat H."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}