{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "I've been to Hibino several times with various people, and although I've tried most of the obanzai and the appetizers and taken little bites of other people's meals, the only thing I would ever order at Hibino is their Miso Salmon dish. \n\nIt's fantastic.\n\nThe salmon, a nicely sized portion, is cooked perfectly (tender, melt-in-your-mouth).  The skin is crispy and fatty and flavorful.  \n\nI only wish I had two stomachs so I could order two salmon miso zuke dishes.  And I'd eat it all, too.  Even if I took a bite of my friends' dish, I wouldn't share my salmon.  No, no, no.\n\nNo.", "author": "Kyu K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-21", "description": "I really like this place. I highly recommend the beef kakuni!!\nHowever, there are way too many kids in there. One time i saw a kid rolling around on his kick scooter and his mom/staff didn't do anything.", "author": "Sachin P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-14", "description": "I don't know what everyone else on Yelp is smoking but this place was definitely a disappointment. The food was bland \u0026 the decor was worn. The staff was friendly but I just don't get it. Don't waste your time!", "author": "John C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-21", "description": "The sushi was nothing special at all.  The sashimi was served too cold and the fish lacked flavor.  The rolls were bland and the cooked specials were not tasty either.  It is no bargain.", "author": "Professional N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-14", "description": "Lovely japanese food in the Heights/Cobble Hill area. If you like Japanese food then this place is good.\n\nIts a Japanese, Japanese place (as opposed to Korean or Chinese Japanese places that are all over New York) and it has a nice slow vibe, a good selection of the goods and well prepared sushi.\n\nDon't come for rolls. Come for sushi.\nDon't come for Tuna Salad. Come for Miso.", "author": "Carl C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-30", "description": "In a quaint corner of Brooklyn, i came across this restaurant that was recommended by my friend who said it was a great place for Japanese so i went to try.  It was an OK experience.\n\nThe agedashi tofu was solid but the spicy scallop roll wasn't how i like it --i like it when the scallop is already mixed in with the spicy sauce which isn't.\nThe boy's food was ok but it wasn't something extraordinary.\n\nThere were two tofu dishes that were already sold out so that wasn' that good. :(\n\nI don't think i got dessert since i was full from my tofu and rolls.\n\nA plus was that the food was quick and it wasn't that expensive.\n\nHowever, it didn't quite make the impression that i thought it would make.", "author": "Kal M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-10", "description": "I think this is a new addition to the developing Brooklyn Heights restaurant scene. It definitely has a friendly feel and a surprisingly nice, minimalist design right down to the chopsticks. The tofu was good, as everyone else seems to agree, but the other dishes weren't that great. The donkatsu is not their signature dish and comes out as too thick and not juicy enough. It looked and tasted a bit like chicken. The uni sushi was okay: the fish was good but the wrong type of seaweed was used to wrap it. Overall, a nice neighborhood restaurant but it has plenty of room for improvement.", "author": "Wesley H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-25", "description": "Hibino is Alright.\n \nDuring BK Resto Week last year (Mar 2009), the Squab \u0026 I had a late RW meal at Hibino.\n \nWe both ordered the RW meals, each giving us an obanzai (Kyoto-style appetizer), choice of appetizer, entree, and dessert.\n \nFor appetizers, the Squab had the shrimp toji maki, essentially an eggroll, and I had the tuna tataki.  Both items were good.  \n \nFor entrees, we had the box (hako) sushi's.  We split a salmon (with shiso) and a mackerel (with shitake)hako sushi.\n\nThe Squab really liked her soy pudding dessert.  It is served it in a glass jar with a small spoon.  I enjoyed my dorayaki red bean pancake with green tea ice cream.", "author": "Hideki K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "I frequent Hibino about twice a month, so this review is based on multiple and consistent visits over a period of about 6 months.  The food is always inventive, fresh, well-plated and you can never go wrong with the specials. Also, the service really can't be beat.  One star off because it can get quite busy on weekend evenings, and you may be waiting for a table/for your food for a bit.", "author": "Liz T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-14", "description": "GREAT SUSHI! The folks at Hibino know how to put together a menu - not too many options (which can be overwhelming) but definitely enough interesting items and specials to keep you coming back. If you're an adventurous eater, try one of the options you rarely see at other sushi restaurants. The presentation is excellent - no sloppy work here. AND, something you rarely see at sushi places - an interesting dessert menu. \n\nThe decor is simple and unpretentious. There is a bar area if your solo or just enjoy watching the masters at work. Hibino is more spacious than the typical Manhattan equivalent which makes it a good choice for both small and large groups.", "author": "Lis K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "Live around the block, has been my favorite sushi place for a long time.\n\nIn addition to the various specials, the obanzai are an excellent way to mix-up your traditional sushi dinner.  Since they're only $4, you really can't go wrong.\n\nThe fish is always extremely fresh, and the waitstaff (and chefs) always quick with a smile.  The only drawback with this place is the lighting, I wish it was a little less bright.\n\nNotably, you can see the detail Hibino puts into its dining experience by looking at the chopsticks; each one has the Hibino emblem burned into the side.\n\nHibino also has a website updated daily with specials and photos of Obanzai.\n\nAlways a great choice, so thankful they're in the neighborhood.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-22", "description": "She says:  The best Japanese food I have had in NYC -- and so authentic, the food made me remember some very pleasant food memories from childhood/Japan that I had forgotten for years.  \n\nRecommended eats:\n* The age-dashi tofu was out of this world -- tender, fresh-made tofu, fried with some tempura-type batter, in a delicious shiitake mushroom-based dashi -- this was the best tofu I have had in the U.S.  Definitely try this.\n* I got the Tekka Don, which is a rice bowl with sushi rice (seasoned with a bit of shiso flakes), shredded egg, and soy sauce-marinated slabs of fresh tuna -- delicious and flavorful.  The rice was a little salty for my taste at times, but it may be just right for others.\n* He got the broiled salmon with miso sauce -- perfectly broiled with a sweet glaze, with sake-flavored miso sauce on the side, letting you control how much sauce to put on the salmon (brilliant).\n\n\nHe says:  I may not be from Japan, but I spent a few weeks there.  This food was as good as any I had there, even in the best restaurants.  The age tofu was especially good.  It had shiitake mushrooms that paired so well with the fried tofu.  My second favorite was the tekka don when paired with the wasabi side.  (The wasabi was quite good.)  On the con side, the wait staff was a bit slow on the check.  They seemed to be quite attentive to other tables, though, so it's not like they were just sitting around. I'm definitely looking forward to going back.", "author": "Benny Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "Hibino is a small little sushi spot right off of Atlantic and definitely a great option for lunch. I was lucky enough to come here when they had the Grilled Yellowtail Collar special. For $9, I got soup and a bento box filled with seasoned rice, salad, picked radish and ginger, deep fried potato wrapped shrimp and a yellowtail collar. What a deal! I must say the miso soup was the best I have had. The tofu was delicious and creamy and I am not even usually a fan of miso soup. This place made me a believer. The salad was a bit underdressed and the deep fried potato shrimp were a bit greasy but still it was a nice lunch. Finally the yellowtail collar was a huge portion and was flavorful. I would highly recommend Hibino for something outside of your usual sushi if you are in this area!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "My BF and I stopped into Hibino for a late dinner on a Wednesday night. When we are itching for sushi, we generally eat at Iron Chef House in Brooklyn Heights because it is closer to our apartment. Lately, however, we have been disappointed with the quality of fish there and decided to venture out.\n\nWe were seated right away, although we arrived past prime dinner hours on a weeknight. My BF ordered a Japanese lager that he had never tried before (they have an excellent selection of beer, wine, and sake) called Yebisu. He claims it was one of the best lagers he had ever had.\n\nWe ordered the Hibino Sushi Plate which consisted of a variety of 7 pieces of sushi and one Kyoto Style Futomaki to share, along with a special roll, the Negi Toro Roll (Fatty Tuna and Scallions). It was incredibly fresh and delicious! One of the things I loved about the sushi was that it was actually bite-sized, as sushi is meant to be. I've had such big pieces of sushi in the past that the act of chewing is overwhelming. I can't appreciate the taste and texture of the fish when I'm just working to swallow the pieces. At Hibino, it was perfect.\n\nFor dessert we had the green tea ice cream. It was so refreshing. A perfect end to a perfect meal. We will definitely make the trip again.", "author": "Emily A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "Great sake, great atmosphere and lovely service. Best tofu I've ever had, and my fiance loved his sushi. It's a popular joint so I'd come early. It's definitely the best Japanese I've had in South Brooklyn.", "author": "Jay H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-28", "description": "This restaurant is one of the best Japanese restaurant in this Aria.\nTaste and quality is so so , but waitresses were really terrible.\nWhen I go there they took us to the table and left the menu.\nThey didn't ask the order even 10 minutes later.\nWhen we call them, they said \"we'll ask soon\", but they came to our table after 5 minutes.\nThen ordering, we asked the water.\nIt takes 10 minutes just bring the water and 2 glasses......\nThere were 3 Japanese waitresses there. \nHowever Hibino is really small , they couldn't ask order and serve quickly.\nI can't believe that they are Japanese, I've never seen like them before in my life.\nIf you really have a patient, just try here.\nIf not, I don't recommend there.", "author": "Kotaro O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-24", "description": "Judging by the abundance of favorable reviews, it seems we went on the one day they were serving CRAP. Or maybe that's just Monday lunch in general. I ordered the obento box and ate a couple of bites of a very fishy tasting, deep-fried salmon thing, an unmemorable dumpling thing, boring rice and average miso soup before I called it quits. My boyfriend actually had some digestive issues afterward. Eew.\nEveryone raves about this place, so I guess I'll have to come back for dinner and give it another shot.", "author": "inga m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-30", "description": "Service was a little confused, a little inattentive, but friendly. We tried fried horse mackerel obanzai, which was good, simple, but kind of small.\n\nBesides obanzai, the starter portions are pretty generous. The home made tofu is especially good, soft and fluffy and always served in some kind of flavorful broth. I prefer Agedashi to the other preparations but your mileage may vary. The beef kakuni was good, but not great. The broth and seasonings are fairly mild, the beef was a little tougher than it should be, but it's worth getting if you crave beef at a sushi place.\n\nSalmon Miso Zuke was cooked perfectly, the skin was crispy and fantastic, and despite simplicity ended up being our favorite dish. I definitely recommend getting a set. The sashimi plate was above average, but not by much.\n\nI think it will take a few visits to find the gems on the menu.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-15", "description": "One of the best casual Japanese restaurants I've tried in NYC. I really loved the atmosphere, which reminded me of cozy cafes in Kyoto. I ordered some appetizers such as yellowtail carpaccio and shiraae (this was very extra ordinary style) and Tonkatsu(deep fried pork chop) for entree. Food quality was really great for the price. One disappointment was the servers were not very friendly nor attentive.", "author": "Chloe Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "From a price for quality stand point Hibino is hard to beat.  The best Japanese restaurant in South Brooklyn.  First off, this feels like a true Japanese place and not some overly hip Japanese fusion place - making your stay here feel like a little teleport to Tokyo.\n\nThe service is humble and caring.  The food is fresh and healthy.  Hibino serves my favorite Salmon dish in the city (The Broiled Salmon).  For its $14 price tag, you cannot go wrong with its sweet taste of miso.\n\nThe specials keep this place always feeling like a pleasant surprise.  Always worth a try.\n\nAnd of course, the sushi is always fresh and flavorful.", "author": "Daniel F."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}