{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-30", "description": "It would be hard for me to overrate Hibino.  The food is authentic, fresh, and prepared with homemade style and care that I've only seen perhaps at Ume No Ie in the city.  The prices are wonderfully reasonable for the fare they serve.  The staff is personable and doting.  Easily my favorite Japanese food in Brooklyn.", "author": "B. M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-18", "description": "The food may be good but no reservations at these prices and even for big groups? Don't care much for their customers. Go elsewhere", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-20", "description": "very high quality food, although our night there was almost killed by an incredibly noisy couple sitting next to us. \nif you feel like having a romantic night, don't recommend this place, because all the table are just to close to each other. the food is great though!", "author": "Anastasia K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-08", "description": "Edamame was brown and too salty, they have an obsession with putting egg in all their sushi rolls, seaweed salad was not great, and positive side the green tea ice cream was great. All in all, we'll definitely not be going back", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-08", "description": "Hibino is one of the best Japanese restaurant I've tried in NYC and I'm very thankful it's right next to my neighborhood in Brooklyn. Quality never wavers here and the prices are completely affordable. The fish is always fresh and their daily changing obanzi menu always sound delicious. The rolls are pretty simple. Can't really find overly decked out maki rolls here but they do offer tasty pressed sushi and rolls with a variety of fish. They also have great sides like fresh homemade tofu, served with light soy sauce, ginger and scallions, and seasonal vegetables with a tofu dipping sauce.  My usuals are the miso soup, which comes with some kind of seasonal veggie; hamachi salad (the fish melts in your mouth!); a obanzi app.; spicy tuna; and the hibino sushi plate. Overall, Hibino serves clean and simple food that always taste fresh. Will go again and again and again...", "author": "Kim S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-06", "description": "The food here is ok, for a Japanese restaurant in Brooklyn.  But really if there was anywhere else to go, I would go there.  Its crowded, they don't take reservations, and its a total pain in the ass.", "author": "Joseph C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-17", "description": "Another one of the precious few \"Japanese\" restaurants in Brooklyn that are actually owned and operated by Japanese people, and Hibino is downright solid.\n\nThe homemade tofu -- awesome.\nBeef kakuni -- first of all, unusual to do this with beef, and second of all, really, really good.  A home run.\nAll of the obanzai dishes we've tried have been winners.\n\nOur only disappointment was the sushi.  The first time we tried it, they did not even use sushi rice (which is vinegared and sweetened).  It was just plain white rice, which not only did not taste like proper sushi, but did not hold together like proper sushi.  I don't know if they have rectified this problem or are continuing to make the sushi this way, but we have not tried it again.\n\nBut rest assured, all the other food at Hibino is top-notch.", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-04", "description": "i'm going to go big here and give 5.  I would say a solid 4, but the positive restaurant vibe and the fact that there is not much in the area makes me want to boost this place.  \n\nit was crowded, but my party of 3 fit at the bar.  we had delicious braised fish and daikon, some sushi (because I couldn't convince my friends to go completely without).  The dishes are tiny, but YUM.  the service was great.  \n\nTaste of JAPAN.  OISHI", "author": "Joanna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-27", "description": "i love hibino. it's fantastic... the best.\ni don't know why people here are put off by the price. it seem to me to be the best possible japanese at the typical manhattan/ gentrified brooklyn price.", "author": "jessica l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-19", "description": "Beautifully presented food and it's so, so delicious. I love the homemade tofu, the hamachi salad, the braised short ribs, and any of the daily obanzai specials. I chose Hibino after I had my baby and was able to eat sashimi again. It was unforgettable!", "author": "Yng-Ru C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "The salmon in miso sauce was astounding. The sushi wasn't all that, but the homemade tofu had a lovely, mellow, near-unguent texture. Pleasing place, especially in light of it bumping up against Brooklyn Heights, a neighborhood which serves double-duty as a buzz kill.", "author": "Delilah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-10", "description": "I went here as part of the Dine In Brooklyn--every course was excellent from the obanzai to the the red bean stuffed (fish-shaped) dessert. The jar of sake was a nice touch and my date kept the glass as a souvenier", "author": "Alex P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-30", "description": "While the atmosphere is cool and the menu has some pretty interesting selections, I wouldn't recommend coming for the sushi alone, or for the service.  \n\nWe got a teriyaki chicken dish which was really good and served with an authentic japanese style side, which was also good.  The sushi rolls however weren't very good.  I'd specifically recommend staying away from the spicy tuna roll since all it is, is a tuna roll with a little dot of spicy mayo on top and I don't know if the fish wasn't fresh or just not great quality but it just simply didn't taste good.\n\nThe service, rather our waitress, wasn't good either - at some point I had to get up to get some dishes myself.", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "I've always walked past this place on my way to Carroll Gardens.  One night, my bf and I stopped by for dinner.  It a very simple and minimal restaurant.  The homemade tofu is an absolute must. And service was just excellent.  It's a gem that has flown under the radar.  Definitely a restaurant you must try out.", "author": "waisum t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "The sushi was fresh and original. Japanese small plates were very generous and also creative. I recommend those. The fish pancake dessert was surprisingly good, even though it sounds quite bland.\n\nOnly drawback: very limited wine selection, and the restaurant doesn't allow any outside liquor (not even for a corkage fee).", "author": "Jane S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "I had a great time eating great food. However, due to the abundance of snobby patrons, the ambiance from the staff is distractingly saccharine. I would give 5 stars if lucky enough to eat there on a slow night.", "author": "Valentina D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-20", "description": "Oh, Hibino, Hibino. Is it the recession, or the comfort level that comes from success? But after many repeated visits to your lovely restaurant, you've killed this golden goose. I would have expected more from you at a $200.00 tab, you could at least be a little more generous with your $10.00 dollar a wine servings as two fingers worth of wine is better served in a scotch glass. Who are you saving it for, your next customer? Coupled with cocky uptight waitress service (no smiles please -- are you doing us a favor?) in this current economic climate it's not acceptable. Please avoid the front three tables. And tell them Seven sent you!", "author": "Sev D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-03", "description": "Hibino is the best Japanese in the neighborhood! Really fresh fish, reasonably priced, super nice employees and great specials. I would go every other day if I could!", "author": "Tinker B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-14", "description": "I really enjoy going here for their lunch special.  Far superior to any other in the area.  Love the salmon collar when they have it...", "author": "JJ G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-12", "description": "beef kakuni and spicy tuna! wowie! soooo good! hibino!", "author": "allison t."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}