{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-23", "description": "I'm Japanese, and this is my favorite sushi spot in New York! \n\nI always get the hibino sushi plate which comes with 7 pieces of sushi and a roll of your choice. (Eel + cucumber is my favorite. The spicy tuna roll has quite a bit of mayo on it so watch out if that's usually your go-to.) It's always remarkably fresh, with the perfect texture. \n\nThey have interesting appetizers, including a mixed seaweed salad and pickled vegetables. Usually I love both of these foods but I found the appetizers kind of hit-or-miss. I'd recommend forgoing and just sticking to edamame or miso soup. Their genmai-cha tea is on point, and their house sake is also the first sake I've tried that I actually enjoy!\n\nMake sure you come on a weeknight or be prepared to wait. The people running the bar next door is not very friendly (probably because they're used to overspill from Hibino?) but you may be able to pop over to Floyd on Atlantic for a bit of bocce while you wait for a call!", "author": "Maria L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-08", "description": "Stick with their obanzais. They have a great Japanese kitchen. Their obanzais update every day. You can check on their website. I like the obanzai menu at this location better than their Long Island location. Their cooked menu is alright. Stick with their beef kakuni and their soft homemade tofu. \n\n4 stars alone when their obanzai menu is good! \n\nHowever expect a really long wait... because so many people are ordering sushi to go. Like nearly an hour delay if you're dining alone.\n\nI used to come here often when I lived in the area. The service has slowed down tremendously.", "author": "Ms F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-21", "description": "A cute cozy Japanese restaurant! Nothing too exciting on the menu but food is actually quite decent. Don't mind coming back at all!", "author": "Chloe K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-19", "description": "The sushi was good but the miso salmon entree was amazing!!!!! The restaurant is always packed. Wish the service was quicker but understand it's so busy.", "author": "Mindy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "A lovely Japanese / sushi spot in Brooklyn that our cousin brought us to. We really enjoyed it and tried many dishes. All of them were amazing, my favorite being the tuna roll. The spot is a really cute dinner place. Not overly crowded and has a nice atmosphere.", "author": "Hannah P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-07", "description": "Unique flavors, good quality food, but uneven dining experience. \n\nHibino is tucked away in the corner of in an unassuming Brooklyn heights neighborhood and the interior is warm, welcoming. We came in late on a Sunday night and the place was crowded. The server told us we could wait outside where they have some chairs set up. Heads up for those sensitive to the cold. We took a few laps around the block and came back and were seated quickly. Unfortunately it then took 10 minutes to get water and 15 before a waitress came to our table (and the one next to ours) for the first time. It gets busy here and depending on when you're seated could mean a significant wait. \n\nWe ordered the beef kakuni appetizer, fresh made tofu, and two sushi rolls. The tofu here is really incredible! Firm but somehow delicate at the same time. The soy sauce and ginger that comes with it is a perfect flavor. This was my favorite dish and it comes in a beautiful jar. The beef kakuni appetizer was tender, flavorful but just so small! Really just a few bites. The sushi rolls were OK and probably not the right thing to order here. \n\nHibino is a lovely place with a unique style. But the price for value (I ended up having a second dinner) and inconsistency of service were notable as well", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-22", "description": "Excellent sushi. box pressed salmon is my favorite ! and the tofu is the best. The atmosphere leaves a bit to desired but the quality of the food can't be beat.", "author": "Lina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "A triumph. We return to this restaurant every couple of months and every meal has been exceptional. Don't think about it, just go here and get the home made tofu!", "author": "Eric L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "Hibino Sushi Plate all the way!  I have been going here for years and have loved everything I have had on the menu but that plate is the best for both the food and the deal. \nSushi is one of those types of food that is very difficult to find places to call home but this is it!", "author": "Sandro K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-08", "description": "Woweee wow! After a \"too Brooklyn for normal humans\" experience at grand army ...this heavenly place was an amazing respite.  One more amazing meal like this one and I'll bump it to 5 stars.  Efficient service ...stunning sushi ...and only a mildly annoying Brooklyn crowd.  Definite must go!", "author": "Gary L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "This place is always consistent, offers good value and is under the guidance of seasoned Japanese sushi chefs. I can't think of a better sushi restaurant in a 20 block radius! \n\nWe usually stick to the traditional roles but we usually try one of there ever changing special menu items. They rotate daily and offer unique, traditional (and not so traditional) Japanese starters. Each are delicious and great to share with others.\n\nGive this place a try; you won't be disappointed!!", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "I've always heard good things about Hibino and was finally able to stop in for dinner. If it's the weekend, prepare for a wait. It wasn't too bad for us, but we were also one of the last groups to be seated for the night (they close at 10 on weeknights and 10:30 on Friday/Saturday).\n\nTheir obanzai (Kyoto style tapas) menu is unique, with a changing selection on their blackboards. We ordered a soft-shell shrimp roll, and a lobster roll from the list. Didn't know soft-shell crab was a thing, but it was delicious, even with the heads on and their tiny dead eyes staring back at you. The lobster roll was good, but very typical of Americanized sushi (too much sauce!).\n\nWe ordered the yellowtail sashimi as well as tobiko (flying fish roe) from the sashimi menu (really just a small individual portion of roe). My friends who recently visited Japan definitely gave their seal of approval to the sashmi.\n\nWe also started out with two types of tofu. Their fresh made tofu is served in a tiny jar with dashi sauce on the side. Velvetty and delicious. And their shrimp toji maki (shrimp wrapped in tofu skin, similar to a common dim sum dish) was good too.\n\nThey have a ton of sake available at all price points, as well as beer.\n\nWould definitely come back!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "Hibino is one of my favorite restaurants in the area. The sushi is fantastic and at a great price point - the basic rolls are excellent, the Kyoto style futomaki is well worth trying, and the Hibino Sushi Plate makes for a solid meal. The daily obanzai have yet to disappoint, always offering something new to try. The service has also been consistently good. The only downside may be a bit of a wait if you come during peak dinner hours, however there are plenty of spots to grab a drink nearby.", "author": "Brent L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "This is a lovely little authentic Japanese restaurant serving traditional Japanese style tapas. The special menu serves various original creations of the day. The menu has a plethora of sushi from the standard maki rolls to more elaborate sushi rolls.\n\nThe restaurant is cozy you can see the chefs preparing your meal from your table. There is a bar as well where you can enjoy a more up close personal review of the chefs. Waitresses were attentive. Food was excellent! Def try the SABA!!", "author": "Tony J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Hibino is an excellent example of authentic, local Japanese restaurant, and if you happen to visit, you'll be very happy.\n\nI lived in Japan for 4 years and one thing that struck me when I came back to NYC was how stylized and American-ized Japanese restaurants are in the city. Actually, most of them are not run my actual Japanese people. So when coming to Hibino, you might get the idea that it isn't authentic because it's different from Japanese restaurants you've been too. However, nothing could be further from the truth. From the style, decor, and food, everything reminded me of a standard izakaya back in Japan. \n\nWe had the Agedashi Tofu, Tonkatsu and two sushi rolls. Everything was excellent, it's clear to see that Hibino uses fresh ingredients and prepares everything in house. The Tonkatsu reminded me exactly of the dish I had many a day in Japan and the sushi was simple and delicious, unlike some places that have rolls with 7-10 ingredients. The rolls at Hibino focus on making be fish the main flavor of the roll rather than some gimmicks.\n\nSo, should you go to Hibino? If you have some experience with authentic, local Japanese flare, then yes. If you are open to something new even though you've eaten Japanese before? Then absolutely! If you love those faux Japanese restaurants with rolls that have 7-20 ingredient and the menu is made up based on TV's version of what Japanese food is? Then maybe Hibino is not for you. But try it anyway!", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-28", "description": "A lot of Japanese restaurants aren't run by Japanese people. This one is, and it shows in the quality of the dishes. It's really authentic, and I say this not just having visited Japan on numerous occasions but on behalf of my Japanese wife. The sushi is delicious but the obanzai are something that set the menu apart here.", "author": "Rory C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "If I could give it zero stars I would. This place is absolutely terrible, I am ALMOST at a loss for words, but not enough to keep me from warning those who seek a good, even decent, meal. \n\nI've had my fair share of sushi, it being my favorite food, and I can genuinely say Hibino has been the worst sushi/Japanese restaurant I have (unfortunately) been to. \n\nFood is not good. My table ordered spicy tuna roll, salmon avocado roll, miso soup, seaweed salad, agadashi tofu, and chicken teriyaki. Seaweed salad was horrendous, sushi was WARM, a safety hazard and an unpleasant feeling. Warm sushi should NEVER be a thing. On top of that the tuna had an odd flavor. On top of that we were told we had to pay for sides of spicy mayo and eel sauce, which I have never had to do before. Sides of simple condiments not cheap either. Everything else was bland or just meh. Chicken in chicken teriyaki was rubbery, although the teriyaki sauce was decent. \n\nIf the food is bad, I tend to tip as I normally would with amazing food, since it's not the servers fault. In this case, the service was just as atrocious. \n\nNot only was my table waiting nearly 20 minutes after we sat down for the waiter to finally come around and take our order, it took twice as long for us to receive our checks, so long that my table got up to pay at the front. Took another 20 minutes just to swipe our cards. The worst part? The constant eyerolls given to us by our server, and the snarky looks and giggles shooted our way by the kitchen staff, host, other waiters (all just standing around), and what looked like a 9 year old. Does New York have a different age limit for how young you can start working? \n\nI don't mind spotty service if the restaurant is busy. Despite a few to-go orders I would hardly call the restaurant packed. You would think that with such a small number of customers the waitstaff would be at least a little attentive, at Hibino, the majority stood around and did absolutely nothing, or was simply downright rude. \n\nThe bathroom also smelled like cat litter.\n\nSave yourself the money and go anywhere else. Never again.", "author": "Stella Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "How can you not fall in love with Hibino?!\n\nIt's a secret neighborhood gem tucked between Henry and Pacific street in Brooklyn. This is my second visit here and it has not yet failed to impress.\n\nMy favorite is their lunch box, for $10 it included choices of entree for the day, mini Obanzai, soup, pickles and salad. While the daily specials are something to consider as well. I tried grilled pork sausage and tonkatsu Pork cutlet and both dishes are delicious and since it's an open kitchen, it is prepared right before our very eyes.\n\nWith their no frills and excellent customer service, this place is awesome for lunch during working days. I'm a fan!", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-04", "description": "Extremely poor customer service. Owner is uncaring. Uni sushi had turned. Pork katsu was half fat and inedible. This place USED to be good. Now I just have a bad taste in my mouth.", "author": "umami m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Perfect sushi, perfect prices. It's a cozy little spot that feels unpretentious and warm. It serves up INCREDIBLY fresh sushi - the best sushi I've had in the city in this price tier. Get the warm tofu, the beef appetizer everyone talks about, and split a bunch of roles. The market price toro is a standout.", "author": "Ellie J."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}