{"aggregateRating": {"reviewCount": 388, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "One of the best places for sushi in the neighborhood - very fresh fish, consistent high quality. Rotating daily obanzai specials keep things interesting. Their box-pressed rolls are unique, and their sushi rice is perfect. They have a variety of tofus, my favorite being the fresh homemade tofu which is soft and silky, and served in a small glass jar with a wooden spoon. The seaweed is also wonderful, and they give you a variety of 4 or 5 types in their salad. My favorite entrees are the sushi and sashimi plates, with the futomaki roll on the side - it's a huge roll, and 1000x better than a side of California roll!", "author": "Kailey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-16", "description": "Don't get me wrong, I love sushi. But I always welcome the chance to try a Japanese restaurant that's better known for other things. In the case of Hibino, it's homemade tofu and obanzai ($5 traditional small plates from Kyoto). \n\nWe ordered a bunch of little guys and had a tasting frenzy accompanied by various  bevvies and teas. Tried the warm fresh tofu, hamachi salad, beef kakuni, seaweed, and harusame noodles. Overall, I commend their efforts for clean presentation and unique (albeit slightly salty) sauces/dressings. The atmosphere was quiet and minimal but laid back, and the service was attentive. Bonus for always keeping the water glass full.\n\nDessert was a nice surprise. We weren't expecting it to be great, but we loved it--green tea \"ice cream sandwich,\" made with a homemade pancake-type outside and a layer of fresh fruit, as well as a red bean paste-filled waffle in the shape of a.....fish! Somebody find me that griddle!", "author": "Mia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "I came here on a Friday night for dinner and we waited about 20 minutes for a table. (Note that there's not much room to wait, either give them your number and try to find a bar nearby or don't come when there's bad weather.) \n\nThe space is pretty large and the tables are spaced far apart; I never felt cramped. For food, we had the breaded cod (one of the small plates for $5) and it was really nice, with a BBQ-style sauce. We also had the mixed greens salad, which came lightly dressed with a delicious carrot-ginger-miso dressing. Even the miso soup wasn't your standard miso; it had small bits of cauliflower, broccoli and mushrooms. For entree, we shared the sashimi plate ($24) and the quality of the fish blew me away. The salmon was fatty and luscious and the tuna literally melted in my mouth. We got a good variety of fish on the platter but I wish they had told us what everything was; I knew what 75% of the fish was but some was just mystery fish to me. Nevertheless, I'd get it again.\n\nOur dessert was the green tea ice cream, which came with two small scoops and a large macadamia nut. It was the perfect end to the meal, tasty and light. \n\nAll in all, we paid $49 + tip for a small plate, a salad, a soup, a sashimi entree and dessert. It was definitely pricier than a neighborhood sushi joint, but the quality was through the roof and absolutely worth it. Highly recommended!", "author": "Milena P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-05", "description": "Went there looking for an alternative to the few Japanese and even fewer Asian Fusion restaurants in the area .... kind of disappointed but it is ok.  Spartan surroundings and understaffed.  Menu was quite limited, the glasses looked dirty and the pricing was the same as nicer joints nearby.   Nothing special but it did have a decisively local feeling - kind of off the beaten path.", "author": "Carl E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "Generally, when it comes to sushi I go to the cheapest spot I can find that won't give me food poisoning.  So Hibino was a bit of a shock for me.  \n\nThe decor is great--stylish without being cold, and has a great cozy vibe, and the waitstaff are all friendly, if a little pushy.  \n\nI did not order any food because I had already eaten by the time I got the invite--whoops!  But I enjoyed my Sapporos and *almost* enjoyed watching everyone else enjoy their food.  Although the prices are a little high, it's probably worth it to get non-sketchy raw fish in such an appealing setting.  I'll be back, Hibino.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-07", "description": "Can Japanese food be delightful? Are puppies far superior to kittens? (The answer is yes for both questions... cats suck.)\n\nOn a blustery Friday night, I was given the task of finding great Japanese grub in Fort Greene (there isn't any) or Bed Stuy (yeah, whatever). I came to my senses after an ill-fated search and stumbled upon this gem  in Cobble Hill. \n\nI'll save you the long read and get to the goodies:\n\n- The Hostess\nOther than being generally lovely, she was able to provide me with an approximate wait time. Like to the minute approximate. Granted, it was only 20mins... From the looks of the crowd hovering the door upon my exit, getting there early is recommended.\n\n- Our Waitress\nShe was equally lovely. Her dedication to refilling our water and sake glasses was to be admired. We shared the background stories of our respective heart-wrist tattoos over one refill. Lovely.\n\n-The Food\nFirst of all, OMG NOM. Second of all, it's really good. Our nosh list:\n\nTuna Tataki Salad:\nLight and flavorful. Perfectly grilled tuna. Nuff' said.\n\nBeef Kakuni (Appetizer) :\nThe braised short rib was crazy good. Meat so tender, I had to take a moment to collect myself. The accompanying chunk of tofu was also tasty. And fresh! The nerve of this place...\n\nAnago Hako Sushi:\nAs I'm typing this review (three days after this meal, mind you), I'm just realizing that what I thought was Unagi was Anago... the mystery of why my friend would order two eel rolls has been solved.\n\nANYWAY, obviously, this roll didn't consist of just a slab o' egg on rice. The egg was shredded. And yummy. There you go.\n\nKyoto Style Futomaki:\nThis was definitely my favorite of the two rolls we ordered. Not overwhelming but perfectly flavorful. (I apologize for using flavorful twice in a single review.)\n\n*Side note the sushi was rolled in an open face style which I did not expect, but I didn't complain. So you know, whatevs. Also, portions are on the scant side. Don't go here if you're looking to leave stuffed out of your gourd.\n\nUltimately, if your Brooklyn-nabe has jack sh*t to offer in the decent Japanese food department, quit being lazy and travel a stop or two further to BoCoCa (UGH can we find and pillage the home of the weirdo who came up with that?? UGH.) Your tummy will thank you.", "author": "Rachael J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-25", "description": "Hibino is neat and adorable inside, with a cool open kitchen/sushi counter so you can watch them cook if you want.\n\nThe Kyoto-style small plates are a lovely idea. There were three small plate specials the night I went, and I wasn't in a meaty mood so I didn't opt for the short ribs. I wish I had. The other two were sweet potato and broccoli. Both were delicious, but prepared SO simply it was essentially exactly what I would've eaten at home. Not worth ordering if you're paying to eat out. I would advise ordering the small plates only if they are doing something cool with the ingredients.\n\nThat being said, everything was extremely fresh and the other dishes we ordered were fantastic!!\nThe fresh tofu was really cool- very soft and served in a cute little jar. You eat it with a mini spoon. Order this.\nThe seaweed salad was unlike anything I'd tried before- it contained ~5 varieties of seaweed, only one of which is the standard kind they serve at most sushi places. Order this too.\nThe pressed salmon roll (pressed into a rectangular shape) was also great. The salmon was so, so fresh and silky, seriously good fish here. \nToro- I tried my friend's toro roll and it was also amazing.\n\nI'd come back for the seaweed salad and the sushi; this fish is fresh and delightful at a really reasonable price. The service is fantastic and friendly.\n\nCome early or you'll wait in a line outside!", "author": "Emma G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "Excellent quality food and service. You can tell that they care about their food, presentation, and service. And they do not disappoint!\n\nYou can't go wrong with anything on the menu, but I highly recommend the fresh tofu to start. Healthy and delicious!", "author": "Qyli M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-09", "description": "Came here with a Japanese friend of mine and she killed it with this choice! I can not rave enough about how good the food I had here was! Started off with:\n\nAppetizer:\nWe had these dumplings that may have been a special of the day I think it was called Gyoza? Don't quote me on that name because I have next to no knowledge of Japanese language.\n\nFresh Made Tofu with Grated Ginger and Scallions \u0026 Soy-Dashi Sauce served cold - I was very surprised I enjoyed this because I have always had an aversion to Tofu.\n\nSuhi \u0026 Sashimi Eel or Anago - Don't remember which it was but it literally melts on your tongue\n\nEntree:\nSalmon Miso Zuke - Broiled Miso-marinated Salmon with Seasonal Vegetables. This was the best part of the meal in my opinion and kind of was our dessert. It was the best salmon I have ever had and even if you don't agree try it because you will definitely enjoy it.\n\nOverall the food was unbelievable and I think anyone should try it out. Service was typical for normal restaurants so nothing to complain which is always good!", "author": "Orpheus N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-01", "description": "Several people I trust have called Hibino one of the best Japanese spots in the city, and so I came in with high expectations for my meal. This is never a good thing. I was particularly eager to try the Beef Kakuni; it has been widely praised, and let's be honest, Kakuni? That sounds awesome. I'm naming my kid Kakuni. \n\nHibino is located on a quiet corner, decorated sparingly, and the menu changes daily...all about the food. As it should be. They offer numerous small plates (obanzai) at a good price ($4), and the entrees can be ordered a la carte, or as a set (including rice, soup and the chef's choice of obanzai).\n\nOur scarily smiley waitress (I was terrified when she asked me why I was so serious) brought us a little chalkboard listing the day's obanzai. I liked the sound of two: fried horse mackerel with a nice sauce, and shitake mushrooms and asparagus with a garlic chutney of some sort. We also ordered the Beef Kakuni set, and since my date felt like sushi: a spicy tuna roll and a shrimp tempura roll.\n\nThe two obanzai and my miso soup arrived first. All three were tasty, but sadly, I felt as though I could've made either obanzai without much trouble. I tried not to be disappointed, and I just geared up for my Beef Kakuni.\n\nMuch to my dismay, it was REALLY fatty. (Now I fear Kakuni D. will be the posterboy for childhood obesity.) The sweet soy broth was nice, and it was laid over homemade tofu which wasn't bad at all. If I loved tofu, I'm sure I would've deemed it heavenly. My accompanying obanzai was a salmon and chive omelette, but it unfortunately tasted more like a bland quiche. Her sushi rolls were just decent, standard. No more, no less. \n\nIt's not you Hibino, it's me. At least I think it is.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "fresh tofu in the hizzouseeeeeeeeeeeeeeeeeeeeeee\ndamn that tofu is good with that sweet braised beef...... bit sweet for my palette. \nnever fond of teriyaki anything but organic chicken is slammingly good.\nthis place is FRESH to death\nno reservations, but the wait is only appox 20 min.", "author": "Davina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "My first time there as friends took me.  Love the Kyoto-style food.  I've spend time in that city, so it was thrilling to find a place whose kitchen had a point of difference from the other cookie-cutter kitchen menu.\n\nMy friend loves their chirashi. I didn't have sushi, so I cannot comment, but by his comments at the table, it was quite good.\n\nI'd definitely go back!", "author": "Jeffrey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "There's tofu then there's tofu.  What Hibino serves is the latter.\n\nI eat tofu from time to time mostly when making stir-fry at home.  The homemade tofu served at Hibino is something truly amazing to experience.  My favorite had to be the tofu (no idea what it's called sorry) served in a small container with sesame oil and chives on the side. It was outstanding!\n\nThe sushi was good but not amazing.  Other dishes were really spot on and worth a try.", "author": "Anju R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-09", "description": "July 2013 update:\n*This should be a 2.5 star review, but we don't have that option.\nSadly, Hibino's head chef has left, and apparently taken much of the staff with him. What remains behind is a pretty decent restaurant, but without the sparks of brilliance and relentless attention to quality that were Hibino's hallmark. The obanzai, which were always bold and interesting if occasionally unsuccessful, are now uniformly mediocre and dull. The sushi is still OK, but never rises beyond that. Service which was previously graceful, competent and efficient is now rushed and slightly hysterical - but then the entire serving crew is new. I don't think they'll suffer much - they were packed to the gills on a recent Monday night, and there still aren't any better options nearby. But going to Hibino was once an adventure. Now it's just a meal.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-11", "description": "Sushi and sashimi pretty good. Very disappointed edamame is from a frozen packet and was completely shocked to\nsee they microwave a lot of their dishes (e.g. Short rib app and edamame etc.) after asking the waitress why my food was microwaved she said \"we are a casual restaurant!\"  Well first of all the $$$ is def NOT casual and no restaurant food should be microwaved! Oh FYI decor sucks, music is cool! Beware of the phony reviews.", "author": "Ava B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "I stopped by with a friend early on a Friday night. We didn't have many expectations, but between the two of us, we like Japanese food and she loves tofu, so what could go wrong, right?\n\nVery little. Let's get a few things out of the way first: GET THE TOFU. Not the first person to say it, won't be the last. It comes presented adorably, almost like pudding, and was absolutely smooth and delicious. A small container of shoyu and a cup of chopped negi come with the tofu, so you can add as much or as little sauce and onions as you like. The obanzai of the day included potato croquettes, which were fried to a light and delicious crispness, with none of the greasy oily feeling you'd expect, and I don't doubt that the rest of the obanzai are just as good.\n\nI have also fallen in love with the umeshu. Muromachi Shuzo only sells it to people in the industry (i.e., restaurants), but for $8 a glass and I think $33 for the bottle, it is a delicious steal here. It's sweet and light and a great accompaniment to all the dishes we tried.\n\nThings started to go a little wrong from here because I decided to get sushi. I adore tamago and usually order at least one piece whenever it's available. Unfortunately, it came looking like plastic, and tasted like it too. Also listed on the chalkboard as one of the day's specials was a soft-shell crab roll, which, while fried nicely, didn't have as much flavor as I'd have liked. This may have been my mistake for ordering sushi, since other Yelpers love the non-sushi food, and I'll still give them props for a beautiful presentation though.\n\nMy friend on the other hand ordered the grilled salmon and adored it, which is another point for them. The service was nice and efficient, and they had no problems switching between one person ordering in Japanese and the other in English. We'll definitely be coming back to try more of the menu, but perhaps next time, without the sushi.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "I have lived in the Cobble Hill area for the past decade and Hibino is hands down the best Japanese restaurant. Amazing staff and food! Now all of my Manhattan friends want to come out to Brooklyn just to eat at Hibino!", "author": "Liza F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "Thanks to some careful yelping prior to my maiden voyage to Cobble Hill last night, Sunshine and I ate well at Hibino. \n\nWe sampled widely: Japanese potato salad, sunomono salad (two of the three obanzai* on offer), hirosu (fried tofu in broth), hamachi salad, spicy tuna salad and green tea ice cream for dessert. \n\nThe potato salad was an incredible standout among a meal where all of the dishes were good. It was creamy, though not the result of mayonnaise, and studded with carrots, corn, sugar snap peas and had an addictive savory Tonkatsu-like sauce atop it.\n\nCrazily, this feast for two cost us only $38 prior to tip!\nI can't wait to go back to Hibino!\n\n*daily special side dishes", "author": "Miriam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "Thank you, Hibino. Thank you for providing top-knotch Japanese food (can't believe you have hako sushi!) at very reasonable prices.  I so needed that. You were so worth the drive from Connecticut.", "author": "Mochi N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "Awesome find. I'm never in this neck of the woods and probably wouldn't have known about Hibino if a friend who lives in the area hadn't suggested it, but I said a little prayer and took an MTA adventure to see what this place is all about.\n\nFirst of all: You get the fresh homemade tofu. You get it and you eat it. You do that now.\n\nI got the Anago Hako sushi. If you like eel, it's a great choice. My company got the Hibino Sashimi plate. I've never really experimented with sashimi much, but I snatched a couple of pieces and everything was simple and lovely. We also got a few pieces of tobiko and eel sushi, equally satisfying. \n\nService was pleasant and the atmosphere is simple, cozy. Great for a date, probably not ideal for big groups (though there were a few sets of four here and there during the course of our meal). If I lived close enough I'd probably even come here solo to eat at the bar and take a gander at how everything's made behind the counter. If you're in the area, go. If you're not, well, go anyway--even if it's just once.", "author": "Samantha C."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Hibino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "333 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnQFG9rXkzx_yOtGuBi-FQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182608052"}