{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "OMGGGG THIS PLACE IS AMAZING IM WRITING IN CAPITAL BECAUSE THIS IS HOW EXCITED I'AM TO GIVE THIS MARKET SUCH AN AMAZING REVIEW!!!!!!!!!! LOL\nI came here after seeing Avengers with my little brother at Alamo and we were in food heaven we had to walk around twice before we made up our minds we ended up getting the korean bbq wings which were amazing!! We also tried the empanada which was okay and our main favorite was the blueberry cheesecake churro icecream sandwhich it was like heaven...the churro was warm and the icecream melted perfectly inside. The vibe was awesome can't wait to come back and try other vendors.", "author": "Zenda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Why is Dekalb Market a shining 5 star instead of a 4? Because I just came from Chelsea Market!\n\nYes, if you're annoyed of super crowded places with no seats like Chelsea Market then Dekalb Market Hall is a tremendous leap forward from its Manhattan cousin. Way more seats and way less crowded than Chelsea Market. Both markets have a wide array of extremely delicious food options, but the comfort of finding a seat and eating your food without feeling rushed or bothered is a major one up in my book. I had a Katz Pastrami sandwich, which by the way, was not crowded like the original Katz location. The pastrami was extra juicy that day which resulted in my eyes rolling back with joy.\n\nIf you're into great food without feeling squished or running into someone's back then Dekalb is the place for you.", "author": "Cham K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Wow this place is awesome for variety, seating, and prices. I recently started working in Brooklyn and am fortunate to have this food hall nearby. \n\nThere's Arepas, Jerk Chicken, Noodles, and Korean beef bowls. PRices seem pretty reasonable compared to Manhattan, which is what I\"m used to and the variety is excellent. \n\nSome famous names that I've heard of include Katz's (of course), Bunker and Ample Hills Creamery. The jerk chicken place is by far my favorite.\n\nGive the place a try - it's excellent.", "author": "Eddie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "Have visited this food hall several times with colleagues, friends and partner.  Every time I try a different food vendor to open up my horizons and see which ones fancy me best.\n\nThe last time visiting the food market, we decided to try the impossible burger from BK Jani, it has mint chutney which gives it an indian flare, along with the masala fries which packed some heat and spice.\n\nWe downed the burger and fries with beer from Craft and Carry.  It was a light beer, unfortunately, i did not purchase it and don't recall the name, but next time i visit the hall i'll make sure to grab a cupful of it.\n\nThe vibe in the market is subtetly buzzing, most communal tables are usually packed as well as the dine-in restaurants on site.  There are several round tables that seat 2-4 people and stand-up stalls where you can get your grub-on while standing.\n\nThis market is probably the biggest one in the 5-boroughs with many options to choose from, along with a supermarket (Trader Joes) on the market level.\n\nOverall great place, bathrooms are kept clean and security is doing a great job ensuring everyone is safe while munching.\n\nLook forward to visiting soon.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-07", "description": "These type of food halls have sprouted all over the place and some are better than others. I would say Dekalb is one of the better ones out there. The food options are really diverse and well prepared. You can indulge in a nutella filled churro at Dulcinea, eat fresh seafood at Fulton Landing or stay healthy with a quinoa bowl from Two Tablespoons. Definitely can't go wrong with a hand roll at Daigo handroll bar or a few scoops of ice cream from the Ample Hills counter. The vendors here are truly varied and high quality. Your biggest problem will be making a decision on what to eat. Your second problem will be finding seats as those are somewhat limited.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "One of my favorite places to bring friends and family who are visiting for a quick lunch/dinner. In this spacious food hall, you can get tasty foods of all kinds. It has food of all kinds, so no picky eaters allowed.\n\nI like to get bites from everywhere. First, grab a hand roll from the sushi spot. Stand there and eat it. That's your app. Then I like to grab a Jamaican beef patty, some dumplings and maybe a beer. Last night I had a doner kebab - that place is amazing. Great bread-get the #1.\n\nIt's right near the Trader Joe's, and below Target and the Alamo Drafthouse movie theater. Oh AND it's the same building as the the Q,R,B trains. Super convenient!", "author": "Mary A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-01", "description": "What a great concept - you can tell that a lot of planning and curation went into this food hall. Craving any type of food? Chances are you'll find it here. It's kind of unbelievable the amount of variety they've been able to achieve - paella, Katz deli, arepas, jian bing, hand rolls, tacos, burgers, sandwiches, ample hills ice cream, seafood, fresh juice, key lime pie, - the list goes on. \n\nNow, that doesn't mean that everything here is he best food I've ever had. I come here for lunch and I'm trying something new each time. I'll keep updating this review with more content as I try more things. \n\nWiki wiki - Hawaiian \"inspired\" is what I would call it. I'm very sad that they stopped selling the BBQ beef - there's nothing more Hawaiian than Hawaiian BBQ beef with Mac salad. However, the bibimbap (actually a Korean dish) is surprisingly quite good here! \n\nPaella shack - the Negra bowl is the way to go. They give you a good amount of seafood and the squid ink rice is tasty. However, I would like to see more depth of flavor - more spices. \n\nDaigo hand roll - excellent. Definitely pricey, but good quality. You need about 3 rolls for a decent meal. I'd like to see them start offering a 3 roll lunch special.\n\nDekalb taco - too expensive for what you get. No modifications allowed. \n\nBerliner kebab - 5 stars. My go-to when I'm craving something filling and delicious. I don't know how they get the chicken so tender and tasty.\n\nBK jani - not bad if you're a fan of masala flavors. If you like hearty meat then you'll like this place.\n\nAmple hills creamery - wow wow wow. It's so good I think I may even come in the winter. \n\nBread \u0026 spread: get the porchetta, period. If you like a leaner cut (like me) they're more than happy to accommodate. It is absolutely delicious. - unfortunately this place CLOSED. Why??", "author": "Kathryn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Very lovely place! Its full with people and most importantly full with different food options! From different types of pickles to Jamaican food! Everything is literally here! I'll definitely be coming back to visit! It's like a mini Smorgasburg ! This place is amazing.\n\nI do wish that it was more seats! This is a fast-paced environment with a lot of people... it could be annoying! But that is Brooklyn for you! Welcome :)", "author": "Elaine F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "Ample hills creamery: The ice cream is always good! Surprising flavors, but very creative and always delicious. I've always meant to try the midtown location but happen to never be in the area, and since Dekalb is one of my favorite food halls in the city, I always find myself there with visiting friends so it's very convenient that they opened up a branch there! Solid ice cream spot in Dekalb. Would recommend their special flavors, they do rotate and are often very good.\n\nBrooklyn Juicer: We'd had a heavy food day the previous day, and were looking for smoothies/detox fruit juice options. We decided to split one of the fruit smoothies (~$9... NYC, man). Don't remember what it was called, but it was a delicious mix of acai, bananas, almond milk, plant protein... the list goes on. It looked and tasted healthy, although it turned out to be this interesting dark green blue color that didn't look appetizing, but was honestly very good. Definitely a treat yourself kind of smoothie!", "author": "Carol L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "Dekalb Market Hall is a newer contender in the food hall game, but it sure brings it's A game. The market is located in Brooklyn in the basement area of a larger building that also will contains a Target, Alamo Drafthouse, Trader Joe's, and soon a floor with shops. \n\nThe market boasts having 40+ vendors, featuring everything from restaurants, food stalls and stalls to grab some wine and beer. They are open every day of the week, so you can either come to grab a bite during the week for lunch or come and enjoy a night out (like my husband and I did) over the weekend. \n\nThe market was busy when we popped in on Saturday night but not overly busy. Despite this, I was surprised to see how little the venue offered in terms of seating. It felt like they could add a lot more tables to some sections. After wandering to check out all the selections and much debate, because everything looked good, we went with Pierogi Boys and followed up with Eight Turn Crepe for dessert. \n\nMy husband grabbed a beer at the craft beer stall and I got a frose at the Brooklyn Wine cellar. We loved that we could wander around within the market with our cocktails. \n\nWe definitely made the most out of checking out as many food options as we could, but we are already planning our next trip to try more!\n\nNote: I will write separate reviews for actual food stalls since this was only about the market itself and my overall experience.", "author": "Denay W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-31", "description": "This is a very nice space but every single thing is overpriced, it's bizarre. I like that there's a Trader Joe's in the building and also that it's a one stop shop for a variety of foods.", "author": "Marley M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Pretty cool! \nLove the layout and the vendors. Everything is pretty pricey ($8-18) Some stalls give a 10-15% student discount. Hope you kept your student ID. We stopped at Bread and Spread and had a Cast Iron Chicken Caprese sandwich. Chicken breast, balsamic reduction (delicious and sweet), basil, tomato, mozzarella. Large sandwich, pretty satisfying. Got a 15% student discount. ($10 and some change after).", "author": "Nathalie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "What a welcoming, uncrowded atmosphere at this market. You can grab a bite of a million different cuisines in one charming area. Such fun. \n\nGot an arepa from the Arepa Lady and the borscht soup from the Pierogis stand. Both were really good, creamy and comforting - likely four stars - but the environment is so relaxing, it bumps it up to five. Also got the squid ink paella at Paella Shack. Amazing! Tons of shrimp, calamari and mussels in this deliciously flavorful squid ink rice with snap peas and peppers. \n\nMet this really nice guy Josh at the Fletcher's BBQ stand who is a regular there. He raved about, so I'll definitely be going back to try this and more! \n\n5 stars!!!!!", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "I LOVE bringing friends here--whether they are visiting from out of town, or looking for a local spot to hang. The variety is almost overwhelming, and everything I've ever tried here is good. Excellent variety of food types, menu options, price points and flavor profiles. There's something for everyone here!", "author": "Alison B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "This place has it all from Trader Joe's, movie theater and food from all over the world!! Great date spot and cool hang out.", "author": "Pamella D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-21", "description": "The prices are too high\nThe dishes are too meager.\nThe seating is the most uncomfortable\nSound:  all hard surfaces - so it's extremely loud\n     Most Food Courts have ways of dissipating sound - not here.  It's worse than a bus station\n     The restaurants there should complain to the landlord.\nThe Chinese restaurant doesn't have any dishes without hot peppers.\n\nThe only good place to eat down there is at Fortina's.", "author": "Local And World T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-26", "description": "Ok, so i've tried several things in Dekalb Market Hall. Overall, the selections are solid, but i still feel everything is $2 too much. Paying 10-15 for lunch is a bit much. You wont be disappointed by what you order, but it's still expensive for what it is. Also, the drinks are too expensive general. I could go to a local bar and have the drinks cost $2-3 less.", "author": "Tito V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Make your way to Brooklyn for the best food hall experience ever! This beats the food halls in NYC. It has all your favorites plus more.\n\nThere's plenty of seating space available compared to the others for sure. And you can even bring your picky eaters because there is so much to choose from! \n\nI went with a group of about 8 people. We were determined to try it all (or as much as we could). We started off with the pierogi sampler, arepas, and Katz deli's famous corn beef and pastrami on rye. We tried the taco shop, handmade Chinese noodle soup, the apple cider donuts, the crepe ice cream, chicken roti.....probably 4-6 other things too but I can't remember all the names of the places. But no worries cause you can pick anything and it will be good! We probably tried everything amongst the 8 of us except for maybe 5 of the food stalls in there. \n\nGo hungry and you'll def leave satisfied!", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Really love this concept!\nIt's a great place to go if you're feeling indecisive or wth a big group that's all craving something different but you still want to eat together.  You can grab a beer or a wine and choose from the huge selection of foods and snacks-all or most are local restaurants that have set up this satellite location and they have something for pretty much every mood or palate.  They even have pies, candies and ice cream if you're looking for something sweet.  And it's all indoors-which is great when the weather is extremely cold and snowy (like today) or hot and humid.  I probably come here way too much.  But it's just so convenient and tasty!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-23", "description": "This is the food hall that Chelsea Market wishes it could be. So many great vendors. I've come here loads of times and keep coming back for more. Plus there's a Trader Joe's on the same floor! The places that stand out to me are Doner Kebab, Katz, Bunsmith, Guss' Pickles, Ample Hills Creamery, and Likkle More Jerk. You can probably skip Hana Noodle Station, not as impressive. Seating can be hard to find during the weekend so it may not be the best place to take a large group.", "author": "Angela G."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}