{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "4.5 stars: AMAZING experience at Dekalb Market Hall. I had seen videos and pictures on social media, but it blew me away. The options, and the variety- so overstimulating. I originally only went to get some Ample Hill ice cream, but ended up getting lunch and atoo. The Jienbing I had was perfectly spicy, and flavorful, and you really get your money's worth. The only thing is I wish they had more seating.", "author": "Meghan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-10", "description": "Overpriced as expected. Had the tacos and the meat ratio was very small. However, Ample hills creamery never disappoints!", "author": "Jesseca T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "A place that has Target + Alamo Drafthouse + TRADER JOE'S + Awesome Food Court =Next Go To Spot which is this place. I love the food court because they have amazing offerings and a good variety. Having Trader Joe's there is convenient for me cuz it's closer to mass transit. I love me some Target. Only thing is that is not fully stocked as the other locations. I know it's only one floor but still. Alamo Drafthouse is my first foray into movie theater experience in the higher end and I'm a fan. Love this place.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "My friend and I went to Steve's Key Lime and not only was it delicious, but our server Jayda was awesome! Would definitely go back just to talk to her and get another frozen key lime tart!", "author": "Olivia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Awesome.little.place, it's like a Chelsea market with more food options and minus the tourist, yes they have some but not overrun by them.  I tried a few places and will have to go back to try some more. The upstairs is pretty cool with a movie theater, a nice bar and it's very own target.  Very nice addition to the area.", "author": "Samir S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "Okay, this is one of the better food halls.  It has some iconic New York eateries like Katz's Deli, Steves Key Lime and some newcomers like Wiki Wiki, Bunker etc.  All in all there is a good variety but there needs to be more seating.  We got seating in the middle of the day on a weekday but I got see how it would be a problem on the weekend.  I tried the poke bowl at Wiki Wiki and it was a good size portion.  It didn't have any ogo as advertised but the amount of ahi tuna made up for it.  The rice was slightly underdone but for $14 which is $2-3 more than elsewhere, the quality warranted it.  I like the fact that there was Aloha Maid Pass-O-Guava to round out the meal.  My bf opted for pastrami sandwich at Katz and we both went away with happy tummies.  The crowd is mixed, ranging from local workers to Brooklyn residents, tourists and Metro Tech bankers.  With all these good eateries under one roof, folks around here won't need a reason to cross the bridge.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "I went to dekalb market a couple weeks after it opened and was pretty excited to see all the great offerings. My favorite were the key lime pie and the spicy noodle soup, loved watching the employee hand pull the noodles in the kitchen, they were chewy and fresh.\n\nWill likely go back to try more places when in the area \n\n\nWe went right before the lunch rush so we didn't have to wait that long and we're able to fix seating, but by the time we left it was packed", "author": "Sarah N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-21", "description": "This is a loud, expensive, bougie tourist trap adjacent to a Trader Joe's. None of the food is particularly good, and none of it is worth the prices they are charging.", "author": "Ian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "When my mother visits from Pakistan she always wants me to take her for her first meal to the BK Jani's in Dekalb Market Hall. She likes the chops, I like the burger, we both like the masala fries.\n\nAnd the vegetarian Impossible burger is by far the best vegetarian burger I have ever had.", "author": "Ali H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Walking in, it's an abyss of choices, very inviting though. Not like times Square or any nyc public spot. \n\nOwners will greet you. The food will delight you. If there's one thing to try. I say all of them! \n\nI felt I could stay there forever but my belly only holds so much. Taking it home? Nah. I'll be back!", "author": "Jeremy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "Watched this place being built for 2 years now. Finally it's here! A good neighborhood destination  but I'm sure my rent is going up again soon. Food options and grocery shopping just got more awesome. Prices are high for what you get. Some vendors are lackluster. I'm almost half way trying, so far I'm digging the hand pulled noodles, key lime pie and Katz. Avoid Trader Joe's on weekdays after work. Believe it or not, weekends are better.", "author": "Pam W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "This food hall opened in June 2017 in the basement of City Center in Brooklyn where there is also a Target and Trader Joe's. The food hall has a huge variety of local favorite vendors including Katz Deli. We we had an arepa con quest @ Arepa Lady ($5.50), pulled pork sandwich @ Fletcher's BBQ, ($9), Hawaiian poke @ Wiki Wiki ($11), and a couple of Japanese dessert crepes @ Eight Turn Crepe. The arepas were heavenly, the BBQ very good with a generous portion of meat, and poke very good. We would not return to the crepe place. But that is the beauty of this place, with over 40 vendors you can try different ones every time. It is all counter service, but ordering and service is quick. They have bars and tables around but not enough for this busy place, so plan on eating standing up. I recommend it for a quick meal. A few places are open for breakfast but most are lunch/dinner only.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-09", "description": "Lots of choices but nothing is outstanding. And everything costs $2-4 more than it should. For example, pierogis start at 6 for $12, and doner kebabs are $9.75. If the food was terrific, the prices would be justified, but nothing that I've tried is better than OK. Also not enough seating is provided.", "author": "Murray S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Brooklyn just got a little better. You can travel the world through this hall. The food selection is amazing. Will definitely be frequenting this place. The only bad thing is that the A.C. is too high and sometimes it can be hard to find seating otherwise this place hits it out the park. I just wish this place was here when I was going to college nearby.", "author": "Edith C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "A foodie paradise but hell as well. Paradise because of the massive selections and hell because well I wanted to eat at every single vendor. We walked around 3/4 times bc I just couldn't decide. \n\nHandroll sushi at Daigo was YUM!!!!\n\nJamaican Oxtail Stew from Likkle Jerk something was also very YUM!", "author": "Quyen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "The environment was really cute! I went to try Katz deli I got the combo of brisket \u0026 pastrami it was so good. It was $24 and a few cents. Pretty damn pricey but it was worth a try. I was shocked with how much meat they gave me cause you know some shops are cheap with their meats. My boyfriend got the tacos from some other shop two small ass tacos for 8.50, he said they were good though but didn't fill him up. And I also went to ample hill creamery and got a pistachio square large ice cream came up to $7 overall it was pretty good, pricey as I can say but it was all worth it. I will come back to try more of the other shops that were in there.", "author": "Mickie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "This place is solid. I've eaten at 4 different stalls so far. 2 were great, 1 was good, 1 was ehh. The place looks as cool as a basement can look with an industrial design. Its very clean maybe because its new, maybe because its well maintained. This is one of those places where its really hard to go wrong but not guaranteed to be a home run. My biggest concern is the lack of seating. Two of my four visits resulted in me not really having a place to eat, the other two were fine. \n\nId suggest you do you research and pick out which stall you want to visit before you go so you won't get overwhelmed by the selection. Also, especially if you're there with a friend, work together to get seats, because its tight.", "author": "Jeffrey T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "Pretty cool place to check out especially for lunch time. They have some fun creative foods and they sound interesting on paper and in photos but tastes mediocre. Also expect the average price range of one food item to be around $10-$15", "author": "Jane L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "It's hectic- but there are some cute kiosk there.  The churro ice cream sandwich-delicious!  There is a beer with tea also delicious- sounds like it wouldn't be but my description isn't doing it justice.  Beef patty and coco bread- basic like I like.  I would recommend checking it out.  If you can avoid typical lunch times on weekdays do.  Lots of suits taking up lines and tables.", "author": "Bran F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Been here a couple times, and overall it's been a good experience. Food stalls tried so far:\n\nBunker - Good Chicken Pho, authentic hand torn chicken, solid and heavy stock, no take-away for pho. $16+. \n\nAmple Hill Creamery - Excellent, airy and springy ice cream, could have done without the excessive cookies folded into it. A bit too sweet for my tastes. Service is friendly. $5 for 2 scoops small cup size.\n\nHana Noodles - Cold chicken noodles and boba tea, they were good, uh.. until they weren't. Suspect, because 30 mins later, I got a gut buster emergency. It was like an evil storm brewing in my intestinal track, I barely made it, if you know what I mean. Probably, too traumatized to ever eat at this stall again. Like I said, it was good, until it wasn't. Probably safer to get hot items only here. $, I forgot, the trauma wiped out my memory.\n\nSteve's Key Lime Pies - Meh, my small tin pie smelled funny. Graham cracker crust, very grainy texture. I was expecting this to be phenomenal, considering it's the only item on the menu. $4+. I love Key Lime Pie, but these pies are not for me.\n\nWill try other stalls, this review will be updated. So far, the second visit was better than the first. Nice atmosphere even during off peak hours, but a bit stuffy with all the kitchens going, on a hot summer day.\n\nOverall, I enjoy it when the place is not busy, during off peak hours, but then the shop owners/service is pretty rough, considering everyone looks so tired behind the counter, after their rushes. These people all seem either a little bored or really burnt out, too bad and this place just opened. Where's the stamina?", "author": "J C."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}