{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "I'm a fan of what I lovingly call \"The Market.\"  It's super convenient (for me) so I always suggest this as a hang-out spot.  Almost everything I've had here has been delicious (and a bit overpriced), with my favorite being arepas from Arepa Lady.  The only disappointing items were the baked empanadas from Dulcinea (should have known from the name to stick with dulces) and meh dumplings from Hana Noodles.  Haven't tried everything, yet.  Seats are hard to find; I've often spotted a loner taking up a whole table looking emo staring into his bowl.  For larger groups, this might be a problem.  Be prepared to fight over communal seating and no privacy, unless you eat at Fortina or Han Dynasty which are restaurants on the outskirts of \"The Market\" and too fancy to be lumped in with all the vendors.  I'd suggest visiting on a weeknight as the weekends are WILD considering Trader Joe's and Target are in the same building.", "author": "Chelle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Fantastic fantastic fantastic. The hall is beautiful, although it needs more seating. I've eaten twice at Bread \u0026 Spread and the sandwiches were both so unbelievably good. This hall was much needed in the area and I wish it was closer to my home.", "author": "Amanda A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "so many options, it's great. you'll definitely find something (probably MANY things) that you'll enjoy. I have already been back twice and keep trying to find others to recruit and go back with them.", "author": "Kayla W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "One of the few food halls that can satisfy whatever you are craving. All different delicacies around the entire hall. Can't go wrong at any of them.", "author": "King K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Beautiful space, clean bathrooms, excellent range of restaurants and shops. Good option when you eat with a bunch of picky eaters.", "author": "Brianne S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-16", "description": "Handful of vendors are really good - especially Daigo, Nobletree. A lot of them are very meh. And expensive!", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Came in to visit my family from out of town and we decided to check out Dekalb Market Hall. Very cool spot with lots of great food.  I loved the choices with quite of places I have never heard of and some types of food I was not familiar with. My kids wanted burgers which they liked but for some reason the name of the place escapes me. I decided to try a Japanese crepe from eight turn crepe since I've never heard of a Japanese crepe and it did not disappoint. I got the pork belly one and it was awesome, absolutely loved it.  After that we decided to go back for desert crepes for the kids and they loved the Nutella crepes.  Highly recommend checking out Dekalb Market Hall!", "author": "Albert A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "Was in town for a day and met a friend here for dinner. Lots of nice options. We sampled a bit from each place and really enjoyed ourselves. \n\nIt would be nice to have better seating, but it may be that this is more of a take out place for folks. Not cheap, but portions were reasonable at most stalls. \n\nThe cheese shop was a nice surprise and the owner is behind the counter to give advice and talk cheese options. \n\nGo with some friends as you will want to try all of the stalls!", "author": "Jeanne C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "The wait felt like forever but it finally opened. Tried three different places\n\n1. Daigo Handroll bar-really awesome. Had the scallop roll, crab and avocado and salmon. Very fresh and nicely made. I'll frequent this place many more times\n2. Fletchers-they were out of everything except wings. Wings weren't bad but not spicy/crispy enough. Next time I'm planning on trying the ribs. \n3. Two Tablespoons-nice healthy bowl. They were pretty much out of everything too. Would be nice if they can offer gf noodles.\n\nAdditional thoughts:\n1. Not enough seating to eat and hang with friends\n2. Vendors are a little tightly packed together, so going down a lane can feel rather tight when it's crowded and can feel chaotic.\n3. Not enough healthy options and too many sandwich vendors\n\nOverall great edition and looking forward to trying the other food vendors.", "author": "Curly S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "You were as amazing as I thought you'd be... Dekalb Market Hall is a wonderful treat.  Katz's Deli is definitely the big draw, but they have pretty much the best of every genre of food here.  Sushi, ice cream, sandwiches, arepas (if you don't know, go eat this now), seafood, etc. etc.  They made a point to get 4-5 star spots all over the city to represent each food category.  So why do you ask I am giving it only 4 stars.  The seating.  Or rather, the lack of seating.  If you're here by yourself, or with one additional friend, you can squeeze by and find half a bench to sit on.  Do NOT come here on a date.  You'll be looking for a place to sit, standing on long lines, and crammed next to other people if/when you do find a seat.  One additional plus is there is no cell reception down in the food hall (in the basement), which means people will be talking and looking at each other and not on phone calls, texting, or instagramming.  Enjoy!", "author": "Brad M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-24", "description": "very happy when the market hall opened as its right across the street from my job and provides a great deal of variety and different options for lunch.  some are pretty pricey but the food is very good.  also located there is trader joes where you can get a variety or organic and ready to eat salads, wraps and even sushi for a great price.   a must try when you are in the downtown brooklyn area.", "author": "Gloria R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "So good, really unique and tasty food hall with an authentic Brooklyn vibe. My favorite is the Giardino sandwich from the sandwich place I'm trying to remember the name I think it's bread and spread, it's delicious I get it all the time and the people are so nice!", "author": "Leah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "This place is great!First of all, it's near a dozen places to shop, a Trader Joe's, and a movie theater so you can literally hang out around that are the entire day.The Dekalb food court is in the basement of the building and is quite busy and loud on the weekends.There are a variety of vendors to choose from (40 to be exact) so you can never get bored (The famous Katz deli is also there!).The only downside is that the waiting time for each booth/station is a bit long because of the amount of people and some items can get a bit pricy.So, the first thing I ordered was the brisket taco from Dekalb Taco($4.95).I had to wait like 6 minutes for one taco but man was that taco juicy!It had the perfect ratio of meat to toppings and it didn't have all that weird American influenced sauces on it.It was plain,simple,and original.Then I went to Fletcher's BBQ for their ribs and fries.Waiting time was 8 minutes but it was totally worth it.The ribs was nice and tender and I loved the season in that they put on the fries.The order came with a BBQ sauce that was a bit too sweet for my liking but was nice.Lastly, we went to Pierogi Boys to get their Sample platter which was two meat pierogis,two sauerkraut and mushroom pierogis and two potato and cheese pierogis served with mushroom gravy,caramelized onions,sour cream,and bacon.It was delicious and came piping hot.The broth that it came in was nice and rich and the bacon bits were the best.($15)Overall, it's a nice place to come with family and friends to spend the day and enjoy cuisines of all kinds.", "author": "Sophia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-02", "description": "Went when it first opened....love this place. Wish they had more places to sit because it was crazy crowded but whatever the food choices are endless. Love it!", "author": "Meike O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-17", "description": "Food selection is amazing! So many choices and everything I ever had has always been very fresh. The options almost seem endless. Also a great location in downtown and there are so many things nearby. \n\nThe reason for only 4 stars is a major lack of seating, hopefully that changes soon!", "author": "Garrett D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "This place is awesome if you like variety. I can get any cuisine here, I just wish they were open longer. Great choices and great gourmet options to choose.", "author": "James C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Great addition to the neighborhood! My absolute favorite is the arepas. They are by far the best I ever had! I also enjoyed the pierogis. The hand pulled noodles are amazing and at very reasonable price. The sushi is excellent although the hand rolls are quite small.  \nOf course you can never go wrong with ample hills, my favorite ice cream place in NYC. \nAs far as breakfast goes, the bagels from bagel place are actually really good. The bacon egg and cheese is awesome as well. Looking forward to trying the rest of the stalls!", "author": "Alyssa P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-12", "description": "I don't get the hype. We live upstairs and signed the lease for this mall. This food court is the worst part of City Point. We eat out a lot as a couple and this place would have been god send. It does disappoint though. Let's start. Everything is overpriced for the area. We tried almost everything in this place and they are all pretty average. There isn't a stall that I actually crave with the exception of Arepa Lady, but $7 for a piece of dough is a little steep. Katz is great, but I can't eat a $25 salt/fat bomb everyday. Those Japanese hand rolls are pretty tasty though, but not tasty enough for all the sour taste we got from eating here since it opened. Nothing is horrible, but few things impress. I could get tastier and better food a short train/walk away. We never have lunch/dinner there anymore.", "author": "Connie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "Overall, Dekalb Market Hall had some issues in the beginning with seating \u0026 staffing, but has gotten their ish together. See below for individual reviews:\n\nAMPLE HILLS *****- SO good. Have never had the guts to venture beyond my ooey gooey butter cake bc it is just that good every.single.time. This is real deal ice cream with lots of chunks and deliciousness. Do not come here for fro-yo or anything healthy!\n\nPOP Cake Pops *- Nasty. As someone that LOVES uber sweet grocery store cake icing, I am telling you THIS IS TOO SWEET. It is way over the top sweet, cake was dry, and the dang things are $7.50 EACH ugh. Skip this for sure. \n\nKOTTI BERLINER DONNER KEBAB ***** - Huge portion, awesome meat \u0026 great variety/plentiful toppings. DELISH. On a different type of bread than your average street kabob but that just made it more awesome. \n\nCUZIN'S DUZIN **** - Cheap, good donuts. Cinnamon dusting is the bomb and easy to share. \n\nJIAN BING *** - The regular Jian Bing sandwich is awesome, the scallion pancake, less so. Big portion, good flavors.\n\nHANA NOODLES **** - The best part about this place is you can see them making the pulled noodles through the glass partition. Noodles are fab, toppings just OK. I got a spicy pork noodle bc I wasn't feeling soup, but that seems to be the consensus as the better option.", "author": "Anne B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-31", "description": "Food hall looks like there's a lot of options but there's actually not much stalls. Personal favorite is be Homme Frties ( I love my potatoes). Trader joes is also there, which is a plus for convenient shopping on snacks", "author": "Vicky C."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}