{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Fantastic! Just amazing amount be of food vendors all in one place. There's really something for everyone here. I had the vegan lunch and they even served wine! Wow. It was super yummy and a good portion. The wine made it pricey but was worth it.\nGreat place, could use more seating but I saw a sign that they are adding more.\nAfter lunch shopping at Trader Joe's. What more could you ask for!", "author": "Felicitas O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Such an amazing treasure honestly. So much incredible food in one place it gets overwhelming. The prices are consistently a bit pricy but the food is always good and the variety of options is something you cannot get anywhere else. Definitely try it, but remember seating is limited and there is barely any signal in the market.", "author": "Hannah D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-17", "description": "I don't understand.  Mostly the prices.\n\nHow are items here more expensive (and worse) than their counterparts at the same businesses brick and mortar?  How can a vendor have more overhead in a shared food hall than their own dedicated store?\n\nPlace sucks, plain and simple.\n\nNachos are the best deal here.  $5.  But...$13 Banh Mi?  Huh?", "author": "Austin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-16", "description": "Sad. That is all I can say about the layout and set up of  this food hall. While there are so many what appear to be great food options, the lack of seating and and he layout of this space is really disappointing. There seems to be seating for less than 50 people on a space that has a capacity of 450? Really, who laura out the space? In most food halls there are tables in the center and a flow around the food stalls but here it is chaotic. Where there are tables is not a place one would want to sit, by an escalator or down a hall. I'm sad as I was looking forward to this place but want the experience of eating in the space not just another take out.", "author": "Neil G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "One of my favorite places to go ever!!!! I absolutely love the diversity of options available and I wish I had room to try everything! This time I tried the seafood paella, arepas , Fulton market seafood and the Jamaican place...and on the way out I had to grab the stuffed churros! Everything is amazing and can't wait to come back!", "author": "Mona A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "Cool food hall, anchored by a typically fine Trader Joes, that seemed VERY popular with the locals.  We had good coffee and pastries at D'Avignon and will return to try some of the other offerings.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "The food at Dekalb market is good but it's so expensive and limited on seating. The have a lot of novelty NYC foods that are delicious to try but even though I work in the area I rarely go there.", "author": "Tanya G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "Update: DRAMATIC INCREASE IN PRICE AT SOME STALLS. \n\nFood Markets, Food Courts, Food Halls ... whatever you want to call them, who doesn't love them ? \n\nDekalb Market Hall is located in the basement level of the new City Point complex. \n\nThere are over 40 vendors in the market to suit everyone's palettes. A handful of the vendors are Foragers, Hana Noodle Station, Likkle More Jerk, Paella Shack, Arepa Lady, Daigo Handroll Bar, Wilma Jean, Bunsmith, Ample Hill Creamery, Cafe Davignon, Nobletree and Fulton Seafood Landing.\n\n-TRIED-\n1) Wilma Jean : Fried Chicken Sandwich (4/5)\n---------- Albight very oily at times, very juicy.\n2) Cafe Davignon : Cold Brew (2/5)\n----------  Eh. When I got it was bitter and not a good bitter. No coffee taste, just the bitterness. Off day?\n3) Nobletree : Cold Brew (3.5/5)\n---------  Drinkable coffee but very expensive and cup was filled with ice.\n4) Bunsmith : Korean Fried Chicken Bun (3/5)\n--------- Sweetness of the sauce was too sweet when I had it. It overpowered the fried chicken and made my teeth hurt.\n5) Daigo Handroll Bar : Spicy Salmon Roll, Snowcrab Avocado Roll, Spicy Tuna (5/5)\n-------- Delicious sushi. Quality of the seafood seems to change all the time though\n6) Two Tablespoons : Shanti Express and Sun Circle Bowl\n------ Decent to amazing vegetarian/vegan food. They have Strawberry Basil Lemonade and oh my goodness, I walk all the way just to get that sometimes (SO GOOD).\n \nFor those who are wondering about price points, I'm going to mention that if you're not rich and on a budget, you should keep close eyes and watch your wallet.", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "Pros:\n\nDecent layout (could use a better flow) \u0026 in a nice new building (looks like some vendors are either coming in or have shut down).\n\nVery good food vendors to choose from. I had some fries from Frite's, some mexican food (brisket nachos), a burger from Andrew's (which was really good), and some nutella filled churros.\n\nVery clean facility.\n\nCons: \n\nSeating is very limited into comparison on the volume of business.\n\nIll definitely be back to try food from the other vendors.", "author": "Moses C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Loud and some parts of hall were overpriced but overall is very well done. Fun and creative decor. All the food I have had has been amazing thus far. Took my parents here and they loved it. (Great for group that can't decide on what cuisine they want!) Good date night too because lots of food options and amazing people watching (then head to movie at Alamo!) Though maybe not first date because hall get pretty loud on weekend night.\n\nSuggestion: get a beer first and walk around to check out different stalls to decide what you want.", "author": "Carsen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "i am a big fan of this place!  kinda like a better chelsea market, kinda like an indoor cleaner smorgasborg. tons of different booths where you and your buddies can each either try each other's foods or order whatevre you want without arguments! \n\ngood things:\n-tons of awesome places to eat! \n-korean style buns stall is AMAZING\n-they have a katz's here (line gets long!)\n-have awesome looking coffee places\n-sushi hand roll place was BOMB\n-has poke \n-has churros / the churo ice cream sammich thingie\n-AMPLE HILLS\n-TJs is attached to it. easy access! get drinks there, get groc on the way out, etc.\n-target and c21 are upstairs\n-open space, very clean, very new (mind you: i came less than a month from their opening)\n\nnot so great things:\n-seating space is limited. they have a few stand up tables floating around the hall, but in general you have to fight for seating space on a crowded day. I would emulate what others have said: either come super early on on the weekends (they open at 11AM) or come on a random weekday in the mid afternoon.\n-darker downstairs, pictures will be fine but will definitely not be as nice as natural lighting pics\n-no map of the layout. so it makes you walk around and look at all the spaces and places, which might be a strategy they have \n-no public fountain / free water area. i think you might have to ask your individual booths that you order from for water\n-tacos were aites\n\n\nso i think i came too early from opening. there were a few stalls that aren't installed yet (in terms of food) and i think having those options would be great for this place. I did come really early on a sunday around 11am when they opened, so the lines weren't long for me at all. \n\nrecommended if you like food. bonus: you can go shopping afterwards nearby!", "author": "Christine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Great new spot in Brooklyn and there is a Trader Joe's right there too!! Yay!! It can be a bit confusing to pick a place to eat since there are a lot of different and interesting options but a must try is the churros place!! OMG!! They have a Nutella thingy that is OUT of this world. In general, the prices are a little high but quite worth it.", "author": "Thi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "LOVED! We grabbed a basil strawberry sangria and proceeded to hit as many stalls as we could. Myself with my 2 sisters visiting from Texas can do some damage when it comes to good food. We went straight to the cheese place for a nice starter. Pirogies, pizza, rice balls, jianbing, and stuffed donuts. We really wanted so much more. And we definitely regretted not getting ramen to go. It looked amazing. Happy eating!", "author": "Dawn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "Unbelievably overwhelming with the many choices they have! Went to Katz deli for the first time and my only regret was purchasing the fries, since the sandwich is so harty and can really be eaten on it's on. Definitely will return", "author": "Norma R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-13", "description": "Variety is key here.  Go to their website to view all the options but also expect to change your mind as soon as you arrive.  Shared tables and good place to meet other foodies.  Three of my favorites (I loved them before the market and I just end up love them more often since the maker is 10 mins away from home) Katz, Ample Hill Ice Cream, and Arepa Lady.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "What's the worst part about coming here: so many choices, so little time!! You can get a taste of all flavors and cultures here with plenty of desserts to wrap up your meal. You should be warned though, I'm not sure you can leave this place without spending under $20. \n\nSome of the greatest hits:\n- Diago: the hand rolls are amazing, the toro just melts in your mouth. My suggestion, eat at the bar so that you can get the freshness of the roll. \n\n- Likkle More Jerk: the jerk pork melts in your mouth, just the right amount of flavor and great value for your money. Warning - it is spicy!\n\n- Forcella: deep fried pizza? Say what?!? Yes, it sounds exactly what it looks like, and was the first time my kids ate everything including the crust with the basil and asked for more. Eat while fresh though, doesn't keep well considering it being deep fried and all. \n\n- Pop Cake Shop: the kids walked away with smiles as big as the servings. I wish I could have tried more but my boys conveniently said I should have gotten my own. \n\n-Cuzin Dozens: mini donuts...need I say more? MINI DONUTS!!!\n\n-Bread \u0026 Spread's Porchetta Sandwich....mmmmmmmm\n\nMaybe next time:\n- Katz Deli: this was my first stop as it has been too long since I had one of their pastrami sandwiches. Unfortunately, only the name brought me back as the taste just wasn't the same. The hoagie bread wasn't as soft and you don't get the up close relationship with the carver to taste the meat before going in. The price was also a little more than I expected at $21 but could and did feed two people. Two people who rather have saved the stomach space for other vendors here.", "author": "Roy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "This place hasn't been open a month and I've already been there at least 5 times.\n\nIt's a really delicious place! There are SO many options! It represents Brooklyn and the love of food and cultures very well. I've tried ample hills creamery, cake pop, the sushi hand roll place, Fulton landing, the Jamaican place, 8 turn crepe, the Mexican place, the ramen place (the only fail for us, the noodles were mooshy), the French bakery, arepas, the healthy soba noodles place and the Hawaiian comfort food spot. All have been pretty good. The highlights would probably be the Hawaiian, the arepas and the crepes, but pretty much every place was above average.\n\nThe reason why I took off one star is that this place is pretty expensive. I could eat at the soba noodles place or the Hawaiian, for example, spend $15+ on one bowl and still be really hungry. That's why I've tried so many different places in only 5 times, because I had to go back and get more food a few times because I was still hungry. To me, that's pretty much unacceptable. It's great that it tastes good but for that kind of price for take out, you should be full, and I'm not a big person at all. There are other things that you could maybe pick at but to me, that's the number one issue and why I took off a star. \n\nOtherwise, I would definitely recommend this place. Definitely try it out, but be prepared to spend $$$", "author": "Aja T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "If you're a Foodie you'll love this place but I think it's just OK food, poor layout and really over priced.  $13 for a Banh Mi at  Bunker Hill is way over priced. Sandwiches at Lioni's are so so. Bread fresh and cold cuts are ok but the combination of flavors just didn't wow me. It tasted like a bunch of cold cuts slapped together. The major draw back is this place gets very  crowded and there is very limited seating and standing counters. They're usually all taken and a fight just to get a spot.", "author": "david l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Love that there is finally a diverse food hall in downtown brooklyn. So much to be excited about here: Hana noodle (pulled noodles and dumplings), Ample Hills ice cream, burgers, sushi, pierogis, arepas, frites, churros trend, doner kebab, jerk chicken and the infamous Katz deli. Almost every cuisine you could imagine under one roof. Definitely not as crazy crowded as the halls in manhattan, maybe because it's still new but it's a great addition to the area. One of my favorite Szechuan places Han Dynasty is also under construction, excited for some of these delicious manhattan eateries to finally come across to BK. There's also a Trader Joe's and target in the same mall so you can find everything you need in one place, can't wait to come back!", "author": "Queena T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "I  love this spot, theres tons of options! I would've given them 5 stars if I have sampled all their food :3 \n\nTrouble is finding a seat! Will definitely come back here!", "author": "Simon M."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}