{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-25", "description": "This food hall is just alright. Lots of options but somewhat poorly laid out, mostly very expensive, and limited seating.", "author": "Eric D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Cool place to grab a quick bite to eat some places are a bit pricey but I love the Mexican spot with the burrito bowls omg amazing try it", "author": "Marcus G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "This is the perfect place to go to with a group who can't decide what to get. Dekalb market features a wide variety of cuisines with plenty of seating areas and occasionally live music. The prices are steeper than other restaurants in the area but the atmosphere and convenience make up for it. I would recommend going with a few friends and sharing dishes from multiple stands.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "I thought this market was great. There were lots of options to try. I have  been to similar locations and have enjoyed my experiences there as well. It can get a bit crowded so if crowds aren't your thing this might not be for you.", "author": "Ursula T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "Not sure how to rate this place... but here goes. \n\nHana: Unfortunately ordered the steamed pork dumplings. On the menu they offer pan fried ones as well but for some reason those weren't available. The steamed dumplings came out suspiciously quickly and as soon as I prodded one with my plastic fork, I could tell that they were no good. Most of them had flour on them still and were so limp and lifeless. It was like they had hardly been steamed. The pork inside was dull and also barely cooked. \n\nKotti Döner: Really delectable döner but way beyond the prices I am used to paying at Halal Guys or other street karts which suit me just fine if I am hankering for some Halal food. \n\nThe rest of Dekalb Market Hall offers so much variety and there are a few other places I want to go to, but in my two experiences so far, the offerings are either overpriced or poorly made. The space is cramped and at peak times it takes a few walks around the entire premises to find somewhere to sit.", "author": "Timothy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-13", "description": "Interesting that this has arrived, but in execution it's not what it could be.\n\nThe push to modernize downtown Brooklyn with City Point doesn't seem to truly live up to its promise. \n\nThe food market, while it could serve a purpose to finally provide decent food to the large population of people who live there or flood the area for work and shopping during the day, misses the mark. This is probably because of forces outside of its control at this point (i.e., rent is too damn high). On account of high cost to start this venture up, the prices and the portions are disappointing. \n\nHad some tacos and some barbeque at different visits and just felt like I wasn't getting what I paid for. Since I work in the area, I'm not thrilled with the idea of spending upwards of 15 dollars for small portions that aren't anything to write home about. If Im going to eat meh food, i'd rather pay meh prices, which I guess is the motto for eating in downtown Brooklyn.\n\nCoupled with the fact that the place is too crowded, has little seating, and is basically a windowless, airless concrete space in the basement,I don't think I'll be coming back unless I have to entertain out of town guests.\n\nIt's unfortunate that they seemed to be ultimately targeting tourists over the people who already live and work in the area. But what do you expect I guess?", "author": "Reels B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-22", "description": "Lots of venders and a variety of foods. I purchased Kats delicacy but the food was so greasy and soggy it took a very long time to finish it because I didn't want to waste my money. Also bought noodles from Hannah noodle station where the woman swiped my card numerous times showed me and told me no amt, card not working she was very rude with her approach had everyone staring at me how embarrassing it was as well, but I still payed the $15 cash. \nWoke up the next day with a bunch of charges posted to my card $60 and knowing I never entered my pin nor did i sign any receipts. Bank said if they authorize the payment they are commiting fraud. Waited the 3 day period to see if they authorized the payment and they sure did. \n\nI wouldn't go there again after such an experience.", "author": "Issac L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-02", "description": "Fun place with a great selection of food vendors! My only complaint is the price of food here. It is definitely quite expensive, but some are worth trying. Just keep in mind that you will have to spend  quite a bit of money. Favorite here so far was the cake pop shop. You get to choose your own flavors and create a delicious cake pop.", "author": "Tahini R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "Out of the food halls I visited, this was probably one of my favorites.  The restaurant offerings here are so vast.  The place was as big as I hoped it would be.  I definitely kept getting lost circling through the many alleyways of food stalls.  I came here during the earlier part of lunch so seating wasn't really an issue for me, but I could see the seats here filling up quick.  The quality of vendors here seemed better than most food halls too, with some big name spots like Katz.  The Dekalb Market is located in the basement level underneath the Target.  Overall, a fantastic food hall I would definitely recommend making the trip to as it isn't far from the subway station either.", "author": "Bryson L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Amazing addition to the fantastic Downtown Brooklyn neighborhood!\n\nPhilip", "author": "Philip H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "This place has all sorts of cuisine. If you're into fast food then this place is not for you. You will not find the usual suspects in here. This is more for fine dining except you might have to stand while eating. I tried the beef tacos at Taco De Kalb Market. These were well-made and tasty. Service was fast. You get the impression of a festive atmosphere down there. \n\nThis City Point building is new. It has morphed from the old Albee Square Mall with fast food and even a religious bookstore and psychic readings to the futuristic building that it is today. I see Katz's Deli in there. I have yet to try their sandwiches. They are very pricey. Usually right around St. Patrick's Day the supermarket not far from here would have sales on the real, good corned beef. So I like making my own corned beef sandwiches at least once a year. Not the one in the can mind you. The one that comes in the plastic wrap that you have to simmer for a few hours. So who knows maybe one day I will try one of their sandwiches at Katz's. Maybe they ought to have a 50% off sale as a welcome to the downtown Brooklyn community.", "author": "Wayne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Seriously awesome!! This market hall has usurped my love for Chelsea Market, although there are some differences. Dekalb is completely food-focused, and has almost 40 vendors that offer different foods ranging from poke bowls and sushi to pastrami sandwiches and pierogis, and even icecream and churros. The options are endless, I could eat here all day.\nIt's also an awesome date spot, any girl or guy would love coming here. \nThe seating is a little sparse, but I'm owing that to the fact that it's extremely new, so some minor things have to be worked out! \nI would 100% recommend ordering a poke bowl from wiki wiki, I kind of died when I ate it- it's so good", "author": "Marianna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-25", "description": "Food here always looks better than it tastes. The idea of hamburgers, crepes, grilled cheese, arepas, empanadas, always seems better than when you actually bite into it after overpaying for what is essentially glorified street food. It's really a fancy, gussied up suburban food court with local hipster offerings instead of corporate outposts. Sufficient for a quick bite in between shopping or meetings but not a destination to go out of the way for.", "author": "L Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "So many food options to choose from! I had the ribs and tips meal combo (Fletchers Brooklyn Barbecue ) and it was amazing! For dessert, had the Harajuku fruit cocktail crepe (Eight Turn Crepe)...the right amount of sweet and lots of fruit...again, amazing! If we had spent the whole day there, I would've gone atleast one round of everything. So far the experience was great!", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Great location with lots of good food!  Sandwiches, chicken, Asian, Caribbean you name it.  Came here because I saw it advertised in the Time Out magazine and said let me take a trip down there.  Glad I did, different price ranges and a restaurant is there as well, Spanish I think, hadn't opened as yet.  You can always sit and eat, they are supposed to be adding more seating space.  Well lit and clean too!", "author": "Deb C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "Not a lot of variety when I went and I'm not sure if the venues are that nice either - when i went friday evening (?) there weren't a lot of people and it seemed rather empty. I feel like a lot of the smorgasburg vendors aren't the best and they happen to be here. Think of this as a permanent Smorgasburg for a couple of the vendors.", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Great food. Good options. Nice coffee. Love jianbing but expensive. Tofu shiitake bowl is great.", "author": "Rahul G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "This place is awesome. If you can imagine a smaller version of Chelsea Market, but with better food vendors, you'll be at Dekalb. On top of that, there's a massive Trader Joe's and an Alamo Draft House. I can get used to this. From bringing in the arepa lady to selling craft brews (Two Hearted Ale!) that you can bring around while you eat, Dekalb has it all. I highly recommend the Korean buns (fried chicken is insanely juicy) and a smattering of beers from the craft vendors. The fries are hit-or-miss, as some are fried perfectly, and some aren't. They also tend to get orders wrong and give you regular fries instead of your order of truffle, but what can you do?", "author": "Danny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "If you can go to one place in Brooklyn, this is it!! Daigo hand rolls were great but everything we tried was yummy!!", "author": "Sarah Katherine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "This is a great place to go when your trying to grab something quick, they have many different types of food ! Alittle something for everyone ! It is filled with alot of trending food spots from the city if you want to go to one spot that got them all.", "author": "Taffy L."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}