{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-12", "description": "There are a number of food offerings. Everything is offered a la carte at most vendors and quite pricey. I've been to several locations now over the past 2-3 months. Be prepared to spend at $20-25 for entree and beverage. \n\nAlso, the lighting could be brighter as it's on the lower level. Too dark for my taste. I will say at least there's room to walk around. \n\nNow, the Trader Joe's at this location is great! I only wish I could find a parking spot more often and I'd be there every week for sure. Even though the lines are long (on weekends), they keep it moving along. \n\nHopefully the food market will improve with time.", "author": "C. D. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "This market hall reminds me of an indoor Smorgasburg - there are lots of good eats set up in an open layout.  There is one bar w more ample seating off to the side.  It feels like a hip Reading Terminal (market hall in Philadelphia).  Love the options, and Trader Joe's is only steps away too.", "author": "Crystine W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-23", "description": "Second time I got sick after eating here. Once at lionis and once at the Jamaican place. Food poisoning? I hope doh tears this place apart.", "author": "Z B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-06", "description": "this is my second review since the first one was removed because \"This review has been removed for violating our Terms of Service\". all i can say is that the market which is not even a market but a tourist trap is a depressing experience. the location is depressing...a basement. the prices are very highy...i guess the rent. the food it s glorified fast food, the service is alienating. if this is the future of community this is very sad because this is just the present of capitalism at it s worst. lets get real. and yes i will post 4ever", "author": "Federico S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-01", "description": "stop going to food halls. Nobody wins...except the developer.", "author": "Scott F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-19", "description": "The individual vendors at DeKalb Market are wonderful, the highlights for me include: Katz's Deli, Café D'Avignon, Jianbing Company, and Dulcinea. Having tried bites from each (or heard feedback with the friends I went with), everyone enjoyed their selections. \n\nThe issue that I have is not with the vendors, but with the layout of the hall itself. It's sort of like someone took a crowded rush-hour A Train and spliced it with the food court at a mall. It's literally jam-packed, and unlike similar venues (like Reading Terminal Market in Philadelphia), there just isn't enough space between vendors for guests to freely walk through. What's even more worrying is that the Trader Joe's isn't open yet, and I'm fearful of just how crammed it'll get downstairs once it's in full swing.\n\nIssues:\n- TRASH CANS: There aren't enough trash receptacles, and the ones that are available are WAY too small.\n- LACK OF SEATING: There isn't enough seating. I'm not sure if they're still installing booths/tables/etc., but the eating areas feel like an afterthought. \n- CLEANLINESS: Cleanliness is really hard to keep up with, due to the fact that there are waiting lines for people to sit down. I went one on Saturday morning and again on Sunday afternoon, and both times I had issues with food, on the seats, on the surfaces, and underneath. Again, this isn't the fault of the venue, per se, but if there were more eating areas, the cleaning people could take time to address different sections.\n- LINE DEMARCATION: I think there needs to be some way to address the various lines for vendors, because I found myself constantly being held up behind people who were waiting for their orders. Also, I wasn't quite sure where the line for one vendor began, and the line for another vendor ended.  \n- AIR QUALITY: With the number of people and vendors in such a small space, I think it would be a good idea to address the air ventilation. It felt a little claustrophobic at times, and I noticed there were a lot of sweaty and overheated guests.", "author": "Bill D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "This is a great effort. Lots of interesting vendors and a decent atmosphere considering it's in the basement of a sterile-looking mall.\n\nI've tried about half the vendors and many are pretty solid though I haven't found anything that I love.\n\nI wish there were more healthy options.\n\nIt's also really annoying that every vendor uses these Square touchscreen card readers that ask you to put in a tip. It's not common practice in America to tip at fast casual restaurants, yet it feels super awkward to say no tip when they're asking you for a tip. With lunches here averaging about $15, you'd think the staff would be making high enough wages that they don't need tips?", "author": "R C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-27", "description": "Beware: Outrageously overpriced food. Unless they updated their prices, it seems like Katz's sandwiches cost on average 7 dollars more here than the original location in Manhattan.  The \"Kotti Berliner Doner\" kebab place charges 14 dollars for a measly kebab. I was completely taken aback by this since typically you can find equivalent version at any local Greek or Halal spot in NYC for about 6-8 dollars. \n\nThis place is all about price-gouging tourists. Locals should avoid it as there are many other great options in the area.", "author": "Greenpointguy P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-17", "description": "This place seems great except there is no place to sit. I went at 3 in the afternoon and it was packed with people sitting on the floor. seems like a serious design flaw. we decided to leave rather than eat on the ground.", "author": "Tyler A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-04", "description": "This market is across from my school. It super pricey. There are so many options. I've only gone to maybe two of the places, there's a taco place and a Korean BBQ place. Both were super good. For the taco place, I wouldn't get the lemonade. The lemonade taste like water with a lemon and 1 sugar to be honest. The tacos were really good. For the Korean BBQ the bulgogi was alright, I've had better. The portions are tiny for how much you end up paying. If I come across a place that is the great, I will come back and edit this post.", "author": "Fatima K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Absolutely love this place. The pierogi shop is phenomenal. Make this a stop before you go to the movie theater or shopping at Trader Joe's. You can spend quite a bit of time sampling and wandering around or sitting at the many tables and chairs.", "author": "Ilona J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-17", "description": "One thing that was terrible...no water fountains anywhere! We bought food, which knowingly was overpriced...but no water anywhere. It'll take time to get the kinks out I'm sure...I'll go back in a few weeks.", "author": "Nychoopaholic B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "WOW. Very fun place to go. If you cant make up your mind go here. Everything from BBQ, seafood, KATZ, and mexican just to name a few.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Incredible! You really won't find tourists here and there is a huge selection of what you can get and plenty of seating. Cell service is super spotty though!", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "I am so happy they opened a market hall in Brooklyn! Every time I come here I always go to Bread \u0026 Spread. Look for Brian, he make the best chicken caprese sandwiches!!", "author": "Elise L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "One of the best kept secrets in Brooklyn food that I've found so far. It's gotten very popular but lines still aren't that long and the selection is amazing.", "author": "Connor B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "We tried the Sampler from Pierogi boys and the brisket from Fletcher's. SO SO SO GOOD! Then we had the Churros Rellenos from Dulcinea NYC. (My mouth is salivating as I type this review) The bbq sauce on the brisket sandwich was so flavorful! Don't get it if you're not ready to get your hands dirty! The churros were so delish! They were not too sweet and they were perfectly crunchy on the outside and not oily like the other churros. We also tried the fries from Home Frites, they were thick but crispy  It's definitely worth going back to try more stalls! The $$ are a little on the steep end but for me the portions were worth the price.", "author": "Kristine I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "So I came here today for lunch today and I was pleasantly surprised. There was a variety of choices. I didn't know what to pick at first because everything looked delicious. I liked that there was plenty of seating and it was very cleaning. The Taco spot is a must. I tried their carne asana quesadilla which was super tasty. The carne asada was super juicy. Another must is the filled churros. I had the dulce de leche churro which was amazing! I can't wait to go back", "author": "Paola C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "This place is a must for all new yorkers alike because who doesn't like food? and a bit of shopping? Your going to win somehow. First off, yes it is expensive and I'm sure it gets quite crowded. We were very lucky we came on Sat night after 7pm, caught a street parking around the corner and it wasn't crowded in the Hall at all. We spent a few mins walking around, marveling at the fact that this used to be Albee Square Mall (if you don't know ask somebody!) an old school mall that I used to hang out in when I was in college. Hubby hung out there too way before I ever did. In fact he grew up in the neighborhood and was marveled at how it's all changed so much. Anywho, we decided on Katzs obviously and split a pastrami on rye. It's been many years since I've had their sandwiches but they are as good as I can remember. Still huge and they give you a side of pickles. Yummmm. After we ate we cruised over to Trader Joes to pick up some favs. I liked this location because it seemed wider than the one at home and while there were were still people in here I didn't feel crushed. I'm looking forward to trying some new stands when we come back.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-07", "description": "One plus is that the food court serves a bit of everything for those picker eaters.  I didn't try, because I don't particularly enjoy the crowded communal table of eating at a very dim-lighted area.  I did circle to look at all the directions, but being in a basement it wasn't well lite, and looked very dingy/dirty.  The only one that appeal was perhaps Hans Dynasty that appeared to offered an indoor seating establishment for dinning away from the pedestrian food traffic.  Also, my main goal there was shop Target and Trader Joes.", "author": "J J."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}