{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Dekalb market hall is in a great location. One of my friends live right next to the building and we would go over to get dinner often. There are a lot of different options but my favorite would the chinese bing store. The bings are delicious and each bite explodes with flavor in your mouth. The chilli they use is hot but complements the meat and overall bing!", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Ok so I love the market, It's convenient and filled with many food options from a surplus of different cultures. Out of all the vendors there, I most frequently go to home frite. Their truffle fries are AMAZING... sometimes... which I hate! They need consistency!! Going here is like playing Russian roulette! I gotta say a prayer after I give a hefty six bucks that I get the right person  to truffle my fries the right way! Sometimes there's little to no truffle or Parmesan on my fries, or they're not cooked all the way through like the ones I'm eating right now! Or worse, BOTH AT THE SAME TIME. Honestly, I'm getting really tired of this nonsense.  Start being consistent...or loose a good customer!!!!", "author": "Autumn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Fantastic array of diverse food. Had the perogi's at the Polish stand and of course tried the Katz's pastrami sammich. My daughter went for the smokehouse chicken. All was up to snuff and excellent eaten. Thank goodness  this place is not closer to my office I need to take a 20 minute bus ride. I'd be fat as a house!. I am thinking I could probably live down there in a far corner and not be noticed however...lol. Seriously I'd eat there every day if I could. Located and well hidden in the basement under Target lets keep it a secret as best we can. Less lines and more food  for us!!", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I can't get enough of this place. My husband and I come nearly every weekend and have a pact to try something new every time. While there have been a few misses, the overwhelming majority of food here has been incredible. My highlights include turmeric fish sandwich from Bunker, pork Jamaican burrito from Likkle More, doner kebab sandwich from Kotti Berliner, shrimp roll from Fulton Seafood Landing, and pierogis from Pierogi Boys. We will be coming back for more!", "author": "Shai G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-13", "description": "Had the banh mi at Bunker which was not worth $15. Better taste and size in Chinatown for under $6. I went past the Arepa Lady too and $20 for two arepas and toppings. I'm sorry to say but I predict that with the prices being so high this will be a dead zone in a year (after the hype dies down). It's a shame because the location and the selection is excellent.", "author": "Holly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "The market hall is packed with so many choices if I could give you a piece of advice. Walk through the market. Many of the vendors have samples and it will help you narrow down what you truly want. There are so many options you may feel a bit guilty when you finally pick one. Like you missed out on something but no worries. There are no bad choices in the market hall.", "author": "Valmiki N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "I like the Jianbing and Jidanbing here! There's a lot of vendors to choose from including Jianbing, Katz's Deli, Arepas Lady, Pierogi's and more!", "author": "Vhalerie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "So awesome! Thrilled with this addition. So many great options for lunch. I wish I worked closer because I would eat here everyday. Pro-tip: if there's a line there's a reason. If there's no line- there's a reason.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "Lots of choices. Everything is about twenty dollars for a meal, which is a bit in the pricey side. But it adds some variety to the hood. Glad it's there.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "This is a new food court type market off Fulton mall. Great selections and food. More food stalls to come. And it's outsides Trader Joe's. can't get any better. I will go again.", "author": "Bruce G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "For new parents who are unofficially banned from eating out until further notice, this place is a life saver. There are many food options and a plethora of cuisines. My favorite so far is the Masrico Paella at Paella Shack- absolutely delicious!  It is stroller friendly and noisy enough for babies and toddlers to be welcome! I wish there were more sitting areas, relative to the number of vendors, the sitting area is relatively very small.", "author": "Ma L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "In general the Dekalb Market is a hidden sort of funky food market and a great addition to my old Brooklyn neighborhood. The crowd seemed eclectic and cool.  My wife and I found it fun on a Saturday night.  The cons- seating is communal and a bit tight.  We tried the Arepa Lady since we only wanted a snack -we had plain Arepas - not bad but not great and a bit overpriced for a small corn cake with a bit of cheese- but that may be due to high rend; the service was good and friendly.  If you haven't tried DeKalb Food Market you should at least once. Downtown Brooklyn is getting better by the day/week/month.  As mentioned there is a large Traders Joe's in the market.  How do they do it?", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "Easy to get to new market hall. Large space there's a target and trader Joe's in the same location. Very convenient. Food is very overpriced though. Fletchers pulled pork and brisket sandwiches were dry and lacked flavor without the bbq sauce. $11 for the pulled pork and $13 for the brisket. There's katz deli. Delicious pastrami sandwiches but a $21 sandwich. Line moves fast quite efficient. Skip the churro ice cream sandwich from dulcinea. It's embarrassingly small and the ice cream is horrible. $7 for it. Pierogi boys cheese and potato pierogis while good not worth the steep $12 for 6. Almond crossaint from Cafe D'Avignon $4. Decent. All items include tax. You could easily spend $$$ here. All stalls took credit card.", "author": "Prima Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "This place has everything! We tried a regular cheese arepa at Arepa Lady and it was good but not amazing. The valencia Paella could've been really good, but the rice was so salty! The meat was delicious though. We still finished the whole thing. Lastly, the key lime pie was delicious and the filling was creamy with just the right amount of tart. I'm definitely going back to try the other food. The Trader Joe's here is also amazingly large and organized. There isn't a lot of seating here, but we didn't have trouble finding a standing table/bar to use to eat at dinner time on a Saturday.", "author": "D Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "The flavor of the sandwiches at Katz's lives up to their reputation, but the price is outrageous.  Tough to consider they could be worth it anymore. The Berlin Doner's, however, didn't match up to their reputation.  I've had many doner kebabs in my time (i lived-in Berlin for 2 years) and they never cost nearly this much, nor were they so stingily made.  The flavor, however, is delicious. The Arepa Lady continues to impress, and the Singaporean Street food is to die for!  We also loved Guss's pickles!", "author": "Steven P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Great selection. High quality foods. Impressive selection. Can't go wrong at Katz deli.", "author": "Keith S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "so great! the food selections are carried and delicious. a bit pricy, but worth it. they need more seating and it can get loud. but I see like going", "author": "Jen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "What an incredible addition to the neighborhood! There are multiple options for varying styles of food, and the options I have tried have all been fantastic.", "author": "Nick H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "Lots of delicious food options.  Prices are normal for downtown Brooklyn, in other words steep for most establishments outside of manhattan.  The biggest drawback is the seating, there simply isn't enough of it.  You have to be competitive and that takes away from the hive.  Also, cell service is pretty bad, so don't even think of calling a friend to tell them where you've managed to find a seat.", "author": "Mary G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Awesome place - lots of great choices for food and dessert. A lot like Philadelphia's Reading Terminal Market", "author": "Maeve M."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}