{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "I have no idea why I've waited so long to come to this market. It's so amazing AND Trader Joe's is nearby? What is this heaven on earth?\n\nIf you're a hungry belly all the time like me and like to nibble on delicious foods this is a great set up. Walking around grabbing bites here and there is what I live for. I originally came down here to explore these European meringue treats I saw pop up on my search of \"chocolate\" and ended up sampling a whole lot more. The booths are also set up so charmingly with such flair unlike other food markets (ahem Chelsea).\n\nAlso being here during the weekday is probably much nicer than a weekend riot.", "author": "Mary P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "This enormous food hall has solved the age-old marriage problem that is deciding what to do for food. \n\nNo longer must I suffer through my wife's insistence that she doesn't care what we have for dinner, only to have her shoot every subsequent suggestion down. Now I just take her here, run off and eat whatever I want, and leave her to fend for herself. She always seems to find her way home, but that's the only downside of living so close to this impressively diverse hall of face-stuffing.\n\nAnd the sheer variety is quite impressive. \n\nDo you want arepas from THE Arepa Lady? Pulled pork fries from Fletcher's? The ridiculously satisfying pork jowl bao from Bunsmith? Fried pizza from Forcella? Any kind of hero from the legendary Lioni's? Legit kebabs from Kotti Berliner? Poke Poke from Wiki Wiki? Fried shrimp from Fulton Landing Seafood? Jianbings from the Jianbing Company? The only outpost of Katz's, serving the same world-class pastrami? Stellar sushi hand-rolls from Daigo? Jamaican beef patties from A Likkle More ($3 apiece, probably the best value in the hall)? The ubiquitous Ample Hills ice cream?\n\nAll of these (my favorite vendors so far) can be found here, along with much more. Deliciousness from both all over the world and also all over NYC are represented; the curation is stellar. \n\nThankfully, they've also added more seating and the cell service has gotten better, which were my #1 and #2 problems with the place initially. And while there are lots of families and lots of tourists, it's not usually as crowded as you might expect. Lines are not a huge issue the way they are with Smorgasburg and other similar attractions.\n\nDon't get me wrong though. This place is not perfect. \n\nI certainly have individual complaints about some of the vendors. Some are slow. Some are rude. Some are just not that good. Most are a bit overpriced. The strength of this place as a whole is in its variety, and although I understand that each vendor is in it for themselves, I do wish there were more smaller options under $10 so I could eat multiple items each visit (without making myself fat and uncomfortable, which is what I do now). \n\nI am slowly eating my way through every vendor, and this keeps me from trying some of them as I don't necessarily want to commit an entire meal to an unproven entity. I actually wanted to wait til I'd eaten everything before I wrote this review, but I don't know if I ever want cakepops, or that healthy vegan food. No offense to you if you're into things like that. \n\nMy other complaint is with all the RULES. No public nudity, firearms, public intoxication, rollerblading, loitering, OR lying on the floor? I thought this was AMERICA. \n\nBut I'm so happy the hall itself is here. Now that I have a baby that only sleeps when she's being walked around, and in bad weather, this place has been a godsend. I come in here constantly, and I wish I was kidding. But seriously, it's fantastic, and you should give it a try too.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-17", "description": "In our travels around Brooklyn, I was pretty insistent that we came here. I'm so glad we did! I had Hana Noodle Station and they were pretty decent. Peanut butter and pineapple had to be my choice since it was just different from what I've had elsewhere. I was a little disappointed that they just dumped some peanut butter sauce and a few pieces of pineapple in with some cucumber, but once I added chili oil for some spice, they were pretty good. I did enjoy watching the gentleman pulling the noodles while I waited, but didn't get to watch for as long as I wanted since my food was ready in an instant from being pre-prepared. My husband opted for Fulton Landing Seafood in the middle of the place and seemed impressed. It did take a bit for him to get his food, and I definitely fell off of one of the super high stools while trying to stand up, not realizing HOW high off of the ground I was. There's zero reasons for those chairs to be so high! I'm like 5'3 and had to CLIMB onto the thing. However, the crabcake sandwich was awesome and my husband touts that they had the best tater tots he's had. I also grabbed a coffee from the place right at the front. While it wasn't the greatest coffee I've ever experienced, it got me caffeinated for the rest of the night, which is all that matters in the end!\n\nTo have all of these options in one convenient location is a dream come true for me. My husband doesn't really enjoy alot of the food that make me flip my lid, so being able to have all of the different types of foods in one location makes me a happy camper.", "author": "Christy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "This is a great example of what a food court should be ! Always clean and filled with food, although it is pretty pricey you never get bored with lunch cause there's so many options here. \n\nI've been to the market several times and I always get their Korean fried chicken! It's not your traditional Korean chicken but it's sooo good. It seems like they put a more Chinese twist on it. \n\nBut the market combines healthy options along with it as well, Trader Joe's provides tons of healthy lunch options and did I mention there was also desert ?! Ice cream, churros, cupcakes etc ! \n\nMy all time favorites here are the paella, Korean fried chicken, truffle fries and the Vietnamese coffee", "author": "Sally C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "I love going to Dekalb Market! So many places to eat! One of my favorite places to eat there is the Paella Shack! Their squid Ink rice taste so good! The service is quick and I like the idea of the food being cooked in front of me! Dekalb market is great for chill dates, grab a drink, grab a bite or food shopping (Trader Joes)! This is a spot I would totally suggest to check out.", "author": "Bellinda I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-08", "description": "Great gem in my neighbourhood! Downtown Brooklyn should be proud to have this fab food market! They have great choices of different cuisines from polish pierogi through Jamaican jerk chicken and delicious pizza to yummy bagels! You name it and it's going to be there. This place is always buzzing with people popping in for a quick lunch or those who fancy after work drink and even occasional recital with some quirky musicians. Great vibe with plenty of different delicious smells in the air. They have quite a few tables with chairs and benches to grab but sometimes especially on a weekend can be hard to find a spot. \nThe place is not too obvious to find at first but as long as you find DeKalb Av station you're good.", "author": "Marzena D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-18", "description": "I love food halls and Dekalb Market was no exception! They have a wide variety of food stalls including some pretty popular spots (like Katz deli and ample hills Creamery!) so there's definitely something for everyone. I tried the JianBing, peirogis and ample hills ice cream - all great. As with all food halls in the city, it's basically an trendy/upscale food court (with better food of course)\n\nOverall, recommend checking out Dekalb Market at least once if you like Chelsea Market as it's wayyy less crowded", "author": "Melanie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-19", "description": "Gee, what's not to love about this relatively new underground market hall? It's been open for a year and a half now and contains over forty food vendors including the first and still only offshoot of Katz's Delicatessen. I thought it would be the ideal meeting spot for a friend who was staying in Brooklyn. I was in SoHo, and it was a quick ride on the Q to the first Brooklyn stop at DeKalb Avenue. This all mattered a lot last weekend when it was colder than a witch's tit. A convenient location isn't the only draw.\n\nThere's a lot of choice here, and it's easier to peruse the menus before it gets crowded, which was about 11:30AM when we were there on Saturday. If calories didn't matter, we would have stayed all day and brought a sleeping bag, but they do and I went for two dishes at the modern Thai kiosk, Chicks Isan - the $14 Isan Style Grilled Chicken Half (photo: http://bit.ly/2RHvL4x) and the $10 Papaya Salad (photo: http://bit.ly/2R3Q9b2). The salad was fresh and snappy, the poultry was burnt and arid. My friend ventured to a proven commodity, Arepa Lady (photo: http://bit.ly/2HshFQ5), for the $6 Arepa de Queso.\n\nIt was a simple Colombian street food fave that satisfied in three tantalizing bites (photo: http://bit.ly/2FHn3gu). He also went for a $5 Korean Fried Chicken Bun from Bunsmith (photo: http://bit.ly/2S4uVOS). Awesome. Sometime cheaper actually does mean better, and repeat visits and word-of-mouth will hopefully guide you to the right choices. The potato pierogies at Pierogi Boys looked awfully good as did the key lime pie at Steve's and ah yes, the pastrami sandwich at A Taste of Katz's. It should come as no surprise that seating becomes a problem after critical mass is achieved, so come early, at least until the weather warms up.\n\nFOOD - 2.5 to 4 stars...ups and downs so choose wisely\nAMBIANCE - 4 stars...an inviting layout, far less crowded than Chelsea Market but seating is at a premium \nSERVICE - 3.5 stars...variable for sure\nTOTAL - 4 stars...a welcome spot for an edible congregation not that far from Manhattan\n\nRELATED - Looking for dining options in Brooklyn? Here's a collection of places I've tried and reviewed: http://bit.ly/2MZRizT", "author": "Ed U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "An indoor smogasburg, without the tents and crowd. \n\nSolid food vendors serving toro hand rolls, paellas, Korean wings, perogis, and pastrami sandwiches. \n\nPrices are a bit steep but you already know that from smorgasburg. Good size of crowd, it's not crazy and no more than 3-4 people in line ordering food for each vendor. They need more seats though, since the space is shared with people from the mall who are also shopping but there are some long standing tables. \n\nMy favorite was the torched salmon belly hand roll with yuzu sauce from Daigo Hand Roll Bar and the hoisin lime beef Jianbing from Jianbing Company.", "author": "Florence V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-13", "description": "They've got pretty much everything you could think to want to eat, and then some. Vietnamese? Check. Caribbean? That too. Paella? Yeah. Pizza? Um, it's New York! Plus there's a place that serves beer and cider that you can take with you as you try to decide from which stall to order. The hall also hosts various events in the stage/seating area, including Game of Thrones watch parties, comedy shows, etc. Great for groups, dates, or a solo trip. I haven't been in the area long but I've visited this spot multiple times already.", "author": "Amara R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-27", "description": "I love a good market/food hall. You get a great grouping of grub, drinks, and who knows what else. Last night, when roaming around Brooklyn, my buddies and I needed nourishment and Dekalb, a formidable food hall, did the trick in solving our eating needs.\n\nI mean, if you really gave me a choice of marketplaces, I'd probably prefer Chelsea over Dekalb. And (no offense New York) neither have anything on Reading Terminal in Philly. But let's not undermine Dekalb because there seems to be a lot to love, at least starting with what's visible.\n\nThe setup staggers food spots all around the lower level of a shopping area. There's no rhyme or reason to where things are, but that's the fun of it, getting to turn a corner and discover what's being served up, or smelling something that makes your mouth water and having to hunt it down. This happened a few times in our stroll through Dekalb.\n\nNow some of these foody fronts might be originators within the marketplace, but you'll find legitimate names (Katz's Deli, Ample Hills Creamery) as well, giving off a respectable selection of choices. Honestly, I can't remember the name of the place I chose to chow down at (I know, I forgot to take a picture!). All I know is the sound of a chorizo and egg burrito bowl sounded like a winner. \n\nSeating is scattered about along with some standing sections, but luckily once my bowl was in hand, we found a spot to sit. Upon eating the thing, it was good, but didn't blow me away (also, where was the egg?). I think hunger won out over flavor. I still had a little room in my belly for at least one more item and I just so happened to walk by the aforementioned Ample Hills. PB Wins the Cup (a vanilla-based peanut butter-type ice cream) made its way into my mouth and saved the day, flavor-wise.\n\nOverall, Dekalb is a market hall worthy of visiting. I wouldn't say it's destination-worthy like some food halls *cough* Reading Terminal *cough*, but when in the Brooklyn area, perhaps to catch a game or show at Barclays (seriously, don't eat the food there), it's definitely something to check out. Honestly, I need at least another go at the foods down there to give it a true review, so expect me back in the future for more of the market hall life.", "author": "Josh G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-21", "description": "I am obsessed with this place!! There are at least two dozen very different food booths to choose from so no matter what you're hungry for, you will find something good to eat. Options include pizza, fried chicken, arepas, crepes, bagels, Spanish food, breads, Asian food, barbecue, deli sandwiches, ice cream, doughnuts, desserts and more! And they just recently opened up a new bar in the back with trivia and performance events, plus a large seating expansion, so you won't have to fight for a place to sit anymore. There is also a Trader Joe's located in the same lower level as all the food vendors, and on the upper floors of the building are retail shops and an Alamo Draft House. This place is 10/10 such a cool spot to come and hang out with friends or even go on a date. Casual but artsy vibes and you can't go wrong!", "author": "Dan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Amazed at this incredible find..I am not a fan of Chelsea Market and even without daylight peeking through, Dekalb Market better, less crowded !\nWe read reviews that talked about it being in a basement..whaaa...this is a cool, neon, hip space right under TJoes/Target. Community seating and music make it an instant party. No one puts baby in the basement.\nWe walked around for a good 15 minutes trying to orient and check out all of the choices before omitting to 2 buns from Bunsmith..the memorable Korean Chicken, Spicy and the complete flop, Bulgogi..(4.59 each)\nI saved the end of a black picnic table seat while my son sought out his next purchase, a shredded chicken and plantain Arepa (amazing) from the Queens Streetcart Aprea Lady and the winner of the day, a chicken  wrap from Kotti Berliner Doner Kabob, Turkish inspired German street food. A bit pricey at 13.75, but it was so good that we took one home for Lee. This was a combo of 2 types of chicken off of the rotating spit.\nSweets were hard to choose..we took home a hunk of Carrot Cake and 2 spanish pasteries from Dulcinea, one with creme brulee and the other smores. My son finished the day with a kid sized scoop of Snap Crackle Pop from the unparalleled Ample Hills Creamery (which has a freezing cold metal water jug, much needed by this time).\nParking is tough,  it was a Sunday and we lucked out, always the best day to attempt to park on the city streets.\nDekalb market is a great place to meet friends, everyone can  purchase what they like. We had almost no wait at any of the vendors and we look forward to returning soon !", "author": "Lisa E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-07", "description": "I been extremely excited earlier this year to visit this spot especially since it's one of Brooklyn's hottest food hall. I came here 1-2 times with friends and my fiance to try the different vendors and love that there's a variety of food and cuisines under one roof! \n\nWe've tried the following spots: Arepa Lady, Bunker, Fletchers, Dekalb Taco, Jianbing Company, Katz, Pierogi Boy and Fulton Landing. \n\nI never tried Katz before, so this was my first experience having their famous Pastrami sandwich which was quite expensive. The sandwich was humongous, but a little dry in my opinion. I feel it was a bit overrated, not that great. I tried the Banh Xeo from Bunker and it was a huge portion, but delicious and crispy. I also tried the jianbing which was quite expensive and it was a bit bland. My friends and I also tried the Pierogi sampler platter from Pierogi Boys - they were heavy and extremely delicious!\n\nOverall, a great foodie spot to visit every once in a while. I definitely would recommend bringing any friends or family that are foodies/friends to. It can be pricey, but worth the experience!", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "Dekalb Market deserves 5 stars for the diversity in options alone. \n\nI live close by Dekalb Market and frequent at least twice a week. There are nearly 40 vendors in the recently renovated space - all totally different and add much needed diversity in food options to Downtown Brooklyn.\n\nSome of my favorite vendors include Bunsmith, Cafe Davignon, Daigo Handrolls, Kotti Berliner, and Peirogi Boys.\n\nOverall, it's a great place to bring friends that are visiting from out of town, picky eaters that need a lot of options, or if you just want to do your own tapas style food tour.\n\n*Bonus* Understudy, a speakeasy style bar, is opening soon. So, stay tuned!", "author": "Katey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-02", "description": "I am really amazed by the quality and the variety of food in Dekalb. Deli, healthy food, desserts, international food, any kind of food that you could imagine is here. Among those that I have tried I absolutely love the paella at paella shack: large in portion and full of seafood, the hand rolls from daigo: very fresh scallop, and coffee from the little french bakery. \n\nI also like the fact that Trader Joe's is right beside, although it does get very crowded during weekends. There were crazy checkout lines.\n\nThe only downside of the hall is the lack of seating. There are less than 10 tables for 20+ stands.", "author": "Wenye X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-15", "description": "I used to grumble about insufficient seating,high prices and the many places that closed well before the stated 10pm lights out, yet I wound up going here all the time. I consider it a Yelp glitch that the name of the adjacent grocery store (TJ) pops up in the Top Three.\n\nHighlights include Belle Cheese, which allows a humble outer-borough kid like me to try upscale dairy offerings in a non-threatening forum. An existential question about Dekalb is how much to compare some of the ethnic joints to similar spots further afield. Dektalb Taco is one of the better ones; it's not exactly Jackson Heights but also not oddball fusion, with the al pastor and breakfast tacos among the highlights.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "I eat here once a week!\n\nIt has whatever you're craving for. I usually go for ice cream at ample hills, szechuan at Han dynasty, pastrami from Katz, oysters from Fulton Landing, handrolls from Daigo, healthy from two tablespoons or Jamaican food. Some of the stuff can be pricey for small portions. \n\nThey have nice decor and seats are clean. \n\nI like that you can come here and get a lot done! Trader Joe's here is never too busy for food shopping. Shop for yourself at Century 21 or Target. Then have a date at the Alamo movie theatre.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "Nice market hall that offers one of every kind of mainstream cuisine!\n\nTrader Joe's is connected to this market for grocery shopping.\n\nWhat stood out to me was the hand held rolls from Daigo!  Convenient concept.  \n\nPerogies seemed appealing to the palate if one feels like grubbing on that.  Arepas from Arepa Lady seems like a good street kind of eat if one is feeling for that too.  Jerk chicken if you want that comfort.  Paella Shack for that paella craving! \n\nNice variety that one can't go wrong to order up from!", "author": "Tiffany D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-02", "description": "Slurrrrrrp. That is the sound of me earlier tonight, and just thinking about Dekalb Market Hall. It's one of those places where you actually wonder: could I come back and just sample all the eats? You could, but it may take you awhile w/all the choices. There's also a TJs and Target so, you could pretty much have the majority of your basic needs satisfied there. :)\n\nI was there on a Saturday evening around dinner time, and not too packed. Finding seating may be a bit tricky bc of the overall crowds/especially if you're there during a peak time. Looking fwd to hopefully being back soon!", "author": "Mel G."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}