{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "Fine place to walk around that has a variety of places to choose from. Relatively clean the amount of people down there but would love to have more seating options.", "author": "Lexie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "An indoor food market with a wide variety of global foods - what could be better??? \n\nI wanted to try everything but my wallet wouldn't have been too happy as things can get quite pricey and costs can add up quickly! \n\nLocated in the lower level of a building that houses other stores like trader Joe's, target, century 21, flying tiger, and a few others, I don't think the food court is very prominent when looking from the outside. \n\nFoods range from paella, arepas, pho, noodles, crepes, seafood, tacos, pieroges, sandwiches, coffee, breakfast pastries, and other things. \n\nIn my recent visit I got the mariscos paella, pieroges, and a fruit crepe. \n\nThe paella was made very well. I was just a bit confused because I asked for the garlic sauce but the sauce given didn't taste much like garlic? (It was more of a subtle ranch) \n\nI want too much of a fan of the pieroges unfortunately. :(\n\nFinally the crepe definitely filled my dessert craving. It's a Japanese style crepe and it was sweet but not too sweetto. And the outer crepe shell was delicious as well as the yogurt filling that came with the Harujuku fruit cocktail crepe.  \n\nAs most mentioned, seating can get quite crowded during lunch on weekends. I came here at 11 right when most booths opened and seating was plenty however by 12pm seats were almost impossible to find. The bathrooms are also pretty clean here given the amount of traffic it gets so that's a big plus. \n\nOverall I'd definitely visit again to try all the stalls and there's a few areas closed off for renovations so I can't wait to see what's gonna pop up when they're done!", "author": "Anita W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-27", "description": "Crowded and over priced.  I suppose the rents are high there. Not much value for your money though. It does have variety and uniqueness.", "author": "Manual W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "WOW. Just wow. \n\nThe number of choices of amazing food you get to make is incredible! Go hungry and go with a friend - that way you can try as many things as possible. Personally I recommend the Asian buns, the tacos, the paella \u0026 the mini donuts. \n\nCannot wait to go back and try even more amazing food!\n\nOh, and TRADER JOE'S is next to this market. YEAH. Serious food business happening here!", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "Together with Trader Joe's this is probably the most anticipated opening in City Point, Brooklyn! For months we have been waiting and looking around for this moment. Finally, today, June 16th, 2017 they opened to the public.\n\nThere is a wide variety of vendors for all the different tastes out there. You can find crepes, burgers, ice cream, pickles, pizza, sushi, perogies, cheese, bread, cake pops, arepa etc...\n\nThe lines are infinite, but it's expected since it's the first day. Hopefully, they will be smaller in a regular basis.\n\nThe overall design and distribution is very cool, there is a touch of rustic elements and very nice lightning effects. Signs and murals all over with nice pictures and a homemade feeling.\n\nThere are communal seats, eventually more will be needed. The smell of the delicatessens make you feel hungry and you want to try everything on display. I cannot wait to see the development of DeKalb Market Hall a few months from now. There are still some spots that are under construction like the beer shop and Fortina pizzeria, they seem pretty much done, let's just hope for a fast opening.\n\nI will come back later on and try the crepes and the korean fried chicken...I'll let you know how it goes. I do have to say that the staff from the different shops were very friendly and very focused on serving the hungry first comers.\n\nI personally welcome DeKalb Market Hall and its vendors to City Point, Brooklyn! Expect a lot of reviews from me! So far 5 STARS for the overall presence and the diversity of vendors!", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "Market hall- Limited seating but they are working on it. No directory so you kind of just have to wander around. I would look up what you want to check out before you go so you're sure not to miss any vendors. Katz's is expensive at about $21 for their cheapest offering, which I believe is the same price as their manhattan location. There's no cell phone reception but they offer free wifi. \n\nArepa Lady - we tried the arepa de chocolo topped with carne asada. Supposedly it has corn in it but there was not a single kernel inside it. The meat was pretty tender but it was sort of expensive at $10 each.", "author": "Christina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "This is one of my favorite spots my sister took us to during our trip to New York! They have a ton of different local eateries here, from snacks, to savory items/meals, desserts, and drinks. We got a variety of things including Truffle Fries at Home Frite, baked empanadas at Dulcinea, and ice cream at Ample Hills. I liked everything and if I lived in the area, could see myself going back again and again to try different things. The truffle fries were good and all my sister raved about, but to be honest, I've had fries elsewhere that tasted more truffle-y. Ice cream was bomb though!", "author": "Shar M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-14", "description": "Know that feeling walking into a boutique and it's just you and a store representative? This is almost the same without the pressure and the scrutiny because, look at those prices! What a hefty monthly nut these misguided developers but on the shoulders of these small well meaning local Brooklyn businesses. Better to lean on Target and Trader Joe's and even Alamo to ante up. You'll find a good variety and  hate yourself after he small portions.", "author": "C. K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Great indoor food market. It's located downstairs in City Point, same floor as trader Joe's. If you're a fan of smorgasburg you'll love this place. There's plenty to choose from. Theres a french fry place, ample hills ice cream, Katz deli, a few bbq places, cake pops, and more. It's better to take public transportation here because parking is scarce and limited. There are a few parking garages nearby that's btwn $5-10.", "author": "Diana U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-19", "description": "Plenty of options. Kid friendly. Quick service and plenty of seating. Family tried Hana and Pierogi Boys and the Vegan place.", "author": "Jeremy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "I'm very excited about Dekalb Market Hall. I live very close to it, so I spent the weekend enjoying it. Also, since I live so close, I am not negatively affected by the lack of seats. However, quarters can be tight in-between vendors. \n\nI have had Nobletree Coffee and the bakery several times, as well as the bagels. (It's funny to be there between 7-8am when it's mostly parents with their small children. )\n\nI love the bakery and the coffee. Bagels from Hard Times Sundaes (had the everything) were good, but not the best I have had. However, they are fresh tasting and close. They will be my local bagel joint. \n\n(I've had lots of other things, but as it was at an invite-only, pre-opening party, I will not take them into account of my rating.)\n\nPrices can be a little high for some things, especially compared to another, original locations. However, that's part of the food hall experience. You can get it all in one, convenient location. You pay for the convenience. \n\nIn conclusion, I love this place and what it offers. It really livens up the food scene in the area and provides you with a diverse selection of delicious options. It will be a regularl part of my life as long as I live in the area!", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "If your tired of seeing ramen burgers and waffle ice cream cones at every food market you go to come to death row *suge knight voice *  lol but seriously this is a cute hidden little market behind century21. The layout of the market is different compared to other food halls. The way Dekalb market is set up all the vendors are packed tightly in the center of the hall and the outer space of the hall is for walking, perusing and tables ,stools and chairs. I like the variety of vendors that you don't see everywhere like the Jamaican patty place, a seafood place that wasn't Lukes lobster no shade Cuzins Duzins (gotta go back and try that) a burger spot etc. Of course this place is on trend and has its ramen station, Korean fried chicken some kind of fancy French fry but most of theses vendors are one of a kind besides the Katz and like one or two others. To top it off there's a traders joe on the same floor. Of course I'm coming back lol", "author": "Shamorra B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "The fact that this place gives me a Trader Joe's right above the subway is  reason enough.\n\nWinner!!", "author": "Randi C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "Extremely overpriced and overrated with extremely small portions. Don't expect to pay less than $15 for something that won't fill you up. I've given this place so many chances (been to almost every stand) and it's just not worth the hype or price. They think and charge more than manhattan. \n\nThe quality is average, the selection is great but the prices are absolutely absurd.\n\nDekalb is essentially a permanent food cart orgy.", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-14", "description": "Overpriced. Don't waste your time or money. This place needs to figure out why it's here and what they are trying to do. Don't get duped into getting any sort of quality meal here. Looks flashy and hip, but look the other way. \n\nWant some idea of what I'm talking about?\n\nHow about a pastrami sandwich from Katz for $20. \n\nYep, no no.", "author": "Mark P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "This market is really cool. It has a ton of vendors with authentic and diverse cuisine. Thus far, I have only been to the crepe place and the place with the delicious truffle french fries. I would love to come back again to try more vendors. They have every cuisine imaginable: vegetarian, Chinese, Ethiopian, Katz's deli, pizza and pasta, doughnuts, seafood, cupcakes, Thai and a ton of others that I cannot remember. There are a few negatives which is why I am not rating it 5 stars. There is no wifi service down in the basement market area. If there is, it wasn't working. The price points are high for all of the places and it gets so crowded that it can feel claustrophobic. There is also limited seating-- especially during peak hours. Come during off peak week days instead of weekends and enjoy some culinary bliss. Places like this make me happy and proud to be a New Yorker.", "author": "Meredith S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Dekalb market is seriously a must if you are in downtown Brooklyn- super close to Barclays and right off of the R line! It is a foodie's dream: tacos, cafes, Italian food, Vietnamese, Mediterranean, American, desserts and everything in between! Some popular spots such as Katz's deli, Ample Hills, and Fortina have an outpost here! They have ample seating- standing tables, small individual tables and benches if you are feeling social lol. There is a Trader Joe's as well!!!", "author": "Saira W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "This is such a great market! I had been seeing tons of videos for it before it officially opened and knew I'd love it. Finally after months of anticipation it definitely lived up to the hype! I would say it's comparable to Chelsea market in Manhattan with 40 vendors, there are just so many amazing options you have to go back maybe three times. I decided to go for the classics-- a pastrami sandwich from Katz, truffle fries from home frite, and ice cream from ample hills. The Katz sandwich was HUGE like I seriously could barely finish half so my advice is to definitely share with a friend. The meat was really juicy and delicious, the pickles were perfect. Then the truffle fries. Ah, I first tried these fries at Smorgasburg over the summer and never stopped thinking about them since. They come with a lemon garlic aioli and it's just the best combination since peanut butter and jelly. The small size was also really large and easily shared between 2 people. And last but not least, ample hills. Who doesn't love fresh homemade ice cream? Their flavors are so different it's a little hard to pick, but I went with the cookies and cream type flavor and it was delicious. \n\nOverall, this was such a fun time. It is in a great area for shopping and exploring. Went on a Sunday late afternoon and there were barely any lines! I can't wait to go back and try lots more.", "author": "Gabriella T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "My sister and I just happened upon the Dekalb Market because we wanted to see a movie at the Alamo Drafthouse but tickets were sold out. It reminded me a lot of Smorgasburg except you're not lining up in long ass lines and it's not freezing cold out/sweating in gallons. There's such a huge variety of cuisines that there's something for everyone! Everything smells so good and the music is honestly poppin'\n\nI got a Poké bowl from Wiki Wiki and my sister got some tacos. We also shared some fries from Home Frites with three sauces. Definitely would go back if I was in the area. There's a lot of seating opportunities or even a standing area with high counter tops to place your food.", "author": "Noa I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "As far as food markets go, DeKalb stands out for the quality of the grub itself. Diverse selection of vendors, at least as far as food style goes. Everything is definitely unhealthy and definitely expensive. I like to sample from a few vendors at food halls, so it was a little annoying that most vendors didn't have smaller portion options for less money.\n\nEnded up getting 6 pierogi from the Pirogi Boys stand for $12. Half potato, half mushroom, with sour cream and onions. WOW! I'm normally really picky  with pierogi, but these were fantastic. The dough was amazingly flavorful, unlike the bland dumplings you get at most places  These were only ones I've ever tasted that rival my grandmother's! Pierogi Boys deserves 5 stars.\n\nThough the food seems AMAZING, there are some downsides.... Like no air conditioning? I was sweating the whole time and did not feel comfortable lingering and taking my time eating  very unpleasant. Overall layout at DeKalb is a little chaotic and the aisles between stands are narrow, so it gets even warmer from close contact with grills and stoves. There is a good bit of general seating and counters to stand at, as well as counters at specific vendors. It's also in a basement and dimly lit.", "author": "Natalie H."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}