{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "The first thing down the escalator is a small little fridge cart serving ice cream or was it icicle pops.\n\nI would like to list every vendor down there but I'm just going to mention what I recall.\n\nOf course, the main are the $20-ish sandwiches from Katz. And then there is Bunker, the Vietnamese outpost of the original location. Bunker is, the only one or two/three, that has a few stools for seating right in front of it's stall. And the third on my list of vendors I have eaten at is Ample Hills Creamery also has a outpost here.\n\nOther than that there are a few I would consider trying including Fletcher's Brooklyn BBQ, which I saw at the Big Apple BBQ in Madison Square Park and just passed them by but glad to know they are at this food hall. I also saw Berlin to Brooklyn Kotti Doner Kabob I have seen in foodie media. Next to them was a Jerk Chicken stall. And a few feet down was a beer craft stall with what appeared to be 100+ craft beers. There are others like a mini doughnut vendor frying them up on the spot. And an Asian restaurant. There's a few more.\n\nSeating is everywhere around the food court. Restroom isn't that busy and clean enough.\n\nI stopped in Trader Joe's on this level and grabbed some groceries. I also picked up a few cuts of pork from Forager's. You can buy raw or have them cook it up. They are okay.\n\nThe food hall is big and has well known restaurants as stalls in it. I think that's why people like it and is why it's so busy. If I worked in the area, yes, sure I would eat there more often. I would probably splurge on Katz and Fletcher's BBQ at least once a week.", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "Love the variety of food available in the food court. Asian, American, Italian, Thai, mexican', Mediterranean.....  desserts, sweets and drinks!  Trader Joe in the corner if you need to shop too!", "author": "Mei T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "I love that this place is so hidden, decent variety of food stalls to check out catering to any cravings you might have. I couldn't fully explore this place as it was a quick stop off for food before going to Barclays to watch a game, but did get some bubble tea and food from the Hana noodle store which was quite nice with a price tag to match. \n\nI would recommend even just stopping by the check out the place and what it has to offer, I too am looking forward to returning sometime :)", "author": "Kelda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "Honestly an awesome low key spot! This place is so cool! It has a lot of great spots to eat and the atmosphere makes you feel like your in a futuristic underground food hall. They have loads of neon lights illuminating the place. The lines aren't long either and there is something to eat for everyone!", "author": "John R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "Great spot for lunch specials. Although the parking may be hard to find this area, the hall accommodates every eater so that no one goes hungry. \n\nYou have your Nutella doughnuts, your Katz's Fix, your spam musubi, and so much more! Plus Trader Joe's is the perfect addition. Sometimes, I just go in there to do my grocery shopping for the week and or buy my drinks to accompany my meal. \n\nThe shops upstairs and the movie theater also make this place a winning destination. If you're not a driver, it is convenient to go to as it is along the q subway line.", "author": "Deirdre L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-02", "description": "Large food market hall with many different stores ! There is something for everyone here unless you are really really picky. There is a variety of global cuisines, and foods ranging from healthy (vegan / vegetarian options) to not so great for you. \n\nBig open space and is located on the basement level, but the layout can be a little confusing.The seats are scattered throughout the food hall so you will just have to walk around to find open/ empty seats. Managed to find some quite easily a little bit after peak lunch time.\n\nIt is a little out of the way for me but I love food halls and would come back if in the area!", "author": "Natalie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-03", "description": "I say this is a must do.  It's right by the subway station.  It's new, clean and inviting.  I expected a large crowd on a Saturday morning, but it was just mildly busy.  So many stalls to choose from, seafood, Katz Deli, Korean, Jamaican....  I tried Negra Paella from the paella stand, \u0026 hubby tried Carne Asada Burrito Bowl from the adjacent Mexican stand.  Good grub, my dish in particular had a generous amount of mussels and shrimps.  Price is reasonable.  We grabbed one of the last few tables.  There were also cupcakes, gelato, boba drinks....  We tried Brioche with Nutella.  We left with a satisfying tummy.", "author": "Ross W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Ok i have been seeing this place online and when I visited NYC it is in my list. \n\nThe location is underground of a mall. Thus place reminds me of a food court that we have in Miami, 1-800 lucky.  Although the selection of food is good. They also have trader joe's inside.\n\nIt is a nice place to hangout and do a food tour. They have cafe, ice cream, perogi, jerks, poke, sushi rolls. \n\nThis place is a good place to spend with friend and enjpy good food.", "author": "Divine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "I'm visiting from out of town and staying at a friend's place nearby. Originally wanted to check out the Trader Joe's, but found this fantastic food hall right outside it!\n\nThey have a very impressive range of food, from all sorts of cuisines. The Katz's Deli stood out the most to me, but the portions were too big for a quick snack. I opted to grab a bulgogi beef bun and some truffle fries with lemon garlic aioli for my afternoon snack. I highly recommend both! The bulgogi beef was juicy and tender, though a tad salty, and a the bun was freshly steamed and slightly sweet. The scallions on top added a freshness and light crunch. A lovely combo. The truffle fries are fried to order and perfectly crispy. Not the strongest truffle flavour, but the Parmesan cheese and aioli steal the show. \n\nWill definitely come back for a full meal some time!", "author": "Angel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "We love this spot! It's 2 blocks from home, super convenient. Great for when we have a group of friends together so everyone can choose what they want! When it's super busy, I have a hard time snagging a high chair for my little, but it's not too bad! So many great spots here!", "author": "Tiphanii M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-21", "description": "I stumbled in here on my way to Trader Joe's and I love this market hall. I go often, I've tried a few food / drink vendors and I've been super happy with what i have had. They have so many different cuisines to choose from. From hot food - sweet food like ice cream and churros. It's fun to walk around but can be tricky to find seating as it is usually very busy.", "author": "Baillie Alysse P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "All around great place with great options for every palate. It's something like a foodie paradise. I uncovered my love for  Ample Hills Ice Cream here and I'll definitely be back to conquer to rest.", "author": "Amoi H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "It's funny how much change is happening downtown right now and with the new Dekalb Market you get a wide variety of everything under one roof.\n\nThere is shopping , a movie theater and a food court with so many choices there is no way you cannot figure out what you're in the mood for in any given day. From Chinese, to tacos to burgers and a station that caters to beer to hand rolled sushi, cupcakes, what's not to like. \n\nThe atmosphere is very laid back and relaxed you can also hear live music but I think it's on a Friday but am not sure if they are there everyday.  I love coming here especially if I have to meet friends for a quick bite to eat and everyone is in the mood for something different we all get to satisfy our cravings.", "author": "Almaria B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-06", "description": "Overall, this place is awesome. Pros: there are so many high-quality options, it's impossible not to find something you'll enjoy from the wide selection of eateries (something in the neighborhood of ~40 vendors to choose from). Cons: it's a shame it's in a basement; the layout is a bit confusing and scattered - but it's not that big where you can't walk the entirety of the food hall in ~5 minutes. It's also a little overpriced - but given the convenience and the selection, it's the premium you pay for the market's setup.", "author": "Faisal S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-14", "description": "You walk or take the lift down as though you're going to a basement. \nIt's next door to a Trader Joe's and downstairs from a Target and Alamo Drafthouse Cinema amongst other stores. If you're early for your movie (strong suggestion that you BE EARLY), you can come chill at this spot. Or come after. \n\nWide variety of food available. Vendors range from coffee to steak, fish, ice cream,  beer gardens, Jamaican cuisine, yep, they have it. \n\nOn the Saturday evening of my visit there was also a jazz band serenading. \n\nThough the space seems huge it can still get congested which can lead to \"fights\" for the little seating accommodation.\n\nI don't think I can afford here. **Shrugs**. We'll see.  \n\nThe End.", "author": "Freeyah-Knycky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "Located in the basement of City Point Brooklyn, Dekalb Market Hall is great for lunch and provides something for everyone. It also has a variety of snack options like donuts, boba, ice cream, French fries, and cake pops. Katz's has a location here, as well as Home Frite. I got two tacos from Dekalb Taco. One al pastor taco and one pollo asado. Both were really good. For those looking to grab breakfast a few places open as early as 7 am, such as Andrew's Classic Brooklyn Bagels by Hard Times Sundaes. There is lots of seating at Dekalb Market Hall, but it still fills up quickly during lunch. Trader Joes is also on the basement level if you want to grab other items to add to your meal or grocery shop.", "author": "Stephanie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "My hair stylist moved to Brooklyn from Manhattan and part of the reason that I stayed with her other than the fact that she makes my hair look amazing is because Dekalb Market Hall is so close to her new salon. Like literally.\n\nEvery time I go get something done, somehow, my feet take me conveniently to Dekalb Market Hall and I have to get a fried chicken sandwich from Delaney and usually something else, whether that's a key lime pie, a pastry, or a bowl of pierogies. \n\nHowever, let me tell you about the fried chicken sandwich from Delaney. It is amazing! With the opening of this venue, they've added the Ranchwich, which is freaking phenomenal like life changing, people! \n\nGo! What are you waiting for?", "author": "Rebecca H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "Place is dope. Lots of fun choices to chose from. We are a little bit of everything from every shop. A great way to spend a rainy day. Arepas were on point.", "author": "Felecia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "This food hall is right by Brooklyn Tech H.S. and a block away from Junior's Cheesecake. Street parking is not too bad, just have to be patient and it is conveniently next to the dekalb stop on the B and Q line.\n\nThere are signs directing you to the food hall, and it is located on the lower level of the mall. There are escalators, and elevators...so its very easy to roam about.\n\nThere is a target, trader joes, and I think a movie theater but I did not bother to go all the way up to the 4th floor to check it out. The shops and food stands kept me plenty occupied.\n\nOn to the topic of dekalb market hall....it smells delicious! tastes delicious! comfy spot. cozy vibe with wooden tables.\n\nKat'z, No wait, same massive portions and equal quality in flavor as their brick and mortar. \n\nAmple Hills, get their flight of 6 since you will have a difficult time choosing from their many flavors. (loooove munchies and the snap mallow pop).\n\nArepa Lady, order chicharron (comes with potatoes) and patacones (comes with guacamole) and the manzanas.  \n\nFletcher's, we love the brisket and fries combo! Ribs are fork tender. Expect a line.\n \nHome Frite, the must try is the steak fries...its a big portion of salad, fries, and steak all in one.\n\nForcella, fried pizza. nutella arancini. blue cheese and dried tomatoes.....\n\nCafe Davignon, Stumptown coffee!\n\nCuzin's Duzin, mini apple cider donuts.\n\n8 turn crepe, not bad. \n\nTaco delicatessen, do your taste buds a favor...order the trio of steak tacos!!\n\nNeed to come back for Paella....\n\nLines do form at some vendors, but its not uncomfortably crowded. They have plenty of tables/chairs and garbage cans marked paper/plastic/trash. The bathrooms are easy to find, well maintained and clean. \n\nIts easy to over eat and as tempting it is to order with your eyes you should pace yourself. There are so many options to choose from you will spend a good few hours here...chatting/eating/shopping.", "author": "Jane Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-11", "description": "Super neat spot that's great for Downtown BK. Food probably is a little over priced for a food court but the quality makes up for it. Over 50 vendors so def can find something for everyone. Plus beer", "author": "Robby A."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}