{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Fuck yeah! This place is a foodie's dream come true. I don't even know where to start. Coming here while I was pregnant was an every weekend occurrence and even after the baby is here our whole family likes to go and enjoy before some hardcore Trader Joe's shopping. The best!!! Highly suggest rice \u0026 peas from @Likkle More - fried chicken from Korean Fried Achicken Spot, Crab Nachos from the Taco Stand, Hennessy Donuts from the donut shop, Passionfruit Bubble Tea from the Ramen spot, and Parmigana fried pizza from the pizza spot.\n\nWill update with names of restaurant when I can !", "author": "Antoinette S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "The food hall at DeKalb Market is the largest one in Brooklyn, with 40 different vendors and cuisines ranging from Caribbean (Likkle More Jerk) to Chinese (Jianbing \u0026 Han Dynasty) and Pakistani (BK Jani) to Polish (Pierogi Boys) and literally everything in between. \n\nThere's plenty of seating and big restroom facilities too! The best part is the Trader Joe's right by the escalators so you can shop and dine to your heart's content.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "This place is GREAT. I've already been way too many times. It's literally walking distance from work and on my route home. WIN. \n\nI went in yesterday with a rumbling belly and no idea of what to get for lunch. With one quick lap around the hall, I settled on Bread \u0026 Spread. For $11.98 I got the short rib sandwich that comes on sourdough bread with blackberry jam. Let me just tell you that it tastes just as drool worthy as it sounds. Will definitely get that again. \n\nOther favorites are Bunsmith, Lioni Heroes, and Arepa Lady (which I haven't tried here yet but LOVE the Jackson Heights location). \n\nI know folks say it definitely can get overcrowded, which is true especially during the lunch or weekend rush. But I haven't had any trouble finding a seat when I've gone. \n\nI'm so stoked that I now have such delicious NYC/Brooklyn treats so accessible. Go hungry and leave satisfied.", "author": "Chey O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Love this place. It reminds me of Chelsea Market but it has a different flavor and style of foods - more diversity I would say - carribean, Japanese, chinese, Mexican - pretty much everything you can think of. It's great for families. I met a family that came all the way from Coney Island just  I enjoy the day at Dekalb.  I love the diversity in dessert eateries. There's a lot to do in this area. I live on the upper west side so making it out to Brooklyn to this area doesn't happen very often. My favorite snack was the cauliflower nuggets from Bunsmith!!! So good.", "author": "Brittni D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-04", "description": "At the Dekalb Market Hall I went to a good bagel place and a burger and milkshakes place. My friend ordered a double hamburger with pickles and lettuce and two vanilla milkshakes for us while I got a BLT sesame bagel. The bagel was perfectly toasted and the bacon was delicious. My friend really enjoyed her burger even though the presentation of it was not the best, and the vanilla milkshakes had good flavor. That atmosphere of the market was great, offering us lots of options of food, so much that it took us 15 minutes to decide what we were going to actually eat! Also, managers of the market were walking around, observing business in the stores and making note of how to make the market even better. This a great place to stop if you are shopping near Dekalb Avenue or just in the area!", "author": "Katie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "Dekalb Market Hall has some issues, but overall I'm glad it's come to the area.\n\nThe good:\n-The food vendors are great. Lots of places I've been to before (NYC classics like Katz's and Lioni's, newer places that have hosted Yelp events like Bunker and Bunsmith, and other favorites like Wilma Jean, Ample HIlls, Fletcher's BBQ, Foragers, and Paella Shack).\n-Lots of places I'd like to visit in the future, like Daigo Hand Roll Bar, Dekalb Taco, and Jianbing Company.\n-The place I did try was Fulton Seafood Landing Co (separate review to come).\n-There's also a beer shop inside, which has a good selection.\n-The Trader Joe's is great and has bathrooms.\n-A Han Dynasty outpost is coming!\n\nThe bad:\n-It's in the basement, so no sunlight and no cell phone service. They have free Wi-Fi, but it didn't work at all the whole time I was there.\n-The seating is either in the front or the back, but otherwise very limited, especially when it's busy. If the place you want to go to has dedicated seating, go for that. Otherwise, you'll need multiple people hovering around different sections while carrying food. Not great, especially considering the lack of cell phone service.\n-The space itself is packed. So don't go if you're claustrophobic.\n-No bike parking anywhere, really. Hopefully that changes when all the construction outside is done.\n-Most of the food is pretty pricey, even compared to their non-food court counterparts. A Katz's sandwich is $22... \n\nAll in all, if you want to try some great food, I can't think of a food court in NYC that has a better selection of must-try's. Just bring your wallet and be prepared for sticker shock.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Food heaven. Give everything a try until you  drop dead after too much food consumption! \n\nKatz definitely comes up on top. Its sandwich is good for 2-3 people if you want to share and sample other delicious option in the hall. \n\nWiki Wiki Poke is on point, so is Home Fries. Many other spots look legit it prob take more than a couple visits to try all of them. \n\nBe back for Ample Hill and more yumminess!  \n\nP.S. Trader Joe's is right here also!", "author": "Nancy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-25", "description": "The space itself is really really cool! I love how it's organized and appreciate all the seating/standing table options they have. It's so much less hectic than Chelsea Market since there's less people but also more room to move. I went here on a Sunday evening and only had to wait in line for 10 mins or less.\n\nI think my only complaint would be that I would like to see a little more variety in the food vendors represented. There's a lot of BBQ places and Latin food but we are missing Indian, Thai, Korean, Ethiopian etc. I'm sure the management company doesn't have much say in this but it would be great if it attracted some more varied vendors!", "author": "Carley P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "A really cool food hall that just recently opened in Brooklyn.  It's got a TON of vendors and food stands serving up everything from pastrami, BBQ, arepas, noodles, ice cream, crepes, pies, bagels, and pizza.  If you've got a hankering for something, odds are you can satiate your cravings with some delicious food from DeKalb.\n\nI grabbed lunch here with my cousins and we basically sampled a bunch of different food stalls.  I wish I had enough time/money/room in my stomach to eat everything here!  Instead, I settled for trying the following:\n\n- A Taste of Katz's (3/5): I wrote a separate review for this newly opened outpost of the famous Katz's Deli - decent, but not as good as their original LES location.  The pastrami and brisket were much drier here.\n\n- Eight Turn Crepe (5/5): I got a peanut butter and banana crepe from this food vendor and LOVED it!  The crepe was freshly made, tasty, and light.  The peanut butter was sooo good!  Not too thick but with a nice consistency and overall it was creamy, but had some peanut chunks to add texture.  The other crepes they have on the menu sounded delicious as well!\n\n- Steve's Authentic Key Lime Pies (4/5): I'm not a key lime pie aficionado, but to my untrained taste buds, I thought these were very tasty!  Nice tart flavor in the filling, but the crust is what makes it stand out!  It's got a great crunch to it and has a lovely graham cracker base to contrast with the smooth velvety custard.  You can order anything from a small, personal-sized key lime pie up to a full one if you want to share with more people.\n\nOVERALL: 4/5.  Really cool concept - I like how food halls are becoming more commonplace in the USA.  There are a lot of great vendors here which makes DeKalb an excellent place to grab lunch with a group... even if you have picky eaters, chances are they'll be able to find something here that they'll enjoy!", "author": "Eric C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "TLDR: Awesome food hall with a diverse selection of delicious food and drink.\n\nIf you're visiting Brooklyn and not sure what exactly to eat, why not just come to Dekalb Market Hall and have 40 of the best vendors all in one place? It's a great way to see the latest and greatest that New York City has to offer. \n\nFood halls are becoming more and more popular and I've been to a couple that I've really liked (e.g. Reading in Philly, Ponce City Market in Atlanta). For those that are in Brooklyn, I think you got a good one in Dekalb. The diversity of the food here is amazing and there's bound to be something for just about anybody in just about any mood. A few that I really enjoyed include:\n\n- Ample Hills Creamery (some of the best ice cream ever)\n- Bread \u0026 Spread (really good Porchetta sandwiches)\n- Craft \u0026 Carry (craft beer that you can carry about DeKalb)\n- Home Frite (truffle fries)\n- Jianbing Company (Shanghai inspired street food)\n- Paella Shack (delicious paella)\n- Wilma Jean (amazing fried chicken\n\nI'm no longer a student, but apparently a lot of places do give a student discount, so you can save a bit here and there. If I was a student at LIU Brooklyn, I'd probably be here everyday.\n\nMy only advice is to come here starving because there is just so much good food here, and you will leave absolutely stuffed.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-24", "description": "I'm so mad I just found out about this market food is  wonderful selection . Pizza and roast beef sandwiches from Katz are the highlights from my first visit . Anything from Kate on rye is a weakness", "author": "Michael S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "I would give this place 3.5 stars.  I actually came to City Point to check out the new Trader Joe's for groceries and Flying Tiger since I usually go to the store in Flatiron.  However, since the Dekalb Market Hall is right outside Trader Joe's, I might as well check it out after buying groceries.  There seemed to be a lot of stands so there's a lot of choices.  My friends and I went to the following vendors:\n\nWilma Jean - I got the fried chicken sandwich which was made to order so it was crispy, hot, and delicious.  It was pretty large and not bad for $7.  \n\nArepa Lady - I wish I could go to the Arepa Lady more in Queens but it's far from Brooklyn.  I got a queso (cheese) arepa which was delicious and tasted just as good as the ones in Queens.  It's a bit pricey at $5.50 but it's a large portion and a lot of cheese.  I topped it with garlic aioli and hot sauce so it was totally delicious.\n\nDulcinea - I wanted to try their churros rellenos with dulce de leche or matcha doughnuts but they weren't delivered yet.  We waited until 1:00 PM and still not delivered.  We actually got there at 11:30 AM initially.  They need to get better organized.\n\nI also wish they had more seating.  I'm sure they will work out the problems and hopefully this food hall will be just as good as the ones in Manhattan.  I'll come back to try the other vendors.  I hope I can get churros next time.", "author": "Julie Ying X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "The best places to eat are the places that satisfy everyone. Dekalb Market Hall is one of the best places to eat in Brooklyn.\n\nThe variety of food vendors is vast enough that it's almost too hard to choose where to eat. It's easy to wander around for a while and still remain undecided on your food selection.\n\nAnd of course, upstairs there is the Alamo movie theater, Century 21 and Target. Trader Joes can be found on the same floor. Close to multiple train stations, it would be hard to walk out on an empty stomach.", "author": "Adina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Great spot to try a bunch of dishes. It's like an indoor smorgasburg, but better because they're open all week long! The space was clean and on the same floor as Trader Joe's. \n\nI went on a Wednesday around 6pm and it wasn't packed at all. I wanted to try every dish, but sadly my stomach was not on board. Dishes from four vendors was all I could consume.\n\nDAIGO (1st stop): Tried the spicy tuna and salmon avocado roll. Super fresh!! Perfectly crispy seaweed and rice. \n\nBUNSMITH: The korean fried chicken bun was flavorful and the pickled vegetable on top was delish. The bulgogi beef bun was tender and flavorful as well (tip: add the house hot sauce).\n\nJIANBING: Ordered the jianbing base with lemon-garlic chicken. The combination of the crepe, egg, scallions, cilantro, their 13 sauce, chili sauce, a special cracker, and the chicken came together and made my tastebuds jump for joy. I chose the medium level of spice and it was hot, but a good hot.\n\nAMPLE HILLS CREAMERY (last stop): The dark chocolate ice cream was delicious as always, but the dekalb market only flavor was even better! It's a must try!\n\nI can't wait to go back to try other dishes and 99999 more hand rolls.", "author": "Ali T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-20", "description": "This is the best food court I have ever been to. Like nothing else. I would compare it to a bunch of food trucks in one large indoor setting. Hop off the train at Dekalb, and it's exactly 2 feet away!", "author": "Liza B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "This new market hall is dope and has Brooklyn written all over it. I wanna say this place is better than Chelsea market but that might just be because its not as packed and I dig the whole basement factory style vibe to it. \n\nInterior: Feels almost like a speakeasy market hall since its in a Century 21 shopping mall underneath where the Trader Joe's is location. Very smart combo I would say.\n\nFood:\nChurros: So damn good. crispy and sugary on the outside, hot and soft and sweet in the inside. I get the 3 mini ones cause that is enough for me with all 3 different flavors, nutella, dolce, caramel.\nBao Buns: Got the Korean friend chicken and the beef. Both so good, Korean friend chicken is def the best one there though.\n\nOverall: Haven't tried everything but I am planning on to. Great spot to just bite on different foods and you won't be spending too much but I'm okay with throwing down a market style place like this.", "author": "Andy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "This reminds me of a smorgasburg but indoors. Lined with food vendors offering different cuisines, it's bound to keep many people happy with plenty choices to choose from. Seating can be tough when it gets crowded since they have a few long benches in the front and back right now. You can also stand in front of the vendor space and eat there. \n\nWe hit the Daigo handroll bar, Dekalb tacos, Cuzin's Duzin, and Dulcinea.\nThe Daigo handroll was amazing. I ordered the scallop roll and it was so sweet (fresh) I could honestly eat 5 of those. My sister ordered the seared beef, spicy tuna and snowcrab and she LOVED all of them. She's not a big fan of straight up raw fish but took a bite of my scallop roll and even she was a fan!\n\nDekalb tacos was disappointing. Honestly it smelled better than it tasted and we were confused by the taco box that was being offered. For example, 2 tacos in a box for $7, comes with gauc. Ok but the regular menu for tacos also comes with gauc and it's the same price. Unless this is literal, like it comes inside a box versus aluminum foil wrapped. \nAnyway, I ordered the Carne (steak) and pork belly. The steak was nothing special and didn't even taste as good as the smell of grill meat wafting into the air. The pork belly was slightly better but both the meat was dry. The corn tortilla was a tad hard to bit into. It's not a crispy taco, just hard like it wasn't cooked or warmed through.\n\nCuzin's Duzin - freshly fried mini doughnuts - holy crap it's good! Personally I don't think you can go wrong with fried dough. It wasn't overly greasy either and fried perfectly. No oil taste, no burn taste, it was just downright delicious. You can choose powdered or chocolate drizzle. I hope they offer more toppings in the future.\n\nDulcinea - Churros - they offer up classic churros, filled churros or as advertised churro ice cream sandwich. The minute I saw the (rainbow) unicorn ice cream churro sandwich on display, I wanted it. Maybe I was too excited by the picture because what I ended up getting was not what I expected. While it looked like an ice cream sandwich, it definitely didn't look like a rainbow one to me. It was mostly pink and a melting mess. (Bring wet wipes!) \nWhile the looks was deceiving, it at least tasted good so I didn't feel completely scammed. \nFYI - if you want to IG this item, have someone with camera ready next to you. The churro part is warm so the minute they hand you the sandwich, quickly snap and start eating!\n\nOverall:\nI think this place has potential. It definitely has the feel of a soft opening right now with many vendors running out of food or drinks or not getting supplies delivered. (I wanted poke from wiki but they ran out of bowls) That's like starbucks running out of coffee. It can be slightly overwhelming so I do think it's helpful to go to their site and at least read up on some of the vendors. Or if you're feeling adventurous, just walk around and see what looks good.\nThey are still adding more vendors and seats so I will definitely come back for round 2.", "author": "Janet Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "Definitely a fan of the food hall due to the variety of stands and location in Brooklyn. (I'm looking at you, Steve's Key Lime Pie!) Prices, however, are ridiculously high; but I do understand shops mark up their items due to rent, so it sucks for everyone really. \n\nFood run down in the order of what I Pacman-ed through the food court:\n1. Daigo Handroll - salmon/hamachi/toro/saba/beef/eel-all the ingredients were delicious, would love to repeat the 6 rolls we ordered but we will try the rest of the menu when we're around again; fyi, items here are rather expensive but when in Rome...\n2. Hana Noodles - braised beef noodles and dumplings were average, nothing to rave about\n3. Cafe D'avignon - mediocre coffee, disappointingly chewy croissant, but the kouign amann was scrumdiddlyumptious\n\nSpace is limited so park your caboose and let others order the food. Many areas look unfinished but don't let that discredit the fingerlickin' good finds in here!", "author": "Helen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "The anchor to the new Downtown Brooklyn \u0026 it's on and poppin' . A visionary market for sure. Vendors include Katz's, pierogi boys, hard times sundae, pain d'avignon, Ample Hills, Fletcher's BbQ, Bunker, Fulton Landing Seafood \u0026 much more.\nThe Trader Joes adjacent to the market is on the verge of opening, making this a culinary powerhouse. Meanwhile, first day \u0026 the place is packed. Not a fan of the seating/ standing Prefer the Gotham Market layout a few blocks away. Otherwise, the area is on the verge of a retail/culinary revolution a far cry from the days when I lived in Boerum Hill. #Sadness", "author": "Franny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "Dekalb Market Hall is finally opened! I've been watching this building get constructed for the past year and was highly anticipating the opening of the food hall so I have more variety for lunch! But this is also when my wallet and belly goes downhill...\n\nIt's opened at 11am till 9/10pm. There's so much variety including viet, poke, burgers, rotisserie chicken, tacos, arepas, etc. It is located in the basement level of the City Point building. Trader Joe's is located on the same floor as the food hall. Upstairs is a movie theater, Century 21 and Target.\n\nCurrent list of vendors:\nAmple Hills Ice Cream\nAndrew's Classic Bklyn Bagels\nArepa Lady\nBelle Cheese\nBK Jani\nBread \u0026 Spread\nBK Juicer\nBunker\nBunsmith\nCafe D'Avignon\nCraft \u0026 Carry\nCuzin's Duzin\nDaigo Hand Roll Bar\nDekalb Taco\nDulcinea\nEight Turn Crepe\nFletcher's BBQ\nForagers Butcher\nForagers Market\nForagers Rotisserie\nForcella\nFulton Landing Seafood Market\nFulton Landing Seafood\nGuss Pickles\nHana Noodles\nHard Times Sundaes\nHome Frite\nJianbing Company\nKatz's Deli\nKotti Berliner Doner Kebab\nLikkle More\nLioni Heroes\nNobletree Coffee\nPaella Shack\nPierogi Boys\nPop Cake Shop\nSteve's Key Lime\nTwo Tablespoons\nWiki Wiki\nWilma Jean", "author": "Tina W."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}