{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Oh land of splendor, my tastebuds rejoice and my diet be damned. I had no idea they were even open, I only meant to check out the new Trader Joe's, and I squealed when I realized it. You could say that I am super excited about this addition to the neighborhood. \n\nI'm also pleased to inform you that the Katz (oh yes) said you could order MAYO with a sandwich. I honestly thought that was forbidden, I had no clue it was (gasp) acceptable to even utter the word. The quality is just as good as the original spot - pastrami sammie heaven.\n\nJerk chicken place? Delicious. The chicken could be a touch spicier (next time I go up a level, as I think I was asked for my preference) but it was crazy flavorful. Rice and peas AMAZINGNESS. \n\nAmple Hills creamery - thank you for the kid size option, it's the perfect amount to conclude dinner. \n\nHana noodles - tried several bubble teas so far. I seriously need to try this place next.  \n\nWikiwiki - the rice was a bit tough. I had a moment where I thought I was eating a piece of plastic. Also I didn't love the spam musabi, it was oddly dry. \n\nThe only grip that I have, and I know they are working on this, but the seating options need to greatly increase. Even more standing space to eat would be swell....\n\nCannot wait to try them allllll....", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "This place is great. It has a little bit of everything sure to please everybody in your group. 4 stars because the WIFI is terrible and some of the food stands are crazy expensive. They're getting more stands soon and I hope they get a wine bar and/or a real bar in the hall itself other than the wine stand (which is okay). \n\nI've been coming on a near-daily basis so my only real issue is the WiFi. Hope they improve it soon.", "author": "Jimmy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "I have been here like 10+ times now, and have tried quite a lot of the food here. Good convenience for adding more food choices. Though I don't like it that there is no reception in the food court. \n\nThings that are good to try \nAndrew's Classic Brooklyn Bagels by Hard Times Sundaes : good burgers and can customize for an ok price. \n\nAmple Hills Creamery - good ice cream packed with flavors and crunchy texture. For people who loves sweets. \n\nPaella Shack - I had the Valencia and found the chicken to be a bit dry. Otherwise it was good. My friend got the seafood paella with squid ink rice. The squid ink rice was tasty. I did liked it better than the classic garlic. I think one order should be enough for 2 people and get another side dish of some sort. It's quite filling. \n\nDaigo Hand Roll Bar - decent for price and value\n\nDekalb Taco - decent / nothing special to mention. Only had their tacos twice. \n\nEight Turn Crepe - decent / average. Not too thrilled. \n\nArepa Lady - sweet pancake with chicken and cheese. It's okay. But wouldn't go around telling people to buy it. Chicken was dry. \n\nThings to reconsider\nJianbing - a egg jianbing cost $14.50 with taxes included. This is crazy. Vanessa dumpling sells a beef pancake for $3 with sit down. It taste good and quality is better but not worth the $14.50. \n\nHan Dynasty - its alright. My friend thought it sucked though. I only ordered dumplings and the taste was okay. \n\nFulton Landing Seafood - this is quite mixed. I did not like their lobster roll but my friend thought it was fine. Then, on another occasion, I had their salmon with tater tots. Their salmon was overcooked. It was bleh... but the tater tots were good. \n\nBunsmith : avoid avoid avoid. This is not Korean food. The bulgogi was so poorly made. They just cooked the meat and added soy sauce. It was the most salty soy sauced bulgogi I ever had. The spicy Korean fried chicken was so disappointing. I really don't understand why everyone is recommending Bunsmith. I feel as though none of the reviewers had proper Korean food before. Unless Bunsmith messed up all three of my orders, I find it hard to believe this place is good. I had the spicy fried chicken, bulgogi, and soy ginger Korean fried chicken.", "author": "S L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "Update: back at it again wth some nachos and jerk chicken--to say the least it was pretty darn good. Only thing is the cheese used for the nachos kind of tasted like the cheese in a spray bottle. But other than that it was really good and the price was like 8$ for that --not too shabby!\n\n\n\nOk so:\n\nI spent about 50$ on a Vietnamese sandwich, a beer, a cake pop, and pressed juice. \n\nHonestly wasn't that crazy about any of it except the Vietnamese sandwich from bunker was amazing. I opted for the first sandwich option on their menu but asked them not to put pate (I hateeeeee pate).  The guy was really chill about it, didn't make it seem as if this was a weird request or anything so that was cool. \n\nThe sandwich was so good! I hate cucumbers but I felt like it was a perfect addition to the sandwich, to help cool off from the spicy heat. \n\nAwesome flavors, love the garnish, they had Sriracha available for use which I used anyway despite my sandwich not needing any extra heat .\n\n\nOk so I gave dekalb hall a 4 star review because despite the fact that it is hella pricy (not a surprise considering location), I just love the concept of it.\n\nI am a huge foodie and love that I can visit a place with many different options available all right in front of me.\n\n\nWhat I did not like however, was how many of the places were just instagramable but did not execute in the taste department. \n\nHowever I'm not sure if I had enough actual food to determine this as the Vietnamese Bunker stand really surprised me.\n\nI'll definitely be coming back :)", "author": "Bianca L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "First heard about DeKalb Market from a fellow Yelp Elite member, who tagged me in a video on Facebook; because she knew I was going to be in New York on vacation. After venturing out to where Ebbets Field was in Brooklyn, I hopped on the train for two stops and arrived at the Market Hall. I was very impressed with the outside of the building, and then once you get inside, there were New York delicacies everywhere; however I knew where I was going and that was to Katz's for a Corned Beef on Rye. Like the one I had last summer at 205 E. Houston, it was superb and very filling. The one down part to the market is the fact that there is not enough seats for the patrons. I really enjoyed the Market, and I compared it to Quincy Market in Boston. Looking forward to my next venture there on my next trip to the east coast.", "author": "Jeremy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "Dekalb Market Hall was supposed to open last fall, so I've been waiting in massive anticipation for it's official opening. \n\nI finally got an opportunity to check it out, and I have to say--it's pretty cool. There are plenty of vendors, although the stalls/areas are haphazardly spaced, and it's almost like walking through a labyrinth. There are few chairs but plenty of long bars to eat at standing up. \n\nAs I walked through, I noticed a handful of vendors had items crossed off of their menus--clearly, they hadn't anticipated this kind of traffic in its first couple of weeks.\n\nOther than the bleh layout, it was a lot of fun! There was plenty of good food, and vendors seemed genuinely happy to be there. I'm excited and terrified of Trader Joe's opening up this weekend, but I will definitely be going there to pick up some groceries.\n\nRecommended: Ample Hills (always, everywhere), Bunsmith, Arepa Lady. I must try Bunker next time--it's been on my list forever.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "I just love this place.  It most closely reminded me of Reading Terminal Market in Philadelphia.  This is 5 solid stars. Even though it can use some additional trash cans as other reviewers have noted, it's a small price to pay for such a great and diverse set of food stalls.  (ok, there could also be some additional seating)   Almost just outside the top of the stairs on the DeKalb subway stop, and you're home free.  I sampled tacos, a pork sandwich and a mexican donut and everything was reasonably priced, tasty and fresh.  The beauty of this, is that there is also other shopping inside this complex.  Trader Joe's,  Target upstairs and some other small co-branded pop-up stores.  You can make a nice day out of it here.", "author": "Jim P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "This is for the overall market, not for individual vendors. The highlights are, great location, Trader Joe's nearly open, C21 and Target too. It's a real destination with or without the market, and the fact that there are some really excellent food options (I'll review those separately) makes this a win, IF, and this is a BIG IF, they make some improvements fast before this place becomes a total mess. Here are the issues:\n\n1. Not enough food bins.  None near the actual tables. The ones that were there were already overflowing by 12.\n\n2. Seating is too limited.  There needs to be more, and the whole communal table thing doesn't help. \n\n3. WIFI DOESN'T WORK in the space, making it very hard to coordinate with friends/family buying stuff at the same time. Because seating was so hot in demand, I waited at the table for my husband while he tried to get food for us. He couldn't ask any questions because it's a wifi dead zone down there.\n\n4. Vendors should set up texting notification (if they fix the wifi) or the buzzing hand helds favored by shake shack and the like. Standing in one place waiting for some of the slower vendors was a total waste of time.\n\n5. There are LOTS of people coming here and buying stuff for their entire office. That's great for business, sucky when you stand behind them.  I abandoned the queue at Katz's after two separate singletons ordered more than a dozen sandwiches each. Many of the vendors were super slow, but hopefully that will improve over time as they get the hang of things.\n\n6. The more popular vendors need to provide queue rails. It was a mess without them. Signs that say \"order here\" and \"pick up here\" seem redundant, but noone had them here and it really made for a confusing ordering experience.\n\n7. They need a general service area to get napkins, forks, etc. Trays too.\n\nOverall, the vendors are very promising, and the location is great. Hoping for quick turnaround of improvements, as this will be an excellent destination food hall if they get this right.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Loved coming here. It's spacious and tons of vendors. Easy enough to find seating, even on a Saturday night. My new favorite food hall. And definitely the most diverse.", "author": "J. Karim A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Dekalb Market has a similar layout to Reading Terminal Market in Philadelphia. The market is filled with artisan food vendors. It's a great place to visit with a group do that you can share and sample many different foods. I had the opportunity to try items from Fulton Landing Seafood, Pop Cake shop, Arepa Lady, Guss' Pickles, \nBunsmith, Dekalb tacos, Ample hills creamery, and Home Frites.\n\nGreat selection of food and vendors. Spacious layout with plenty of tables. Some goods were marked up 50%.\n\nI would rate it four and a half stars.", "author": "Joseph T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "I'm glad my group went here on a Sunday as this is easily can be one of the to go to places here in Brooklyn.\n\nDulcinea - Churros with Spanish chocolate. It tasted the same like a regular churros but it was made fresh right before you and is served with hot chocolate as a dip. The combination is so good! Highly recommend. (Gotta try the churro ice cream sandwich next time..)\n\nPierogi Boys - They serve me the traditional potato + cheese perogies only that it was made from scratch. The dough is so good that this is easily the best perogies I've ever had! Highly recommend this spot too!\n\nFletcher's Brooklyn BBQ - Friend of mine recommended me their BBQ wings and it was a good call. It has that sweet and tangy with a kick of BBQ sauce that makes me want to eat for more. I would recommend this as well!\n\nJianbing Company - This spot is what I've been looking for and been meaning to try. I've ordered the beef jianbing and it did not disappoint. This choice easily became my favorite spot here in Market Hall!\n\nPop Cake Shop - We went here last for our dessert as we are nearly full. The idea is fun to eat but it was not so fun when everything was falling apart with the icing melting.. it still taste good but messy. I guess it was a-ok. \n\nOverall: \n\nI will come back here again to try out the different food stalls and update my review! Also, there's a Trader Joe's nearby so you can grab water for .69 cents prior to $3 the food stalls charges you with. I got lucky with parking as it is difficult to find but free on a Sunday.", "author": "Raphael R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "YES! All the foods you can want in one place \u0026 a trader joes. I was hesitant to come here because usually places like this are over run and not pleasant but the food hall is open and all the food options are easily accessible. There were a few lines at places but nothing more than a 10 minute wait. Theres a lot of asian options and everything I had was SO tasty. Can't wait to go back for dessert round.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "I wish I lived closer. Affordable and delicious food selection. I love all the different varities. You can go there every day of the week and have a completely different experience", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Dekalb market hall is a fun new destination in Brooklyn. With over 40 vendors everyone will find something - fries, pizza, Chinese noodles, sushi, poke, arepas, pierogies, and more - definitely the most variety I've ever seen in a food hall. The quality definitely ranges, and so do the lines. Overall it's a great addition to Brooklyn (and will be even better when more seating is ready)", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Can't wait to go back! There were so many options to chose from, all looked very good and definitely want to come back to try them. I started at Home Frite for their happy hour of $4 drinks on tap and then decided to eat at Arepa Lady. I got the Arepa Chocolo with chicken, SO GOOD! After treated myself to Ample Hill Ice Cream, unique flavors and delicious ice cream. Enjoyed every single thing I bought at this market. I definitely recommend you go and check it out!", "author": "Danielle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "You'll see so many varieties, you'll be in food heaven. It's like an underground lively street food fair that one won't be able to get enough of.  \n\nMy husband and I went to traders joe's yesterday to pick up a few items for juicing and decided to explore options for dinner. When I tell you they have everything, I'm mean EVERYTHING!!!\n\nOur aim was to sample as many items as possible on a $50 budget. We had tacos, Vietnamese soup, Dutch fries, cake ice cream, dumplings, a bagel with cream cheese and a burger. We pigged out and still took home cake and ice cream for dessert. \n\n\nWhat I like most about the experience other than the food, is the prices. The tacos are $4.50, fries $5, dumplings $4 a just to name a few. You actually can ball-out on a budget here. We definitely will be making this a regular.", "author": "Beware O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Lots of great and local food establishments at this enormous food hall. Prices are mostly decent and so far from what I have tried, the food is pretty damn good!", "author": "Rick N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Nice underground market with lots of food vendors.    There's quite a few food stalls here and each one looks has their little spots setup with good variety of different types of food.   This is almost like a food truck park, but the they're just stationary.    Definitely a cool spot to grab a bite to eat.   Looks like it caters to alot of business people stopping by on their lunch breaks.   There's not much cell signal down here, heads up.", "author": "Carson S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-01", "description": "[Update]\nJianbing w chicken... insanely dry - even w a soft runny egg, and hoisin sauce... \nI guess the shredded chicken was sitting around under a heat lamp all day?\nPancake was mildly disappointing...\n\nHave many variations of crepes with stuff inside it over the years... and this was one of the most disappointing\n[Update]\n\n*** ORIGINAL REVIEW ***\nFirst off, very happy this place is finally here... \nHad trouble finding it at first, and then had trouble figuring out where things were (once inside).\n\nWhat's even funnier is - had similar issues ONLINE! I mean... their website shows you which restaurants are there... but good luck finding any menus or what you can eat (it points to their Instagram accounts??!!)\n\nI get it... just opened... expect to be some growing pains.\n\nFinally had Lionis last night. Very good sandwich, but the toasting of the fresh Mozz, left it so had that it burnt the roof of my mouth (I didn't realize this till after the fact).... Very good bread, very good basil. Meats were ok, nothing amazing. But we all know the bread makes the sandwich.\n\nWhat's interesting is, Lionis doesn't sell any drinks. \nSo I walked around from place to place looking for soda. Just a simple Coke Zero.\n\nSeeing as everyone had mini-fridges... they stocked them mostly with Coke, Diet Coke, and Sprite... but let's face it folks, you are serving $20+ sandwiches with high-end ingredients to food-lovers in Bklyn... you're not at the Mall of America... WTF is with these crappy choices of drinks? (I mean we all know Coke Zero blows away Diet Coke, which tastes like chemicals! Some people have a Diet Coke addiction leftover from years of having no other choice... but I digress)\n\nMaybe have a vending machine with more drink choices? I don't know...\nI settled on a Mexican Coke (why on earth would I drink Diet Coke?)\n\nLike I said, I'm happy to have this place there, but seems like need a few small steps to iron out the kinks (like spending 5 mins looking for a recycling bin that was nowhere to be found)....\n\nGood... but not great... not yet.", "author": "Abul R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "My family and I finally had a chance exploring here on Monday.  I worked nearby but never have a chance going here.  First time have been here and I fell in love with this place already.  \n\nDekalb Market Hall have diverse food choice including Chinese style pancake from Jianbang,  Korean fried rice or bun from BunSmith,  sushi roll from Daigo,  vegetarians bowl from Two Tablespoon,  Hawaiians poke bowl from Wiki wiki,  and Pastrami Sandwich from Katz,  etc.  Anything you want you can find it here. \n\nWe tried 4 vendors this time: Jidan bing from JianBing,  Chicken Quesadilla from DelicatessenTaco,  LanZhou Beef noodle from Hana noodle station, Summer Satori from Two tablespoons. \n\nThe most I like are quesadilla and jianbang.  However,  I wouldnt recommend the noodle place since youll get a way better LanZhou noodle from either Chinatown in Manhattan or  8th Ave in Brooklyn. \n\nPro side is the market hall has different kind of vendors and food.  Con side is the layout of the place makes you get lost easily and the seats are all scattered.  \n\nI promised to myself already that I will try another 4 different vendors next time.", "author": "Vivian N."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}