{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "Awesome little food court area. So many selections of food. I walked around for 10 mins trying to decide what to eat. Ended up getting a burger from Andrews that was good but just reminded me of an upscale Wendys burger. Also tried a seafood shrimp platter from the place across from Andrews which was good as well just a bit salty. Loved the tater tots too! I would definitely like to try some other vendors especially pho.", "author": "Daniela H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I've been coming here since it first opened. This food Hall is super convenient off the subway. Unfortunately the prices are slowly climbing to city prices and I'd consider expensive for not a restaurant experience. Nonetheless the food at the various vendors are delicious. \n\nMy must haves are the fried dough pizza (slightly hidden near Trader Joe's) \u0026 truffle frites. \n\nI would skip Katz - it doesn't compare to the real restaurant and jerk chicken place - I really didn't enjoy the food from this vendor as much as I thought I would.", "author": "Mai J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "Best food court in America - amazing options - diverse. Even though it's new, it has character. Opted for Katz's. Loved the spot.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Way more options than you think. Take a full walk through when you have the time. Truly a bunch of different options. Only place to try Katz outside the city. Seating can be limited and not everything is affordable for being in a good hall. Every place I've tried has been good so far. Everything from BBQ to pizza, Jamaica to tacos. Trader Joe's down there if you feel like taking food home to cook yourself too.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "This place is straight dope - we finally have a Chelsea Market in Brooklyn with a totally different name and vibe ! Love the fact that there is a lot of different cultural spots as well as DRANNNKKSS! Only downside - more seating is needed but besides that great place to get some food with friends or solo if no one likes you.", "author": "Tanisha C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "Hana noodle station:. Minced beef noodle was flavorfully. Braised beef noodles was uninteresting.\n\nHad apps at Daigo hand roll sushi and it was spectacular!   Had the salmon wood ear mushrooms and scallop and it was so fresh!", "author": "Hercy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "If NYC is going to have mall food court, it might as well be awesome.  Dekalb Market is great except for the seating areas, which could use some more creativity (and more seats).  Still, the options for the food are vast, and many of them are of high quality.  It is a fun place to visit (but don't eat too much otherwise you won't be able to enjoy the queso upstairs at Alamo Draft House). \n\nIt loses 1 star for the seating and the fact that my cell phone doesn't work down there (which makes it hard to meet up with friends).", "author": "Ian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Yummy fried pizza!!! DeKalb Market Hall is a fun place for a delicious bite. It's fun place to visit with your family and friends. I enjoyed the experience and it's different. I totally recommend this place to anyone that wants to try a variety of food all in one place!!!", "author": "Kerry A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "This is a great place to go for food. There are many different stations that you can eat at here - so many choices. It's almost overwhelming how many different food places there are in the market. There's a Belle's Cheese where they make grilled cheese, there were two bakeries, and there was a crepe and an ice cream place. Definitely going to come back here.", "author": "Taylor A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "A nice indoor market with a variety of vendors. The real reason this place is a great stop is that is has Katz Deli booth. There's no where else to get Katz (outside of its original deli) so this is a good place to get it. Being in a food court Katz isn't the same, you can't tip the cutter to get more meat and the booth doesn't really have the \"Katz\" feel. But the pastrami still lives up to its famous billing. \nDekalb also has other good booths, such as a french fry booth, hand pulled noodle, and other good stops. So for a food excursion that will likely take up two hours or more I'd recommend stopping by Dekalb and seeing what it has to offer.", "author": "Charlie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "This food hall has diverse choices covering most regions of the globe. The only reasons I'm not giving this market 5 stars are for the simple fact I have only been here one time and need to try the other vendors to get a better verdict on the quality/taste. Also, its a little difficult to get a table to sit down as well. \n\nI chose the Spanish route for dinner. First choice was paella from Paella Shack. The saffron rice with mussels, shrimp and vegetables were plentiful and filling but would've preferred the white sauce on the side. Wanting to squeeze in another vendor, I chose to visit Arepa Lady (the flagship restaurant in Jackson Heights, Queens) and ordered the arepa choclo stuffed with sliced sausage, plantains and shredded queso fresco. There is something about the sweet plantain that puts Columbian dishes over the top. Delicioso!\n\nSurprised not to see an Uzbek/Georgian/Russian or Indian stand among the other players. There is only so much vendor space to go around. Maybe there will be some rotation in the future? I can see this market doing well in the winter months. You will pay a little more here, but being this is hipster downtown Brooklyn, it comes with the territory. It beats the usual boring suspects found in regular shopping malls.", "author": "Steven L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "A welcome addition to this neighborhood which lacked many good food options. These are plenty of vendors, just walk around and see what is interesting and pick it out. It can get very crowded at lunch time from  all the crowd coming in from the nearby companies. \nOne thing which can be done better is the seating. This is barely enough seating and too many people. Also the lines seem to be not well demarcated which makes it seem a little disorganized and hard to walk past. \nOverall the food is excellent and the seating/crowd management can definitely get better!", "author": "Nisarga M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Lots of great options. Plenty of seating. Nice atmosphere. Not so crowded and close to stores and subway. Will definitely go back.", "author": "J S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "I came across this place because I was taking my friend out for his birthday and we eat a lot, however it was too cold to go food hopping outside. This was the perfect medium. From noodles to burgers to Jamaican food to pizza to perogis! They have limited seating so that can be a hassle if you're going on a busy night, and some of this stuff isn't finger food. The prices are reasonable and the environment is festive during the holidays !", "author": "Kelly J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-04", "description": "Came here specifically because of Trader Joe's. I was hungry at the time, so I figured I'd get some lunch as well after shopping at Trader Joe's. I passed by a shop that sold pulled pork sandwich (I forgot the name of the place). If you are in a rush and you see a line there, do not go. It will take a while for them to get the food prepared. The pulled pork sandwich was good but it took a long time for me to get my order. But if you have the time, go for it! \nThe must try: Ample Hills Creamery! The ice cream there is amazing! They also let you get a sample of the ice cream if you're not sure what you want. \nOverall there are a lot of food here and it's worth a visit.", "author": "Anne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "This has been a game changer in Downtown Brooklyn. We've gone from not having any real great food options to an embarrassment of riches. Arepa de Choclo at the Arepa Lady, all day! This is the ultimate Colombian comfort street food and it's just a few steps away from me now, so I couldn't be happier. Katz Deli is the headliner, but there's lots of other amazing acts under the City Point roof, keeping the location fresh and unlikely to fade away any time soon. \n\nAnd with Trader Joes next door, it's the perfect one, two punch when it comes to food in the area.", "author": "Josue E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "love this place - this huge food court has something for everyone from hand made pierogies to jerk chicken. the diverse culinary options of NYC are all available here.\n\nBut don't think of it as your typical food court. With artisan quality, these are restaurant prices not food court prices.\n\nThink of it more like going out for a meal and not a mall food court.\n\nI have been here several times and am never disappointed.", "author": "Mireille R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "With so many options, Dekalb Market Hall can almost be overwhelming for someone who is willing to try anything.  The food and vendors chosen are superb, with an urban yet eclectic taste that reflects the evolving neighborhood.\n\nPartnered with the Trader Joe's and Alama Drafthouse, this is a perfect night out for couples.", "author": "Des R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "A lot of place to eat in side too many places too choose from! Loving this place but if your going here you have to take the train parking is hard to find only 1 hour parking meters I only found so far", "author": "Brian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "If you want variety for your eating options, then this is the place for you. This one location has 40 vendors with a wide variety of foods, from Asian to Southern and everything in between.  There is also a Trader Joe's here, so you can also shop for home.  Food ranges from $8 and up, so you can find something affordable and to your liking.", "author": "Jennifer H."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}