{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "4 stars for choices - yet less for ambiance. Lots of dining choices. As of yet - not a lot of seating. Tried Wiki Wiki - classic Poke Bowl. Was very good but not more than a scoop of Ahi Tuna. Filling nonetheless. The food hall is a cold and sterile environment. Maybe different lighting? Art for the walls? Paint the concrete floors? Not really a place to meet up with friends and linger sad to say. Perhaps this food market can see how other nearby markets that are above ground have a more convivial environment.", "author": "Robin M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-20", "description": "All is well at the Decalb Market except for Katz Delicatessen. The pastrami was ok, so was the hot dog. But the brisket, not to die for. Rather be dead. Dry, chewy, hard, and tasteless. $22.00 bucks. Stay in the city. See ya!", "author": "James P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "This place is amazing. I went three times in two days. All the food is great and very reasonably priced. The number of options is astounding. I recommend grabbing a beer (which you can walk around with) and checking out all the different stalls before deciding exactly what you want!", "author": "Dan W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-25", "description": "Really, Dekalb Market, what kind of extortion racket are you twisting your poor vendors into?  A pre-made Banh Mi costs $13 and gets schooled by the same sized, far fresher $7.25 sandwich from Hanco's a few blocks away; how much are you screwing the poor hipsters from Bunker that they have to mark up commissary mediocrity this much?  The music keeps playing for as long as the crowds are curious, but this can't be a sustainable model without fresh tourist blood that doesnt know any better.", "author": "Francesco V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "If I was only giving a grade for the wide selection of vendors, I'd go with 5 stars, but there are several things holding back the total experience. I would reiterate what some other reviewers have already said and hopefully management and vendors will respond.\n\n1. Prices are a tad high (+10-20% in most cases) in a majority of the vendors given what you are paying for. The pricing strategy reflects Smorgasburg; I can understand why Smorgasburg vendors charge higher prices as they have to run a business that only generates revenue one or 2 days a week. This is not the case with Dekalb Market Hall vendors. Standalone shops can operate at lower price points and they have considerably more overhead costs. I'm a local downtown Brooklyn resident and I likely would not be a regular at many vendors at these prices. However, I don't see DMH responding here as there is so much pent up demand and interest from NYers outside of Downtown Brooklyn, as well as tourists. However, I think it would be wiser to build up a base of regulars for the long term. I have noticed traffic is relatively light during the weekday (of this opening week) compared to the weekend crowds, suggesting the local customer base has lower enthusiasm than the weekend crowd of tourists and non-locals. \n\n2. Design - I understand that there is a strong need to make DMH seem \"Brooklyn\" (local artist murals, lots of wood, etc.), neon signs for nostalgia, and narrow aisles to promote a carnival atmosphere, but my overall opinion is 3-stars for the overall feel of the space. I really feel that I am in a subterranean space and a sense of claustrophobia when I go down there. It really doesn't have to feel that way as designers have many tricks to trick the senses that you're not underground. \na. Lighting - There is no natural sunlight that gets down there and the lighting design seem intended to let the neon signs pop, but there are several spots that are poorly lit. It doesn't help folks enjoy the wall art either with such dim lighting. Other New York food halls have done a much better job in this respect. \nb. Layout of vendors- many food halls push the vendor stalls to the periphery of the space to open up sight lines and provide a sense of a grand space. This is not the case here as the vendors are clustered in the middle and the few \"dead spaces\" are filled with some bench seating, certainly not welcoming to those who want to relax while eating. I understand that DMH wanted to max out the number of stalls given the constraint that Trader Joe's and 2 restaurants already lined the edges of the floor plate, so chose their current layout. Some improvements may be to either decrease the number of vendors, and/or increasing the size of the stalls, and limit the heights of the partitions between stalls to improve line of sight. \nc. Despite ceiling heights in the raw space being quite high, the effective ceiling heights in the space is low, adding to the sense of claustrophobia. It appears the ventilation system used up most of the space. I'm sure ventilation was a big headache for this space given the vendors they host (e.g. if Fletcher's smokes on site there is a serious effort to be on code ) and may have been one cause of the delay in opening. Despite this give-up the space feels under-ventilated, hot, and with stale air.\nd. Minimal seating for customers really doesn't allow folks to enjoy the market, so the space can't serve as a community hub, for friends to meet up after work for a drink, for families to grab a weekday dinner, etc.", "author": "Quincy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-07", "description": "It's gonna take a while to work through all the stands here, but to start I'll shoutout Two Tablespoons for their delicious veggie burger. Pricey, but yum. Nice to have proper vegetarian options there. The bakery Cafe d'Avignon is also great, with a very tasty, but also expensive, quiche.", "author": "Tripitaka T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "so fun this opened up! really good selection of vendors, a really wide variety!", "author": "Mushroom M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Finally open. Had a Churro Ice Cream Sandwich, it was good. Looking forward to go there and eat :)", "author": "Birkir G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-26", "description": "I like the idea of having different food vendors to choose from.  the food court is in a basement, along with Trader Joes, which have great selection of items.  There's a guy in a corner stand selling jars of pickles, Guss' Pickles - AWESOME. Must try.  I've tried the food from the Pakistani vendor, BK Jani.  Even though it says authentic Pakistani food on their advertising, it's not.  all of the guys selling was not Pakistani, not even Indian.  That alerted me at first that this may not be authentic but I tried it anyway.  Oh well, onto the next.  on my next visit, I tried the Fulton Landing Seafood sandwiches.  nothing to rave about.  I can get better tasting sandwiches for less price.  Overall, the place is cute, you have to look for seats but we always found some.  The food I tried is nothing to rave about and the prices with all the vendors are high.  If I am in the area again, I'll try a different vendor like the Jamaican food, Perogi Boys and Katz's Deli.  I love Katz's pastrami sandwich but refrained from buying because of cost, but when that crave comes, I guess price won't matter.", "author": "Ann D."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}