{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-25", "description": "I want to like this place more, I really do. But unfortunately I think it's a lot more style than actual substance.\n\nHere are my gripes with it:\n\n- There's not actually that much variety when it comes to food. Everything's on the junk food side, and you can get a lot of the same stuff at the different vendors. A lot of the food is overpriced, hard to eat, mediocre, and in general just seem like it's there just to cater to the Instagram crowds. Like the fact that the churros come in this impractical cone that just causes them to spill out when you pull them out. What. \n\n- The layout is awful and tends to encourage crowding. There are no good maps or directions telling you what's where, so you have to swim to through the crowds in order to find the vendor you're looking for.\n\n- Seating is limited and unpleasant. It's often delegated to a dark corner in the side. There are standing bars, but they're weirdly narrow that it's difficult for people to be across from each other as they eat their food. \n\nThere are definitely some standout vendors, but in general, a lot of the vendors have outposts elsewhere in the city that serve the food at cheaper rates than here (rent must be crazy expensive here...). I dunno. This place is fine, but I wouldn't go out of my way to come here.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Ate here with a friend for dinner the other night. It was SO hard deciding where to eat, so much looked good! I went with a burrata, lemon, arugula and Parmesan pizza. It was so good! She got the BBQ fries with meat from Fletcher's, somewhat less impressed. We both got drinks from the bottle store type bar, and split the dolce de leche churros for dessert. Overall, there's like 16 vendors here we both still want to try. It's an ideal spot if you don't know what you want or have a group with varying tastes. Only downside is seating- apparently there will be more coming soon.", "author": "April H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "I wanted to love dekalb, I really did; The location is wonderful, the space is clean and there's ample shopping as well as a trader joes...however the food fell short. I've been twice in the past week and the only thing worth going for that I've had is daigo handrolls. Made to order and exquisitely perfect, I could eat 10 rolls and nothing else in this food court. The sushi rice is perfect, the seAweed crisp and the fillings are amazing.  Now for the bad, the paella was disgusting. They basically just reheated a portion of it sitting around in these big pans and charge $13+ for gross way over expiration date frozen veggies, hard af rice and a few tiny pieces of burnt sausage and dry pork. We took two bites and tossed it. The fries were nothing to write home about, fries are fries and these were a bit sweet. Never had an arepa before but I'm a fan now! We got the chorizo with cheese \u0026 guacamole arepa and if you haven't had an arepa before do yourself a favor and go get one right now. The burger was $14 and honestly it was too well done although the bun was fresh. Haven't had a chance to try any of the desserts , none of them seemed enticing. It's a nice place to grab and expensive snack after shopping in the area but I'm disappointed by most of the food offerings", "author": "Sophie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Wow. Hit all the marks for a great lunch.....I'll be back soon.", "author": "J S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Very cool food hall that is definitely worth a trip over to brooklyn for. Right next to a couple of train stops which is convenient. So many amazing food spots inside it's overwhelming, I will definitely need to make multiple trips back to try everything. Some big names like, Katz Deli, Arepa Lady, Ample Hills ice cream, Boqueria and so many others. I had to walk around quite a few times to come to a decision on what to order lol. Theres really something for everyone in here. \n\nNice that there were some seating areas (not a ton though) and bathrooms. Would recommend hitting it up later on a weekday or early weekend for less crowds. \n\nCool that theres also a Target and Trader Joes upstairs in the same building. Knock out all your to-do's in one shot.", "author": "Diane B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-31", "description": "Everything was great. Food.etc.  However there was a oil or gas smell throughout the market. I would definitely go back in hopes the smell was temporary.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "This is definitely a cool spot that I found out about before my trip to NY. I originally went there to get Katz (i've been to the original spot in the past) but their prices seemed a bit outrageous in comparison to the last time I was there. Not sure if I just forgot, or they increased the pricing for this location. Anyway, there were so many other tasty food options to choose from that I easily forgot about Katz. I went with the frites and a spot that served small sandwiches (pork bun). Can't recall the names but they were both great! I wish that i were hungrier during my visit because there were so many good looking options like the donut shop! Definitely worth a visit.", "author": "Eddie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Love this place! It just opened on June 16, 2017. Hope the great vendors will stay and continue to make this a wonderful food hall in this neighborhood.\n\nMy current favorites are: Jianbing, Ample Hills (with a flavor that's unique to this location, featuring malt chocolate and Junior's cheesecake bits).\n\nI'm looking forward to trying more of the eats and am greatly anticipating the opening of the Trader Joe's and the Szechuan restaurant.", "author": "Helen L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-07", "description": "Very trendy place to hang out in brooklyn, food was meh. Try the cauliflower nuggets from the fake korean place at end. Totally not worth your $8, small portion and very greasy. They were freshly made so they get extra points for that. Fletcher BBQ place, try the barbeque wings, they were not even hot and bathed in BBQ sauce, will not have them again. We also have the bbq fries squares but wouldn't recommend that either. Finally the fried shrimps with potatoes tots. Shrimp were a nice size but they were only 5 of them fir $15.  Love that trader Joe's is right there. Next time i can get something in there.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Target open till 12...trader Joe's.....I love this place and the food court (: cute shops in the lobby.", "author": "Malinda L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Went on grand opening day 6.16.17 after work to check out Dekalb market hall. Heard it was biggest food hall in Brooklyn with 40 vendors. When I went down the escalators I saw the place packed with people. I walked around to examine every food vendor. I decided on 4 vendors. Tried Jerk chicken with waffle at likkle more jerk. The line was really long for this. When I ordered the jerk chicken with rice the cashier said they ran out of rice. What a disappointment. Grand opening day and no rice. Hope they improve on that. I tried the brisket tacos at tacos delicatessen and it was good but a little watery. I tried the seafood paella and the cashier messed up and had to wait 30 mins for new paella to be made. Not good customer service if you forgot a order and make your customer waiting that long. At least offer them something to drink while waiting that long. And lastly I tried the Korean fried chicken bun. It was good and moist. Lost of sauce so it make it not dry at all. Ways to improve after grand opening is to have more seating for customers. I was struggling to find a place to eat my food. All the seating was occupied. This food hall lighting is really dim. Not a bright food hall environment. There's no reception at some parts of the food hall. Should offer free wifi so people can connect to social media and post their food pictures. Closer to escalators you will get service. Not enough garbage cans to throw out the garbage. They definitely should add plants in the food hall to make it more lively and better for the air. I hope they have more food vendors that sell refreshing drinks. I don't see a tea or bubble tea vendor. After eating all the yummy foods I was thirsty for a nice drink. I had to go to target to get water which was more affordable. The food prices at Dekalb market hall is just as expensive as Chelsea market or canal st market. All food vendors take credit card. Most uses Square which is easy to use. Overall my first time experience was a good one. There definitely can be better improvement. I will go back when Trader Joe's open up.", "author": "Shiu Lei W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "I came here because it was raining out and I was glad I did!  They have a century 21, target, cool retro movie theatre that brings you food to your seats called Alamo l, a taxidermy bar and the most amazing food court downstairs with every kind of yummy food option, such as fried chicken, porchetta, bunker Vietnamese, Chinese street food like at the vendys, the tacos were tight, Greek/ German chick gyro was delicious and finished it off with ample hill ice cream! They could use a parking lot underneath it though...", "author": "Alan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "City point is my go to hub for food, groceries, shopping, etc. Dekalb market has so many great food options, and the Century 21 and Target are great additions to this building. City point is a great convenience for this neighborhood. I usually come here 2-3 times per week.", "author": "Briana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Love all the different food choices, I have not had a bad meal here! Also tons of different beer choices \u0026 desserts. I love going here and also there are some vegetarian options.", "author": "Karen P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "I love it there!!! Great experience, great food. I have a list of things to recommend, like the fried pizza, Andrews classic roadside hamburgers, home frite, Steve's key lime pies.... the list goes on and on.", "author": "Nemah N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-30", "description": "There are some interesting places here but the severe lack of seating is a major issue. Its also super crowded. Even standing spots were taken. I couldn't tell if the food was good because mine was cold by the time I ate it. \n\nIt's still under construction but it doesn't look like much seating. I'll update if I ever get a chance to come back.", "author": "Albert K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Ahhhh so I was super pumped to go to dekalb market hall being that it's like smorgasburg inside . I was overwhelmed with so many good things so much choices . We had to walk around first then decided on what each of us wanted . I got a veggie burger from Two tablespoons which is for vegan and vegetarians I also had their strawberry basil lemonade . Both was sooooo good . The burger itself held together in the bun it had some cheese on it . It was just so tasty we also got truffle fries from Home Frite which were delish and crunchy and it came with some type of dipping sauce . For dessert we went to the churro place . We had the traditional churros filled with dulce de leche and also chocolate and we had the bellinas (probably not how you spell it ) which are a Spanish donut filled with different types of custard we tried the pina colada one and the Oreo . The churros were hot and freshly made I wish the bellinas were also warm at least but they were also tasty . All in all I enjoyed the experience and I def will be back for more tasty foods !", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "This food hall had tons of different types of food. My favorite was the Erepa Lady. Katz deli opened a second location here, and rumor has it they may be closing the original location in down town manhattan. The cousins donuts are to die for, make sure to get the cinnamon flavor.  If poke is your thing, they have that too. I personally tried the Erepa, Katz, cousins donuts, oysters, and this fake Jamaican place that I would not recommend due to high pricing. Only reason the food hall gets a 4 out of 5 is due to small amount of seating. Rumor is more seating to come soon. Can't wait to go back.", "author": "Fahad K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "Cool spot to check out and walk around....have a beer and eat some food. Has Target and Trader Joe's which is awesome. Not a great place for strollers in my opinion but doable. Food is pricey and some don't take credit cards so bring cash. Overall I would come back.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "This place is AWESOME!\n\nA indoor, nicer Smorgasburg with 30+ vendors and almost no lines. \n\nKatz, Ample Hill, Pierogi Boys, and the fried chicken on a stick place were all excellent.  \n\nGreat food, good atmosphere, and you can carry your drinks around the entire place. One criticism I do have is that they need to create larger seating areas -  as a party of four, we were stuck holding our food while walking around most of the time, which is not conducive to sharing.\n\nA very cool addition to the neighborhood, definitely worth checking out.", "author": "Ashley G."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}