{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Great variety of food. There are also restaurants there if you don't want to pick from the stalls. They've increased seating since they first opened which is great, but I still wish there were more places to sit (although I'm not sure if there's any space left for that).", "author": "L F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "One of my favorite places to visit. So many choices! And great food, not regular fast food. I've tried bunsmith, Fulton landing, wiki wiki, periogi boys and paella shack.\n\nBunsmith: u place order, stand to the side get your food. I got the Korean chicken bun. Pretty big, large piece of Korean fried chicken stuffed in a bun. Highly recommend. \n\nFulton landing. Got oysters. Sat at booth. Oysters were small in a bad way, not plump and small but flat and small and it cost a lot. Don't think I'll be visiting again. \n\nWiki wiki. Got a traditional Hawaiian bowl. Yummy. Pretty large portion. \n\nPeroigi Boys. Got meat perogis. Had gravy on it. Really good. Sat at booth. Would get stein. Firstly made. U see them if sitting at booth. \n\nPaella Shack. My hubby got this, he really liked it.\n\nWill definitely be heading back to try other places. They have stand up tables to eat as well as picnic table at the far end. Go now before they get discovered by the masses and get super crowded.", "author": "K W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "The peel and eat shrimp at the seafood place was awesome! A little spicy and messy, but super delicious.", "author": "Katy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "Not worth the escalator ride down to the basement.  The food is overpriced and a solid 5/10, packed full of people with available seating for a fraction of the people there.  If you are looking to pay too much for mediocre food, this is the spot for you.  But seriously Katz was selling a brisket sandwich for $18, my friend got a pulled pork sandwich from another vendor and it was $13 for a small sandwich and a little container of coleslaw.", "author": "Quin B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-20", "description": "Don't order poke from wikiwikinomnom. Their rice is hard and portions are small. I ordered the classic shoyu tuna with extra salmon. They charged me $5 extra for 5 pieces of salmon. The only thing that's Hawaiian is the name, they're a ripe off.", "author": "Vez T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "If you want to walk and snack and try a little bite of everything just like a smorg only indoors and it's available for dinner - this is the best food hall with all the flavors. The hand rolls were so perfect one is not enuf, the individual sized pizzas (worth sharing) are deep fried then baked! Don't forget the tacos at the end of the hall. We had to split a loaded gigantic juicy Katz pastrami sandwhich four ways in order to save room for the crepe.", "author": "M Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "This place is located in downtown Brooklyn. The food court looks huge and there are dozens of vendors all around. There's also a Traders Joes by the elevator entrance. I browsed through most of the vendors and not too much really caught my eye. The only stands that stood out were Katz's and Ample Hills. Most stands are over priced, but that's typical for a market hall. They have sushi hand rolls, poke, tacos, buns, and many more. It gets crowded as the night goes on which makes it difficult to find a table or seat. It was a good experience, but I'm not sure I'd come back until I find more appealing vendors for my taste buds.", "author": "Frank W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "This is a fun place to check out during a lunch break or if you have family in town. I'm new to the area so I figured I would stop off and see it. It's a nice assortment of food stalls with a wide variety of food, but nothing I need to go back to. But again, I can see how the downtown lunch business would make it a big success", "author": "Noah E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Really fun place.  Lots of food options from all over world.  Not a lot of seating so might need to eat at standing table.", "author": "Sarah D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Brooklyn arrived a long time ago. Now we have a food market to rival the Chelsea market (the others done really compare). Still new with the lines to prove the pent up demand. Go in the off hours and sample everything.  Amazed at seeing Katz and Lionis in downtown Brooklyn!", "author": "Paul C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-25", "description": "This is a fun spot to have in the area. Its a bit of a walk from my place but id say on a nice day its worth the walk over. The actual food places are interesting. The curation doesnt seem to be fully planned out. A lot of the places are actually within the area of the market hall so I questioned why I would come here if I could just go to the spots. It doesnt have the most seating for how many people were there. Im assuming its only going to get more and more crowded as people catch on what is there. With target trader joes and alamo all within the same building. If youre walking around and want some good quick food and dont mind standing up possibly then Id say stop in. If youre thinking about travelling here from a distance Id probably pass and go elsewhere. Its not quite as fun and easy as something like the smorgasburg.", "author": "Drew P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-06", "description": "Went to check out Fletcher's BBQ because of the good reviews... Honest opinion, it could of been better... The Instagram pics were deceiving. The brisket sandwich was not what I anticipated it would be. The bite size sandwich cost me $13 a piece (I ordered three)... Wish I tried another vendor. Maybe next time...", "author": "Nadia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "There are a lot of vendors. The thing that attracted me the most were the Katz Deli and the sweets. Everything else was pretty standard. There is almost no signal anywhere since it's in the basement.", "author": "Min Qi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "One of the best collections of food in the city, let alone brooklyn! What a find!! They have collected an amazing group of businesses!", "author": "Julia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "Everything you can ever want for lunch is packed in this beautifully decorated and bustling market hall. Highly recommend the Pirogies from Pirogi Boys and Lioni's sandwiches, YUM!", "author": "Marisa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "It's very crowded and the prices aren't necessarily super welcoming, but there is enough variety and overall the place is nice.", "author": "Masha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Finally one stop for truly anything you could be looking for. I was there when it opened and have returned numerous times.", "author": "Noah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Daigo Hand Roll bar is a must try at this food hall! Highly recommend their scallop hand roll. The flavor is distributed so evenly throughout the roll. It's sooooo good!", "author": "John R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "came here for lunch today. nice trendy space, w/ 20+ vendors, \u0026 1 sit-down restaurant. seating scattered throughout. finally made my choice, \u0026 went w/ jianbing (Shanghai inspired street food). I tried their lunch special, which wasn't that special. you get one of their wraps, w/ either chicken or tofu, \u0026 bottled water/ soda for $15. If you wanted any of the other proteins, it was $1.50 more. If you wanted the San Pellegrino soda, it was another $1.50 more. food, overall, was good, but overpriced. As I happen to be asian, it would be considered, WAY, overpriced; a scallion pancake w a few greens, \u0026 some chicken; WOW! food was tasty, but, you just lost a repeat customer, w/ your ridiculous pricing.", "author": "Henry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "This is a pretty cool food hall that has tons of food vendors for you to pick from. From American, Asian, Mexican, and Italian there's so much to choose. Some food items that I've tried so far (Fletcher's BQQ, Bunsmith and Keylime Pie), are a little pricey for how much they give you but it's worth a try.", "author": "Anthony N."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}