{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "This place is amazing! Definitely a spot you need to hit up if you're visiting Brooklyn! There's live music, beer, and lots of great vendors. The idea is that you can try whatever cuisine you are in the mood for- seating is sporadic. We had Caribbean  style food and it was AMAZING. So many great flavors and the service was great!", "author": "Sherrin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "We have been here several times. It's a great place to come for the whole family especially when everyone wants to eat something different.It is also a cool place to bring guest from out of town being that everybody has different taste buds...plenty of different options to choose from. And on the weekends you can also find live entertainment.", "author": "J. Madison S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "LOVED THIS PLACE. They have everything!! From tacos to burgers, to sandwiches, to soup, to AREPAS. THEY HAVE THE ORIGINAL AREPA LADY. From froyo, to key lime pie, to cupcakes, to fish, to churros. THEY ALSO HAVE KATZ DELICATESSEN. LIKE WHAT?! it's also really clean, organized, and a fun place to be. The options of food are endless.", "author": "Melanie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Just found a hidden gem in Brooklyn! This place is perfect for people who wanted to try different global cuisines; from asian, mediterranean, american, europian, african, caribbean, latin america and many more! They even have some desserts and coffee shops, it doesnt really feel like a typical food court place because of its hip and artsy ambiance. I will def return and try the other food stalls next time!", "author": "Maria F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "Interesting visit here. \n\nWould be great if you live or work nearby for a quick bite. Otherwise it seems impractical. \n\nI had some dumplings. And they were good, but nothing special.", "author": "Frank G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-06", "description": "Been here twice and had bad experiences with the food. Now skeptical to try the other venders and the prices here can be expensive for some small portion food.", "author": "Laura F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "I Wish There Was A Way To Review Every Stand At The Market Hall On Its Own.\n\nI Have Tried Three Places Which I LOVE So Far And I Will Keep Going Back Until I Have Tired At Least One Thing From Every Place In There. There Are So Many Stands It Can Get Overwhelming. However, All You Have To Do Is Figure Out What You're In The Mood For And You're Good To Go. Choice Range From Seafood, Caribbean, Mexican , Southern Cuisine And More. The Items I Have Tried Are Reasonably Priced, The Only Thing That Is Missing For A Five Star Review Is More Seating. There Aren't Enough Seats For How Many People Flock To This Place Every Day.\n\nTip: Try Going Early They Run Out Of Things Quick.\n\nTry: Ample Hills Creamy Ice cream\n        Wilma Jeans Fried Chicken Sandwich \n         Home Frite Fries \nAll Delicious!", "author": "Teffaney D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "This is great. So many amazing food choices. The hard part is deciding which one!!\n\nI enjoy the community atmosphere and the open setup. I've eaten at at least three of the establishments and each one is great.", "author": "Clint B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "There are lots of food options here and the 5 of us tried poke bowl, fried chicken bowl, truffles Parmesan fries, churro.  The Classic Hawaiian poke from Waki Waki is my favorite!  The sashimi was fresh and they didn't put too much sauce like most of the other poke place does.  I will definitely go back for the poke.  The fried chicken bowl from Bun Smith was ok. The truffles Parmesan fries from Pomme frites was very good. The churro was my least favorite. They overfried them so much they were not only too hard, there were oil dripping from the churro.", "author": "Jane C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "My sister and I went here and I cannot wait to go back! We had two types of pierogies from a lovely little setup that appeared to be run by a family! They were very nice and the food was wonderful.\nWe also had a little bit of ice cream and chocolate churros! We didn't even have everything there was to offer, so I highly recommend the place.", "author": "Megan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Conveniently located above the B, N, Q lines (from Manhattan, take the last car), this place is a gem with so many food options to choose from.  \n\nMy friend and I had -\nKatz's - Pastrami sandwich $21.45 with lean meat ($2 extra), with tax $25.53, ouch! but it's a classic treat.\nFulton Landing Seafood Co. - Grilled octopus roll, $15 with tax $16.33.  It's like a lobster roll but with baby octopus.  Tasty but size is a bit small.\nJian Bing - Jian bing with beef, $13 with tax $14.15.  I watched enough Youtube videos about this Chinese burrito but it's kind of disappointing, the beef filling is very good and savory with lots of scallions which I love but the crepe isn't fully cooked, some parts were crispy, some were soggy like.  Maybe they were rushing to get the order out since the line was pretty long.\n\nI would love to try some tacos (another long line), key lime pies, arepa...ok, next time.\n\nThe layout of the booths is weird, nothing is straight and square.  Seatings are scattered all over the place and you are lucky if you can find an empty seat plus there's always the human traffic jam.  We couldn't find the restroom sign so we asked the security guard (duh!).\n\nYes, it's overpriced, crowded, you almost have to fight for a seat but I love the place, especially when Trader Joe's is right next door and Target is above.", "author": "Maki S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "I've been three times so far and this is my first review. There's a Trader Joes, Katz Deli, movie theater and a plethora of places to sit, eat and take a load off in-between shopping and roaming. My favorite spots to eat here so far have been: Steve's Authentic Key Lime Pie and Jianbing Company (delicious). I'm also eyeing the 'Doughnuts for Grownups' from 'Cuzin Duzin', who doesn't want to to try Hennessy glazed donuts! Definitely something for anyone at this food court. Not too many more details really, everyone's pretty much covered everything.", "author": "Natasha H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "This is an awesome marketplace near my office. My co-workers and I come here for lunch every so often. My favorites are wiki wiki, han dynasty, the trader Joe's, and Shanghai noodles. I have yet to try the jianbing and few others. Taking it one at time. Only drawback is the cost. It's fairly pricey, but the options ate great. This is definitely a nice place to live.", "author": "Will Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-31", "description": "Have been here so many times so It's about time I give it a review. There is a big variety of cuisines which is the major appeal. Plus, Trader Joe's is right inside and so convenient! Never fail to grab I bite when I step in.", "author": "Rhea S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "I am a sucker for food halls. The fact that this place has Katz's makes it an above average food halls. The rest of the places are off brand, but you can find a little of everything here.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "Only got to eat 3 spots, but looking to come back soon.  Sucks no reception for your cellphone but maybe its not a big deal. Uninterrupted food time !", "author": "Jeff L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Plenty place to eat here. I stay away from Katz, not sure why, I just like the one on Houston. But plenty of seating and so many choices I have yet to eat from them all.", "author": "Eric G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "This place is amazing I don't even know why I took so long to review it, I really love the fact that it is in a mall, but the food variety in here is incredible... I love how they pick so many different vendors and everything is so good.", "author": "Mariana G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Me and the family had a long day at the zoo and a long day on the subway.  We saw a sign for this place and thought we would give it a try.  I had no idea what it would be but was happy we gave it a try.  When we went down the escalator and I saw all the choices I was pretty excited. Then the smell hits you!  So many different choices and they all smelled so good.   The family was hungry but I said I couldn't decide till I looked at all the different options.  I started looking at the options, and then realized you could walk around with beer or wine.  It was also happy hour and a few places had specials.   So I had a beer then ordered food and later had desert.  \n\nYou should come to this place and try it out.  it is awesome!  \n\nI'm sure you know this already but the seating area was a little limited. But we did not have any issues finding a spot to sit. We will be back.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "At this food market hall, you will find a wide selection of all of the famous and \"well-known for a reason\" restaurants and small eateries you'd normally find in Manhattan. If you want churros and a pulled pork BBQ sandwich all in one, then this place is the place for you! Location wise, it is very convenient for LIU Brooklyn, NYU Tandon, City Tech, and St. Francis College students. It is located in the same building as the movie theater, Target, Trader Joe's, and Century 21. The only reason why this place loses a star is because there's barely enough seats to accommodate all of the customers that go there to buy food. So, do not expect to find an area for sitting to eat your food because chances are that all of the available seats and tables are taken!", "author": "Christine G."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}