{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "A bit on the pricey side and hard to find seating on the weekends, but excellent selection of food kiosks. Got an excellent Chili Aioli Poke bowl from Wiki Wiki this go around.", "author": "Colette H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "I've been frequenting dekalb market hall since it opened this past summer - it is a little (not so hidden anymore) jem! It has a great variety of awesome food vendors, many of which get really creative with their foods! It is definitely worth the visit.  \nTip: I recommend going during the week days vs weekends because it can get really crowded on the weekends. I love arepa lady, the Mexican spot (brisket tacos mmm) and the crepe place which all have great gluten free options for those who are celiac!!", "author": "Erica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Overall, the space feels crowded. Vendors are more packed together than most other market halls I've seen in NYC. It's so easy to get lost and have to go all the way around to find the place that you ordered food 15 minutes ago! That's the second bad thing -- for most vendors, you have to wait a while to get the food, and there's very little space to stand.\n\nI'd say the best thing is the food. Places my friend and I tried were all delicious. The market offered a very diverse range of options from breakfast to dinner, from sweety to savory, from cold to hot..\n\nAnd just like any other indoor/ outdoor food market you'd find in NYC, it feels like upscaled street food. You get street food taste, packaged better with a higher price mark.", "author": "You Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "There is so much to love about Dekalb Market. It is a perfect place to go for lunch with a group because everyone can get something different and still sit together to eat. This is not typical food court fare, these are high quality small shops that are sometimes outposts of loved establishments elsewhere in the city.\nAlthough it was a difficult choice I decided on Pierogi Boys and got the lunch special; 4 cheese and potato with a side of cucumber salad. You can tell the pierogies fresh made and served with a lot of caramelized onions and sour cream. The cucumber salad was a nice complement with lots of dill and herbs. \nThe group got several other options for lunch and then split some mini doughnuts from Cuzins Duzins that were little bite size pieces of heaven and I am still thinking of them.\nThis place is a food lovers dream.", "author": "Susan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "A few of us went on a Sunday as soon as they opened which was good and bad.  Some of the shops didn't not have certain items ready but it did not take long to fix that.  Plenty of good choices in this pace so tree will be something for everyone. \n\nKatz's, Daigo Handrolls, Tacos, The BBQ place, the bao bun, Lioni's and the ice cream were all very very good.  \n\nSome of the others were good but wouldn't travel back for. \n\nDefinitely looking forward to going back", "author": "Scott R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "Wide variety of stalls and shops in this place. From Italian, to Japanese, to Mexican, to American.  Most stalls accept card so dont worry about bringing cash.\n\nThe place is crowded but doesnt feel suffocating if that makes sense.\n\nTry to drop by before it gets overhyped.", "author": "Phil S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "I LOVE coming to Dekalb Market! I'm not originally from Brooklyn (west coast represent!!) so I'm still a lil scared of exploring the area - but it's so easy to get here! Few stops on the G train feel like nothing and I get to find SO many delicious foods and get to go shopping in the Trader Joes! Excited to eventually get through all the food stalls!", "author": "Kiyoko U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "It is such a nice and bright environment. The employees are very kind and the janitors always make sure the bathroom and tables are very clean. There's a lot of choices and free wifi.", "author": "Krystal C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "3.5 stars - there are quite a few places to choose from to eat, unfortunately none of them really appealed to us as we thought it would be especially since we had deliberately made a trip out here. \n\nNonetheless, still a cool place - just a bit pricey for the amount of food you get.", "author": "Julia H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-25", "description": "It's still too early to judge since they recently opened, but so far everything is just ok.\n\nLocation is excellent especially with the target and TJs in the same building/floor. Very tempting to grab something quick to eat on the way out...\n\nWhich comes to my next point, seating. Takeout is probably going to be your best option at the moment since seating is extremely limited even with the few standing tables available. Best bet is to grab some food then sit outside in the plaza and people watch.\n\nFood - so many choices, makes me super indecisive as there were numerous stalls I wanted to try, but seeing how everything other than a coffee or pastry will run you anywhere between $10-$20 for a meal, you're limited to only trying one item unless you're with one or two other people. That in itself will be difficult with the limited seating.\n\nI ended up only trying pierogi boys which cost me $12+tax for six potato and cheese pierogi. Everything was boiled to order so there was a bit of a wait and the pierogi were topped with sour cream,  caramelized onions, and chives. I thought it tasted okay, but doubt I would spend that much money again.\n\nLooking forward to trying Kotti Doener Kebabs next.", "author": "Kathleen C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-07", "description": "I've tried many of the vendors at Dekalb Market Hall and none are worth praising. The only establishment that's worth visiting is Trader Joe's. \n\nIf you're looking to visit the market hall, I would personally recommend you to skip the following vendors: \n\nThe Taco place- exceedingly expensive for no apparent reason. Horrible service, and worst of all, the tacos are cold.  \n\nHan Dynasty- If you are Chinese and looking to get some semi-authentic food, you will NOT find it at this place. This is a terribly overpriced restaurant where food is underwhelming and decor is quite ridiculous (at least to me as a Chinese person).\nNone of the staff are Chinese and they don't speak any Mandarin.\nTip- If you ever want to eat semi okay Chinese (per my standards, CA asian food scene is way better than New York), don't ever go to a place where there are no Asian waitstaff.\nI ordered take out by the window. After pointing the item I wanted on the menu to the waitstaff and repeatedly stated my order in English, waitstaff still managed to gave me the wrong order. Very Disappointing. First impression is important, and they've already lost me as a customer. \n\nI personally don't support Dekalb Market Hall because you can find so many other restaurants around Fort Greene and downtown Brooklyn that are affordable, delicious, and have great service.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Literally a million great food options of any kind of cuisine you could hope for! There are also a couple restaurants here now! I've eaten at the tapas place, the barbecue place, and the Italian restaurant and all were so good! It's also so conveniently located, essentially directly above the dekalb subway stop. The only downfall is that there's really not much seating. If you go with one or two friends you'll probably find a spot eventually but more than three people would be really tough I think to find a place for!", "author": "Caitlin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "The choices are endless! You can have authentic perogies and delicious Italian heroes! There are nice restrooms and the vendors are friendly. If going with people with different tastes you are in luck!", "author": "Shelley A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "I simply adore this place!!! Great selection of food and they have some of my favorites here like Ample Hills Creamery and Katz's Deli. I have fallen in love with Likkle More Jerk, JianBing Company and Home Frite. There are sooo many places I have not tried yes but at least you won't be bored by the food selection.", "author": "Ingrid B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "Love food markets!! And this was is just conveniently located next to a Target and Trader Joe's!! So I can probably come here once a week and just never get tired of it.", "author": "Sophie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "This is the real deal!  I am from Denver, where we have lots of amazing food halls, but this place is punching on another level.  First, it's hard to believe, but all of the food I sampled was all incredibly delicious.  I honestly did not have one bad bite.  Secondly, the options are amazing and immense.  Lastly, the vibe is so fun.  It was a great destination to go as a large group, but I would highly recommend for any sized party.  I will certainly be back!", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "Love the location and the fact that there are so many different options to choose from here. Other reviewers are spot on in comparing it to an indoor Smorgasburg. I'll be back!", "author": "Rachel E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "This place is super fun! There are numerous stands that create a fun, diverse environment. It's great for a date or casual outing. There are foods of all varieties spanning from doughnuts to pastrami to jerk chicken. No parking to speak of, but tats expected for NY. The missing star is for the price. The place is awesome and trendy but the prices are a little too steep.", "author": "Gabrielle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Highly recommended!! With all the food options here there is something for everyone, and it's all amazing! I had the brisket sandwich from Fletcher's BBQ, which filled me and was really tasty. My friend had an arepa from arepas lady which was also really good. On our way out we share ice cream from ample hill. Their cookie dough has HUGE chunks which is always a plus. If going on a weekday I recommend going a little early and stopping for a drink at one of the places with happy hour deals. I got a dry cider from the fry shop which had their happy hour from 7 pm. The cider was $4 and hit the spot:)", "author": "Laura W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "If you don't want to travel around Manhattan and Brooklyn to find the best spots, come here! All the top notch places, famous from the city are here! \n\nI love coming here, the food is delicious. Brooklyn juicer is super fresh, they have custom cake pops, BBQ, everything you could ever wish for...plus an ample hills!\n\nIt isn't too busy around 11am, but the afternoon is busy. I wish they had more spots to eat.", "author": "Kelly G."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}