{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "Awesome new food hall with more choices than you could ever need or want. Totally overwhelmed every time I go (in a good way) as to what to order!! So far, highlights have been the hero sandwiches, jerk chicken, arepas, pastrami sandwich, the scallion pancake crepe, and the beet veggie burger. \n\nA few downsides: very expensive, often very busy, not enough seating, and no cell reception (making it difficult to find people). \n\nOtherwise, very excited to have Dekalb market in the neighborhood!!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Utterly convenient superb food market.\n\nBeing right near the DeKalb station entrance/exit increases life's conveniences tons for 10000s commuting thru looking for quality quick food. Having entrances near the station as well as on Flatbush which has bus connections to tons throughout Brooklyn are superb planning. Its quality and cleansiness of the brand new location make all feel better. The sheer # of vendors is impressive and every one is Brooklyn's tops, from the best pastrami to the best beers to the best meats and bbq's to the best pickles, none of the vendors are a bad choice. Of course, the prices are high, I feel they're slightly higher than their original locations (haven't gone back and forth to research/compare), but expected given the likely rent here and the location's sheer convenience.\n\nFor cheaper eats, there's always the Trader Joe's alongside, but that's much more labor and less fun. Lots of sit down spaces, tables, and short lines all help a pleasant time.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-23", "description": "I was actually really excited to come here, after I saw a video on Facebook through Insider Food. I came on a Sunday, and there were surprisingly not that many people, which was a relief. So, everywhere we went, there was no line. I was expecting a lot more vendors, but when we circled around the perimeter, I was really confused. I kept saying \"That's it?\" And yes, that was it... \n\nHowever, the foods that these vendors offered were very good. If you have a chance to come here, definitely visit these vendors:\n- Arepa Lady: get the Arepa de Chocolo. It's a little sweet but it surprisingly goes well with the chicken and sauces. Probably the best thing I ate that day.\n- Bunsmith: the Spicy Chicken bun and Bulgogi Beef bun are SO good. The spicy chicken had a tteokbokki taste to it.\n- Ample Hills Creamery\n\nOn a side note: at Ample Hills, I ordered a cone and when I was ready to pay, my ice cream kind of fell apart. There were two big chunks that fell off the cone and I thought the guy would scoop some more ice cream since he's the one who was holding the cone when it dropped but he didn't... When he handed me the cone, I was a little bummed but oh well...", "author": "Yuri K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "I was VERY surprised on everything here. Fulton has changed so much over the years.  When I walked in I felt like I was at a chic food festival. So many options for food.\n\nI will say, to me, they're over priced but hey, it's the kind of clientele they want to bring in. The food was worth it. \n\nGood luck finding a spot to sit at, it was very crowded when I went on Saturday. I didn't mind though because we got our food quickly and we stood and ate. Lots of families and couples.\nThe food options are endless. My bf. Got ox tail and rice with peas. I had pollo pactacon(portions are okay)\n\nWe then went to the ample hill creamery... umm so good but the milkshake was too sweet. Lol not complaining at all just too sweet for me.", "author": "Doris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "If you are ever starving and find yourself at Dekalb Market Hall, you'll never have to starve. DMH is an awesome food hall with lots of amazing food vendors. There's also a Trader Joe's if you want to get your shopping done.", "author": "Chrissy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-15", "description": "It's literally a party to just be down in this hall , it's beautiful the music is great and there's so much to see", "author": "Jasmine J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-29", "description": "This is a nice food hall, with a lot of solid food options. These options, though, aren't necessarily unique to the food hall itself, which was a little disappointing. Things like burgers, fried chicken, tacos, I feel like I could get from many different places.\n\nDespite the limited food options, it's very spacious, will ample seating. I would highly recommend visiting a few different stalls in the market and sharing with some friends!", "author": "Janice M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "Amazing place to spend an evening. Tons of food to choose from, shops to browse in - even has a Trader Joe's! We ate a casual bite and then found a great bar upstairs. Perfect spot to spend a casual night with friends or a date!", "author": "Meghan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "Gave my brother my card to purchase something to eat. Imagine my surprise when he came back with a burger and nothing else.. no tray, no sides, no drinks, just a burger half wrapped. After tax is 13.88. Must be some quality meat but I'm not the picky type nor a foodie. 10/10 would not try Dekalb Market again. \n\nI won't mention the specific name of this place bc the burger was good and was made as advertised (their signature burger: caramelized onions and bacon -no lettuce nor tomatoes) and I also understand people gotta make a living and rent is probably not cheap but way, wayyyy overpriced. \n\nAlso ate nachos w chicken at another store and it was pretty bomb but it took a very long time. If I were to do it again, I'd order, walk around, and come back to pick it up.\n\nRather stick with SmashBurger or (definitely) Shake Shack.\n\nAmbiance: 4/5\nFood: 4/5\nService: 5/5\nPrice: 2.5/5\n\nDocking a star bc of the price.", "author": "Amy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-15", "description": "Sorry I don't get the hype. \n\nThere is very little seating for the crowds they seem to want to attract by having so many vendors. \n\nThe vendors also didn't float my boat save for ample hill. Just all the same overexposed Instagram \"stars\".\n(E.g. Katz deli is there with ridiculously overpriced and I've heard very average sandwiches *since I wouldn't buy them*.\n\nIt is nice to have another trader Joe's though.", "author": "Camille H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "I'm so glad a place like Dekalb Market opened up in an area quite accessible to me via the B and Q line. Given it is fairly new, I had low expectations but this place exceeded all of my expectations and is on another league of its own. I wanted to try every stall in the place and each stall had it's own unique dishes and style. They have so many options, cuisines, styles, etc, it is a perfect place for a group of friends who want different options. \n\nThe downside of this place is that it lacks a good amount of seating. It was hard finding a place to seat our party of 6 and we had to sit separately. I saw many groups of people doing this. I know they are working on getting more seating in there and I'm looking forward to returning. Also the prices are a little on the high end, but I think the quality of the food justifies it.", "author": "Erina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "Well well well....what have we here? An underground food hall in Brooklyn? Um....thank you!\n\nI stumbled upon dekalb market by accident, I came to check out the new trader Joe's (which is amazing). I was on the escalators heading down and it was like heaven smelling and seeing the incredible site. \n\nI love the variety of food options as well as the fact that it is indoors which makes for a perfect place to hang when it gets cold outside. \n\nI tried bunsmith, which sells different kinds of Chinese style buns. I had the chicken bun. I tried the spicy one and the sweeter option which was made with a ginger soy sauce. I enjoyed the spicy sauce better it was like a general tso sauce very yummy. The ginger sauce could have been better I personally think the ginger was overwhelming. \n\nI also had parmesan truffle fries from the frits stand. They were awsome, you can never go wrong with the fries at this place. \n\nThe only downside to the dekalb market are the seats,  I wish they had more seating areas so that you don't have to stand while trying to indulge.", "author": "AMANDA R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-26", "description": "It was just OK - if I compare this place to the reading terminal in PA ... ehhhh it was just OK...\n\nIt lacked more sitting areas.\nIt lacked more varieties of food vendors.\n\nI wasn't that impressed...\n\nI did have dulce de leche churros - it was wayyyyy too sweet for my liking .\n\nAlso had a burger - the burger was actually good ... But it was like a junior size ...\n\nHad a couple of other treats but nothing that memorable .\n\nSorry but I'll bite the bullet and keep driving to PA to the reading terminal.", "author": "Juliet Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Perfect food hall to sample various NY food vendors under one roof. Recommend 1 person staying back to hunt for a table/seats before splitting up to order food. For lunch we had a veritable feast featuring:\n\nArepa Lady - a chocolo (ground fresh corn) arepa with shredded beef. That green garlic sauce was next level. would try with chicharron next time instead cuz shredded beef was not as moist/tender as I would have liked.\nDaigo Handroll Bar - only eat sitting at the bar. the scallop is a winner!\nHome Frite - truffle fries came with ranch and a creamy jalapeno dip\nJianBing Company - tasted like a taiwanese beef roll\nKatz Deli - pastrami on rye nuff said\nPierogi Boys - Polish dumplings full of potato and chs / sauerkraut \u0026 mushroom / meat\nAmple Hills - ice cream! had me a kid size tried and true classic (pepper)mint n chip", "author": "Jennifer J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "Dekalb Market Hall is your 'year round smorgasboard' of a diverse range of food. Were talking good ol' BBQ, every kind of asian fusion, dessert-central, mexican and more! This is perfect for a group of friends that cant agree on a cuisine as you will have a plethora of options (and chances are you'll have a diverse plate as you steal your friends food...if you're lucky and don't get caught that is). \n\nSome of the issues with the Market Hall is the lack of seating. If you have anything larger than a group of 3-4, expect to not sit together and be crammed in on a picnic style table with loud strangers everywhere. It would be nice if they included more seating or somehow added benches and tables outside. \n\nOverall, it's a solid addition and a unique destination that will have a little bit of something for everyone. If you're comparing it to Reading Terminal in PA...yes you will be severely disappointed, however, there is a time and a place and room (in my tummy) for both!", "author": "Nicholas R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "This place is my own version of heaven. I was so overwhelmed with great choices I ended up getting a little bit of everything. It's easily assessable, getting a seat to eat isn't all that bad. Definitely make a stop here if you ever get the chance!", "author": "Briana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "I'm always very skeptical of food halls but Dekalb Market really impressed me.There's always the fear that a developer is hoping to stuff a space with half baked concepts and newest trends but the inclusion of long time Brooklyn staples like Lioni's puts me at ease. I went to high school in the area and so the idea of downtown Brooklyn becoming cool and trendy is pretty funny to me but hey, they're making it happen. The space is pretty large and has a wide variety of vendors - pretty much every cuisine you can think of is present here. The markup at some to me is insane (looking at you Katz and Pierogi Boys) but overall it's about what you'd spend at any decent mid-level restaurant. I got the Jidan Bing with chicken from the Jianbing Company and really enjoyed it - it was filling and delicious. I also got some donuts from Cuzin's Duzins as a dessert and it was cool to see him make them right in front of you. I didn't get Lioni's during my visit but I grew up near the shops location in Bensonhurst and cannot praise them highly enough. If you want a real Italian sub you have to check this place out. Overall the place strikes me as a good balance between somewhere people in the area can go for a quick lunch and a destination for tourists. On the second part especially I always have people ask me for where to go in New York and on a limited schedule I would tell them to go here and see what strikes their fancy. There is a general lack of seating in the area (and I'm not sure if it'll get too crowded with the Trader Joe's opening) which can be tough. \nOverall I recommend coming here to get a taste of New York and pushing yourself outside your culinary comfort zones in a space that's (mostly) pretty comfortable.", "author": "Nazary N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "Everything in here is about $15 with exception to Katz. Pretty good if you're in town trying to get options for lunch. \n\nPoke spot is very good but portions are small and will leave you hungry.  \n\nPaella place is just okay. Actually no, it kinda sucks. \n\nTaco place is very good. \n\nYou'll stare at the Italian sub place for 10 minutes before you decide on anything. By that time you'll likely be so confused, you'll leave and choose something else.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "This place is awesome! I'm a brooklynite and I truly dig this place, the ambiance, the variety of food and how could you go wrong with Trader's Joe down in the place looking all like it want to be looking!  Good for grabbing a bite after shopping or before a movie upstairs, a quick hang with the girls or fellas. The weekend is a lil busier, there is different music playing, and great there wasn't a lot of kids running around . More on the tween -adult side in the evening on wknds", "author": "Lipstick L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "Pierogies are delicious, ice cream is delicious, bbq is NOT good - super dry. Need more seating and cleaner bathrooms.", "author": "Annah I."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}