{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "If I were a multi-millionaire, I would love this place. It is clean, modern, well laid out and basically very cool. They have a nice variety of ethnic food places and a mix of well known and lesser known vendors. However for the rest of us, this place makes Whole Foods look like a bargain! \n\nOn the other hand, I give the Trader Joe's that is attached to the hall  5 stars for price, quality and service!", "author": "Neil B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "We all would agree that Brooklyn could've still been a grub go-to without Dekalb Market Hall, but we are happy it's here. Boasting a wide variety of local New York eats like Katz's and Hana Noodle, this place is another reason I love eating locally. I could go on and on about Ample Hills ice cream, or churro donuts, or giant cheeseburgers, but it seems everybody has already gotten on board. The concept is certainly nothing new, but the selection of vendors is impressive. It's like an indoor, year-round Smorgasburg. There really is something for everyone.", "author": "Dana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "I can only speak for the churros- which were delicious.  Hot chocolate sauce and crunchy freshly made churros- umm heaven?\n\nArepa lady arepa con queso was delicious.  The slightly crispy outer layer of straps combined with the soft sweet inside of the arepa covered in a mountain of shredded cheese was a perfect start to my evening!\n\nPierogi boys was pretty good.  We got the sample platter, half potato and cheese, other half beef.  There was a lot of dill in the beef pierogi.  It was good overall but a lot to eat.\n\nCan't wait to try other stands in the future.", "author": "Marjorie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "This place is a foodies dream. From noodles, to sweets, to seafood. If you love to eat chances are you can find multiple things to enjoy in the really cool, funky food court. Happy eating my friend!!", "author": "Victoria D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "Great selection of food booths. Will come back some time in the future.", "author": "Jimmy Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-14", "description": "A crowded sterile food court full of charmless facsimiles of New York institutions like Katz's with all the exorbitant prices of the originals but NONE of the ambience or history. Or waiters or tables. Or plates and silverware.\n\nCome visit glamorous new City Point for the new-money-foreign-tourist-favorite retail venue Century 21, but stay for Dekalb Market Hall's long lines, lack of ambience, dim lighting and overpriced food! (The Trader Joe's next door is aight. Less crowded than the Court St TJs. For now.)\n\nIts unclear what, if anything, inhabits the 500 floors above the Century 21 in this shiny gaudy aesthetically out-of-place tower  -- empty overpriced apartments or office space bought up by foreign oligarchs trying to leverage an investment visa as an escape plan while laundering their loot? -- but Dekalb Market Hall itself is, appealingly, in the basement. Again, of a shopping center in a slick sterile tower that crowds the iconic Williamsburg Savings Bank Building -- Northern Brooklyn's architectural North Star -- out of the skyline so as to create an outpost of generic midtown-style commercial retail (at last!) plopped down alone in the sucking vacuum of Northern Flatbush Ave's utter lack of street life (which this does nothing to rectify).", "author": "Scott M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "This place has a little something for everyone. There are a ton of places to eat and my goal is to come back every weekend to try something different. My favorite has Likkle More - they have a Jamaican burrito with pork that is both delicious and filling. Their beef pattie was awesome as well. \n\nThen there's BK Jani if you're in the mood for Pakistani food. It's pretty spicy so be prepared. \n\nMy last trip there involved a trip to Kotti Berliner where I had a doner kebab. The pita was different than pita i've had in the past. It was fluffy and thick, almost like a focaccia. I was skeptical but I was happy with it in the end. The chicken was well seasoned, the roasted vegetables weren't mushy, and the yogurt sauce on top was crazy good. Their harissa left me underwhelmed BUT overall it was really good.\n\nI plan on going back more and more until I try everything there. You should go now.", "author": "Deep S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "This place is like Urbanspace 2.0 but, much better! It is a new market hall with tons of vendors and is right next to a Trader Joe's and Century 21. It has A LOT of vendors. You can find everything from sandwiches to pizza to fried chicken to crepes to paella to Indian food and much much much more. I found it to be better than Urbanspace because of their extremely large variety. They also have some seating area and some standing area. If you wait or go at a less busy time, you might be able to find a seat. It's a little overpriced but, it's good for NY prices! The market hall is also very clean and set up in a great way. Awesome place for lunch!", "author": "Prachi M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "This much variety is unprecedented in downtown Brooklyn. But after two hours of mulling about, I left feeling a little confused. I wasn't sure if I enjoyed the Market or not.\n\nVariety aside, the layout of the hall appears to have no rhyme to reason. It felt too congested somewhat like a rummage sale. It was hard to feel relaxed with long lines, high prices, limited seating, and worst of all many vendors ran out of food by 1pm.\n\nWhat I ate:\nPickles -- Loved! \nPierogis -- 2 of 3 flavors sold out, mushroom wasnt great.\nSpam Musubi -- Loved first batch, but sold out afterwards\nFried Pizza -- pretty good, didnt understand why it cost $8\nMini donuts -- fresh and tasty, although they ran out of lemonade\nSushi Hand Rolls -- great service + food (favorite!!)\n\nOverall, the market could amount to a fun weekend out if researched in advance. I probably wouldn't bring kids here.", "author": "Patricia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "I went to the Dekalb Market Hall last week with some friends and I was blown away by all it had to offer. Because my friends and I couldn't decide on just one cuisine, we ended up getting food from four different places and sharing. Anything from down south barbecue to vegan options, this place has it all. I will definitely venture back as much as I can. I imagine it will take a few weeks to try everything just once. I also appreciate the location right next to Trader Joe's, so I can get shopping done right after I have a taste of one of the many choices I have at this place.", "author": "Brandon G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-26", "description": "This place is incredible!  So much delicious food under one roof. It's kind of like Smorgasburg but indoors, and year round. It's very tempting every time I need to go to Trader Joe's, or am walking home from work. Tasty food and options for everyone's palate. Delicious desserts too with ample hills creamery ice cream. I liked the vietnamese banh mi sandwich (spicy! so good) and the Shangai crepe place. I also tried the truffle fries at one place which was good.\n\nThe downsides are that it's a bit expensive, for me, so I would not go too many times. Many of the sandwiches and dishes are $12 or $13 for one item, which is pricey to me. There is also not always enough space to sit especially if you are with a larger group.", "author": "Akhila K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "This place has a large variety of food and you can find something you will like. Some places are a bit pricey, but it's worth it, if like me, you like to eat a little bit of everything and make your own tapas menu. You will find appetizers, entrees and dessert here. The only con is not enough tables during prime time-you or a friend might have to stalk a table like prey while the other catches the food.", "author": "Syndy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "This review is going to focus on the food selections of the market hall. I've gone to this location a few time to shop at Trader Joe's and had been meaning to check out the food selection for a while. They have many offerings from the popular Ample Hills ice cream to trendy Hawaiian poke. I opted for a fried chicken sandwich from Wilma Jean's and a C-me juice from the Brooklyn Juicer. Both were satisfying. The chicken sandwich was so filling that I was only able to eat half (saved the rest for a snack later), it was somehow both savory with a sweet smoky kick to it. However the woman who took the order was pretty rude or perhaps tired. But it didn't downgrade the food. \nWhile I liked my order from the Brooklyn Juicer I noticed that the cashier treated me differently from the white patrons (the level of friendliness and service was not there and I felt slighted). This is gentrified Brooklyn and all but all customers should and must be treated equally and with respect.", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "On our way to Coney Island, I noticed on the train there was a \"Dekalb\" stop, I remember following that name on Instagram which happen to be a food hall so I told my sis that we had to stop for food on the way back.  After a long day of riding the cyclone, almost shitting our pants, we were hungry. From Coney Island stop, it's a long ride to the DeKalb Avenue / Flatbush Avenue stop - the B, D, N, R trains stop here. From there, the DeKalb mall is literally right across the street in the same building as Trader Joes in downtown Brooklyn. I was stoked how close to the metro it was!\n\nWe headed down the escalator to the food hall. Apparently, it's the largest food hall in the borough! \nWe walked around to see what all the vendors offered and it was insane - I was overwhelmed with all the choices: Katz deli meats, perogies, churros, korean fried chicken, brisket, cake pops, noodles, sushi, tacos, croissants, ice cream GAHHHHHHHHHHH, I didn't know what I wanted. We decided to split up and grab whatever we wanted and meet up.\n\nI spotted home frites and immediately went to order the truffle fries I've been eying up on Instagram forever. I ordered a small order of truffle parmesan fries and I had the option of having it in a container or in a cone, I opted for the container. I waited a little bit before my order came, the fries are hand cut, drizzled with black truffle oil from the truffliest and sprinkled with a heaping of parmesan cheese, herbs and came with a side of lemon garlic aoili. I started eating as soon as I got my order where I saw my sister at Jianbing Company waiting for her order. I was eating so fast that I didn't even take a picture of my fries and I was finished my fries before my sisters order came out! SHOCKING (but it happens hehe). Nat ordered from Jianbing which is Shanghai inspired street food that is a scallion pancake which is filled with scallions, egg, cilantro, romaine, pickled onions, hoisin sauce, chili sauce and she ordered the 13-spice beef for a protein. It seemed to take forever for her order to come, and it wasn't that busy (hence me finishing my fries).  It came with two rolls, I pretty much had the majority of her second one. It reminded us both of the green onion chinese pancakes my dad made but thinner. There was a nice crunch to the exterior and the inside was saucy! I could really taste the hoisin sauce - it felt like a light refreshing bite to eat.\n\nWe walked around more because we wanted something sweet and spotted Ample Hills Creamery. I was excited (no surprise) because I did some research and Ample Hills Creamery was one of the top rated. Everyone working there was super friendly and let us try many flavors without hesitation. Their most popular flavor is ooey gooey butter cake which is a vanilla base with cream cheese and gobs of ooey gooey butter cake inside. I also tried a couple more and they were all unique and tasty. I went with one scoop of ooey gooey butter cake and one scoop of snap mallow pop in a cup. My sis got a scoop of ooey gooey and the munchies. OMGGGGGGGGGGGGGG, I loved every little scoop. The big pieces of butter cake in the ooey gooey was the best part - the vanilla base was sooooo creamy and delicious, the combination is indescribable, you MUST try for yourself!!! The snap mallow pop was YUM, it was a marshmallow infused cream with rice krispie clusters inside, you can definitely taste the marshmallow. Nat's other scoop was munchies which was pretzel infused ice cream with clusters of ritz crackers, potato chips, mini m\u0026ms and pretze pieces - I had a taste and it was a nice salty/sweet combo! All their unique flavors are so amazing!!!! We both took our time eating because we didn't want the moment to end.\n\nBefore we left, we walked by Steve's key lime pie and got a small one to bring home. We thought it was going to be amazing because if you are able to sell key lime pies alone, they HAVE to be great, right? WRONG. We were surely disappointed with the key lime pie. The crust didn't have that sweetness that graham cracker crusts usually have. The pie itself was MEH. Barely there citrus flavor and it wasn't tart like it should be! An overall disappointment.  \n\nIf I'm ever in New York again, I will make appoint to visit Dekalb food hall again, there are so many great options and it was my favorite food hall I visited while in NY (I liked it more than Chelsea market and Urbanspace). From my experience, I would visit home frites and jianbing again but try something else, visit ample hills creamery probably a handful of times in a day and avoid Steve's key lime pies.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "I am obsessed with this place. For one, their food court offers so many amazing options from some of the best food establishments in the city. From Fletcher's BBQ, to BK Jani, to ample hill ice cream, you would be hard pressed to find a place you won't enjoy in this food hall. My favorite is Bunsmith which offers delectable Korean buns in flavors like Korean fried chicken and bulgogi. There's also Mexican, Vietnamese, Chinese, American, and many more cuisines to choose from. To top it all off, there's a Trader Joe's located conveniently inside the food hall. I love coming here, grabbing lunch, and then doing my monthly food shopping over the weekend (let's face it, it's never good to go food shopping on an empty stomach.) Definitely a great place to bring your friends, especially if they're new to Brooklyn. And there are so many places to shop in the mall upstairs and in the local stores around the area.", "author": "Sam E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "I wish I lived closer (or maybe I don't I would gain so much weight lol jk) but such a good variety of food. My favorites are forcella, the taco place, and the BBQ place Fletchers is SO GOOD.  There's a restaurant in the Dekalb market also called Fortina HIGHLY RECOMMEND omg such amazing food!!!!! Arancini incredible Pasta with meatballs incredible pizza delicious CHEESY GARLIC BREAD is a must get sooooo good. Also- the MOSCATO!!! Really amazing and the owner is SO SWEET!!! Highly recommend", "author": "Joanna E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-31", "description": "It was our first time as we are visiting from LA and I have to say that there is a little bit of something for everyone here. The only downside is that because we are from LA we compared it to the Grand Central Market back home which had more vendors and unique foods. \n\nHowever, I do recommend the following:\n\n1. BunSmith-Korean Fried Chicken it was small but reasonably priced. \n2. Eight Turn Crepe-Strawberry Nutella and Banana Peanut Butter was great and super filling\n3. Taco Dekalb-Al pastor taco with everything on it was really good and flavorful \n4. Home frite-the garlic aoli fries with curry ketchup was also pretty good", "author": "Nichole A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Look at this stuff\nIsn't it neat?\nWouldn't you think my collection's complete?\nEhh who am I kidding? Let's eat more. And this is the place to do it. Come hungry and with your favorite company. I came here once with mom and once with HTB. First time: Katz's sand which, swingle, coffee, and churro. Take two: Arepa, pickles, raw oysters, lobster blt, chicken on stick,  diy crepe, coffee. \nWalk, don't run. You could fall, break your ass and have terrible hospital food instead.", "author": "Dina V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "I'm a big fan of the DeKalb Market food hall. Although as some other reviewers noted, prices can be a bit high, in my experience, most of the pricier stalls give portions large enough to share. For example, the Singapore Street Food stall (sorry, can remember the name) serves enormous dosa like stuffed pancakes that cost about $14 a pop, but one easily feeds two people if you also have a side. Likewise, a $20 sandwich at Taste of Katz's easily feeds 2 with leftovers, especially if you add a knish. The taco stand has very reasonable prices, as does the pirogi place. My advice is walk around and pay attention before ordering. And get your beer at the craft beer stall. They have an amazing selection at decent prices. Just don't plan on sitting to dine: if you are lucky or willing to circle like a vulture, you can find a table. If not, there are usually plenty of standing spots at the communal counters.", "author": "Denise P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Way too much food here! I was having a hard time selecting. Very simple experience and so many places to try out. I love how you can almost get all 3 meals here ( breakfast lunch and dinner) its loud, so definitely not a intimate place, but there is ample seating arrangements and ample food choices. Doesn't get much better than that.", "author": "Kyle N."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}