{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Summary\nA food hall with tasty treats for every palette.  A literal smorgasbord of yummy food from America, to Asia, to Europe, and back.  What a great way to spend an evening than to taste all that can fit in your tummy!\n\nAtmosphere\nLike a bustling street market in some far away land.  No lack of choice here.  Everyone was happy.  How can they not be?  So many choices and every stand is happy to serve.  Delightful!\n\nService\nEvery stand was crazy busy but still cordial and ready to chat you up on the various origins of each food.\n\nFood\nSomething for everyone.  I had the pierogis, which, having come from Poland, I must say, they are absolutely delicious!  The sushi handroll, phenom!  Cake pops and bubble tea?  Hell yeah.  All treats, for all tastes!", "author": "Paul H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Yeeees, after hearing about a rumor of something like this for what felt like years, it's here!\n\nDoes it need more seating? Yes. Do you kind of wish there was cell reception in the basement? Yes. Do I care about any of those? Nope.\n\nMore than food, there's a butcher, there's a fish stall. There is/was a live band! Trader Joes is RIGHT THERE! Some of my favorite places: Katz, Ample Hills, also, RIGHT THERE! Japanese Crepe, yes! Pho? Yes. Fried Chicken? Yup! LIONI'S?! YES!!\n\nSo awesome.\n\nSince it's still *relatively* new, I keep worrying if it'll be able to handle more foot traffic. I've only been for dinners, but it's done great so far. It hasn't been overstuffed at all. I'm really impressed with the variety of stalls, and the different stall layouts. Each still has been very unique in how they decorated and made use of their space.\n\nAlso, if you are a beer drinker, then huzzah for you! You can walk around down there with beer in hand.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "The best thing to have happened to DoBro since Junior's hehe\n\nSuch an amazing food court with an eclectic array of food options - BBQ, Spanish, Mexican, Chinese, Japanese, Korean, Hawaiian, Rotisserie Chicken, Vegan, Ample Hill, KATZ and the list goes on.\n\nMy personal fave is Daigo, which is the hand roll place. Most of the hand rolls are $5.90 and you have the option of eating at the sushi bar or having it to go. The chefs make them super fast and they are so delicious. The yellowfish and salmon are my personal go-to's!", "author": "Jane N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Quite busy when I came on a Sunday but worth a visit if you're in the area! Place has a lot of different cuisines and can cater to anyone's tastebuds and diets. Tried the famous pastrami sandwich from Katz ($22) and the hand rolls from Daigo ($7-10 each) and they were all delicious. Only downside is that it is very very pricey, your wallet will hurt if you wanna try multiple vendors unless you come with a group and share. Some items did not seem worth it at all but for the convenience and comfort here it might be for some people. If you enjoy Smorgasburg, you will like it here!", "author": "Andy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "There's Trader joe at the basement of the mall. It's a smaller size than the one in union square. There are less people that know about the supermarket there so the line goes fast and not as long. \n\nThere is a food court with ice cream shop, Asian noodles, snacks, Italian food and anything u can think of! Lots of good food! Highly recommend going! The upper levels has target, century21 and copenhangn tiger shop! Lots to shop and can spend half the day there! However no parking available only on the street. Recommend to just take the train to get there (dekalb subway stop) q train.", "author": "Jay H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "This is a great place with lots of variety. The churro place is excellent with creative stuffed churro options. There's also ice cream from Ample Hills, and a bunch of different cuisines like Chinese, Hawaiian, Jerk, BBQ, Pizza, tacos, and more! Plus there's a Trader Joe's so...", "author": "Sarah J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-06", "description": "Overall, pretty below average experience.  I went to Andrews Roadside Burgers, Dulcinea and Lioni Heroes.  Customer service was terrible across the board.  I think a lot of these vendors are satellite locations and therefore lack the proper employee oversight and training.", "author": "Andrew F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-01", "description": "This was so not worth the starvation we experienced just to get to this place. My friends and I were in the city and one of them saw this market advertised on the food network channel. We took the long trek from battery park over the Brooklyn bridge to dekalb market. It was all of our first time being here and to find it was almost impossible because it's not advertised at all. You have to go in side the shopping complex and down to the basement. At first we were overwhelmed with how many different vendors were there. We circled and circled and we really wanted something from each. I said oh I want perogies! I want bread! I want a donut! I want coffee! I want ice cream! I want fries! I want churros! I want Sangria. \n\nOk! I decided I'll start with the perogies boys. Honestly, not the best. I assumed the sour cream came on the side as a dipping sauce. No. They put it smack dab on three perogies. Ugh I hate sour cream. I thought I could tough through it. But it was so horrible. The perogies themselves were not great. After that my stomach was upset and I couldn't even smell the other food without wanting to vomit. Same with my other friend who also got the perogies. \n\nTwo of my friends went to this Spanish or Colombian vendor. They couldn't remember which is was and they're Mexican.  they didn't even know what they got but they both liked whatever it was. My other friend went to get rice and vegetables from another Hispanic stand. The rice was overcooked and burnt. \n\nWe wanted churros but they had been sitting out all day and looked dry and crusty. The donuts looked good but I am pretty picky when it comes to sweets. I really only like chocolate so nothing else was appeasing. \n\nThey do have an organic/vegan vendor which was great but I saw them after I ordered and wasn't feeling well.  They had so many options but the mix of smells was messing me up. The fries stand smelt awful. I'm sure it was from the vinegar and garlic and whatever else but it smelt like someone who had really foul body odor/breath. \n\nI most likely won't come back. And really wished we ate at Grimaldi's instead. \n\nIt's crowded. Barely anywhere to sit or eat. No cell phone service. Food is overpriced and mediocre at best.", "author": "Alex F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "One of the best food halls I've been to.  The only drawback is that it's located in the bottom of a \"mall\" so it feels a little like a food court.\n\nLOCATION: Located beneath the City Target in Brooklyn, you go inside the city point \"mall\" and then take the elevators downstairs.  You'll see it right next to Trader Joes. \n\nATMOSPHERE: It's a little on the \"darker\" side and it does feel a little bit like a basement compared to Chelsea Market or Urbanspace Vanderbilt.  It has a lot of little alleyways so make sure you fully explore before deciding on what you want to eat.  There is also seating towards the back and side areas and some of the places have seating themselves like Pierogi Boys.  \n\nFOOD OPTIONS: They have ample hills, Katz, Pierogi Boys, Two Tablespoons....and then other places I don't remember the names of that include beef noodles, fried chicken, porchetta sandwiches, crepes, paella, tacos, key lime pie....basically everything you can imagine you'll have it here.  They even have a juice bar for those that are trying to stay healthy.  The options are endless and most are brand name restaurants or places that have good ratings on yelp elsewhere.  Wait times weren't too bad when we went on a holiday (July 3rd Monday) for lunch but people who were working in the area were there for their lunch break.\n\nWIFI: they offer wifi because the service in the basement is almost non-existent.  Easy to join and pretty fast.\n\nOverall, I would definitely recommend coming here.", "author": "Brittany T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "We went last night around 7:30, I wasn't sure what the layout or the seating would be. Was pleasantly surprised it wasn't very crowded, so we got our food and a table with little wait. I can see this place being a beast when it gets a little more crowded on weekends and holidays, but for us last night with some Polish food from the Pierogi Bros and some Lioni heroes (and Ample Hills Creamery for dessert), we were very happy campers. Also dragged bf into Trader Joe's, which wasn't very crowded either. Thursday nights it is!  A bit more expensive than the restaurants (a half Katz sandwich and soup was over $20), but a fun dining experience. Be warned:  there's little to no immediate area parking.", "author": "Jenn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "Amazing little basement food hall on Flathbush Ave Extension, right down from Junior's. For starters, there's a Katz's deli (the only one outside of their iconic LES spot). That's worth a trip all by itself. Some other highlights include Dekalb Taco (excellent, especially the brisket taco), Fletcher's BBQ, and Cafe D'Avignon. Seating is a bit limited and prices aren't cheap, but there's some really amazing food options here.", "author": "Jon L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "My friend invited us here after telling us how cool of a spot it was, so we went on a Saturday afternoon before a Nets game since its walking distance from Barclays, when you enter you realize that this place is in a mall so this is a pretty cool food court, one thing to note is it is location on the basement level and service sucks so make sure to meet up with your friends upstairs or connect to the WiFi because this is a big place and you could easily not find who you're here to meet, anyway down the escalator you see this giant smorgasbord with various booths with food, beer, wine and dessert, also around you'll find tables and areas where you can stand and eat, also down there is an Italian restaurant and a Trader Joe's, as far as food I saw so many places I would try however I could only eat so much so first we went to get arepas, I had the chorizo with sweet plantain, my girlfriend had the beef with cheese, both were good and filling, after that we split 4 ribs from fletchers bbq, we got beers from a spot in there, after we got dulce de leche churros from another spot, this place is good and has many options, great for groups and doesn't tie you to a specific cuisine or setting but you can spend money here quick, we didn't have a full meal and I spend over $60, also it's more expensive here but you are getting everything in one spot so I get it", "author": "Jerry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "Dekalb Market Hall is finally here! This foodie wonderland is a welcome addition to the neighborhood and worth a visit if you're around. \n\n5 stars for the sheer selection and quality of vendors. There's pastries, barbecue, burgers, fries, seafood, sushi, poke, vegetarian, jerk, pastrami, arepas, noodles, crepes, juices, ice cream, donuts, coffee, tacos, paella, and more! They managed to snag a Katz's deli and Ample Hills! The vendors are legit and I love all the options. It's going to take me a long time to get bored and will be fun to keep exploring for a long time. Scroll down for favorite stalls.\n\n4 stars for the Brooklyn vibe and layout The fit out is modern, eye catching, and fun. Each vendor has their own style and the walls have awesome art. There is an elevator and escalators down into the space. There are restrooms downstairs. Plenty of room for wheelchairs and strollers. However, the aisles between some stalls can be a bit tight when there are long lines. If you're travelling in a pack, do try to keep to the sides. Also can be loud here and its dark compared to places like Hudson Eats. Cell service is BAD down here - if you're meeting up with a group, use the free wi-fi or meet up upstairs.\n\n3 stars for seating. While there are tables and benches, counter high bar tops, and some vendors with stools, as of September, there was definitely not enough seating and they plan to add more. Get here early if you want to share a table with friends. Or get everything to go and sit in Fort Greene Park. Seating is very communal, cafeteria style, so not a good place for intimate conversation or romance. I can see this being awesome for people who like to eat at odd hours (stroller moms, students) but may be frustrating for people at peak hours.\n\n3 stars for prices. Overall the options are not cheap (is rent for the booths that high?) Katz's will run you $25+. Lioni's $20. Fulton Landing $15+. Ample Hills $6+. Arepa Lady $10+. Plan to blow over $30pp to have a decent time here.\n\nWHAT TO EAT: (UPDATE DEC 2017)\nKatz's is a must eat if you have never had their famous orgasm inducing pastrami, otherwise it's just too expensive. \nAmple hills falls in the same category for ice cream. \nLikkle Jerk chicken burrito is really a roti and the best bang for your buck at the hall. They also have sorrel which I know can be hard to find if you're a fan. The beef patties are the best of the three options and a perfect savory snack.\nForager's Rotisserie chicken sandwich is really delicious and very high quality for the $12ish price point.\nWilma Jean's chicken on scallion pancake is delicious and a great value at $9 - it's my go to lunch here now. Their collard salad is delicious and is one of the vegetable friendly options at the hall. Bonus points that you can add the awesome famous fried chicken and everything at this stall is affordable.\nWiki wiki poke is solid and decently priced.\nKotti Berliner doner kebabs are delicious and fresh, with a good mix of greens and meats, on fresh pide bread. Also affordable. \nCafe D'Avignon is excellent stumptown espresso and legit pastries and fresh breads. \nSteve's key lime pie is legit if you're a fan of the tart treat\nDekalb Taco and quesadillas in the back were solid but the wait can be long.Two Tablespoons is a must for the vegans, but personally I think they're just alright.\nBK Jani is a must for those who love their spicy. The seek kebabs do not play, the paratha are flaky. \nHome frites are legit, fat fries and good for a snack, poor for a meal\n\nThe MEH:\nThe Dulcinea churro donuts are tasty but the cream is poorly distributed inside the puff. The Fulton Landing octopus roll was good but small. The arepa was super plain and rather dry. Hana Noodles are fresh and fun to watch, but literally came in lukewarm broth and killed the whole dish. The italian hero stall (Lioni's) has a ridiculously overwhelming menu with no prices and is tasty, but price/value proposition is only good if you're splitting the sandwich four ways at $15-$20 per hero. The husband is a fan of breakfast sandwiches at Hard Times. Nobletree coffee also tasty, but I feel a bit more pretentious. Bunker's banh Leo was much too fat for an authentic banh xeo, but I need to try the banh mi.\n\nI have yet to try Fletcher's barbecue, the Paella shack, 8 turn crepe, bunsmith, or Diago sushi. Happy hunting!", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-02", "description": "Cute market with plenty of options but no seating area. \nOverall a decent experience at the three joint we visited but wasn't worth the money.\n\nTo sum it up, Not worth commuting for mediocre expensive food.", "author": "Calvin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "I've been here numerous times..Awesome selection of food, and great atmosphere..Bery busy place, there is also a Trader Joe's on the same floor..Try the Caribbean spot..delicious food...", "author": "Margaret M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-24", "description": "There's great potential for this food market. The amount of vendors are a bit underwhelming for 60,000 square feet.  I definitely expected more. \n\nMy wife and I walked around for at least 3 times before we were able to finally settle for something.  There is not a lot of seating or stand up tables which makes it less enjoyable to eat.  \n\nMost if not all locations accept credit, so that's convenient.  I hope that this place expands and includes more desirable vendors and significantly more seating to accomdate their hungry customers.", "author": "Stephen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "Dekalb Market Hall at City Point is another massive food hall to open in NYC which has seen a sudden rise in food halls/markets open in the two years. The more food the better no?\n\nFood halls are competing with one another and Dekalb Market Hall is a 40,000 square feet space inside where there is a Target, Alamo Drafthouse and Century 21 at City Point. With over forty vendors, there is much to choose from which is good because there are so many delicious options but bad if you're indecisive. The space itself is decorated with cool art representing both the neighborhood, the borough, and the city with hints of street style. It is in the basement of City Point and while there is wifi, it's difficult get cell signal when you're down there so we be wary if you and your friend separate and can't contact each other.\n\nLike mentioned above, there are 40 vendors however it is cramped especially when there are people everywhere Despite the amount of space available, I'm not sure it was great idea to have that many vendors so close to one another. There needs to be breathing room especially since there is no natural lighting downstairs. There is seating too but you're again competing for seats.  \n\nThe vendors available though are a great showcase of the diversity of NYC. From the famous Katz' Deli to Brooklyn's very own, Ample Hills and Queens' Arepa Lady, there is much to eat whether you want sweet or savory. Dekalb Market Hall requires multiple visits just so you can try them all. \n\nHappy eating and remember: Don't deny, satisfy!", "author": "Raymart D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "So many choices!  We sampled a bit of everything and it all was delicious.  The down side is the pricing for each food item is high.  We paid $21 for a pastrami sandwich.  We spent about $90 and left stuffed from a variety of food choices.  Enjoy!", "author": "Johnny W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Pricey but a lot of fun!  Great place to bring a group of friends who can never decide on what they want to eat!  Just do a tour together, pick a table and send everyone out to get their favorites and regroup!\n\nI think my favorite spots are Ample Hills Creamery, the Jamaican jerk spot, the BBQ place and the paella shack.", "author": "Vance V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-14", "description": "It is conveniently located and any means of transport can take you there! \n\nThe place is neat and clean. A variety of choice to grab when feeling peckish.\n\nI chose the polish dumplings place Pierogi Boys because first I never had polish dumplings before and second the place looked authentic  when a bunch of people are working very hard in the open kitchen: one guy washing up the equipments and I mean he was seriously washing everything clean! Two ladies wrapping the dumplings and one also cooking them in batches at the same time. One guy serving the orders. One lady at he cashier.\n\nI like this kind of team work and having everyone a designated job in the line of production.\n\nAnyhow back to the food. All in all, worth a try. Good stuff though by the time I had the fourth piece down I was already feeling full !!", "author": "Irene M."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}