{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "First time here, how can you choose? \n\nI had coffee for breakfast and was holding out for a big lunch. I was breaking it down, If I go to Katz and get a soup / sandwich, I'm going to be burping corned beef all day. Chicken Sammy @ Wilma Jeans? BBQ @ Fletchers? Poke bowl? Lions Heroes and/or Arepa Lady? Had them both before. And there she was, Bunker for the win with their Banh Mi sammy. Sold.\n\nHere's the thing with the Dekalb Market Hall. You order a blockbuster lunch, where the heck do you eat it? The tables are few and far between.\n\nI was able to sit at Bunker, they're one of the few vendors with a counter \u0026 bar stools. I ordered the Saigon Bahn Mi. Not the largest sandwich Bahn Mi I ever ordered but packed with flavor. \n\nNext: Dulcinea for churros. Not just any churro, I had each of them stuffed with nutella, peanut butter and dulce de leche. Mmmm\n\nFinally coffee (But of course) at Nobletree Coffee. \nSo far heaven! But I'm thinking, I'm leaving this land of Oz for dopey Long Island. I gotta squeeze in some more goodness! I swung by Café D'Avignon for a \"walnut\" croissant and a Croque Monsieur on sourdough.\n\nHow'd I do? Write your own story. Come to Dekalb Market Hall and find your favorite", "author": "Bill S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-28", "description": "I enjoyed the market very much to my advance it was not crazed on a Friday evening perfect to walk around observing the different food courts etc.  We ate in Han Dynasty which was yummy I had a great tofu dish with a Mango Bubble tea.. The service was good with  friendly Servers.\n\nWent to Traders Joe awesome purchased my favorite coconut water there brand which is excellent.", "author": "Heather R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-19", "description": "Definitely a cool place to grab a bite, lots to choose from. I tried the Korean chicken bowl which tasted really good. My bf tried the taco place. They were very busy and they took a long time to get the orders out. The tacos were ok, they had too many people making food but they kept passing every order down the line to finish it. Two of the tacos actually got the wrong garnishes on them, so that could be why the food was off.\nWe also tried the Ample Hills ice cream place, which had a nice unique selection and the staff was nice, they let you try even multiple flavors.\nIt definitely a nice place but they are very pricey for the portions, especially being in Brooklyn.", "author": "Hannah V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "OMG... just addiction...and more addiction for all foodies...\n\nMy son and I adore this place...\nAs a lifelong Brooklynite...who has seen this area change and morph into what it is now... I'm so proud...and so happy to have access to all of these eateries without having to trek all over to get to them...\n\nThis has become our little routine when we come down... which seems to be on a bi-weekly basis..\n\n1. Hana Noodles - for our Pork dumpling fix/ our bubble tea fix\n\n2. Guss' Pickles - apart of our grocery list --  must have\n\n3. Kotti Berliner Doner Kebab - delish! I could eat kebabs daily....\n\n4. WikiWiki - for my son's Musubi addiction - one to eat on the spot - and one for home... so good - way better than the one's I've had on O'ahu\n\n5. Steve's Key Lime - for my son's key lime pie addiction.. that's he's now reeled me into.... he goes for the classic... I get the one on the stick with raspberry.. divine! \n\n6. Pop Cake Shop - if my kid listened and has behaved all week..he can have one of these sugar devils in a tube....lol.. Their brownies and rice crispy treats looks so addictive.. I stay far away...\n\n7. Han Dynasty - higher end Chinese restaurant  - with delicious fried rice, noodles, dumplings in chili oil... OMG... wish I had them right now... - if we have time to sit and linger... otherwise - 1-6 above...\n\n8. Trader Joe's - for weekly groceries.\n\nAnd we have barely scratched the surface on all the offerings.. \n\nHead home..\n\nRinse..\n\nRepeat...", "author": "Alysha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Of all the Market Hall I've been to, Dekalb has probably the most variety in options and the most colorful, too. I was on food detox the month of March, so even though it was quite tempting to try a bit of everything, I opted for what I thought was the safest for me: BK Jani.  The lamb chops were sooo good: really tender and juicy crusted with all the right spice rub and I felt magnanimous sharing it with my husband and son, who had the cruelty to tempt me with those crunchy- attractive churros later on when he knew I couldn't have it yet.  No, I didn't succumb. The roasted veggies from BK Jani had the right burn of spice which can be tamed by the cucumber salad or tatziki sauce on the side.  The latter, I had to skip though due to dietary restrictions.\nI am sure to be back in the near future,  on an attack mode.  I've got my targets: Paella Shack,  Arepa Lady, Dekalb taco, Likkle More and yes those churros from Dulcinea!", "author": "Penelope M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Wikiwiki - I came to Dekalb market several times but have never tried this place. It looks like a normal poke spot but they also have ramen! Btw, I tried the classic Hawaiian shoyu tuna and it was really good. What special was the quality of the tuna! I'm pretty sure it wasn't an akami (the red one) for sure but more like the fatty one (it was pink and almost melted in my mouth). Highly recommend!", "author": "Nini V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-10", "description": "This could be exciting...if you like dining in a crowded basement with no windows in what feels like the third circle of suburban hell (see Dante's Inferno). But hey if you're on your way to Target maybe you're into that sort of thing.\n\nI also doubt the space is designed for any sustainability for the food vendors. I recommend reading the New Yorker article titled \"The Inflated Promise of the American Food Hall,\" which sheds light on the racket these places are in and how it does not benefit restaurant owners or consumers.", "author": "Pleasantries F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Katz's!! No details required, just get the pastrami sandwich and you'd be all set. Also I tried Bahn Mi sandwich from Bunker, pretty damn yummy too. We walked around and saw the famous steve's key lime pie, ample hill ice cream, eight turn crepe, etc. I think food vendors here are a lot yummier than Brookfield Place or Urbanspace. \n\nThe reason it's a 4 not 5, there's not enough sitting tables. Given how many vendors there are, I only spotted maybe 4 or 5 communal tables. The rest were just one-off standing tables. It's quite annoying if you are holding onto a Katz's sandwich and dying inside to eat it but couldn't find a comfortable sitting area to do so. Maybe I will get it to go next time.", "author": "Lu H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-07", "description": "With over a dozen vendors, everyone will definitely find something. Unfortunately, most of what we picked were just so-so.\n\nFletcher's barbecue\n- brisket sandwich ($13)\nSaw an article with rave reviews \"no need for bbq sauce as the sandwich is perfect on its own\"...not. I had high expectations because we saw them take out brisket that was super tender and juicy it fell apart a little as the lady was cutting it. \nThe brioche buns were yum, but the brisket itself was disappointingly dry. Slightly redeemed by the bbq sauce, I managed to finish it. Also, is it just me, or the sandwich is more like slider sized.\n\n- chicken wings\nIf you like your wings *smothered* with thick bbq sauce, then this is for you. The chicken  was on the dry side as well.\n\nPierogie boys\n- Potato and cheese ($12)\nTopped with caramelized onions and sour cream\nAgain, high expectations. I read that they make it as you order. But when they handed me the tray within a minute of ordering, I had my doubts. \nBit into room temperature pierogy, I expected a lot more. To be fair, that was my first pierogy - but when it tastes like potatoes and none of the promised cheese...\n\nNachos\nThis was pretty good! The chips were purple and thick, but oh so crunchy. Loaded with various sauces, it was a good one.\n\nTruffle fries\nThick cut fries drizzled with truffle oil, served with garlic(?) aioli, this was a table favorite. Although if you like fries soft on the inside, and not crunchy all the way, you may prefer truffle fries from elsewhere.\n\nMilk tea from noodle place\nWow! If you like milk tea, you *must* try it from here! I am not sure what secret ingredient they use, but this is a head above the other milk teas. Unusually decadent, a perfect balance between milk and tea and yummy.", "author": "Jainnielyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "This is a wonderful food market because of its location. For me, it is super convenient to get to because it is right off the Q-train (literally, you exit the subway and the entrance is a few feet away). It is located under TRADER JOE'S (insert heart eyes) and the Alamo Movie Theater! So you can easily spend an afternoon here by eating lunch, seeing a movie, and picking up goodies at Trader Joe's!\n\nIt certainly isn't as crowded as Chelsea Market (hooray for those who ever felt claustrophobic there), but with comparable food options to choose from. I had the Pierogy Boys, which was quite yummy. I ordered the sampler, which was 2 meats (braised beef cheeks with pork buns and herbs), 2 mushroom and sauerkraut and 2 potato and cheese. It also came with bacon and a dollop of sour cream. The meat pierogy was my favorite, with a delicious blend of aromatic herbs, umami gravy and hearty meats. I quite enjoyed the plumpness of the freshly boiled dumplings as well.\n\nI think there is more seating here than at Chelsea Market, but that is not to say that seating is plenty. You will need to be vigilant and be hawk-eyed for opening seats if you come with a group!", "author": "Jenny P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Checked it out this morning and was overwhelmed by the variety and multitude of food vendors. Will make it my mission to try all the vendors and keep editing this review. \n\nArepa Lady: First spot I tried and was not disappointed. Had an Arepa de Queso with shredded chicken which lived up to my expectations. Would definitely get again but not before checking out the other vendors in the market hall.\n\nPierogi Boys: Tried the potato and cheese pierogi. Not a big fan of pieorgis and wouldn't get a second time, but they were very good and filling.\n\nAmple Hills Creamery: They allow you to sample flavors and they even have an exclusive flavor that's only available at Dekalb Market Hall. I had one coffee flavored ice  cream with oreo cookies inside and an oatmeal cinnamon flavored one. Both were really good and will be back to try more flavors.\n\nDaigo Hand Roll Bar: I ordered the spicy tuna hand roll and the snowcrab avocado hand roll. Both were amazing. Fish was very fresh and food is prepared quickly. The only thing is that it's a little over-priced and not very filling so I'd recommend it on a day you're not too hungry and want some good quality fish. \n\nWiki Wiki: Great poke spot! Got the chili alioli tuna poke bowl to satisfy my craving for spicy food. Tuna was very fresh and the rice was very good too. I didn't like that you couldn't customize your own poke bowl, but the combination of ingredients was well chosen. Although the poke was a little bit overpriced, the portion was very filling and I would get again.\n\nHome Frites: LOVE the truffle fries and the sauce they come with!!!", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "5 of 5 stars for innovation and variety of flavor and shop local. All of the vendors are small businesses?no massive chains. The people are friendly and the food  is unique and flavorful. Not cheap but not too pricy either. Great coffee, Italian sandwiches, deli, BBQ, pizza. Decent hamburgers. Nice selection of beer and wine to boot.", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "One of the cleaner market halls around with many food options! Price range $$-$$$ depending on where you go/what you order. There are some seating/standing areas. Offers a couple of wine and beer shops. Aesthetic for sure!", "author": "Danielle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "Here for lunch break and went straight to jianbing. I chose the option where they use crepe as the base, and chose pork as my protein. Total was $13. Well worth it as the portion is huge. I recommend sharing it with one other person so you can try other stuff around the food hall. Had the perfect amount of crunch and sweetness that makes it so memorable !! I watched them make it in front of me and it only took five minutes before my food was ready.\n\nDefinitely coming back to try the other places around. There is good amount of seating around if you are okay with sharing space with others. I came around 1p and it wasn't too packed.", "author": "Shirley G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "Words fail me as I try to describe the delight in going to the food area and finding this DELIGHT!\n\n//Pan into me twirling in joy//\n\nWhat on earth do I eat?? Where do I go?? So much to taste, but only one tummy and precious little time.\n\nThey have all the options.  That is really the only way I can describe it.  ALL the options. Whatever you want.  Spanish food? They have paella. Jamaican? YUP! Asian? SO MANY CHOICES!  Vegan? YUUUP!  Italian? Of course! Mexican? Colombian? Pierogi's? Sweets? Fries? ALL of them.  I told you!\n\nSo after a full 45 minutes of \"I want this!! I want THAT!!\" I finally decided that Paella Shack was it.  They have a great veggie option but that is a separate review folks!\n\nSeating can be tricky and slightly uncomfortable but well worth it!", "author": "Carla L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "food hall = alllll the (delicious) options!\n\ndefinitely pay a visit to aprea lady.", "author": "Allison F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Vendors are a little pricey, but definitely worth dropping by (there's a Trader Joe's and a Century 21 around!).  Seating is limited, but most people eat fairly quickly so you won't have to wait too long.\n\nWilma Jean - get the chicken on a stick!  Don't bother with the scallion pancake, it's pre-packaged, and just re-heated.\n\nArepa Lady - 9 dollars, but the arepa con chocolo with chorizo on top is so delicious that I'd easily pay for this again.\n\nAmple Hills Creamery - If you have a sweet tooth, the Sweet as Honey is irresistible (though I'll always stick to the kids size).  \n\nI'll definitely be back to check out the other vendors I had my eyes on!", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-06", "description": "First Impression: \"unfinished\"; \"incomplete\"; \"some vendors need to get their sh*t together\"... \n\nOverall impression: some vendor(s) is amazing and some fell flat (on their faces! Cuz I will not be a returning customer... smh) and one could easily over-splurged and NOT know what you had for lunch... LOL (Total Spent - $46+!! What?!?!!)\n\nIt's nice, will definitely bring the real estate value up for this neighborhood... what's another extra 2-3MM for a tiny box they call condo right? Hahaha \n\nThe \"Good\" - definitely will return for more!\n-Daigo Handroll Bar (loveeee! Got the Spicy Tuna/Seared Jap Beef/Snow crab w avocado) $18-20... exceptional \u0026 amazing! Would gladly spend all my $$$ here! \n\n-Cuzins Duzins - mini donuts! Fresh made on the spot! This was so delicious, mini little drops of wonders! I got the powder sugar - I'm in love! Get it!! \n\nThe \"Bad\" - needs to get their sh*t 2gether! \n-Taco Delicatessen \u0026 Churros Place - GO FOR The Churros - SKIP the tacos!!! It was not good!  We grabbed the taco box (basically they just give you a box.. there's no saving - all the same 2/$7, 3/$11, 4/$14... or a la carte.  The carne asada was horrible, no flavor whatsoever, tortilla was rubbery! Very chewy.  The roast crab was fishy! Nasty! Ewww....   My Cali fam would laugh their a$$ off at this joint.   Go to Chelsea Market/ Los Tacos #1, much better!!! \n\n-Churros was good, not blown away... but better than expected bc it's the same operational team w the Taco place... ugh.  (Although the so-called \"churro unicorn\" looked nothing like advertised... we were suckers!) \n\nHonorable mentions: \n-Wiki Wiki Pokebowl - funny story, my sister wanted Poke Bowl... went there for Wiki Wiki.. \nSister: \"hi, I'd like a poke bowl\"... \nWiki: \"sorry, we don't have any bowls, we are waiting for delivery... not taking orders\"... \nSister: \"....  it's lunch time... wow\"... \nWiki: ... walks away...  \nLOL\n\n-Viet place - I was majorly craving a Viet Ice Coffee\nMe: \"Hi, I'd like a Viet Ice Coffee please...\"\nViet place: \" oh yea... sorry, we ran out...\"\nMe: looks at time, 11:45am... \"but you just opened...?\"\nViet place: \"yea... we don't have the delivery yet\"\nMe: \"wow... ok\"...\nViet place: \"we had a bunch yesterday!\" \nMe: .... well some of us are patriotic and celebrated July 4th by stuffing our faces with BBQ meats! *smh*\n\n-Nobletree - got a cold brew, the guy came through \u0026 went to the basement to bring up the giant container!! Thank you!!! So sweet! $4.50 + $1 tip, $5.50 - and I dropped that damn thing Bc I tripped over someone's cart on the damn train! FML \n\nGive it a few weeks for it to smooth out their kinks! \nHappy feasting!", "author": "Karen Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "Okay, food Halls are the rage lately. There's two already. Gotham Market and now Dekalb. The later is the larger. The highly anticipated opening of the Dekalb Market Hall in the waiting after the other Gotham Market open but it is a tale of two food halls. Dekalb is much larger in the basement. Plenty of choices for everyone from Spanish to burgers to seafood. Fortuna just opened and waiting on the Han Chinese to open. There's even first Katz outpost. The market is great for foodies like kids in a candy store. Prices are reasonable to moderately pricey depending upon your budget and taste. \n\nThe really issue I have is the lack of seating in this place. It is almost like the developers wanted to cram as many food stalls as possible to make money (Gasp) rather than making a pleasant place to eat. Unlike Dekalb the Gotham Market has plenty of seating plus outside plenty of light and air. I find it to actually be more pleasant of the two really. The food choices are more limited but that doesn't mean there's plenty to choice from. It just feels more relaxed especially for larger groups. Dekalb on a Sat can be overrun with strollers galore and they are all hogging valuable seating like squatters at Starbucks 'work' on their poetry. Thankfully, Fortuna has plenty of table seating and most of the time we just get to go which I think is that the developers intentions.\ner of the two.", "author": "David N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "I came here with a few friends last week after hearing about this place on Facebook. Along with Chelsea Market, The Plaza Hotel Food Court, City Kitchen and New World Mall, Dekalb Market Hall is one of the many food courts that NYC has to offer. \n\nThis place literally opened less than a month ago, so a lot of stalls were still empty when I stopped by. The hall offers a lot of different cuisines from some of the more famous spots in the city. The ones that really stood out to me were: Katz Delicatessen, The Arepa Lady and Eight Turn Crepe. Southern barbecue, ice cream, Vietnamese, frites and Japanese were also some of the other cuisines and types of foods offered here. \n\nThe venue overall was pretty spacious. The whole food hall is located on the lower level with a few wooden picnic tables scattered all over. \n\nOverall, I had a decent first experience here. One complaint that I did have however was for the pricing of some of the foods. I easily spent $20 at the barbecue stall and wasn't even remotely full! I do look forward to trying the other offerings that they have here though.", "author": "Henry T."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}