{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Lots of food choices from Hawaiian comfort food to BBQ to Vietnamese and tacos and Jamaican jerk you can taste the world with just a walk around the food court - but not enough seating; Trader Joe's and Target will greet you at the end for your shopping wants.", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "What a great addition to Brooklyn! There's such a wide range of food here, and everything I tried is delicious. It's a great location with the mall being right upstairs. And mall's movie theater is really the best movie theater I've ever been to in my life.", "author": "Mike G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Expect to spend at least $15 a person when going here. It's fun to go around and look at all the different places. You can even get a beer and walk around while you decide what to eat! The bowls from Bunsmith are amazing would definitely recommend.", "author": "Madison K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "William from Home Frites at Dekalb Market was THE BEST! His vibes were through the roof; how on EARTH he managed to get 3 customers back to back to BACK, ALL NAMED *SABRINA*, is beyond me! It was hilarious. Just what my best friend SABRINA \u0026 I needed at the time, a GOOD laugh!! Frites ROCKED! Sauces rocked! Customer service was AWESOME!", "author": "Priscila N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-26", "description": "Last week Thursday, I returned to DeKalb Market to try the burgers. The cashier didn't seem to know what he was doing. He kept going to the back and looking at the register. One customer seemed frustrated at the wait time I heard her say she will walk around and return. I left twice. I returned a third time, he was still confused. I went to Smash Burger down the block. Please do a better job in training your staff. He never even looked at me when I was standing there. I was ignored.  I'll try again, but if he's there...forget it.", "author": "Mary W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "Basically the best thing to happen to Brooklyn in the past five years. The food is ALL incredible. Highlights are poke, Han Dynasty, bunker and all the wonderful dessert choices. Super clean and rarely over crowded. So many choices. Great for tourists and visiting family. Plus you're right next to a great Trader Joe's and a movie theater that serves food. What more could you want in life??", "author": "Jenna W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-22", "description": "I feel like all the food was overpriced and small amounts were given. Flavorless and not worth it. Was dissapointed overall.", "author": "Maribeth R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "William at Home Frite was so friendly and amazing! I had to come back for seconds 20 minutes after I finished my first round of truffle fries!", "author": "Brittany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "The food at every stall was on point especially Katz and The Arepa Lady. I went after work on a Wednesday and it was a ghost town which was perfect. I wish there was more seating.", "author": "Simone R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Just went there today with my boyfriend and I was like a kid in a candy shop. From the layout to the smells, I was not disappointed! Everything was delicious and moderately priced! I cannot wait to come back! I Recommend coming on a weekday like I did, waited on no lines and was able to find a cozy spot to eat wherever we decided to stop!", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "This review is primarily for Daigo Handroll Bar. We go every time we go to the movies. The sushi chef is so nice. Definitely get the scallops with yuzu sauce, the braised octopus, and the salmon with woodear mushrooms. Other highlights of the market are Ample Hills (always) and Jianbing. I'd skip the paella spot and honestly if you want Bunsmith go to the original location on Franklin Ave. It's so much better.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "The hype speaks for itself. Great selection of eateries. Not that many places to sit and eat, but tables turnover quickly enough.", "author": "Israel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "Really loved the atmosphere. The seating was cool because it forces everyone to talk and ask others about they food choices. The cake pop places was the best. Some vendors are way over priced. $2.50 for s can of soda is disgusting to charge people that price. I'm all for making money but that's my limit. Also the food was pricey for the small amounts you get like the pirogi place 6 for $17", "author": "Kenyana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "This is one of the best places in new york, period. The design is great, with tons of great vendors... what an awesome new spot for the neighborhood. The only place that compares is Hudson Eats in FiDi, and this has many more (and cooler) options", "author": "Ashwin A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Trader Joe's finally open. Fast lines and big aisles. Much better than the one on Court Street. Great food selections. Can't miss out. Tried brisket sandwich from Fletcher Brooklyn BBQ. Meat was juicy and flavorful.  The combo came w waffle fries and soda. However it pretty steep $13 for a sandwich on a small potato bun.", "author": "Ivey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "Good for everyone different taste started with the Dekalb Taco stand good not too spicy will visit the other stands in the next few weeks a new one every week", "author": "Rose P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "Love this new Food Court. Enjoyed a wonderful lunch with my husband.  Selection of food is nice.", "author": "Diana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "so originally my main focus was to visit city point \u0026 raid their flying tiger. little did i know they have a target upstairs, trader joe down stairs, \u0026 deklab market right outside of trader joes! the first time i went to dekalb market it was on a weekday after work \u0026 oh goodness it was sooooo packed! the second time we went on a monday afternoon; still packed but we managed to get awesome spot to eat. but we were recommended by the wonderful staff at flying tiger to try the poke bowl at wiki wiki, we also  got their spam musubi \u0026 fries at another vendor homefrite! i also had some latkes from katz. my friend also got ice cream from ample hills creamery- luckily they had like 1 or 2 vegan choices for her. and to end the day we got some delicious coffee. it was a bit on the pricier end but our bellies were quite satisfied. it's a good spot to hang out \u0026 chill; there were vendors that served alcohol too! it is a tad bit hard to find seating if you were to have a big group. they do have a nice variety of food to choose from :) very casual yet enjoyable scene nonetheless. \u0026 let me just say homefrite is bombbbbb their sauce is bosss!", "author": "Caroline T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-19", "description": "Loads of great vendors, and the vendors seemed happy to be there. I'm happy to have it close by, though I couldn't see it for a regular lunch spot, for the prices. The food is worth it, but it isn't cheap. \n\nThat said, the focus seemed to be on how many vendors could be present, rather than useability. There's nowhere to stand in line to order or pick up food, leading to annoyance from both those in line and those trying to get by the line. There are far too few places to sit, and the garbage cans are few and far between and are the wrong type for the food containers provided. I couldn't find a recycle area anywhere. \n\nWe'll see what happens w it.", "author": "Rob H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-30", "description": "The space is great, but the food here is unremarkable. We had Hana noodles, brisket from Fletchers, pho, pierogis, and an arepa. If I had to pick, the pierogis were probably the best of the bunch. All in all I'd recommend saving your hungry stomach and eating elsewhere.", "author": "Wendy J."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}