{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "Oh this place is fun! Whenever we go to New York I always look fwd to these food markets! They make New York so much easier. \nThe Rellenos here are awesome, the Pakistani spot has great chops too, the only thing missing is a good coffee, their coffee spots weren't great", "author": "Zara K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "This is THE best food hall I've found in Brooklyn AND Manhattan so far. I've never seen a greater selection of food -- there is Pakistani food, barbecue, ramen, Katz's deli, burgers, Hawaiian food, hand roll sushi, tacos, paella, cheese, crepes, donuts, ice cream, cake pops. And that's not even everything.\n\nMy boyfriend said, any type of food you can think of that you'd want, it's here. And (*gasps*), he wasn't wrong. He's been here multiple times before during the week for lunch and says it's not crowded at all and there are plenty of open tables. On a Saturday late afternoon though, it's pretty crowded but not so overcrowded that you have to wait in long lines or wait for a table. Make a loop around and you'll likely find an open seat or two. (Besides long tables with benches, there are smaller tables scattered throughout, and other areas with standing tables or a place on the back wall with bleachers.)\n\nTo eat, here are my recs so far, no particular order. 1) Daigo Hand Roll Bar -- a solid sushi option if that's what you're in the mood for. Prices are decent for the quality and size of the rolls. I'd recommend at least two rolls though if that's the only place you're grabbing food from. 2) Wiki Wiki -- Hawaiian food with menu items like poke bowls or mixed plates (a meat, macaroni and coleslaw or kimchi -- the spicy pork was DELICIOUS). Not super cheap but the portions are generous and the food is amazing. 3) Cuzin's Duzin Donuts -- you should absolutely finish your trip off with donuts from here. Honestly the best I've ever had, and that is a bold statement. I ordered a lil cuzin size of the coquito donuts ($8 for 7 mini donuts) and he gave us 9 donuts, which was a really nice added bonus because they were AMAZING.\n\nLast but not least, drinks. This market is super cool because almost every place serves beer or wine. It's really awesome being able to grab a bite and a beer and hang out with friends on the weekend. Craft + Carry was a really cool with a whole wall of fridges filled with different types of beers, and they also had about 10 beers on tap (you could order up to a growler in size). Another favorite spot was Two Tablespoons -- they had happy hour on Saturday (not sure what other days they do this) between 4-6pm and beer/wine was only $5. They also have food, salads and things that looked good, but I'd already eaten by this time.\n\nI'm obsessed with Dekalb Market and will be back probably too often. Such an awesome addition to the Brooklyn foodie scene.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "One of my favorite food halls in the city!\n\nDekalb Market Hall has it all. It's conveniently located in Downtown Brooklyn in a newer building that also houses an Alamo Drafthouse, Trader Joe's, and Target among others. \n\nNow that the initial hype is over, I find this food hall to be significantly less crowded than others in the city. There are always people there, but it's rarely jam packed and if you look enough you can always find somewhere to eat (standing or sitting.)\n\nI've been here a number of times and have made a point to try a variety of their vendors. Each has a lot to offer! My favorite is the Pierogi Boys. In my opinion they serve the best pierogis in the city. Other favorites of mine are the Jian Bing place and Bunsmith, though you really can't go wrong no matter what you choose. \n\nVisit with a small group of friends and share a number of dishes from different vendors. That way you can try as many as possible!", "author": "Liane C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "This place is a gem , love the staff and the people you can meet ,  while enjoying a drink in one place yet walk over and have great wings - but if You want desert that's only down the other aisle - \nCome an enjoy great food reasonably priced and fresh choices from Asian to American to Latin to Caribbean to Italian  dishes -\nGreat for a nice first date . Especially if you don't know what your significant other is into  - \nGreat place to brake the ice - \nDowntown Brooklyn has changed so much , \n Enjoy a little adventure of fine fresh cuisines - and drinks", "author": "Eddie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "When my hubby and I were in the area and couldn't decide where to eat, accidentally stumbling onto the market hall came as a great blessing. \n\nIt was crowded, and mostly with the college going, young crowd. There are all kinds of food vendors here - from pakistani food, ice cream, poke bowls, burgers, sushi, donuts, and the list goes on. \n\nWe tried the lamb chops from BKJani, which I highly recommend. They were tender, juicy, and full of flavor. The bold flavors went perfectly with the side of raita ( yoghurt dip). We also got chicken biriyano from the same vendor but did not enjoy it. The biriyani flavors were missing, there were really big pieces of chicken", "author": "Taiba Sheerin A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "Everything at DeKalb Market looked so good but we decided to eat at Daigo hand roll bar because we only had a few minutes to spare before heading up to a movie. The sushi hand rolls were stellar. They made them lightning quick and all the components were amazing. Fresh fish, perfectly sticky rice and crispy seaweed made for some of the best hand rolls I've ever had. My absolute favorite was the eel avocado roll. The eel was sweet, meaty and simply melted in your mouth. The spicy tuna, snow crab and salmon rolls were great too.\nAlthough I do plan on coming back to the market to try the Arepa lady and Ample Hills ice cream, it's good to know these rolls are a sure thing.", "author": "Monica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "TL;DR - Probably one of the best food halls on the New York scene.\n\nIt's a jaunt out of Manhattan, but we were glad we made it for Dekalb. It's in the basement of a building which houses a Century 21, a Target and (also in the basement) Trader Joe's. But you're here for the food hall, and it doesn't disappoint.\n\nThere's a huge array of vendors here and you can find allsorts of things to keep you happy. We actually visited here twice - the first time we went to Foragers and had a great roast chicken dish with lots of sides... great stuff. The second time we went to Bunsmith and got some great Korean dishes. On both occasions we got some beers from the Bottle Shop (who were great at making recommendations).\n\nLong story short, you're spoilt for choice here. But perhaps the biggest secret (or not so secret) is that they have a branch of Katz's Deli here, serving exactly the same out of this world pastrami sandwiches you would find at their main venue... so why queue with all the tourists when you can come here and sample exactly the same food but without the hassle?", "author": "Paul B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "Convenience is the biggest factor to why I frequent here so often- it is right by school, right by home, right by a ton of subways. You can stay downstairs wandering for prepared foods in the market hall, or walk to the other end to Trader Joes. Or you can go upstairs and find Target, flying tiger, movie theater, or sometimes they do these fun marketplaces upstairs. City Point is a pretty fun place.\n\nI wanted to go to every single vendor before making this review- I gave up because now I have a list of go-tos that I am addicted to. There is a huge selection of food at the market- honestly it is totally overwhelming. If you're easily overwhelmed, I suggest you get an appetizer as you decide for your entree. My go-tos would be fries from Home Frite, a spam/vegetarian musubi from wiki wiki, a bun from Bunsmith, or a hand roll from Daigo. There is a beer shop that sells craft beers that you can drink as you browse, but a few vendors such as Two Tablespoons and the Paella Shack serve beer, wine, and sangria. \n\nMy gems of Dekalb Market Hall: BK Jani, Two Tablespoons, Bread \u0026 Spread, Bunsmith, Wiki Wiki, \u0026 Cafe D'Avignon. \nThese are the spots that bless me with vegetarian friendly, vegan friendly, healthy, and yummy foods. I appreciate you BK Jani, for your flavorful and spicy lentils \u0026 rice. Thank you Two Tablespoons for your amazing $10 macro bowls, broth bowls, and soup bowls that gets me filled up without feeling guilty. Thank you Bread \u0026 Spread for your amazing staff and giardino. Thank you Bunsmith for cauliflower nuggets and tofu shiitake bun. And wiki wiki - vegetarian broth ramen lunch special? BLESS. And, last but not least, Cafe D'Avignon, who entices me weekly as I scan their amazing pastries. I'm missing butter so much because of their almond croissants... \n\nNotable mentions! \n-Lioni sells these crazy large subs that can feed 2- plethora of sandwich options you will definitely find something you like there! \n-The french fry place has curly fries! Truffle parmesan curly fries. That excites me. \n-The churro place don't sell singles, so sharing is the way to go!\n-Smoked crab taco at the taco place does not have enough crab and gets lost in the salsas.", "author": "Jodie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-26", "description": "My unbiased opinion-\n\n\nI absolutely love this place. I found the market early in the year last year when I was looking for a vegetarian restaurants in the Brooklyn area. There was a place by the name of 2 tablespoons where they had all vegetarian options. I try the smoked beef burger on the first day. I was so amazed at this food selection that I went back every single day for the next five days. There was a place by the name of 2 tablespoons where they had all vegetarian options. I tried the smoked beef burger on the first day. I was so amazed at this food selection then I went back every single day for the next five days. \n\nThere is so much to see. If you have a group and you all cannot agree on where to eat, this would be the place to come. Split up tell everyone to go find a food of their choice and meet back on the end of the restaurant down near the Jamaican food spot for great seating options. \n\nThis location is amazing and super convenient. There is a target on the third level some small shops on the second level and on the first/basement level is the food hall +2 large restaurants plus Trader Joe's.\n\ni could go on and on and on. But just go check it out for yourself! Thank me later!", "author": "Briana H. K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "I love food halls, and this one is excellent--clean, with lots of variety and all very tasty.", "author": "Maxine D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Clean, plethora of unique, edgy, and delectable options. In an oh-so-chic basement adjoined to some streamlined and new developments including shopping Mecca century 21 and chain stores on the opposing cross streets.\n\nI've only ventured to bread \u0026 spread (excellent) and cafe davignon... but can't wait to try the push-pop cupcakes, crepe spot, Shanghai street food stand, the Viet spot, the bbq spot to jus tick off a few. Oh, and that key lime pie corner spot. Gots to.", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "There's so much variety and great food. I really loved the \nPerogies (stall)\n Avocado toast (stall)\n   And Crepes (stall)", "author": "Len M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "I LOVED it here. As of now they have about roughly 40 different vendors. I'd recommend doing a bit of research before you go, it can easily be overwhelming and before you know it you started a fat tab and have no idea where all your money went *coughs.*\n\nWhat they don't tell you, is the Market is located inside the mall at the basement. If you're a clueless person like me, bring a friend. I was amazed with all that I saw. Lots of beautiful presentations, engaging staff willing to answer any questions you had. Again, the price tag. If you're not mindful, you can easily spend a lot of money in a short span of time.\n\n1. Paella Shack: To my understanding, this is quick and affordable paella ($14.15). Anywhere in NYC you go for paella, it's a long wait, since it's made to order and nothing short of $20. This place really did a great job of a paella shortcut. There was lots of fresh flavors, colorful veggies and decent sized portion. Definitely worth getting. \n\n2. Han Noodle: The first on the list is the beef noodle soup with the Chilli pepper next to it. Pfft, like anything can be too hot for me. I was pleased yet again, nice sized portion and affordable ($10.62). There was a nice heat too it, not overwhelming but certainly pleasant. \n\n3. 8 turn crepe: This place is really neat. They do savory and sweet crepes. Fun fact about Waheda: LOVE ANYTHING PORTABLE THAT I CAN HOLD. Ex. crepes, wraps, burritos. They have a wide selection of crepes you can pick from or you can customize your own. I'd say go with making your own. I had the banana Nutella one and felt it was too sweet. Needed more fruits. Lastly, the icing on top they do student discounts. Keep that handy even if you graduated years ago. Lmfao. \n\nI was impressed with all the different vendors and definitely will be back to try the rest. I'm sure anyone can stop by and find something to their liking.", "author": "Waheda I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "Cool underground Food Court + Trader Joe's\n\nJian Bing, Wiki Wiki and POPP Cakes are worth checking out!", "author": "Vishal P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Another overpriced, overhyped hipster market in a fast gentrifying neighborhood. We went at 830pm on a Saturday for dinner with some friends. Quote a few options and filled with young people - there is a subway station and a Trader Joe's next door. We got the jerk chicken from one vendor for $12 or so and a seafood paella for $18 from another. The portions were ok and food itself tasted good but neither were memorable. Service was good - staff from both stands were polite and fast. However they were charging restaurant prices for what's essentially fast food / food truck level. There was even a $21+ sandwich stand. I do always go to these in every up and coming area and always regret - hole in the wall and proper restaurants are better especially for the same price. Convenient location but would not return.", "author": "Miri S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "This place is great! I love Smorgasburg so having an indoor food hall is the best. I love the idea of food vendors (even though it can get hard to decide!) because if you're with a group of friends, you can all just get what you want/are craving. \n\nAfter wandering around for a bit, not sure what I wanted, I finally decided on trying something new and getting a pork belly quesadilla from Dekalb Taco. It was good, but I think I'll stick to my regular chicken quesadilla. The pico de gallo was so good though. I was with a couple of friends and one friend got the pierogis from Pierogi Boys and she said those were good. My other friend always gets the same hero from Lioni's (try not to get too overwhelmed with the sheer number of choices!). We also love the fries from Home Frite, so we needed to get that. \n\nI ended my meal with a crepe from Eight Turn Crepe. I always expect a lot from my Japanese style crêpes because my brother and I adore them and every time we go to Japan we make sure to get crêpes at least twice a week (yeah, we're obsessed). I got a strawberry banana crêpe (my go-to always) and it just wasn't as good as I had hoped. Maybe it's because they used yogurt? I'm not entirely sure, but it just didn't live up to my expectations. On the plus side, they have a student discount! \n\nOverall, this is a solid place to go for food with so many great choices that makes your decision that much harder. The only downside is trying to find seating, but definitely check it out and take it to-go, if necessary!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "Chelsea market but amped up with way more diverse and yummy food -- also not nearly as packed w tourists as Chelsea. Great for grabbing food with large groups of friends that have a diverse range of tastes-- there is something here for everyone here. \n\nFood: 7.5/10\nPlace: 9/10\nPrice: varies on deals you get", "author": "Vicky Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "I stopped by Dekalb market the other day and I never expected it to be so nice in there! They have many many food choices from jamaican food to tacos to desserts. It's a great set up they have going on, kind of like a actual market. I got a beef patty from a Likkle Jerk and it was amazing, also I got the masala fries from this middle eastern eatery which was really good and interesting. I didnt get to stay too long but had a chance to walk around and look at all the different foods they offer. I will definitely be back and update with pictures.", "author": "Duvesh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "This place has bought life to this area!!! Been working around here for 6 years and had to wait until I left to pick up items that I needed. Now I can get what I need from Trader Joe's, Target, or Century 21. And the food hall has some seriously great food.", "author": "Pamela H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "It's like I died and went to heaven. Or maybe I just ate some much, died from it, and being surrounded by food is heaven to me. Regardless, I survived and I'm alive now to leave you this review. \n\nSo many of the great food places I've had over my life, from my childhood till being an adult, all in one place. Sprinkled with some other delicious looking places, and LOOK a Trader Joe's! This place is gonna make me cry. \n\nYou can walk around for hours trying to figure out what to get. First you have to walk around and see everything. It's like a maze so try to not get lost. Then you actually have to decide. How am I suppose to do that? Ample Hills? Katz? Lioni's? Good luck choosing. Then once you do, you'll have to decide what to get. Do you know how many sandwich options there are at Lioni's? Then you bet your money, you're gonna have to wait. These lines are no joke. \n\nAt least it's all worth it in the end. Pretty easy to get to. Located at the bottom of the new Flatbush extension building, in the basement. Just try not to get lost. There's no service so you can't call for help.", "author": "Mitch E."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}