{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-09", "description": "Overrated, overpriced and just not that good. Tried multiple stands and they are all most of the same.", "author": "Bryce W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "Not every single place here is amazing, but many are. So many awesome options. I take people here all the time, and I recommend it highly.\n\nMy favorite places for food: Arepa Lady, Bunsmith, Eight turn crepe, Likkle More, and Wilma Jean. Hana Noodles, too (though I don't eat there often because it's carb-heavy).\n\nClose seconds for food: Katz's Deli (pricey, but still great). Bread and Spread sandwiches. Fletcher's BBQ. \n\nFavorite places for desert: Ample Hills Ice Cream, Cuzin's Duzins donuts\n\nAlso, some of the specialty places are great. The NobleTree coffee place is awesome. The cheese shop is amazing.\n\nPlaces to skip: Paella shack (overpriced, not enough meat/food). Foragers (everything other than the chicken itself is poor quality). \n\nI haven't tried the sit-down places yet, but they look very good. I think it's an Italian/Pizza place and a spicy chinese food place, if I'm not mistaken.", "author": "Noah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Best place to get different types of tastes!  So many varieties and also a Trader Joe's near by if you need to do some food shopping!  Conveniently there's a Target right upstairs to do regular shopping as well. Overall, great experience but a bit pricey.", "author": "Tiffany M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Fantastic selection of top rated Brooklyn restaurants all in one place! Fun atmosphere and more walking space than I expected. Only downside is not a ton of seating unless you dine-in at one of their sit-down restaurants.", "author": "Don T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "My friend and I went down there to check out Trader Joe's at first. Afterwards, we took a look around the different food vendors at this place. It was amazing. We ate at Paella Snacks and Dekalb Tacos. The food was delicious. I would return.", "author": "Melissa Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "I love this place. There something for everyone's palate! It gives you great variety of foods. It definitely has a funky feel to it. It's almost like an upscale food court lol. However, you can get beer and wine here too and even walk around with It. Great for groups, girls night or guys night out or even solo night out.", "author": "Allyson A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Love cafe D'avignon bread \u0026 especially their ham \u0026 Gruyère croissant  \u0026 baguette.   Ample Hills ice cream is dying for.  Trader Joe's is here. Everything Yummie \u0026 convenient are all in one stop.  You can start your day from morning breakfast, lunch, snack, dessert and carrying on...", "author": "Kammy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "LOVE IT. Lots to choose from but favorites are the BBQ Lamb tacos, Smoked Crab tacos, Ample Hills Ice Cream  and Katz's Deli. I wish the poke spot there would add salads. Fun to walk around and they're usually playing good music too.", "author": "J L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "The market has 40 vendors to choose from.  A variety of Asian foods, crepes, ice cream, Trader Joe's, NY delis, BBQ, desserts, bakeries, Caribbean. Mexican, Polish, fish coffee houses, Latin American, craft brews  and pizza.  Something for everyone.  Seating is available or standing bar.  It is located downstairs from the Mall.  Prices range from $9-20+", "author": "HoyMay P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "Over priced and the taste isn't all that.  Atmosphere is cool, but I think Chelsea market is better.", "author": "Hank K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "Great that this is in downtown Brooklyn since there are not that many restaurants in that area.  Such a great variety of places to have lunch, dessert or even grab a beer.  Some of the stands are a little pricey and need some additional seating but all in all a great stop to make for a variety of options.", "author": "Meritza H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "There's a lot of variety for sure and the quality of the food is top tier without a doubt, but let's be honest, this is the expensive part of brooklyn. How are you going to charge $7 for just a cheeseburger?! Yes, yes, it's delicious as heck but it's no shake shack (YEAH I said it!)\n\nPrice aside, this is a culinary playground and I will continue to visit this money-sucking palate pleaser.", "author": "Lissa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "Great food selections, limited seating. You really want to be able to enjoy the food you buy but I found myself walking around letting my food get cold until a group of people freed up some seats.", "author": "Justin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "There are so many amazing options for food here, I always have a hard time choosing what to have when I go. I somehow always wind up getting ice cream from Ample Hills no matter what, it's just so good! And there's a shop there where you can get some really nice local brews, and even walk around drinking your drink while you peruse the other restaurants. There's something here for everyone, and it's a great place to go and eat after you've done all your shopping at the stores above. I bet it could even be a great date place if you're not sure what kind of food your date would be into.", "author": "Tamara H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Food and service is awesome at all vendors. Location is great. Trader joe's is inside to shop for home as well. It's a little pricey but worth it if you are indecisive or want to create your own fusion cuisine.", "author": "Jadenae A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "The Dekalb market hall has a plethora of foods from different cultures at fairly reasonable prices. There can be hit or miss depending on the stall or area you visit at the hall, but make no mistake, there are meals fit for KINGS. I dare say that the market hall's churros dipped in hot chocolate sauce are delicacies beyond mankinds imagination. I personally lost myself in the goodness of that chocolate. Additionally, there is a yummy spicy kebab with yogurt sauce(sounds unappetizing I know but I personally guarantee that it will send you to your next life). The Dekalb market hall doesnt only have stalls for informal meals. If you're looking for a great sitdown meal, I recommend going to Han Hynasty, a step up from the traditional Chinese takeout with elevated decor and REAL traditional Chinese dishes. A small note, the Dan noodles were so spicy I started tearing up in pain, you have been warned. A final note, the store named Katz Deli is a daylight robbery with its $25 price tag and quality inferior to deli sandwiches.", "author": "Jeeper K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Linos subs amazing!\nHomefrits truffle fries flavor is too much. Order a small instead of large.\nHana noodles bubble tea: an absolute disappointment. Flavorless and a long wait for nothing.", "author": "Araceli G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Such a cool fun place , have yet to try all the vendors but the food I did try was from the Caribbean food section , it was delicious and the staff was so friendly . Will definitely return .", "author": "Siomara P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-13", "description": "Kind of an easy place to go to if you're looking to get food quickly with a friend or just try out a bunch of different foods with friends. Everything is kind of overpriced, the lines for some of the stalls are really long, and it's almost impossible to find a place to sit. All of the food is average, there's nothing that is truly amazing. The best thing I've tried so far was the churros.", "author": "Shweta G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-13", "description": "It's a cool area for sure. Love the idea of an underground modern market hall. I love the Trader Joe's and the awesome unique selection of food, the only issue is the seating and the prices... I've never seen a bowl of Pho for $16 so it's hard to give 5 stars, a little overpriced. But worth it once in a while!", "author": "Amy T."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}