{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-04", "description": "Loved it a 'latte'! Just my latte.\n\nGot a latte ($4.75) from Nobletree Coffee here at the DeKalb Market Hall. They have a little space on the side to the left where you can add your milk, soy milk, syrup, whatever floats your boat. The guy making it was quick and made the heart latte art perfectly to the rim. Enjoyed my cup o' latte but I can't say the same for the rest of this place. \n\nFirst off, it's too crowded and the prices on some of the dishes are.. questionable. I circled around two times and there wasn't anything that really caught my eye except for the Trader Joe's that was nearby however, that too was ridiculously crowded with lines looping around and of course the first thing that crossed my mind was, no thank you. I walked in halfway when I remembered that I needed to get a bag of my favorite cheese puffs from TJ and took a backward step, Michael Jackson style, as soon as I saw that line. Then I hurriedly went back up the escalator with my cup in hand and thought to myself that I'll probably never go back down there again. It's your typical food market experience in NYC, like Smorgasburg but indoors and on a much smaller scale. Except, it gets crowded here too. Good luck finding seats if you come with a group larger than 4 people. I guess this would be a great place for a date with a potential mate that you found on Coffee Meets Bagel.\n\nLong story short, I'll probably not come back again just because of how hectic it gets and I'm not about that \"gotta pay up 20+ bucks to get a burger the size of half your palm and wait another 30 minutes for a scoop of icecream that costs 10 bucks\" kinda life, if you know what I mean. Don't get me wrong, I most definitely would if they were mind-blowingly good. But that's definitely not the case here.", "author": "Christine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "Who doesn't like a million choices and fantastically fresh food in a shopping center. I mean seriously, this place has a million choices and the food smells like you're in heaven.", "author": "Maranda T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "3 month update.\n\n\nWent last night after 3 months - umm WTF happened to the size of the hand rolls from Daigo ?! How Did it shrink in 3 months?! $9 for a toro hand roll the size of my middle finger?!? That's straight robbery never again. \n\nTried the salmon poke and bibimbop from wiki wiki - there was way too much onion in the poke bowl that it completely overpowered anything else I tasted. It started to make me sick and I stopped eating it. Bibimbop had some great tasting bulgogi ... but..... they added seaweed salad to the bowl?!? That taste combination was rather weird and I didn't realize it was in there until it was too late and it was already mixed. Not a classic bibimbop taste. \n\nPierogi boys is a hit and they are delicious. Definitely worth a stop.", "author": "Alyssa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "You know that scene in Charlie and the Chocolate Factory when they get their first look at the inside, and the kids eyes are all glazed over with wondrous delight?  Well that was me walking into Dekalb Market Hall for the first time.  This is what Foodie Heaven looks like.  It's like they took all the best parts of Smorgasburg, and put it indoors in an air conditioned hall, right off a subway stop that's convenient (to me).\n\nGive your taste buds an early christmas gift and go spend an afternoon here.  You won't regret it.", "author": "Ajay R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "I might be biased because I live directly across from it but I think this place is pretty damn good. It has all the major food groups - pizze, burgers, ice cream, noodles, Italian sandwiches, BBQ meats etc and even a Katz deli. \n\nIt's a lively food hall but not overly crowded. It offers a bit of entertainment on Friday (possibly also Saturday) evenings in the form of a live jazz band. \n\nFor those who lift, have insatiable appetites and ascribe to the weekend cheatmeal protocol this is a target rich environment where you can seamlessly move from stall to stall eating one of everything on offer until you feel like you're going to perforate your stomach. \n\nFun for all the family.\n\nThe only negative is that it's mobile phone dead zone. No signal, no WiFi, which can be immensely annoying if ur trying to meet someone there or just want to maintain contact with the outside world while eating there. Please install some sodding boosters!", "author": "Tommaso S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "Love this place \nAlways so much fun, good prices and good choice of food\nAnd fun crowd", "author": "Anna N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "I've been here couple of times, compared to last summer, there are definitely more vendors join! love the fact there's so many varieties to choose from, I had fletcher's BBQ, ribs were ok, brisket was delicious! Bunsmith korean fried chicken bun was ok, there are two flavors if i remember correctly, soy ginger and spicy, i opted for soy ginger, it was abit soggy and the flavor was meh. The seatings in the market hall are not the most comfortable, and since it's in the basement, unlike Gotham market, there's no natural lights. If i'm in the area, will definitely return for other selection. There's a trader joe's there too :)", "author": "Karry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "This concept was so well executed, I can see myself going back many times! As you wind through the first floor you see entrances to Target, Trader Joe's, the new theatre and a bunch of shops. If you head downstairs one level you hit the food court- it's totally industrial feeling, with a huge variety of food and drink vendors all calling to you with their big neon lighted signs and buzzing lines. \nThere is a wine shop and a beer shop which both allow grab and go, so you can walk around with your drinks as you scope out the food scene. \nI was honestly overwhelmed at the food choices that I did several laps just observing, and planning my route for next time.\nFood wise they have a Katz deli, Italian sub shop, tacos, sushi, Vietnamese, ramen..! And dessert even harder to choose with Steves Key lime pies, donuts, churros, cake pops all of which are luring you in by way of the delicious looking displays.\nMost of the places seemed to have a few counter seats and there was a good amount of general seating scattered throughout if you and a friend opted for foods from different places. \nTheir was also a full service restaurant on the side of the food court that looked really nice, but had a totally different feel. It wasn't getting nearly as much traction as the food court itself!", "author": "Sam K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Dekalb market is in the downstairs portion of City Point. We really enjoy coming here after shopping at the Trader Joe's or for a night out (for movie watching, Alamo Drafthouse is upstairs). We have tried food from the Pirogie Boys and Arepa Lady. \n\nWe got the sample platter, which includes potato and cheese pirogies and meat  pirogies. I thought the flavors were OK though not memorable. But, the portions are large, so if you want a meal that will leave you feeling full, this is it. \n\nThe arepa with cheese was delicious. I'm Venezuelan, and my wife is Colombian, and we both enjoyed it. Tip: you should try the Colombian sodas they have for sale. Don't be shy - they are super refreshing.\n\nWe are planning to come back to the Dekalb market to try many more options. There is live music, tons of food and drink options, and an increased amount of seating, so this is a great place to visit!", "author": "Alex W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Yes yes this is all I'm going to say.... Upon entry you are literally transported into food heaven or a paradise if even. And you will be overwhelmed by the grandiosity and corona of neon lights shinning upon these food choices!!! \nMy advice. Don't go in too hungry as you will gravitate to everything that smells good, and of course, looks good. Choose wisely and have fun. Literally felt like a I was in a food maze. I loved every second of it!! I also settled on the BBQ joint and it was soooooo gooood and I have no regrets when that pulled pork sliding out my bun and back my carton, atop them waffle fries. Don't get the cow slaw though. It's honestly trash.", "author": "Kheeda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "This place is a very cool and it's exactly what it says it is: a market hall. There are dozens of small kiosks and vendors laid out in a maze like structure. Fletcher's BBQ, Katz Deli, Taco stand, Arepa stand, ice cream and coffee - to name just a handful. I haven't tried the food yet but just by sitting at a table and people watching everything looked (and smelled) pretty delicious. \n\nThere is a Trader Joe's adjacent to the market hall and like any TJ's they're well stocked and have great low prices on items. I think I prefer this location to the one on Court Street simply because it's so spacious and well laid out.\n\nIt's a fun Saturday morning or lazy weekend activity and I am happy to see so much business bustling in the area.", "author": "Maya T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "I love how spacious it is! (for a New York food hall that is). There's PLENTY of options from Katz, bakeries/coffee, hand pulled noodles, arepas, pierogies, Hawaiian, hand roll bar, buns, ETC. You'll for sure find something you like here.\nWe came on a Saturday during lunch time, and surprisingly wasn't PACKED. I was expecting to wait in long lines, but I think there's so many options, none of the stalls really had that long of a line. which is GREAT! We also found seating in the back, but this might be rare when it's busy.\nIf I'm in the area I'll definitely come back again. Or take visitors here!\n\nIt's also in a shopping center with TJ's and Target. PERFECT", "author": "Kimmy U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "This is probably one of the best food markets in New York. It has a large selection so it may take a few visits before you can try everything.\n\nDaigo handroll - My go to spot at this market. All the rolls are made to order and must be eaten right away to enjoy at its peak freshness. Try the scallop handroll!", "author": "Kenny H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-31", "description": "I practically live here. So many choices! My fav is Bunker for fish sandwich, juice place for their C vitamin juice, key lime pie place, and Katz's of course! Go there!!", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-01", "description": "Conveniently right off the B train, so makes venturing into the Brooklyn scene a lot easier =P. There were lots of options to choose from in the Market Hall. We tried a lot of different dishes to get a feel of the whole market. On our plate, we tried The Paella Shack's paella (lots of ingredients and well seasoned. It got a little too salty half way through, but I would say it's a great option if you're craving Paella), Daigo's handroll bar (saba, spicy salmon and scallop - all were very good and reasonably priced), Hanan Noodle (mango ice tea - definitely needed with all the food we ate), Bun Smith Bk (Bulgogi bun - not the best bulgogi, but decently priced), Wiki Wiki Nom Nom (Wasabi Salmon Poke bowl - lots of  ingredients, great flavors). \n\nIt was hard to find a sit down area as there were a lot of people, but it's great they also provided stand up tables too.", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "I'm just mad because I didn't come here my first time in Brooklyn. I was deterred by the fact it was in a mall with Target. Don't judge a book they say...this place was the bomb. My party and i were not disappointed by any of our choices. Warning, ask the Shamghai crêpe people to go easy on the satay red chili peppers or you'll be sorry. Went back for seconds at the Arepas Lady because of that shanghai spicy crepe!", "author": "Elyzabeth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "Really liked this food hall. I had a very hard time parking in the area and there isn't too much seating but they have a great variety of food to choose from. Lots of gluten free options here!", "author": "Gigi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Soooo many things I love about this place. I like it way more than The Pennsy in Manhattan. \n\nI am fortunate to work near DMH now, so it's suffice to say that I have had a fair share of meals there. \n\nI'm just going to highlight my favorites - the spots that I keep going back to.\n\n1) BK Jani - SPICY Pakistani food. A Desi joint that refuses to condescend our palates. Buhuth buhuth Shukria!!!! The lamb chops are my favorite. After that, the Sheekh Kabob platter. It is so rare to have those flavors (cumin rice and all) in NYC. \n\n2) Paella Shack - The squid ink seafood paella (I don't love the other ones that I've tried). I order it with the aioli sauce on the side (or the rice gets too drenched) and usually order the meal that includes the kale salad. It's real paella - made quickly, right in front of you - very impressive. I especially love the very filling kale salad that's loaded w/ goodies. \n\n3) Wiki Wiki - The spicy salmon poke bowl and the spicy tuna poke bowl. Go with a friend and order both and share! That's what we do.\n\n4) Fulton Landing Seafood co - The Kickin' shrimp and crab chowder is to. Die. For. And it is actually spicy. No dairy and great for colds.\n\n5) OMG. The Jerkito Burrito w fish from Likkle More is unbelievable. Roti stuffed with grilled white fish, cabbage, coconut rice, curry, etc... topped w a tamarind yogurt sauce. Ask for hot sauce. My current fave.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "I just wanna first start out by saying this entire market Hall is totally overpriced! $15 for a bánh mì sandwich? Are you kidding me? This place pisses me off! I've had more authentic better food in the city for more than half the price of this nonsense gentrified crap! There's much better places to eat at half the price! It really really pisses me off! I have had amazing Bánh Mì in Calgary, San Francisco \u0026 lower Manhattan \nand they don't cost $15!?!?!? \n\nThis market Hall is a total colossal rip off! I'm warning you! Do you homework and you can find much tastier food for half the price!!! I've lived here for over 18 years! Places like this make me sad", "author": "Rizwan A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-29", "description": "My friend and I split the ribs from Fletcher's Brooklyn BBQ. For $16 for 4 pieces this was definitely a must avoid. The pieces were dry and I had to keep dipping the ribs in the BBQ sauce to keep it wet. \n\nThe ribs were not fall off the bone and I suspect the ribs have been sitting for awhile because there wasn't really a crowd or demand for this here. \n\nThe hall as a whole was kind of cool with couple of interesting options. Would try something else next time.", "author": "Alan N."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}