{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "Definitely on the pricey side, but there are lot of different foods. Also, there should be way more seats, you literraly have to hunt for  a seat all the time. Our favorite is Two tablespoons.", "author": "Alexandra D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Love love this new market that opened up in Brooklyn. Brooklyn deserves a nice market hall not just in Williamsburg but in downtown Brooklyn as well and this is it! The food varies from savory to sweet so you can get your cravings safistied here! \n\nThere are so many vendors you'll want to try that you'll probably need to come back more than twice !", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "So many food stands, so little time. I only had time to try the Jamaican veggie patty, ample hills creamy ice cream, and home frites. My bf had the Jamaican jerk chicken and three tacos from the taco stand. \n\n1. The veggie patty had a very home-y pot pie taste and their spicy hot sauce gives it a nice kick. \n\n2. The ice cream from ample hills had plenty of flavors and my cookies and cream ice cream was creamy with chunks of cookies. You can get a regular or sugar cone for free of charge. \n\n3. The home frites were ok. Nothing extraordinary and can't really compare it to the pomme frites in the village. \n\n4. My bf loved the Jamaican jerk chicken. He claims this is the best thing he's tasted at the market. \n\n5. He liked the tacos but it wasn't anything different from other taco spots. \n\n6. Right by the escalator there is a bread stand and we purchased their kalamata olive ciabatta bread and this is divine with some olive oil and salt. \n\nThere are so many other food stands that we didn't have the chance to try but will definitely come back to taste them.", "author": "Tseten S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Super fun experience! Something for everyone. Went on a Sunday afternoon and not too busy. Definitely recommend if you're dining with someone who has different taste or dietary needs", "author": "Noelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-11", "description": "I love the Dekalb market. The Katz deli is fantastic. The manager Wilson and associate Laura are great!! Soup is fantastic!!", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "It was my first time here and I absolutely in love with the place. There are so many choices, from Katz's deli, to Korean, Spanish, Thai, Japanese, Chinese and anything else you may crave for. They also have a tons of dessert, ice cream, and pastries. Compare to Chelsea market, definitely like Dekalb Market better! It just has more sitting space here, and more options, and the decor is clean and modern. It also doesn't have too much a waiting time at each stalls. We got a classic from Katz's and it was so tasty! The staff were really friendly as well. We also had the churros, it was soooo good especially it was heated up. We got three for $4. Definitely try it out when you are there. Also, they have trader Joe's there, so that's always a plus.", "author": "Rachel Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "I finally made my way to DeKalb Market Hall this past week on a night where my boyfriend and I did not know what we wanted for dinner. We definitely made the right decision as it had a plethora amount of options to satisfy both of our cravings. I guarantee you that you will find something you like here- there is a massive array of very delicious food and then a connection to Trader Joes. We tried the classic noodles from the Hana Noodle Station, the short rib sandwich from Bread and Spread (my favorite- packed with flavorful meat), pierogis and a fried chicken sandwich. We ended our meal with ice cream Ample Hills Creamery. They were more than generous in letting us sample pretty much all the flavors. \n\nI would definitely be back for that short rib sandwich!", "author": "Hyesil C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "As I was traveling through Southeast Asia last summer, I was greatly impressed by the food courts in the upscale malls. Unlike many American food courts, the Bangkok and KL malls treat theirs like a sampling of the best food in the city. \n\nI was thrilled to discover that Dekalb Market Hall is very similar to those food courts. While the place in Albee Square (not sure if it's just called Albee Square ‍) is not necessarily a mall it is similar in structure. The restaurant booth layout creates for a festive atmosphere, channeling outdoor summer staples like Smorgasburg or Madison Square Eats, yet more reliable and frequent because it's year round. I'm now more likely to try Katz in this convenient location close to my apt and I'm excited to sample different dishes from different stalls on my frequent visits to target. \n\nAll in all, this is a refreshing addition to both the US and  a part of Brooklyn that often lacks trendy food.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Headed here right after the Jimmy Kimmel show nearby and boyyyy do I love my food market halls!\n\nSO. MANY. OPTIONS. I couldn't decide. I couldn't decide to eat healthy or have an overload gluttonous goodness type of dinner. So I decided on some Jamaican Jerk and my friend got a healthy bowl. Then we shared some home style fries and they had great sauces, YUM!", "author": "Raviana R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-17", "description": "I was really looking forward to trying Dekalb Hall because I figured it would be similar to Smorgasburg, but much more convenient to get to. Unfortunately, none of the vendors there really wowed me or gave me a reason to come back again.\n\nIt opens at 11 and starts getting crowded at around 11:30 or so. If you must try this place, I would recommend figuring out what you want beforehand, so you can be in and out before the waves of people come. Good luck finding a seat, or even a standing table. We were lucky enough to nab some bleacher seating.\n\nHere is everything we tried, in order:\n\nPaella Shack: Mariscos (shrimp, calamari, cuttlefish, string beans, \u0026 mussels); Valencia (pork) - the seafood was bland and fishy at the same time. The only thing they cooked well was the shrimp. The Valencia is definitely the better of the two. This wasn't bad but it had too many peas in it. It's also pretty expensive for $15+ per plate.\n\nWilma Jean: Spiced Chicken Bowl (jasmine rice, cucumber, pickled daikon \u0026 carrots, cilantro, lettuce) - this was actually pretty good. The chicken wasn't dry, and the flavor was spicy, but not too spicy. But with the total after tax coming out to almost $15 for a small bowl, it definitely was not worth it.\n\nPierogi Boys: Pierogis with farmer's cheese and potato, topped with bacon, caramelized onions, sour cream, and chives - pretty good, I think. The reason why I said 'I think', is because I'm not a huge fan of pierogis, so I don't have a whole lot to compare it to, and I don't think Mrs. T's counts. In fact, I think that company might be the reason why I don't like pierogis that much.\n\nHome Frite: Chorizo Fries - this was a bit much. It was handcut fries, with chorizo, avocado, and a mysterious green and white sauce. The avocados were a nice touch, but it still wasn't enough to balance out the rest of the greasiness. There was barely any chorizo in it, which was the whole reason I ordered it in the first place. Had I known they were only adding tiny morsels of chorizo, I wouldn't have ordered it.\n\nArepa Lady: Classic Arepa - by the time we had this, I was already so stuff. But the arepa was so good that I ate it anyway. I only wish they separated the sauces into separate little containers, instead of drowning one side of the arepa in them. Still, this was probably my favorite of all the foods I tried here. But it isn't enough to come back. I doubt I'll be coming back until they rotate some new vendors in.\n\nBottom line - the quality and the quantity don't quite match up. You're better off making the trek to Williamsburg.", "author": "Mel T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "I always love to explore new places when visiting cities. DeKalb was recommended to me by a friend who lives in Fort Greene. A variety of small food stations, it was super fun to look at all our different options. \n\nI ended up getting a breakfast sandwich from Two Spoons and coffee from another stand. It was a little pricey, but that's to be expected with food halls. The sandwich was a unique blend of flavors, with avocado, egg, slaw, and chipotle mayo. There were tons of other booths I wanted to try as well, but overall, it's your typical food hall concept. With not wanting to spend more than $15 on breakfast, I stuck with my sandwich and coffee.\n\nIf you're to kill some time in Brooklyn, definitely check this place out.", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-29", "description": "This place is amazing. Take the train to Nevins and walk down Fulton and make the right by the century 21. The dekalb market is located in the basement level. The beauty of this place is it has a little bit of everything to eat. We just left and it was crowded which is expected for a sat night. I ordered from the taco spot and enjoyed my food. I got the grilled steak and snow crab tacos. They have the right mix of flavors and spice. Take your crew here and enjoy your night out.", "author": "T H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "On a Saturday night, this place is a scene, man.  Who knew?\n\nSo yeah, while I continue to find the whole Food Hall craze to be a head scratcher, if the constant onslaught of people eating here during our visit was any indication, nobody else in BK shares the sentiment.  But still... Why would anyone pay sit-down restaurant prices to eat in what amounts to a glorified cafeteria with next to no ambiance and no wait service? Hubby \u0026 I aimed to find out:\n\nKotti Berliner Doner Kebab:  So when I spotted the menu for this stand the first time at Industry City, I vowed I was never going to spend $14 for a Doner Kebab Sandwich.  Then I saw the stand here and noticed they were selling Kebab 'Cones,' something I did not recall seeing at IC, for $10.00.   Alas, this turned out to be a fun concept gone wrong.  To be fair, the Kebab filling was delicious, but the 'Cone' component consisted of what seemed to be a regular 'ole flour tortilla shaped inside a cone-like holder. For the price, I expected something more innovative than a tortilla.  Plus the bottom corner of the 'Cone' leaked into said holder, hemorrhaging much needed harissa and yogurt sauce in the process.  The posted menu also didn't offer any food descriptions whatsoever, so it was confusing to order.  \n\nBK Jani: I confess I was excited to see this stand!!!  That very same day I'd been contemplating checking out the brick and mortar Bushwick location.  Hubby and I wound up sharing Seekh Kabab, aka Grilled Ground Meat, wrapped in Paratha for $12 .  Can't seem to recall if it was beef or lamb, but I distinctly remember that it was juicy and spicy AF, and we loved every bite!  So if eating at a Food Hall like this helps you decide if you want to go all in as far as committing to the restaurant incarnation of a stand, then I can get behind that.  \n\nBeer Stand (Craft \u0026 Carry):  Admittedly, we are the morons who didn't look at the posted price and wound up paying $15(!!!!) for a pint of underwhelming on-tap Gose beer.  But wtf???  In a plastic cup, no less.  Fwiw, we spied bottles of, if memory serves, Brooklyn Lager, for a MUCH saner price at another stand.  But it was too little, too late for us.:(\n\nSomehow or another, I missed a whole aisle, parallel to Ample Hills Ice Cream, that included stands for Poke, Hand Rolls, and some sort of healthy bowls and I believe, Beet Burgers.  Was a bit sad about discovering this after having already pigged out. I suppose it means I'll have to return and continue my uh, research.  Yeah, that's it... Research.", "author": "Yael D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "So many great options! A lot of the \"famous\" places that are out of reach to many have store fronts here. I came right when it opened so it wasn't crowed, but the set-up would've been really hectic during rush hour. It'd be hard to find seating, so I recommend coming right when it opens (at 11am). There's 0 signal here though so don't expect to be able to Yelp or read reviews while you're there. \n\nI just tried the Arepa Lady. See my photos, but I'll definitely come back to try other foods!", "author": "Mai P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Where do I start. So many cool things to see and eat!\nA really sick hall jam-packed with cool restaurants/bakeries/bars. A pretty decent seafood selection from a couple places.\nA handful of happy hours to choose from.\nThere is even a fantastic mini beer grab n' go place that has a fantastic selection of beers on tap, the \"bartenders\" there are really fun to talk to.\nThis hall is complete with the best Trader Joes in the city on the same basement level.\nAn epic night waiting to happen!", "author": "Christine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "This is by far one of my favorite markets in the Brooklyn area. The market offers a variety of foods to try from; from Jamaican to Japanese to Mexican. The food can be a little pricey in this market but it is definitely worth it. My favorite spot is their taco spot which is also located next to a churro truck. The pork tacos here are out of this world good!", "author": "Toni C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "This is one of those spots you'd expect Brooklyn to have a lot of but it doesn't. But there are a lot of different places to eat and drink and just kick back and have a good time. Some days a week there's live music. From sandwiches,ribs  tacos,jerk chicken, fried pizza ,sausages, smoothies, wine, beer and  that's just what I remember seeing.", "author": "Jahmal P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-15", "description": "I'll detail the food I ate at DeKalb Market Hall, but my TLDR review is that this food court is over-priced, crowded, and the food is mediocre (and the portions are tiny) for what you pay. It was clearly built as a tourist trap and for \"development\" of the area. My BF and I tried:\n\n1) The Hana Noodle Place (I think this is what it's called). We got the classic soup with hand-pulled beef noodles, and a large taro bubble tea. The bubble tea was good, but the soup was not. The bok choy in the soup was well cooked and the broth was ok but the hand-pulled noodles were under-cooked and doughy and the beef was barely seasoned. The soup was small, too.\n\n2) We split the specialty burger at the burger place - a double-cheese burger with onions and bacon. First of all, it was TINY. And not that I'm expecting a disgusting cheese-cake factory size portion, but for $12, I expect something two people can share. The burger itself was about the same quality as shake shack at BEST. The fries were stubby and overcooked. \n\n3) We split a fruity pebble rice crispy treat bar at the Cake Place. It was pretty good but it also cost $4, and honestly, it's hard to screw up a dessert like that: it's sugary cereal held together with marshmellow. \n\n4) We also split a beer at the Montauk Brewery beer bar. This was probably the most enjoyable part of the experience because they have stools and you can watch a football game.\n\nIf you're going for drinks and to hang out, it's not a bad spot to sit and people watch, but be aware that the food is far from the best of what NYC has to offer and also pricey.\n\nEdited to add: the last thing I wanted to comment on is the LAYOUT. The hall is almost labyrinthine by design and the seating placement is baffling. If the hall were filled to capacity there almost certainly would not be enough seats for even half the people buying food there. I also didn't see any central facilities, such as a station for trays, napkins, etc. which would have made getting the food from the restaurant to the table easier (I almost burned my hand on my soup walking around looking for a place to sit).", "author": "Maya N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "As a person who absolutely loves food can I tell you that I got super excited coming in here. This place is a foodie's dream come true. I didn't know what to do with myself. There were so many good restaurants in here. I felt like a kid at a candy shop. If I lived in New York I would come here every day just to  experience one booth at a time. I am so jealous. If there was a small place to showcase the World's vast variety of foods in New York this place would be it. They even had a Trader Joe's which was like the cream cheese frosting on a chocolate chip cupcake! (I guess it's time for me to get dessert)\n\nWe finally settled on Hans Dynasty but the choice was a difficult one. Hans Dynasty was a great choice but still a very difficult one. I definitely have to come back here to explore.", "author": "Natalie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-26", "description": "Quality place. I got some mushroom empanadas from a stand in the back and they were pretty tasty, and not too expensive surprisingly! Very spacious with food seating. This isn't the hugest food market I've been to but the food I had was good, so no real complaints here.", "author": "Kate J."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}