{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "This place.... wow. I have died and gone to foodie heaven. I regret nothing!! Where do I start? First off, it's nearly impossible to have a bad meal here. It's also impossible not to find something you will like. Whether it's hard time Sunday's amazing burgers, diago hand roll bars fried oyster sushi, Steves amazing key lime pie bars, likkle mores awesome curry, you will find something. The best ice cream in the city ample hills is down here, and let's not forget arepa lady, pierogi boys and Katz. If you don't find something here you love, there's something seriously wrong with you. It's a little pricey, but understandable giving the options. There is simply no place like this anywhere in the city.", "author": "Charles A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "it can get crowded - go early.  The Paella shack lunch was a great deal and really tasty.  Lot of cool places within walking distance too.", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Went there last night for the first time and was pleasantly surprised! Our favorite sandwich shop has a booth there - plus you can drink while you walk around. Will definitely go back.", "author": "Megan W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-10", "description": "Optimistic for the future, as this does seem like a great place to hang out and try some cool food. While the prices at many of these locations are absolutely exorbitant, it is still worth it for some time well spent. The major issue is with the seating situation. It is both lacking and the available seating is very poorly thought out, as of right now, in terms of placement. \n\nAlso pretty bothersome that every last place expects a tip, even though it's literally 100% takeout.", "author": "Uri L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Fantastic array of vendors. Come on, the arepa lady is across from Katz's- that's incredible. It's a convenient spot and an intuitive space. My favorite food hall in the city, though there could be more seating options.", "author": "Edward J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "I love this place. It like a bunch of food trucks of your favorite comfort food. In the same complex is a target, trader Joe's and the Alamo Drafthouse. Its an all around slam dunk. Kid friendly and easy to navigate.", "author": "Emily R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Love this place! Glad that it has become a part of the downtown Brooklyn vibe. Still trying new places each week but so far really loving the Korean bun place and the tacos. Great to get a snack then do some shopping at Trader Joe's or upstairs", "author": "Tracy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "There is a perfect place and rebirth of everything. This once outdoor market with limited seating and dust is now a perfect and soon to be crowded foodie mecca. Grab a friend or a fee friends and head over to this basement. There is everything a person could want and some phantom booths where others will go.", "author": "Reshard R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "My visit was pleasant and enjoyable, I mused all patrons and then decided on Katz deli, \nI've enjoyed there product years ago while working in Manhattan. \nThe product is still as I remember it delicious and great potion size. I had the combo with corned-beef and pastrami, side of potato salad. It's five stars ladies\u0026 gentlemen. \nGet yours if you are in the area, or make a special trip you won't be disappointed.", "author": "skeet s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Loved Dekalb Market Hall, its very familiar to Boston Public Market. A number of vendors set up shop offering their speciality food. It's like food trucks with out the trucks. I had to walk around and look at all the options before I made my decision. I ended up going with the Paella shop because I've got a weak spot for Spanish food. I ordered the paella mariscos, the seafood option but I should've gotten the squid ink version because it adds an extra dimension to the flavor profile.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Great selection of foods from many different cultures and cuisines. Tried Wiki Wiki Poke, which was solid, but not as good as other poke places I've been to. I got the korean spicy salmon bowl which used a gochujang type sauce. There was also avocado, nori, and cucumber, but I wished that there were a few more toppings. The rice was also well done. $14 was a bit expensive given that Sons of Thunder has way more toppings for around ~$14-15 also.", "author": "Caleb F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "The vast selection more than makes up for the pricey foods.. and yes, they ARE pricey. You've been warned.", "author": "Edin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Seriously the best food experience I have had in awhile in Brooklyn. Everybody was friendly and the atmosphere was very relaxing. I went during the weekday at lunch time and it wasn't crowded at all.  I tried out the rib tips and French fries at Fletchers BBQ and it was the straight up bomb! Then, I tried the Hennesy Donuts at Cuzins Duzin..you will seriously get your life with these donuts. I wanted to take something to go but I was soooo  full. Money well spent.  If you haven't gone yet try it out for the experience. It's an underground market in the old  Albee Square Mall. I'm already ready to come back again.", "author": "Mechelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "I was really excited to get a market hall in Brooklyn. I have been there three times thus far and look forward to continue trying new places and coming back.", "author": "Jenna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Stopped by here on a Sunday night and the place was buzzing! There's a great selection of food and the layout is conducive to browsing and making multiple short stops at the different vendors, though you'll find yourself quickly racking up a tab given that the food is fairly pricey. \n\nWe sampled some great pickles at Guss' PIckles, had beer and oysters at Fulton Landing and pierogis at the Pierogi Boys. Everything was satisfying and I'm really looking forward to going back to try more of the vendors. The location is convenient and it's open until 11PM which is better than a lot of the other good options in the area.", "author": "Ramesh D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Awesome experience! Espectacular foods, like homefrite, Dulcinea and Arepa Lady. You have a wide variety to choose from. Tacos are delicious, sushi fantastic and burgers to die for!", "author": "Maritza M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "I love the new marketplace.  It has quality good vendors from all reputable restaurants.  It is a great place for tourists and local alike.  For the local it is one stop shopping, you have get your local favorites like Katz deli sandwiches and shop at Trader Joe's afterwards.  For the tourists it is a great place to sample all things that make NYC a Mecca of food.  The place has great shopping above  as well, it is definitely long time coming for this place and hopefully it will continue to be great.", "author": "Adeline C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-29", "description": "This place is cute, but definitely need more seats, otherwise you're not able to eat your food properly. \n\nI have been curious about Bunker the Vietnamese place and I am so glad I didn't venture out to their original location, because the Pho was nothing like the way people described. People who would describe this being the best Pho has never had damn good broth from Pho Dien in Houston, Texas.\n\nThat's Pho that I would travel and fly to and eat it everyday and still be happy.\n\nThe other place I tried was Hana Noodle Station and got their Dan Dan noodles. I wasn't into it, because I despise green peas. I prefer Dan Dan noodles with edamame.\n\nP got something from the BBQ joint, can't remember the name, but P wasn't into it.\n\nI didn't taste anything spectacular, so not running back any time soon.", "author": "Ro R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Made a special trip to Brooklyn just to eat here. It was kind of hard to find if you didn't ask for help. Great variety of food stalls and we sampled a variety. Lobster roll, cheeseburger fries, Raman noodles and the ice cream. I wish I had more time and hunger to try a few others.", "author": "Bru S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "I am SO excited that this has finally opened. I've been eagerly anticipating, and the wait was well worth it!\n\nI'm really impressed with the wide variety of food options here. The organizers did a really amazing job at selecting old \u0026 new vendors and showcasing some really unique food options. I try to eat something different every time I visit. There's definitely something for everyone.\n\nThis place is still really new, so there are a few kinks to work out with crowding, seating, and with vendors planning a little better. However, I can't help but be extremely excited every time I visit, and I'm sure these things will get sorted out in time.", "author": "London G."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}