{"aggregateRating": {"reviewCount": 589, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-31", "description": "The food vendors are good, and it's a cool space, but what if I want to eat some overpriced food before I go grocery shopping without being assaulted by literally 4 or more songs at the same time? If you're going to let vendors play music, maybe don't also play music throughout the entire hall, plus some ridiculous DJ in the weird back room that people probably just want to eat in.", "author": "Jaron R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "Everything we had was great! Lots of choices, fun environment, gets very busy so be ready to be quick to grab dibs on a table to eat your meal. Looking forward to going back soon!", "author": "Royal G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "So much to eat. Didn't know where to start. \n\nCame here on a Saturday and it was busy but was able to find table/seats pretty fast. It is a bit overwhelming but if you're here with friends for a quick bite its worth it. Great place for lunch.", "author": "Patricia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "This place is absolutely awesome. It kind of reminds me of a marketplace in Japan that sort of crowded with narrow halls and tons of stalls and lower lighting with lots of neon. I love that this is now in downtown Brooklyn and my husband is equally obssessed. As we were leaving, he wanted to plan the next time we would come right away.\n\nI suggest walking around and checking out every option before settling into one. There are a ton of choices of all different kinds of cuisines. You will not be disappointed at all; there are just many things to chose from. Every palate will be satisfied. I decided on the arepa lady stall, which I was thrilled to see was there. I have been meaning to get out to Jackson Heights to try it but just haven't had a chance so I was thrilled to see that there was a location here. \n\nThis place definitely requires several visits and you can get your groceries at Trader Joe's right there! What's not to love?", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "This place has been around for a year now, but didn't hear about it till a week ago. There is a variety of food here so pace yourselves. You can get tacos to ice cream. They even have Katz and Lioni heroes. There is live music playing in the hall. I definitely recommend coming here and will be back soon.", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "This place is definitely a refreshing addition to all things Brooklyn has to offer. It is definitely a great way to spend an afternoon as I did this past weekend. There are many food options to choose from. I walked through various food stands from a Hoagie stand to a Paella stand to a Seafood stand which looked delectable! Seating can be limited on a crowded day, but not to be deterred, there are several restaurants which offer comfortable seating in a restaurant setting. I'll definitely be back to sample the food offerings...the prices are comparable to the city, but that is to be expected as it is a tourist attraction and situated right in the center of Downtown Brooklyn amid the shopping district", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Yaaaaaaaaaaaaaaaaaazuh....... Yaaaaaaaaaaaaaaaazuh! \n\nThis place is a total EXCITEMENT for all my foodies who loves to ignite your senses to the NEXT Level.\n\nGo here for lunch or on a Saturday or on a Sunday!!!!!!!!!!!", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "Finally! A Brooklyn staple that isn't season (Smorgasburg). Conveniently located in Downtown Brooklyn, easily accessible by most trains, Dekalb or Atlantic Ave station. Trader Joe's is right there, you have Target a couple floors up, and even Alamo on the top floor. You could probably spend a good half day here.\n\nDekalb Market itself is pretty much smorgasburg dressed up. Less variety but better options, I'll say. Ranging from fancy Foragers Market to Perogies to Barbecue to Jerk Chicken. Those are just a few selections. It's bad for the indecisive ones to come here because there are so many quality options.  \n\nMy favorite quick bite has got to be the bao place in the back. The pork bao and tofu is my ultimate fave but it also depends on what you're in the mood for. 2nd fave are the perogies! You can tell they're family owned and operated, they make the dumplings right in front of you and are boiled as you order. Very home-y, if you get what I mean -- not processed, packaged. \n\nThis market is definitely family/kid friendly. There's seating in the front and back of the market and plenty of bathroom stalls (not sure how clean it is).", "author": "Celeste Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "The vendors here are probably not 100% amazing, but from my experience all of the food I got was extremely tasty and filling. The prices may be steep, but that's totally normal for this area and type of food market. There are SO many options; I definitely had to walk around 5x before I could make up my mind. Located downstairs from a beautiful mall, this is definitely a prime spot to grab the hottest food in the neighborhood. It might be hard finding seats, but it's worth waiting for the experience. \n\nHighlights: Pierogi Boys \u0026 Paella Shack! The pierogis at the stand are HUGE, and definitely more filling than you may think. 6 for $12 seems pricey but these things are bursting with flavor and are handmade with love. Paella Shack also has a bunch of options, I ordered a create my own bowl with squid ink rice, veggies \u0026 shrimp, and classic garlic aioli. They were quite busy so I didn't realize they gave me the wrong bowl, which was a mix of seafood, but it was SO GOOD. The rice was full of flavor and the shrimps were pretty large. \n\nDefinitely a bunch of more vendors to try but I would recommend for anyone no matter where you are! It's worth the travel.", "author": "Amber C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Dekalb market is the food court from heaven. They have everything. From chinese to korean to japanese to jerk chicken to burgers to brisket to donuts and ice cream. There isnt ever enough seating because its always packed. Come prepared to stand and eat just in case. Their is pretty rough cell service down there so if you lose your friends text may not work.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "I came here on a Sunday with my boyfriend and friends. This is located in the basement. I love how they have target upstairs and trader joe's right next to the food market. Super convenient for a place to run errands! For some odd reason, I thought there would be more vendors than they offer but there is still a wide variety of food. \n\nMy boyfriend and I opted for the BBQ stall (Fletcher's Brooklyn BBQ). We got 4 ribs and a brisket sandwich. The total came out to be $28 which is pretty average for BBQ in NYC. \nIt was kind of crowded/packed. We couldn't find a seat even though we searched for a good 20 minutes. Finally, we found one of the standing bar tables. The BBQ was pretty good, but not amazing. The bun from the brisket sandwich was drenched in oil and the brisket lacked flavor. It was still a pretty good meal overall.\n\nIf you were to come here, I recommend taking the train since it is super convenient and only a few blocks away. My boyfriend and I drove and it was a hassle to find parking. We drove around for almost an hour and finally found a parking spot.", "author": "Flora L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-27", "description": "Lots of good options. The Vietnamese sandwiches were delicious. We also got the pierogies and kielbasa. These were okay. The best items were the crepes. We got two breakfast crepes as well as the creme brûlée. All were excellent. \n\nAnother win to this place is it houses the best upscale Chinese restaurant- Han Dynasty. \n\nThe main downside of the location is traffic and parking.", "author": "Jack P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "Most vendors are opened at 11 (with a few exceptions) so be prepared to come in a little bit later and join the lunch crowd.\n\nGreat selection of vendors to choose from so come here if you are indecisive and can't figure out what you want.\n\nArea is evenly spaced out, but like many others have said, not enough seating since they leave so much open space for people to queue and wait or their food.\n\nCame here for the bagel and coffee, which was the perfect morning pick me up.", "author": "Cam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "I adore food halls and this place has something for everyone. I had paella and it was very tasty, good portion size, and decently priced. Also checked out Ample Hills Creamery and it did not disappoint. My friends got Korean fried chicken and they raved about how good it was. My boyfriend got Loaded Fries from Home Frites and by the time he finished he looked defeated, which for him is a positive. Definitely suggesting this place to friends/family", "author": "Gabrielle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Absolutely love this food hall! It has everything and anything you could possibly imagine. Definitely a great addition to add to Brooklyn where everything is up and coming!\n\nSome of my favorite vendors:\n- Ample Hill Creamery: Try the Ooey Gooey Cake!\n- Daigo Hand Roll Bar: Try the Salmon Avocado Roll\n- Pierogi Boys: Polish dumplings\n\nThere are restrooms, some seating areas and if you time it right, it's not too crowded.", "author": "Christine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "Arepa Lady (5 out of 5 stars)\nThis place by far is my favorite booth. I had the chicharron chocolo and it was soooo delicious. It will never disappointment.\n\nTaco spot (4 out of 5 stars)\nThe mushroom taco is my absolute favorite. The smoked crab was a bit of a disappointment. I think they should put more crab because I couldn't really taste it over the dressing. The Mexican corn was pretty good; can't complain. \n\nAmple Hill Creamery ( 5 out of 5 stars)\nBest creamery in bk, hands down. There's nothing that's need to be said. See for yourself lol \n\nI really like the set up of Dekalb market. I liked the fact that they had a DJ one Saturday morning which was cool. The Trader Joe's location is super clutch.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Fantastic new food hall located in City Point. Although I thought the hall would be bigger, there's a wide selection of different vendors to choose from. My boyfriend and I came around 11:30am on a Saturday (just when kiosks were starting to open) and we were surprised to find it pretty quiet there. It worked out for us because we always found seats and didn't have to wait on any lines anywhere! Within an hour, the place started to fill up, but it was never uncomfortably crowded. Loved that live music started playing as well.\n\nIt was a little annoying that there was no cell service down there so I had to go upstairs every time I needed to text/call friends. Other than that though, it was fun wandering around watching food being prepared and deciding what to eat. Great spot to try different dishes!", "author": "Selena Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "There are wide variety of food options, so even if your family or group have different preference, all would be accommodated.\nClean and nice warm atmosphere.", "author": "Matcha H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "So, a lot of these reviews are for the market hall itself...however, this review is solely based on my experience at Fletcher's BBQ Brooklyn, one of the food venders Dekalb Market has. \n\nIf you're a fan of BBQ, you'll definitely enjoy Fletcher's. I ordered the pulled pork which was tender and juicy. The BBQ sauce is crack! I had my waffles fries smothered in that delicious sauce. The slaw was too vinigery for my taste. \n\nWith that said, this is a place I'll only go to if I feel like splurging. It cost me $17 for a pulled pork sandwich with fries. Very steep prices for the food in this market hall. Thank you gentrification.", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "This food Hall is not good for my wallet. Spacious, cleana and serves overpriced delicious food. Gets really crowded on the weekends. \n\nThe entrance and exits may be kinda confusing. I'd suggest exiting the Willoughby Street end if you are at the DeKalb Ave stop (B,Q). \n\nI've been stopping by every other day and it's awesome because you can actually eat something different every time you visit but you must be willing to shell out $$$. \n\n- Kat'z spot - is prob the busiest spot. It has attracted some touristy madness! \n\n- Definitely stop by Ample Hills. They have a special flavor for the new location with Junior's Cheesecake - perfect for the area. Service was great. Get the Munchies! Worth it every time. \n\n- Pierogi spot is on fleek. I walk by in the mornings sometimes and they actually  make their pierogis  here. So fresh! Now they also have beer and wine. \n\n- the  Noble Tree is pretty slow. \n- Yesss and there's a bagel spot right next to it. The staff at the bagel spot is friendly. No tofu cream cheese tho :((\n\n- You can get an arepa from the Arepa Lady here, at a premium price, but yup this is hella delicious arepa if you are craving one. \n\n-  Pain D'avignon has the best croissants. Hands down. The ham \u0026 gruyere croissant is a must try.  \n\n- Avoid the TJs on the weekends and holidays if you can, and if you can't get there in the AM or right after work. Staff is friendly. Restrooms are suprisingly not filthy. \n\n- The hand rolls at Daigo are stilk my obsession! They really hit the spot. Amazing for a quick bite. The fish is fresh and the nori has a perfect crunch. The yellowtail one is my favorite! \n\n- Still haven't tried Dulcinea. The donuts and churros look scrumptious. The paella place is next to it and it looks delicious! Can't wait to try the burger spot and the bbq spot as well.\n\n- Yasss to eight turn crepe. \n\nLots of food options. \nMostly on the pricey side - for the area - but a much appreciated addition. \n\nCon: Amazing if you are grabbing something to go. Only a handful of the food spots have their own seats. They've added more tables but it gets really crowded to walk through with all the slow and hungry  people trying to decide on what to eat.", "author": "Carina C."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Dekalb Market Hall", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nBasement Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eLPwjFsPI1iKlPUdvGOr4Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}