{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "Came here expecting to get a snack didn't know it was too amazing to just order an appetizer, so we awkwardly sat down knowing we werent staying long lol. Next time well be prepared for a sit down. My short visit was awesome. The menu was organic and healthy and pricey ( which was why we just order a burger and my hubs just ordered fries- we didnt plan for a an actual meal) but for the most part enjoyable.", "author": "Sindy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "I love this place. Went on a Friday late afternoon before it started getting really busy. I made my own burger to go of course and It was amazing. My food didn't take long at all to come and while I waited I had a drink. The food is always awesome here and the staff is very friendly.", "author": "Jana J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "I'm not a big fan of burgers, but this place is delicious.  I had the Big Blue Bacon burger with bison because they ran out of ostrich (how do you run out of ostrich? haha).  The burger was very flavorful and the bison was delicious.  It was my first time trying bison and it wasn't anything weird or strange at all.  It was just a great tasting meat.  \n\nThe waitress was also very nice and helped me out with the unfamiliar meats.  I think I'm due for a return sometime soon and hopefully a taste of that ostrich burger they were out of!", "author": "Maisha K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "This is a place I bring company when they're from out of town. Always very pleased when I either dine in or get seamless from here. Their ingredients really can't be beat in terms of freshness and their milkshakes are amazing. And so is their fancy sodas.", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-26", "description": "Stayed with the basics: Beef (med rare), lettuce, ketchup, onions, pickles, brioche bun, fries. Beef was luke warm and flavorless (as is often the case with grass-fed beef, tho). Pickles were missing. Fries limp and cold. Two burgers and fries came to $23. Not worth it.\n\nMooBurger down the street does a much better overpriced  pretentious burger, but you kind of get what you pay for. To keep it real, go to Two Eight Two on Atlantic two blocks away for an excellent pub burger, or just go to the Shake Shack on Fulton for the best of the best.", "author": "M C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "Tried Barebuger today with mi familia. Meal itself was a winner all around. Keele greeted us and explained the menu since it was our first time there. Wife and daughter create own burgers and I go for Big Blue Bacon Bison Burger with small side sweet potato fries \u0026 onion ring combo. Ladies opt for lemonade big man goes for Vanilla Shake. Burgers cooked perfectly and sides are plenty big even shared onion rings.\nBison is leaner than beef but with bacon and blue cheese crumble tasted great. So far so good.\n\nSince we were celebrating daughters birthday opted for desserts. Like another yelper posted I would come here just for that. Sammie with choc chip cookie and peanut butter ice cream was delish and we shared flourless chocolate cake with cherry compote. I think dessert was even better than the burgers.\n\nBoth waiters that helped us Keele \u0026 Jonathan were nice and attentive. I'm sure we will be back.", "author": "Rich M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-14", "description": "If it weren't for Mooburger, this would be the best burger in the neighborhood.  They're expensive, and don't include fries or anything, but the ingredients are top-quality and the end product is delicious.  The service was a little wobbly - excellent waiter, but everyone else seemed confused and slow.  Considering they JUST opened, this is forgivable and will probably improve.\n\nI'm dinging them 2 stars because their beer menu is idiotic, and in a burger joint, beer is critical.  The selection is uninspired and odd, but the main issue is that they simply provide a list of breweries and the brewers' regions.  They don't actually say WHICH beer from each brewery is on tap, requiring you to ask the server to laboriously go over the whole list.  When pressed, the bartender simply handed over the \"cheat sheet\" provided by management, which had a one-sentence description of each beer with some adjectives and bizarre recommendations (ie, if the double IPA is too hoppy, go with the apricot beer).\n\nTo sum up:  there's really no reason to go to this place over Mooburger, unless you're unwilling to walk a few blocks.", "author": "Daniel O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "***** Note: Below is my original review. A day later I am raising it to four stars because all my friends told me that removing a star for the style of lettuce they use is persnickety. Well, they used other words, but they convinced me I was wrong. The original, persnickety review is below. *****\n \n\nThis is why Yelp simply must allow 1/2 star reviews. Barebuger is better than three stars, but not quite four stars. \n\nI had a basic burger (tomato, lettuce, fried onions, cheese, sauce on a brioche bun), fries and lemonade. The burger was perfectly cooked (medium rare) the bun was the perfect size and density and the toppings (except for one, explanation below) were first rate.\n\nThe fries were excellent: Fresh, crispy and not over-salted. There are salt and pepper grinders on each table, and a nice grainy mustard, as well. All of which I like with my fries. And it was a perfect side portion, as well.\n\nThe lemonade a nice combination of sweet and tart and very refreshing.\n\nThe service, taking into account the crowds, was very good. \n\nSo why only three (3.5 if I could) stars?\n\nThe burgers are a little small for the price. The most very basic burger is $8.45, and almost any burger a New York Burger Eater is going to order will be well above ten bucks. I know that all the meats and toppings are highly curated, and the cows are read to at night and told how special they are before being slaughtered, but another one or one-and-a-half ounces of beef would make the burger better. \n\nSo yea, not accounting for value, they are four stars. But they lost their fourth star for the following reason:\n\nThey use corner deli style shredded lettuce on their burgers, not leaf lettuce. I cannot remember the last time I was served such cafeteria worthy fare at a sit down restaurant, especially one so proud of its ingredients. Yea, yea, it's organic and ethically grown and all, but shredding it ruins it. Period. You lose a star.", "author": "David M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "I've tried to dine here a few times, but it seemed to always be at a time when everybody else is also wanting to test out the newest addition to the nabe.  I just can't justify waiting 30+ min for a burger joint.  Therefore, I figured this past Sunday afternoon around 2 pm would be perfect.  We still waited about 10 min for a table, but we were able to get space at the bar for a drink while we waited.  They serve 25 oz draft beers.  You need to know this.\n\nWhen we sat down, we had to wait about 5 min before our server came over to take our order.  No explanation of the menu or recommendations on whether we needed more than one order of fries to accompany our meal.  Normally, I wouldn't expect this but both newly seated tables next to us received this sort of treatment, so I was a bit perplexed.\n\nAnyways, since it was a Sunday afternoon and I was trying to be all healthy I ordered the large Asian salad.  It was delicious!  It was broccoli slaw, watercrest, cucumbers and these crispy edamame pods.  I couldn't get enough of it, and I really don't say that about salads much.  \n\nWe also ordered 1/2 rings  + 1/2 fries as a side order but we received a fully order of fries.  Frankly, I didn't want the rings (the fiancee wanted them), so I didn't say anything.  The fries were banging delicious.  Crispy, piping hot, soft on the inside.  The dipping sauces were ok.  Only one of them really stood out to me, but I can't remember which.  It wasn't the curried ketchup.  That was too sweet for me.  \n\nAnyways, my fiancee had the habanero express.  He thought it was very good and finished every last bite.\n\nEnd of the day, I would definitely come back.  Also, there were a lot of kids there.  Not a bad thing, just something I noticed.  Also, they serve breakfast type items until 2 pm on the weekends.  The menu looked pretty awesome.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "I have been there twice. Last weekend for brunch and I had the chicken and waffles. Tonight I had the Hass Avacado Bacon sand which. Both were very great. Service definitely made the experience. Food was tasty flavorful and I will be going back", "author": "Meme B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "This is a great place or rather small scale chain to go to for unique tasty burgers. I am veggie and I am thrilled to find a place near my neighborhood and one that delivers! that offer gourmet Veggie burgers.  My favorite is the Build your Own burger which has many vegetarian options. ( black bean burger or mushroom burger).\n  My meat eating husband enjoyed the regular burger with many toppings. The topping are perhaps part of the  key to their success, as there are so many choices and they are all delicious.  Love the fries and the sweet potato croquettes as well.   I can only speak for the Cobble Hill location not the ones in Manhattan.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "I've been here twice and both times I was very happy with my food.\nI wanted to hate it...it feels like they tried to dress up a chain restaurant for the neighborhood. The staff is friendly and efficient but it also feels they came from TGI Fridays...but I will go back for the burger!", "author": "Eric W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "My friend and I had dinner here about 6:30 on a Tuesday night. We had our pick of seats (both inside and outside) but the place filled up pretty quickly after that. We sat outside on the side walk to enjoy the beautiful summer night. The service was good, the food was good...all around solid meal, but I am just not giving it 5-stars because I don't think anything was life-changingly amazing\n\nSome of the highlights:\n~onion rings--definitely the best I've ever had!\n~we got the onion/fry basket and it came with FOUR different types of dipping sauces. All delicious. We had to experiment a little bit though, it would have been nice if the server had explained what each one was.\n~I had the Mauie Wowie burger, with the recommended \"wild boar burger\" and it was fabulous. It comes with turkey bacon, which I think is gross, so in retrospect I should have probably had them hold that or switch for the real stuff\n~all of their meats are from hippie-friendly, pasture-raised, etc. etc. animals, so I think that makes it worth the slightly high price for their burgers", "author": "Annie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-14", "description": "They have a lot to figure out still. Ordered wine. Arrived in filthy glass. Sent back, changed for beer. Arrived in chipped glass. Sauerkraut, flavorless. Servers, overwhelmed and sweaty. Portions, good. \n\nTry Mooburger down the road for now.", "author": "Leigh M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-04", "description": "The service, the burger , The place it self is amazing to be on court in pacific.  Back in the days this area was a bad area think god for change.", "author": "Stan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "Everything was great! \nBurger,  staff etc. \nJust one comment\nPlease get rid of the TV. \nWhy do people need to watch cartoons while they're eating?", "author": "Reid V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-29", "description": "Came here for a quick burger with my boyfriend. Overall, we weren't very impressed. The burgers were expensive, there are so many options that you're not sure what to pick, and the flavors may be a hit or miss.\n\nI ordered the Smokehouse portobello with bison on a multigrain roll and my boyfriend ordered the Maui Wowie. Both were just okay. For the price, all you get is the burger.\nWe also ordered a side of fries and onion rings with sauces. Fries were plain but sauces made it a bit better. Onion rings were pretty good.\n\nOverall an A-OK place. Would come again but not something I'd rave about.", "author": "Siv L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-08", "description": "BURGERS BURGERS \u0026 ONION RINGS!!!!\n\nI Loved this place good service great food and nice decor all around", "author": "George J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-11", "description": "I just left this place from having brunch.\n\nThe decor and the hostess were great! She was cheerful and quick! \n\nfrom the Cubby Breakfast, I ordered 2 scrambled eggs with bacon which also came with 8 grain toast, parsley sweet potato fries, a mini fruit cup, and apple juice. The portions were more than enough and everything was delicious. The apple juice was fresh.\n\nMy only complaint would be the service. Our waiter was nice but forgot a few items that my guest requested. He also only checked on us once. I think he may be new - not that I've been here before - so we didn't cause a fuss at all.\n\nOverall I will definitely be back!!!", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-04", "description": "1st time when I try it was amazing. Loved the food. This time around I was really upset. I order online for several reasons. So there is no miscommunication. Of course I get my order. It wasn't what I asked for. I wanted a well done California burger and got a medium rare. I order a side order of sweet potatoes and got it inside my daughter's kids meal. Seriously?! And charge for the sweet potatoes. When  it was just mixed with my daughter fries and burger. Anyways definitely not ordering from this place again. Will go to another bareburger.", "author": "Xiomara I."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}