{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "This place really needs to take cleanliness  a lot more seriously. There were piles of dirty plates and cups strewn atop the bar counter and the guy behind the bar looked like he was overwhelmed. Like seriously all of those dirty dishes and cups looked utterly disgusting. That just turned me off. I would not come back until they take cleanliness more seriously.", "author": "Derrick A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "Meh, I don't get the hype. I got a beef burger medium rare and it was dried out and tasteless. There was no juice in the meat, it looked like it had been frozen and defrosted. The sweet potato fries were ok, and the sauces were not as special as their names would imply. I had better luck with the honey chicken sandwich a few years back. Moo Burger has tastier, proper burgers and accoutrement (try the strawberry milkshake! Sometimes I get 2 they're so good!)", "author": "Kay T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-12", "description": "Visited this place during my solo trip this summer several times, and in October with my son. Loved the different kind of burgers, especially the vegan ones. What brings this place down, is the staff. Some are attentive, but most of them are not. That unpredictability is a negative factor for me, but as I said, tasty burgers.", "author": "Astrid H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "You can't really go wrong with Bareburger, at least not this one on Court street, which I've been to several times. Bareburger is just fun. But also tasty and customizable. For example, you can build your own burger, choosing from a wide variety of buns, patties (what's your pleasure? Beef? Chicken? Elk? Bison? Etc...), toppings and sauces. Then there are plenty of pre-designed burgers to choose from, all delicious , from my experience. The prices of the burgers vary of course, between $8.90 and close to $14, depending on what's on it. But even the least expensive ones have much to offer. There are also yummy side options, like sweet potato fries and slaw, to name a couple I've tried myself. \nOne of the best things about this place is that there's something for pretty much everyone, whether you're a meat-eater, a vegetarian, vegan, or have food allergies. The menu is super helpful and informative, and the ingredients are high quality. \nI can't end this review without strongly encouraging you to try the hot honey milkshake. No, it's not a WARM honey shake (how would that even work?), it's actually a spicy honey milkshake. It sounds weird and dangerous, but actually it's the best thing ever.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "El Matador rocked my world, I am pregnant and I feel good about feeding my baby these burgers!!!! \nNow, their fries and onion rings were out of this world amazing, especially fries and the sauces that came with it. \n\nMNYA!", "author": "Nana K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-16", "description": "Decent burger... but the menu is way too tedious to dissect for food that's anything but spectacular. Oh my bad ... its organic! Doesn't mean flavor should be excluded from the main ingredient. Guess that explains the variety of sauces offered ...", "author": "Corey B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-18", "description": "Unimpressive, I have been here twice and both times I felt my burger was just overpriced and left me wanting something else. The sour kraut was plain bad which is weird cause it's not hard to make fresh and they most likely buy it. I would skip this place there are much better options in the area.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "Elk burger with duck bacon, pepper jack cheese and habanero mayo.... Best burger I've had in NYC since moving here in 1997. The root beer is also the only root beer I'll entertain. Not a fan of their lemonade (too thin and sour) and they grind their salt and pepper too finely-- but overall a very pleasant place for a wide variety of burgers and accessories. \n\n2018-11-05 Update:\n\nThey have really changed the menu for the worse removing all red meat except beef. No elk, no duck bacon, no bison or boar anymore. Most burgers are now frankenfoods from labs (albeit organic vegetarian options that are probably quite healthy). It's gotten a little too \"crunchy\" lately and I do miss the elk option more than anything else.\n\nRecommended, esp if you want a burger made out of non-burger plant matter.", "author": "Douglas P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-10", "description": "Ugh.. you guys brought back the fried pickles and I was so excited!! and then you took them away and I feel betrayed. What the heck?", "author": "Alison B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-30", "description": "I ordered my Burger meal like I do every other pay day Friday.   The person prepared my meal incorrectly.  \n\nI immediately contacted management they took too long to offer me a solution.  My lunch break was over and Bareburger management Gersha didn't seem to care about my complaint and the employees made me feel like I had no right to complaint.  I only get 30 minutes for lunch!  I wasted $14.00.  I ordered my burger with sauce on the side and sauce was not provided to me.  I took 2 bites out of a VERY DRY BAREBURGER!!!  AWFUL!!!   I can buy cheaper organic burger across the street.  Brooklyn Heights has other better organic burger establishments.   Go elsewhere!\n\nI sent an email to corporate and after 1 full week I still have not heard a response back.", "author": "Lynn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Good delivery time. Less than 30 mins. I had the fire quacker burger sweet potatoes fries and shake. Not bad I'll def order again.", "author": "Slim B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "Great for both carnivores and vegans. The only things they lack are vegan cheeses and vegan condiments like veganaise", "author": "Santiago M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-07", "description": "Other Bareburger locations are great, but for some reason, this location cannot get their shizz together. I've ordered from the Manhattan locations many times with perfect results, but 3 out of 3 orders at this Court St location they've completely botched my order. This latest time, my burger arrived without a bun. Kind of an important detail. Now whenever I order from here, I'm just waiting and wondering what mistake they'll make this time.\n\nLOL they just sent a replacement burger, this time with a bun, but forgot the toppings.  That's 4 for 4 now. I can't even.", "author": "Amanda F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "My boyfriend and I consider this our go-to restaurant. It's reasonably priced for such high-quality, delicious food.", "author": "Holly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "My favorite burger place in NYC (besides P.J. Clarke's!). Always great service, great food. Decent prices for the excellent quality. Wine is good,too!\n\nThe East Village one is fun, too.", "author": "Heather H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "Been here before and still going through their menu, but I keep coming back for the Bacon Blue Burger. It all taste good to me", "author": "Michael D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "Organic burgers?! Don't mind if I do! Exotic meats like elk and bison? Yes please! \n\nThe supreme burger was gigando, so big you can't even bite into it, this is the kind of burger where you need a knife and fork. Serious business yo. Their sweet potato and onion ring combo's not bad, you get a decent portion. Everything tastes fresh and homemade. Definitely recommend sharing because their portions are big especially the burgers. \n\nAnother note, the burgers taste healthier here ( they're not as greasy or juicy like most places) so they aren't sinful at all. \n\nWorth checking out. \n\nBy the way, elk tastes like beef.", "author": "Virginia Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "First time eater and I loved it. Great customer service and even better food. \n\nA bit pricy to what I would normally pay for a burger but it's well worth it. \n\nHad the elk burger and it's not intensely filling but has rich flavors that compliment well with one another.", "author": "Rashid K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "Food 5/5\nMy boyfriend and I placed an order for pick up, though we would've definitely loved to have sat in and ate but we had bikes strapped to the car and wasn't comfortable leaving it out of our eyes sight. We ordered a Blue Elk (mine) and a Fire Quaker (his) along with a basket of Sweet Potato Fries and a Chocolate Milkshake. Both of our burgers were amazing, cooked medium, flavorful and juicy. Blue Elk was elk based protein while the Fire Quaker was duck based protein. Sweet Potato Fries were nice and crisp, not oily at all which is an extra plus in my book! The two sauces they gave us was I am guessing, homemade (?) Ranch and their Special Sauce, which were both great. The Chocolate Milkshake was a little thick for our liking but it was a HOT day, so it worked out. There were actual chocolate chunks at the bottom ;O that made it extra yummy and chocolatey. \n\nThe pick up time was actually pretty quick, to my surprise. We placed an order around 4PM and they said it'll be ready within 10-15 minutes. I went in at 4:10PM and it was already ready on the counter waiting to be picked up. I realized there weren't that many people in there which is probably why it was ready so quickly, haha.\n\nOnly downside where I took a star off was because of their price. It's a little pricey for the food that they're selling, albeit it is unique protein. The whole total of the meal was $41..", "author": "Jamie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-30", "description": "Food is good for a farm to table burger joint. However, the way they handled a piece of wax paper in my food could have been better.  Unfortunately, I realized near the ending of my burger there was a clump of wax paper in my food. For all I know I could have been eating that the whole time.\n\nNo credit on the bill. Just a measly apology.", "author": "Ashley S."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}