{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "Bareburger is a really nice addition to the neighborhood.  In fact, it seems like NYC is having some sort of burger renaissance with Shake Shack etc.  Bareburger is different from your typical upscale burger place in that everything is organic and they have a wide variety of meat and veggie types (fried chicken, jerk chicken, beef, turkey etc) and buns (brioche, lettuce bread, multigrain etc) that you can mix and match at your crazy will.  Oh yes, I must say get the jar of pickles if you even sort of like pickles.  You will not be disappointed.  Nice beer list too.\n\nThe fries and onion rings are near perfect and will bust any diet that I'm on.  What I really like is the outdoor seating in the summer and I wish every place in the area would have outdoor seating.\n\nMy one complaint is that the service can be spotty at times.  It is friendly enough, but I think when they get busy things can break down.  It has been getting MUCH better lately though, so I'm sure that this will not be an issue for them going forward.", "author": "Russ K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-08", "description": "Bareburger, that Astoria restaurant that exploded to the rest of NYC in what seemed like a matter of years.  If you've never been here you should come here because in my opinion they make the best burgers I've ever had.  The draw for me is their good selection of game meat which warms my midwestern heart.  For all the hippies, it's all organic so I'm sure you'll poop rainbows after your meal here.  Their burgers are huge, they're all tasty, and oh....don't skip on those onion rings.  For real, those things are awesome.  I've never been a big fan of their fries since they don't come out as crispy as I would like so I would recommend skipping them.  I wish Bareburger would deliver to the Brooklyn Navy Yard but it's not too bad for me to get there myself since it only takes 15 minutes one way.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "I understand that many people I speak to say Bareburger isn't nearly the best burger in NYC. This may well be true, but what they may lack in terms of burger quality they make up for in terms of options, and in sides and salads. Every salad I've had with my burger has been excellent, and the various burger options are very good. Also, the chick'n'pickle sandwich is very good. You can do just as well or better with 282 Burger or Moo Burger just a couple of blocks away, but if you want more options, Bareburger is great.", "author": "David P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "My new favorite spot. I recommend the Blueberry Soda and try the Panko Breaded Chicken Tenders :-). The service is great too.", "author": "Chyna H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "This place is awesome!!! The food is all natural/organic and tastes so fresh. The last time I was there I ate off of their brunch menu and it was amazing. Best iced coffee I ever had. I am definitely a repeat customer.", "author": "Karena B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "Had the Habenero Express \u0026 it was delishhhh! A real burger with real toppings. Love the fact it's all organic \u0026 very affordable--makes me wonder why so many others overcharge. Will certainly return! Biggest complaint: I ordered take out \u0026 they didn't give me straws for my drinks. Wahhh. Didn't affect my review though", "author": "Lindsay R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "Bison burgers are wonderful. Their fries were so freakin' good, especially with the dip with the mayo, ughhh I gotta figure out what that was. The curry dip was an ehhhhhhpfft for fries so we asked for something else and the friendly waiter gave us his favorite dip. I can't believe I forgot but it was so good. The bison though and the duck bacon, my goodness. I want to eat here every day. Sitting outside was lovely too, but looking inside, their setup on the corner is nicely planned out-airy and provides a decent amount of seating. Can't wait to eat here again. My best friend and I loved this place. Pricing was decent and with the quality of food received, all is well.", "author": "Iole Marie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-22", "description": "I've been to this place more than twice (i would forget to check in most of those times). i happen to find myself here on weekends. actually, if you're an immigrant like myself or someone who is a foreigner who's wanting to get exposed to something particularly American in the Brooklyn context of things, come here. it looks like an updated version of those food places you'd see in movies that don't show New York City at all. the place reminds me of expensive food places i've been to somewhere in the West Coast, in Washington, DC, in Philadelphia---it's really very American (I'm not even claiming here I'm American, OK? I'm just saying I've been here in the USA for so long such that I've seen things that commonly occur here, which are all different from all other places I've been to). The burgers I've had have been consistently good. I just remember one time I once almost burned my lips from putting into my mouth right away one of those onion rings that came with my burger (I re-learned to take it easy when I'm having a meal outside of the house LOL). Careful, those onion rings are served very hot! Also, this is one of those places where it's cute to have small children around, and other customers won't behave as if something extraordinary is happening. And yes, it's pricey. But just the same, the pricy-ness comes with very attentive, quick, non-intrusive service, which makes the total experience nice and memorable to people, like myself, who are basically so easy to please (as long as the people who serve go out of their way to smile authentically, even if they're really tired from doing their work).", "author": "Jerome Espinosa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "Server recommended the duck patty and it was excellent. There are a lot of combinations to try. If I lived around here I would be here all of the time. The options are great here. Definitely would recommend to somebody who likes burgers. Thank you for the great service!!", "author": "Robert R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-20", "description": "Friendly, efficient, attentive service. The salad came in a great big enameled bowl and was well dressed and full of good things. An excellent tender flavorful burger too, on an equally tender brioche.", "author": "jg k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "I was hungry and I remembered I enjoyed the food the last time I was at one of these in Manhattan on the upper east side and wanted it delivered so tried this place on Seamless since I had a 15% off promo code. I ordered a turkey burger on a Brioche Bun , country Bacon, and raw onions. Also ordered French fries since I needed to spend $15 to get it delivered. They delivered it in around 40 minutes and the food was fantastic. The bun wasn't soggy and the meat was cooked just right. Wasn't burnt or anything. The French fries were also really good as well. My only complaints is the price and the ketchup that they sent with my fries but I just simply used my own but if I ate it there no ketchup wouldn't be an issue with these fries. As far as price goes before adding the tip and delivery charge it was around $15 for just a burger and fries with no drink. A bit pricy but for the price you get a really great tasting burger and some good French fries to go along with it.\n\nI pass this place quite a lot but it's always been very busy so I never bothered to check it out but I want to try this place in the restaurant and try out some of their other meats. It's also very nice that they sell it organic as well which could be a factor into the prices", "author": "Benjamin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Had the Maui Waui burger with wild boar and grilled pineapple...unbelievable! Great ingredients! \nStaff was friendly. The person whom I'm assuming was the owner/manager stopped by our table several times to see how our food was. Highly recommend this place.", "author": "Jaret C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-25", "description": "If it was possible to give 0 stars, I would. But alas .... After a stressful week, no time, all say, to eat, and a wicked migraine, I ordered delivery this evening. After an hour and a half, I had heard nothing, so called Bareburger. I was told that they are having a website glitch, and didn't know if my order had been impacted. They said they'd investigate and call back me \"immediately.\" 15 minutes later, I'd still heard nothing. I WALKED/stumbled to Bareburger (migraine), and told the folks at the counter my issue. They said they would see what was going on. TEN MINUTES LATER, they told me they'd refund the cost of my order and get it to me in a \"few minutes.\" After pushing and pressing for a definition of a \"few minutes,\" I was told that my food had JUST been placed on the grill. I left with nothing. To paraphrase Winston Churchill - never never never never again.", "author": "Paulette G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "I LOVE this place!  Ate here about 2 weeks ago and the waitstaff was amazing!  Had my 2 small kids with me and made sure they brought out their food first, since kids can get antsy!  \n\nHad food delivered tonight and was expecting the normal hour wait for it to arrive and it was at my door within 30 minutes!  \n\nIt doesn't get any better than this!  Keep up the good work!!!", "author": "Jillian K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-22", "description": "Not a great dining experience. The food was great but the service sucked!! The food took a long time to come and the waitress seemed annoyed with our questions. She reacted as though we were taking up her sweet time by making inquiries. I passively apologized, but rather than the stock, \"that's okay\" r \"Don't worry about it\", she just stared me down...wtf???. Then a different waitress brought the drinks, and a separate one brought the food. and yet a separate person stopped by to inquire how we were doing. ???? All throughout the waitress was serving the other customers, totally confusing. The most curious part was when on her way to the front of the restaurant, SHE WALKED BY AND DUMPED A WAD OF NAPKINS ON THE TABLE WITHOUT SAYING ANYTHING OR ACKNOWLEDGING US THERE EATING, and just kept walking (we didn't even ask for napkins) wtf? Better service in McDonald's!!!!", "author": "Orin A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-15", "description": "I like their burgers, but take out is not the way too go. Take out was great when it first opened, but now the wait is too long--65-70 minutes. I wouldn't mind if the food came hot and fresh, but it's warm at best and sometimes cold. Cheese isn't melted anymore. Too bad. We used to order in from them a lot.", "author": "Lee W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "The veggie burgers are are a great vegan option (they have a quinoia/veggie and black bean option) but can be inconsistent. Sometimes they are firm, sometimes they are soft. \nThe sides are good but can add up and make a basic meal expensive.\nThe kids meals are a good value and are always a hit.", "author": "Elyssa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-27", "description": "It's 10:53 on a Sat night and they have stopped table service...take out only. Everything is meh about this place, from the service to the food. The one in Astoria is noticeably better.", "author": "Cenk S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-27", "description": "Great place! Burgers of all kinds and to top it off all meats/proteins are grass fed.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-19", "description": "I called to place an order for pick up and asked the guy who answered the phone what the most popular burger was...not a crazy question. He told me to go online and look at the menu and that it was too early for him to tell me what was popular. Rude and made no sense. My suggestion would be to get a new person to answer the phone.", "author": "Melissa T."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}