{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "Big Bleu, Bacon Burger!!! I need to tell you first that this needs to be had with lamb meat. The Bacon was cut thick and and cooked perfectly, the bleu cheese was not overwhelming and the lamb was just mouthwatering. I also had a 12 oz. milk shake with banana and I wash I had ordered the 16 oz. I can't wait to order again from here. \n\nalso we ordered through Seamless and it came in less time than we expected.", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-15", "description": "I got violently ill from this place. I have never been so sick in my life. I was so intensely poisoned by their food that my body wouldn't stop rejecting it until every last seed from the hamburger bun was out of my system. #neveragain.", "author": "D M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "Burrata caprese was awesome. Totally weird that I have been looking for a good one in NYC all summer and this is by far the best one I found. Creamy, perfectly ripe heirloom tomatoes.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "My friend put me onto this place while I was visiting her in Brooklyn last weekend. As a health-conscious lady who still likes eating non-boring food, Bareburger pretty much nailed it for me. For carnivores, they have every kind of meat you can think of - cow, bison, boar, poultry - all grass-fed, humanly raised, and antibiotic-free. And unlike other restaurants offering veggie options that are just as caloric and artery-clogging as their meaty counterparts, Bareburger actually has real, healthy dishes you can enjoy without feeling guilty and/or sick. Case in point: the Farmstead - a sweet potato n' wild rice patty topped with tomatoes, green hummus, baby kale, and avocado basil dressing. You can get it on a regular bun or a collard green wrap. I opted for the wrap, and damnit, it was delicious. I also grabbed one of their natural diet colas, free of man-made lab sugar. The service was beyond friendly, timely, and the price point was as expected. The Court Street location in particular was popping on a beautiful Saturday afternoon, so I assume it does get a bit busy. That being said, it's probably a more sociable spot than anything else. I wish Bareburger would come to Boston!", "author": "Jane D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-27", "description": "Worst delivery... always wrong and takes at least an hour. \n\nIf you dont mind spending $40 on 2 casual dining burger meals- it's not too bad. The burgers are pretty good and they have awesome dipping sauces. Good sweet potato tos with cheese and pickles", "author": "Bethany W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "My girlfriend and I always get hungry after grocery shopping. So after leaving Trader Joes on court st we decided to go into the BareBurger across the street. The service was delightful as we were seated as soon as we walked in. Our server Dave was extremely friendly as he helped with my decision between two burgers. I ended up going with the blue elk which is becoming my personal favorite. I will definitely be returning to try other burgers.", "author": "Dwayne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Just tried Bareburger.  I had the Bison burger. It was very flavorful and Taste really great. The spot was very crowed and loud. There were limited seating and very noisy. Fast service and nice and friendly staff. No parking. This place is good for lunch.", "author": "Fabolous D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "I love Bareburger. The portabello mushroom option with quinoa patty is my favorite vegan option. Savory, juicy, and feels good to chew one. The fries and onion rings combo with the different sauces is also another favorite. I really like the curry ketchup.\nThis restaurant seems spacious and I like the decor. It has a nice cozy feeling.\n\nFor non-vegan burgers, I think the roadhouse is the best option.", "author": "Danny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-04", "description": "I'll just start this review by saying I'd much rather go to Mooburger. \n\nSomething on my Western burger smelled like a preserved fetal pig that I dissected once upon a time, I think it was the red slaw. I had to pull all of it off. The vanilla milkshake was awesome flavor-wise, but not very smooth, there were ice chips floating around. Again- would rather go to Mooburger and get a Blue Marble shake.\n\nThe cornmeal coated pickles that came with my Western burger were soggy and cold (my boyfriend picked up the order and we live about a block away, soo... don't know why that happened). The onion rings were okay, I didn't care for the super course coating they use. Was that the cornmeal stuff again? The fries were good. Sauces were sub-par, but I get grumpy when a place doesn't offer honey mustard as a safety back-up. We tried all four of the sauces that come with the fries/onion ring combo and not one of them I enjoyed. Glad we didn't request any extra sauce, it would have been a waste of $0.55. \n\nThe burger was good. My boyfriend liked his Roadhouse burger a lot, but he's easy to please when it comes to burgers. I'm just glad he picked up the $50 tab because I did not find this meal to be worth the money.", "author": "Keely C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "Their burgers are filling and the Canadian bacon is a bonus along with the onion rings. Speaking of the onion rings they are the bomb!", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "Someone recommended this place to me so I decided next time I go to Traders joes which is right across the street and try a burger.  I don't eat beef so I was very happy to know bareburger has many options.  For the first time I tried lamb burger and I was able to customize it to my liking which I was very happy about. The lamb burger was so delicious and the waiter we had was very knowledgable about the menu.  He answered and recommended things on the menu very confidently and I really appreciated that. Overall, I loved this place and I will be back again.", "author": "Khadine B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-03", "description": "Bareburger has officially become a chain restaurant, which means low-quality, haphazardly made burgers for over $12. Fries aren't included, either. Zero passion for creating good burgers in this kitchen. \n\nThe last time I went to a Bareburger was a number of years ago, at their Chelsea location. I had found it to be good, but nothing special considering the other options in the city. You could tell they try to lure in customers with their variety of french fry dipping sauces (a classic move). \n\nFlash forward to 2015 and I find myself here again; but this time it sucked. It was a lot worse. The burgers, especially the elk, were all bland and dry. All three of our orders were missing something on it, be it sauce or condiments. Bringing out multiple wrong orders in a less than half-full restaurant is not acceptable in my book. \n\nToo many better options for better burgers in Brooklyn.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "Burgers are great, from cow to turkey, and everything in between... And the drink-drinks are solid too. Really great for lunch, and kid crazy for dinner (which is good for us and our 5yo and 2yo). It's a little tight -- tables are close together, and you're gonna hear whomever is next to you and be heard... but that's city livin'! Oh -- service has always been very good; they're as fast or as slow as you want them to be.", "author": "Phil H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-18", "description": "Not sure this chain deserves the love that it often gets. Yes it's all locally grown blah blah blah.The burgers and fries are averagely good at above average prices. When building your own burger you easily get into the $15+ prices. I do like the location and convenience of the restaurant itself. It's pretty kid friendly and they usually have stroller space. Somehow they manage to be busy any time of day including weekdays around lunchtime. I guess everyone else discovered the ease and convenience too.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Good food all around with great options for those who want something other than burgers, nice kids menu, plus an interesting beer selection. Trustworthy spot for when you're with a group of folks which includes omnivores and vegetarians. The burgers, salads and fries (regular or sweet potatoes) have all been solid. Slightly pricey, but reasonable. Don't forget to check out their beer list.\n\nOne thing to note: there is only one bathroom stall for everyone so the line can get long. If possible, go to the bathroom beforehand (there is a reasonably clean one at Barnes and Nobles on Court St.).", "author": "Kit K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Best burgers I ever had! The service was quick , the burger fills you up fast! Recommend everyone here!", "author": "Amaya E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "I try and avoid meat and I must say this location has the best veggie burger hands down. Wait staff is always willing to help and make recommendations. Great fries and onion rings. Tons of different sauces to choose from. Even if you don't eat meat still a good choice", "author": "Ann C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "I love coming here for a healthy burger but I had a bad experience today. The hostess was so rude. I got up to use the restroom and she practically mowed me down walking past me. Also, both my husband and I tried to wish her a good day and she straight ignored us. She had an angry look on her face the whole time. Bareburger please re-evaluate who you have representing the face of your restaurant. I used to be a hostess myself and there is absolutely no excuse for this behaviour. If you have a bad day, you do not take it out on your consumers. You treat them with the utmost grace no matter what.", "author": "Eunice F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "I've been to a handful of Bareburgers, including one at a music festival, and this one is the best. \n\nIt's the most spacious, has the most attentive staff, and has the liquor menu the others are missing. The location helps all those details along, too -- urrbody know DT BK is where it's at.\n\nA strange note about Bareburger's lettuce beds in general: Bareburger, why the bleep do you put the lettuce on TOP of the burger? When you serve it, it looks like you're giving me a plate of lettuce. It's embarrassing. Just because I order lettuce doesn't mean dat beautiful, luscious burger shouldn't show ;)))", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "Really great consistent burgers. While you wont find brie, kimchi or fresh jalapenos on the menu, the burgers are well made, on toasted buns, with really great fries (not included).  8 draft craft beers and limited other options.  The shakes are great and ill definitely be back for more.\n\nUpdate: The last veggie burger I had was deep fried. Lowering the rating to a 4.", "author": "Kelly P."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}