{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-11", "description": "I have only been once so far but will be back. Nice friendly service, good food, fast service, clean and very accommodating. Good food for decent price which is expected for quality food. \nMilk shakes are great and signature burger was tasteful. Server who help me (Guersha) was wonderful. Nice smile and courteous. \nTip her well, she's worth it. -Thank you. \n-Strawberry shake \n-Standard burger \n\n4/11/19 Update: \nI stopped going because service for takeout was horribly slow and inattentive. Staff was too busy grab assing and goofing off. BUT.....\nWent today. Much faster! Still room for improvement but not bad so I will see as Spring/Summer continues. Good is good...consistency.", "author": "Mark D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-21", "description": "Ok. Tasted ok but my burger was not medium and I got wrong side order.  Had live music which was a shock and nice touch.  A good number of people there.\n\nUntappd venue !  Had a decent beer selection and other cocktails.", "author": "Kyle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-19", "description": "Made a quick stop here for some food with the Wife in the afternoon on a Monday. Seated quickly and began perusing the menu. Our server was attentive and I knew he was busy but he was patient with us when we still didn't know what to order. My wife and I were trying to avoid certain food so we went with a Hudson salad and a chicken bites share.\n\nIt came fairly quick and we devoured it. But I was still starving so I went with a beef burger. I made my own concoction and it came pretty swift as well. \n\nAll in all, It was a good experience, received some good energy from our server which helped the time spent there. This location has been my favorite of the 3 (or is it 4...) Bareburgers that I've been to in the city. I will return.", "author": "Kyle N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-20", "description": "This is probably the worse burger I ate, not to mention they brought wrong side. The service was mediocre. Was waiting 20 mins for waiter to take our order, then 20 mins to bring out our drinks.", "author": "Gregoriy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "Love the mood of this place for a nice visit with friends or family.\nVery attentive servers and the burgers are always amazing!", "author": "Alexander T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "My family is visiting from Seattle and my brother craved a burger so this was the nearest one to where we were staying.  Unfortunately, we came at a time where they were only serving brunch.  They only had 2 burger options (1 regular and 1 veg version).  However, they had sandwich options as well as pancakes and waffles.  \n\nI would recommend their waffles! They are gluten free - no one in my family is gluten free but i promise you, they will not disappoint.  They give you 5 little waffle rounds and they are soft and moist.  Normally, I am a crispy waffle kind of a person but I couldn't stop eating these! \n\nService was good - the waiters were very informative and we also got complimentary donut bites when we got seated.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Second times a charm ? or maybe just the breakfast is where it's at. I came here a couple years ago for lunch and unfortunately I did not enjoy it. I got the burger wrapped in collard greens but the collard greens weren't tender enough.\n\nOn to my most recent experience ! My friend and I came here Saturday for breakfast, we were seated immediately as the restaurant was pretty empty. Right away we were bought waters and some small donuts that tasted similar to churros. We ordered the waffles and chicken with the sweet sauce and the wham bam sauce (I hope that's what it was called). The waffles and chicken were small not what I was expecting exactly but it was very filling. The wham bam sauce is amazing ! It has a nice spice to it. I didn't try the sweet sauce but my friend did say it was good it tasted like syrup on the chicken lol. All in all if I'm in the area and need breakfast I'll definitely come here.", "author": "Andria A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-28", "description": "Have you been to a Bareburger before? This one has the same ethos as all the others around NYC:\n\nThey are all about sustainable and properly sourced product on their menu. It's definitely a burger joint. Classic beef, healthier bison/turkey, meatless sweet potato/black bean/beyond/impossible...whatever burger you want, they've got one that fits the bill. If your wife is more of a chicken tender kind of person, they've got those too. \n\nThis location stands out on a couple things:\n\n1. They've got my man Falcon bringing great beers.\n2. The sidewalk seating is excellent; it's one of the only spots on Court that is on the east side of the street (but not a backyard), so in the warmer months you're usually in the sunshine. \n\nThe only major knocks are:\n\n1. They close at 9 pm for some reason.\n2. Inconsistency. Burgers can sometimes be underseasoned or overcooked, which is a bummer when all you wanted was a burger.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-29", "description": "Tried to come in at 8:20, they said they were closed. I pointed to the hours on their door that said they were open until 9 and they said \"oh we closed early because of the rain\". haha are you serious? I felt like I was in the chappelle's show PopCopy sketch where they just attempt to keep customers out the whole time", "author": "Sean S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-07", "description": "I went to bareburger a few nights ago. While I enjoyed my meal very much, I was very disappointed to see a server using disposable wipes to wipe down tables. For a chain that calls itself sustainable, how could this be happening? I thought about how many wipes they must go through in a day, and then thinking about the whole chain...that's a mountain of wipes produced daily that is totally unnecessary and unacceptable. Why not use towels and a sani bucket like most restaurants? I feel this disposable wipes usage is in direct conflict with their message, and made me wonder what other unsustainable practices must be going on behind the scenes. Our planet is in crisis right now. There is no excuse for blatant excessive wastefulness. Especially if you want to call yourself a sustainable business.", "author": "Shale M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-23", "description": "I came here on a Sunday afternoon. Both my friend and I were really hungry and this looked like a great place to try. Both of our orders were incorrect and the waiter took extremely long to complete and of our requests. It wasn't that busy.", "author": "Ali F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "The service was absolutely fantastic!  Brendan M was my server and he was the sweetest and everything was fast and exactly the way I wanted it. The milkshakes are to die for and of course, the burgers. Thank you for the wonderful experience. I was having a rough day and this really turned it around.", "author": "Ace G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "Brandon was amazing! I love the impossible burger here everyone is super accommodating and the service is fast. Miguel was also very helpful!", "author": "Bella M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-14", "description": "My favorite restaurant. The food is awesome and service is great (Brendan rocks!). My only ask is that they bring back the avocado basil dressing. That's the one thing from making this a 5-star review.", "author": "Tamara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "I frequent bareburger, and I love it every time. I just wanted to comment on this particular experience because though service there is always awesome no matter how much of a rush there is, my most recent visit was exceptional. \n\nBrendan was funny, thoughtful, responsive, and made my night. His advice to try the beyond burger was perfect (and so was the beyond burger, tbh) and he just brought a new energy for me to a place that I go often because I know it's good. \n\nI love this restaurant for the quality of food and service all the time, and that being said, this is my first review of it because of a person who worked there. As good as the place is, it is Brendan who inspired me to shine the little light I can on Bareburger with this review. Keep doing what you do! You're amazing!", "author": "Nerissa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-29", "description": "Who stops delivering at 8pm? This is NYC, not Soviet Russia.\n\nIf that's not enough, they also charge a $5 delivery fee?! What country do you think you're in? Soviet Russia? See above comment. \n\nGreat burgers, lame ass delivery comrades.", "author": "Brendan N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-05", "description": "Save yourself the disgusting food and go elsewhere. \n\nWe order delivery from here often but there is always something wrong (ie. missing ingredients/items and the milkshake is always in a different size cup).\n\nI decided to go in person for lunch today and ordered the Guapo salad with buttermilk fried chicken. Service was slow to get my table set and a menu. Then after ordering my food it arrived in minutes. Upon further inspection my salad greens were soggy and gross, it was obviously pre-mixed ahead of time. The guacmole was from the preserved pre made package and not fresh. I tried to eat the chicken but it was inedible. Some of the pieces looked uncooked as well (I'm pregnant so a huge red flag). Unfortunately, service was slow and no one checked on me for my entire meal. I pointed out the disgusting chicken to my server who argued (!!) saying it was dark meat. To which I said I like dark meat but this was not editable, although I tried to eat it! Since he wasn't the manager he wouldn't be able to take it off the bill since it was part of a lunch special. At this point I just wanted to get out of this gross establishment. I watched the servers discuss over my gross chicken but they never addressed it with me so I left.\n\nI ended up spending $19 with tip on a gross salad. Take your business elsewhere!", "author": "Erin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "So I stopped eating meat over a month ago and decided to try my very first veggie burger. My waiter Larry was extremely helpful. He assured that the \"impossible\" would taste great. I also ordered fries and a Velvis milk shake. Every thing was so delicious and the wait time wasn't long at all I was very satisfied with my meal and the service I received.", "author": "Dayanna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-01", "description": "I thought it was pretty mediocre? In all fairness, I did order a salad. This location seemed to have a lot of parents, kids, and strollers. Or something of that permutation. I would def prioritize other restaurants in the neighborhood before looping back to this one. I'd also try an actual burger next! for what the salad was-it got the nutrition and temporarily satiating job done!", "author": "Bonnie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "From the menu to decor, there is one common theme...BARE.\n\nIt's just beautiful brick walls, wooden seating, and organic food. What's not to love about BareBurger? \n\nI have passed this location a zillion times, always eager to dine in. Hubby and I came in for the lunch rush and were not disappointed. I built my own burger (turkey, spinach, onions, tomatoes, with ketchup and special sauce on a brioche bun). I also had sweet potato fries and the lemon lime soda. Delicioso!\n\nOur server, Dave, was cool under pressure. Our food was delivered relatively quickly, the only delay was the bar. We were ready to close the tab and head out when hubby's second drink was ready and we were comped.   \n\nI love the framed photos of people, but with cow heads as well as a chicken and lamb. The lights were creatively adorned with utensils. In fact, I think the base of a few revolving chairs were also repurposed. Kudos to the interior decorator!\n\nWe had a wonderful experience and as I write this review, we're already thinking of heading back...maybe even today.", "author": "Kristia B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}