{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "What an awesome burger place! Drawn to it first because of the GF French fries, which you can't get anywhere! Burgers are awesome, fries and \"can't stop eating\" even when I'm full and the Dark and Stormy Slushy was an awesome adult beverage! Can't wait to go back...just need to watch how often or my waistline will blow up!", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "My lamb burger was good. However, I said medium well and they gave me well. I'll go back next time and asked for medium. However their burgers don't come with any sides. So side of sweet potato fries, for example, costs an additional six bucks. Which is a little bit much. So overall probably a bit too expensive for what you get. However, not a bad neighborhood choice.", "author": "Mimi V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-30", "description": "Cannot comment on the food. Walked out (after waiting well over 30 minutes)  before it arrived. The service is horrible and amateurish. The time it takes them to cook a hamburger is ridiculous. There were about 3-4 cooks in the kitchen. It was not a busy time, about half of the tables were occupied. Plenty of waiters around. About every 10 minutes an order came out of the kitchen. One of the waiters would then walk around, offering the order to different tables, trying to find the person who ordered it. Several times they could not find anyone and the order went back to the kitchen....???? There were customers sitting at a table near me for a very long time before anyone took their order. The waiters disappeared off and on. Where to?", "author": "B. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-10", "description": "I usually love bareburger but this particular branch falls pretty low. Both for delivery and eat-in, the food is really sloppily made, burgers are often overcooked, shakes aren't blended properly and service is a bit erratic. I would give lower than 3 stars but I like bareburger, just not this one!", "author": "Foodie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "Simply the best burgers I have ever had!!!!! Attentive and friendly staff including the hostess who offered us water while we waited for a table.", "author": "G T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-07", "description": "(Tuesday 8/5/14 Server: Keele)   \n  I went here out of a friend's suggestion \"we both are in High End Hospitality, He's a Sommelier and I a Manager,\" I just wanted a quick bite, and a burger seemed ideal. He ordered the Bison Burger,  and I the Wild Boar, since I love Boar, and it was on the the board,  I assumed it was one of their specialties. My friend ordered the Bison medium rare, yet it come out well done, so after not receiving a check back after our food was served,  I had to flag down the waitress so that my friend could send his food back, it came back\"proper the 2nd time.\" He informed me that this was not the only occurrence he had at this location. My food on the other hand was not only the Worst Boar I ever had,  but the Worst meal that I ever had out before. It was so... dry that it felt like some kind of pellets, (0) seasoning, and even though it says that all burgers are 6 oz's,  (then don't serve it on a bun made for an 8-10 oz burger). Who wants a 6 oz burger anyway, what is this McDonald's? After you add any topping\" of which are priced in fine and hardly able to see print in a very light colour\" the patty just gets lost. My friend suggested sending it back, but as his guest I didn't want to make a fuss, plus he already sent his back, and I didn't want any more trouble. Service was attentive \"which doesn't matter if you don't anticipate guests needs,\" and save the all important timely Check Back so we could send our food back in a timely manner. At a moment I was checked on I told the waitress that they should ask for a Temperature on the Boar,  yet she stated \"that's the way it comes,\" I let her know that it was dry as sawdust, and that only braised Boar should be served well,  because the meat is very lean. Well, anyway I blew the meal off to ignorance of the meat and the American fear of medium cooked pork,  till my friend gave me the Bill to hold on to across the road. On the bill it showed me in black and white that the waitress hit the (Well Button) on purpose, then she lied to me sayin \"that's how it comes.\" What a liar!!! 2 non alcoholic drinks,  2 burgers, 1 fries and 1 onion rings ($46.06) later plus an $8-10 tip , for that we could have gone to a nice French Bistro in the city and had 2 Great Burgers. Put a Waitress in a really bad McDonald's,  and you will get this place. Sad, cause I had hope.", "author": "Edward-Kile M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-20", "description": "Always pleasantly surprised when visiting Bareburger - great food, reasonably priced, perfect for lunch on a budget - the salads are also great.", "author": "Jack L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-02", "description": "Bareburger's ingredients and sizeable interior attract all kinds of people around the neighborhood, from groups of twenty somethings to families of all sizes. The menu can be intimidating, you get to pick from 9 different types of burgers (with a few vegetarian options), 5 types of buns, 7 cheeses, and a wide WIDE variety of veggies and sauces. I have been twice and I definitely got lost in the menu and needed 'a couple more minutes' about 3 times. For those of you who are truly indecisive, they have combo recommendations all down the left hand side of the menu. They pride themselves on their organic ingredients, which is why I think so many parents bring their children here. They also have a respectable cocktail, wine and beer selection so if you don't mind getting tipsy next to a toddler stuffing sweet potato fries into his little face, indulge yourself! Also, try the milkshakes. They're no joke.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-20", "description": "Pretentious. They asked us to wait at the bar even though there were several open tables. Servers definitely had an attitude. High prices for what it is.", "author": "Julius E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "My Fiance and I love this place, we just happen to walk in after a movies one time, and since then we have been hooked!!!! The food taste great, and it has amazing quality! Its a little pricey but its worth it!", "author": "Angie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-10", "description": "meat was inedibly tough", "author": "Oliver I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-08", "description": "wanted to love this place, i always have respect for restaurants that use organic humanely raised meat, i ordered a chicken burger and my husband orders a quinoa burger we shared fries and we drank, me a red wine and him a beer. i went to the bathroom and my husband accidently spilled his beer all over my burger! he went to order another burger for me and another beer for him, the beer didn't arrive and they bought us out another quinoa burger, i told the waitress that it was actually the chicken burger that we reordered, she said she didn't hear what he said so she presumed he meant the quinoa burger! if you did hear him then ask him to repeat him self, so i said to her, please can i order the chicken burger again, exact order but not the fries, and another wine and another beer, the wine finally arrived, but the burger took another 20 mins, and it came with more fries, i presumed they were on the house and stupidly thought maybe she thought i should have hot fries with my meal... this was an hour after we arrived at the restaurant fyi! we asked for the check and it arrived with 3 portions of fries on it, i questioned this and she refused to accept any of the issues we had, wrong order, late drinks, me saying no more fries! just point blank refused to believe she did anything wrong, of course orders go wnrg in restaurants, but the attitude was unnecessary.   Any way she took off the fries, we didnt expect anything for free, and absolutley understood that the initial problem was my husbands clumsiness, but she was so rude,  she threw the check at us at the end of the meal, she didnt offer us deserts of coffee, which we wanted to order both, ( we were sitting outside, at 6pm tonight incase management are interested) oh and my husbands second beer never arrived!!!! the management either need to train their staff, or charge student prices, because they are very confused as to what this place is meant to be", "author": "Sarah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "Tried Bareburger for the first time today.  Was very good.  Cute place with attentive wait staff.  Food was great.  Loved the dipping sauces I got with my fries and onion rings.  Bison burger was yummy.  I can't wait to go back.", "author": "Theresa R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-05", "description": "So much potential, so little follow through.  With a menu that includes all sorts of burgers - bison, ostrich, wild boar??? - it has potential to be solid. Unfortunately, they can't get much right, whether its the poor service, the long waits or delivering the wrong food to tables.  I wanted to love you, but that is sadly not going to happen.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-16", "description": "I took a group of 20 people here without a reservation on an early weekday evening. The staff was incredibly accommodating. They managed to get us into an L-shaped table arrangement so that we could all sit together, and they provided us with water while we waited. Additionally, they gave us all separate checks and got our orders perfectly. Amazing service and the food is delicious!", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-18", "description": "I went for lunch with coworkers.  Expensive and confusing menu.  I ordered a 12oz (small) raspberry ice cream shake.  I only tasted the heavy ice cream, and after I request to add more raspberry (because I can't taste any), I still can't taste the raspberry at all.  It was too heavy and sweet, I already lost appetite and was never able to finish it.  \nFor burger, I ordered Maui Wowie with beef plus the fries and rings combo on the side.  The fries and onion rings are disappointing just like the other reviewers wrote.  The burger was big and nothing special except the beef is really good.  I have to say their beef is delicious; my mouth was full of meaty flavor.  \nThe place is busy so it's hard to get waiter's attention.  One of my coworker ordered three small burgers, I think it's the Barest Burger 6oz patty, which is cheaper, smaller so it's easier to bite, plus you get to choose three different burger combinations.  I'll try that next time.", "author": "Wing L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-18", "description": "Love their vegiburger and grilled chicken sandwich. Top quality ingredients. My only gripe with the place is they close at 10pm. I've gone in at 9.30 9.45 and the place was mobbed. At 10pm they turn streams of customers away. This is NYC not Kansas. People are out and about. I've tried to go a few times at around 10pm  and forgot they close then, so was turned away too. CRAZY They have a branch in Manhattan that stays open till 11pm ,what gives with the LAZY managemnet in Brooklyn. Hoping you wake up and give your customers what they want then more stars.Bareburger Brooklyn, you are in business to do business right?", "author": "Zen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "This neighborhood has several really good burger joints.  And so, it says something, when you can really taste the quality of the meats (and toppings).  Their beef is fantastic, and I've been adventurous enough to try the bison (which is also very good) and their thick-cut bacon is excellent.  The staff goes out of their way to be pleasant and make sure they repeat your order to you to make sure they got it right.  It can get busy, and the place isn't huge, but they will take a carry-out order by phone or at the end of the bar, if you don't want to wait.", "author": "Josiah T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "The keyword at this place is organic and peanut oil. The sandwiches are delicious and they give you various condiments to try with your fries/onion rings. Skip the blueberry soda but definitely get the buffalo chicken sandwich. De-licious! And the place is located right near the Brooklyn Bridge so you can walk over as you digest. Can't wait to go back and try one of their burgers.", "author": "Nicole R."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}