{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "Wait wasn't bad on sat night because their service was quick and active (unlike the 2nd ave Manhattan location).  I'm not in this neighborhood a ton, so this rating is really based on how it stacks up to other Bareburger locations.\n\nThey did a very good job cooking to medium and not overcooking as is the norm nowadays.  The jerk chicken sandwich wasn't very flavorful, and it came out so hot the chicken cooked/softened the raw onions, which kind of defeats the purpose. I know part of the appeal is all the crazy meats, but it's ok to ignore them and just get beef. I was told by a friend that works at a different Bareburger that the beef is the best anyway.", "author": "Luke Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "My date and I came here on a Tuesday afternoon, delighted to find that it was relatively empty, and everyone who was there - server or customer - seemed happy to be there. The servers here are warm and friendly, checking on you throughout the meal to see if you need anything else but not in a way that seems obtrusive to the table conversation. It's a good thing our server, Matt, wasn't a salesperson - he was so helpful and likable that I probably would have purchased anything he was selling. \n\nI don't think anyone is not well-served by the menu here - the tummies of vegans, vegetarians, meat-lovers, and folks with food allergies will rejoice alike. As a vegan, I'm used to finding a lone veggie burger on the menu at most joints and whether I want it or not, I'm just happy to have found SOMEthing. Here, I was happily surprised with choices - bean burger or farmers quinoa burger? Vegan cheese? Which toppings? That's the build-your-own-burger side of the menu, but if you're an indecisive type, they have plenty of already-made burger combos to which you would just add the patty that you'd like. If you decide to make your own, just bear in mind that all of the toppings can quickly ring up your burger's price tag. Most will be in the $9-10 range, but piling add-ons can push it into the $15 mark, which makes for a pretty expensive burger in my opinion. That's what happened to me when I chose the quinoa patty with vegan cheddar and avocado and a few other (free) toppings. Was it worth it? Price aside, it was a damn good burger. The tastes were there and I don't know if their vegan cheese is housemade or bought, but it hit all of the cheesy notes I remember from my pre-gan days. I only wished my sandwich stayed together a little better. The quinoa patty - while delicious - had the texture of oatmeal that has barely gelled together, and it started falling apart after my first bite, requiring me to fork and knife it for the rest of the meal. It's not a huge deal and I wouldn't have minded it nearly as much had it not been priced like a luxury burger. \n\nOther menu items - the fries made this carb queen's heart SING, with plenty of crunch and perfect seasoning. We ordered a small sweet potato and a small fresh cut, and portion-wise, it was enough to last us from the appetizer round to the post-meal wind down. We didn't get to try the curry ketchup that everyone's been raving about, but I'm looking forward to it for the next time around. My date ordered a blackberry vodka drink called the Rachel Carson. It was bland and the sprig of rosemary that they stuck in there was really overpowering, but we loved my bellini (peach and bubbly), which was sweet and refreshing. She loved her ice cream sandwich, swimming in a little puddle of chocolate sauce, but I found my vegan carrot cake to be stiff (like it'd been sitting in the fridge for a long time) and the caramel topping made it much too sweet. \n\nThe restaurant looks like a cleverly renovated garage, with plenty of wood accents and bar seating if you'd rather sit up higher. It looks rustic but comfortable and (tonight anyway), it felt like a place that invited lingering after a meal, and we did precisely that last night, chatting for at least half an hour after we signed the check with nary a stink eye from the workers.", "author": "Jane I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-06", "description": "I had a really good experience at bareburger, except for one thing, the waiter kept coming around every few minutes to check up on us. Great guy, but it's one of those things that there's a thin line between being courteous and annoying. I was very satisfied with the food, I had the Maui Wowie burger and the pickle chips which was very delicious. The ambiance is very chill and I would highly recommend for an afternoon eat out and drinks.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-10", "description": "Ordered 3 burgers and one slider. Delivery time was over an hour and all three burgers were cold and raw in the middle. I don't know how this place stays in business. I spoke to a manager named \"Guersha\". She was polite and kind and offered to refund my entire order yet then she hung up on me. When I called back she apologized and then hung up on me again. I cook for a living so I know what I speak of. Beware Bareburger. Unless you like ecoli.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-24", "description": "So I have been to an UES Bareburger near Cornell Weill. I had the County Fare ( bison, cheddar cheese, onions, tomato, lettuce). It was ok but the bison was dry as I have often found bison outside of Colorado tends to be.The gf bun was dry-yyyyy too. The fries were tasty but average. I appreciate being able to get a gf bun though. After a day of shopping and not many gf options in downtown BK-  I decided to give it another  try.\n\nThis time I ordered the Standard with beef, colby cheese, caramelized onions, special sauce on a gf bun. This was tasteless-no salt or any seasoning was added. I didnt get any onions.  I barely had any cheese. And the gf bun was poorly sliced and fell apart on me. The special sauce tasted like mayo. I dont think I will come to this place. Fifteen dollars for a gf burger and fries is worth it if the burger is tasty. But there are other places like Burger 67 and Smashburger that do a bettter job at the same pricepoint", "author": "Anastasia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "Delicious! The menu was overwhelming but our server gave great recommendations. My boyfriend and I had the bison roadhouse \u0026 elk habanero burger as well as onion and fries to share. Everything was fresh. Our server was great even though it was extremely busy. Yum.", "author": "Annie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-12", "description": "Needs a no star option. Despite decent burgers this place and most of the staff are completely disorganized.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "OK! Pretty cool place pricey, what place in Downtown BKLYN thats organic is not??? lol \nthis place is really cool can get really tightly packed when busy, I ate here the first week it opened, i tried the fritters with yams and i think cheese inside it came at the best time, so crunchy and delicious! then onion rings and a western bison burger, outstanding, wait....that's not all! I had a organic milk shake, #FOODPORNLOVE try the peanut butter with strawberries! #OMG! this place is good and satisfying, if you have a craving for a great milk shake at 1030pm and its 23 degrees outside (hey don't judge me, I had a Craving! :))  hit this place up, yes its organic, yes its alittle more, but trust me, organic + deep fried = Efffin 'Amazing!!!!", "author": "Jesse I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "The food tastes amazing. The range of customizations are impressive from Bison burgers, Ostritch burgers, to getting your burger as a wrap instead. I recommend the Habanero Express.\n\nThe waiters although nice people seem very overwhelmed and they definitely need more staff.", "author": "B S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-08", "description": "Awww Bareburger, how I used to love thee. What happened to you? I can no longer customize my order online. I have to come in to this lackluster service here at court street location to get my gluten free burger bun now. Even worse, the burgers are now smaller since the menu changed, but the price is still high! What gives? Well the fries are still good!  Don't think I'll be back for a while though...", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "I always go here for burgers and diet coke and milkshakes but this time I got the Italian artichoke salad. I never realized how amazing their salads were. SO GOOD.", "author": "Allison S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-30", "description": "I ordered a medium rare elk burger and I got a dry well-done elk burger. It felt like I was trying to eat a small hockey puck.  At least the bathroom was clean though....\n\nI suggest sticking with the original Bareburger locations....", "author": "Alyssa Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "When you go to bearburger you walk into a very family friendly environment. Starting with appetizers, their onion rings are off the hook. They have the best onion rings I've ever had. They have a large variety of sauces that are homemade that are amazing. When you order you can create your own burger that is customized to the way you want it which I think is great. My favorite thing to put on the burger is a fried egg but it is not on the menu. The service is exceptional. I totally recommend going to bareburger.", "author": "Maria R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-10", "description": "It seemed like there was a lot of hoopla anticipating this location of Bareburger opening, but I'm not sure exactly why, since there are tons of burger places in the neighborhood, of varying degrees of quality. Even non-burger specializing places have burgers on the menu, so there's absolutely no reason why people should have yearned so badly for this place to open. I guess it's just the newness of anything opening, especially chains (e.g., Trader Joe's), which is a bit sad in a neighborhood that is still mostly local, one-off places.\n\nOn a Sunday night, we waited about 10 - 15 min for a table, which wasn't bad, considering it was their \"busiest night of the week\". But we noticed, upon entering, that the place was disordered: the tables were oddly situated, there was rubbish on the floor, there were squirming kids and strollers strewn about (no problem with kids, but shouldn't there be a place to park the strollers, which are often the size of SUVs?).\n\nWe found a place at the bar to wait (sort of, it was also poorly organized -- not an optimal use of space, with people and stuff spread out, whereas a couple of seats could have been added in), so we waited beside the bar and had a really good strawberry and ginger slushy margarita (with an extra dose of tequila added, per the bartender's suggestion). When our table was ready, we were to be placed at a rather squished table near an open window, while a table right at the window was also available -- it just needed to be bussed. I asked if we could switch, which was no problem, but I don't really see the logic of having to ask.\n\nIt didn't take long to order at all (I had the Bacon Classic Burger; my companion had the one with chilli peppers -- can't remember the name), as well as onion rings and a side of coleslaw. Everything came, wham-bam, at once, and I noticed the same of neighboring tables. There wasn't therefore any reason to specify the order of food arrival, about which we were asked. The food arrived and was good, no complaints. But after that, everyone disappeared. We had to flag down someone for additional drinks, etc. It was like we were left to our own devices. And although the server was apologetic about us \"feeling\" as if we hadn't been properly served, she wasn't very genuine about her sentiments, snatching the drinks menu away from my partner.\n\nI noticed as well that there was a management team that basically hovered at the bar drinking, occasionally circulating among customers in a social manner. But I think if he and she had expedited a couple of orders, bussed some tables, ran some checks, picked up after messy kids, etc., the place would be much better run and the whole experience would have been a lot better. I haven't been to other locations, but this Bareburger really needs to get its organizational act together.", "author": "Niall B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Simple review\n-service was good\n-choice  of meats and toppings is huge and they allow you to customize your burger from type of bread, meat and toppings.\nThey do have outdoor seating on the side walk so that's a good option when weather permits.\nThey use only organic grass fed beef which is great since most burger joints don't and grass fed beef is said to be healthier for you.\nI had the beef burger which isn't the tastiest burger I have had in my life but definitely a solid burger that  tasted very fresh and you can tell its better for you since its not greasy. If your in the mood for a greasy burger which many people want since they tend to have more flavor then I would skip this place. If you would like a burger that is healthier yet still a solid burger then definitely try it. They have many options of meat which I haven't tried but I'm sure they are good as well.  They  also serve cocktails and beer which is always a plus with a burger :)\n\nAmbiance has a feel of an upscale burger joint and it is good for groups", "author": "Michael B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-13", "description": "Ate here on a Sunday afternoon before making a shopping run to Trader Joe's. \n\nFriendly wait-staff, prompt service and good food.", "author": "Thom W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-14", "description": "I went there with a few of my friends from it of town. I got the bison burger. I asked for medium, but they served it to me rare. I told my waitress who confirmed that it was rare and she could throw it back on the grill but by then I had eaten half of it. She did offer me a drink on the house but I didn't take it. Mostly fear of getting spit in it. My friend ordered dessert and it took 20 minutes to come out. \nOverall I'm probably not going back. Something you might want to try once but there are better places with the same offerings.", "author": "Allen A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-12", "description": "The entire experience at Bareburger was miserable, from the non-existent greeting, to the uncivil seating, to the long wait for service, to the tasteless burger and particularly bad gluten-free bun (it disintegrated on first bite and was flavorless), to the absence of any inquiry from the server, to the grossly inflated price. On an earlier visit to a different Bareburger, the friend I went with felt the food and service were awful and said she'd never go back. I decided to give Bareburger another shot--albeit at a different location--and I've arrived at the same conclusion.", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-03", "description": "This place gives you all the options to build a healthy burger!  Or you know you can build a less healthy one if you want.  Plenty of vegan and vegetarian options from cheese to extra toppings.  I had my burger in a collard green wrap and it was pretty awesome.  They have so many different sauces to try, really liked the buttermilk ranch.  Great onion rings, big and crispy.", "author": "Margaret V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-31", "description": "Best Fast Food I Ever Had! Super fresh \u0026 tasty! However, it is extremely pricey just to be a burger with a side of onion rings and beer!", "author": "Nesmari C."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}