{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Awesome service and the food was beyond expectations. Was pleasantly surprised for waking in during a weekday lunch hour. And my boyfriend believes that he had the best burger he ever had here. Simply put... amazing.", "author": "Beckiee L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-11", "description": "This is a burger place and they can't cook a burger the way you order it ordered medium got rare.  Service was horrendous. Draught Beer menu just has 6 names on it just names no styles listed who does that.  Both beers served were served chilled not cold. WTF.  Got the onion rings and fries combo the onion rings were so hard it didn't make sense and the sauces what were they we still don't know.  With so many bars around why would I ever come here. It was $60 for two for burgers fries and two beers.  At these prices you only get one time to make a first impression and it was not good.", "author": "Suzanne M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "Do not order online from here. I ordered thru seamless. Check out review on seamless and you'll see what I mean. I placed an order and received an email confirmation that they were making the food. After over an hour waiting I called. Apparently the order was cancelled and I was never informed. They said I had to wait 3-5 days to get my money back. Why advertise on seamless that you'll deliver food if you can't handle the influx of orders? Terrible management and staff. Over-priced and not worth the headache.", "author": "Kate A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-11", "description": "I love this place. Wonderful service, friendly staff. I usually eat here at least once a week. It's great because I'm paleo and here I can more or less stick to my diet without feeling like it. Their burgers are delicious, high quality and very interesting. I love the duck and wild boar burgers. They used to have ostrich burgers which I also loved, and I wish they would bring it back. I guess there just aren't enough ostriches out there. The only reason I'm giving this place 4 stars is their bacon. It is never crispy, not even when I ask them to make it extra crispy. I have to fight to bite through my burger. I dream of a bareburger than I can bite cleanly through with a satisfying crunch. Otherwise, it's delicious.", "author": "Courtney M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "The food at this place is delicious, undeniably savory, fresh, and even organic.This is the pinnacle of organic burger spots that I have personally visited. A short walk from Hoyt Schermerhorn stop, anyone can make it here on a weekend afternoon. I'm giving away a place I should be keeping a secret so when I go back I won't have to wait in line. I guess it's too late for that.", "author": "Maximilian R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-06", "description": "Had the blue elk . It was amazing  and a must try. Only reason I'm giving it 4 stars is because the take out process is unorganized .", "author": "Truth H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "We love this place! \nGreat variety, burgers and ice cream sandwiches\nbut best of all, awesome awesome servers and service. The pesto sandwich was not great but the server was super nice and took it away right away. \nButter pickles are so good :) so are the fried butter pickle chips", "author": "Anna W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "Good burger. I got the burger with brisket on top, it was large. Fries were good, skip the onion rings. The burger and fries come with really interesting sauces on the side. Delivery was efficient.", "author": "Nancy A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-10", "description": "Hmmmm... this Bareburger has a way to go until it's on par with the other locations I've visited. The wait staff have not yet hit their stride (super slow service, my 2nd beer never came, etc.). And, the food... ugh... what a disaster. I know Bareburger has the capacity to craft a good burger and delicious sides, but the chefs at this new location have not yet mastered their culinary burger-making skills. On this visit, I ordered the Big Blue Bacon Burger (medium rare), which came w/ blue cheese, bacon, mushrooms, onions, and bacon marmalade. The meat was super dry and not succulent at all. And the multi-grain roll it was served on was also dry as a bone. What a disappointment!! On the side, I got the fries and onion rings combo. The fries were fine, but the onion rings were overcooked and were dry and burnt tasting. I'd like to return to this location of Bareburger b/c it's so close to my house, but I'll definitely wait a while before I do because it's apparent they haven't worked out the kinks yet.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-29", "description": "Don't deliver to Flatbush \u0026 Myrtle Avalon building anymore. #fail Great product but inconsistent delivery options via Seemless.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-10", "description": "I am writing this review solely in response to the new menu. Where is the house salad with portobello mushrooms and balsamic vinaigrette dressing?????  Bring it back!!!!!!!!!", "author": "David A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-10", "description": "This restaurant is great for many reasons. The food is excellent. You get great burgers it's soooooo many options. The only downside is you have to order your French fries separately. I think fries and a burger are ubiquitous. Anywho, def go and try to mix and match different flavors.", "author": "Sierra B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "Awesome burger. Very clean  and fresh. Love everything about this place and this was just my first time. Need to try the different proteins. The staff was very helpful explaining the menu and what works with what. Long story short, everything works.", "author": "Ronald G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-08", "description": "My order was estimated to arrive 45-60 minutes after I ordered it. That was 85 minutes ago and I'm still waiting. I called 15 minutes ago and they said \"it will be there any minute!\" This is frustrating. I'm hungry. And getting hangry.", "author": "Alexandra F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-04", "description": "This place is pricey. They do have a lot of options.You pay extra for cheese on your burger which doesn't come with fries(that's extra). I'm giving them 3 stars because everything is organic so I guess thats why it's pricey. But the burger isn't that big and i wasn't impressed with that taste. I've has tastier burgers that were cheaper. .I got the classic burger .I spent $50 for two burgers, a dessert, tax and tip. I like that they have lots of options for the health conscious but I wont be returning.", "author": "Marissa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "Habenero Express For the win. It's my go-to burger every time I'm dining with the barest of burger. Add a side of fries and your set for the night. Enjoy!", "author": "Kyle V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-23", "description": "My girlfriend and I came here on a sunny Friday afternoon with a craving for burgers. Was our craving satiated? For my girlfriend perhaps but not me. My girlfriend ordered the Blue Elk while I ordered the Buckaroo. My burger did not live up to my expectations. Although my girlfriend's burger tasted better, it still was not quite up to par on what I thought a good burger should be. However, the sides that we ordered, the onion rings and dill pickles, were spot on. The onion rings were crunchy and the dill pickles were crisp and salty. Delicious! Regardless, the service could have been better. Our server asked the table next to us if they wanted anything else before they gave them the check. The server did not do this for us and abruptly gave us the check right after we finished. I was thinking of getting a shake but her behavior spoiled my desire. I do not recommend this place, unless you want some onion rings or dill pickles...", "author": "Farhan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "It was my first time eating here on Friday and I must say I'm one happy customer and I will definitely be a repeat customer. A friend of mine told me about Bareburger and I've been dying to try it. I love the fact that they offer gluten free options, organic meats and all natural ingredients. I'm really thankful that this place exists.  It is hard to find organic burger restaurants these days especially with the variety of different meats like bison, ostrich, elk ect.. My food was outstanding and so was my desert. My waitress made my first time experience even better. She was very helpful and knowledgeable about the menu and was able to make recommendations. Great place. I will definitely be back.", "author": "Heather B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-14", "description": "Love the food, but the delivery service is a complete disaster. For the 4th time I have to call the restaurant to know the ETA, after an hour of waiting. This time the order was not even processed. Very disappointing... The hostess apologized over the phone, but now I have to get my local dinner to quickly deliver a mediocre meal.", "author": "Lucrecia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-23", "description": "I've eaten here a few times, and gotten delivery as well. The food is always really good, though the prices do seem a little high for delivery, but there's always something a little...off. Just one little thing. No pickles when I asked for them, mayo on the burger when I asked for it on the side, the wrong kind of cheese on my burger. Nothing worth sending a meal back over, but something that could turn you off if you're very picky. Just a little more...let's say attention to detail, and this would be a 5-star place, as far as I'm concerned.", "author": "Jana M."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}