{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-18", "description": "Quality ingredients apparently don't make quality burgers, just expensive ones. \n\nPatties are poorly seasoned and dry. Extremely average.\n\nThey forgot my avocado and smoke sauce too which would have helped with the dryness and blandness of the burger.\n\nSkip this place, your wallet and taste-buds will thank you later.", "author": "Anton D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "I haven't had bacon in years. Some came with my breakfast and I just thought I would give it a go. I was never so amazed at every bit of it being edible and tender. And flavorful. My friend and I had the best breakfast I have had in a long, long time. We have the eggs, waffles, tater tot's, and your choice of meat. Even their tea selection was great.\n\nOur server, and as far as I can tell all the servers, were aware and conscientious and attentive. It takes a little bit longer for your food to be cooked, because it's real food. They're back there beating up the individual egg orders for instance.\n\nThey gave us free doughnut holes because the time of day, and those were very appreciated and delicious as well.\n\nI highly recommend this restaurant.", "author": "Ciel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Went here on a Wednesday night around 7pm and it was nearly abandoned. The waitress was available for questions, which is good because they have some interesting things on the menu! The special sauce is a mixture of all your basic sauces, like mustard, ketchup, relish, mayo. We got it with our sweet potato fries and it was great for dipping!\n\nMy friend ordered the Supreme and I made my own burger with bison, \"green leaf\", baby spinach, cheddar, mayo and ketchup. We were both stuffed halfway through and took most of the fries to go. When they say \"green leaf\" they literally mean one leaf, so I'd ask for \"two green leaves\" next time. Other than that, my custom burger was delish. \n\nMy biggest complaint here is the price. $10 for an appetizer of sweet fries?! I ended up paying $22 for my burger, half the fries, plus tax and tip. A bit ridiculous but maybe I'm just not used to NYC prices yet. Let's be real, I don't think I'll ever get used to them.", "author": "Naomi D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "I went for the lunch special salad (since I've had many burgers here before) and it was amazing! Everything was very fresh and was super filling for a lunch special. If you can, sit outside!! The servers are always friendly and rarely ever a wait. Definitely recommend!", "author": "Carly G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-13", "description": "I have to come back to try treir burger. I had the salad, which was good. Chicken pieces were big and nice cooked. Pretty pricey though. $18", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "So, we meet again, bison burger.\n\nThis place offers so many different options to customize burgers that fit anyone's preference. I can't express how much I love bison burgers. \n\nI ordered a brioche bun with bison, gouda, alfalfa, spinach, dill pickles, pickled red onions, and special sauce. The alfalfa gave the burger such an earthy taste and aroma. I really felt like I was eating a burger fresh from a farm. ($14)\n\nThe burger and fries were great, but the Mexican Chocolate Shake was way too sweet.", "author": "Jenny T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-15", "description": "Dry burgers,  dry attitudes.  My husband was pissed i left a $5 tip.. he felt it was too generous. Oh Tiffany, fix your face,  PLEASE.  If we call you over,  we don't want to see eye rolls.  Smiles go a long way.  And whats up with $8 cans of cider? Boy were we side blinded by THAT one! So,  let's get to the food.  I had the berry blue salad,  which I enjoyed.  My husband however had  a $14 burger that was dry AF! My Cousin had the \"Falafelwraptor\"... it was wrapped in cabbage and drowned in 100%  vinegar and \"stuffed\" with falafel crumbs-$14 \nThe tab for a salad two sandwiches and a few brews was over $90... we all felt cheated. Top that with every toilet flush filling our nostrils with the smell of fetted human waste.  \nNOT recommend", "author": "Leslie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "YES, 1,000 times yes. I was walking down the street, not thinking I wanted a burger for lunch but then I saw these bright yellow garage doors that opened up the entire restaurant and a beautifully designed frame wall and I couldn't resist.\n\nI am so glad I came here. As if the decor didn't already blow me away (seriously, at least come by for that and TRY to say no), the menu was so explanatory and helpful in deciding what to eat. You have the option of building your own burger (bun choice as well) or you can choose a pre-made burger. They don't just offer beef, but also bison, elk, duck, turkey, etc. It's also very apparent that they care where the meat is coming from, which I really appreciate.\n\nI got the Supreme Burger (beef patty, bacon, onion rings, etc.) and it was cooked perfectly. Not overdone, just juicy enough. Typically I don't feel great after eating burgers, but I felt wonderful all day after this. Definitely think there wasn't a lot of grease on it either which was awesome. In the words from the man sitting behind me, \"Patty is a little small but, you know what, I don't need a big fat one.\" True that. I didn't think it was that small, but to each his own. Also, I can't help I overhear when someone talks loud and is sitting a foot away. Swear its not as creepy as it sounds.\n\nI had sweet fries with the burger and LOVED them. I felt healthy, while still not, and they were just the right amount of crispiness that kept the inside soft and potato-y. Also had the fried pickles to start and they were good, a new experience of sorts. The batter wasn't just bread crumbs, but also sesame seeds (I think) and other mix-ins that added a little kick. The dipping sauce paired with them also seemed to have more fresh ingredients in it. I'm glad I tried them, but I'm used to plain (but not plain) southern style fried pickles, so I can't get away from that.\n\nI'll definitely be coming back.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-04", "description": "Solid veggie burgers, but there were food remains on the floor and my seat. They stop making fried pickles and the replacement Macho fries list over 1300 calories...", "author": "Pablo P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "This location is really clean and nice just like the one in Plainview on Long Island for the food and menu is the same just stopped in to grab a quick drink before I head back to the island highly recommend coming here if you haven't always great burgers", "author": "Lindsey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "First time at this place that was recommended by a coworker. The atmosphere is casual, a little rustic and cool. Two of the walls have garage style doors that were open the day we went so we enjoyed the beautiful spring day.  The menu is a mix of very healthy food with some items fried so if you watching calories be aware. \nThey offer lunch specials which are essential combos of a main item, a side and a beverage at a discount price. \nI hade the Falafelwraptor (GF) 9.55\nFalafel, Feta, spicy pico de gallo, alfalfa, cucumbers, pickled red onions with lemon tahini dressing in collard green wrap. Gluten-Free. Calories: 630.\nGot that with a side of slaw and a very generous sized iced tea. Simply amazing and like nothing I've ever had before. \nThe burgers looked amazing too and did I mention the have a full bar. \nDefinitely worth a visit if you like healthy organic local food on a comfortable atmosphere.", "author": "Craig M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "I've been a fan of bare burger for years, since it was only in Astoria! I thought that I had tried just about all of their protein choices but I didn't realize that they change their menu up fairly often. It was great to be able to attend the Elite Event and sample the new additions to the menu!\n\nThe wham bam burger is out of this world good - fried chicken breast smothered in wham bam sauce (buffalo + bbq), topped with bacon. I also really loved the Lamburger topped with avocado and a yogurt sauce. I wasn't a big fan of the vegan burger we sampled which I think was the Prairie. The biggest surprise was the fact that they have amazing salads and brussel sprouts. I sampled several salads and all of them were great, like actually good enough to order them instead of a burger at a burger spot. That good. They also offered a really good cider that I had never tried before called Down East.\n\nLastly, their shakes are to die for. The vanilla peanut butter is great but the coconut, avocado,and lime \"Cococado\" shake (which is vegan) was the standout.", "author": "Hannah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "What I like about Bareburger in general is that each location is uniquely different. Whether it's what's offered on the menu, the layout, or the service provided they all feel like Bareburger but it's like a different relative that you're meeting. They have different personalities.\n\nWith that said...\n\nI specifically like this Bareburger because it's conveniently across the street from Trader Joes. I'm kidding only 30% though. Like I'm either in here before I go grocery shopping or after but no matter the order in which it happens just knowing I'm going to Bareburger relaxes me. What plays in that is that this particular Bareburger offers table service. I've only been to one other Bareburger in Fidi and unless I'm unaware, table service is not offered there.\n\nSo not only can I get table service and get greeted by these warm bubbly waiters here, I can also get just as bubbly as they are because this location has alcohol on the menu. SCORE! So I get the great staff, I get the bubbly, AND I get my food delivered to me like I'm on the food network judging the chefs. The presentation of each dish here is always remarkable like is this even considered fast food? They always plate their food like they just know annoying yelpers like me are coming in ready to take pics. It's neat, it's good quality, and you can tell from the look of it, it's instagram ready...ALL.THE.TIME.\n\n:-*", "author": "Jana P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Bareburger's a chain now, originally from Queens but now all over the nation, and if you've been to one you've been to them all. That said, it's good stuff. They have a lot of specialty meats, like elk, duck, and wild-boar, and there are of course vegan options as well (this is Brooklyn after all). Their fries are solid, they have beer on tap, and the food comes fast.\n\nTheir regular burger I think doesn't really hold up to Shake Shack but the specialty meats are pretty fun, and probably considerably healthier. It's a decent burger joint, worth checking out.", "author": "William J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-22", "description": "I attended an event at the Park Slope location, and I was blown away. I felt the need to visit Bareburger again because the service and food were excellent. However, I didn't have such a great experience here the second time around. \n\nI came on a Saturday afternoon; it was rather crowded, but there was one table available. When the server came over, I felt he was a bit pushy. I placed my order which was a beef burger with cheddar cheese, fries, and a shake. The food was ok, not as great as the sliders I previously had, but that's ok. \n\nOverall, I would visit Bareburger again, but probably not this location. It's rather compact here and the tables are very close to each other. However, from the wonderful initial experience I had it's certainly worth another try.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Bison burger was delicious. However smaller portions and high prices make this a one and only visit for me.", "author": "Corinne C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-01", "description": "Kind of regret I spent $30 here today. Supposedly they get their meat from upstate NY and maybe I am not used to such quality meat?...that's sarcasm...I did not like the taste of the burger meat at all. It had a taste that was just not good -- I can't even describe it. The fries were just okay. \n\nSo, with that being said, the place was super busy and I am sure people absolutely love this place...I am not saying not to give it a try...but I will not be back...ever.  Service was fine. Also, something that kind of grossed me out was the fact the waiters were bringing all of the dirty dishes from the cleared tables onto the counter where people ordered from and near where we were sitting at the bar. On top of that, they did not once wipe that counter off as they cleared the dishes. \n\nSorry Bareburger! No return, loyal customer here.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "we came here on a Saturday night, 4 adults plus a kid and walked right in and got a table. We're used to eating in the city, so they usually have you have the full party there before letting you sit.  they sat two of us and had the 2+1 come about 5 minutes later. \nThe waiter had to be waved down once.\nthe food came out pretty quickly.\nI got the American burger, always a treat. very good.\nmy fiancée got the salad, I believe the California one, I wasn't a fan the mustard based sauce was just too mustardy.\nthe fries were on point. But, we couldn't finish the fries because we got full on the choco milk shake appetizer. so, a half choco milkshake, half burger, half salad and half the fries more than stuffed us. I couldn't finish another fry.\nthe bathroom had a continuous line and there was hardly any soap. Boo.\nOverall, I will be back.\nthey also have the ordering and payment system on a tablet, which I thought was nice. save paper and have it emailed. I am beginning to appreciate emailed receipts more.", "author": "Peter J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-14", "description": "Always had good experiences in this branch,.... \nToday, was a different story. The server ignored me when I said good morning. \nAfter asking for a well-done burger with the pickles \u0026 sauce on-the-side.... I got a med-well burger, no sauce, pickles In the sandwich... \n\nI speak American Standard English. What's the ish?  \n\nIf you're a server, n scheduling was a mess so you're working alone, or you got outta the wrong side of bed,...\nPlease don't take it out on your customer, and bitch about it later, when tip is low or non-existent! \n\nBurger was very good - forgot about the 85% batter on the onion rings - lol", "author": "VioletL P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "The hunt for the best vegan burger ever is over. I was skeptical about this vegan burger because of how terrible they can be. I had to continue to check my sandwich for meat because of how amazing it was. It fell apart \u0026 looked like a medium burger, smelt and felt like a burger. I danced \u0026 smiled through the whole meal.", "author": "Charli R."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}