{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "My favorite turkey burger. Turkey burgers can be dry but not at Bareburger. The pickled red onions and pickles are the perfect topping. The sweet potato fries are crispy and tasty. Thanks Bareburger!", "author": "Amy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-16", "description": "They recently updated their menu and I thought it's worth re-reviewing. My go-to order was the maui wowee burger and thankfully (for me, at least), there's a tiki burger on the menu that is a close relative. BUT, I decided to try the hot honey chicken sandwich (instead) with the sweet potato fries. DELICIOUS. Perhaps this shall be my new favorite dish...", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-28", "description": "I've come here many times and their burgers and fries are really good , but the salads seem to be inconsistent , I order the same salad over and over again and evey time i get different proportions and it's really disappointing  tonight my salad had a hole entire onion just thrown into the bowl :( really made me lose apetit", "author": "Arita M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Bareburger is the health and ingredient-conscious customer's heaven. Between being able to choose from a wide variety of burger types (including several veggie), buns (including a collard green wrap, which is very sturdy and effective), and all sorts of veggie toppings, it is really accommodating. Plus, the burger itself was tasty and the service, including quick turnaround on food after ordering (burgers usually have one of the longest bill times on a menu). Worth a try!", "author": "Rhiannon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "I live in the neighborhood and discovered this place while on my Saturday walk.  I'm in love with this restaurant.  Anastasia was amazing, the service couldn't have been faster.  My Elk burger was not just great, it was amazing.  Of course I recommend this place!!!!  Nothing could have been done better!", "author": "Rob M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-13", "description": "This place has the WORST SERVICE. Every time I go here, no one serves me and they are really rude. \n\nI also caught one of the waiters adjusting to the tip (STEALING). I kept my receipt and then got the bill in the mail and they had added more than I wrote (which was 20%). Make sure you save your receipt and write the tip on it! They are a bunch of crooks!!!\n\nBut the food is good.\n\nUPDATE: \n\nAs for the credit card receipt and tip. This was a different time. We had the WORST waiter ever. I was with my family. He was so rude. We left a decent dip, but  accidentally walked out with the signed tip receipt instead of the copy. The waiter decided he would add his own tip and evened it up to an even $100. This is not a mistake and it was the customer copy.  EVEN if we had not left any tip, which is what he deserved for being such a dick, he has no right to steal from his customers. THIS IS WHY WE ORDER and I still keep every receipt and have to worry about checking the bill.", "author": "Josh V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Five stars because they gave me fried pickles even though they recently took them off the menu. Please bring them back, please oh please oh please!!\n\nNow if you haven't gone to any Bareburger locations you clearly are missing out on life and probably should reevaluate your priorities; I'm just saying. Secondly this is my favorite Bareburger location. Every time I've gone I was able to be seated quickly, the service was super friendly, it didn't take 80 years to order my food or to get the check at the end. \n\nOn to the food. Every Bareburger is entirely organic and not over priced, which is awesome. I have only tried the veggie burgers here and let me tell you they are some of the best veggie burgers I've ever had. I highly recommend getting the black bean burger. Everyone else I have been with that has ordered regular beef burgers also said they were amazing and cooked exactly as you asked for them to be.\n\nNow just bring back the fried pickles and you'll be the best place on earth!!", "author": "Rosemarie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "Yum! I love all the options...even though I always order the same thing! The staff is very nice and accommodating. They never rush you out or push any specials or deserts. The bottles of wine are a great and inexpensive option as well. \n\nOne of the reasons I only give 4 stars is because the tables are extremely close together and this restaurant is very family-friendly, so it's not always pleasant to be disturbed by small children while I am eating. My last visit I had to keep asking the parents of a young boy to have him stop putting his feet on me and kicking me. While this is not necessarily the restaurant's fault, it could be helped by spacing the tables further apart. \n\nOne tip: this is a GREAT family spot and suitable for taking young children even later at night, so maybe avoid selecting as a date spot!", "author": "Jenna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Nice atmosphere. Really appreciate the gluten free options including the fact that they don't fry the French fries in the same oil as items with wheat.  \n\nI had the Blue Elk burger which was very tasty. I also like the fact that they had good local drink options as well.", "author": "Heather H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-02", "description": "Went there on a Wednesday evening and here is what I liked!\n\nService: We did not have to wait for a table so it was great.\nOur waitress was extra friendly and took the time going over the menu and making suggestions on what we might want to order.\n\nFood: We ordered the fried pickles which were amazing ! As well as the Maui Wowie with ostrich and the Big Blue Bacon with elk; we also ordered a side of fries. \n\nThe Maui Wowie  was delicious; it was suggested by our waitress, and although I was reluctant at first, I am sooo glad I took her suggestion.  I had the ostrich medium rare and it was juicy and tasty. I wasn't crazy about the elk, it was too gamey for me but my date liked it.\n\nI love the fact all the meat comes from cage-free animals and many of the ingredients are organic. They also have vegan and gluten free options.\n\nMy one complaint is they only have one bathroom for the whole place and I found myself waiting 10 mins to use it.\n\nOver all I would go back but would love to try another location.", "author": "Rosemary V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-18", "description": "Ordered delivery from here 3x. They screwed up our order the second time. Called to complain, and they offered us a credit. Ordered the third time and they can't find any record of the credit. Burgers are good, but service is terrible.", "author": "Shafina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "I've frequented almost all of their locations, except this one. Upon arrival my boyfriend and I requested to be seated outside, we had our dog with us and knew she wouldn't be allowed inside. We tell the hostess and we seat ourselves all the way towards the back, since It was slow it was pretty easy to miss us. The hostess was a little rude and I'm almost sure she didn't notify anyone that we were seated towards the back. Not sure the protocol they follow but it seems as if they had forgotten about us, we didn't get any water nor a waiter. A few minutes later, I had to get up and tell the hostess that we were ready for our order. A very sweet waiter then appeared and apologized for the delay, he took our order and even brought out a doggy water bowl for our pup. He was very kind and even went as far as giving us free fries \u0026 onion rings for their little mishap. I understand all business make mistakes but it's so wonderful when they go above and beyond to make sure they rectify it. Loved the service here!!", "author": "Lexy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "So, I'll be the first to admit that when you go franchise you lose you're CQI and I think maybe they lost some consistency here. Not all Bareburgers are created equal, but, let's be clear Bareburger is still awesome. From the spicy pickle spears, to the delicious blueberry soda to (of course) the massive burgers each bite is so good. This is one of the few places that can do justice to a fried chicken sandwich, plus their sauces are really good. I'm a fan of the habanero sauce.", "author": "Sam T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-27", "description": "I'll preface my review by saying that I have not eaten at a bareburger in about a year and this was my first trip to this location. I was disappointed to find out that they no longer have the lamb burger (which was tasty) - but that's not going to influence my rating.  I'm not sure if it's just me but I feel like the taste and quality of the food at bareburger is on the decline. \n\nI ordered a turkey burger and a side of regular fries. The turkey burger was ho-hum and looked and tasted like a frozen patty I could get from any supermarket. It may have been organic but that was about it. The fries came out lukewarm and so lost several points there. All in all, I felt not up to the standard and quality I remember from bare burger. I will say that the last time I was there (last year), I was disappointed as well but I thought it may have been an off-day. But, after this experience, I'm giving on all bareburgers.", "author": "Amaya L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Tasty vegetarian options, sauces, and drinks. Highly recommend you stop by.", "author": "Amy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "I ordered the Fire Quacker last week and not only is the presentation of the meal looks nice, the taste of the burger was great and those sweet potato fries are a bit better than Black Tap fries. I guess it's where they get the source from. The server was very friendly and the place was very clean", "author": "Kenny V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-09", "description": "I really wanted a big juicy burger and thought I'd get one from Bareburger. I placed a delivery order for a regular Hamburger with bacon and fries. \n\nThe burger was far too cooked and tasteless. The bacon was not proper bacon... it was Canadian bacon (i got nothing against the canadians, i swear). The fries were also extremely disappointing. \n\nI ended up ordering the next night from another burger place nearby and was much much much happier.", "author": "cary s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-08", "description": "During 2014 I attempted going gluten free and this was my go to option for eating out. The food is fresh and offers healthy options without compromising taste.\n\nI love the options for burger toppings, sauces, and buns. The tapioca bun is great if you are gluten free. The onion rings and fries are amazing here. I love that the fries come with a variety of different dips. \n\nI give this location 3 starts due to the lack of organization within the restaurant. I have visited this location many times and the same mistakes always happen. At this point it is a given that some mistake or issue will occur within the meal.\n\nThe first visit my boyfriend and I ever made, we ordered burgers and an onion ring / fry sampler. The burgers came out first and were placed on the table by a kitchen worker. The burgers came without the sampler order we had originally placed. Our waitress was out of site and so we began eating the burger. My boyfriend and I had actually finished eating and had time to chat and catch up on our work weeks, etc. when another kitchen worker came and delivered the sampler we had originally ordered. At this point we really didn't even want the fries and onion rings. When we spoke to the waitress she apologized for the food coming out separate. We went about the night thinking the restaurant was busy and this was just a fluke. \n\nUnfortunately after many returned trips to this location, the same events would constantly take place. We would even stress to the waitress that we would like our fries at the same time as our burgers and yet this was just too much to ask for. \n\nIf you are in the mood for something sweet the milkshakes are great also. Just hope they don't run out of the flavor ice cream you ordered halfway through making your shake lol. Oddly enough this has happened to me also.", "author": "C. Marie .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "Ordered the hot chicken sandwich and absolutely loved the hot chicken... However, was not such a fan of the pineapple relish accompaniment as I believe the sweet taste took away from the hot chicken. Would definitely order again minus the pineapple.", "author": "Reena P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-20", "description": "My boyfriend and I have been to 3 other Bareburger locations, so we were surprised when we found one right near Trader Joe's. I have to say right off the bat that the food was great, as usual - my 3 star review has nothing to do with that.\n\nWe came here on a Saturday and we knew it would be busy - and it was. That being said, we were seated at the bar right away, though the service from there on was just OK.\n\nAlso, be forewarned if you come here on a weekend, you will be subjected to screaming children. Just when one would quiet down, another would start wailing. Not once did we have a child NOT crying about something during our meal. I know that Bareburger themselves can't control this, but its something worth noting if you do plan to come on a weekend.", "author": "Victoria K."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}