{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "Very good selection of burgers.  Once you're over the shake shack burger crazy, come here for a more adventurous burger.  Also, very tasty Bloody Mary, slightly different, but very tasty.", "author": "Bryan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "Food you can feel good about eating! Everything here is organic and fresh. The restaurant is also environmentally conscious and responsible. Yay Bareburger! \n\nI really like the Classic Burger with beef, brioche bun, garlic dill pickle chips, sweet apple grilled onions, ketchup. And here's the biggest secret about Bareburger - everything and I mean everything tastes AWESOME with the special sauce. I get it on the side and I dip my onion rings, fries, and burger into it. The sauce  just makes everything delicious. \n\nIf you live near Brooklyn heights - know that they also deliver. How great is that?!", "author": "David Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-20", "description": "I ordered the classic burger and fries. Burger was thick, Fries were ok. I didn't really enjoy the burger. I think five guys and shake shack makes a better burger. And it was expensive. If it was good it would be worth it. I may order a turkey burger in the future. Maybe the other types of burgers are better.", "author": "Beverly R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-21", "description": "I've been to Bareburger many times throughout the city. I used to love it. The past three times I went to this location and have found it to be mediocre. I don't know if it's this location or what, but from reviews compared to other locations I'm thinking it might just be the case.", "author": "Juju J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "I really wanted to give Bareburger that fifth star.  I'm a huge fan of their high quality organic products and their philosophy on food.  I went here tonight with my boyfriend and both of us ordered our burgers medium well, but they came out pretty rare.  Luckily, neither of us are very picky, and we enjoyed the burgers nonetheless.  The food is really fresh and you can tell that you are getting good ingredients.  I had the Roadhouse and my boyfriend had the Big Blue Bacon, both were really good and had just the right amount of extras... I actually liked my boyfriend's burger better than my own.  The fries were also really yummy, nothing extra special or different about them though.  Service was fine, nothing special there either.  Definitely enjoyed my meal here, and the organic products will keep me coming back.  Just hoping they cook my burger a little longer next time.", "author": "Kristina D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-02", "description": "This is a review that is only marginally about the food, service, and other aspects normally associated with a restaurant review.\n\nI went to BB the first week it opened at lunchtime, and ordered an Elk burger, rare, with a side of fries.   The meat was good and lean, flavorful, the whole grain bun was excellent, lettuce, etc, crisp and fresh:  my only complaint was that the whole thing was tall enough to be difficult to get a bite out of, even after the obligatory open palm technique applied to the top of the bun to compress it all.\n\nFries were good, though a little overdone.  So why the two stars?\n\nOK, I've only been in Cobble Hill/Boerum Hill 20 years, but I still felt like I was betraying the 'hood by eating there, enduring the stares of regular folks walking by.  The homey 'bare' wood decor, the slightly-manically-eager-to-please youngster waitstaff, the haute-fast-food menu with yer choice of bun/meat/fixins/greens/ideology in myriad combos . . . .\n\nThis restaurant is almost the Platonic opposite of \"authentic,\" however you choose to define it, despite -- or perhaps because of -- its lavish efforts to appear \"authentic.\"  I could have been anywhere from Darien, CT to Stanford, CA for all the well-heeled, mostly white intelligentsia faces around me happily enjoying their organic burgers.  There is absolutely no connection to the neighborhood, no individuality, no personality, no spirit.  Even other yuppie spots like Moo Burger, Burger on Smith, and 282 offer more sense of place.\n\nIs Bare Burger just one more step in the gentrification of BoCoCa (God, how I hate that acronym)?  Sure.  Is it one step too far for me?  Definitely.  I will not be back.", "author": "James F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "Love this place, the setting, the service, the food everything is fun , and food is tasty with great variety of flavors,meats,breads,and ingredients that makes a burger tasty. Fresh food, and friendly service, street parking is a hassle on busy days though, but not that big of a deal.", "author": "MJ A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-05", "description": "We had such high expectations and all of our meals ranged from okay to bad.  The burgers were bland, onion rings are heavily battered so with the first bite the onion separates from the coating.  Had the spiked slushie, it seems that someone forgot to add alcohol.  Someone dropped the ball on this one.  No one in our party will go back.", "author": "Mathilde C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "Though Bareburger is a chain, they make delicious burgers nonetheless. This location doesn't disappoint in its burgers. I had the Roadhouse Burger with Bison, and it was incredible. The portions are sizable too, though perhaps maybe a little disappointing for some that fries (or any side) doesn't come with the meal. Also, the Peanut Butter milkshake is a must if you like PB. Few things are more delicious than their PB milkshake. I like the ability to customize burgers at Bareburger, though it can get pretty pricey quickly for a burger. I will definitely be back to try the different selections of meat!", "author": "Melody O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "Love love love. Nothing bad to say about this place. The bar is a cool addition to grab a beer or glass of wine while you wait for your take out.The food has been yummy each time i've been there. Love the basket of onion rings and french fries. The staff for a burger joint is happy and well versed in their menu.", "author": "Lori G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-28", "description": "I've ordered takeout a couple of times, but this visit I had the pleasure of eating in.  Plenty of people watching this side of town, and the location is perfect (right across the street from Trader Joe's).  \nOur server , Mitch was really cool and I could tell he knew his stuff.  He started off with drinks, asking if we preferred beer or cocktails.  My friend and I both wanted the Ommegang.  As he regretfully informed us that they were out, he offered a bunch of other options, incorporating ginger beer and ciders into the mix.  I went with the Crabbie's ginger beer, which was slightly on the sweet side with a touch of lemon.....fabulous.  So fabulous I added 3 more slices of lemon!  My friend ordered the pear cider, which she said was fab as well.  I had my heart set on the Supreme, and of course Mitch suggested I try it with on overeasy egg and came in a wrap.  My friend ordered the Maui Wowie and we shared onion rings/fries combo with 4 sauces (curry ketchup, smokehouse bbq, special sauce and paprika mayo).  Burgers were cooked perfectly! They didn't stand a chance!  I found that the burger wasn't seasoned at all, which was bittersweet for me.  Bitter because even though I could taste the freshness of the meat, salt and pepper would have taken it to the next level and sweet because when I laced it with ketchup which helped. \nI did find at one point the service had slowed down, but I didn't mind.....that just gave my friend and I a chance to catch up on old times.", "author": "Ava H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-02", "description": "Fine if you like very big juicy burgers. Bun was not great. Way way to much choice betrays a lack of confidence in core offering. Meat had great provenance. Great for families with young children and fans of Mumford and Sons. \n\nProbably worth walking to shake shack though. I regret not doing so.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "Not only is bare burger all organic and all natural, but it also has really amazing gluten free options. The staff is super tentative and well informed (some of which are amazing and ridiculously good looking). They have awesome meat such as bison and ostrich and elk! Holy shot hit this place up for any reason.... Also short haired blond chick behind the bar ain't nothing to sneeze at!!!", "author": "Twiz R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-31", "description": "I kept hearing about this place from a friend who raved, raved, raved about it and came up on it unexpectedly yesterday. It was around 3 in the afternoon, so it wasn't crowded at all. The hostess at the door greeted me with a smile and I thought, \"Oh, she's adorable. I feel good about what's about to go down.\" Sadly, I was wrong. When will I ever learn about snap judgements?!\n\nI sat down and the hostess gave me the free bottle of water with the flip cap thing on top. Unique, yet it didn't save the rest of the meal. I ordered a Big Blue Bacon with a half vanilla/half chocolate shake. No fries or onion rings because I found the prices for them a bit high for my liking. So the waiter takes my order and I chill out for a bit, watching the TV that was blasting Cartoon Network (hey, I'm totally down for Cartoon Network anytime.) \n\nA few minutes later, another waiter comes by with my milkshake which was a decent size for it's price, the 12 ouncer. I got it in a glass rimmed with chocolate syrup which was cute and the metal cup so I can have the entire shake. Now I'm excited because food's coming! Alas, that excitement was not meant to last long. My burger comes out a few minutes later, looking good with its metal skewer stuck in it. I take a bite and... it falls flat. There's a lot of toppings on the burger, as least that's what the menu claims, but I didn't see much more than a single chunk of blue cheese on it. There's bacon, thickly cut that made it a bit difficult to bite through with the rest of the burger (Am I really complaining about bacon?) The bacon marmalade... it was there. The fried onions were there, but couldn't really be tasted (do they salt them after it comes out of the fryer?) There were a couple of mushrooms. The worst part of all was the burger itself, the beef patty. The waiter recommended I get it done medium which I did, but it was dry and tasteless. It felt like all those toppings were there to distract me from the fact the meat was underseasoned and dry. It didn't work. I could taste the failure in my mouth. It was sadness on a bun and I ate it pretty slowly because I feel like damn, I ordered this pricy burger, now I have to eat it even if I don't like it because it's wasting food and all those cute little free range cows went into this. Towards the end, I just pulled off the bun and toppings and slathered ketchup on the meat so I could find it edible enough to finish.\n\nThe waiter never checked in on me to see if I was doing okay or if my meal was to my liking. He only popped back around to take my tray and give me my check. It came up to $18 and some change for a meal of tears which is too much for me. Maybe if I sprinkled some salt on the burger I would have at least enjoyed it more, but I couldn't figure out whether that shaker next to the pepper was brown salt or really big crystals of brown sugar.\n\nAll in all, not worth spending my money there again. The second star is for the shake which I did like, but I went there for the burger experience and left with nothing but a lighter wallet. Oh, and maybe one less friend for hyping this place up.\n\nSide note: I was tickled at seeing one of the cooks come in with a pizza for his lunch. Some people might take this as a sign that even the cooks won't eat their own food. Luckily, I'm not some people (Maybe he's sick of burgers?)", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-29", "description": "Nice atmosphere in a hipster way. Not impressed with the burger--I think I got bison? Was dry and tough, didn't finish half of it.", "author": "Maryanne C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-16", "description": "Was in the area and saw baregurger and decided to give it a try. Service was great and very helpful I can be a pain and ask a lot of questions the server was very informative and understanding. The menu was a little big lots of options and variety to every burger so I needed a bit of time to figure out what I wanted to order. I got a cocktail the ginberry was a little disappointed it didn't have any flavor but looked very nice in the glass. My server recommended the dried pickle chips they were very good breaded nicely and the Thai chilli dipping sauce was awesome. The buttermilk ranch dipping sauce was lacking flavor. The great thing about the pickles were they were seasoned very well so they didn't really need the other sauce. For my burger I got the western recommended with the bison so I went for it. It started off really good the fried pickle spears were amazing that were on top the burger but I proceeded to eat the burger it was bland the flavors just weren't there. The thing that bothered me is they had a lot on the burger that could have given it a lot of flavor. The barbecue sauce was week I couldn't taste it i just saw it drip onto my plate that's the only way I knew it was there the purple slaw no flavor just red cabbage no dressing no acid or vinegar on it what a miss. The bacon was crispy but again no flavor and the bison which was recommended for this burger was slightly over cooked which is fine i ordered medium rare got medium which I'm ok with but no taste to the meat all in all the food just lacked seasoning. The brioche bun was nice a soft i really enjoyed but it's not good if the only enjoyable thing about a burger was the bun and the garnish. All in all I may come back here for a happy hour to get a snack if I'm in the area but that's about it.", "author": "Steven F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "I ordered from them a couple of times but the real kicker is going there. The interior is warm and hip. The onion rings are crisper when eating in, the burgers fresher. The big blue with bison is a treat and don't forget to order these onion rings. They come with 4 delicious sauces. All their meats are grass fed, hormone free and raised humane. Organic has never been that good...", "author": "J F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-06", "description": "Ordering from here was the worst restaurant experience I have had in recent memory. Not only did it take over 2 hours (we didn't get our food until almost 11pm), but they misprinted my address resulting in the delivery guy being further delayed (I didn't speak enough Spanish to properly direct him). On top of that, our order was completely wrong, cold, and not very good. All of their fried sides were mushy and flavorless, including the fries. On top of that, my stomach has been hurting for hours since eating it.", "author": "Brett S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "A friend turned me on to this place. So when I miss them I eat here. The burgers are good. And there is a nice variety of meats. I really like the fries with dipping sauces. And the jars of pickles are yummy. Come here on an empty stomach because you will leave with a food baby.", "author": "Deb W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "Extremely fresh food.  Extensive menu.  Outstanding Service.  Cozy.  Try the Milkshake...it brings all the boys to the yard.", "author": "Grand B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}