{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-21", "description": "Food is not as good as Manhattan locations. Servers are not friendly by any means. Atmosphere is lacking.", "author": "Jordan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "hands down, my favorite new go to dinner spot. Service is great, food is delicious, drinks are cheap, and they offer outside seating. \n\nI know this is a burger place (and the burgers are awesome) but I wholeheartedly recommend the salads for anyone interested in a lighter or vegetarian option - my favorite being the Mexican Salad - delicious. Sides are also great - try the spicy pickles or the fried pickles if you're craving some salt.", "author": "Mary M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-10", "description": "Still an amazing lunch option in my work hood.  I had the Big Blue Bacon Burger but with Wild Boar this time. It was super tasty, but I would definitely choose a different meat to try next time. The boar was a bit too strong in flavor for all the other additions to the burger, but didn't ruin it at all. I also had the onion rings which were perfectly cooked and we tried the sweet potato fries which were a new addition to the menu. These fries were amazing and the best I have ever had. Prices are a bit steep for a lunch, but definitely a treat meal at its finest!  I will be back again and again!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "We ordered burgers online and they came within the hour. Very good. My mom's gluten-free, and they have gluten free buns. I'm sold.", "author": "Jasmine N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "I've been here about a dozen or so times.  Generally great service and friendly staff.  Wonderful menu but I'd stay away from funky meat--the regular beef is fantastic and so are the chicken options.  Love going here!", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-04", "description": "Online order experience-\nHad a few good dining experiences at different Bareburger's around nyc. Tonight I figured I would try ordering online, big mistake. The estimated delivery time was between 40-60mins. I Actually waited over an hour and forty minutes, but  because of the weather figured they may be busy. Deal breaker was getting two out of the three items ordered, and also receiving those two items cold. Did not bother calling to complain because I rather spare a delivery guy a trip In this weather then to just receive the side order cold anyway.  \n  Besides all that, the burger seemed to be cooked as ordered and the sweet potato croqs were delicious! Definitely try the bacon marmalade!\n\n2 stars for delivery. Closer to 4 stars dining-in.", "author": "Erik d."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-07", "description": "I ordered a turkey burger and a salad. For some reason, I  received a salad with a turkey patty on it. Ok, fine. It was not good though. It was bland and tasteless. I did not want to complain as the waitress was so sweet. Was that wrong?", "author": "Patale M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "Went for lunch during the week and had the lunch special, which wasn't even advertised on the menu but was in the window. So the waiter was like oh ok yeah we can still do that and kindly took our order for that. Apparently the lunch special ends at 2 pm. It is the original burger with choice of salad or fries and a drink for $11.95 I think and you can also get a beer for another $3. Not a bad deal. The burger was perfect and the salad was very fresh and delicious. News flash!!! The burgers are better than Moo Burger down the road in case you are wondering! Competition!!! \n\nService was great, the hostess was lovely and the waiter was really nice. Will recommend to everyone \u0026 will go for brunch soon.", "author": "Julie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-23", "description": "I've been happy with everything I've ordered from here. The \"Original\" is right up my alley. I like the sliders a lot and wish they would offer more of their big burgers that way. Planning to try some of the more exotic meats someday but beef and bison keep me coming back for now.", "author": "Marcos L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "Mtch was a great server, The food was fresh and Delicious. I love the fact that it catered to someone like me who is gluten free. Really great spot with delicious food!", "author": "Fanesha F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-05", "description": "We love this place and the food, but one major problem....no good bottled beers!! Patrons are stuck ordering draft, and they are usually WARM! This place really misses the boat on an ICE COLD BEER AND A GREAT BURGER. Food and idea of this place is great, but come on...beer menu really needs an update.", "author": "John F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-22", "description": "2/12/17\nReturn? - No. Bad food, bad drink and bad service\nAtmosphere (3) - Chain FF\nFood (2) - Burger (2 - ok taste but microscopic size), fries (3), short rib sliders (2+ - ho hum)\nDrinks - 2 bloodies (-5 the absolute worst I've ever had and i've had ALOT. The only explanation I can muster is that they ran out of mix and vodka. It tasted like tainted water. Very odd)\nService (2) - Never saw her again after the food was served and it was only 20% full. \nTab - $44.25 before tax/tip\n\n7/22/13\nI've walked by here a million times and it is always packed which surprised me because it seemed like a run of the mill burger joint. Finally stopped in last week and had the beet salad. It looked good but it turned out to be pretty tasteless. The decor is uninspiringly chain-like but the young hipsterish staff is very friendly and attentive. I'll probably give it another shot but only because it is close to home. Tab was $12.50 before tax/tip", "author": "Will S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-01", "description": "Tried to order delivery here a couple of weeks ago, 'try' being the operative word. I live several blocks down Court Street, and it would have taken at least 30 minutes or at best, 45 minutes to get here. The g uy who answered the phone said I needed to call another location, vaguely suggesting '7th Avenue'.  I was rather incredulous, telling him \"in Brooklyn?\" \"No, in Manhattan\". Can't really say that I got delivery after that exchange. Next time, try hiring people who do not have attitude or actually know the area they work in.", "author": "Pas E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-07", "description": "The salad comprised 1/3 wrinkled old arugula, overbearing balsamic vinegar, and paltry amount of sliced beets whose taste is lost either because it was never there from a can or drowned in that balsamic vinegar. If I pay $8 before tips and taxes for a small salad, I should expect something slightly superior to a McDonald's manufactured quasi-food.", "author": "Jaime L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-29", "description": "Fries were just ok.  I went to try the burgers.  I have a friend who claims to be a burger expert.  I am sure he would like this place.  I think it is just ok.", "author": "Ji-eun L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-26", "description": "they replaced the chicken breast sandwiches with chicken thigh. so gross...fatty, tough and way less healthy! plus no mention of the switch on the menu? very shady! no thank you. bad move, bareburger...this sort of thing goes against what we've come to expect from you! wont be returning until they switch back.", "author": "Lizz K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-26", "description": "While I love their food the delivery has gone downhill. I ordered tonight at 7:06 PM, the estimate was longer than usual (70-80 minutes) for delivery but figured not a big deal. Just hung up because they were 30 minutes past the original window and our order isn't even out for delivery yet. Going on two hours for a salad and chicken fingers isn't just bad... it's horrendous. When I called they explained delivery orders were super busy; my philosophy at that point is stop taking delivery if it's going to be 2+ hours for dinner that's just going to end badly for all involved. If I were in the restaurant and that were the wait for my dinner I would have had a server explain and/or they would stop seating folks If you want delivery to be a part of your business model you need to remember you are in the service industry and the money we spend is just the same as if we were eating at your establishment. So bad.", "author": "Donna H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "To be honest, the food here was really great.  It was probably a top 10 burger that I've ever had.  The downside: it was really expensive.  I got the Big Blue Bacon Burger with Ostrich meat, which on the menu said $12.00.  Be careful though, because a switch of meat will raise the price of the item, it said below, but was a little less clear than it should have been.  I ended up paying $19.00 and received a burger with ostrich, bacon, blue cheese, sauteed mushrooms, and fried onions.  Also, I asked for the burger medium rare, and goddamn, it was a perfect medium rare.\n\nOverall: Awesome burger, overpriced", "author": "Ian F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-26", "description": "This burger joint is AMAZING! I love that everything is organic- from the meat selections to the juices and teas. The menu is HUGE, its hard to make a choice. I've tried the \"Hunger Bear\" breakfast. It had carrot cake french toast!!! It was delicious. The service has always been good. When I went on Sunday, I had to wait like 10 minutes outside. I returned on a Saturday and I was seated immediately. The second time I went I had the Western Burger on bison. The fried pickles were great and seasoned well. The waiter at the bar was friendly and gave great suggestions.", "author": "Fay A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "The host was really nice. But sadly the food was disappointing. The burgers didn't have any flavor. We ordered the country bacon with beef and the Mediterranean with beef.  The country bacon is supposed to come with bacon(we found none) and sharp cheddar.  It might have been there but the taste was not discernible. I am not writing this place off b/c I know they are new but they need  to step up their game. Also we complained about the lack of bacon and they comped our drinks and brought out bacon. I think for the nabe the price is ok. It can add up if you add things.", "author": "rekha m."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}