{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-26", "description": "The real star of Bare Burger is not its burgers. While they have good ones (try the Elk meat just for the experience of it), the real star are its fries, especially the sweet potato fries.\n\nThe sweet potato fries were cooked perfectly and generous in serving size - good for two people. And, it comes with 3 dips. One being organic ketchup - while healthy, was a bit too sour for me. The other 2 dips were great.\n\nService is always cool and friendly although it can get a little slow when the place gets really busy and slammed with people. Just like any place. Especially, when they seem to be the hottest burger place right now in Downtown Brooklyn (close to Trader Joes, along Court Street).\n\nThe interior design is casual lodge in feel but with wood done in the Brooklyn way - hip, casual, artsy, unpretentious and sexy.\n\nOverall, while on the above average price side, I've never been disappointed every time I come here.", "author": "Kristian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "Gourmet burger place at its best! The movement towards organic and fair trade burger places really are making for great food.\n\nGot the Western with bison and the Supreme with beef. Both were solid burgers. At first, I thought the size was bordering on the small side, but by the end of the meal, I was pretty full. Also, the cornmeal crusted spicy pickle spears were a good surprise. I don't normally like pickles that much, but these were yummy.\n\nService was good, and the decor was cool. This location, though, felt a little cramped (not sure about the other ones). However, overall, it makes for a good burger joint. Have to come back and sample their shakes, though. That's really the true test for me haha.", "author": "Hector D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "OMG - I love this place! All I wanted was a nice juicy burger. And yes the burger was juicy and good.............. I had it with a side salad - but when I tasted the sweet potato fries - I fell in love.\n\nIt was a quick lunch with a friend but I must go back!........", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-09", "description": "We came here for the 4th of July to grab dinner and then came back right before closing to grab dessert. The sweet potato croquettes are delish (when served hot, as it was that day) but if it's really busy and the food isn't served right away chances are you'll get them cold. Cold sweet potato croquettes aren't that great, so just make sure you tell your seder you want it hot!\n\nAs for the rest of the meal - neither my bf or myself enjoyed the dessert so I would say stick to sampling what they do best (meals). Also, there's only one bathroom so my boyfriend had to stand in line for about 20 - 25 mins both times he went (dinner and later for dessert). Make sure you relieve yourself BEFORE you sit down to eat otherwise you could be waiting for quite some time.\n\nI have to say though, the host/greeter was very friendly and cheery at the end of what must have been a very loooong night. \n\nCons - we did have to wait about 30 mins to be seated for dinner, but that's because everyone was in the area to see the fireworks. Still though, parking around this area is not for the faint of heart, especially with trader joe's around the corner. Be prepared to sit and stake out.", "author": "Camille H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-17", "description": "Attempted to dine by myself today during lunch hour. I waited over 15 mins, tables were being clean from a couple that just left and that's the only time I saw the waitress since I was given a menu. Didn't even get a glass of water. I got her attention and told her I wasn't interested anymore as she had me waiting way too long, her response \"oh ok\". I felt like I just experienced some form of prejudice to be honest. Had I looked \"more important\" I'm sure I wouldn't have been treated with scant disregard. I've been to other locations and the service is usually on point. My first of such experiences as a new migrant to NYC...disappointed.", "author": "Lily A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-29", "description": "Ordered for delivery when I was home sick- didn't call when they were out of onion rings, just didn't send the fries/onion rings order at all. So all that arrived was a measly salad and soda. Why would I order from a burger place if the 'healthy' option isn't coming with the side of fries/onion rings? I could have gotten a salad from anywhere else in that case. Then, when my partner and I opened the food... the first thing we did was pull a long dark hair out of the salad. It was standing out right beneath the lid, wrapped up with romaine. So gross. They only refunded the salad and missing fries. Wtf. Like, make up in some more meaningful way for the disappointing and disgusting experience we had.", "author": "Michele K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Being in Brooklyn NY, it's a must to find Bareburger on Court street. A fun place to eat. You can build your own hamburger , choosing from a variety of buns, beef, chicken ? I love the Buckaroo burger here, smoked brisket , cheddar cheese, onion ring on Brioche bun and a glass of ice tea...Life couldn't be better than this...\nThe Farmstead also one of my favorite here, sweet potatoes, wild rice , baby kale , avocado....Simply Delicious !!!", "author": "TH B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-04", "description": "Beware. We placed an online order for delivery that never arrived.  When we called, they explained that there is a flaw in their system whereby many online orders are not received. Basically, we waited around for an order that was never going to come. The manager was like \"oh well, sh-t happens.\"  First and last time I will try this place.", "author": "John D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "I ordered the chicken fingers and asked on the order to include honey mustard, if they had it, in addition to the included sauces. It arrived cold, with no sauces and five packets of regular mustard. I had overtipped the delivery guy and they offered me a $2 refund for \"their mistake.\" Second time in a row they missed something for $15 order of chicken fingers- order from somewhere else.", "author": "Andrea S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-28", "description": "Did this place get better or what? I wasn't in the mood for a burger but I did have the fried chicken sandwich which was amazing. My friend had the fire quacker burger which was also very good. Everything was fresh, and service was great as well! I'll definitely be back soon.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "Burger was great! I got the Buckaroo and loved all the blood! Such a juicy delight :) My BF created his own and got a bison burger with alfalfa sprouts which I think were a bit much but he loved them. We shared a basket of fries \u0026 rings and that was enough for us! We kind of had trouble finishing it once the burgers came. \n\nAlso, we ordered drinks. I got the margarita and he got the manhattan. Meh. Wasnt the best libation. I'd skip the drinks and just bite into a burger!", "author": "Kristen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "I really enjoy the quality and freshness of the burgers the new menu is awesome the price is pricey but for good food its worth it.!!!", "author": "Miikeila H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "Tired of that stuck-up suburban mommy treating you like the anti-Christ because you suggested a 'common burger joint' and you were shockingly ignorant that she insists on her family only eating kosher, halal, all-natural, gluten-free, organic food? Ready to shove that \"it's a pity NYC can't provide ethical food\" 'tude down her throat? Well, folks, the answer may be Bareburger.\n\nPretty much everything on and OFF the menu - down to the napkins, tables, and cutlery... is natural, organic, or recycled. It is a ridiculous level of ethical eating that is guaranteed to slap the smugness right off your frenemy's face. And there is nothing quite so enjoyable as savoring a tasty burger while forcing someone else to eat crow. :)\n\nAnd the food is actually pretty good, too. They have a wide array of burger (and more exotic) options to suit most tastes. The only problem is Bareburger is very popular... so you can expect a crowd and a bit of a wait whenever you go.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "Great food, great location and great cocktails! I would suggest the Buffalo Chicken sandwich and the Brooklyn's Cup cocktail was yummy!", "author": "Alicia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "You wouldn't think a place with \"burger\" in the name would be as vegetarian friendly as it is, but they have three different veggie burger options: portabello mushroom, black bean patty and quinoa veggie.\nI got what sounded like the most hippie thing ever, a quinoa patty wrapped in collard green leaves, and it turned out to be so delicious, so satisfying, great texture. Maybe one of my favorite veggie burgers ever.\nSeveral reviewers have complained about the service, and we've had the slow and disinterested table service experience, too. But when we've sat at the bar, it's totally different. Attentive, friendly, welcoming. I'd love to sit outside and enjoy their cafe vibe but the bar seems where it's at, maybe because that's where you find their excellent manager David working.\nAnd don't miss the Kelvin slushy drinks. Frozen dark and stormy? Oh yes!", "author": "Colleen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Never heard of this place. So I went in just to have a burger. Wow the best beef burger I ever tasted  5 stars for sure", "author": "Tommy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-15", "description": "3.5 stars...\n\nI love Bareburger and was excited to see them open a location in my neighborhood. The prices are a tad high but they have some of the best burgers in the city and plenty of options for meat and toppings to keep you satisfied. They have hands down the best onion rings. They have a small but interesting selection of microbrews at very reasonable prices. The only reason I rounded down is because I've been here twice or get the fried pickles I've loved from their other locations but they always seem to mess them up here. They've consistently arrived cold and/or soggy, no bueno when you're paying a premium for a side of them.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-26", "description": "I enjoyed a Western Elk burger medium, on the tapioca rice bun--though medium rare is probably better for elk since its so lean. It was delicious! \nWe tried the bacon marmalade, and while it was heavenly in its smokey goodness we really couldn't put it on fries. \nApple walnut salad was pure bliss!! I love that you can make a salad into a wrap! \nSmoked mozzarella beef burger was also great! \nKara was a great server! She noticed our drinks were wrong without even having to ask! \nTen minute wait on a Friday evening was nothing to complain about.", "author": "Vito P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Went here with my partner, a real carnivore and burger aficionado, and was surprised to find that in addition to its meat-based burgers Bareburger also offers a variety of fully plant-based entrées. These are thoughtfully developed and delicious--not the pile of wilting iceberg lettuce you might expect to find as the veggie option at a burger joint. It was so great to find a place that could satisfy us both (particularly when many places don't even bother with plant-only foods).", "author": "Wes J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "If you want horrible service and a rude hostess this is the place for you. If you are looking for the bareburger experience then this is not the location for you. I've been to many other locations in the area and this one just has uncaring staff which I thought was not the bareburger way. Sad.", "author": "Joel J."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}