{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-23", "description": "Came here for an impossible burger. Ordered fries, a burger, and a shake. The shake was horrible. Had chucks of stuff in it including an entire half of a frozen banana which wasn't blended. I told my waiter and he just shrugged it off. No customer service there. The burger was falling apart way too much and too soon. The fries were okay. At most the experience was blah and definitely not worth the $35 dollars for the stuff I ordered. Definitely wasted my time and money here.", "author": "Rose C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-28", "description": "This is just one location of the many Bareburgers around NYC. I visited with a friend of mine around 3pm. It wasn't super crowded. They had the outside tables available cause the weather was nice but me and my friend decided to stay indoors. The waitress was prompt in taking our order. She also answered some questions I had about the menu items. I made my own burger with the beef, brisket, onions, cheddar, and smoke sauce on brioche. The burger was tasty but it could have been a bit moister. Paying the bill was a breeze cause they use an i-phone I believe, and eco-friendly. I had the option to have my email sent to me via text or email to save paper :). Nice place to have in the neighborhood.", "author": "Kiara N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "Service here is always good! This location is near the UA Court St Regal theater, transit museum, court house and etc which makes it perfect for such a heavily trafficked area. There is outdoor and indoor seating with various types of seating areas for indoors (bar, high chair, and bench seating). The food is fresh and flavorful. To my knowledge their are various sauces in different burger and sandwich combinations so be mindful before adding condiments to them which can make it overwhelming. I love their onion rings and fries and their condiments are original and taste great. They also have great sundaes which are large and shareable (I suggest saving room for dessert especially if you plan to eat one alone). I notice a lot of families come here but it's never crowded; I would imagine this would be the case at the Park Slope location as there is a school located across the street.", "author": "Naomi T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "I came here before a show at the Barclays. We sat at the bar until our table was ready. They are very welcoming and attentive. They have so many healthy options of burgers. The portions are enormous..you can def. share a burger \u0026 fries. The drinks were great with a kick. \nIf you are a dig healthy options this is the place for you. \nP.S. Prices are friendly for the portion size", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "The burgers are just okay. I also had asked if I can take a menu to go and they wouldn't give me one, which probably costs nothing more than a few cents to print.   The guy suggested that I take a picture.  I mentioned that I'm bringing the menu back to someone that is bed ridden and a picture would not work under the circumstances.   He still wouldn't part with the two cent printed menu.  SERIOUSLY?????????       HORRIBLE!!!!!!!!!!!!  Never going back to this dump.", "author": "Joe R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-03", "description": "Standard bareburger with friendly service and cartoons on the tvs in the back (one of my favorite things about this chain...I mean, I can get a milkshake while watching cartoons?! perfect.)\nThis is not my favorite location, maybe because it's kinda cramped, but they have the vibe you expect from this chain and I'm pretty sure the menus are the same at all locations.\nEither way, not a bad option if you want a burger or sandwich made with not so sketchy ingredients.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "I love the burgers at Bareburger, I enjoy the fact that the meats are always fresh and you can create whatever you want. I'm not sure why some folks gave them some bad reviews: But i'm a huge fan and i can't get enough .Bareburger is a solid 4 stars due to its selection of meats and freshness. Think of it as the healthier option depending on what you decide to add on.\n\nToday I decided to get the wild boar burger with bacon, onions, dill pickles wrapped in collard greens. My girlfriend ordered the same except she wrapped it with lettuce. Both burgers were made just right not to dry and not too red. The only gripe I had was that the Brussel sprout slaw needs to be removed from the menu. It's probably the worst item they have as a side. The staff is always friendly at the court street location..", "author": "Edgar B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-24", "description": "A while ago it would've been a 5 star review.... now a days it's dropping by the day.\nService is still good and timely.\nPortions were cut in half... I would rather they raise their price than to have to order double the food.\n\nThe only thing that made me actually put a review  here is an order of fries.\nA large order that I have gotten in the past...\nThey put it in a large container and it's half empy... no joke- half empty. Might as well put it in a small sized container where the fries would've fit perfectly.\nAlso had to pay extra to get 2oz of sauce.. blah\n\nCalled to ask if that's normally the size( Hoping they realized it might've been a mistake), \u0026 the person who answers says it was full when he gave it to me.... NOT IMPRESSED....\n\nLove this place to give it no stars but they need to step up their game big time!!!!\n\nWe eat there at least 4-5 times a month. NOT a whole lot but enough to notice how much it changed in the last couple of months.", "author": "Abraham C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-09", "description": "Service was not great. Even though the menu offers vegan options wait staff isn't very informed. We ordered fries to share because the menu said it was vegan. The sauce that came with it clearly wasn't. When I asked the waitress if the sauces were vegan, she responded with another question: \"did you check under sauces?\" Um no, the menu doesn't say your fries come with special sauces. \n\nNot sure why she got defensive immediately when I simply asked if the sauce is vegan. It left a really bad taste in my mouth. We also didn't get cutlery and regular condiment set all the other tables have. \n\nI've had the Guadalupe and Prairie burger at this location (both vegan). Don't get them. It falls apart easily and mushrooms are chewy. Fries are good but beware of the special sauce and non-vegan aioli that comes with.", "author": "Vicky J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-05", "description": "Checked out this spot on July 4th. It was fairly crowded. Got seated \u0026 checked out the menu. The Bison burger leaped out at me. Coupled it with a Springdale Pearly Wit beer \u0026 its goood! My friend grabbed the Bacon Burger. We swapped for a robust experience. You will be pleased! I give 4 stars because our waiter wasn't quite on task. Now go grab a burger!", "author": "Myra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Love the Brussels sprouts! Munching on something healthy today that you may like is hard to find!", "author": "Correy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-19", "description": "The people at the door taking names for seating are very unorganized-very disappointed because they made us feel like they don't care. \nWait time they told us was not accurate. \nWaste of my time.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Excellent service and the menu is interesting.  Good flavor too!!  The fries....mmmm.... excellent!!", "author": "Rosa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Who: moi\nWhat: Souther Caviar Burger\nWhen:  7:15p-ish 2/24/17\nWhere: dine-in burger \u0026 take away salad (free Yelp perk)\nWhy: A snack before Pokémon hunting a BRooklyn Bridge Park \nHow: public transportation\nBathroom: roomy (wheelchair accessible) \nService: Near perfect service. I came with a gift card from a #Dylan'sCandyBar Gal-entine's Day event. I walked in and received immediate seating at the bar. There was only a slight wait for table seating. I ordered a medium well #SoutherCaviar burger as is. It was a nice texture, great temperature and looked pretty appetizing. The burger borderline don the gooey side. I won't likely get pimento cheese the next time. The bread was a nice pairing, and held up well to the thickness of the burger, and the bacon was okay (could've been a bit saltier. I felt more texted than tasted the smiley flavor). Overall, a pretty good snack. With tax it came to $14.10, so...free.99\nBottom line: I would visit again. The service was prompt, the food was tasty, the vibe was relaxed.", "author": "Minah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "Well something new on this wonderful day. The place is very warm and homely and it's always full so it must be good.", "author": "Rodger P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-31", "description": "The service was good . They were paying attention. I felt like the burger by itself for $9-14 was expensive . I ordered the large onion rings and fries , which I regret ($10) it was way too much food for 2 people . And I had the fried chicken honey with brioche bread . I felt the large slice of pineapple disrupted the palate , it was unnecessary . And my chicken did not taste deep fried at all. Still felt a little soggy, which I told the waitress and she just politely dismissed my comment lol . \nMy bill for 2 burgers , 2 drinks ( fountain refillable ) and fries and onion ring came up to $42. I guess that's not a horrible price for 2 people. But it wasn't all that to me . Not sure when I'm returning but I would say go check it out , you might like it !", "author": "Marie Annick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "You guys need to stay open later please.. closing at 10 pm, that too on a Saturday night, is so early. Please close at midnight, 11 PM at least! Thank you :)", "author": "Arafat C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "​I'm sorry .. Wait ... Did this manager / supervisor​ just come​ to my table to tell me that the burger is expensive? Are you sure you can pay for a replacement? Those were some of the comments I received​ during my recent visit to this bareburger location.\n\nBackstory​: My boyfriend and I are frequent visitors​ to this location. We usually stop by before we head to trader joes for our groceries for the week. Recently, we decided to try the \"impossible burger\". Prior to ordering, we asked our waiter details about the burger and if is a good try. She recommended it but assured us that everyone taste buds are different. However, if we didn't​ like it just to let her know. We got our burger. Ehhh.. Wasnt our cup of tea ( maybe yours .. try it !)  We hadn't​ seen our original​ waiter in a while. Another waiter, who was assisting a  table near asked if we were ok. We discussed the burger with him. He was really nice. He mentioned that we could have gotten it a different temperature​  (that wasn't told to us before) Maybe it would of tasted better if it was medium well. Then, he offered to take our burgers and get us a menu for a possible replacement. :: side note:: we were just gonna leave it alone. \n\nSo, he brings our burgers back. I actually was able to hear him talk to his manager (the place is not big.  I heard every word). The manager comes over to the table in the most DEMEANING way. She doesn't​ introduce herself btw.  She begins​ to tell us that the burgers cost money and that we need to be sure what we order next and sure we can pay for it. No lie.. she repeated the same sentence like three-four​ times ( Like we were kids). We told her that were frequent visitors​ and that we really like the food here. She was so rude.  She walked away. Idk .. I looked like I came from work, so did my boyfriend. The atmosphere​ in Bareburger is pretty relaxed sneakers and tees millennial​ spot. I would assume if you saw two dressed up ppl walking into the establishment. You would think these are two young professionals tryna to just get a burger and a drink. :: Kanye shrug:: The comment \"can we pay for it\" was extremely unnecessary​. I suggested to my boyfriend not to order anything else and just get the check and leave. We were uncomfortable at this point. We signed ipad left it on the table and was out the door. \n\nWe understand that there is a cost to the restaurant​ when food is tossed.  However, losing a customer due to customer service should be a concern too.", "author": "Fabine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Good for a local chain.  Nice atmosphere.  Had decent black bean burger (better for the bread and presentation; patty nothing overly special), and shared a basket of onion rings and sweet fries with various sauces, plus diet soda (natural soda, which was delicious).", "author": "Denver N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "This by far my worst experience ever at any venue. Prior to going there on January 19th around 9pm (I'm placing the time and date just so they can correct this matter with the staff), I have been a regular at Bareburger and went there with my girlfriend. So I asked one of the waitresses what her thoughts were on the \"Impossible Burger\" ... she said it is good and that I should try it and if I don't enjoy to let her know. So we ordered it with some fries,  onion rings, and drinks... We weren't too fond of the burger, but we went unbothered by our waitress for over 8-10 minutes... A waiter who was assisting another table came by and asked are we doing okay... we discussed the burger as a sidenote with him and he said he could take it back and get us something else instead, which was nice of him because I was just going to just leave it alone after my bite. So he went to the back and his supervisor (I assume, African- American woman). She spoke to us in the most demeaning way possible stating that the burgers cost money and are we sure we can pay if we order something else. I told her that I'm a frequent here and like the burgers here... She repeated herself three times... at this moment she was being really rude. What shocks me the most is that I had a suit and tie on (coming from late work event) ... that made me wonder, how would she have talked to other customers not dressed up? Although I understand that it a cost to the restaurant when a food is tossed, it's a bigger issue when you lose a customer who will frequently bring income to a restaurant...\n\nThat supervisor was the rudest and most condescending person that I have ever encountered. This is my first time in my life that I have not given a tip. Even in other situations if the food was bad/ or service not that great, I would tip no less than 18% and as high as 30% because I know that is how people make their earnings. So instead of ordering something else, I just handed them my Platinum Amex card (which made the waiter look twice) and told them to give me the bill. I certainly will not return to a place w/ horrible customer service. If I was management there, I would seek if there were other complaints​ about her and place her on probation at the very least.", "author": "Luis A."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}