{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Another bomb evening at this awesome place. This time I opted not for red meat, but for white. So I got the Hot House Chicken Sandwich with wasabi carrot slaw, hot honey and crispy lotus root all on a sprout bun. And I decided to try the sweet potato fries, which complimented my 'wich perfectly. My brother had the cubby fare- his choice of chicken tenders (massive pieces), fries and apples. He thoroughly enjoyed his meal as well. Second time around and I was not disappointed. This is feeling like true love. I'm sure BB and I will have many future adventures. OH, and don't forget to ask for the smokesauce(barbeque sauce). And a plus, my server Yarie was as super sweet as last time. I think being \"bears\" at this place is just impossible. Get it? Anyway... As always, Happy Eating.- Marie-Madeleine Gnagniko.", "author": "Marie-Madeleine G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Bareburger\nNY: Brooklyn: Cobble Hill\n1:15pm Wednesday 1st October 2014\nFour Stars\n\nBrooklyn court was rather slow today so I had to eat lunch in Brooklyn. I decided on bareburger since trader joes looked pretty busy and it was lightly sprinkling out. The food took about 20 minutes to come out. The Maui Wowie with brioche bun, wild boar, country bacon, pineapple, cherry peppers, and buttermilk sauce. The bun was soft and carb-ilicious. The patty was very well done and on the dry side. The pineapple was good but a bit small for the already small size burger.  The country bacon added a nice amount of salt and fat. \n\nThe spicy pickle jar ($2.5) was superb. The pickle juice was clear so I am not sure why it was so deliciously spicy. \n\nOverall it was an enjoyable and timely lunch (45 minutes).", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-11", "description": "Bareburger has become my go to spot before shopping at Trader Joe's on Sundays. (Pro Tip: Never go to Trader Joe's hungry!) Since I've been going for a long time I remember the original menu that was so much better than this condensed menu they have now.\n\nDon't get me wrong, the food is still good but my favorites have been taken off the menu and every-time I go there I shed a little tear. \n\nPlease bring back the sweet potato croquettes! Please! This rating is really based of the newer menu. The selection could be so much better!", "author": "Ayanna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Best burgers in NYC. Build your own or order one of the many prefab options. Cooked perfectly, fresh ingredients, great salads, attentive staff, non-offensive music played at normal volumes, TV playing funky cartoons, what's not to like? I'm here at least once a week. Highly recommended. I", "author": "Stewart J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "I recently started working in the neighborhood and wasn't completely familiar with the eateries in walking distance. So after a long morning of orientation some of the other new teachers  and myself were walking along Court St. looking for a place to grab some grub. This particular area is booming with options but we happened to stumble across Bareburger. I'd read some very positive reviews written by some of my Yelp friends so I knew my colleagues and I were in for a treat. \n\nThis location has comfortable outside seating (my favorite during summer) as well as a fairly large indoor space as well. We of course decided to sit outside. The service was super knowledgable and friendly. They have a wide menu full of salads, sandwiches, burgers, and sides to share. I had the Buttermilk Buffalo. Delicious fried chicken with buffalo sauce and blue cheese. What more could a girl ask for? My sandwich was absolutely delicious! The kind of delicious that you keep thinking about days after. I'm not sure what all the others in my group ordered but I know one girl ordered The Standard. Everyone enjoyed what they had. We all left satisfied and happy. I'll definitely be recommending Bareburger to others especially as a lunch option.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-27", "description": "So the food was great. I chose to \"build my own burger\"- Turkey patty, green hummus, pickled tomatoes, wild mushrooms with lettuce. It was amazing. \n\nHowever, I didn't know that it was table service (it was my first time), so I placed my order then went to sit. When my order came it was in a to-go bag. The server informed me and corrected the situation. Even brought my bag and drink from my table to the bar! Awesome. My complaint is with the guy behind the register. I own a restaurant and I believe he is the night manager. His attitude was very unpleasant. He had an attitude because I was unaware that it was table service. When I finished my meal I brought my food to the counter (after being told it was fine to leave it), I told them that I enjoyed the food and \"it was great.\" The manager did not chime in nor say thank you. He just gave a stare. However, everybody that I saw come in to pick up their order or make an order he exchanged pleasantries. \n\nI was planning on returning to this restaurant after my workout, but I rather not have that experience again. Hopefully, I change my mind because the food was so darn good and fresh. Stay tuned, I guess...", "author": "Shaud R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Really enjoyed the atmosphere from the moment I stepped in the door. I was promptly greeted and seated right away. The service continued as I received my beer; I went with the Queens Lager. Everything to this point was 5 stars in my book but then the food took it to a whole-nother level. The burger I had (El matador) was the best bison I've ever had... And the Macho fries were out of this world. Everything came out so quick, which can be really helpful during lunch hours. Thanks for a killer lunch, I can't wait to bring friends.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-05", "description": "Ugh, horrible!\n\nWe came here based off of some decent reviews from friends. We were quickly seated and an outdoor table. The table was on a ridiculous slant, so the drinks kept sliding off. Pretty quickly, our drink order was taken. 25 minutes passes and no drinks. A new waitress comes up, saying \"sorry for the wait, it was shift change, what can I get for you?\" Excuse me? Didn't I already put in an order? We mentioned we put in a drink order a while ago, and she asked what we ordered since she would probably need to enter the order again. This time we placed our drink and food order together. Waited another 20 minutes and still NO drink and NO waitress to be found. \n\nWe will not be back. Moo Burger is a few blocks away. The service and food is great there. EVERY. SINGLE. TIME. (unlike at Bareburger, apparently).", "author": "Emma W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "Great service and the food was delicious! The environment was relaxing and the food came quick :)", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "I have a simple but stable love for this place.  This is the only location of theirs that Ive been to... But after my first try, about two months ago, Ive been back about five times.  Its one of my regular go-to places, which surprised me since its a chain.\n\nI have found the food to be delicious.  They're putting out simple and reliable products - a variety of burgers, salads, and sides.  \n\nIm not normally a salad person but the salad they have with kale, quinoa, watermelon radish, and chickpea, is unique, unlike any other salad Ive had.  Its very fairly priced - i believe 9bucks, for the small... and that small is definitely enough for a meal. \n\nIn my first visits, i ordered a simple beef burger, playing around with the add-ons. It was a gamble but once I tried the Amish blue cheese, and it was delicious. The size of their burgers, I find to be perfect.  Unlike most burgers, the ones here are generally on buns that dont get soggy with grease, and are not so tall that they're a challenge to take a bite of without making a mess. I always get the brioche bun which is perfect in size - soft but sturdy. \n\nDuring my last two visits, I ordered the grilled chicken sandwich and was pleasantly surprised. The chicken was entirely white meat, free of any fatty pieces.  The amount of chicken you're given is more than Ive found in any other grilled chix sandwiches.  \n\nBasically, these simple dishes are what one would expect, only they're at the top of their game.  Im not any kind of organic guru, but here, the quality of their ingredients is noticeably high.  Everything is flavorful and fresh.\n\nWhatever burger or sandwich I get, is about 11 bucks.  Paying the dollar or two more than I would at the nearby Moo Burger, is a no brainer - Its an upgraded burger, so it makes sense to pay a small upgrade fee. The price can vary every visit though, because they have a make your own style option... you pick your bun, your cheese, and what toppings you want, as well as sauces. Naturally each add on tacks on something like 75cents. \n\nI will be continuing to happily be a regular.", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "A great addition to the neighborhood. They try to provide organic options when available, and they offer tons of different kinds of meat (including boar, ostrich, elk, and veggie).\n\nI had the Habanero Express with elk (recommended on the menu). It was sloppy and delicious, with a rising heat from the peppers and chipotle mayo.\n\nYou can also build your own burger, which requires a lot of steps, but the waitresses and waiters have iPads that take down your order exactly.\n\nPretty good beer selection too.\n\nThe place is almost always busy, so come early or come late!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "I came in here after my workout and decided to have a shot at their version of a burger. The Buckaroo is what one of the friendly servers recommended. When I say it was delicious...I must admit I was thoroughly impressed. It literally made me come back here again a few days later. Their might be a lot of burger joints in Brooklyn, but this is one I will become a regular costumer at. Delicious. Servers were knowledgeable and professional. Very kind.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-22", "description": "They should really get 3.5 stars, but yelp hasn't caught on to half stars yet. On our 1st visit, the bison burger was horrible. It was terribly undercooked, and maybe I just don't like bison, not sure. \nThis is our 2nd visit, bc she really likes the salads. I got  a sesame ginger beef burger this time and it was delicious! The chocolate and strawberry shake was also delicious. She says her guapo chop with chicken salad was yumalicious(her word, not mine). \nI'd give them 4 stars except for the service. They kept trying to take our drinks and food while we were still eating. \nWill go again, but keep a tighter reign on my plate.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-31", "description": "I passed by this intriguing burger joint with my boyfriend more than once and after looking up their menu and website - I was inclined to try it out with him and so we did one Saturday afternoon after the gym.\n\nWe had to wait around 15-20 minutes for a table for 3 people since his mom came along too. It's quite dark inside the restaurant and has a nature-like/forest like decor. I felt as though we were dining in a forest. Our waitress came by and took down our orders with an Ipad which I found very clever and interesting. She was very nice to us.\n\nWe worked backwards and started with our sides first.\n\nRings and Fries - I love that it came with four different dipping sauces (special sauce, curry ketchup, smokehouse sauce, and smoke paprika sauce). Out of all the sauces, I liked the curry ketchup one the most. I liked the fries more than the onion rights. The fries were crunchy, crispy, and irresistible!\n\nWe all got burgers. My boyfriend's mom had the Original burger which consisted of Colby Jack, Iceburg lettuce, tomatoes, raw red onions, special sauce, and beef patty. \n\nInitially, I wanted to try the Brisket burger, but than my boyfriend's eyes caught it too and he wanted it so I let him have it and I ordered a different burger. His burger sure looked aaammazzing! It was stuffed with hardwood smoked brisket, pepperjack cheese, panko breaded butter pickles, raw red onions, and smoked paprika mayo. I didn't get to try the panko breaded butter pickles even though he gave me a piece, but  I wish I did try it.\n\nSo I had the Smokehouse Portabella burger which was composed of -- smoked mozzarella, smokehouse portabella, and smokehouse sauce and I had it with the bison since it was recommended on the menu. This was probably the messiest burger I've ever had because a lot of the liquid from the mushroom was dripping out when I was taking bites out of my burger.  I didn't really enjoy my burger since there was hardly any seasoning in it and felt so plain.\n\nIf you plan on coming here for lunch, prepare for a bit of an expensive meal here because Bareburger is mostly known for Organic \u0026 All-Natural burgers. I thought Bareburger was mediocre, nothing to be crazy about. I've definitely have had better burger experiences at other burger joints.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-18", "description": "Refused to serve us lunch at 12:20 on a Sunday. That's garbage service. This place is just a playpen off kids.", "author": "Jeffrey W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-24", "description": "Burgers are pretty awesome,  but the service wasn't so great.  We went on a Saturday afternoon and we're seated immediately and even though the restaurant was fairly crowded,  it was adequately staffed and should not have taken our server almost 20 minutes to come to our table.  Once we finally got her attention , she took our orders and brought us water.  I ordered the elk Burger  with sweet potato fries and it came cooked to perfection.  My friend got the wiki wiki which she said was OK and my son got the supreme which he said was very good,  but he didn't care for the onion rings.  Overall,  pretty good,  but I came home and made the exact same burger for my husband at a third of the cost.", "author": "Lia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-25", "description": "Unfortunately this place is kind of falling apart.\n\n-Service is confused and doesn't know or care about their jobs, and it shows.\n-Food was sloppily thrown together and not very good.\n-Seating is uncomfortably disorganized.\n\nMaybe this place has seen better days, maybe the management is in the process of changing, but after hearing great things from others about Bareburger I felt I needed to try it and was completely let down from beginning to end.\n\nI'll stick to Shakeshack a few blocks away.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-12", "description": "The food at Bareburger is fantastic! This is the second time I've been to this location and the service has just been okay. The waitress was very pleasant but one of our meals that was brought out was wrong (quickly corrected) and I had to ask the times for a side of hot honey before they brought it out. Also, the bathroom is very dirty. Other Bareburger locations have much better service.", "author": "Lori C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "Not sure what happened with this place but it's gone down hill in a noticeable way. Food was cold but not that it mattered because the waitress literally never checked on us after she took our order, too bad because I would have liked to order a second beer. It was almost as if our being in the place was a bother to her, as if she had something better to do, aside from doing her job. Like flirting with her coworker. \n\nThe one in LIC is still solid, I just won't waste my time or money here anymore. There are just too many other options in the neighborhood that serve warm food and will allow you to order a second beverage.", "author": "j w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Ordered the Standard and the Buckaroo. I regret ordering the standard as it is a normal burger. The buckaroo is like bbq brisquett so good. We came around 3pm on Sunday, super busy.", "author": "Jieli T."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}