{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-13", "description": "The reason for 1 star it's for the delivery...\nIt always take over an hour... The food comes cold... After you pay $1.75 for delivery. Seriously. \n\nGood, but overpriced food.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "I've been to this location several times. The lunch special is such an incredible deal. As a vegetarian, I'm glad that they offer 3 types of veggie burgers--all wonderful. I've also brought my meat-loving friends here who rave about the El Matador. Service is usually awesome and friendly.", "author": "Coco V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "Love this place! The food is always great and they have plenty of veggie options :) I've had both veggie burgers and salads. Everything is always delicious and the service is great. \n\nLOVE the Mexican salad- the bowls are huge, even for the small one. Topped it with a black bean patty- yum.", "author": "Jade B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Visiting Bareburger is the one place where you can order your burger to your liking in every way. You don't need to be that awkward, weird person asking for substitutes or omitting toppings. How many places will let you have an ostrich patty on a tapioca rice bun with grilled pineapple, fried egg, sharp cheddar, brisket bacon and curry ketchup*? Think about it people.\n\nIf you're not in a booze mood, go with their milkshakes. I usually go with chocolate but one of these days, going to go a little crazy and mix some flavors up. Chocolate \u0026 raspberry perhaps?\n\nThe place itself is lovely and welcoming. Plenty of tables for groups big and small. The tvs show cartoons, which I find highly entertaining and distracting. If Scooby Doo is on the screens, I ain't talking to no one.\n\nConvenient location, right on the corner of Court and Atlantic. Given what a fat ass Iam when I eat here, I often do the 15mn walk to Atlantic Terminal. But if that's not your thing, it's a short jaunt to the various nearby subway stations. \n\n*Disclaimer: I have not tried ordering this. Just go simple with your burgers.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-02", "description": "This place menu went down a bit and brunch on weekends now is not as full as before and no drinks included , only coffee .", "author": "Bella B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-20", "description": "Bareburger is tasty. I've gotten takeout from them many times but I think I'm done. Last night I ordered from the Court St location and ordered the crispy brussel sprouts side which they charge $7.95 for. I've ordered this in the past from other locations and received a huge portion fit for sharing. This time I got maybe 4 sprouts cut in half, wrapped in foil. I called the store and they said this was the right portion size. I guess they think it's okay to charge $8 for a small side of vegetables.", "author": "Ashley Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Yummy!!! Good atmosphere great services.. A bit pricey but well worth it, I thought.. The burgers were and are amazing, the taste omg yummy. I will most deff come back for more!", "author": "Gloria R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-25", "description": "Tonight I thought I'd give Bareburger another try. I entered with hope. I left with:\n\n1. A wet crotch, after an employee batted a stray glass of water toward me and onto my pants.\n\n2. An offer of water while I waited for my food. I'd had enough water, thanks.\n\n3. A to-go order that was barely warm upon opening it a scant few minutes later. Why? Perhaps it's because as I saw on tonight's visit, food orders backed up on the counter, sitting for long stretches unserved.\n\n4. The gross visual of a staff member sneeze into his hands, then use the same sneezed-on, unwashed hands to touch and fill water glasses.\n\n5. Soggy fries and a brisket burger that tasted like pastrami. Which is fine, if I wanted pastrami.\n\nBareburger? Doneburger.", "author": "Dan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "This place is great. They offer over 10 different proteins to choose from including ostrich,  bison, black bean, chicken and wild boar. The customer service was outstanding.  5 different people checked on us to make sure we were OK. They have a bar with the coolest handles for the beer tap. They are made of different kinds of branches. The decor was brick and wood with some very seriously made furniture. The chairs are heavy. I will definitely be back. The prices were great for the location and the type of products they serve.", "author": "Christina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "Great burgers with interesting variety.  Where else can you try elk and ostrich?  The burgers are very good and the fries are cut and salted perfectly.  However, the standout to me was dessert.  Upon recommendation from the server, I tried the Breakfast Sammie ice cream sandwich! Candied bacon ice cream, chocolate cookie and chocolate sauce on the side. Heaven!  Salty, savory, sweet.  The cookie is soft yet it holds up.  Damn, I would go back there simply for the dessert.  \n\nThe seating is tight and your neighbor(s) will probably have to shift over to let you in or out, so plan accordingly.  Don't be that jerk who gets up twice to use the bathroom.  \n\nEnjoy!", "author": "Erin A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-06", "description": "While usually good (although slow and overpriced), the staff has always been nice.  I went in the restaurant on a Thursday night with my boyfriend and most of the tables were filled. The hostess told me there were no tables available and I had to wait 10 mins outside in the cold and rain. There were two empty tables right in front of me!  It was two small tables pushed together to make a four top.  I asked if we could have one empty table and push them apart (there was plenty of room) and was told no, because they were saving them for a \"large group.\"\n\nI can't believe I was told to wait outside in the rain for 10 minutes, as I was staring at two empty tables!  Guess who didn't wait and won't be going back there again.....", "author": "Ariberry A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-27", "description": "#f@ckyeah #beer #beerporn #bareburger #dinner #nyc #ny #brooklyn #liquidbread  #foodie\n\nwow what a great downtothepoint burger joint!!! amaizingly great food, fresh good combinations of sides, sauces and sndwiches. \n\nnice 20 30 60 and liter mugs ;)", "author": "Nikita E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "My bison California burger was amazing! The guys were so informative about ingredients and with helping me\ndecide...so many delicious choices; I couldn't make up my mind. It came out so quickly too and the regular fries were plentiful!", "author": "coco f."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "As a frequent visitor of Bareburger in FiDi, I was happy to find this place in Brooklyn an early afternoon before going to the movies. Unlike the FiDi version, this is a casual sit down venue with service. The menu is slightly different as you can get elk burgers here, which I enjoyed together with a side of their onion rings, which are delicious but does cost me an extra trip to the gym. Only draw down here was that the medium cooked burger was on the well done side and my sons well done burger was on the dry side. Finally, the service was friendly but a little on the slow side this particular day. I would come back, especially on a warm sunny day where they can open up the front to the street.", "author": "Ingemann N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "A delicious find!  Had the bison roadhouse burger. The burger was big and delicious.  Some places say they'll add avocado and won't add much.  Bareburger had a decent amount of avacodo, and all the toppings.  I highly recommend it.  Came here on a Tuesday at 5.  Was promptly seated.  The staff was really nice and answered questions about the menu courteously.", "author": "Diana M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-07", "description": "Overpriced low quality crab cake sandwich almost room temperature which tasted exactly like a poorly microwaved frozen patty...order something else!\nBeef Burgers are not really juicy, my wife ordered the chicken sandwich, it was decent.", "author": "Davide S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-28", "description": "Good, big burgers but not amazing. I've had better for way cheaper at in and out burger. My burger was $14, kinda steep. Would go back again though.", "author": "Rob C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "During an \"In the Papers\" segment one Thursday morning, Pat Kiernan of NY1 mentions the two page spread in the NY Post of the \"Best Burgers in NYC\". Now I wouldn't piss on the Post if it were on fire, but any Best Burger review would spark my attention. They mention some spot called \"Bareburger\" and my response was \"Who?\". According to the article, Anderson Cooper is a fan. So after a search on Yelp - where else! - I discover that this restaurant is quite popular in our fair city for some time. And they opened a Brooklyn restaurant on Court Street. So of course I had to give it a try.\n\nUpon my arrival at the Court Street location (right off Atlantic Avenue) I peruse the menu and I see the word \"elk\" as an offering. Elk?!? Bison and wild boar and ostrich... Oh My!!  Bare Dips like curry ketchup, smoked paprika mayo, thai chili mayo and \"special sauce\". Panko breaded butter pickle chips... what the!  Now Bareburger has fully intrigued, and perplexed, my taste buds. and I'm going for the kill - which apparently is needed when you serve elk, bison and wild boar.\n\nSo I order elk sliders, a basic burger (good ol' fashioned beef is on the menu), chicken tenders and a side of fries. I'll save the wild boar and ostrich for another time.\n\nThe night of my visit, I have the basic burger and fries. And I am forced to give the NY Post credit (good god!). This is the best burger I've had in a long time. Filled with flavor and not greasy. The special sauce is tasty; they put the right amount on it to match the beef. And the fries are the way I like 'em. Five stars.\n\nThe next night, I have the elk sliders. BOOYAH! Elk is really good! The flavor of the meat, sweet apple grilled onions and pickles are a fantastic combo.\n\nNight three brings on the chicken tenders. Now the tenders were a slight disappointment, but its all about the dips. And the dips are really good. The only problem is I'm a bit confused because they don't say which dip is which. I was able to determine what the buttermilk ranch, thai chili mayo and smokehouse sauce was. But I got a tasty dark brown dip with seeds that I couldn't figure out. Is this the stone ground honey mustard or something else?\n\nMy total for all three dishes came to under $40, which is very reasonable. Also, the food didn't lose any flavor being in my fridge for up to 3 days so I was very happy.\n\nI'm giving this place five stars, but my only complaint was the take out process. Maybe the newspaper mention left them unprepared for the onslaught of new customers, but they seemed to be all over the place the night I went. My wait was  30 minutes.", "author": "Randi C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-27", "description": "Disclaimer: I'm not a burger person.  I rarely seek one out, so between the sandwiches, salads and fried appetizers I've tried at Bareburger, I haven't found anything to rave about.  The service is friendly \u0026 knowledgeable about the menu/wines.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "Food that not only tastes good but it will make you feel good as well. They are a environmentally conscious franchise that aims to get all their food organic and fresh. Their meat source is all grass fed. While people often associate burger joints for their meat (which of course is amazing here), they have a menu with lots of amazing salad and veggie appetizers. A great place for people with all sorts of diets. Gluten free, vegan, vegetarians, carnivores, paleo, etc. I am pretty sure anybody with a strict diet can feel excited about this place. \n\nI personally love their Mexican salad which not only has vibrant colors coming from its ingredients of bare greens * pepperjack * hass avocado * raw red onions * baby radishes * red piquante peppers, grape tomatoes * red pepper chips * tossed in cilantro lime vinaigrette, but the flavors have a great balance of citrus and a hint of spiciness to it with just enough moisture that keeps your tastebuds not feeling overwhelmed. The freshness of the ingredients also makes it taste absolutely amazing. Serving size was also very generous. If you ever decided to get a large salad like me by accident - you could definitely make that a two person entree. Small sized salad was very filling.", "author": "P-law S."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}