{"aggregateRating": {"reviewCount": 343, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-04", "description": "I was pretty excited about trying this place as I saw they had a few vegan options. I had no issues with the service, but the food itself was not palatable. Honestly, it was a mound of alfalfa sprouts between two very thick whole grain buns. Imagine what that would taste like. Not very good.", "author": "Sadia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "My first time there and the service was excellent.\n\nServer explained the menu concept. You can pick you choice of \nmeat: bison, beef,...\nsides : sweet potato fries, French fries, onion rings, ..\nDrinks : beer, wine, cocktails\nIt's nice and comfortable, it's great to finally find a place you  aren't rushed to leave. \nMy grind house was delicious. The relish and paprika mayo was a great combo.\nI would highly recommend this place. \nCan't wait to come back and try another organic burger.", "author": "Camille G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Amazing tasty food!!! And I love the vegan options healthy options. Great customer service too", "author": "C M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "I was starving.  My husband and I sat at an outside table, such a fab day in NY. (Too bad I didn't pack enough warm weather clothes). Looked at the menu and bummed.  Weirdo, millennial salads on the menu . I hate kale.  So I went for a burger.  Everything organic, bison burger and onion rings were top notch. A pleasant surprise.  Not what I was looking for but it worked for me .  Now just get a normal, with romaine lettuce or Boston lettuce or something non frickin kale salad on the menu", "author": "Joanne A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "I met up with my cousin in New York whom I haven't seen since I was a toddler, and we were so excited to see each other.  We we both searching around Brooklyn for a place to eat, and we stumbled across this place.  Neither of us had been or heard of it before, but we had a very helpful waiter who explained to us the concept of this restaurant.  It's a burger joint that specializes in using all natural and organic ingredient for everything, from the meat, to the toppings, to the condiments; it's a chain restaurant that primarily operates in the northern part of the US.  \n\nMy cousin and I were looking through the menu and saw some pretty interesting choices.  Ultimately I decided on the \"Fire Quacker\" which was a duck burger and My Cousin got the the \"Social\" which was a turkey Burger;  It was my first time eating a duck burger and his first time eating a turkey burger.  \n\nI must say that I quite enjoyed my meal here, and I believe my cousin did too. The burger itself as well as the fries and ketchup all tasted \"different\" and to be honest \"weird\", but it was a good kind of weird, like the \"I'm not used to eating organic food, is this what my food is supposed to taste like weird\" haha.  \n\nOverall, this location had good food and friendly service.  The next time I find myself up north I I will definitely consider getting another delicious organic burger from BareBurger.", "author": "Jordan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-23", "description": "So we came here yesterday to celebrate my daughter bday with about 12 people. We waited maybe 6-7 minutes for two tables to clear, the kids had their own table and the adults had theirs, with the exception of two adults sitting at the bar. The food was pretty good but the waiter service was horrible. It seemed like they kept forgetting our order. We even had to keep flagging them down for basic things, like cups for our water and utensils for our food. They kept apologizing saying they were swamped but when I looked around it seemed like everyone was served, so I couldn't understand. Even when other customers showed up, they were being attended to better than our table. They even put knives on our kids table! Like who does that??? I was so upset.\n\nAnyway, the manager knew all the craziness that was going on and took the drinks off our bill and gave us an additional 15% off. While the food was pretty good, I don't think it's worth the headache to return here again.", "author": "Sacha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "The food here is amazing, fresh and unbelievably delicious!!!! The staff are amazing Jesus and Dave are awesome, customer service still exist at Bareburger.....if you're looking for quality in food with great service I suggest you try this place out.", "author": "Porsche E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-21", "description": "It pains me to give Bareburger 3 stars. Everything was delicious, and I have no problem paying $12 for the California burger, the ginberry cocktail was spot on, and the pickle chips were awesome.\n\nTiming though: awful. In lieu of a side of fries, I got fried pickles off the snack section. When taking my order, the girl asked if I wanted them first or with my meal. As I was forgoing fries, I wanted them with my meal.\n\nThe burger came out relatively quickly, but the pickles came out 10 minutes later...ugh. I guess next time I'll ask for them to arrive first.", "author": "Heather C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-07", "description": "The service was atrocious and when we brought this up with the hostess, she told us that she didn't care if we ever came back.  Therefore, our families will never come back.  The service entailed: no salad dressing for the salad, the wrong wine, the wrong food, not giving us the food we ordered, and we had to send our kids in to ask for the check and pay for it.  Really unfortunate.", "author": "Dina T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Not too expensive. There's also one on 71st and Continental. Whether you're dining alone or with a bunch of friends. You must experience the food and the atmosphere.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "If you're striving to be health conscious but want the satisfaction of eating a burger, GO HERE.  \n\nThis place is amazing for several reasons:\n\n1) They have HELLA protein choices and are quite accommodating of a variety of health needs. I love that I can get my gluten free and vegetarian on here!\n\n2) It's always fresh tasting and I feel GOOD about eating here.\n\nI am also obsessed with the Guadalupe wrapped in collard greens.  Honestly, I'm still dreaming about how good it was.  Black bean patty was a great bean texture and flavor, pickled onions added a kick and the alfalfa spouts was a nice little surprise in my mouth. And the guacamole was obvi on point, because when is guac NOT a good idea?\n\nThe only reason I am taking off 1 star is that it is a bit pricey. Paid $14.32 + tip for my burger and fries.  Anyway, this place is great!", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Food is great- we love this place!  My only complaint is that we usually have to wait a bit to get a table, as it gets very busy around dinner time.", "author": "Remy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "The combination of fresh, organic, locally sourced ingredients and the wide variations of protein to choose from makes this hands down my favorite gourmet burger spot in NYC. The staff here is friendly, knowledgeable and the atmosphere is very inviting.\n\nOften I'll grab a burger for lunch. My favorite is the \"El Matador\" which is a bison burger. It's tastes very similar to beef except it's a leaner meat so for those trying to eliminate as much fat from their diet as possible try the bison. It has queso fresco, pickled jalapeños and guacamole giving it a ton of flavor. Deff stick with it being cooked medium for the perfect amount of juiciness.\n\nThe salads are also a hit for me. They're slightly expensive for the portion size I feel but they are fresh and tasty. \n\nFor a non-alcoholic beverage to those who love ginger, try the ginger Brew. It's amazing. Wine and beer is served as well.", "author": "Justin H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-01", "description": "Placed an order online for pick up and the order was messed up. I don't understand how this happens. My boyfriend ordered the supreme burger and they left off the onion rings and french fries, which is what makes the burger so fun. The good thing was his meat was cooked the way he liked it, and after calling they gave us a refund for his order. I ordered a bison burger which was ok, but I wanted it rare or medium rare and it was well done which was very disappointing. \n\nWhen I went in to go pick it up, the food at the tables looked so good, but when you get it to go, it just looks like a thrown together fast food burger. I won't order out again but I would still maybe try eating there.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-15", "description": "Let me start by saying that we are huge fans of Bareburger. That being said, this particular location - by far - is the worst of the franchise as far as I could tell. Service was crap. Good arrived late \u0026 cold + one item was apparently dropped on the kitchen floor so my son had to wait for the replacement which arrived by the time we finished our cold food. By the time his food arrived, it was not correct but we let it go. Then they claimed to give us a discount meanwhile we were charged for items we didn't receive! This place is typically understaffed \u0026 the very few that work there are extremely clueless \u0026 careless. Will never ever dine at this location again. A complete disaster all around!", "author": "G S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "Awful experience. Inexperienced, first time waiter apparently. My MR burger came out well done and I was told 15% off my Check and burger would be out momentarily. 20 min later, my wife finished and some with her burger and still NO BURGER \n\nWaiter tells me, no problem I'll take it off of the Check. No pep in his step, no work ethic. Just a pure reflection of the management. \n\nAsked to speak to a manager, 'he's downstairs doing paperwork.' After 5 minutes, I left. \n\nWill never dine with them again.", "author": "Andrew N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-14", "description": "I might be spoiled with good food living in Brooklyn but for $13/ burger and additional $9 for fries you can get some AMAZING burger (and a quality one) elsewhere. I definitely splurge on food more than anything because I love delicious, quality food but I was shocked at what they charge for those \"Shakeshak\" burgers", "author": "Arin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "It's amazing place. We did order \" impossible burger \" because we don't eat meat. And this burger was unbelievable! So tasty ! The staff was very friendly and helpful. Thank you! Definitely we'll come back", "author": "Irene S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-16", "description": "Food was good but the apple juice was expired. (Came in an apple and eve box) After our meal my two year had to use the bathroom only for me to see fungus on the wall it is beyond disgusting. And how clean can the food be if the staff is using such deplorable facilities. Never going again.", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "Good brunch option in the neighborhood, even if you're not a fan of mini-chains.  \n\nBF and I stopped in yesterday.   We were ignored by Chez Moi, and encountered a ridiculous wait at Henry's Public.  We entered on a whim but were seated quickly, and ordered off a dedicated brunch menu (who knew?) and really enjoyed our dishes.  Mine was fried chicken over French toast with caramelized pecans.  His was something called the Hungry bear (or something like it) - 3 eggs, sausages, sweet potato fries and French toast.  No, this is not diet friendly food - although, the menus actually list calorie counts. \n\nBrunch prices are reasonable, considering most  come with coffee/tea and juice.  \n\nCome hungry.", "author": "Kayo N."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Bareburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "149 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fUxNeMxwWO46zyOQWx6tNA/ls.jpg", "@type": "Restaurant", "telephone": "+13475296673"}