{"aggregateRating": {"reviewCount": 10, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "One of the best spots you can find within Dekalb Market Hall.\n\nThe food is very simple, clean and delicious. They go with traditional Chinese food, without many spices and blah blah. Straight to the comfort food experience, it will remind you of home.\n\nI recommend chicken over rice, the peanut noodles, fish balls, and wonton noodle soup. But their menu has a lot of choices, feel free to ask and explore.\n\nPrices are super affordable, 100% MR. Lin is really a must go. When I don't feel like cooking which is most of the time...this is my happy place.", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-01", "description": "I had the Huo Rou, which has crispy pork in it. It was crispy and salty and yummy. The broth had some heat to it but I could have used even more. It's very simple and clean, I personally enjoyed my food. The broccoli was perfectly cooked, I had rice noodles in mine. For the price, it's a great meal! I only paid $11 and I was completely full. Also, I ordered and literally 1 minute later the food was ready to go!", "author": "Sheynelle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "100% Mr Lin serves authentic Chinese food, more Cantonese and FuZhou style than Szechuan (i.e. Han Dynasty) which fills a needed gap in the DeKalb Market space. For $7, you can get a pretty solid wonton noodle soup. They also serve barbecued meats over rice and fish balls. Overall, the menu is short, but very affordable compared to the rest of DeKalb Market. \n\nToday I got a wonton noodle soup. The soup base is clear chicken broth, flavored with scallions and ginger. This is a much cleaner noodle soup than at Han or at Hana. The noodles and wontons are cooked well, springy, so it is important to eat them ASAP. The wontons, while it says mini on the menu, really are mini and a bit disappointing just due to size. But the flavor is on point and the price is fantastic. I would 100% love an option to add extra veggies or a soy sauce egg on top. \n\nLooking forward to trying more of the menu!", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-02", "description": "One day i was feeling for something soupy and was glad i stumbled upon this place after coming out of Trader Joes. I've tried the roast duck over noodle soup. Duck was really tasty and not to mention they deboned it for you, which is a plus. Noodle was cooked right, the only thing i didn't like was the goji berries in the soup but that's just a personal preference. Their spicy peanut noodles was tasty too! It was actually the cheapest item on the menu that got me full when I didn't want such a big lunch.", "author": "Mimee S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-21", "description": "Probably the worst Chinese food I had in New York in my entire life. I had the 3 meat (roast pork, duck and chicken) and rice plate. All three of the meat packed in flavor and we're very dry. Ended up throwing the meal away after trying a bite of each meat.", "author": "Bryant Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "A newer spot in the Dekalb market food hall, their offerings differ from those of the other Chinese vendors already present. Someone actually tried this first, then told me to stop next time I was there, so we took their advice! I wasn't feeling like a big meal so I just got the peanut noodles, which were definitely enough for me to make a meal of. The sauce was good without being heavy or greasy, and no one spice or flavor overpowered the peanut. My mom got the roast bbq pork bowl, and really enjoyed it (although she lamented the lack of radioactive red food dye, haha!) As a few others have said, one of the cheaper spots in this food hall. Definitely one I'll be back to!", "author": "April H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-11", "description": "I ordered the Street Noodles with Thai Peanut Sauce. It was awful. It tasted like very overcooked, sticky spaghetti with cheap quality ultra thick, smooth style peanut butter that bore absolutely no resemblance to anything Thai.\nI gave them 2 stars because their customer service was ok and I got my food right away because I was the only customer they had at the time. (However, the staff's command of English was so bad that I couldn't get them to comprehend that I was asking for salt.)", "author": "Rochelle G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-06", "description": "After ditching responsibility and leaving Trader Joe's to order takeout, Mr. Lin's made me wish I had been a responsible human and gone grocery shopping instead- a rare feat. The $13 duck and rice bowl was something I could have made from Trader Joe's ingredients for $3 at most. The $12 pork bowl was more of the same... We couldn't tell the difference between the two. Even though I'm not the most culinarily inclined, what I would have made would have been better quality. The meat was dry and barely warm; the sauce seemed to be on the verge of spoiling. Included was half a hard-boiled egg, which was probably left boiling all day. The quantity of food was barely enough for an appetizer, and left me wanting more... but certainly not more from Mr. Lin.", "author": "Ben B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "First time here and the food is just delicious. I finished so fast that I forgot to take a picture of the crispy pork. I can honestly eat this everyday. Service was also great. 5/5", "author": "Tony B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-07", "description": "This place is good. Not the best in the world but by no means bad. We ordered the fishball soup with flat noodles but they accidentally gave us rice noodles instead. The soup base was a bit greasy and there was a good bit of oil in the broth but it was tasty. The fish balls tasted very similar to the ones you buy at Hmart. The prices are reasonable enough. If you're looking for something other than your typical Chinese cuisine then this is a good choice.", "author": "Lilah T."}], "servesCuisine": "Chinese", "priceRange": null, "name": "100% Mr Lin", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/vZ7gSMuRFSMM2oTyiDEw4A/ls.jpg", "@type": "Restaurant", "telephone": "+19293790092"}