{"aggregateRating": {"reviewCount": 66, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "the mushroom and margarita slices are very good. Not full of grease like most pizzerias. Good pit stop before or after walking/biking the Brooklyn Bridge.", "author": "Roxana G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-22", "description": "Pizza is pretty good, sometimes better than others. I find it to be really quick, but I generally only get a slice or two. I would go there much more often bc it is right by my office, but I find some of the people who work there to be annoying/creepy.  Literally every time me or my co-working go in there and ask for a slice to be extra hot, the guys says \"hot like me\" or \"hot like you\". Just warm up my pizza and keep the comments to yourself.", "author": "Debra L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "Perfect place to grab a quick slice at lunch and I would definetly recommend their calzones!", "author": "Thomas P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-22", "description": "Not even a close shadow of its former self at Adams Stree extension (Boerum Place).  NO stuffed crust pizza --- their defining pie.  So why bother?  But I did.  So sorry I did.  Ordered a fresh mozzarella pie which took 30 minutes, even though I called before coming to pick it up.  Tragic.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-19", "description": "The crust on the regular cheese pizza tastes like Little Ceaser's. I've been there several times for the fruit smoothies and happened to get pizza as well....the temper on the short, bald, pudgy guy that runs the place is probably doing more harm to the business than creating a \"true pizzeria\" atmosphere.", "author": "Adrian D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "Love the pizza here. I've been to My Little Pizzeria as well and like Antonio's better. The dough is always warm and fresh, and the pies always fresh baked... its also always quick and easy, and cheap as well. Yessio to Antonio!", "author": "Michelle K."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Antonio’s Pizzeria \u0026 Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "32 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ENEU8Heedc4n7uqHrlG0hA/ls.jpg", "@type": "Restaurant", "telephone": "+17182371700"}