{"aggregateRating": {"reviewCount": 66, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "The best slice of cheese I have ever had! I cannot wait to go back tomorrow for breakfast. Super friendly and very inexpensive too!! I highly recommend.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "Tastes like old-style good NYC pizza.  Crust could have been slightly toastier, but that's me.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Great local pizza place! I did a large half veggie half buffalo chicken for $20 which was very reasonable especially given the generous amount of veggies piled on the pizza!  Will definitely order again.", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "I might be discrediting myself by rating a pizzeria, having never tried a single slice, but since this small neighborhood eatery has started to establish itself with several yelpers as a solid go-to joint for pizza, I thought I'd chime in with my two cents about the rest of their offerings. \n\nCurrently shawled by some construction scaffolding, this inconspicuous hole-in-the-wall does little to draw attention to itself but I first came in here for their freshly made fruit and vegetable juices, which I consider a decent deal at $7 considering the size of the cup (which, if I were to guess, might be somewhere around 16-20 oz). Their array of raw ingredients is extensive and I have yet to be disappointed with any of the juices from the menu. I usually get the 'Get Smart', which is a mix of beets, carrots, spinach, and orange - cold, sweet, delicious, and the perfect way to start my day. The beverage menu also includes smoothies and wheatgrass shots ($2 each), and I love that they have a wide array of mix-ins (protein powders, chia seeds, bee pollen, etc.) that can be included in your drink at a nominal cost. For those that want a more conventional (read: solid) breakfast, they serve egg sandwiches, wraps, tossed salads, and toasts. I, for instance, have my eye on the $5 avocado toast for my next morning visit. \n\nWhile waiting for my juice to be prepared today, I was perusing the hot sandwich menu and was delighted to find that they have a vegetarian option. At $7, this 'Tofusion' sandwich seemed to have a slightly steep sticker price but I swung for it anyway upon my return at lunchtime and I am so, so glad I did. Nearly 10\" long (if not a full foot), this is a behemoth of a sandwich in both size and stuffing. A medley of hummus, tofu, zesty pesto, cucumbers, tomatoes, and a surprisingly generous helping of avocado are layered onto a neatly toasted and sliced ciabatta roll (vegans may want to eschew the pesto layer, which probably has cheese). Packed with protein and fresh veggies, this was a light yet completely satisfying meal and well worth the price, especially considering a sandwich half this size at the nearby health foods store is the same price. If I had any complaint, it's that the tofu was relatively plain and undressed, but its blandness is a negligible point, especially since it's paired with more flavorful buddies. \n\nThings can get a little chaotic in here, especially during the lunch hour when the guys behind the pizza counter are shouting \"Next! Who's next?!\" over the din of customer traffic. Dining in is NOT recommended since there's really only four or five seats along a wall counter. However, service is extremely efficient - no one waits around long for their food - and the guys behind the juice/sandwich/salad counter are always congenial. They remembered my usual order after just two consecutive visits and treated me like a regular, chatting amicably with me as I waited for my drink. For the friendliness, food, fresh juices, and incredible value, this little pizzeria has definitely earned its keep in my list of lunch spots.", "author": "Jane I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Great place for breakfast and lunch!\nI get my breakfast here every morning, if you want a healthy quick breakfast this is the place to go and the price is very reasonable.  For lunch you can go in and get a quick slice or a sandwich.  Very good!! must have.", "author": "Antonia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-16", "description": "Wow, real grumpy on the phone. Asked for chicken marsala, told me they don't have it. A few days before tried to order calamari fra diavolo and was told it doesn't come with pasta, when it says it comes with it on the menu.", "author": "Paul L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-03", "description": "hands down the RUDEST people I've ever seen work in food service. I say that as a life time new yorker and someone who's worked in customer/food service for years. the white guy is always arguing with people, saying inappropriate things to female customers...ive been coming here for a while because of convenience to my job but I refuse to go any more. the pizza itself is fantastic but not worth being yelled by rude men if i dare ask when they're gonna put out another kind of pizza when it's all out.", "author": "J N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "Since it was my first time in NY/Brooklyn, we decided to try a regular pizza place and a restaurant pizza place. We happen to pass by Antonio's on our way to see the Brooklyn Bridge and decided to try it. I ordered a margherita slice and everyone else got a regular slice (cheese pizza) which I tried and wow! Was I wishing I ordered the regular slice instead! There wasn't much sitting space inside the place so we are our slice outside. Not a bad experience at all. I actually prefer than a restaurant/artisan style pizza, especially if you're in a hurry.", "author": "Eva B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "My number one go to spot when I am downtown. Best pizza I have ever tasted and for a decent price since I only eat cheese pizza. Used to eat the chicken and bacon ranch which was also amazing. Never really tried anything else there but I am pretty sure they're all so good.", "author": "Tyler B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "Very good pizza! Great crust and flavor. If you are staying at the Marriott, this is a much better choice for NY PIZZA than MontyQ pizza. Very quick delivery.", "author": "Zoltan U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "The egg avocado tomato onion breakfast sandwich ($4) was seriously the greatest breakfast sandwich I have ever had, and I'm serious about breakfast sandwiches. I ordered it without onion, so do with that information what you will. The staff was also incredibly friendly! I wish I could come here every day!", "author": "Kathy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "Hungry, walking down Court Street with $5 to spend, I walked by My Little Pizzeria and looked in to see only one cheese slice on the counter. Meh, unless it's \"premium\" pizza with fresh mozzarella, it's a pass. Then came upon this new place. It was one guy in a small storefront about 200 feet square. Pino is his name, from Sicily. There were 6 slices left, none the plain kind. They all looked a bit dry. But I was hungry and the man seemed nice. \n\nI got a spinach and ricotta, no red sauce. Oh yum. And not because I was hungry. In spite of the dry look, the spinach was plentiful and flavorful. The ricotta was not overly salty and in just the right amount to give the slice that fresh ricotta texture And the crust? Some pizzas are defined by their toppings. This pizza is all about the crust. The bottom was perfectly crispy without the top being burned. You could hold the slice without losing any of the toppings. It was barely foldable and actually cracked when you tried to fold it. You can taste the wheat, which was caramelized by the crustiness of the bottom. But it wasn't like a whole wheat that overtakes the rest of the slice. The flavors were well-balanced. \n\nAlso had some garlic knots which were moist with olive oil but not dripping, and full of fresh garlic. Might be the best garlic knots in the city.\n\nThere is a juice bar, but it was closed at 9:30pm. So it was just Pino and a few nutty customers including moi in the little storefront with one counter to eat at and a handful of stools.\n\nIt was worth stopping in. I dare say better than Grimaldi's.", "author": "Kiai K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "Awesome place, great for lunch, dinner, or whenever! The specialty slices are awesome, and so are the rolls. Classic slices hit the spot great, too.\n\nThere's also a great juice bar inside, they use fresh fruits n veggies and the prices are a bargain compared to everything else in the area.\n\nDefinitely one of the best places to eat in downtown Brooklyn.", "author": "Phil M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-13", "description": "Want to be disrespected and shouted at by a delivery man?  The pizza is fine here but the delivery guy dropped my pizza and opened my other food items and then yells at me for not being able to find my house.  This is brooklyn heights, if you dont know your way around the few major streets here you should not be a delivery man.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-15", "description": "The food here is not bad at all.  Two things bother me, though.  First, the guys behind the counter obnoxiously ask if they can help when you're obviously looking through the menu.  I mean, chill out for a minute.  Second, I once passed by and saw the cashier pick his nose.  Freaking disgusting.  Objectively, the pizza is not bad at all.  All the pizzerias in this part of downtown Brooklyn taste the same, anyway.", "author": "Alvin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-07", "description": "It's lunch time in Downtown Brooklyn.  A space that's only slightly larger than a nearby studio apartment is filled with dozens of people. Some line up for salad or juices, though most are with me waiting for pizza. \n\nAntonio's has an efficient but basic system. Orders are taken down the line, you pay and then the order comes out of the oven. It's a grab and go slice joint, where ordering, heating, paying and eating take about 10 minutes at most. \n\nAnd the pizza is pretty fine. I'd stick to a plain slice as the throw on pepperoni slices on my pie were nothing special. The crust is nice and thin, the sauce not too sweet, this is solid B+ pizza. If this was downstairs from my office, I'd go a couple times a week. Definitely an option for the area.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "Delicious pizza and good prices! This is a tiny hole in the wall kind of place, extremely crowded at lunch time but the line moves quite fast. There are 3 or 4 seats, so it's mostly take out. Really nice people though. Big plain slice and a bottle of water was $3.50. Can't beat that!", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "Good slices, friendly service and reasonable prices. The process of ordering, paying and waiting can be a little chaotic but it's manageable. It's great for a quick, tasty lunch.", "author": "George F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-11", "description": "Love the pizza and hate to leave a bad review, but since I go there often because I work up the street, I had to.  The delivery is awesome and I haven't had any bad food as of yet, but if you want a fresh out of the oven slice, order a whole pie.  They refuse to give you a fresh slice because they will wait until the get rid of all the other slices.  That's my only problem.", "author": "Tracey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "Good cheap lunch option if you are in the Downtown Brooklyn area. They have quite a selection of items from heros and pasta to pizza and salads. I wasn't really in the mood for pizza so I ordered the eggplant parmesan hero.\n\nIt was definitely a hero! Huge and it was quite tasty with a good crusty bread and nicely seasoned and breaded eggplant. For only $6 you can't go wrong with this option. They also put it in a nice cardboard box so it won't be all crushed by the time you bring it back to the office. It does take a lot longer to prepare, so if you are in a rush, I would go for the pizza or salad instead.\n\nI would definitely come back to try other options on the menu. It's a pretty small and congested place so on a nice day take it to go and eat in the plaza outside of the courts. On a rainy day, back to the office to eat it you should go!", "author": "Cynthia M."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Antonio’s Pizzeria \u0026 Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "32 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ENEU8Heedc4n7uqHrlG0hA/ls.jpg", "@type": "Restaurant", "telephone": "+17182371700"}