{"aggregateRating": {"reviewCount": 66, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-26", "description": "Went here for the first time, recommended by a co-worker for a salad at a decent price. A little crowded during lunch time but I was still in \u0026 out within 5 minutes. The salad was actually really good \u0026 didn't make me feel like I was eating so healthy. \n\nEverything was perfect portion was and I paid $7.50 for a small salad which is excellent compared to the neighboring salad bars.", "author": "M. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-14", "description": "That's pizzeria and Café is a very cozy Pizza shop. As you enter you are warmly greeted by the owner son who you can tell pours all his heart and love into his establishment. You may recall this restaurant originally was located in the very same spot as the Shake Shack . The pizza as well as all the dishes are \"authentic \"and delicious", "author": "MyHungryWorld W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "I go here every morning for my breakfast! It's so crazy that my co workers go there now for their breakfast! I love the guys that works there, they know all the regulars orders. Even when it's super cray they have everything under control! And it's not pricey! One of the few places that's not going up in prices because of the neighborhood.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-23", "description": "Great deli, has many options from açaí bowl, to smoothies, pizza, salads, wraps and sandwiches. Came here on my lunch break and decdided to order a sandwhich. You can pick what kind of bread you want it in (roll, white bread, whole wheat, etc). They make everything fresh nothing is frozen (except for maybe the pizza which they make then serve throughout the day). The sandwhich was good but not as filling maybe because I got it on wheat bread which isn't that big. Will definitely give this place another shot for their other menu options ! I got the chicken avocado sandwhich it was good.", "author": "Shabnam D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-03", "description": "Pretty good pizza. Grandma square was pretty tasty. They have a salad bar and smoothie but haven't tried. Love that they have extra cheese available for you to add as your taste. It can get pretty crowded ar lunch time but so any other place around the area.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-05", "description": "$2.50 for a plain slice. This shop combines a pizzeria, salad bar, sandwich shop and juice bar. There's basically no space to sit inside and it gets crowded during lunch. I've been twice now to try the pizza and both times the slice was mediocre. It wasn't good it wasn't bad, just boring. I'd probably try my little pizzeria a couple of blocks down if you're in the mood for pizza instead. Very friendly staff at least.", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-09", "description": "Good pizza. Had a white slice and a baby wheel, which was delicious! Service is fast and friendly.", "author": "Samantha B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-07", "description": "The prices are not worth the service you get here. The guy that does the delivery was one day working behind the counter. When I gave him my order I told him I was paying separately and he caught an attitude and rolled his eyes as if I was making his life and job harder. I wasn't! I was simply handing him two fives for two different slices. All he needed to do was give me the same amount of change back for both which was four bucks (two bucks each). Another time my boss had ordered a pizza for delivery when it got delivered they gave an entirely different pizza and the guy on the phone started talking about prices and how much extra each topping would be when we were only calling to let them know they fucked up. Spend your money at the one further down called \"my little pizzeria\" or even spend a few more bucks elsewhere. I've had 1$ slices better than this place.", "author": "Kayla S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Omg!  They have an amazing smoothie and juice bar and the prices are reasonable.  It's a little unexpected gen in the area.", "author": "Alyssa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-08", "description": "Been here a lot. Honestly it was out of laziness and not wanting to walk. They are still open because of the location, NOT because of their poor food quality", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-21", "description": "In a pinch, a co-worker leaving.  We opt for this place.  Based on my supervisor review of the Margarita pizza. I ordered the pie and a few plain pizzas.  It seems this place does better with slices than with whole pies..\nOur pizzas tastes like a rush job, the crust was doughy and chewy.  Not that crispy and crunchy. \nAs the luncheon went on, the pies started to dry out.  Its didn't look good cold, it was tough when eaten. I wasn't happy tugging on the crust. \nI think i'll stick to slices.", "author": "Nikki B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "This may sound crazy, but Antonio's on Court St. is probably the BEST plain cheese slice I've had in NYC. Overwhelmingly good. Get it fresh out of the oven.", "author": "Kristina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "My favorite place to get pizza delivered. I always get the buffalo chicken pizza and it is excellent and a really great price. We always order on the slice app and they offer coupon codes sometimes.", "author": "Alison S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-29", "description": "Pizza arrived cold. Asked for Fresh Mozzarella, but received the thinnest slice of what looked like a Polly O cheese on top. In the special instruction section, I asked that the pie be made well done. What we received had barely any type of brown edges on the crust or the cheese. The sauce on the pie did have some decent flavor to it. We also ordered a grilled chicken sandwich and spelled out in caps in the special instruction section, I asked that the Balsamic Dressing be placed on the side. Maybe they didn't care to read those requested at all, because the sandwich came drowned in dressing. Their garlic knots while tasty also arrived cold and were sized a bit bigger than a marble.", "author": "Former H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-06", "description": "Too bad we couldn't give zero stars because this place doesn't deserve even half a star. Very rude, likely because they are extremely racist because they didn't seem to treat the \"white\" customer with such dismissal and attitude. Which is funny because we were actually born in this country but whatever...\nIt's never the customer's fault for trying to order from the menu and not realizing the place doesn't have something as simple as alfredo sauce. Sorry, couldn't read minds to know what you really do and don't have! If something is on the menu, how would we know the place doesn't have it?!? Update your menu and lose the attitude and rudeness and racism please. If my toddler wasn't already tired and starving we would have walked out instead of putting up with the horrible treatment. Not sure how the food is going to be but already have a horrible taste in my mouth...", "author": "Fon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "A really good NYC-style plain slice. And, at $2.50 a slice (tax included), a bargain compared to everywhere but the crummy $0.99/slice places. Rolls are also a good deal at just $5 each.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-23", "description": "Nice folk but bad pizza. On a recommendation, I had a couple of slices from them today. The crust was undercooked and had no crispness to it. The sauce and cheese were pretty flavorless. I'd seek your pizza fix elsewhere.", "author": "Ian S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-23", "description": "Always a stressful experience. Last time, two people who entered the establishment AFTER me were asked for their order and the five men working behind the counter just kept looking right over me as if I didn't exist. Completely disorganized and chaotic. I could have walked out without paying (if I was on that moral level) because I stood there waiting to pay for a while, while the cashier had a conversation with a friend. No one even seemed to notice that I was still in the building. The cashier then sexually harassed me for our entire interaction, as he has the past three times I have been in there. Cheap, delicious food is sometimes not worth it, guys. Unless you're just walking by and are insanely curious about checking this place out, I'd recommend all of the other pizzerias that you'll find if you just continue walking down Court Street.", "author": "Natasha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "This is for their delivery, I've never eaten at the brick and mortar location but I'm sure it's pretty awesome based on their delivery and quality of food:\n\nI live fairly far from their location and it was cold and snowy and I didn't want to leave my apt so I decided to order in. I'll just list the great things about my order\n1. my food came piping hot, I don't know if they have some sort of super transporter but again I don't live that close so I was expecting my pizza and Stromboli to be luke warm at best, okay fine my pizza, stromboli, AND my garlic knots. Don't judge me, I was having a moment and needed savory cheesy, garlic, tomato saucy goodness to appease my ache, lots of it. Again, the food came piping hot.\n2. Speed- again, I don't live all that close to the spot so the fact that it got to me withing 30-40 mins in the snow is pretty impressive\n3- Taste/ quality Garlic knots were on point, very garlicky and nice and soft on the inside but just a lil' crust on outside. Perfectly made\n4- Pizza was made just as I asked ( I had a few toppings and I prefer a more well done pie) and tastes heavenly.\n\nI got the 18 inch with 1/2 mushroom, sausage, onion and black olive and the other 1/2 extra cheese. Very happy with the taste and topping to cheese ratio (this is very important LOL)\n\nI recommend it for anyone planning a superbowl party and for those in the offices near the pizza place (it's in a heavily populated office district) doing a pizza Friday or just a fun pizza party for the office. Enjoy!!!", "author": "Duey Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "My favorite pizza shop in NYC. I come here like once a week. Every time I try a different place I always compare it to here and it's just not quite as good. The service is a little abrupt, but they are just trying to get customers in and out quickly. $2.50 for a plain slice. Worth every cent.", "author": "David S."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Antonio’s Pizzeria \u0026 Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "32 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ENEU8Heedc4n7uqHrlG0hA/ls.jpg", "@type": "Restaurant", "telephone": "+17182371700"}