{"aggregateRating": {"reviewCount": 66, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-27", "description": "Not that great - very small, crowded and noisy. Kind of like trying to eat lunch inside a construction cabin. The pizza was average but there is no civilized dining in here - couldn't even find napkins, people kept on bumping in to me, couldn't hear myself think. There are far better pizza options in the neighborhood so why anyone would come here for pizza - beats me?", "author": "Carl E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-13", "description": "With me, flattery will get you very far: 3.5 stars\n\nI stumble into Antonio's around 10pm (close to closing time) because all the eateries around the area are closed. As soon as I walk in the door I'm greeted by an enthusiastic, \"Bella! Bella!\" in an authentic Italian cadence. I stop dead in my tracks because I haven't heard any accent this genuine since I was in Italy. And I'm such a sucker for European accents. \n\nThe man (who later tells me his name is Vino (?)) working there has a bright smile and seems genuinely happy to see me. He looks at me like I'm an old friend and asks if I've ever been there before. I shake my head no. Then Vino asks if I live in the neighborhood and proceeds to say, \"Well, thank you so much for stopping by!\" \"Sure, thanks so much for being open\" I reply. After I order my pizza topped with a mountain of vegetables, Vino asks if I'd like \"some cheese, or maybe garlic, or maybe some peppers on top?\" I politely decline and as I walk out the door with my dinner, Pino exclaims, \"Buona notte Bella! Buona notte Bella!\" in his impeccable Italian accent. I respond back with \"Buona notte!\"\n\nI felt so flattered by his Old World charm and genuine hospitality. It's such a breath of fresh air when the proprietors are charming and polite to customers. Not to mention exchanging phrases in another language!", "author": "Susan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Awesome pizza. I love the Margarita pizza. Every time I'm downtown Brooklyn I make it a point to eat here.", "author": "Leanora H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "Shrimp parmigiano hero, garlic knots, smoothies, salads ...need I go on. They have good food. Great prices and friendly service. I receive deliveries to my office regularly and it's always fast.", "author": "Ashti D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-04", "description": "Came here for a quick salad lunch. They have a good assortment of mix-ins for the salads and the price is a bit cheaper than other restaurants in the area. The service was quick, which is good cause the store is on the smaller side. I will have to try the pizza next time.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "I ordered multiple pizza for a little party at a program for people with disabilities.  The pizza came in time exactly as I ordered it and it was delicious!  Staff at the restaurant was accommodating, friendly and thanked me for the business. I recommend them highly.", "author": "Marion R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-04", "description": "A bit confused.  Half mini pizze\nria and half juice bar/cafe?  Pizza not that good - place is tiny.  Walk a few more blocks to My Little.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "I'd just exited the subway station down the block from here early this evening and felt almost faint from the \"crushed like sardines\" subway ride and the unseasonable heat.  In desperate search of cold liquid sustenance, I spied this small place.  Initially I only saw sodas, which I don't drink and which don't really quench thirst sufficiently - so I asked the very friendly owner if he had any lemonade (not expecting to find it).  He said \"Absolutely!\" and procured a large-size bottle (only $1.50).  He and his two workers had beautiful smiles and I left feeling happy.  (As an aside, the pizza smelled really good but I'd already eaten dinner).", "author": "Susan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-20", "description": "Food is good. But the delivery man is disrespectful and ungrateful. I ordered $15 food and gave 10% tip on Eat24, like I always do. Food got to my apt in half an hour, which I give a thumb up. I opened the door. Delivery man stood there staring at the ticket and said \"Can't believe all this food and only $1 tip.\" Then he left. Since when did delivery fee become an obligated fee to give? I never thought delivery was an easy job but if you don't want shitty delivery tip then don't deliver. If you chose to deliver then don't give people shitty attitudes. Remember that I don't owe you anything. so don't expect people to give you tons of money as a delivery man. I am a student with loans and 10% is what I can accept for a delivered lunch. You attitude ruined your restaurant's reputation. I hope you have a good career delivering pizza.", "author": "Yunjia Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "compared to the \"other local\" italian eateries, hands down, antonios stands above all we have in north augusta. you never worry about getting your food home and finding there is practically no sauce on your spagetti. i get so tired of choosing a closer \"cheaper\" version closer buy that is no comparison, because it's closer. my food from antonio's lunch or dinner, is always worth the value and cost. the soup's, appitizer's, desserts, they always have tirimisu, fresh.no one else goes beyond in what their food tastes like and providing what they would eat themselves. love them. hope they celebrate each year they have brought some \"finer\" dining to north augusta.", "author": "Catherine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "This place has been my weekly lunch spot for two years now. Pizza amazing. Salads fresh. Smoothies yummy. Staff nice and friendly. Prices incredibly reasonable. I love it!!!! Can get packed sometimes but they always keep things moving.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "This place does a great reheated slice. Just the right amount of crispiness, good cheese/sauce balance, and the sauce is not too sweet like some other places. If I'm ordering a whole pie for delivery I prefer Table 87 or My Little Pizzeria, but if you get off the subway at Borough Hall and just want a damn good slice, Antonio's is your place. I always go after 8 or 9 PM when it's pretty empty, so the service is generally fine. In this neighborhood, there are some pretty overrated pizza joints (based on Yelp ratings alone) and Antonio's is just the opposite.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "I go to school in the area, so I have their pizza pretty often. The juice/salad bar offers great stuff at a decent price. The pizzas and sandwiches have great taste. The only downside is how small it is and how busy it gets. I rarely sit down to eat because you have people yelling their orders when its busy. I prefer to take-out", "author": "Miguel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "Love these guys! They know my juice order as soon as I walk in the door and the slices are huge. Super glad they are right down the street from my job!", "author": "Amandine G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-18", "description": "Good pizza, but the selling point is the juice bar. The soups are fantastic and the juices and smoothies are fresh. They have excellent service and respect your time and patronage.", "author": "Jay C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-01", "description": "I ordered a fresh-mozzarella pie that took 40 minutes to prepare, 25 minutes of which I sat in the restaurant, amazed at how slow the guy behind the counter was moving.  He assured me that he was making a fresh pie, but that hardly excuses the delay.\n\nIf the pizza was delicious, much would be forgiven and I would give Antonio's a decent review; however, this was not the case.  The sauce was alright, but the crust was dried out.  The worst offense was the fresh mozzarella cheese.  Instead of being sprinkled with small pieces of mozzarella pinched off a larger ball, this pie was topped with deli-slices of mozzarella that slid off the pizza with every bite.\n\nOverall, my experience with Antonio's Pizzeria was very poor and I don't intend to order from them again.  My advice to someone in this area craving pizza would be to walk a few blocks down Court St. to My Little Pizzeria.  If that's in the wrong direction, Monty Q's on Montague Street is will do the trick.", "author": "BT F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-05", "description": "If you're looking for a real \"Brooklyn\" type pizzeria that feels as if it was based out of a mob movie, look no further! Service was pleasantly amusing and the gentleman behind the counter seemed upbeat and playful with the customers. Fresh mozzarella slice was delicious however, it could have been a little warmer. A nice little gem in Brooklyn heights. Place could be a bit bigger and cleaner too.", "author": "Elle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "Not much seating, but delicious (and inexpensive) pizza in Brooklyn Heights. Friendly staff, speedy service. Antonio's also offers a wide variety of salads, sandwiches, and coffee drinks. Check it out if you're in the area.", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "There pizza is DELCIOUS. They have the best selection I've seen around here and it's always fresh.", "author": "Jessica A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "Awesome place for your pasta fix.  Gets really busy and the place is small.  But well worth the wait.", "author": "Jorge V."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Antonio’s Pizzeria \u0026 Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "32 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ENEU8Heedc4n7uqHrlG0hA/ls.jpg", "@type": "Restaurant", "telephone": "+17182371700"}