{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-29", "description": "I am not a fan.  \n\nThe good:  \nThe cocktails were nice for what they are.  Our waiter was attentive and friendly and the wait was reasonable, and the deviled eggs were tangy and delicious.  Those are what earned Henry Public two stars.\n\nNow, the other:\nFirst, this style of place is a bit overdone right now - between Clover Club, Weather Up and the rest - the old-timey cocktails and comfort food, the moustachio-ed waitstaff, the all-wood interior.  If the deviled egg has become the signature food of Brooklyn, New York, all may be lost.\n\nSecond, it's pricey and they only accept cash.  I get that accepting cards is an extra expense and see no reason for all restaurants to accept them, but when the total bill is likely to approach $100, as it did for our party of three, you can't expect people to carry around that much cash.\n\nThird, most of the food we ordered was sub-par and overpriced.  I ordered the turkey leg sandwich, after being told it was a specialty, but it was a mistake.  I like dark meat as much as the next gal, but the meat was too peppery and the proportions of the sandwich all wrong - too much bread vs. meat - and the fried onions didn't stand a chance against the juice of the turkey.  The whole thing kind of turned into a bready, soggy mess.  Another friend ordered the grilled cheese and it was nothing special.  \n\nIf I am going to pay this much to eat, I will spend my cash (or credit, hopefully) somewhere that puts more energy into making the food and cocktails truly great (e.g., The Vanderbilt) than it does on trying to time-travel us all back to the era of Bonnie \u0026 Clyde.", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-23", "description": "This place should be called fake handlebar mustache.  \n\nStaff in cheesy speakeasy getups.  Loud.  Doesn't know whether it wants to be a bar or a restaurant.  Snob atmosphere.  These speakeasies could be fun, but when they take themselves seriously it just seems ridiculous.", "author": "Rick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "Absolutely my favorite bar in Brooklyn.  The drinks are amazing and always have a perfect balance to them. I've had many drinks off their menu but I really enjoy just talking to bartender and letting them know my favorite types of liquors and flavors are and letting them decide what drink to make for me.  \n\nAs far as the menu goes... everything I've tried has been delightful. The roasted bone marrow is great but the portion is a little small (or maybe I'm just gluttonous when it comes to marrow).  The oysters are always fresh and lovely.  My favorite go to meal is the grilled cheese sandwich, I'm not entirely sure what blend of cheeses they use but I can never get enough of it and the fries on the side always takes me to my happy place.  I crave their fries on a weekly basis. \n\nI tend to go here on weekdays in order to avoid the crowds that sometimes can get obnoxious on the weekends.  In general I tend to ignore everyone in a bar who's not in my group but the weekday crowds are far more tolerable.  Me no like the budding hipsters that come here and exude arrogance on Friday's and Saturday's.  \n\nIf you're iffy on visiting Henry Public, just give it a shot.  Go on a weekday and give yourself a chance to really get a feel for the place.  The bartenders, bar backs, and waitstaff are all friendly and interesting people.  I've never had one bad experience in my year and a half of going there.  I always leave with a drunken smile and already plotting my return.", "author": "Mel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-24", "description": "One of the best  turkey leg sandwich's  I have ever had,\nGreat atmosphere and fantastic drinks", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "I've always maintained that the Brooklyn Heights/Cobble Hill area of Brooklyn feels much like parts of the East Bay. I guess that's why I feel comfortable and at home when I visit my girlfriend in Brooklyn. Families, dogs, hipsters, local businesses, farmers markets, foodie-centric activities - it's all there. \n\nWhen we visit we usually spend the majority of our time in Manhattan, but during this last trip my girlfriend insisted on a Brooklyn food/drink centered tour. \n\nOur first stop of the tour; Henry Public. Stepping into the gastropub made me feel like I was in one of the many new spots popping up in Oakland. \n\nHistoric building rehabed to its original era. Check. \nRequisite amount of Bay Area-looking hipsters. Check.\nCocktail list that includes rye, whiskey and absinthe. Check. \nMenu containing the words \"house-made\" and \"grass fed.\" Check. \n\nMy girlfriend had been raving about these smoked almonds for a few weeks prior to our visit and I was able to taste them for myself and let me tell you, they were worthy of the hype. Served warm and with just the right tinge of smokiness, the nuts were a nice treat that went well with our wonderful cocktails. \n\nI asked the bartender if the kitchen was willing to divulge its smoked almond recipe, but unfortunately they were tight lipped about those almonds. \n\nMy husband claims he can recreate them at home. It's been about a month and I'm still waiting.", "author": "Lee H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-23", "description": "Came for brunch with friends. No wait at all. Was seated promptly on a Sunday afternoon.\n\nI had the Egg, cheese and bacon sandwich. Nothing amazing about it but the shoestring fries were pretty good. Friends had the turkey leg sandwich. Now THAT was pretty amazing. Tender and flavorful meat served on thick toast. Delicious! Definitely liked the strong coffee that they served too. Prices are slightly on the high side but okay.", "author": "Elaine M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-20", "description": "Decent martini, no chance to try the food though. I'd try it again if I lived closer.", "author": "Dale W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "Went here for dinner with a friend.  Atmosphere, cocktails, burgers, service ... all were excellent.  The cheese plate was unexpectedly good.  Our server was very knowledgeable about the menu and attentive.  My only complaint - the place is cash only.", "author": "Tim S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "Delicious bone marrow, but a hit or a miss. I've ordered it a few different times and some had no marrow in it/were really hard to get out to spread on the toast. A gem of a taste when you did get it though.", "author": "Jenny A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-02", "description": "Dear Management of Henry Public,\n\nYour restaurant is beautiful.  It's easy to do the whole \"pre-prohibition,\" wainscoted, Edison bulb thing following the tedious and cynically conceived blueprint set down by many of the other wannabe vintage joints, (see Rye in Brooklyn for an example of it being done badly) but I am happy to say you pulled it off very very well.  Sadly, that is where my praise ends.\n\nHad drinks and dinner a couple weeks back and was sorely disappointed (I'm happy that your bar area became packed on a Thursday night, but sadly the music only got louder as the din of the customers increased).  By the time I left around 10 it was totally deafening and I was literally shouting to my friend seated 2 feet in front of me.  The choice of music was also lame and painfully unsympathetic to the space.  *Note to all restaurant/bar owners: music is intended to fill the silence of a sparsely filled room and add to the ambience.  What the fuck is the deal with blasting music so that people need to shout over it at dinner?  NO ONE enjoys it and it just makes you look like dicks.  I digress.  \n\nAs for the food, I had the burger, which should be simple enough.  I was pleased to see that grass fed beef was used, but sadly the preparation did no justice to the good meat as my \"medium rare\" burger came out medium well.  I asked for it to be replaced and it was, which took another 15-20 minutes, at which time my friend was finished and I was just starting.  Burger was still overcooked and disappointingly bland. The fries tasted out-of-a-bag.  Didn't try the rest of the menu, but what I saw looked paltry when considering Henry Public's \"gastropub\" status.  \n\nYou guys have a great space.  Would love to visit more, but it's just not very good.\n\nSincerely,\n\nSean", "author": "Sean C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "I would never have written this while living two blocks away but since I moved:  goddamn I miss this place. Great bloody marys. Great brunch, simple light or heavy, whichever you need. Perfect bar snacks. Great drinks. Gets annoyingly packed, but when it isn't it's damn near perfect. I was a barnacle for a while and miss the hell out of it. Cash only. Only downside.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-27", "description": "I'm a huge fan of Henry Public!  We live in the hood and it's an easy jaunt over to Henry and Atlantic ... and we make it often. Soooo ...pro's about this place : \n\nSpecialty drinks are superb and the bartenders and bar backs very friendly. I usually start with a specialty drink (Beechers Tonic is my FAV!) which gets a good buzz started and then switch to a beer; though the beer selection is slight, it is still very good \n\nThe oysters and the accompanying relish are so delicious! I love a place where I can always depend on good oysters and Henry Public is one of those places. Late night I have gone and they've been out, but that's to be expected when eating at midnight and going for something like oysters at a place that doesn't specialize .....BUT ..... \n\nThe all time winner ... which has been referenced time and time again, is the turkey leg sandwich. I was picturing one of those giant things you get at the state fair and wondering how it could be so good??? Not at ALL ... this is like the best pulled pork sandwich you've ever had, but creamier and more home style ... the fried onions on top are such a treat and the side of pickles ... RIDIC!!! It's a must have and one of the best things I've ever eaten in terms of comfort food .... \n\nA couple cons which keep it from being five stars in my book: \n\nCash ONLY! I should be use to this by now (living in Brooklyn) yet, every time I go, I end up throwing down my credit card like it's my first time there and then having to run to nearest the ATM (there should at least be one in the establishment). \n\nA little crowded ... I really like the ambiance of the front bar and in the back I kinda feel like I'm sitting in a Cracker Barrel ... yet it's HARD to get a seat in the front between 7pm and midnight on a Friday or Saturday. I guess that's good for them, but has honestly been a deterrent at times for me. \n\nAnd lastly ... when going there for my first brunch, the back room was FULL of babies and toddlers. I was lucky enough to grab a booth in the bar and enjoy. Good for parents ... but I'm not yet one, and I even saw a couple go back to be seated and then walk out because of it ... (understandable if a bit under the weather on a Sunday morn .. : ) \n\nAll in all ... this is a must if you have not yet tried it ....", "author": "Renee P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-07", "description": "Pretty good cocktails ($12), good atmosphere, burgers start at $16. I had the famous turkey leg sandwich and didn't love it so much. It was good, not great.", "author": "Speedy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-15", "description": "Henry Public is one of those places that  you want to like, it looks cool and cozy, so as the level of annoyance increases as the meal goes on you think to yourself, why? Why did you have to mess it up so badly? Why? It's not so difficult. Its a pub. Its a pub with some food, pub food.\n\nRun down:\n1) Slider served on large bun, is still a slider on a bun, not a burger. And for $15?\n1.5) Fries. Frozen fried in old oil\n2) Annoyngly Cash Only\n3) Menu is so small its a joke. I've said this before about places pretending to be Gastropubs. So let's take it slowly, 'gastro'+'pub'= Gastropub. It assumes a level of gastro(nomy) over and above having 4 types of burgers (no cheese, cheese, bacon, cheese and bacon - seriously, earthshattering!) and a turkey sandwich.\n4) Expensive\n5)Painful service. My root canal dentist feels like a massage by comparison\n\noh did I forget to mention cash only? \n\nIts definetly not a gastroub. One of my favourite gatropubs, The Bumpkin is in Nottinghill, London (UK not Ontario). This is a gastropub (http://www.bumpkinuk.com/). Henry P, take out your pencil and pencil sharpener and take notes. That is along with all the other Gastropb-wannabes of the city.", "author": "Daniele D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-09", "description": "I REALLY like it here, but I want to love it... and I don't.\n\nIt's a perfect Sunday bar- comfortable, low key, and homey. Not a huge selection of beer, but always excellent choices on tap. The toasted almonds are to die for, too.\n\nBut, the service is always stupid slow, like, an uncalled for kind of slow. As if they're just not paying attention to you. Last time they forgot to add the drinks we had at the bar to our table tab, and, being the good (dumb?) samaritan that I am, I did everything in my power to find a way to pay for them. It took 20 minutes, and I was basically laughed at. I guess that last part was deserved, though. Plus, cash only. Gross.\n\nBut, the French Toast is yummy, the music is good, and you can hunker down for the day if you get there early enough to claim your spot.\n\nI just can't stay away.", "author": "Amber S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-02", "description": "At first glance, Henry Public is exactly what I'm looking for in a restaurant. Or bar. Or public house, I guess. Dark wood, candlelight, smoky mirrors. The bartender was even wearing a vest (!) and a mustache (!!) and drying a glass (!!!) when I walked in. The cocktail list looked decent, and the prices were reasonable. I went with a beer, but tried my friends' drinks- they were good, and strong. The menu wasn't as inspiring- only a few entrees to choose from, but they all sounded like great choices. I ordered a \"hamburger sandwich\" with cheese, and my friend had the turkey leg sandwich.\n\nI wasn't sure how a hamburger sandwich would be different from a plain ol' burger, but I found out when I received my order. The chef should be applauded for his/her remarkable restraint. The sandwich was about the size of a slider, an overcooked patty placed on a brioche bun with a sprinkling of melted cheese. I ate it in about 30 seconds, and then spent 5 minutes explaining to my friends how small it really was, and how hungry I was, and how much not of a pig I was. In the hamburger sandwich's defense, the fries that accompanied it were delicious and bountiful. However, the $14 price tag that accompanied it was the opposite of delicious. Want bacon on your hamburger sandwich as well? That'll be $17! Those kinds of prices are fine when they reflect the quality of the food, but they just don't here.\n\nWhat the prices also didn't account for was the pain and suffering my friend and I experienced a few hours after we left the place. I won't go into details, but I spent a good chunk of the night embracing the cool tiles of my bathroom floor. I haven't gotten food poisoning since I was a kid, and it was really surprising that it would happen on a Monday night at a pretty upscale restaurant. \n\nTo put it mildly, I was kinda bummed by the my overall experience. I'll probably come back here for drinks since it's close to my school and my friends seem to like it. But I'm definitely staying away from the food-  I don't even wanna know what would have happened if I got the bone marrow.", "author": "Diana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-13", "description": "Totally going to disagree with Andrew T. about this one. Tider, whatcha talkin' about ??\nI keep coming back here for the imaginative drinks, the waiters' suspenders, and the old fashioned cash register.\nLast Friday my bf and I decided to try the food here, and my burger craving was more than satisfied. I had mine cooked medium-well-ish and it came out of the kitchen perfectly. Grilled on the outside, juicy, tender, and still a tad pinkish on the inside. The meat was top notch quality.\nThe drinks were fantastic (if you like ginger do try the Wide Awake cocktail), and the fries were salty, crunchy and addicting. My gluttonous self could not finish the meal, so I asked to pack up the fries and brought them over to Floyd's Bar to finish over cheap beer and Bocce.\nAll in all - a great evening.\n\nBonus: a few weeks ago I spotted Jake Gyllenhaal smoking and mackin' it with two chicks outside Henry's Public.", "author": "Marina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-28", "description": "I discovered Henry Public thanks to the cooking channel. No lie. As soon as I watched the segment on them, I emailed a pal and she was down.  So worth it. \n\nI realize that this pub is getting and has been getting a lot of hype which can explain the level of expectations by some, but honestly, it's like walking into Stumptown and saying I want my Starbucks. Go somewhere else. \n\nSpeaking of Stumptown, If you're looking for the sit down, pub counterpart to Stumptown (at the Ace Hotel), you've found her. I love the randomness of the location. It's not on Smith or even Atlantic, it's almost tucked away, which helps with the quaint, old time feel of the restaurant. I felt like I was transported to the Prairie West when people lived in small wooden homes, men rode horses and outlaws ran the show. \n\nI thought the food was spot on. The burger, while yes a bit smaller than normal, had a great taste to it and the bun was just perfect. It was super toasted, my burger was done medium and with the cheese and bacon strip and some ketchup and pickles it was exactly what I needed! My friend on the other hand, ordered the turkey leg sandwich and it was HUGE and so tasty. Jesus. So freaking good. The difference is that I walked out content, my friend walked out stuffed. The fries that came with the burger were the shit. Or as I told my friend, like crack. \n\nFinally, we shared a place of their wilkinsons, which were f'ing delicious. I mean, pancake balls with rum caramel sauce and moist on the inside. DELICIOUS! Also, they were perfectly golden all around. I could eat these for breakfast. As a matter of fact, if I ever get married, I might have to order them instead of cake. Hands down this dessert is one of my favorites. \n\nNow, because I'm a gal, I ordered the Two-Cents Fancy, to drink which is pear, tarragon honey and champagne. So good. So well presented (small dainty old school champagne glass). So perfect for a beautiful between Spring/Summer day. I highly recommend it. \n\nThings of note: \n-Go early. At around 8, it starts to pick up and get a bit loud.  \n-Bring cash. It is cash only. \n-The drinks menu has the prices listed below the two sets of drinks--if you don't pay attention you'll miss the 10 and 11 dollar price tags. \n-It is small inside, but totally cute. \n\nThe wait staff was great. They offered solid advice about drinks, which I appreciated and were overall attentive to our needs. \n\nOh and lastly, this place is a great little date spot. \nEnjoy!", "author": "Sara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "I'm not even a fan of getting a turkey sandwich for dinner, but my god...this was out of this world!  Not only is it enormous, but it's peppered and full of heavy goodness.\n\nThe ambience in the restaurant feels warm and inviting, but also like it would survive the coming zombie apocalypse with no problem.  It's definitely a neighborhood favorite.", "author": "Anju R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-23", "description": "Yes. The turkey leg sandwich is as good as you've heard it is. If you go to Henry Public and don't order the turkey sandwich, you are CRAZY. Being vegetarian is almost not an excuse. It's that good.\n\nThis would be more of a five-star place if the menu wasn't sooooo one-note. Apps, burgers, amazing turkey sandwich, sides, a daily special or two. Also it's a little bit like hipster catnip in there, but oh well. It's worth it.\n\nDrinks are good. Food is good. Dining room is tiny. Expect a wait.", "author": "Diana R."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}