{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-06", "description": "Wow, this is probably one of the grooviest spots for eats in Brooklyn, almost archetypal in how a Brooklyn eatery looks and defines itself with 19th-century décor made 21st-century fresh! \n\nThen, there are the drinks and food. For a Sunday brunch, the brief menu might surprise some folks but then upon seeing portions and the quality of taste that goes into each mason jar of drinks, or retro-tin platters, you realize: Henry Public works.\n\nI'd highly recommend sampling their specials, eclectic yet down-to-earth on the brunch menu. I sampled a Spicy Pickle and Hard Boiled Egg Sandwich with fresh kettle chips which could work to be devoured in the mornings, savored in the evenings, or anytime in between. Allegedly, for interested carnivores, the pork sausages are a treat in and o themselves...", "author": "Matt Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-01", "description": "Whoa.  The turkey leg sandwich.  After years of hearing of this sandwich, I finally got to try it this weekend and it exceeded all the hype I've heard.  The sandwich is like a big, cozy, warm blanket hug when it's cold outside.  It's incredibly flavorful and comforting.  I could eat it every week.  We also tried the deviled eggs which were very good.  Prob my second favorite in the city behind Spotted Pig.  \n\nThe atmosphere was also super chill and relaxed.  We came in around 3 on a Saturday and it was perfect.  A couple of tables taken up but plenty of space.  The service was friendly and good.  We will definitely be back.  I'd like to say I'll try more things there but it's going to take a while for me to stray from that turkey leg sandwich!", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "A great place to have a drink. We walked in around 10PM, and the place was full, but not crowded. I felt transported to a different era: 19th century saloon. And I liked it.  The bartenders were attentive despite the never ending queue for cocktails. Each drink was carefully crafted with precision.  The prices for the cocktails were a bit pricey for Brooklyn standards ($10 and $11) but well worth it.  \nHere is the rundown:\n\n1.  Kings County Sour - (rye whiskey, lemon, sugar, egg white, port float) Sort of like a whiskey sour but with a nice kick thanks to the egg whites. The cherry garnish was tasty!\n\n2.  Wide Awake cocktail - (gin, lemon, ginger (fresh and liqueur and isley scotch) A grown up gin and tonic. I really liked the dried crystallized ginger that garnished the drink. \n\n3.  Public Smash - (bourbon, mint, maple syrup, aromatic bitters) Wow this drink was strong and cut to the chase! \n\nI did peruse the menu and spied a \"marrow bones\" dish and although we didn't try it this time, something tells me I will be lured back for more!\n\nPS They have coat hooks under their zinc-topped walnut bar. That is always a plus on my list. That means the owner(s) were thoughtful when planning out the place.", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-09", "description": "I can't help myself. Why do I scan the menu everytime I come here? I shouldn't even bother. I'm just going to order the turkey leg sandwich anyway. \n\nOh, and did I mention the cocktails here are pretty damn sweet?", "author": "Gil S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-25", "description": "Hipster-ass hipster food for hipsters.  \n\nIf you're a hipster, you'll love this place.  I'm sure I'm too unironic and mainstream to understand the appeal of this place.  As I sat down in the faux-old decor of the place and got my overpriced menu, I thought I might be in for a \"treat\".  But my friend highly recommended the place, so I stuck around.  By the time my 8oz Coca-Cola arrived -- complete in the old style bottle -- I knew I was right.  \n\nIt didn't get much better from there.  I can appreciate a rare steak, and if the quality of the beef is high enough, I've even been known to tolerate a medium well burger.  But a blue cheese burger shouldn't come out \"blue\" -- meaning completely cold in the center and the outside just seared enough to let you know it had seen a grill.  I guess this is the ironic thing I just don't get.   Either way, I really couldn't eat a two inch thick burger that was essentially a lump of raw ground meat.   Fortunately, it was replaced with a proper medium burger, though this took quite a while to actually happen.\n\nHowever, the service was very good, and the fries were done just right.  That saves this from being a one-star review, since I'm not a hipster and don't appreciate \"fine\" cuisine.", "author": "Jack M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "Beer menu was fantastic- Old Hen Cream Ale was tops.  Fries super tasty, and everything we ordered was simple but very well executed - including oysters, deviled eggs....  I'll be back.", "author": "Steve O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "HAHA i love oscar the grouch bashing hipsters for liking old stuff. anyway, this place is obviously solid, little on the pricey side if your budgeting tight. But excellent food, superb cocktails, great selection of beer.\n\nmy only real problem with this place is the line to get a table, or what slow eaters hipsters are", "author": "Lucas P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-27", "description": "Love the food, but service is ALWAYS bad. Zombie-like, inattentive, a friendly greeting or a smile is extremely rare, which would be ok if indifference were not the most consistent characteristic. It's really too bad...", "author": "Roz B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-06", "description": "I know ppl who really really like this place.  I think its just meh.  The cocktails are well-made, but expensive for the neighborhood.  And worse expensive to be cash only.  \n\nThe burger and fries are really good, but the service is kind of terrible.  Sure, the waiters/waitresses are dressed in old-timey getups to help with the ambiance and its cute, but they are not very attentive - and the bartender won't serve you if you are at a table.  So, you just end up sitting there waiting to try to catch Mr. Handlebars Mustache on your way to the restroom.  Poor service is something I can't forgive.  Sorry.  I can get a great burger and fries at plenty of other places (for far cheaper).\n\nAlso, the place gets loud.  REALLY REALLY LOUD.  Like scream to be heard by the person sitting directly to your left loud.  \n\nIn my mind, good food and cocktails cannot make up for poor service, overly loud and cramped space, and expensive eats/drinks.", "author": "Vicky L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "It's very nice place .who like old school gonna love this place ,I like everything  in there ;)......so go check if u have time :).....:)", "author": "Artur A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "Such an adorable place!  We stumbled into here for a drink after wandering around Brooklyn for a bit in the cold and decided to stay for some food.  We split the turkey leg sandwich(which came with fries and AMAZING pickles), a side of brussel sprouts with bacon and an order of deviled eggs.  There were only three eggs in the plate, which I found bizarre.  What happened to the other half of that egg?  Very tasty, just strange to see deviled eggs not served in pairs.  The sandwich was fantastic; I'd probably go back for that alone.  \n\nMinus one star for being a little overpriced.", "author": "Stephanie O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "Preface: I would have given this place 4.5 if that were an option (see last paragraph). \n\nSo I've been to Henry Public a handful of times and, as of now, just returned from my most recent visit so consider this review hot off the presses. I opted for a seat at the bar as I was by myself and just looking to have a nice dinner after a long day and was quickly taken care of by the attentive bartender (I didn't catch her name). \n\nThe menu is not very extensive and every time I've gone there I've ordered the same entree, the turkey leg sandwich. The other entree options on the menu are burgers, mac and cheese, steak, marrow bones, or salads in addition to a selection of vegetables/small sides. All of which I feel you can get easily at other establishments and once you've had this turkey sandwich, you'll likely agree that there is no reason to be adventurous with the entree selection. The turkey meat is exceptionally juicy and the thick cut bread, with a nice slight char from the grill,  absorbs all the run off juices before it turns into a sloppy mess. This is such a hearty sandwich that you'll easily forget about the mound of fries on the other side of the plate.\n\nBut you don't just come here for the food...this is a cocktail bar afterall. I was quite pleased with the Kings County Sour and the Brooklyn Ferry, both of which are rye based drinks. The Kings County was a refreshing/semi sweet drink with egg whites, lemon, and port float while the Brooklyn Ferry hits like a heavyweight with the rye, vermouth, maraschino liqueur and absinthe. Normally, I'm not a fan of absinthe because the liquorice flavor it usually imparts but the bartender assured me that it was a well balanced blend and not overpowering. I went with her recommendation and am certainly all the better for it. \n\nLastly, the ambiance of the place is regular Brooklyn-chic (read: suspenders, facial hair, and nothing (except for the ipod) made in the last 70 years adorning the walls). It is overall a pretty classy place given that is just a stones throw away from the hustle and bustle of Atlantic Ave. It does seem to fill up pretty quickly and I wouldn't recommend bringing a large group here. Also note that it is a cash only establishment with the nearest ATM being across the street so plan ahead. \n\nSo what stopped the 5-star review? The prices could stand to be reduced a little bit. You feel as though you're in Little Branch or Dutch Kills when you are cashing out. I would like to try a little more of the small plates before I can pass full judgement on the food options. Also, the seating situation can be tight and had I not have been there early enough I could have easily walked in and turned around due to overcrowding.", "author": "Troy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Wait staff polite, generous and helpful. Food was delicious and drinks were just as described. Will come back for brunch ASAP!", "author": "Brian R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "Dang that turkey leg sandwich is good. Wash it down with some spectacular cocktails. Yum.", "author": "Becky M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-10", "description": "Ok joint. Baked macaroni was good. Turkey leg sandwich good, but not awesome as many reviewers claim. Beers could be $1-$2 cheaper. Waiter was slow and not very attentive to customers. Nice ambience and cool music though.", "author": "Rick S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-27", "description": "The drinks are really good and the food is fine-not-great. That makes Henry Public a perfectly nice place to drop in for one or two really good cocktails or beers and maybe a shared dish, but it isn't a food destination and it's a little too expensive for most people to be able to go frequently anyway. \n\nOne last thing about the cocktails: if you like super-sugary cocktails, this isn't the place for you. I like strong cocktails that pack a punch, and Henry Public does those well -- which, again, is dangerous because it ends up being really expensive if you get more than a few!", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-27", "description": "Came for post-brunch cocktails to catch up with a friend. While they didn't have mimosas on the menu, they were nice enough to quickly whip some up for us anyway (though at around $10 each, they were not cheap-- might've been more worth it to get a regular cocktail!).\n\nIt was pretty empty the early Saturday afternoon we were there, but had a pretty laidback feel which was exactly what we needed. Not a bad spot, and probably somewhere I'd come back to for cocktails at night.", "author": "Alice C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "This place is absurdly trendy in the late-1800s sort of way that is penetrating all of New York these days. However, don't let that detract from Henry Public. Underneath there's a great bar lurking with some pretty delicious food to boot. \n\nThey serve awesome cocktails (Kings Country Sour and Sweet Liberty Smash were my personal favorites of the evening) and the bartenders are really cool. My biggest beef with the place is that it is a bit pricey for cash-only establishment.\n\nAs far as the food goes, the turkey leg sandwich is amazing. It's also huge, so don't go overboard with other things. The pickles were a bit boring but the deviled eggs were good (yet still not worth the money in my mind) . Had a side of brussel sprouts as well, but I found them to be a bit overcooked. The french fries are boring (particularly for being pretentiously billed on the menu as \"french-fried potatoes\"). Wilkersons are awesome (fried dough always is, though), but I was not so much a fan of the rum sauce.\n\nAll in all, Henry Public is a great spot. It's got some minor drawbacks (and granted, we were there on a night when it was not packed) but it's definitely worth a trip to check it out.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "Came here last night for a little Monday night hang with the lady.\n\nAtmosphere:\n- Great vibe.  Very low key and old school authentic speak-easy-esque\n- Almost something out of a good new york movie where you are like \"where is that place?\"\n\nFood:\n- Turkey leg sandwich was incredible.  Braised in milk, spices on a nice thick toast.  I'm still dreaming of it.  Just very very amazing\n- Macaroni with savory items could have been a little more inventive.  I was looking for some bacon or pig in there, could have used more kosher salt and nice cracked pepper.  I just feel this dish could be a bit more thought out.  That said it was good and heavy\n\nDrink:\n- We got the smash, which was just OK.  I'll try some more drinks here.  The bartenders do know what they are doing\n\nOther:\n- This is the type of place you could make yourself a regular at.  Just a cool, unassuming place\n- Cash only.  Nearest ATM is in the bodega across Atlantic", "author": "Matt B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "I'm sure this will be great when I'm the first one there for happy hour in 2 hours, 39 minutes and 59 secs...  58...  57...  :P\n\nFast forward.  Henry's Public is a place I would bring friends... but not too many of them.  Mostly, just because we'd have trouble getting a table, but also bc I wanna keep it on the down-low.  It will never be one of those beer-in-plastic cup places.  Rather, expect cozy couples and mellow groups who value good conversation and a steady drink over the high scene.  The atmosphere invites, with its friendly neighborhood vibe, nostalgic old school décor, and jazz age music.  A limited selection on tap suggests careful culling, as does its small menu of simple gourmand eats.  No grand opening happy hour specials, but maybe I'd return just to try the turkey leg sandwich...  (3.5 stars)", "author": "Andrea L."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}