{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "The cozy atmosphere makes Henry Public a great place to stop in on a chilly winter's night. We just went for drinks, and getting over a cold, I had the Wide Awake cocktail. Gingery and lemony, it was just what I needed. And I hear their Turkey Leg sandwich is a must have--I'll be back for that!", "author": "Katie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-08", "description": "I pretty much rejected this place the moment it opened. I'd had my fill of bartenders with Vests and the Housemade bitters that come with them. Way too much thought put into shit hanging on the walls and the ornate coat hangers and faux gas lamps. \n\nBut that turkey sandwich that i kept hearing about finally washed away my caddy tendencies and so my wife and i found ourselves at HP on a fairly empty saturday afternoon at about 2pm.\n\nThe turkey on the turkey leg sandwich is outstanding.  It is all dark meat, braised in some impressive way with what im guessing is milk. I dont 100% agree with the bread of choice or the idea that it should be eaten as a sandwich.  Its a sloppy sogging mess. Its a little confused. But its still very, very good.\n\nMy wife got a BLT, which was nothing special at all.  Her bloody mary on the otherhand was terriffic.  The service was terrible.... in the way that you are just waiting way too long for the little stuff like... water. drinks. etc. \n\n2 sandwiches, deviled eggs, a beer, a bloody mary... $65 (incl tip). not a terribly appealing value. \n\nIn the end i dont really understand this place. I will however be trying to recreate that turkey in a few weeks..", "author": "Gabriel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "Went here on a weeknight for a beer and a bite to eat not expecting anything. My girlfriend had just moved into the neighborhood and this place was recommended to her. \n\nI had the Turkey Leg Sandwich - I don't know if being really hungry had a little to do with it.....but this was one of the best sandwiches I've ever eaten in my life. At first I was taken back by the price since I usually don't pay more than $10 for a sandwich unless it has gold in it.....but after eating it, I can make an exception..\n\nThe atmosphere is pretty cool too....like you're in the 1800's. Can't wait to go back....\n\nOnly negative I would have is that they don't do take out...also they don't take credit cards!", "author": "Avi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "I loved this place before I ever ate here- do you ever have the experience?  \n\nI'm often like this with an expensive purse or sweater I like.  I eye it for six months, imagine myself walking around with the purse and how cool I will look.  Then I finally save up enough money to buy the item and it isn't quite how I imagine.  The color is a bit off, its smaller than I thought, the snap doesn't work in a logical way.  But I use it constantly regardless, because I committed to the purse and I ogled it for so long.  I will myself to love it.\n\nHenry Public is like that.  I walk by there every day and it always looks so adorable and all the foodies say its the best turkey sandwich in town.  And yeah, the food was good, but not particularly notable.  The atmosphere is great, but pretty cramped 'cause everyone wants in on the goodness. \n\nSo I'm sticking with the 4 stars because I always dreamed it would be great and it wasn't bad, in fact it was good, but it didn't blow my mind.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Fab fun place drinks were amazing get Darren or Christian to help you out......................definitely go back again", "author": "Maxine B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-23", "description": "loud Loud LOUD (eventually had to leave and go out to Atlantic Avenue just to hear ourselves talk)\n\nthis place is also REALLY small, as in TINY: 3 tiny tables, 4 booths, and I think 7 barstools up front, 2 long tables in back that each sit maybe 8 people\n\nwaitress service was terrible\n\nNONE of the drinks on their menu had vodka in them--what's up with that? Had to order vodka \"manually\"--as in, \"Vodka and Coke\"--and the waitress literally said, \"What?\" as if she had never heard of such a combination\n\nseriously, how can a place be SO popular, have SO many employees, and deliver such terrible service to the tiny handful of customers they have?\n\nalso: my grilled cheese sandwich arrived burnt--how hard can it be to make a grilled cheese sandwich?\n\nI do not understand why so many Yelp reviews rave about this place\n\nnever returning", "author": "Sandy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-23", "description": "This is a nice place but not fancy for $$$ they charge too much for drinks and we were surprised when we were charged 50.00 for a bottle of Red Wine!!!  Prices should be posted so customers know what they can spend !!!", "author": "Bella B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-22", "description": "Gets one star for a competent bartender.  The rest of the experience was other-wordly.\n\nShowed up Thursday night at 8 with a group of three.  The fourth was running late, but we were told it would be a 30-45 minute wait anyways.  Had a couple drinks while the host continued to check in on us, then POOF!  He's gone for the night.  I approached a waiter and asked about a table, and was told it would be another 20 minutes.  30 minutes later, I was told that the diners at our table were \"ordering dessert\" and it would be another 15-20 minutes.  What was strange was how indifferent the waiter was every time he bumped us another 15-20 min, like it was no-big-deal after already waiting so long.\n\nSo, 1 hour and 40 minutes later, we left.  Can't rate the food, but the waitstaff gets a big ZERO.  Oh yea, unless you're friends with the waiters (a group of four walked in 20 min after us, embraced a waitress, and immediately sat down).", "author": "David B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-04", "description": "Decent drinks, ridiculous table policy.\n\nMy friends and I visited on Saturday afternoon after a visit to the Transit Museum. Two of us had burgers and two of us had drinks and some snacks (the roast almonds were excellent). We each had a nice pricey cocktail ($10-11 each) plus the food. Then a couple more friends joined us and they had drinks. Our nice waitress mentioned that she was going off shift and that we should settle up our bill. We assumed that we would just start a new tab with the next waitress.\n\nGuess we were wrong. We waited with emtpy glasses for quite a while then finally flagged down the new waitress to order more drinks. She deferred to another employee who told us that the tables were for people ordering food only and that \"we would be welcome to hang out at the bar\" which would have meant standing in an open space by the door which was freezing due to the sub-20s temp outside. \n\nHere's my reasoning for being irritated by being kicked out of our table:\n\n1. The most expensive item on the menu is a $16 burger (if I'm remembering correctly). The cocktails are $10-11. We would certainly have had at least two cocktails each, probably more. Who has more than one burger? The economics of reserving your tables for food only when you have a tiny menu and your drinks are more expensive than the food makes no sense to me.\n\nIf you want to be a restaurant, focus on the food. If you want to be a fancy cocktail joint with interesting food, thats fine too, but then you have to allow people to purchase your cocktails. \n\n2. We had already spent close to $150 with tip, why not let us spend more?\n\n3. There was no one actually waiting for a table. So why rush us out of our seats to a cold, drafty space next to the door?\n\nOur experience at Henry Public was so typical of Brooklyn bars these days: interesting ideas, creative concepts, good food and decent drinks but total failure in giving a good customer experience. At the end of the day, square ice cubes and grass-fed beef are merely window dressings.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-22", "description": "Wow.  Steampunk wait staff and a little handbill menu.  I was really starting to miss 1911.  The best thing about 1911 was the grilled cheese sandwiches with apple slices.  It is also a matter of known fact that \"medium rare\" hamburgers were served crispy in those days.\n\nBut here's the real thing.  It's a cockish \"cocktail bar\" so I'll order a cockish cocktail.  The base of a French 75 isn't lemon juice.  It's Champagne and dry gin at a 5:2 ratio.  And it's served in a Collins glass.  It's not surprising that the clowns behind Brooklyn Social are the purveyors of this anachronistic nonsense.\n\nThe pickles are really, really good.", "author": "John B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-05", "description": "3.5 stars.\nGreat food, pleasant vibe, ADORABLE interior, but pretty average-to-poor customer service, and pretty expensive.\n\nMy friends and I came in around 6 on a Sunday evening and we were seated quickly. Then, they forgot about us for probably 20 minutes. The waitress eventually came back saying \"I'm so sorry; the owner is here with his family at that table over there so I'm a little busy, ha ha ha, sorry if I'm a little off my game tonight\".  \nSorry, but isn't that kind of a slap in the face? Like, there are people here more important than you so you can deal with it if I'm subpar? Huh.\nAll of the other staff were pretty cold and aloof. I just don't get it.\nAnyway, the cocktails are great, and the food I tried was superb. The turkey leg sandwich is as epic and awesome as its reputation suggests, the bone marrow on toast is intensely awesome (please eat it with the pickled onions), and the burger was great.\nI recommend coming here because it is really cute and cozy, but just know what you're getting into with the prices and the weird service.", "author": "Emma G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-01", "description": "The most amazing burger I've had since trip to Germany in 2008. Wonderful!!! Will definitely go again!", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "Special drinks. You come here and get to drink things you wouldn't ordinarily get. Good times. \nReal nice place. Cozy\nHipster bartenders, feels old timey", "author": "Matt M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-17", "description": "So how about a nice big helping of attitude with your $11 cocktail?\nI stopped in the other evening for a drink.  The place looks great. Can't really comment on the food because I didn't have any.  A lot of people around me were devouring french fries, which I guess is a good sign if you like fries.  The problem however was how the staff  talked to/and treated the customers.  I haven't seen a bartender so pretentious in quite a while.  She seemed to almost have a disdain for the customers, whether they be young or old.  Everyone seemed to be dealt with in the same manner.  So it's a shame that the warmth of the place, is not reflected in the staff's disposition.\nSo if I'm looking to just have some drinks, I'd rather spend my time at Floyds, or Roebling Inn.", "author": "ed m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "One of my favorite spots for drinks in the Brooklyn Heights / Cobble Hill area...great for date, friends, and have some interesting cocktail combinations. Be warned though - tis cash only.", "author": "Heather F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "A little gem of a gastropub.  Romantically old fashioned, with very civilized and fun cocktails, we were there for the turkey leg sandwich that made the NY Mag top 101 sandwich list.  With turkey leg meat, braised in milk and herbs, and I think there were some caramelized onions on pullman slices, the sandwich was as comforting as a mac and cheese pillow.  Cheeseburger was also quite hefty and well cooked, accompanied by perfectly cooked french fried.  \n\nNice service, very cozy atmosphere.  But what's with the cash only???  Oh Henry!", "author": "Grace L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-18", "description": "Their Turkey sandwich is awesome!  It's like a pastrami sandwich--but TURKEY.  A must try.\n\nHowever, their Daily Special, the \"macaroni with cheese,\" is literally just that.  Some macaroni, with a sprinkling of cheese.  Don't order it!  It's dry, bland, and there was hardly any cheese.\n\nThe drinks are yummy, service is congenial, and the small little food treats are a gem.", "author": "R O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "So right around the time I thought that there was no good coffee shop in Brooklyn Heights [Yeah Iris!], I also thought that there was no good cocktail joint. Though technically not in the Heights, this is the best shot you have to getting a bourbon cocktail with some egg whites in it. It can get crowded at night - but that shouldn't be surprising because its the only place of its kind for blocks and blocks. \n\nAnd the turkey leg sandwich is divine. Its like a pulled pork-esque bundle of joy. Plus the bourbon drink = Brooklyn Heights isn't down for the count quite yet.", "author": "S B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-08", "description": "Henry Public is the best Williamsburg bar not in Williamsburg. Important bullet points: friendly staff; proper ice cubes; TURKEY LEG SANDWICH.  \n\nIf this place existed when I lived in Brooklyn Heights, I may have failed out of school - take this as a ringing endorsement. 5 stars.", "author": "Chris K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "I went there on a date not expecting much...... But it far exceeded our expectation! It's a super chilled, unpretentious spot, good for a late night drink. Highly recommended. It also helps that the staff is very friendly.", "author": "Nayka A."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}