{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-22", "description": "Was visiting a gf that lives in Brooklyn... she recommended the place as she'd been there before.\n\nI'm not much of a drinker, so I can't comment on any of the beverages, but I will comment on the food, service, and atmosphere.\n\nFood:  We had the turkey leg sandwich.  Yum!  Definitely worth it as I only ate half and saved the other half for another meal.  It wasn't what I had pictured in my mind, but there was a lot of meat and all very tasty.  It's a messy sandwich meant to be eaten with a fork and knife, I think.  The fries were really great as well!  My friend polished off her fries before even digging into the sandwich.\nWe also shared the bone marrow.  If you're an adventurous eater, it's worth a try.  May be a bit salty, but great flavor none the less.\nFor dessert we shared the Wilkinsons.  If you love donuts or funnel cake or caramel - you'll enjoy this.  Overall the food was fantastic.\n\nService:  Very nice folks... no complaints here. The guys were very courteous and helpful.  Plus they all played the part and looked very much as tho they fit the scenery.  It's a hipster thing, I guess.\n\nAtmosphere:  We got there before it got crowded, which was good because we got seated quickly.  One of the drawbacks is the restroom.  It looked as though there was only one - a single unisex restroom way in the back and some unfortunate people got stuck sitting at a table next to it and it's growing line.  As people have mentioned, it's got that 1800 decor and feel, and gets kinda dark.  I personally like it.  But the place fills up quickly and gets loud.  On the Friday night that we were there, there was a very loud group 2 tables away.  This is a cool date place, but not a romantic-date place.  I enjoyed it and I wasn't even on a date!\n\nI will also note that there were a few other Austinites that reviewed this place and commented on the expensive prices for the food.  What's missing here is managed expectations... this is NY, not TX (and certainly not Austin, where food and beverage prices are much cheaper because cost of living in general is cheaper compared to NY).\nIf I find myself in Brooklyn again, I'd go back to try other items.", "author": "Gloria T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "Walking into Henry Public is like walking back in time, but the food keeps up. \n\nSimple and delicious. Limited menu. Can't go wrong with the classic burger.", "author": "Sophie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-06", "description": "My first reaction was at the door. What is this place called? What does that symbol mean?? It means you're going to be in someone's 18th century abode surrounded by old classic paintings that remind me of Sherlock Holmes.The seating is self serve. Once you find your spot the waitress approaches with water and specials. \n\nTheir cocktail list is fun to run. I found out I don't like Applejack (which is apparently a spiked cider liquor). Perhaps it was the drink itself, the Ward Six, which was a little too fruity even for my girly self. They redeemed themselves with a public smash (minty bourbon sweeted with maple syrup. There was still a little bit too much ice in my drink but it did look nice. The Kings County Sour was delightful even for a sip.\n\nI had a \"hamburger sandwich\" which was really a classic burger with fries. The fries were a delicious vinegar dashed shoestring which had a great crunch and didn't even need ketchup. My dinner companion had a turkey leg sandwich which was also as he stated very delicious.\n\nDefinitely another world to return to. Next time I'm going to dress for the period. And have the donuts. The elderly couple across from us looked like they were enjoying them immensely.", "author": "Mary P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Why can't all restaurants be like this? The turkey leg sandwich is SO tasty and special - I have never seen this on a menu, and the burger is also fantastic, and it's not too huge. The french fries are perfect, and we also had the roasted beets just to feel like we got our veggies. I love that the menu is limited (and that everything on it is tasty). The service was fantastic - we were greeted right away, seated at the front until we got a table, and when they asked us to move to accommodate a larger party, they were kind and so grateful that we moved,but none of it felt like a hassle. Eating here feels like you're eating in an upstate home where everyone is friends.", "author": "Julia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-27", "description": "It might be tucked just off the main drag, but at around 3 pm on a Saturday, there were still plenty of people enjoying their afternoon inside Henry Public. \n\nI sat at the bar, because with a sweet and competent bartender such as theirs, there's nothing better. A Bloody Henry sounded too good to pass up, and with homemade pickles and the right amount of spice, I know I made the right decision. Just watching the lady do her work, I can tell I want to come back for additional adult beverages, perhaps a Bloody Henrietta (his Michelada-esque sister) or a Public Smash.\n\nHaving heard so much about the Turkey Leg Sandwich, I couldn't resist this mountain of pulled turkey slapped between two hearty slices of white bread. Beware: this is not a dainty sandwich. The well-seasoned dark meat, in addition to being topped by crispy onions for texture and flavor, is soaked through with gravy. One bite, and it is already falling apart in your hands. Strong and decisive [when it comes to food], I pulled off the top layer of bread and attacked it with utensils. An excellent decision, and the gravy-soaked bottom bread ended up tasting like the best part of Thanksgiving (stuffing). With deliciously crispy thin-cut fries surrounding the entire thing, this was an infinitely satisfying meal. \n\nI seem to remember that my girlfriend was also present for this meal, but for some reason, the Turkey Leg is all I can really recall. I know she gave me a bunch of crap about me not listening to her, or something, I don't know, I wasn't really paying attention.* Oh, she did order the bacon, egg \u0026 cheese sandwich though. We might have been too late for the home fries I saw across the bar, but the egg was nice and runny and it hit the spot as well. \n\nAnyway, Henry Public rocks. It rocks enough that I feel ashamed of myself for missing out on it for so long. I promise I will make it up with that delicious-looking burger, and bourbon cocktails.\n___________\n\n*Yes.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "Delightful. A throwback to s simpler time on Sun afternoons with roots band, quaint furnishings and good cocktails. Warm and friendly service. Can't speak to the food bc we just do the cocktails. Sun washed, bead board, old time space.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-21", "description": "I have been to this bar a few times before. The cocktails are well-crafted, the service is friendly, and it is a charming, old-time allure.\n\nThe reason for the five stars, though, is that last night my (now) fiancé and I were treated like royalty. I had just proposed, and we were seeking a local place to celebrate. We sat down at the very first table near the window. A waiter came right over to us as my fiancé excitedly examined the engagement ring I had given her just 20 minutes or so prior. The waiter asked \"Is that new?\" She said \"Very.\" The waiter smiled and congratulated us, and then brought us two complimentary glasses of champagne. We also got a third glass. We asked for the check, which simply said \"Congratulations\".\n\nThank you, Henry Public, for your generosity and for giving us a moment we won't soon forget.", "author": "Jimmy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "This is my favorite bar. Cocktails are spectacular, the turkey leg sandwich is fav sandwich yummmmmm", "author": "Graziella M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "I love this place. The food, drinks, service is excellent. I get their specials, baked chicken, New York steak, and Wilkinson. The ambient is mellow with candle lit dim lighting. Am so glad they are part of this neighborhood! Sometimes they have live musicians on busier nights. Come check them out!", "author": "Carolyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "This place has become one of my favorite locals. I've only had cocktails each one I've tried (and must have sampled at least half the menu now) have been great. Bar men are super friendly and really sweet and I especially like the back area. They only take cash tho", "author": "pamela b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Great stop for some classic cocktails...I can't recall the bartenders name but he knew exactly what I wanted and served up a GREAT Corpse Reviver II.", "author": "Cg T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-27", "description": "So we tried Henry Public about a year ago; my wife and I left disappointed for a variety of reasons. Having seen more favorable reviews recently, we decided to give it another go. As others have mentioned, Henry Public has a 'rustic' décor. Check! I didn't realize that 'rustic' implied hard bar-stools with a raised lip that bites into your legs after 10 minutes... but, hey,  you learn something new every day.  Henry Public is also (as previously stated) a cash-only joint - which is poorly advertised except on their website. At $12/drink minimum and an equally pricey food menu (averages to a little over $14/item by my quick calculation)... you're looking at a minimum bill of $52 for a couple having a single drink with dinner and no appetizer.  That makes an ATM visit mandatory before you show up. I get that credit card fees suck for small businesses to pay... but at Henry Public's high 'price point' there is no excuse for pinching pennies this hard. That is just a poor business decision.\n\nAfter checking our cash situation - and having no desire to lose our seats at the bar to visit an ATM - we chose to have drinks and forgo food this visit. We had a mezcal-based concoction and the Sweet Liberty Smash. The mezcal drink was decent. The Liberty Smash was wretched. I don't get to say that word often enough - wretched.  Craft cocktails are all about achieving a balance between the ingredients. Can you 'free pour' them? For some ingredients - yes. But there is a reason you see most good bartenders using jiggers - and it isn't because it's flashy. I'm not sure where the Liberty Smash went wrong but I suspect it is largely to do with the bartender's heavy-handed free-pour. What should have been a pleasant balance of bourbon offset by sugar, blackberries, and mint with Peychaud Bitters adding nice depth... came out as straight bourbon with a watered-down single bitter blackberry note topped with a wilted mint stalk for garnish. Wretched. That drink convinced us to not get another round. We plunked down our cash in easy sight of the bartender and waited for him to ring us out.\n\nWhich brings us to the service... or lack thereof. When you've put your empty glasses and money on the bar then wait 15 minutes for the bartender to do his job - that's poor service. When the bartender rushes over to ring you up only when he spies your wife slide off her  butt-numbing stool and throw on her backpack to leave... and then has the gall to ask if you'd like another round or want to close your tab - that's the punch-line of a bad joke.\n\nJust to be fair and thorough, once my wife and I get enough cash from an ATM to make a car payment, we'll go back to Henry Public to try their dinner options and a couple more drinks. But we're going to have to be seriously wowed by the food to raise my opinion of this joint.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-13", "description": "Enjoyable place if more for the atmosphere than the actual food.  Specialty drinks were good, especially the King's County Sour.  Bacon cheeseburger was good, but honestly there's like 9-10 items on the dinner menu and 4 of them are variations of hamburgers.  I like a place that doesn't try to have a million items on the menu but 10 total, with 40% being burgers?  That's a bit ridiculous.  Damn burger better be life changing if you're going to depend on it that much and at the prices they charge.\n\nStill, I liked it and would go back if in the area.\n\nImportant to note: CASH ONLY", "author": "Chris G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-27", "description": "Turkey leg sandwich is still worth a trip to Henry Public. Must agree with other reviews on service slipping. Bartender was friendly and attentive however, waitress seemed like she could care less. No greeting and never checked on us unless she wanted to sell another drink. Probably won't be back for a table maybe just a seat at the bar.", "author": "Marina D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "A good old school chill cocktail bar. Most cocktails felt like a bit of a throw back but all were simple and well done. I did not have the food but it looked interesting. I would come here on a chill date or for a chat.", "author": "Ian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "I love the atmosphere as it feels like you've stepped back in time to a bar or home from the last century. The cocktails were delicious and creative. My favorite was the Summer Fancy which included muddled stone fruit, verbena honey and champagne. Delicious! The deviled eggs were only okay but we didn't try any other food. I hear that on the weekends they have a bluegrass band serenading the brunch crowd!", "author": "Ashley D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "One of my absolute favorite places for mixed drunks. Scratch that. It IS my favorite place for mixed drinks in NYC. I'm usually a wine or whiskey drinker but they have a version of a Sazerac that is to die for. \n\nThe food is also fantastic. The Turkey Leg Sandwich is absolutely delicious. The hors d'oevres are really delightful too. I'm a fan of the devilled eggs; the closest to my own that I've ever tasted. The radish is refreshing (I don't know why they serve it with butter but my friends really love the combo. I just like the lightly salted radishes and really appreciate that they even offer them!)\n\nGo here when you can!!", "author": "Mazz S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-07", "description": "\"There WERE ramps!\"\n\nI really really hate it when the waitress forgets to tell us about specials. Even more than I hate it when they forget bread or water. It's being asleep on the job. I really love ramps. And there was a ramp special. Both tables on either side of us got it. It looked really good ... did I mention I love ramps? \n\nThis review almost went down a star if it weren't for two things: \n\nthe incredible sharp cheddar and granny smith apple grilled cheese and its buttery goodness\n\n\u0026 \n\nI heard the waitress mention to the next table that it was her first day, so okay. I'll cut you some slack.\n\nThis time. ::shakes fist::", "author": "Claire F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "I walked in here on a Saturday night with a book in hand ( single traveler from California).  I was  treated with nothing but kindness from the staff.  The burger and two pale ales I had were incredible. Everything hit the spot. The decor is something special. I sat next to this old photo of FDR under a gold American Eagle. I think that what other people perceive as rudeness or disinterest on behalf of the staff is just shy demeanor.  The staff were actually super respectful of the guests and each other. It surprised me the many exchanges I saw between the waiters and the bartender that included the words please, thank you and you're welcome. In a way. that demeanor fits the super chilled, authentic and old fashioned atmosphere of the place. Go check it out. It's a great place for a burger and a beer. No doubt!", "author": "Nikki M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "The truffle fries are sooooo delicious and they make great cocktails!!!!  they have n assortment of games you can play from Nintendo to chess. The place had a good atmosphere as well. Very friendly and genuine staff.", "author": "angelique v."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}