{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-26", "description": "Been here a couple times since my review, and it's definitely not your hang out on a Tuesday place. The cocktails are great, but carry too high a price tag to enjoy consistently, and the service has been slow every time (even for a beer).\n\nThe turkey leg sandwich is pretty delicious though, as well as the burger. \n\nStill love the vibe, but it's more of a 'night in the neighborhood' rather than an all the time thing.", "author": "Matt T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "Everyone else has said it but I will say it again: TURKEY LEG SANDWICH!!!  It truly is amazing.  if they didn't serve anything else OR if everything else sucked, it wouldn't even matter because the turkey leg sandwich is what dreams are made of!  Truly a work of art... And I don't think I will be able to go there and possibly miss it so seriously, why would I bother eating anything else there?\nJust to be fair I will talk about the rest of the experience.  I went with a group of 9 and everyone seemed to really love their drinks, including me!  I had the Odd Fellow  which is perfectly named as it was.... Odd but delicious!  The whole drink menu was intriguing and I will be back to try them.  The service wasn't bad ( knowledgable server but not extremely friendly... I mean he wasn't a \"pull up his own chair in TGiF form and shoot the breeze\" friendly, but I actually don't mind that. Take my order an bring my grub...I hungry! And I feel like our server felt my sentiment which was kind of awesome)\n\nThey don't get 5 stars because even though that turkey leg sandwich was nothing short of amazing, I was left questioning whether or not it was $14 worth of amazing... I mean it IS a big sandwich but it is a sandwich nonetheless...", "author": "sarah e."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-10", "description": "Prices for cocktails are in the $10-$17 dollar range. Also found a hair in my fries when ordering off the menu one time. However if it's two in the morning and you need to chow down definitely check the place out.", "author": "Dingin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "I like to go to a place a few times before I yelp about it (except Pacifico - you couldn't pay me to go back there).  Henry Public is a charming little haunt.  Believe the reviews - it's hipster heaven, which may be a plus for you or a big minus.  My BF and I felt a bit out of place b/c he wasn't sporting a moustache and I don't have bangs.  But generalizations aside, this place is solid.  I have gotten both the burger and turkey leg sandwich before and both are seriously good.  The turkey sandwich is huge - you can easily share this.  Heavily seasoned and carrying just a bit of heat, which I love.  Burger is great too.  Both come with fries which are plentiful and crispy.  Brussel sprouts are delish.  Excellent cocktails.  Go at an odd time or be prepared to wait in the cramped bar section.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-10", "description": "popped in for an afternoon cocktail to cool down.  i started off with a pimm's cocktail  which they concocted beautifully with a good muddle of cucumber and mint.  i then followed that up with a signature beecher's tonic.  love the old timey register that chings and rings with each transaction.  old timey register = cash only.  will be back for some eats.  i was in the 4-5 window when the brunch ends and before dinner is served.", "author": "Sharlene C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-10", "description": "We had high hopes for this newest neighborhood bar while watching it transformed from the old TV repair shop to what looked like a saloon. Henry Public ended up being a decent place for a fresh drink and quick bite but doesn't inspire an immediate return visit.  \n\nThe decor is period and authentic but very spare and hard  - from plain wooden bar stools to wooden seated booths to wooden chairs and tables in the back, it's not someplace you want to sit for hours, especially if you are a party larger than 2 and not fond of jazz era music.  It's not actually that small but seating is limited to couples or very small groups with a few small booths, a short bar, a 5' square standing room area up front and mostly 2-seater tables in the back. There is a corner table that appears to seat 4 and may have a cushioned bench but that seems to be the only upholstery in the bar.  The tables are a bit squeezed in near the \"wash room\" as well - my husband's chair was bumped repeatedly by customers trying to reach the wash room when someone else was seated at the table perpendicular to us. \n\nThere is a nice cocktail menu and a very limited food menu.  We had draught beer, which was fresh, cold and delicious and a couple of items from the menu.  The oysters, Pemaquid I think, served with a slightly piquant mignonette were fresh and delicious though perhaps a little overpriced at $15 for 6 quite small bivalves.  A seafood fork rather than a full-sized dinner fork would have been welcomed.\n\nThe cheeseburger sandwich was just the right size, served on a brioche style bun with a perfectly melted slice of white cheese (either sharp cheddar or similar - I only got one bite).  It was a bit too red for the medium rare that was ordered but so tasty we ate it anyway. The fries were perfect. Sweet (!?!) pickle slices were left on the plate.\n\nWe were there the night it opened to the public and for a first night, I have to say the staff did a great job - quick and friendly service a definite plus. I hope they're able to keep it up.\n\nI would definitely drop in for a beer and quick bite at an off hour or on the way home from work but Henry Public isn't yet a confirmed destination. We will see....", "author": "b w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "Obsessed with this neighborhood spot!  We go at least once a week for a drink and/or dinner.  The staff is so friendly. I am totally not cool enough and they're still nice to me! I highly suggest the turkey leg sandwich (duh) and the grilled cheese.  Yum.  They also have to-die-for Bloody Mary's on the weekend.  Ridiculous.  It's also a great spot for a late dinner as their kitchen stays open until 2am, I think.", "author": "Gina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "Turkey leg sandwich - that is all I need to say.", "author": "Melody M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "Great little spot on a nice quiet street in cobble hill.  Place does a good job of looking old but does it a nice way - feels authentic, honest.  Cocktails are good.  Turkey sandwich is amazing - best turkey sandiwch I've ever had, super moist dark meat, amazing fries.  The burger - \"HAMBURGER SANDWICH\" (kind of pretentious) is realy good too.  so are the specials.  cool mixed crowd of locals.  Sometimes there is a good jazz band as well on weekend afternoon.", "author": "Jack D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "Have not tried the food here yet, but love the cocktails. Yes they are a bit pricey, but it is a lot of fun to watch the \"mixologist\" mix them. Vests and handlebar mustaches don't offend me the way they seem to offend others, but maybe I'm just not jaded enough, having only lived in New York for two years...\n\nI've enjoyed the several visits I've made, although I'll agree that it does get very loud. This has become the \"fancy cocktail\" place for me and my boyfriend. Will update after trying the food!", "author": "Kaitlin U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-14", "description": "With charming bartenders, interesting drinks, an enthusiastic crowd and the smell of good food, it's hard not to like henry public. Despite all the buzz surrounding this spot the vibe was very unpretentious! I liked the music and the fact that it was slightly more lit than many bars around! I didn't try any food on this visit, but I foresee another visit soon.", "author": "Becca C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "While the best cocktails in the hood (for my money, anyway) are still at Jack the Horse, the Public Smash (basically a mint julep) ain't half bad -- especially when coupled with the delicious pillow of meat known as The Turkey Leg Sandwich.   Sit at the bar and you'll hear an echo effect of Turkey Leg, Turkey Leg  throughout your stay.  It's that much of a crowd pleaser although some say it's a bit too peppery.  Whatever!   Go on a night where snowflakes batter its window and pretend you're in the Cotswolds,", "author": "Natty G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "Hipster spot for good cocktails, and delicious greasy bar food. Think burgers, oysters, suspendered mixologists muddling stuff, and old-fashioned lightbulbs giving off a warm glow. Good date spot, usually very busy, cash only. Not for the faint of heart who think mustaches are sleazy.", "author": "Wanda D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-12", "description": "Very nice cocktails. Unimpressed (at best) with the food. Crowded, but in a good way... the crowd's emerally nice and  pt pushy.  As long as you're willing to stand and don't expect to sit, it's all good...", "author": "Jason O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-29", "description": "On a chilly windy winter night, the warmth and bustle of Henry Public is the warm fireplace that welcomes you home.\n\nI had moved out of Brooklyn over a few months ago and returned for the first time to venture Henry Public.  I forgot how quiet Brooklyn was...but no matter how silent the night outside, inside of the gastropub, it was hoppin'.\n\nMy friend and I first got a drink at the bar.  The first thing I noticed was the bartender with the trademark suspenders.  It was difficult to get to the bar because it was pretty crowded.  I ordered the Ward Sex, which was really good and very strong.  I loved the icecubes and the fresh fruit garnishes.  We moved to a table and ordered the bone marrow, juniper pickles and french fries.  The french fries were a bit over-salted, but otherwise, everything was excellent.  The hostess and the waiter were extremely helpful and friendly.\n\nBummers are:  no place to stand if it gets very busy and their policy is no table unless you are eating.  Also a bummer is cash only.\n\nNonetheless, I would definitely return!", "author": "Kathy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-10", "description": "I wish I could rate this place higher- they do have a great atmosphere. \n\nThe drinks are expensive and not that strong. I don't eat meat and found the vegetarian options overpriced and small. And despite the fact that you can rack up a high bill pretty quickly with dinner and cocktails, it is cash only. We had fun, but we probably won't go back.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-01", "description": "I heard about Henry Public from my English teacher and me classmate and I decided to check it out after watching the first game of the World Cup. On my first visit I had a grilled cheese with french fries. The sandwich was delicious but the fries were the best I had ever had. I decided I had to go back and I this time I tried the cheeseburger. Again, the fries were to die for and the burger was phenomenal. I cannot explain how much I love this restaurant: the environment, the food, and the servers are all amazing. \nAnd to top it all off, it's cheap!\nGo!", "author": "Ramona H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-13", "description": "The turkey sandwich is great, and the fries are perfect.  But the real reason to come here is the booze!  Beecher's Tonic is my personal favorite, but really anything these mixologists put together is worth a try.  Cash only.", "author": "Ty C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "Good drinks, good service. No complaints at all. Nice place to spend a little time.", "author": "Guillermo K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-14", "description": "The turkey leg sandwich here is incredible. Cozy and inviting place but it does get crowded and pretty loud. Good bartenders and good mixed drinks. Fun place for Friday night food and drinks.", "author": "Michael H."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}