{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-13", "description": "Can you say \"Turkey Leg Sandwich\"? Then say it when you place your order. This place will become known for this thing. Unbelievably delicious. I was stuffed to the gills after one, and yet I wanted another. I waited 2 days and went back half thinking that it could never be as good as i remembered it. But it was. Plus the place is so  inviting. I find myself yearning for it. Great cocktails. Great beer. Best bar in the neighborhood. No question.", "author": "Adam F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-15", "description": "Great, cozy spot for some superior cocktails and a bite to eat.  The hamburgers are okay (believe me...you've had better), so go for the other noshes on the menu.  Did I mention the spectacular cocktails?", "author": "Anna V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-11", "description": "You can't go wrong for dinner here, but it's the brunch makes it trek-worthy. The egg sandwich + the wilkinsons (fried donuts) I ate during my last meal  still haunts me to this day. Really a magical little spot.", "author": "Joe M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-05", "description": "places like this are what made me move back to brooklyn.  beautiful old building with old features and shelving.  the bartenders are forced to wear suspenders and ties, but it does add to the whole feel of the place.  the turkey leg sandwich is great, but a little large for just one person.  go there for the cocktails and atmosphere...although they do have decent choices on tap.  i will be going back.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-17", "description": "Great cocktails, food is OK with the exception of turkey leg sandwich which is very good.  I've had service ranging from very pleasant to gruff.  In my opinion, the place feels slightly contrived when you consider the bartenders that look like extras from Deadwood, the music, and the \"bill of fare\" written to sound old fashioned (\"hamburger sandwich\").  I still like it though.", "author": "Brad C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-26", "description": "Great new place. Beautiful room, great food. Simple, to the point menu. Best burger I've had in ages -- incredible flavour, even though it came well done and not medium as ordered, it was still delicious! looking forward to 5 stars next time.", "author": "Tim R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "This place is awesome.  I love the vibe, love the drinks, the food is great, and the place is really consistently awesome to go to.  Everyone is super friendly, it's crowded on big nights but it isn't ever too crowded.  My go to bar.", "author": "Britt M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-24", "description": "Righteous rye, turkey leg sandwich, balls... so good... great little gastro pub, sandwiches on texas toast... or challah, or something... it was good. I think the waitress was really into me... but prob not. good beer, good food, cool environment... all the bar keeps had all these cool tattoos... just cool, like a fall night breeze, obama, or a fresh limeade.", "author": "B L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "Great burgers and great cocktails. Perfect for a winter's eve.", "author": "MB M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-06", "description": "this place is all around terrible. it's tiny with an uninviting interior design that seems to extend to the staff's attitude. Several wait staff continually rushed my table of 6 people who had eaten dinner and were still all ordering drinks out of our  table, making us feel unwelcome. They said they needed to make room for the \"dinner rush\" which apparetnly didn't include us even after dropping $150 there on drinks and food. I can get a decent grass-fed burger at a million other Brooklyn bars that treat paying customers well.", "author": "Allison A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-24", "description": "three martinis here on a hot summer evening = one of those new york nights that flashes out of one's future recollection of past pleasures. yes.", "author": "Anne S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-05", "description": "Henry Public should be fabulous--the dark wood ambiance is lovely, the cocktails are great, and it's right nearby.  I expected this place to be fabulous, but it unfortunately always falls short.  They have gotten better since when they first opened--when, on one unfortunate night, I waited an hour for a table and then two hours (!!!!) after being seated.  Their service has vastly improved (it now has attained the status of mediocre, as opposed to appalling), but the food is mediocre and overpriced. I don't know why people are crowing about the grilled cheese sandwich, or the small burger--the ambiance is nice, but it's really not that incredible.  The cocktails are quite lovely, but for the price you would do far better to walk 20 minutes down to Prime Meats, for better ingredients, far super service, and good food.  If you want to stay close and go to a place where you can eat and drink well with groups, head to Pacifico--with a lovely fire and fine but not amazing Mexican food, it's a far better experience and better bang for your buck.", "author": "Adria L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-21", "description": "Grilled cheese sandwich and turkey leg were amazing good. Staff very friendly. Cash only and tiny menu are small shorcommings compared to food quality and service.", "author": "E P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-24", "description": "Alright, I'll start off by saying I would have given this place 2 stars but I gave them three because the host really saved the day.  My husband and I went there for dinner last night and had a pretty underwhelming experience.  We had eaten lunch there before and it was fine.  Granted it's pretty hard to mess up a hamburger with fries and a coke at 2 in the afternoon when the restaurant was very quiet.  Last night the service started off fine.  We had a delicious cocktail.  The bartender was a bit cold, but aren't most jaded NYC bartenders?  But, when the wait started to seem like it was taking a while we asked if we could order some oysters from him.  My exact words were \"Can I order some oysters from you?\"  He said yes and then walked away.  I was confused because he didn't ask how many oysters I wanted.  So I waited for him to ask me but then he started making drinks.  Then the host said our table was ready and he said he would have the oysters sent over.  2, 6, 12... still didn't know how many he had decided for us.  We sat down and got 6 oysters.  I was going to to order a dozen.  Ah well.  Then the waiter comes up and stands about 3 feet away from our table and just says, so that we can barely hear him.  Do you know what you want for dinner?  What?  We had no idea what there even was for dinner since it's a verbal menu and how about a \"hi\" or a \"how are you?\"  Seriously.  I was a waitress and bartender for 9 years.  It's not very hard to at least say hello to someone before you ask for their order.  We told him we didn't know what was for dinner and he just walked away!  WTF?  After waiting about 5 minutes for him to come back I flagged down the host and she apologized for him, gave us the specials and refilled our drinks.  He came back to drop off the dinner, ask how it was and give us the check.  he told us the host had comped our wine which was super nice of her.  We tipped adequately because the host had saved the bartender and waiter but in hindsight I wish I had handed that tip straight to her instead-- hopefully they tip share.  Food was mediocre.  So all in all I'd say its a good place to have a drink and some oysters or just go for lunch.", "author": "katie b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-03", "description": "Henry Public certainly has a good atmosphere and for beers and wine, not a bad choice for a few drinks.  However, they do not know the difference between different burger temperatures and their bartender, although a nice guy, has no idea how to make a drink that tastes better than a soda, beer or wine.  Definitely would go back though for drinks and atmosphere.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-15", "description": "Man O'Manashevitz  what a place!  I really have always dreamed of a setting just like this.  It is old fashioned and yet totally unkitchy.  I love it.  I have been salivating thinking of that turkey leg sandwich pretty much non stop since I had the pleasure of having one a week ago.  It is so flavorful and nuanced and amazing.  I adore every cocktail I had and I tried several.  I think the only thing that is bad is that it will be crowded.  IT will be the place you wish no one knew about.  But thank god everyone will know about it because we all need a place where everyone knows our name and they have an amazing turkey leg sandwich.  THUMBS UP.  When are those people opening another place??????", "author": "catherine b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-13", "description": "I went on opening night, and I'm definitely going back--if not for the handsome, hipster bartenders carefully crafting cocktails, then for the hot, pillowy pastries called Wilkensons (they come with a pot of caramel, for dipping). They're the only dessert item, so you can't miss them. And believe me, you really don't want to.", "author": "Loretta M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-12", "description": "Have eaten here twice.  Mac and cheese is very good.  Hamburgers (without any toppings) are $16 - totally unjustified.  Had a terrible customer service experience when my husband ate here a few months ago.  Waitress sat us and then forgot about us.  Then when she finally took our order, she forgot to put in the mac and cheese.  Food came, and we waited and waited.  Finally I asked her when the mac and cheese would come out and she said \"Oh you didn't order mac and cheese.\"  And I was a bit like, \"Okay, then why am I asking about it?\"  If her response had been apologetic at all I could have forgiven.  But she was rude.  Then she was like \"Do you still want the mac and cheese?\" No, I don't - not anymore.  I think that they were trying to turn our table quickly because we weren't drinking and they make most of their money on the overpriced drinks.  So many other nice places to go in the neighborhood that this one is totally not needed.", "author": "Marie I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-12", "description": "This is the kind of establishment that becomes an immediate classic. It feels as if this cozy and sophisticated saloon has been around for decades and yet it has a fresh, exciting vibe and amazingly well-edited menu (THE TURKEY LEG SANDWICH and the salad were unexpected revelations that I've been dreaming of ever since-- instant cravings-- in addition to the burger and fries). The staff was friendly and attentive and seemed unfased by the crowd.  Apparently these are the same folks whose genius brought BROOKLYN SOCIAL to Smith Street, which makes a lot of sense, because HENRY PUBLIC has the same lush attention to detail. Everything from the wallpaper to the bathroom tiles to the pickles seems carefully chosen without being remotely fussy.  What a feat. There is really nothing like this place in the neighborhood and I can't wait to go back and bring friends who I know will appreciate it. Also, I'm really looking forward to brunch...", "author": "joanna h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-02", "description": "I really want to like this place...the drinks are good, some very good, none spectacular.  The food is solid.  My concerns rest primarily on service and policy.  I understand the neighborhood is changing.  I appreciate Brooklyn Hts/Cobble Hill for the charm and *lack* of attitude.  I am a native, family has been here for a century, I am not looking for the new best thing, just a solid neighborhood bar...I can even take a gimmick or two.  That said, signature drinks are $11..   I ordered a Manhattan...a classic drink.  $14, cash only, and they were nice enough to add tax and round it off to an even $15 and give me a look when I left a $1 per drink tip.  It was a decent enough drink, however, I can go out to one of the pretentious bars near my office in Manhattan and get a better one with less attitude.  This is my neighborhood, I go out to relax and enjoy myself...I cannot do that when I feel as though I am being taken advantage of.  Luckily there are plenty of other great bars around.", "author": "Sam B."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}