{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "This is probably my favorite spot in this neighborhood. A simple menu where everything on there is delicious. The staff has been around for years so you see familiar faces when you arrive - the decor and lighting is really nice and chill - I love the burger, the fries, the deviled eggs - I haven't indulged in it but I hear great things about the turkey sandwich and the steak + eggs. Most times I bring someone out in this neighborhood, this is usually the place I take them.", "author": "Carrie A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-17", "description": "I have to start of by saying two stars were docked for the service. I never rate a place based off service but this was unbelievable. My group got to the restaurant around 6 and were told it would be a 20 minute wait to get our table. We ordered drinks while waiting and then 40 minutes later inquired about the wait time. She said she'd set up our table and seat us in 10 minutes. 20 minutes later a new waitress came by who'd just gotten on the shift and told us our waitress didn't realize we wanted a table. Turns out she gave our table away. So they said it would be another 30 minute wait. We patiently ordered fries and another round of drinks while waiting. Another 40 minutes go by and I inquired about the wait time. The new waitress tells me to go sit down because it had only been 15 minutes (it was actually 40). We decided to politely grab our checks and the waitress brings an apologetic basket of fries. \n\nSo the whiskey sour was pretty good, but nothing spectacular (even with the egg whites). The smash drink was bitter. The fries were really awesome. \n\nDisappointed would be an understatement to describe how I felt because I was really looking forward to trying their food.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "I don't often leave reviews but I feel like I have to in this case. I work late on weekends, which can be really annoying when you get off and everything is closed except for fast food, but this gem stays open late, and unlike most bars, their kitchen does too. The macaroni was amazing, shell pasta with 4 cheeses and bits of baby asparagus baked in mini cast iron skillet and served up still bubbling. There's a gorgeous runny egg nestled under the breadcrumb topping and fresh herbs as well. I can't wait to be back!\n\nSide note, I love the relaxing vibe of the old school music.", "author": "Fa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Henry Public is hands down my favorite Brooklyn Heights bar. \n\nInside this adorable hidden gem, you'll find attentive service, a dimly lit romantic victorian vibe, amazing cocktails and food. \n\nWe started coming here when they first opened and have been fans ever since. The quality has remained over the years. The turkey leg sandwich is the highlight of the menu. I mean TO DIE FOR. Order it and thank me later. The burger and fries are also pretty epic. \n\nCocktail wise, you can't go wrong either. They have about ten standards on the menu. My two all time favorites are the Brooklyn Ferry (rye, vermouth, maraschino, absinthe) and the wide awake (gin, lemon, ginger and scotch). \n\nYou can't ask for a better bar than this one.", "author": "Renée G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-02", "description": "My husband and I loved this place until I got sick to the point of vomiting. It was so bad! :(   The first time it happened, I thought to myself, perhaps I have some sort of stomach bug, but when it happened the second time after eating the exact same thing there, I began to wonder....Hmmmm...Anyway, not discouraging anyone from going there, just warning you to take heed.", "author": "Jackie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "A great local haunt...\n\nThis is my go to during the winter and on Sundays. The atmosphere hardens back \"old\" New York, circa turn of the century. That alone, keeps me coming back regularly. \n\nAs for the food -- the turkey sandwich is a must, followed by the marrow bones -- also, a hidden gem is their vegetable side dishes. They usually roast them and offer a mixed variety hat usually rotates (carrots were amazing) \n\nCheck out Sunday's when they have live jazz -- outstanding trio who take requests... \n\nOverall: love this place and so should you!! Also a great place to have a drink while you wait for your table at Hibino sushi (not to be missed)", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "Wow the burger at Henry Public is something special.!  SIMPLE is sometimes better, and this burger is nothing fancy, just delicious, perfectly cooked beef, crispy bacon, tasty cheese, pickles, and a great, toasted sourdough bun!  Check our our full video review here: https://youtu.be/NPQUI4sz24o", "author": "Corey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Love love love this place! Great neighborhood bar, with tasty cocktails and good music. The rattlesnakes is my fave. The ambience is smooth for a  date, couples night or girls night out.", "author": "Alicia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "Along with amazing drinks this place has a shot but excellent menu. Went here with a friend for a quiet night that was greatly improved by the food and service. Highly recommend!", "author": "Dan Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "What a hidden little local spot! HP has a very historic, classic, vibe to it - from it's wooden pub-type atmosphere, candle lit tables, and old photographs of dead, famous folks like Fredrick Douglass (not sure why).\n\nExcellent cocktails, and if you are looking to order food from the menu, I recommend snagging a table in the small back area to avoid the louder bar scene.  \n\nAs everyone who goes here says - just order their famous Turkey Leg Sandwich w/ fries ($18) - a giant pile of moist, flavorful, rich, shredded turkey (think pulled pork style!) served in a perfectly charred thick toast. This isn't your basic dry Thanksgiving turkey, folks. Don't hesitate on ordering it, even if you aren't the biggest turkey fan. \n\nTheir fries were also on point - perfect amount of crisp and chew.\n\nWe also tried their bone marrow w/ toast dish, which was forgettable. It was quite dry and required a lot of effort to scoop out the tiny marrow from the bone.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "SHAME!.... SHAME!..... SHAME! Is what I am yelling at myself for waiting 3 FREAKING YEARS to come here! I live like 3 blocks away, and here you are.....waiting patiently in all your magnificent glory.\n\nCozy and classic atmosphere that is both vintage and perfectly inviting for any group of friends. SHAME!\n\n$5 beers during happy hour. SHAME!\n\nBone Marrow app that my friend licked clean after all the succulent buttery marrow was scarfed. SHAME! (ok, on him this time)\n\nThe Turkey Leg Sandwich......Tenderly moist turkey leg meat piled to the clouds with a fried onion topping and sliced homemade pickles on the side if you so choose to add them. All placed in between the heartiest thick cut multi grain bread. The BEST Turkey sandwich I dare say I have ever had! DELISH! SHAME!!!\n\nFor all these glorious blessings brought on to my neighborhood, and for ignoring the Henry Public sign for so long. I....am....SHAMED. (Cue me walking home butt naked with turkey sandwich in hand)", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Three years later\nStill phenomenal Turkey-leg sandwich\nStill great atmosphere and great cocktails and beers\n\nTurns out they have a great burger too - albeit on the small side...", "author": "Abul R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Such a cute place!  Old school vibe with live jazz every Sunday from 3-7.  Fun and unique cocktails and a super friendly staff.  A great place to hang with friends.  The tables are small so I wouldn't recommend large groups.", "author": "Meredith R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "Really cool little neighborhood bar, with an awesome colonial feel! The drinks were equally good, though the beer selection was kinda lacking IMO.", "author": "Zach H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "Walked by on our way to dinner and decided to go back for a drink after - can't comment on the food but our drinks were great. Definitely pricey but standard for what it was - nice, interesting cocktails in NYC. The service was quick and the bartender was friendly. It was very busy when we went but it wasn't too loud. Would definitely go back if I was in the area again.", "author": "Gabriela R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "I can't even begin to tell you how excellent my meal was.    My son and I were in Brooklyn for one night, and were starving at midnight.  When we found Henry public we did not have high expectations. When you enter the restaurant it's like a step back in time to an old New England pub. The waiter was very helpful and kind. I ordered pot roast which was the best pot roast I've had in my life. The smashed root vegetables and roasted parsnips were delicious. I don't remember but my son had but he was thrilled. We finished with homemade donuts with caramel sauce. I will definitely come here again when we visit Brooklyn.", "author": "Amy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Our salvation after a chilly late night arrival from Newark. Hot, good food available late (order the pickles), great tunes, perfect lighting and a friendly barkeep named Justin who is celebrating a birthday today. Couldn't have asked for a better welcome to NYC.", "author": "Dustin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Love this place neighborhood spot. Well-worn (in the best way)  and comfortable with the feeling of a country pub in England. Fabulous music during the day on the weekends (I think Sundays but check on that) and the food is gastropub-style but less heavy. \n\nIt's rare to find a place like this that serves up great drink, food and wonderful service (especially the bartenders) and a really nice, varied crowd.", "author": "Vanessa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-19", "description": "I was in the mood for a burger on Saturday, and my fellow burger hunting wife had heard good things about Henry Public. Great, old-timey feel. \n\nShe went with the popular turkey leg sandwich and I the burger. I also had a seasonal Kolsch if I am being completely honest. \n\nAnyway, I like my burger dressed a certain way. They typically just have pickles on the side, but they made it happen with the lettuce, tomato, and onion. I was very impressed by that. The burger was very good. Cooked the perfect medium, as I requested. Fries are good, too. \n\nIf you have read any reviews, you know the turkey leg sandwich is great. No complaints there. \n\nI'd like to think that service is the only aspect that keeps this from being a five star review. (Server was cordial, but not attentive) I personally don't like to complain about prices, as I can find that information before choosing to dine there. But I do think that the sandwiches could be 3 or 4 dollars cheaper than they are. That being said, I really enjoyed the food and would recommend it if the price (and cash only stipulation) jive with you.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-09", "description": "Bad burger = bad food.   cheddar cheese is sourtasting and messes up burger.  They only offer cheddar.\n\nFries are not exciting.  If coming for the \"cool\" vibe, i get it.   But the food is not cool.", "author": "Stewart H."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}