{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-05", "description": "Fantastic drinks, very good food.  I could do without the whole mustache-suspender shtick, but whatever.  \n\nIt is absolutely ABSURD that they don't take cards; nothing worse than breaking up your drinkin' and gossip party to stumble back out into the wretched heat and glaring sun to schlep three blocks to the nearest ATM.  Bah.", "author": "meli l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "We always bring our out of town guests here. The specialty drinks are fabulous and although the menu is small (very small) the food is delicious and comforting. It feels like a true public house, or at least what I think an old public house would be like. It's is a true authentic experience. I recommend the burger with greens and the deviled eggs. All the veggie sides are great too.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-31", "description": "Overpriced ($15 burger).  Which would be fine, other than the food itself does not match the cost...\n\nI ordered the turkey sandwich.  It comes with two slices of bread each about 1.5 inches thick... just too much.  Also, the meat itself was WAY over salted.  Add to that a huge plate of fries that didn't taste fresh, and you got yourself a 2 star location. \n\nService would go from ok, to ignored, back to ok. The decor is nice... feels like a living room. \n\nFinally, no credit cards.  REALLY, no cards and you charge that much. Boo.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-17", "description": "Gastro my Asstro!   A small group of us came here on a Saturday evening.  Big mistake.  Though it's a cosy little place, with a nice back room, the beer menu is very limited without much variety.  If all you want is a hoppy beer in pleasant surroundings - no problem.   But the food menu is about 8 items, almost half of which are burgers.  We ordered three different ones among us.  Each one consisted of a small almost round ball of meat about the size of a handball, overcooked on the outside, almost raw inside.  The buns were warmed/toasted to the point of being crispy.  The fries were limp and flavorless.  The grilled cheese sandwich was a $10 piece of greasy toast with what could have been Kraft slices inside.  Their much-touted Turkey Leg sandwich was neither a leg nor who knows whether it was actually turkey or not - just a small pile of flaked meat between a couple of slices of toasted bread, with very little flavor.  The side of macaroni and cheese for the table was overcooked beyond recognition, the dish of Brussels Sprouts was inedible as they were barely even cooked, and sticking a fork into them required a significant amount of force.  And the pricing was downright insulting - a grilled cheese sandwich I could have made in my toaster oven with better results should never be $10, the burgers were massively overpriced at $14-$18 considering how small and poorly prepared they were.  All symptomatic of an out-of-control kitchen (yes I know it was a Saturday night but you need to be able to deliver consistently cooked food at a Saturday night kind of pace, or significantly change your menu or kitchen staff).\n\nHugely overpriced food, poorly prepared, very limited food and drink menu.   Yes they can be trusted to pour a decent pint of beer from their very limited selection (which has nothing for mainstream beer drinker types), but they are clearly WAY out of their depth when it comes to the preparation of food.  There are more than a few places around here with a much better variety of food, and with a much better selection of beers.  Oh and the final kick in the teeth is that this joint is Cash Only (small print at the very bottom of the menu) and yet the check comes out of a digital POS unit - do they really not want to pay card processing fees?  We knew this in advance, so I'm not upset about that.  But everything about this place just screams \"phony\".\n\nI rarely give out poor reviews here on Yelp, but this place is a FAIL in just about every category, and should be avoided at all costs.", "author": "Andy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-25", "description": "Love the look of the place, and the old-timey dressed staff. Sat at the bar and the bartender was talented (my Beecher's Tonic - kind of like a pimm's cup - was tasty), and helpful. They also have a nice selection of beers on tap, and the deviled eggs were delightful (although they only came three to an order). The place is great when it is not too crowded, else you can't hear yourself speak, or find a seat. \n\nWish they took credit cards!", "author": "Christine N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-14", "description": "I think I like it here. It's kind of confusing because I usually leave my neighborhood to come to brooklyn just to get away from places like this - vested bartenders, twee bespoke cocktails, $15 burgers - but here I am, liking Henry Public.  \n\nNot sure on the other service complaints, the times I've been the service has been prompt \u0026 friendly, \u0026 very un-brooklyn, which I appreciate (bad service being the reason i generally regret leaving my own neighborhood to come to brooklyn to places not like this.  mind f*ck!).\n\nI like the food, though quite overpriced.  Bizarro rendition of mac \u0026 cheese has grown on me, I'm a sucker for shells.  Burger good, fries better.  Bone marrow kind of skimpy, I will take Blue Ribbon any day.  But overall on the up \u0026 up. They make a nice old fashioned.", "author": "Talia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-29", "description": "This place is so charming. I wish I could make it a go to spot, but three attempts to have dinner there have all failed due to the very long wait and already crowded bar area.\n\nBrunch was fantastic. As you've already heard, the turkey leg sandwich is delicious. Who knew they could also make a basic breakfast sandwich so special?\n\nWilkinsons. GET THEM. Even if you are full. I was not surprised that Time Out NY named these powdered sugar covered little balls of doughy heaven (to be dunked in syrupy sweetness before being devoured) one of New York's top 100 food porn dishes of the year.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-29", "description": "Never coming back here. It is a little to expensive for what is essentially a dive bar. However, the selection in this neighborhood after midnight is very limited. My honest recommendation would be to simply travel to another neighborhood and eat there. A cab to the lower east side is only ten bucks from here.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-21", "description": "So you know when you wake up after thanksgiving and you have one of those turkey samiches from your giant left over cold turkey.... and, it's way better than the original turkey because the flavor is so crispilly turkasmic as if that turkey committed suicide because it knew it's fate was in your mouth??? \n\nYes. That is there turkey sandwich. Oh. And, their sides aren't too shabby. Throw in that you could dress circa 1800s and feel swell inside... and yep.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-24", "description": "We were going to go hibino..but the waiting list was longer than an hour, so we quickly switched to henry public, which is the next door.\n \nIt is bar/restaurant. Very casual and great place to hang out with bunch of friends.\n4 of us enjoyed their dark mood, special beers on their menu.\n\nWe shared oyster - it was fresh. We had hamburger and lamb special. No complains about the food, but nothing special on the food. Very standard, but it is not cheap...4-5 drinks total (include bear) and food  come out around $200", "author": "Grace C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-23", "description": "Great place, for when I do not make it to the speakeasies.\n\nI have been going to Henry Public for about 3 months, I love the French fries, but I have yet to eat one of the dinners on my own. I have tried the turkey leg sandwich and it was delicious. I also tried the mac and cheese and, although it could use extra flavor (maybe some bacon or garlic) it was pretty tasty too.\n\nI like the crowd - it is a group of people who love old school bars and 20's/ 30's music. My only complaints are that they do not take credit cards and also the mixed drinks could be stronger, or, if they are weak, they could be less expensive. I have had drinks from two different bartenders and both times the drinks were too weak.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "a fun and quirky bar with very good cocktails and great food at reasonable prices.\n\nwe shared a lettuce \u0026 watercress salad which was delicious followed by lamb chops with spinach and fried potatoe wedges. hearty, but too peppery for my liking. we paid around $100 incl drinks and tip.\n\nfriendly and efficient waiters, horrible\naccoustics and uncomfortable chairs, but all in all a very pleasant meal. we'll come back", "author": "Per P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-22", "description": "Three and a half stars really. Henry Public is super-cozy and a great place to hide away from a cold autumn wind. The menu is very limited, but what they have is mostly done very well. \n\nThe burger was truly fantastic. Possibly the best I've had. The meat was so tender and juicy that it melted in my mouth and it was seasoned to perfection. Unfortunately, the fries that came with were burnt tasting and a huge disappointment. They may need to change their oil more frequently. \n\nWe also had the marrow bones -- the marrow tasted great, but I'm not sure I'll eat it again because it's a little to graphic for my taste. The house made relish or whatever it was that accompanied the bones was yummie.  All in all, an interesting adventure that's worth doing once. \n\nFinally, we had an order of Wilkinsons, which are deep fried doughy things that you dip in syrup. Our server recommended that we have them along with a dark beer -- which was a great idea -- breakfast of champions for sure. Really yummie.  Funny that they didn't taste burnt. Perhaps they were cooked in different oil than the french fries, or perhaps the oil wasn't the problem with the fries -- just that they cooked them too long.  Anyway, eat Wilkinsons. \n\nThe cocktails were good too (but the Clover Club still has the best cocktails in the area). \n\nRecommended.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "Love their happy hour. Such a beautiful plCe. Amazing customer service. Great music.", "author": "Jani S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-28", "description": "I'm getting a little bored with all the new restaurants in Brooklyn. They're all either homey, romantic settings serving modern takes on Southern-influenced comfort food. Or they feature a menu of pub fare in an old fashioned wood-heavy locale designed to be a throwback to an era of New York's colorful past.\n\nOf course I'm over-simplifying the diversity of Brooklyn. I know I'm being unfair. But Henry Public is the latest in that trend. It's an old-fashioned pub(lic) with historic pictures and gas lamps hanging on the walls. The menu features modern riffs on classic cocktails and limited but intriguing dinner options. They have your typical burger, oysters on the half shell, and bone marrow (!?)\n\nThe Turkey Leg sandwich sounds absolutely delicious - much like a pulled pork sandwich but with moister turkey and hopefully reminiscent of a Southern Thanksgiving. Images of those big roasted turkey legs from Disney World come to mind. And with my love for pulled meat sandwiches, I was excited about this unique idea.\n\nIt worked better on paper for me. And how could this live up to my imagination? The dark meat of the leg must have been braised in a heavy gravy sauce before being pulled and sandwiched between a pair of nicely toasted rye bread slices. The turkey was sort of unrecognizable. It was so rich and thick that any possible lean qualities that turkey possesses flew out the window. Topped with frizzled onions and served with crispy french fries, it tasted alright. It was overly peppery and I could feel the meat sticking to every organ in my stomach. If I'm going to put myself through all this, I'd rather just eat a pulled pork sandwich.\n\nThe burger fared better since it was not re-invented but rather just simply done with good ingredients. We also had smoked almonds as an appetizer and these make a perfect bar snack to pair with whiskey. And you'd think it was in their cocktails where Henry Public would shine.\n\nThe cocktail list was short but varied and the prices were a few dollars less than similar saloons in Manhattan. But I think the reason they're cheaper is because I'm convinced our drinks were watered down. I could hardly taste the booze in either and considering the ingredients were mainly hard liquors like scotch and absinthe, I expected to have a slight buzz going. And although the concoctions sounded interesting, they were both rather flat and the flavors didn't blend well together. Maybe it was the addition of water???\n\nI wish I wasn't so down on Henry Public. The service was nice, the food was fresh, and the speakeasy-feel was charming. But I've been here (not here exactly) and done that one too many times before. And in order to stand out from the crowd, there's got to be something special. And strong drinks would be nice.\n\n-eatthisny", "author": "Brian H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-27", "description": "I won't come here again.  Four friends and I needed drinks and some eats.  The food was fine, the drinks were good,but I hate it when you have a table of 5, you have a ton of food and drinks, and then as soon as you are done eating, you are asked to leave your table....really?  you could have given us a time limit or something, but as someone who was in the service industry, this place really should compensate or warn people if they are going to ask them to move.  whatever - i don't feel like I am missing out too much.", "author": "Vanessa O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-01", "description": "Further exposure to Henry Public might change my opinion more strongly one way or another. The breakdown for me is: WAY cool atmosphere -- you approach from the outside on this empty grubby street, and once inside it's got a great dark moody generic-vintage vibe. Really fun to show off and bring out-of-town folks to. It does get quite loud and a little packed, though there are booths and a number of small tables in the back. \n\nThe drinks are expensive, but also strong. Flavorful, sweet, tasty! The grilled cheese and apple sandwich is beautiful with awesome shoestring fries. Sadly, there is only one dessert on the menu and it's pricy with a rum sauce that I really couldn't care for.\n\nMostly, I feel ambivalent. I think it'll be an occasional splurge.", "author": "A S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "My wife and I went for a cocktail.  Super good, guys.\n\nPimm's Cup for me and Whisky Smash for my wife.  Both pretty awesome.\n\nWe'll be back soon.", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "Words cannot adequately describe the relationship I have with the turkey leg sandwich.  Or the wilkinsons.  Or the bloody Henry on a Sunday afternoon...\n\nAs stated before this place gets crazy crowded, as it was last night at around 9 when my friend and I showed up, but the hostess was charming and was able to get us seated within 5 minutes of arriving, but as that usually is not the case, brunch is pretty lo key there, definitely easy to get a table.\n\nDrinks are pretty good, I had the \"ether\" last night.  It tasted a little like watered down scotch plus absinthe, which I'm ok with since the ingredient list makes it sound like after too many you might wake up in another borough wearing somebody elses pants.", "author": "Colin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-23", "description": "It's really about the turkey leg sandwich, deviled eggs \u0026 a cocktail. I found the burger to be fine. Fries also pretty good, but nothing compares to the Turkey Leg.  The bar is as other yelpers described -- beautiful and pulling off that old timey feel.\nI like going here on a Monday or any other time when there isn't a giant crowd.", "author": "Unkl- T."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}