{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "Thoroughly enjoyed a most tender, lean, perfectly cooked burger here and also the turkey leg sandwich stuffed full of pulled, tender meat. \nStaff has a lot to be desired as they all seem a bit pissed off or too good to be there but the food and drinks makes this place worth a try.", "author": "Rebecca H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-16", "description": "Turkey Leg!!  Turkey Leg!! Turkey Leg!! Turkey Leg!! Turkey Leg!!\n\nThe turkey leg sandwich is spectacular.   Juicy dark meat, smothered in gravy, with a nice noticeable bite of black pepper.   It's thanksgiving on bread.  It comes coupled with some well prepared fries, add in a pint of good beer and if you don't walk away happy you should walk right to the psychiatrist. \n\nThe rest of the menu is short and sweet:  a very good grilled cheese with apples, a tasty burger, a salad, and a desert.    The place itself is retro and comfortable.  The staff was friendly and fast.  Throughly enjoyable...\n\n...just remember, get the Turkey Leg!!", "author": "Kurt V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "I've come for dinner and/or cocktails a handful of times on weekends. I usually go on Sundays for the live music (blues/jazz). I'd come just for the music alone, which is excellent, but they also serve up some good cocktails and a delicious turkey sandwich (that a lot of other posts also seem to rightly mention). The cash only policy is aggressive considering it's not a budget menu, but just remember to bring cash.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-11", "description": "I hovered between 3 and 4 stars. Here's the main reason why: the place is cash only. I don't think they hide that fact, and I'm not trying to be wholly unsympathetic to a place that may be trying to avoid credit card processing fees, but jeez man, I don't love anxiety over how much I can order vs. what's in my wallet. Cocktails range from $10-$12, and though I've enjoyed the ones I've tried, I'm not ordering many AND getting food. I like their cocktail menu though, I think it's fun, creative and the resulting drinks are tasty. That said, the food is good too. The turkey leg sandwich is a must-try, and you can probably share with a buddy. The burgers are a fine choice as well. On our last visit, my marrow-loving husband insisted we order theirs, and I have to say it was a healthy portion. The place has charm, and it's great for the area.", "author": "Cara M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-18", "description": "Great drinks, great atmosphere, tiny menu, CASH ONLY.\n\nMore detail: Henry Public is a Brooklyn gastropub that invites comparisons to some of Manhattan's better drinking establishments. The glassware is identical, the pricing a bit reduced: $10 or $11 for specialty cocktails; about $9 for wine (a limited selection); $6 for draught beer (a small but solid selection). The burger starts at $13.\n\nUsually I am loathe to order a plain martini out at a place like this; they're so easy to make at home, what could justify the markup? The Henry's martini, made with two vermouths and a lemon twist, is the answer. The Brooklyn Ferry combines rye, maraschino liquor, absinthe, and a fired orange rind to fabulous effect. The specialty cocktail menu lists a dozen concoctions: two with egg white, two with champagne, one with rum, one with applejack. But the emphasis is clearly gin, whiskey, bourbon. The alcohol on hand is a short but well-chosen list of bottles: good depth in gin in particular. (Good vodka behind the bar, despite its absence in the cocktail list.)\n\nThe food menu left me confused. Very small. A burger, turkey sandwich, grilled cheese. Very few sides. Two desserts. The side room makes me think they want to be a restaurant, but with a menu this pared down I would have a very hard time coming for dinner on any regular basis. For what it's worth, my burger was okay. The fries -- good, but not great -- were overwhelmed by the Heinz ketchup. The 'Wilkinsons' dessert is perfect for 2 or 3 people: a collection of 6 doughy, slightly sweet French toast balls with a side of caramel rum sauce. Would some small touches (homemade ketchup, or an aioli or two) help? Absolutely.\n\nThe atmosphere, drinks, and service are 4-stars, easily. But with no real appetizers and a tiny selection of entrees, I can't imagine bringing friends here for anything other than drinks. And that's too bad. I want this place -- so close to my apartment -- to be *that place* -- my default comfort bar to spend a good hour or two with friends. Drinks and snacks, or drinks and dinner, on a snowy Brooklyn evening. Henry Public is close, but it isn't that place yet. I'll be back though to see if it reaches its potential. I sure hope it does!", "author": "Andy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "Great cocktails and the most amazing turkey leg sandwich.  I mean, funions in a sandwich= genius.  Fries were great, loved the atmosphere, the wait staff was  a little checked out.  Oh, and cash only, trips everyone up.", "author": "Allison H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-03", "description": "I attempted to eat here tonight. HP advertises heavily that they serve food until 1:00am. Their menu is all about hamburgers. Anyway, I ordered from a snotty, slow and disinterested bartender (Sunday, May 2)\n\nI ordered a beer and asked her if they were still serving food. It was a rainy Sunday night. It was 11:45 and HP advertises that they serve food until 1:00 am.  I work in the service industry and seeing it was slow I asked if they were serving food anyway. She crinkled her brow and said \"I'll check\" coming back a few moments later saying \"You'll be the last one of the night!\"\n\nOkay. I should stopped there. But this was a gastropub that welcomes late dining and specializes in hamburgers. And so I pushed on. \"Well, yeah. But I need my hamburger medium well-well done. I don't want them to rush it because they want to go home.\" I was ordering an $18 cheeseburger. Honestly, I figured that no one could be so duplicitous as to promise a decent well-done burger for $18 and not really care, but that is what happened.. She said \"Or course!\" and pushed whatever lever that started my food order. \n\nTo prepare for my $18 Cheeseburger, I washed my hands in the washroom and discovered no paper towels. Okay. $18 Cheeseburger. Snotty bartender. No paper towels. Health board grade \"Pending\" in the window? Does the kitchen staff dry their hands on their pants?\n\nThis is all hindsight. I was hungry enough to order an $18 cheeseburger and I honestly believed the advertised hype... late night gastropub that serves late night!\n\nThe cheeseburger, even after letting it sit for a few minutes, was bloody-rare. Not even close. $18 for this? The bartender was too interested texting on her smart phone to notice I was trying to get her attention. Someone from the kitchen was getting a water and ignored my \"hello\". Finally, I was able to get her attention by raising my voice until she could hear. She turned, totally annoyed I had interrupted her text messaging. I was so frustrated I expressed myself badly  (\"This isn't even close to to medium-well done!\"). Her response was so snotty, I lost my appetite and I told her to forget it. I wasn't hungry. She didn't have a problem with that. Apparently at Henry Public, they train their bartenders poorly.\n\nOddly, I still tipped a dollar. She did go to all that trouble to draw a Victory Pilsner in a chilled glass stocked by the latino support staff. Gross.\n\nNEVER AGAIN.", "author": "Zack R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-24", "description": "This place is definitely a throwback, the speakeasy type of pub that we all talk too much about thereby inadvertently creating the crowds that flock to these places.  The atmosphere inside is great, a set of booths across from the bar and then a fair amount of tables in the back area.  The bar is part of the throwback all the way down to the old style cash register.\n\nI showed up here to get an after-dinner drink at about 10 pm on a Wednesday night and the place was pretty crowded.  The crowd was quiet for the amount of people in there, all engaged in their own conversations with friends, not a bar scene at all in the traditional sense.  We sat in a open booth, but realized soon that the booths were just for those eating.  The hostess was totally nice about it, but assured us that they needed the booths and tables for food.  Still full from dinner, we could not come up with an immediate excuse to add food to the drink endeavor so we jammed in at the fairly crowded bar.\n\nThe bar area thinned out quickly, but the place stayed busy all the way until close to midnight when we left.  Staring at their specialty drink menu, nothing jumped out, so the bartender mixed us up a concoction with gin, mint and ginger and it turned out well when poured atop freshly shaved ice.\n\nI looked over the menu and it is short and to the point.  Burgers, turkey leg sandwich and some appetizer/treats.  It seems to be a great place to get some higher end creative bar food and great drinks.  I saw the turkey leg sandwich and almost fell off of my seat.  It was like a Flintstones sandwich and looked phenomenal so it gave me a good idea of what kind of food they churn out here.\n\nWith five beers on tap, I had a Captain Lawrence Pale Ale before the night was out.  The two drinks and the beer added up to $24 which, by speakeasy standards, was a good deal.  This place is great and I plan to frequent it, I just wish we could all be quieter about places like this and keep all of its good for ourselves.*\n-------------------------\n*Says all this while writing a Yelp review.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-15", "description": "Great atmosphere, tasty burgers and food.  But I was disappointed by the service, primarily how LONG we had to wait for our food.  To compensate for the long wait, our waitress gave us free dessert, which was nice.", "author": "Seamus F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-29", "description": "With small cocktails running $11 Henry Public is a once and a while treat for us, but we really look forward to it! \n\nThe Absinthe infused are delish and I highly recommend them. Others though have been disappointing. \n\nThe food is great, especially the turkey leg sandwich. \nOne downside is that it is cash only, and Friday and Sat nights are insanely crowded (its a tiny place) so try to hit it on a weeknight or Sunday.", "author": "J C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-08", "description": "Two and a half stars for me.  The extra half is for the nice atmosphere and feel but that is about it.  It is basically just yet another copy of the dozen other Frankies wannabes that have flooded this area over the past couple of years.  It has potential but unfortunately that is being held back by non-existant service and half complete dishes.\n\nWho the hell serves a burger with no option for any tomato, lettuce, onion or even mustard?  It is just a tiny dry lonely patty with two supermarket pickles on the side.  Yes, you can have cheese, but only if it is cheddar...my tastebuds were yawning the whole time.  For $14 it is highway robbery as essentially all you are getting a bland 4oz slider. \n\nAs for service, it was non-existant.  Our party had to seat ourselves and just saw the waitress twice....once to take our order and once to give us our bill (mind you, there was only two other tables than ours and multiple waiters working).  Someone else brought our beers (they get points for carrying Sixpoint but lost them for charing $3 for a 6oz soda).  Our water glasses sat empty before the food even came and no one made any attempt to refill.\n\nI am sure as a bar it will do fine, but it is nothing special and I won't be making the effort to go back when I can hit 5 other earlier copies that have great service and food (at far, far better prices).  Finally it is 2009, wake up and take credit cards. Cash only is asinine in this day and age.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-08", "description": "Cash only!\n\nOn a Friday night, this place was great--short wait, but not bad, good people watching provided. Macaroni and cheese with an egg and peas and some herbs--ugh, delightful. The drinks were fun and unusual and the service was friendly and my friend and I kept saying \"dear God this place is fun.\" \n\nSponsor a mixer!", "author": "Megan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-20", "description": "Old-timey gastropub serving great cocktails in their proper vessel with the right ice. I didn't eat when I went but wish that I had as their burgers smelled fantastic. \n\nThere's a small bar as well as probably a dozen tables. If there's a wait, you can put your name on a chalkboard that is located on the wall to the left.", "author": "Katherine Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-04", "description": "The whole 20s/30s revival theme is WAY overdone in this particular corner of Brooklyn.  That affect here stood out here more than at other places, probably because it's so new and (having moved to Brooklyn this spring) I *know* its new whereas at other establishments I can suspend my disbelief and pretend the place *really has been* open for 80 years.  Also, although it's wonderful when a restaurant focuses on what it does well, they take things somewhat to extremes here and the menu could stand to be a bit more expansive.\n\nBut this is not meant to be a negative review: Henry Public is warm and inviting and they cook a **very** good burger and get the important things right.  And bonus points for being on Henry Street rather than Smith or Court -- between this and the nearby (and excellent) Hibino, this is turning into a nice little Restaurant Row.", "author": "Nate S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "Love it. Also love that the kitchen is open late (until an hour before close) because in Brooklyn Heights there is not so much open late.\n\nSolid burger. Good greens. Turkey leg sandwich is a must try. Very americana style cocktails and vibe. Cash only, but whatevs its my go to spot if I am at home and its late and I have forgotten to eat.", "author": "Carl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "Love Henry Public for brunch/lunch.  Love, love, love the millet skillet with poached eggs and hollandaise.  Good fries.  The egg creams are terrific, too.  Yes, it's a drag that it's cash only and it's a drag and it feels a little hipster-ish, but, the food is good and worth a trip.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "Cash only sucks, service isn't great, and it can get really crowded, BUT they make a mean drink and the turkey leg sandwich is out of this world!! Might be the best sandwich in the neighborhood. The rest of the menu is good, not great but that turkey leg is really worth it.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-29", "description": "Definitely overhyped as bk heights must see. Menu is good but limited and bar always feels cramped. Drinks are well done though and if you don't mind paying all cash then not a bad place to check out at least once.", "author": "Dani S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-10", "description": "Arriving in there, the ambiance seemed pleasant enough, with that same speakeasy-type style that's become pretty common over the last few years. Good mood lighting, busy but not too crowded, etc. It seemed like a solid choice. But after we got in, it was downhill.\n\nFor one, when we got there the back dining area had empty tables, but we were told it would be 15 minutes for a seat. No worries, some people have reservations. We went for a drink at the bar, which was supposed to have a great menu, and ordered $12 cocktails. Unfortunately, even though they were supposed to be good here, these tasted less like a unique cocktail experience than just a random bunch of semi-expensive liqours poured in a glass - semi fruity, semi bitter. The person I was with said she'd come here regularly and this was an off night, so maybe it was an inexperienced bartender. Oh well - still strong and helped get a little buzz going. Soon it had been about 25 minutes and we saw the waitress writing someone else's name on the board. Just to make sure we weren't forgotten, we went over and checked; the hostess said she'd checked for us but hadn't seen us, which is odd because we were sitting at the bar the whole time and not buried amongst people or anything.\n\nI wouldn't have paid any of this too much mind if the food had been good. I'm a vegetarian, so I was deciding between the grilled cheese w/apple slices and the macaroni and cheese. I find mac \u0026 cheese at fancy restaurants to be a little too rich sometimes - basically baked cheese soup w/some noodles for good measure - so I opted for the girlled cheese w/apples thinking it might be a little more balanced.\n\nNo such luck. It was more fried cheese than grilled cheese - the bread translucent with the amount of butter it had been impregnated with, the poor apples completely overwhelmed by the mat of greasy cheese as I took bites which will probably someday be pulled whole from my arteries by a cardiologist. This sandwich makes NY Pizza or a deep-fried snickers bar look like a lite choice; if you consume it, never again can you look down on those who eat the KFC Double Down.\nThe fries were limp and uninspiring and obviously a bit greasy too; the honest highlight was the two pickle slices I found cowering under the sandwich, which provided a token of something with which to balance the plateful of saturated fat. I knew a grilled cheese and fries wasn't gonna be healthy and I don't mind that, but this was gross.\n\nTo be fair, the service (after the mix-up with the seating) was fine, and I didn't mind the ambiance. And I know it's New York, price wise. But being as it is New York, to drop $30ish on a meal I barely finish half of when at a million places I could get a $6 veggie burger, grilled cheese or whatever that would have me savoring the crumbs off the plate and then go to a bar with the same atmosphere and better drinks is just obnoxious. And for what it's worth, whatever I had there gave me gas the rest of the night, so that was fun.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-04", "description": "I ordered the turkey sandwich, as ordered by all of the other reviewers here. It was good, not great.  My other half ordered a hamburger which came out looking medium (as ordered) but was beyond rare on the inside (not good).  It took a LONG time for the replacement burger to arrive, which made its steep price tag all the harder to swallow. I think this place is probably great if drinking is your primary goal, but the food wasn't worth the price.", "author": "Sondra S."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}