{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-27", "description": "A king among bars!\n\nGreat menu of traditional-style cocktails and no-frills (but delicious) food. This place is simplicity at its finest. The decor is cozy and comfortable, one might even say romantic, complete with fireplace in the back area. It's like a Clover Club minus the pretension for locals.", "author": "Alison G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-06", "description": "Hit or miss.\n\nAfter the experience I had yesterday, I seriously considered giving this place one star.  But two weeks prior, the experience was fantastic.  I guess it depends on the staff.\n\nMy husband and I walked in yesterday around 4:00pm and were completely ignored by the two mousy waitresses who wouldn't acknowledge us despite trying to get their attention multiple times.  They just walked past us, around us, behind us - It's a small place, so being ignored is equivalent to being dismissed.\n\nFinally, we asked the bartender if we could get a table.  He tried to help but it was clear that seating was out of his hands.  Again, the waitresses wouldn't make eye contact.  A table was cleared, and yet again no acknowledgement from the mute waitresses.  I eventually asked one \"Can we sit down and order some food and drinks?\" and got a response at last (though not a gracious one) \"No, that's for larger parties.\"  Odd, because two weeks earlier we sat at that exact table as a party of 2 and received exceptional service.  \n\nNeedless to say, we left without ordering and won't be back.  Great drinks and food, but alas, it's tough to forget feeling unwelcome.", "author": "Sarah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "This place is criminally underrated. The turkey leg sandwich has to be one of the best sandwiches in the city, and the fries here are always on point. Nicely done interior that feels like a set from Peeky Blinders--but it's all real vintage salvage stuff, so that it feels homey, ancient, and comfortable, rather than fakey like a Burning Man dude with a waxed moustache.", "author": "Cliff K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-31", "description": "I would have liked to give HP a 5 star because the burger really was OUTSTANDING.. as were the fries. It has a delicious and beautiful atmosphere - really a treat to sit inside and eat dinner. However.....\n\nI came here with a girlfriend after not seeing each other for a long time. She suggested we eat here because the burger is really good and I've never been. It was a Wednesday night, ordinary day, no holiday, whatever. \n\nAfter doing a lot of talking, consoling, catching up, we ate our burgers, fries, drank our ginger ales, wine, etc. We finished and proceeded to do some more talking. Okay, yes the place was filling up as the night got later, but it was only like 7pm. \n\nA man walked over to our table and asked us if we could please \"hurry along because they needed our table to seat others\"... they offered to seat us at the bar. I'm sorry, but RUDE. Also, I wasn't drinking so what would I have done at the bar?? \nI just paid 17fuckingdollars for a burger. I wasn't ready to leave and I don't think I should have felt the need to rush myself. I was actually contemplating coffee and a dessert, but after being asked so rudely to move, I decided I no longer wanted to give any more business to them. \n\nThe thing is, I will come back here, but it did leave a bad taste in my mouth.", "author": "Coupe Et C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-29", "description": "Bartender laughed under his breath when we ordered the oysters and then warned his friend sitting nearby not to do the same. My bad, didn't notice the B rating posted outside. That aside, snacks and drinks were decent. I suspect if we were to go on another evening, the experience could be better. Staff ruined it for us this night.", "author": "Tish H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "Stopped in during an impromptu Atlantic Ave pub crawl and of corse, had to try the famous turkey sandwich. This beast is huge so my sister and I shared it. Our friendly bartender told us the turkey legs are braised in milk then cooked in butter. Yummo! $16 is a bit steep but hey, Brooklyn is the new Manhattan. The fries are weak and seemed like the bottom shards from a frozen bag. Loved my ward 6 cocktail! Would definitely return for the old school neighborhood vibe.", "author": "Elisha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-12", "description": "I love this place, but I can see how HP gets mixed reviews. If you haven't been, here's what I think you should know.\n\n- It's really small. People bring groups all the time, especially (for some reason I can't fathom since this place is really about the booze and not the food) groups with children and large strollers. And I see the servers do the best they can to accommodate them, but this is really a much better place to go when there's 4 or less in your group.\n\n- For what you're getting, it's going to seem pricey. I agree the drinks are fantastic (Patience cocktail is my favorite), and I could go on and on about the perfection of the breakfast sandwich or the Brussels sprouts. But not everything is going to blow your mind. I am happy to pay for a little more for the atmosphere and convenient location. Plus, I now know what I like to order. But if you're the kind of person who would be annoyed by a $20-30 bill for a sandwich and 1 drink, then skip it. You're not going to love the atmosphere enough to make up for the price.\n\n- The servers and bartenders are actually very nice people. I've dealt with some who were just polite and others who were extremely friendly. But there are some sure fire ways to get bad service. Take big groups elsewhere (see point 1). Don't be in a rush. Try somewhere else if you want a night out on the town. HP has more of a stand-around-and-chat vibe.\n\nIf you're not sure about the place. Come for lunch on a week day. It will be much slower, and you can get a better idea if it's the kind of place you'd like without a $60 drink bill.", "author": "Cara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-05", "description": "Henry Public is pretty much a life saver. Arrived around 2:30 am and the kitchen was still full service ... :O\n\nThe ambiance is like a cross between a western saloon and speakeasy from the 1920's. It's really charming. Cocktails and service was above expectations and the food was delicious. Burgers and fries at night. And apparently the deviled eggs are good (but i know this doughnut ninja named Patrick who makes the best deviled eggs in the world, so these can only be second best at best)\n\nMy inclination is to award a 5th star only because of the late night service, but I imagine even when vampires are asleep, this place would garner a 5th as well. \n\nDope. Flapper. \n\nCash only.", "author": "Amik A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-06", "description": "they close at 3am on a Friday! I wish I had known this when I strolled in at 2:15...what a bummer.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "I have only been here for brunch, but they do it well.  I always get the steak and eggs.  The steak is a good size and very flavorful, and the eggs and potatoes are delicious.  The bloody mary is spicy and well-made.  I recommend the smoked almonds as a salty but tasty appetizer.  Minimal menu.", "author": "Bernardo F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-30", "description": "Really cool gastropub in Brooklyn Heights. I was lucky to have a friend who lives in the area who is in the know, otherwise I don't think I would've ever found this place.\n\nThe drinks are solid. Strong, creative, and flavorful. Also the bartenders will make you whatever you like if you ask nicely.\n\nThis place is known for their burgers. I can testify that the burger here is superb The patties are homemade and hand formed to maximize thickness and juicyness. The chefs actually cook the meat to order too (what a novel concept for a gastro pub) if you say medium rare, you'll get just that. For someone with a big appetite, the turkey leg sandwich is a splendid choice. Somehow the chefs figured out how to stuff about a pound of pulled turkey meat between two pieces of bread without it falling apart. It's quite an art and it's very filling. All the items that I tried that night were good.\n\nThis pub has above average food for a pub and I'd recommend it to anyone who happens to be in the Brooklyn Heights/Cobble Hill area.", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "Great selection of cocktails. The pimm's cup was delightfully refreshing. I also had the turkey leg sandwich - the bread was thick and my plate was piled high with delicious fries. I'm sure you could have split this sandwich between two people.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-11", "description": "$18 burger with cheese an bacon. What The What?!?!  \n\nSad, cause the staff was great (4), food was (4), decor was (5), but the prices ruined the experience (1).", "author": "Clavius L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "Once again, I am so lucky to live where I do.\nHenry Public. Your cocktails are excellent and old-school and the snacks you serve at the bar are great.\nThe back dining room, apart from being horribly lit (Can I come over and help tweak the lighting?) has most of the seating and is where we find ourselves fairly often.\nHere's a good meal for two people:\nOysters. Cheeseburger. Turkey sandwich.\nOr switch out the oysters for the bone marrow if you are feeling meaty. Or, have oysters and bone marrow. Why not?\n\nThe burgers may be the best in the area (not hard to do, though). They are really excellent. The roast turkey sandwich, as others have mentioned, is their star dish; amazing and simple.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-02", "description": "They're drinks are really not that great. They're watered down. If you get something super boozy though, you should be fine. \n\nThey're food, on the other hand, is off the hook. I first went here when I ate meat and got the Turkey Leg sandwich. The natural reaction to biting into that thing is,\" Oh baby you make turkey feel like butter in my mouth,\" or something along those ends. \n\nNow that I'm a vegetarian, I get the grilled cheese sandwich. It is by far the best grilled cheese sandwich I've ever had. It has a variety of cheeses, hard and not so hard, and it is impossible not to gobble down. Takes very unique despite that it mainly cheese cheese cheese. The variety of cheeses helps that.", "author": "Alexandra M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-01", "description": "I've been to Henry Public many times for dinner and drinks and had a good experience, but went this weekend for the first time for brunch.\n\nThis was the worst brunch ever.\n\nFirst, the service sucked. The waitress seemed deeply depressed and exhausted and was very slow. There was only 1 server for a full restaurant--wtf guys, hire one more person for brunch! She was doing her best but simply couldn't keep on top of the whole place. We had to flag her down repeatedly for small things such as water refills or salt \u0026 pepper, which weren't on the table. Our table also had melted wax on it and was pretty dirty.\n\nSecondly, the food was awful. My husband ordered the \"country breakfast\" which was eggs, sausage, breakfast potatoes and biscuit. The eggs were runny and slightly cold. The biscuit was undercooked. the sausage was good, but the whole thing needed salt.  I ordered the millet cake with poached eggs and hollandaise. it was totally bland.  The millet was so tasteless that it overwhelmed the whole dish.\n\n40 bucks for a meal that tasted like it should have cost 10 bucks at Denny's.\n\nI will certainly return for drinks or a burger, but never again for brunch. Henry Public, if you're reading this, please hire an additional server for brunch!", "author": "Spike G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-26", "description": "I'm giving Henry Public 5 stars for a mix of reasons. The cocktail menu is substantial-- I highly recommend the Beecher's Tonic. A great selection of classic cocktails with a twist. Not as many gin options as I normally would like but I love a place that's willing to include a variation of a pimm's cup on their list.  Quality. \n\nThe turkey sandwich is as good as everyone says. I can't believe how filling and enormous it is. The meat is extremely tender, though very moist. I appreciate the use of white bread but wonder if it would have been better on a heavier bread that would soak up the fat and make it less difficult to eat. That said, this is the kind of sandwich you'll want to eat with a fork and knife, because the amount of meat is enough that it would actually work on two sandwiches. You could easily split this. \n\nWe also got the marrow and toasts. Well salted and seasoned, the marrow scooped out of the bone without any trouble, which honestly, needs to be mentioned as there are many places that don't do marrow right. The parsley/shallot side (is it a garnish? is it a sauce? who knows) is a fantastic match to the high salt in the marrow. The vinegar cuts out any risk of feeling like you've just overdosed on your sodium intake. I'd love to see this on a sandwich somewhere. \n\nThe decor in this place is old-school Brooklyn. The wood is tempered and aging, with a sharp vintage feel that you know isn't forced. This is what the townhouses originally looked like and I love the little library in the bar area. Wooden benches paired with the white walls makes it feel like you're in an old-timey place. You feel like this is a hometown bar, much in the vein of McSorley's, but without the sawdust. \n\nHighly recommended. NOTE: IT'S CASH ONLY.", "author": "Brianne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "One of the best drink spots I've been so far in BK.  I enjoyed the champagne and honey cocktail, while my friends had their more traditional cocktails, we all loved them.\n\nGreat atmosphere and I found the staff to be pleasant.  Only drawback is they reserve table seating for food orders only, and the bar was packed so no seats to be found.  Note: cash only.", "author": "Jade L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "This place is a hidden jewel. I'm almost trepidatious about telling people about it.  I want to keep it a secret. if you like tequila, go in and order a \"Johnny Gordo\" and tell Darren jake says hi.", "author": "Jake M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-06", "description": "I love Henry Public.  Food is simple and good.  As a vegetarian there aren't a lot of options for me here but I still love the place.  The drinks are good, although a bit expensive.  The grilled cheese is my favorite thing on the menu.  DELICIOUS!  Paired with a bloody mary for lunch and your set!\n\nMy only complaint is that the house wine is grossly overpriced.  It's very very average and it $9 a glass!  My gosh.  I understand it's house so I don't expect it to be the best wine but it's priced like it.", "author": "Christina L."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}