{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "One of my favorite spots in the neighborhood.  Cozy and charming with a great bar and good food. The menu is very simple, but with options like turkey leg sandwich, you won't order anything else. But there are also daily specials if you feel like deviating, but I don't see why you would.  The also have something balled the Wilkensens, which are Danish pancake balls. I've only had them once here, but many times in Denmark and also made by my Danish husband and I can tell you they are spot on.  Great for brunch or shared as a dessert.", "author": "Kitty B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-07", "description": "The drinks are quite tasty and the beignets for dessert were delicious too. But all what I tasted that went down so good came back up when my friends and I got the bill. It's 2012 and the food and drink isn't cheap. With four of us our bill was $120 and as we pulled out cards, we discovered the place was cash only. I genuinely don't make it a habit to carry that much cash on me, and if a place is cash-only they generally make it a point to have an ATM convenientally located nearby. Not so with Henry Public. Was good for a first time but probably won't be back.", "author": "Micah P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-07", "description": "The people that work here are grade A jackasses. Were they really this rude in prohibition era? Is this a theme restaurant? Anyway, I live nearby and love to drink, but I will not set foot in this place again on principle. Get some manners!", "author": "Meowella S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "UPDATE: \n\nI have tried the food, and it is good. The Turkey sandwich is better than good, it's phenomenal. They make vegetable specials that are also generally good (I've had delightful Brussels sprouts and really good snap peas). They're still not vegan, but my spouse gave up that dietary lifestyle, so I am no longer concerned about it. whjch is good, because I mean to try the bone marrow with toast next time. \n\nThe drinks are still great. \n\nOn the other hand, my wife almost killed the waitress when we sent there with ~12 people (for a party in my honor) because the waitress refused to split the check. I'm not deducting for that because drama can be amusing.\n\n\nOld Review\n\nhigh-quality cocktails mixed by people who know what they're doing and have all the ingredients out like mise en place in special containers. different ice for different cocktails. I tried 3 (2 off the menu and one wet dirty gin martini) and they were all well-made. \n\nThe space is well-decorated for the theme. The servers were attentive when I first went (which was shortly after they first opened) but when I went in more recently it was too busy to get a seat. \n\nI have not tried the food. There is nothing for vegans to eat, and not much for veg people in general.", "author": "Josef K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-26", "description": "The location and atmosphere was great. The service staff and prices were not. The hipster waiter was rude, took forever and was trying to rush us out after we ate. We have a 4 year old and we felt glares for bringing him. The food was good but priced too high and the portions were very small. Oh, and bring cash cause that is all they take :(", "author": "Tyler T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "FINALLY. A PLACE WHERE I CAN GET a fancy girly cocktail AND a burger. Hallelujah. What a beautiful thing. I came here a few weeks ago with Mike to finally experience this utopian combination of classy and casual. \n\nCoincidentally, I did not order a fancy girly cocktail and a burger, because their menu threw me a curve ball--a turkey leg sandwich? What could this possibly be? So I instead went with a plain martini and a turkey leg sandwich (I have no words--it was just perfect and yum). We shared oysters which were also great. \n\nI will go back soon for my cosmo and burger.", "author": "Marianne S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-11", "description": "Food and drinks were OK, but service was atrocious. Unfortunately, my small group of co-workers and I got stuck with the red-head waitress, who was rude and ungracious during our every encounter. Avoid!", "author": "Evie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "Welcome to Brooklyn Heights/Cobble Hill's answer to \"where can I get a drink with Don Draper?\"    Not to say the clientele of this joint are a bunch of suits, but the ambiance of the place (low lighting, jazz playing, booth style eating, large sit-down bar, bartenders with skinny tie and tie-clips) brings you back to the speak-easy style.   Didn't try the food, but it very well matches the scene (burgers, mac n cheese, specialty deserts).   Perfect place to bring friends coming to town to catch up over inventive cocktails.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-12", "description": "Stopped in on a lazy Sunday afternoon to try the turkey leg sandwich (as part of my quest to eat my way through NY Mag's Top 51 Sandwiches list--basically my excuse to continue my already long-existing quest to stuff my face with sandwiches, but now with PURPOSE) and left feeling quite satisfied, if a little bloated. My companion ordered the egg, bacon and cheese sandwich, which was a very good version of something you can get practically anywhere, but the turkey leg was new to me and worth going out of your way for. Basically a pulled-turkey sandwich, braised in milk, seasoned generously with pepper, and topped with crispy battered onions, it was possibly the best turkey sandwich I've ever had--or if not, definitely the juiciest. Sweetening the deal were the fries, which were thin (my preference), crispy, hot and nicely salty. Overall, the food was excellent, and I haven't a single complaint about it. Okay, maybe it's sliiiightly overpriced, but given my enjoyment of the meal I didn't really mind.\n\nOtherwise, the place has an inviting, wood-heavy, rustic decor that makes me want to go back and grab a quiet drink sometime; unfortunately, just by looking at it (and the suspendered, old-timey bartender) I can tell it probably gets real annoying here on weekend nights. Seems fun to have this place in this part of Brooklyn, but I get the feeling I would probably hate it if it were in Williamsburg, if that makes any sense.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-09", "description": "Used to love this place. Now the burger is so spicy it's inedible. That, and a four dollar surcharge to replace fries salad means I won't be going back.", "author": "David A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-03", "description": "\"The Public\" as I like to call it is a gem.  Great crew, drinks, atmosphere and food.  Although the menu is a bit limited, they do an excellent job.  Seating is limited so I generally avoid on Fri-Sat.  Cash only!", "author": "Scott C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "The Turkey leg sandwich is stupid good. Ask for an extra napkin and be prepared to do some finger lickin", "author": "Eric W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "Fun place to get drinks! They have a great selection of delicious cocktails to choose from and several beers and wines. The atmosphere is cozy and nothing fancy. The service it super friendly and accommodating. I didn't get anything to eat, so I can't speak for the food but I have heard it's really good! My sister said they have a grilled cheese with apples in it and it's delicious! They also have lots of burger choices for the meat eaters.", "author": "Natalie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-17", "description": "Super cozy atmosphere. Excellent cocktail menu. I thought the drinks were priced a bit steep but you get what you pay for and these guys take great pride in their drinks- the Henry martini and public smash were favorites. \n\nOur waitress was friendly, knowledgeable and attentive.\n\nI'm looking forward to going back and trying the burgers.", "author": "lady j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "Awesome old pub atmosphere. Great mixed drinks and tasty menu. The staff is very nice and well trained. They serve food late which is awesome. Wish they accepted credit cards though.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-08", "description": "I've been here several times (twice while waiting to eat at Hibino - excellent resto) and every time I *want* to like it more than I actually do. It's too crowded and too precious. The drinks are pretty well-made but half of it is usually sloshed out by errant elbows or a distracted server. The one time we had brunch there, we were seriously underwhelmed. The food is not worth it. Oh, and it's also cash only and the closest ATM is across Atlantic Ave (takes foooorever).", "author": "Marisa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-23", "description": "Turkey leg sandwich. Get it. Don't bother with the burger. Trust me.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-06", "description": "Henry Public is a historical, charming space that serves great coffee and old fashioned champagne cocktails. The food is also on par. This little place kinda makes me want to move to Cobble Hill. This review gets four stars because while the staff is not unfriendly, they're just a tad bit too smug.", "author": "Heidi B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-04", "description": "Thanks, but no thanks.  Fine atmosphere if you like speak-easy style with 'could-give-a-shit' attitude.  The Richardson in Williamsburg is an infinitely better option if you want a high-class outlaw atmosphere to soak your brain in...even if you have to do a second underground commute du jour to get there.", "author": "Jesse K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-28", "description": "Crap do I wish this place was better!!!!\n\nRight around the corner from my quiet sedate Brooklyn Heights daddy mellowness was a cocktail lounge and burger hound paradise soon to open??\n\n16$ burger and 12oz egg cream were hugely overpriced disappointments.  The burger was poorly shaped and overcooked without a drop of juice.  The bacon was 1 overcooked piece split in half.  Ouch.  The egg cream was just as bad with 7 oz being drinakable and the other 5 as froth it was gone in 2 sips...\n\nThe cocktails were better and the decor is very nice although now defacto for every place in BKLYN to look the same unfortunately.\n\nI will go back to try the turkey leg sammy and have a fancy cocktail or two but man that burger stunk.", "author": "JereMY b."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}