{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "YEP\n\nI feel like I just made love to a sandwich. \n\nThere should be a complimentary cigarette after every meal. \n\nService was great. Cocktails were great. I would run away and start a new life with the turkey leg sandwich.", "author": "Mollie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-29", "description": "Return? Yes, nice local option\n- Atmosphere 4: cool saloon vibe\n- Service 3: friendly\n- Food 4: mac \u0026 cheese (4 w/ egg), burger (3+) w/ fries (4+), squash sum tum (5+ - delicious peanut sauce), pork belly (4+), scallops (5), yakitori (5 chkn skewer w/ veggies + mushroom sauce), choc mousse (5)\n- Drinks: glass wine, house gin martini (4 lemony flavor)\n- Cost: $73 w/ 2 drinks before tax/tip", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "Simple food friendly prompt service. Small neighborhood place. Limited menu small place. Great for 2 to 4 diners. Got the turkey sandwich yummy.", "author": "Beach G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-16", "description": "The service was great! The decor is lovely and I do appreciate the flashback to old English country. The food however solidifies the stereotype of bland gastronomy that even the English speak of themselves. The burger was a bad combo of powerful cheese and bland over cooked beef (though I asked for it rare), the fries were boring skinny salty sticks. The English breakfast was as boring as it sounds as well. \nNice place for drinks. Keep it at that.", "author": "Rony P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "Very cool old school bar. They had live music when I went in on a random Sunday. It was late afternoon and only a few people in the bar, but the band was still on.\n\nTo say the decor is vintage would be understating it. The walls have aged photos. The bathroom looks like an elementary school. There are folding chairs to sit on.\n\nThey don't have the most beers, but what they have is decent. Definitely worth stopping in for a low key drink.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-01", "description": "Always wanted to try the burger here. Today I did and I was extremely underwhelmed by the quality, old bun, dryness, lack of add-ons (pickles only). I will say that the fries are pretty solid. \nThe drinks are also good... but I'd hold out for a superior burger elsewhere.", "author": "John W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "*Now accepting credit cards*\n\nI could have loved this place. The decor is cozy and charming, and the turkey leg sandwich \u0026 fries are perfect comfort food. Great cocktails.\nBut the service! I can't think of an excuse for how inattentive and slow the employees on the floor were. It was a quiet night and the bartender had plenty of time to chat with a friend \u0026 eat dinner while we waited for the waitress to appear... and waited for our drinks to appear... There seems to be some confusion \u0026 lack of communication between employees- or maybe they're just uninterested. Left us feeling not quite relaxed.", "author": "Jess F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "If you walk in here, it's going to feel like you stepped back in time. It's like an old house became a bar/kitchen for locals to escape the norm.\n\nI've yet to try the food, but drinks are great (albeit expensive for this area) and there's live entertain regularly. My favorite drink is the sweet liberty smash -- yum!\n\nOH, it's cash only, so remember to bring a $100 bill for ya drinks!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-02", "description": "No longer cash-only but just as delicious. Very cool vibe to this place. Still my go-to for a turkey leg sammich!", "author": "Jason F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "Came around 7pm on a Friday for dinner. The timing was perfect because it appeared to get pretty packed as we were leaving. Cute little quaint place, felt like I was in someone's house. Turkey leg sandwich was delicious and I was even more impressed with their sweet potato mash. They were so light and fluffy! Sadly there was a long hair in my sandwich. Understand it happens, I was just a bit grossed out. But customer service was good and I am glad I checked it out. Order their speciality dessert. Reminded me of zeppoles. Warm and delicious. I would like to come back for brunch or lunch. Was", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "Popped in for a quick drink before dinner. Was tottering around like an idiot trying to find it because they are doing some construction or something on the lot next door and it completely threw me off. Doesn't seem like this gem of a restaurant should be there but it is!!\n\nStaff was SO nice! Very accommodating, I only had one drink (something with Pimms in it, I forget what else but honestly you had me at Pimms) but I am very excited to come back for more! I got there maybe around 8pm on a Friday night and within the hour the place was packed with people jostling around the door!", "author": "Chloe F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Hands down, one of my favorite Brooklyn bars! Love the thoughtfully curated drinks, the beautiful ambiance that is SO old school vintage Brooklyn, and the crispy salty French Fries! I usually get oysters and fries and indulge in the cocktails. Best served chilled with a good company :)", "author": "nina s."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-14", "description": "First timer. Absolutely horrible!, unless you happen to like being snubbed and made to feel inferior by (female) bar staff that I could out perform on my worst day, at prob twice their age. If you are looking for pretentious and pathetic, stop in! But please, God, do not think they represent the average New York bar (or New Yorker). Straight up.", "author": "Arlene P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-18", "description": "Ok this quirky bar is still quirky and I am just not enough of a drinker to appreciate the quality of the cocktails they make but I must say I was pleasantly surprised by Henry Public's brunch.\n\nAfter walking down Atlantic at 2pm on a Sunday in search of a place that would seat 5 of us and repeatedly being told the wait would be 45 minutes, we arrived at Henry Public and sat at the bar enjoying some drinks waiting for our table which only took 15 minutes. Score!\n\nThe menu is small, but everything on it looked delicious. They also have daily specials. My recommendation is to get an order of the Wilkinsons (dough balls with jam) and the Sweet \u0026 Salty French Style toast for the table and then order your own meal on top of it. It's a lot of food but then you don't have to make the decision between a sweet brunch or a savory one like the Turkey leg sandwich (which is enormous) or an egg dish.\n\nI'm not sure I've ever been to Henry Public during daylight before but it gave me a chance to appreciate the decor a lot more than I do during my night visits. You feel like you're sitting in someone's dining room in the 1800's (and you probably are).\n\nMy only complaint is a minor one. There seemed to be only one waitress for the entire restaurant which slowed things down a bit. It's not enough of a minus for me not to return. \n\nExcellent brunch!", "author": "Lana V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-24", "description": "Yeah, I'm so not feeling it. I walked into this place and immediately fell in love with the old timey vibe, the Edison bulbs hanging from the ceiling, the old, tiny booths and pressed tin ceilings. Circa 1938. Not quite Speakeasy, but Post Prohib chic (really, you can tell me I'm talking out of my...) This kind of bar has been popping up on the regular in this part of Brooklyn. But what else hit me as soon as I sat down? The lousy acoustics. Expect to be shouting to the person sitting one foot away.\n\nBut that wouldn't be so bad, really. I probably would opt to go elsewhere on Atlantic (love that cute new French place that opened up, but it seems to close hella early on a Thursday night) and if I wanted a loud and boisterous setting, Last Exit is right there, too. It's just that the loudness is so at odds with what seems like an intimate vibe.\n\nAgain, that's not my main issue with Henry Public. It's the utter bull$hit of being cash-only. Seriously. If a tiny one-person operation in a gallery on St. Claude St. in New Orleans can take credit cards when the average tab is $5, so can a \"gastropub\" where most cocktails are around $13 (I had two decent champagne cocktails that I liked OK, though nothing to write home about). End of story. No sign on the door warning you, either. How incredibly ridiculous to be scrambling for cash in this day and age when there's an app for that.\n\nYou can keep it.", "author": "Joi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "Marrow bones. Expert cocktails. Superb environment. Will return as long as they are around. That is all.", "author": "Saso F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Open late\nGood food but better cocktails.\nTheir veggie of the day is always done well\n\nCocktails 4/5\nFood 3.5/5\n\nOverall 4 stars for open late and good service", "author": "Ghazi S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-20", "description": "I guess a smile is too much to ask for. \n\nInterestingly, this place has charm to burn. It has an old world vibe and decor that just brings you right in. You want to love this place. You want to \"fit in\" to this cozy little world, a world that makes you wish you wore more bow ties. \n\nThe charm ends about there though. The service - the whole lot of 'em - couldn't be more disinterested if they tried. I've been here a few times over the past year and the service is consistently cold, icy, distant. The bartenders are prompt, but in an aggressive \"let's get this done\" way. I've never wanted to \"hang out\" here, because the service is so flat and weirdly intense. No smiles. No \"thank you's.\" Nothin'.\n\nI had an Oddfellow cocktail, and it was quite fine. (The cocktails are inventive and done well.)\n\nThe last time I went, Saturday midday, the place was packed, to a degree I suspect reviews of HP are irrelevant. My hope though, is that someone who works there reads this, and attempts to learn \u0026 share the fine art of being hospitable.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-17", "description": "Inconsistent service and the meanest, rudest waiters and bartenders.\n\nI used to love this place. They have one of the best dishes to eat in all of Downtown Brooklyn; however, my last three visits have turned me off and I'm not going back.  Usually, I would just say, \"Oh well,\" and never return, but I don't think they deserve to prosper anymore.  They are inconsistent with their standards (sometimes they let you order the turkey leg sandwich with the meat on top of the fries, other times they do not; sometimes they let you place an order to go if you've been drinking at the bar and just want to take something with you; other times they do not).  However, the biggest turnoff is the staff!!!  I understand that the venue is going for a certain feel and vibe - and maybe they want the staff to look and act a certain way - but, goddamn, at least be nice to your customers.", "author": "Phil M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-05", "description": "Good place for cocktails, but a great place for spirits, because I'm pretty sure this place is haunted. Look around, it's paranormal, like I just went back in time a 100 years, and maybe I did, because this place is cash only, no matter how much my bill is, and I can never get cell service when I'm in there, which is scary.", "author": "JARED T."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}