{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-03", "description": "The half-mile trek over from BH during a downpour wasn't easy,\nBut we warmed up once we entered this cozy little speakeasy.\n\nThe beers they carry are not all microbrew craft,\nBut they do have a pretty good selection on draft.\nAll I had was the Captain Lawrence Pale Ale.\nThe hoppy flavor of this beer on my taste buds never fails.\n\nThe food selection is limited, but you will end up with a hearty meal.\nThe wooden décor gives this place a Turn-of-the-Century feel.\nI enjoyed watching the servers dressed up like Little-House-On-The-Prairie,\nBut my friend was only interested in playing finger hockey on the table with a juniper berry.\n\nGetting a table near a dry heated area was my desperate wish,\nBecause the rain soaked socks in my shoes uncomfortably made my feet squish.\nIt would have been nice if our hostess seated us next to a fireplace,\nBut the place was obviously crowded, so we couldn't get that prime space.\n\nI had a HUGE turkey leg sandwich with fries.\nWhat a nice early Thanksgiving dinner surprise!\n\nIt's supposed to be eaten like a sandwich, but the bread I did not to eat.\nIt was toasted but also soggy from the sauce of the meat.\nToo soggy to pass off as toast,\nBut I don't mind since I liked the turkey the most.\nThe turkey portion was plentiful and both salty-peppery in taste.\nSo much meat leftover, but I unfortunately had to let all go to waste!", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-22", "description": "The cocktails and food are great, as are the bartenders.  The table waitstaff is sometimes rude and snobbish.  Sit at the bar and eat.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-27", "description": "Snobby. If your are a snob and enjoy dining and drinking in the company of snobs then you will like this place. I live next door and have been here many times by virtue of convenience over the last three years and this is my prevailing impression. I apparently do not meet the invisible bar the bartender sets with regard to who he treats with courtesy and who he blows off as someone who doesn't deserve decent treatment. All I want when I go here is a drink with a minimum of drama, but even that seems beyond the reach of the stuck up tiny dog owners who work here. I went in tonight and ordered a jack and coke. I realize this isn't the typical $13 cocktail, but I live next door. The bartender first handed me a warm, 6 oz bottle of coke followed by whiskey after a 10 minute wait. I'm not stupid. I know when I'm being insulted. I'm sorry I didn't pick up the requisite sophisticated drinking habits while I was living a non-hipster, normal life. Like I said, I live next door and have been here many times. I've been treated disrespectfully almost every time, but tonight finally put me over the edge and convinced me to make a yelp account specifically for this place. So don't go here. Unless you're a snob.", "author": "Nathan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-10", "description": "super cozy when it's freezing outside and you're looking for something to save you.\n\nburgers are at least a few inches thick and cooked to your fancy. my old fashioned warmed me up pretty quickly- made with rye... just like i like it. \n\nbut the kicker... what you want to live for... is the bone marrow. add a little of the pickled shallots and parsley on top and you've got a taste sensation on toast. \n\ni left with a belly comfortably full of meat and booze. the best kind.", "author": "Tina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-01", "description": "Henry Public allows you to skip the whole time machine calibration and just step inside the door to return to the prohibition era. Slight twists on old school cocktails (slightly pricy) perfectly prepared and delicious will keep me coming back here. The decor/lighting goes perfectly with the fare and libations.", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "I live practically across the street from this place, so I'm there all the time. Thus, the four stars are an average of several experiences--pretty high, as averages go. \n\nThe pros: Turkey. Leg. Sandwich. I agree with many that it does not sound like it's going to be amazing. But it is. they put little bits of battered and fried onions on it. Seriously, crack in turkey form. \n\nI also enjoy the deviled eggs and the lamb chop special, whenever they have it. It's the best lamb I've ever tried. \n\nMany here have complained about the service, but for the most part I've experienced nothing but friendliness. Maybe some of the surly people were let go? Anyway, that's never been a problem for me. \n\nThe cons? Gets super crowded, so you have to go early or be patient. Also, I'm not blown away by their brunch options. And ironically, brunch was the only time I've had to wait an unreasonably long time for food, which is weird because the place was mostly empty. I guess we were among the first customers and they hadn't gotten their act together quite yet. \n\nI realize I'm leaving out their cocktails, which are supposed to be the main attraction. I'm a beer and wine gal myself. If a drink has more than four ingredients and one of them is bitters, it's just too high maintenance for me. But if you're into that stuff then it's yet another reason to go.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-17", "description": "i'm SO happy that this place finally opened after more of a year of prep, and teasing!\ngreat vibe, very friendly... fantastic drinks (we expect nothing less from matt \u0026 the brooklyn social gang), and really nice burgers, fries and.... consistently good oysters! i am not a huge lover of oysters, but henry public has reliably had nice, fresh ones.\nmy only problem with this place is that i CANNOT resist calling it \"the republic of hens\".... anyone else?", "author": "jessica l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-01", "description": "People are not joking, the Turkey Leg sandwich is ridiculous. I feel a little sad that I already know I will be disappointed on Thanksgiving when I am not eating this.\n\nThe smoked almonds are also really good. They taste like camping.\n\nCute atmosphere/decor. I wish the took credit cards though.", "author": "Lindsay P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-12", "description": "usually i hate places like this but for some reason i like this place. surprised even myself when i gave it a chance.\n\nglad i did!!\nhad 'the brooklyn ferry', which had the kick of about 3 drinks. also had something along the lines of a julep. also good. both caused me to keep someone on the phone for way too long as i rambled on and on about nothing outside in the freezing cold outside the 2/3 clark street station. hey you're only young once.\n\nthey'd played some billie, which was ok, but the waitress was totally hating on me though, whatev. i think i'm charming.", "author": "jen f."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "Damn good gastrobar and vintage vibe.  Cute place too.  The crowd is a little pretentious but when you're with the right people, as I was, it didn't matter.  This past Saturday it seemed like the perfect hang for a Wall Street release party.  Supreme service from the attentive bartenders who dropped whatever attitude everyone keeps talking about, and poured my drink right away.  I had questions about the extensive cocktail menu, they responded.  Unfortunately I wasn't there for long so I could not enjoy the scrumptious meal options or the roasted almonds, as I am allergic.  Instead I enjoyed an \"Oddfellow\", a roaring 20s-style cocktail, with rum, grapefruit, lime, house bark, maraschino and root syrup ( a tad too much but I got its drift).  This place should expand and partner with HBO on the new series \"Boardwalk Empire\".", "author": "Christian R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-08", "description": "meh.\n\nlooking over the existing reviews, i think this is the sort of place you either love or hate. and, for me personally, i think it'd be the sort of place i'd love if it was in manhattan. but it's not, it's in brooklyn, and $11 is too much to pay for a drink in brooklyn.\n\nwere the cocktails creative and tasty? definitely -- and that's why i think i would like this bar if it was in manhattan: i've come to appreciate manhattan bars where i can sit, actually hear the conversation i'm having with my friends, and have an unusual drink -- and i'm willing to pay a little more for it, especially if those drinks pack a big punch.  these are the reasons why i really enjoy mayahuel and flatiron lounge.\n\nbut.\n\nthis bar is not in manhattan. if i'm drinking in brooklyn, i want cheap ($8 is a splurge in my beloved borough) and $11 is simply too much. also, if i'm in brooklyn i want waitresses with less attitude. also also, if you're gonna be cash only then the least you could do is put an ATM in your bar, or right outside it, or something.\n\nthe juniper pickles and the almonds do earn them extra points (especially the latter -- they were hot and wonderfully smoky) and each was only $2, but that doesn't really balance out the cost of the drinks enough. in summary, i live a couple blocks away and yet i'm not going to be a frequent visitor.", "author": "Lily T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-20", "description": "Ambience:  Perfect\n\nFood: Spot on.  Of course the turkey sandwich is solid.  Maybe turn down the gas on the grill- great grill marks but smells likes fumes.\n\nService:  Excellent and superb.", "author": "X X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "I'm updating my review.  I had a great meal here on a Wednesday night.  Service was friendly, ambiance was good (not too loud, but comfortably populated... five-minute wait for a seat at 10 pm).  Most importantly, their menu now includes daily vegetable specials, which happened to be very good on this day: heirloom bean soup and braised mustard greens.  The turkey sandwich was good, and the juniper pickles are nice (assuming you like juniper).\n\nI had the house red which was fine.  All in all I think this place has settled into being the slightly-upscale-but-relaxed neighborhood gastropub I had hoped it would be when it first opened.  With ambitious cocktails, of course.", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-05", "description": "I have gone to Henry Public several times, as it is literally around the block from my apartment.  Very nice atmosphere, very intimate environment. \n\nThe food menu is surprisingly short. Out of the few items, the turkey leg sandwich is awesome. It's extremely moist, easily the most moist turkey that I've ever had. My only complaint is the bread used in the sandwich (milk bread) is a bit too thick and dense, but I guess it serves its purpose by being sturdy enough to hold the moist turkey meat.  \n\nIf I'm not in the mood for the turkey leg sandwich, the burger is also extremely good. Between those two items, I'm sure to always be satisfied after a visit here.", "author": "Don N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-27", "description": "Great chill place to go on a friday night for beers and burgers. The Turkey leg burger is amazing. I wish they had a choice of sweet potato fries instead of the supermarket bought ones. The draft beers were awesome!", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-19", "description": "Henry Public is excellent. Turkey Leg Sandwich. Yum. Get the Wilkinson's. No matter what.", "author": "Woody A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "Great brunch spot! They make a good burger. Quieter atmosphere than a lot of other similar places in the area.", "author": "Chris F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-12", "description": "NO STARS\n\nI am in the industry. I know good food from bad, and good service from terrible.\n\nFour top at 12:30am. We simply wanted burgers and beers.\n\nOur food arrives.\nFries are overcooked and cold.\nWe do not receive the condiments we asked for specifically.\nWe ask the server for them. She gives us enough for only one person.\nA medium burger is COMPLETELY RAW in the middle.\nWe asked for the attention of the same server. \nShe refuses to get up from where she is sitting and simply raises her voice to ask, \"What do you need?\"\nWhatever cheese-like substance is served with the ramp special is sour.\n\nWe do not want another burger to replace the raw one. We want to pay and leave.\n\nThe check arrives, and the server says, \"The burger is on us.\"\n\nYou're damn right it is. \n\nIf you are reading this, please do not go here. And if you already have, do not subject yourself to possibly another experience similar to this.", "author": "Elisa K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-22", "description": "Meh, indeed. I think a \"meh\" food experience deserves two stars though. I'm writing this review because I've seen them written up in NYMag and Brownstoner and I just want folks to stay away. There are much better eating experiences even close by (Atlantic Chipshop and even the overrated Hibino blow this place out of the water), and far better burgers within spitting distance (Bar Tabac, etc.). I repeat: Meh.", "author": "Dave M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "I still like this place for the ambience and the cocktails, I can't vouch on the food right now because I know they just changed the chef and haven't eaten there recently. I love it late night when it's quiet, always feel like I've stepped into another time.", "author": "Amala M."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}