{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-01", "description": "Umm.  I am trying to get past my visceral dislike for the music that was playing while I was having a wine at the bar with my old man (what I call '40s war music).  But why were there sooo many children here?  Seriously, every table had a child.  I mean little kids.  I can only attribute this phenomenon to our being at Henry Public at 6pm on New Year's Eve.  Leaving that aside, the bar is a bit too bright for my taste and the staff struck me as being a tad smug.  My old man liked the place much better than I did and clearly would have rated it higher than 3 stars. Beware: CASH ONLY!", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-30", "description": "Handsome space and quite obviously the current darling of the Cobble Hill haute swill scene. This comes courtesy the proprietors of Brooklyn Social in Carroll Gardens and it's a fine fit for the hood.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "cocktails are great. egg cream is such a win! wilkinsons were very, very good!", "author": "M L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-06", "description": "Cocktails were way cool, food delish, service fun fun:)", "author": "T R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "Awesome ambience.  You feel like you've pulled your carriage out back at a roadside inn on your way to the Great West and the widowed proprietor has invited you into her living room for leftovers and a cold beer.  The turkey leg sandwich is delicious, but expensive for a sandwich made of meat that costs $3.  The mac \u0026 cheese is good, but not life altering.  Putting bread crumbs on top of mac \u0026 cheese to fake a crispy top is cheating.  It just is.  The highlight of this place is definitely the doughnut dessert with caramel dipping sauce.  I would go back repeatedly just for those.", "author": "Kelly F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-11", "description": "This is a bar. A warm, friendly, neighborhood place. It's also a truly excellent restaurant. The small menu has only a few options, but they are consistently well-executed. It's not cheap, but you never feel cheated - the quality and attention to detail do not disappoint. Even the scrambled eggs are a marvel - perfectly cooked, neither runny nor stiff, and amazingly flavorful. They use organic, locally-sourced materials, and take pride in their craft, both in the kitchen and behind the bar. The bloody mary (here called a bloody henry ) is the best I've had, anywhere. One of the standout neighborhood places in a neighborhood filled with great choices.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-21", "description": "Cash only annoys me.  It annoys me even more when I have to pay 11 dollars for a cocktail in a place that is cash only.  But with that said, the place is still prettty nice.  I havent had any of the meals, but the fries I had were good.  Solid cocktail list, though I usually just order an old-fashioned.  The place can get a bit too full, which kinda sucks.  I've gone here a few times and I think I only had a seat once -- the other times I was forced to stand.  And the area around the bar can get very packed.  Overall it's a solid place.  Maybe more of a 3.5, but I'll still come here once or twice a month.  And unlike some of the other reviewers, I haven't had any issues with the bartenders.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-10", "description": "Great cocktails\n\nGreat burger\n\nTurkey leg sammich is nice - but not nearly as good as the numerous write-ups make it seem.  \n\nCan get very crowded, but well worth the wait.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-21", "description": "This place has a great vibe and delicious cocktails. The only odd thing was that about half of the patrons dressed as if it were the 20s, which accorded too well with the decor and ambiance... It started to feel like Epcot Center. Still, I would highly recommend this place for dates or dinners. Everyone was friendly and the music was kept at a nice level for conversation. What a pretty place to get drunk in the afternoon.", "author": "Jacob L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-11", "description": "3.5 stars.  This is a nice little pub with a good bar and decent burgers.  It can get uncomfortably crowded but other than that, I have no real complaints.", "author": "RJ S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-16", "description": "Loved indulging my inner carnivore with some bone marrow while listening to ragtime jazz and old timey country music.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-02", "description": "OK, I haven't had the turkey leg sandwich, but I really liked the burger, the oysters and the grilled cheese. This is one pre-Prohibition bar that actually feels authentic, not like it was assembled from a kit and staffed solely with bearded men. (Though we did see a waxed mustache on a patron there - horrors.) Great cocktails, lively and cool bar scene - the only bummer is that it can get really crowded. Avoid peak nights or arrive early - people are actually coming in from other neighborhoods to go to this neighborhood spot.", "author": "Gastro C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-21", "description": "First off, I do like this place. I love that it's like someones house and the fare is tasty. Drinks are strong and thought out and not as expensive as other craft cocktail joints. My problem here is that the pretentious bartender dramatically licked his bar-rotted finger tasting a syrup and then touched my drink and straw with the same slimy finger. Disgusting. This was after he was showing off his busted slide dance moves while the other bartender smiled approvingly.  All too proud of his embarrassing self. For a place that prides itself on having caring and knowledgable artisans, this guy seemed like he couldn't care less, with no style or finesse at all.  I don't know how other people feel, but I just can't stand hearing and seeing the chit chat and cheeky humor of the staff between each other while I'm trying to enjoy myself and paying good money to do it. Let the sociopaths, fratboys and old men party with the bartenders in murray hill! Making a drink shouldn't be interrupted three times with stories to each other about weekends, travels, mom issues, etc. I work in the food industry, and I know the customer isn't there to hear about me. Enough is enough. I wish I worked for the health dept... Just once.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "bloody mary's in a mason jar with a radish \u0026 olive garnish..i'm sold. It was a solid one too, and I keep the bar HIGH. love the wood paneling and black \u0026 white photos on the wall, like an old-school parlor--this place is perect for an afternoon cocktail and a bite. a welcome addition to the neighborhood, indeed.", "author": "luvsbklyn k."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-10", "description": "Not terrible if you can get over the pretense. Prices not outrageous but no deals (on a friday night when I went) either. There are no TVs or anything for entertainment. They should at least have some games.", "author": "Billy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-04", "description": "Everything about this place is great, except for one thing: they don't know how to cook a burger. Have been there twice with groups of four and five. Most of us ordered burgers at different temperatures from rare to medium well. I intentionally ordered mine rare because I heard that they tend to be a little on the done side. Everything came out well done, which is a shame since the grind they are using is clearly stand out. I'll try one more time, but probably won't order a burger if they can't get it right next time. I would have given them four stars otherwise.\n\nOtherwise the drinks well made with a nice balance and there is a nice selection of tap beer including a few regional picks. The menu is small but with a nice mix of bar snacks and entrees. Lamb chops were perfectly done and Mac and Cheese was a nice interpretation--cast iron skillet, mushrooms, and a good char on the top.", "author": "Derek V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-21", "description": "Just had brunch here and although the food was a solid 3 stars the service was horrible enough to warrant only 1 star. \nWhen we arrived we stood at the door inside for about 5 minutes waiting for someone to acknowledge us with no luck. We just walked into the middle of dining room to finally get someone's attention. Finally acknowledged, we were sat right away at an open table, there were a few. We ordered within a couple minutes, Steak \u0026 Eggs, their version of Eggs Benedict and Beignets, two cups of coffee. We got our coffee rather quickly and the Beignets about 10 minutes later. They were very good served with tasty raspberry jam. Unfortunately our entrees were literally served 1 hour and 10 minutes later. No coffee or water refills until we asked and more importantly no recognition from our server that anything was amiss.  The table next to us got sat at the same time as us got their food paid got up and was sat again. the new people got their food within two minutes of us. \nNow, I understand that they were busy and things happen but you have to acknowledge that something is wrong and that you're working to rectify it. Our server ignored us. We had to flag him down for coffee, flag him down for water, flag him down for salt and pepper (he ignored us this time and the Eggs Bene went woefully underseasoned), flag him down for the check. $42 for what? 1.5 hours of frustration and hipster indifference.\nIt sucks because we live two blocks from this place and the food and drink are generally good and decently priced. I doubt we'll be back.", "author": "Jared B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-30", "description": "Low key atmosphere, pretty good food, been here a few times BUT today most likely made our last visit.\n\nMy husband \u0026 I popped in for lunch, ordered burgers. We asked for house red ($9/glass) , at which point were told there's the house wine plus a couple other selections, which were then revealed. My husband then ordered two of one of the other wines for us. The wines were brought by a reasonable time and then we proceed to wait for our food. After 45 minutes we inquired and were told just three more minutes. By this time we'd polished off the wines so when our food finally arrived we ordered two more glasses of wine. The burgers were fine. Afterwards we ordered coffee ($2.50/cup) and asked for the bill: A WHOPPING $101!!! This is for lunch --no appetizers, no desserts. We feed our family of 5 at decent restaurants for less than that. So when we asked for the house wine we forgot to ask if the alternatives suggested were more than $9/glass (as apparently they were -- bill was not detailed -- drinks totaled $60). $101 with tip on top is ridiculous -- for Manhattan or Brooklyn. We won't go back.", "author": "Natasha S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-08", "description": "The drinks were okay.  They really only serve food between the times listed, so be sure you get there at the right time if you want to eat.  Otherwise, don't bother.", "author": "April Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-11", "description": "A great, casual bar. The open-faced dark meat turkey sandwich is astoundingly good.", "author": "Jason S."}], "servesCuisine": "Gastropubs", "priceRange": "$11-30", "name": "Henry Public", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "329 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ITvtbVX0dncsnoY1GVg3zA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528630"}