{"aggregateRating": {"reviewCount": 181, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-04", "description": "Chicken tikka masala biriyani was dry. Needs to add potatoes.", "author": "Eve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "I called Masala Grill just 10 min before they closed to place a large order for the following day. They were so accommodating and said they would make sure the food was delivered before their open of operations for the day. \nThe food arrived early the next day, Imran was incredibly generous and helpful with the delivery. I can't say more, it really felt like a mom and pop shop who goes the extra mile. About 30 min after delivery, they called to ask if everything was OK. It sure was. \nThe food was warm and tasty- Thank you, Masala Grill!", "author": "T D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Have eaten here 30+ times in 3 years of being here. They're always happy to see us.\n\nExpect the complimentary papadan (the Indian version of chips and salsa), and an occasional complimentary kheer pudding for dessert.\n\nTheir service is good, but the food is what steals the show for me. Some menu items are admittedly a big weaker (the biryani was slightly disappointing the one time I got it) but the staples can't be beat anywhere else in the city, including the uber expensive places like Sapphire in Manhattan. My favorites are the Mahkni, the Mushroom Saag. Garlic Naan is above average. Free rice with each entree. You will not regret coming here! Don't listen to the haters.", "author": "John H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Worst Indian food I've ever had! The artificial coloring of the paneer tikka masala is nauseating. The cheese naan had cheddar cheese, does not go well with each other. Don't order from here!", "author": "Mayank P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "Love this place. Their food isn't heavy and it always tastes very fresh. I recommend it 100%.", "author": "Loui M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "This review is strictly for delivery. This is my go-to Indian restaurant. Their food tastes flavorful and fresh, and if you want spice, they can do that too. The delivery people are decently speedy and friendly. Great samosas. My boyfriend says their too salty, but that's how I like them.", "author": "Ashlyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "My boyfriend and I were looking for something to eat and stumbled across this place. I was very hesitant to try it considering I've never had Indian cuisine before. The food was absolutely delicious and the service was excellent. We will DEFINITELY be coming back!", "author": "Maria K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "I travel to India for work and love Indian food.  My husband loves it more.  A true relief we found a decent fairly authentic Indian American restaurant. Their biryanis could be a bit better- but it's almost impossible to get a decent one in Brooklyn...still, hot fresh and delicious.\n(THANKS!)", "author": "aimee m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Downgraded to 3* after experiences on three separate evenings. The positive - food is great.  I especially liked the yellow dal, but also had chicken curry and chicken korma.  The naan was also very good.  The bad - the service was very sloppy on all three occasions.  Two of three occasions no utensils were provided even though I asked for them.  The only reason it wasn't all three times is because I specifically asked as I walked out the door the third time.  Another order was incomplete and  when I called the manager said he knew an item had been left out (Why didn't you do something instead of waiting for me to call?!!!).  Not sure I would return.  It is disappointing because the food is excellent.  Manager, if you're reading this, you really need to pay attention to the service details.", "author": "Don P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "I'd give 0 stars if I can to the terrible management here. My child accidentally ordered at the incorrect location. In less than 5 mins after placing the order I called to canceled. They kept telling me to call back and hung up on me several times. After 10 times if trying to call them I gave up. \n\nThey called me about an hour later to pick up the food, I explained the situation once again. Apparently when they called me back the person was in a quite place and I didn't hear any loud noises. He kept yelling at me saying who's going to pay for the food. \n\nYou're doing a TERRIBLE job here management. If you picked up the phone the first time we wouldn't have this issue.", "author": "Q B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "Yummy!! I ordered the chicken tikki masala lunch special from here. The deal is a great bang for your buck. Comes with plenty of tikki masala and a good amount of chicken. Also comes with a large naan with plenty of dipping sauce. And don't forget the rice, it's a little dry though. The flavors are delicious, the order is probably large enough for two people to share. It also comes with a mango rice pudding dessert at the end of your meal.", "author": "Susanna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Our go-to spot for local Indian food. Always delicious! Very loyal customer and always very fast delivery.", "author": "L W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "I've ordered in from here a few times.\n\nThey're always on time and the food is always hot, fresh and tasty.\n\nMy Indian food go-to is vegetable jalfrezie and their's is pretty good.  Not the best I've ever had (the sauce is just a little oily for me) but solid and well worth the price.  Also, they don't carry brown rice-which makes me sad-but the basmati rice is good.\n\nI definitely recommend the mango lassi-such a great summer treat!\n\nSo far, this is my place for Indian in this hood.  Still keeping an eye out though.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "I don't know too much about Indian food so not sure if it's normal or not but the Chicken Tandoori came out in a sizzling fajita platter sort of thing and it was very savory and delicious. Would highly recommend ordering it. The garlic naan was also very good.\n\nAlso I didn't know beforehand but it was BYOB.", "author": "Will M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "I was craving Indian food so I searched everywhere near me in downtown Brooklyn. This was a great price and the delivery was so fast and the food was still hot when it got to me. I ordered chicken tikka, naan, and a mango lassi and it all was fantastic. Definitely my new go-to Indian restaurant!", "author": "Mary T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "I can only speak to delivery, but service was great -- swift and accurate delivery. The food was excellent, with far more subtly and elegantly spiced flavors than usual for neighborhood Indian restaurants. Well worth a visit or a call.", "author": "Harry M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "Got the worst case of food poisoning and parasites in my digestive system for months. I had to go to the Nigerian health store down the street to get something to rid the toxins from my body. Then I ended up in the hospital seeing a G.I. Ate there 2 days in a row. Big mistake. I eat Indian food all the time and I grew up on it. One of the dishes with chicken was so undercooked on the second day. Never went there again and have since been fine.", "author": "Demi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "On the menu, there is an appetizer called Ka-Chori. Everything else has a brief description, but Ka-Chori is listed as, \"Too difficult to put into words, but highly recommended.\"\n\nA couple things about that:\n\n1. I will always order something with that description.\n2. I've heard myself described the same way.*\n3. If I was to put it into words, I would describe Ka-Chori as a saucy and colorful (I'm 90% sure they swirl the green, brown and white sauces included in every order on top of the dish) mixture of potato chunks, whole chickpeas (that aren't mealy, for the first time in recorded history), and some crusty, bread-like chunks of deliciousness.\n\nAside from this one appetizer, it turns out that Masala Grill also serves all kinds of delicious Indian food. \n\nThe naan is fluffy, the staple dishes (for me at least) like Chicken Tikka Masala, Lamb Vindaloo or Rogan Josh, Chicken Bhuna, Saag Panir, Tandoori Chicken...are all fresh and flavorful.** And if you order any of these delicious dishes, they'll give you at least two more sauces than the four you normally get at most Indian joints. That alone is a huge win. \n\nOn the side of sadness, they have a strange habit of hiding whole star anise in dishes randomly. It's like an awful surprise of both texture and flavor, and I'd appreciate it if that wasn't a thing anymore. \n____________\n\n*That's not true.\n** I'm not a big fan of Malai Kofta, because who really wants veggie balls in a bland sauce? But my wife will continue to order it...I'm assuming just to bother me.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "This place was soooo delicious there are vegetarian options and the staff is so friendly the service was great and it was very clean I will definitely be back!", "author": "Gabriela G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Excellent food. One of the best places around. I was impressed with how fresh the chicken was. Also very fast service.", "author": "Binay P."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Masala Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "501B Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/s9gbwqe7daRWG-aswJhdJQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188759200"}