{"aggregateRating": {"reviewCount": 181, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-11", "description": "Food is average. Most importantly we had a terrible service experience. We went there at 8:30 pm and they refused to serve us and informed us that only take out and delivery is available, Twice!. Briyani was disappointing. Not worth the money.", "author": "Varun E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "Awesome Indian Restaurant!!\nVery comfy and good vibe. Next door is a liquor store so you can buy a wine bottle first and then have dinner, ask the waiter if you can drink your bottle inside the restaurant... It's allowed. The food? Best Indian Flavors I ever tried... ENJOY AND BUEN PROVECHO.\n\nMariel", "author": "Mariel G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-11", "description": "This review is for the delivery service only: I've never experienced such a horrendous delivery man. He did not ring my buzzer, instead I was startled to hear an increasingly angry pounding at my front door to the point where I was getting afraid to open it. When I did, he practically dropped the plastic bag, he couldn't have dashed off sooner. I didn't even see his face as I was mid \"thank yo...u\" when he had already rounded the corner to, I assume, nearly break down someone else's door.", "author": "Angie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "I ordered delivery today . I ordered the special lunch lamb curry that comes with a side order of appetizer , rice and naan . I ordered the pakora . My pakora was two piece the rest was kachori that is why I gave it only four star. The lamb was good just it was made for American customers not as spicy . I loved the naan .its enough for two people .  They give a lot . \nI'll order again .", "author": "Karsang G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Great atmosphere. Great food. Great service. What else can you ask for? \n\nMust try: mango lassi (it's creamy yet you really taste the mango flavor), saag paneer, chicken tikka masala, vegetable samosas and garlic naan. \n\nI will be back for sure!", "author": "Naeema P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-03", "description": "Somewhat disappointed they messed up my online order which did not arrive until the next day.  Food was good but not as good as when they first started. Thus, I have to be as objective as possible and strip a star. Also those Bollywood videos are very distracting : I get turned on lunch time when I pick the food up and its way too early for that.\n\nOne final note. The only true delightful memory I bear of the place is seeing my douche coworker barf on the sidewalk from his lactose intolerance.", "author": "Dmitry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "In walking distance from my office. Love the lunch specials. Went to pick up my food with my coworker on a nice day and the guy who took my order gave us some rice putting. Nice size portions", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Authentic Indian restaurant. So delicious food.Great customer service. Garlic naan is so flavorful . Nice inside decor. I will come back again", "author": "Nawaz I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "The days of feeling like a silly tourist dining under those awful red string lights in Indian restaurants at the east village have long gone. This cute gem in Brooklyn within walks to the Barclay Center is an excellent proves just that. Clean and simpler deco, friendly services, cheap eats (20% at lunch), and wonderful home cooking like dishes make it a must try!!", "author": "Jimmy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "Solid indian food . A good combination of flavors and huge portions make this a place I'd visit again. It was also very reasonably priced. I paid 12 dollars for a huge skillet of chicken tikka. My only complaint was I ordered the grilled veggies and they were doused in a weird butter and sour cream concoction (not specified on the menu) and tasted terrible. Like so bad I had to ask the waiter to take it off the table . He was nice enough to not charge me for it though which was a plus. Also no idea why the chicken tikka was so greasy when it's supposed to be baked but it was tasty nevertheless. Overall go check them out!", "author": "Sarah A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "I've been here a few times -- a mix of takeout and dine in. Happy with the flavour, speed, price and service. Staples like chana masala, sag paneer, naan are good. Aloo Mutter Gobi was a pleasant surprise. Comes in/as a sauce.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-25", "description": "Decent food however delivery service inconsistent. Latest experience we had to wait over 1h and 1/2 of back and forth on the phone promising the delivery soon until we cancelled out of frustration", "author": "Ludovic L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "Very yummy! Love the Bollywood on the tv and the rice pudding. Great customer service!", "author": "Zoë S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-09", "description": "Just ate lunch there with my sister and kids. My son loved the samosas. But honestly it was a little bland for me. It wasn't spicy AT ALL. It is obviously geared towards Americans. They really need to add some spice to their food. It doesn't have an Indian flavor at all. I tasted the vegtables and meat and didn't taste any spices.", "author": "Andrea K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "The food is amazing for a low price. George customer service is great he makes you feel right at home.", "author": "Danny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "The best Indian food in Brooklyn! A friendly staff and the best Malai Kofta I've ever had. My boyfriend and I come all the time.", "author": "Amanda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Great food, great service, great environment, Great carrot pudding. 100% hands-down coming back!", "author": "Skylar M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-20", "description": "Although I have eaten here for several years, I yesterday encounter severe disrespect, arrogance and poor service for a home delivery. I ordered Salmon and another meal for my daughter. When food arrived the delivery was signed , and the delivery man was given a tip. I opened the food package to find I did not get Salmon , but Chana !!!! Calling the store back the person who claimed he was the manager insisted I ordered what I do not eat, and refused to give his name, and rudely hung up the phone on me. I returned the call, and got more rude from this guy. I immediately walked to the store and demanded money back for unwanted food and tip that was given to delivery guy. Said person was told he just lost a long time customer.\nI do not recommend this type of business that does not understand the first rule of business \"the customer is always right\".", "author": "Aneb S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "I had a great lunch here. The food was satisfying but not greasy at all. The entries aren't huge, but with rice (included) we had plenty to eat. Excellent experience overall. \nP.S Would definitely recommend the mango lassis :)", "author": "Asa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-19", "description": "I went here for the lunch special on a Friday. I had been here twice before with no issues. On this occasion one of the Nan breads was not fully cooked. I told the waiter and he stopped briefly and kept walking. He never attempted to fix the situation. Nor did he even return to our table once. I don't know if he was just being rude or if he didn't understand enough English to reply. \n\nFurthermore, when I took my food to go, he placed multiple foods into a single container. It seemed as if the container was too small and he didn't even give me all of my leftovers", "author": "Derek S."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Masala Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "501B Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/s9gbwqe7daRWG-aswJhdJQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188759200"}