{"aggregateRating": {"reviewCount": 181, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "We love the chicken shahi korma, rogan josh, and the jalfrezi! Ordering seamless on a Friday night from Masala Grill has become our favorite plan. We love this place!", "author": "Katherine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "First, I loveee Indian food and have tried out a few places in the area- Ordered tikka masala and garlic naan bread with samosa for appetizer. It was SO GOOD \u0026 service was very friendly and fast too! Thank you! \n\nNot sure why past reviews are poor, give it a go! Will definitely come back", "author": "Maranda T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Love this place! Consistently solid food! They have even let me borrow turmeric :). Love the paneer app too!", "author": "Sarbani D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "I've been waiting a long time for a good Indian place to open up near me in Boerum Hill. This one's just a 5-minute walk AND it's on Seamless so of course, I placed an order for pickup.\n\nThey have lunch specials from noon to 4, which is a very generous window. They have lunch specials for multiple people or lunch boxes for one person (though the portions are large). I ordered the lamb curry lunch box, which came with a side of chana shaag (spinach/chickpeas), basmati rice, a gigantic naan bread, and a ton of sauces (including mango chutney, red onions, and a green hot sauce.\n\nThe curry had a nice spice to it, and a lot of meat stuffed into a tiny container. The naan was incredibly fluffy. The chana shaag was creamy, with a great textural mix with the chickpeas. Only complaint was that they left the star anise in, which is a terrible surprise to bite into.\n\nDid I already mention that it was a LOT of food? Definitely more of a dinner box. Or lunch box fit for two. All for about $12 (including tax)!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-29", "description": "- Adequate, although not the best massaman curry (My go to Indian dish)\n- But, the lunch specials are good and very filling \n- Samosas are HUGE", "author": "renje g."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-19", "description": "Warning to stay away! Management or staff must have changed. So disappointing because we used to be regulars here since it opened but changes must have happened because our recent order tasted old and inedible. \n--The chicken tikka masala was way overcooked and unsafe. It was dry cardboard-like chicken pieces, and some tasted rancid and old so we had to throw it away. We tried to contact the takeout app to tell the restaurant but our request/comment was declined. \n--The saag paneer was very underseasoned, the yellow lentil dal barely had any lentils in it. \nI won't be ordering from them again unfortunately. It seems I'm not the only one given the reviews in the last few months.", "author": "M. W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "We got together with my coworkers the food was good and the service was even better. Will definitely be returning.", "author": "Paula J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-07", "description": "Ordered carry out. \n\nThat do not know what Biryani is, it was awful \nNothing like real biryani it smelt like old Chinese rice.\n\nThe Karachi masala is disgusting..... \n\nMango lassi was decent \n\nGarlic naan was decent too minus the burnt edges.\n\nDelivery driver was nice and courteous and was earlier then promised. \n\nI will never order from here again.\nI hope management gets it together", "author": "Omar S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-02", "description": "As a first timer to Indian curry, I was super excited! After placing my order, I waiting roughly 45 min, I that time, I kept thinking omg I actually going to try Indian curry.. finally my order came, sat down there where like 6 different things. After my first bit of the lamb curry, i was umm, after a few more bites, it wasn't what I expected, it wasn't tasty as all! Maybe it's just what I ordered?  But I have to say I won't be trying Indian curry in a hurry. Oh one last thing, there was some type of dessert. That was delicious.", "author": "Karen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Very sweet people who work here and pretty solid Indian food. A nice gentleman at the front, Raijian (sp?) took my pick up order and when I was confused about which dessert to order, he kindly recommended one to me and even let me sample the other I was considering (Kheer). Good experience, will definitely return for dine in service knowing it's BYOB and good lunch/dinner specials.", "author": "Jackie A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-15", "description": "Quality of service and food has taken a huge step downward in recent months, unfortunately.  \n\nDelivery took 90 minutes to reach me, and when it finally arrived, the order was incorrect (this despite my having ordered online).  Food quality has really deteriorated -- ordered chicken tikka masala that was bathed in oil.  And, more distressingly, I found a hair in my eggplant appetizer.  \n\nWhen I called the restaurant and asked to speak to the manager, he was stand-offish and belligerent on the phone.  And then he hung up on me because he was too busy with other orders.   \n\nLesson learned.  Never ordering from here again.", "author": "Vik M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Great neighborhood Indian food. If you want very good Indian food in the Downtown Brooklyn, Brooklyn Heights, the Cobble Hill Hill Area, and anywhere else in Brooklyn, look no further . I strongly recommend the Biriyani and the Nan bread. Best of all if you are a local, you don't have to put the effort of traveling for very good Indian food.", "author": "Edmond R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-12", "description": "I came here tonight for date night. My boyfriend and I love Indian food - we eat it at least once a week. \n\nTo start, the service here is a complete mess. People were just waiting around for their checks, us included. \n\nThe food:\n\nI had the shaih korma (chicken) - the sauce and chicken were good. However, it had this underlying smoke taste? Something I've never tasted before. Wasn't crazy about it.\n\nThe naan (garlic) was ok. It tasted like it was sitting out for an hour. Not a fan. \n\nEggplant appetizer - sweet and sour. Decent. The sauce is similar to A1 sauce. \n\nI won't be back, but this place isn't \"bad\". It just wasn't great.", "author": "Katharine S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "Pretty terrible lamb tikka masala. The most prominent flavor is vinegar. Very watery. It was definitely a mistake to try this place. Service also very slow.", "author": "alyssia m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Another one of my favorite spots to go to before a Brooklyn nets game, it's a fairly small restaurant but I've never had a problem grabbing a seat but maybe that's because I've always been here before 7pm on a weeknight, then start you off with some crispy things called baper with a few dipping sauces, I've also had the naan which is soft like bread and tasty, for an entree I had chicken mahkni, it is served with rice, some kind of beans and sauce and veggies on the side, the chicken itself is very tender and is in a creamy tomato based sauce, it was great, I've definitely gone here multiple times", "author": "Jerry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "This is a really great casual spot for Indian food.  The food is great!  I've been here a few times, and everything I've ordered has been delicious.  The place is clean and nicely decorated.  Great vibe inside for a small restaurant with a cozy feel.  From my moderate knowledge of Indian cuisine, the menu seems to contain the standard fare, and everything seems to be prepared well.  Straightforward service by friendly, humble staff. Recommended for lunch or dinner.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "This is my go to for delivery. Always tasty and reliable. The Chana Saag is my favorite. Always get the condiments!", "author": "Unkl- T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-06", "description": "1 star for the comical conversation I will do my best to repeat, verbatim. \nMe - \"you're Yelp ad says call in a takeout order and receive 10% off\"\nMasala grill - \"no, no, no. Order online and get 10% off.\"\nMe - \"ok. I'll do that\"\nMS - \"no, sorry. 5% online\"\nMe - \"are you aware that you're Yelp ad that I'm staring at, on the computer says, call in an order and receive 10% off?\"\nMS - \" ok. Hang on. I'll give you 5% off.  Hang on.... \"\nPuts me on hold...\nMS - \"Are you paying cash?\"", "author": "Andrei S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "The Raman place next door closes from 4 to 5, that's the first reason they lost my business. Then I ate here and I'm quite happy about that closure. They have perfectly cooked Naan and the rice is delicious too. Lentils dishes are the right size so you're satisfied but not quite entirely full (especially nice two days after Thanksgiving) so it doesn't feel like you overate. Keep an eye out for the interior details, there is a lot going on but it's so harmonious you need a moment to dissect it all.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "Excellent for take out and lovely for dine in as well, Masala Grill is now our go-to for our Indian. Only thing I'd say is that Masala Grill is inconsistent with its level/amount of heat/spiciness. We enjoy a little heat, but sometimes it's too much, imo. We almost always order an Aloo Matar Gobi dish and it's heat/spiciness is different every time, so there's that. But still a solid place to order from and highly recommended, give it a shot if you haven't already.", "author": "J. L."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Masala Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "501B Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/s9gbwqe7daRWG-aswJhdJQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188759200"}