{"aggregateRating": {"reviewCount": 181, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "Food was amazing. Workers were very kind. Very fresh and love the spices. Price is definitely worth it. Not expensive at all.", "author": "Mossa A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-24", "description": "I have ordered through grubhub around three or four times from Masala, and each time I do, I ask myself why? The service just keeps getting worse and now the food itself has gone down with it.\n\nLast nights order was supposed to take an hour... so much for \"ASAP Delivery\". An hour later I got notification that my order was out for delivery, however waited another 40 minutes for it to get there.\n\nThat would have been okay,  if the food was hot... warm would have been good too, but it was not.\n\nCold food in greasy paper bags. And my favorite dish, grilled vegetables (parni tikka)... no vegtables!\n\nTry if you must, the food is good... don't order through grubhub... takes forever, and don't go to close to closing... that's a different story for another day!\n\nAs for me, my last time ordering from Masala Grill.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "I really love this place and their food. Their chicken tikka masala is delicious. I even went to the store for pickup once. One thing that's not really too bad but noticeable - they do tend to give less rice than they're supposed to (half the container is filled) so I've learned to just order and extra rice when I order from here. Other than that their service is extremely excellent and I plan on coming back again!", "author": "Jabari A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-11", "description": "I ended up here because the seafood restaurant was closed. It's a clean nicely decorated restaurant. We were seated immediately and got water and the crisps. But this place took 27 minutes to serve us our entree and we were going to walk out until the food came in a Knick of time. I had lamb Bhoti with basmati rice and garlic naan. The lamb was tasty but could have used some salt, there was none in the table. There was no gravy with this meat so I had dry rice or had to mix the meat and ask for tamarind sauce. The bill was $35 and change. Was it worth it? Not really, and I wouldn't go back though.", "author": "Rhonda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "Beware: the vindaloo is insanely spicy!!!!\n\nOrdered from seamless, arrived several vegetarian dishes and a couple of the daily specials (which included plain naan, white rice, entree, soup or appetizer, along with several sauces. Food came in piping hot, despite the frigid winter temperatures outside. \n\nQuite a bit of meat in both the tiki masala and vindaloo, they gave us a container of rice per entree and the naan was warm, toasty, and soft.", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-14", "description": "This place continues to have delivery boys  ride their motorized delievery bike on the sidewalk at high speeds..\nThis is very dangerous at night..especially when they are very hard to see them under the scaffolding of the Y.\nThis is only an accident waiting to happen..\nAlso their attitude toward women is rampantly\nMisogynistic...", "author": "Sonja G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "This place is amazing! The best Indian in the neighborhood. Always fresh and extremely consistent...I order from here at least once a week. Masala Grill never disappoints.", "author": "Craig K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-15", "description": "Pretty good Indian food! We enjoyed the tandoori chicken tikka as well as the chicken Tikka masala curry. We also split samosas but found it to be ehh...the green sauce is good tho. Service was okay. It could have been better. We asked for no rice and if they can substitute it with at least plain naan but the guy said no...also did not like that I had to wait and keep asking for the water to be filled..why couldn't they just leave the pitcher of water on the table? I don't know if we'll be back again but if we are in the area again and craving some Indian food then yes we will deff come!", "author": "Miriam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Can't comment on the dining in experience, but for delivery this place gets five stars for me.\n\nAfter moving to the neighborhood, this has been my go-to delivery spot. Food always arrives piping hot and prompt. Naan is always fluffy and fresh. Really haven't had anything I haven't liked - chicken tikka masala and lamb vindaloo are really good. The dinner combo or lunch special are excellent values for the amount of food you get. I really like their mulligatawny soup too - very filling, hearty, and good for cold days. \n\nAn added bonus for ordering delivery here is that every single delivery person who drops by seems extra friendly. I mean, I never expect it - but it actually is quite nice and makes me want to stay loyal to them haha. Anyhow, if you need a good affordable go-to Indian spot in the neighborhood Masala Grill is definitely not a bad choice. One of these days I'll make it over there and dine-in (apparently BYOB!).", "author": "Gene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "Love it here. My husband and I order delivery every few weeks. We always get the chicken tikka Masala (x2) and the saag paneer with a side of naan. They give a little cup of rice pudding with your order.", "author": "Susie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "- Went here on a Saturday night and surprisingly was empty. The food here must be cooked to order because it took about 25 minutes to get our food, hence the reason why they ask if we wanted an appetizer. I ordered the tandoori chicken with Roti and garlic naan. Good food, affordable prices and okay service.", "author": "Caitlyn J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-09", "description": "I'm sorry to leave a bad review but enough is enough. The food is absolutely delicious but the service is getting pretty bad lately. \n\nThey give me the wrong food, which is not a big deal but it shows their lack of attention.  The thing is, we were only 3 tables and they still wouldn't pay attention. \n\nEach dish is served with rice, but they didn't want to give each person their bowl. They said we have to finish one bowl first. Okay, at least it'll be warm. I try to get the waiter's attention to get the next bowl of rice, and he keeps ignoring me because he keeps staring at his phone. \n\nNo refill on drinks, he never comes to the table to check on us, I keep calling him and he doesn't even notice me.  \n\nIt's not the first or second time though. They're constantly on their phones and don't pay attention.  I understand if they're bored and they're entertaining themselves, but come on. You charge your own tip, at least don't make me hate leave you a tip. \n\nYou guys used to be so friendly and attentive. I'm not asking you to be next to me, but please pay attention.", "author": "Ben M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-02", "description": "Good food but very very slow. I tried to eat a nice lunch on my lunch hour,but the food took over 30 minutes to come to my table. I had to ask the waiter to pack it up for me to take back to work. I was very disappointed that I had to wait so long. I went back to work hungry.", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "Stumble upon this place while out and about. Really nice atmosphere. The food was reallyyyy good, we got the lunch special. It came with an entree, soup, rice, and bread. The bread is amazingggg! Would come here again.", "author": "Alison V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Authentic Indian restaurant. So delicious food.Great customer service. Garlic naan is so flavorful . Nice inside decor. I will come back again .", "author": "Nawaz I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-14", "description": "This was one of the worst/humiliating racist experiences I've had at a restaurant. My friend suggested the place who is of Indian decent. Out of mutual excitement to try the food I agreed. We were seated pretty quickly since the place was basically empty. We observed the waiter quickly refilled her water glass and neglected mines. Not wanting to jump to conclusions I didn't think anything of it since my glass wasn't as empty until it happened again; at this point my glass was nearly empty. Finally on the waiters third pass he filled both our glasses and of course mines was noticeably not as full as my friend's. Due to there being minimal table space while trying to shift around the dishes my fork fell on the ground, one of the waiters then attempted to place the fork back on the table. Then to make matters works while the first waiter cleaned the rice off the ground he was cursing while sweeping. When my friend requested to go plates he returned with one bag and sat it in front of her. She then gave me the bag and requested another. The waiter began to pack her food. Last, if you noticed I had to keep calling him \"the waiter\". He never introduced himself and didn't give us a customer copy of the receipt.", "author": "JR C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "I am reading all the reviews and I am thinking to myself now, am I really that lucky, or what? Been there 3 times already, and every time left with a big smile on my face (and full stomach where my six-pack should be lol)\nI mean, seriously - really good!\nFood was awesome every time. Crabmeat curry, shrimp vindaloo, seafood biryani... fingers to be licked! Inexpensive, always friendly and attentive wait staff... really don't know, why some folks are complaining.\nTry guys, try!", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "Incredibly satisfying! I got butter chicken (rice is included) and veggie Samosas. I was dining alone, and at the end I had enough leftover for a whole meal later! I'm brining it home and I can't wait to tuck into it later!", "author": "Amanda F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "The food was excellent!! Really fresh, super flavorful, nicely presented and good portions.  We were a group of 6 and despite the very small space, we were easily accommodated, but we arrived for lunch shortly after opening, so I'd suggest calling ahead if your group is larger than 4.\nWe had multiple dishes but the standouts were the Lamb Bhoti omg it was....i can't even find words....it was just crazy good!! So well seasoned and grilled kabob style, this is a must have. The Shrimp Basmati rice was excellent; the fresh sliced cucumbers placed on the side are the perfect cool crisp compliment to this flavorful and hearty rice dish. Extra credit for those wonderfully herbaceous crackers they give you to snack on while you wait for your meal. Theyre complementary and come with several different sauces, of which the tamarind was my favorite! I could never stop eating those crackers and dip; they were such a delicious surprise!! \nThey get a minus for the iced tea; I was expecting something that represented the food, something full of spices/flavor, but it was just plain old powdered iced tea. And the Mango Lassi was more like a piña colada, so beware it will not quench your thirst and will make you full.\nBut this place is about the food! And there's this chicken dish that's served on a sizzling cast iron plate that I MUST have next time!!!", "author": "Tiffany I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "This is very good Indian food.  The portions are actually big enough that if you order the Daily Special, it feeds two.  (Or it's enough for two meals if you live alone.)  I am not a frequent customer, but they still remember me and what I like.  The naan is really good, and I do recommend the Chicken Tikka Masala.   And I enjoy the bollywood music videos that they often have running on the screen by the front counter.   Note: this review is for eat-in or pick-up; I don't have the experience to review delivery.", "author": "Danny S."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Masala Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "501B Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/s9gbwqe7daRWG-aswJhdJQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188759200"}