{"aggregateRating": {"reviewCount": 181, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-03", "description": "When I asked to pay by credit card they became extremely rude(Server / Man at the counter ). The food is sub par compared to the prices they charge. There is better indian food at the food carts in downtown manhattan.(By wall and water street) If I was not with the girlfriend which was extremely hungry I would of cancelled my order. I had the lamb biryani which tasted a day old, there was no spice and could of made a better attempt at it myself..", "author": "K D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "Delivery-only review, but this place is my favorite for when I'm craving Indian (and a lot of it) within 30 minutes. Their daily special is $13.95 for an entree, an appetizer, rice, naan, and all the chutneys you need. It's enough for 2 meals (for me), so a pretty good value even after tax and tip.\n\nI've tried their chicken tikka masala with samosas and the malai kofra with seekh kebob. All 4 dishes were great hot off the grill (out of the fryer?) and even maintained their composure after reheating the next day. Impressive.\n\nIt all comes with hot, fluffy naan and full complement of chutney (mint is not listed on Seamless, so I make sure to ask for it, but presume it come standard). It also comes with an orange kind of kheer (I think? Someone tell me what this is).", "author": "Hilary P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-18", "description": "SCAM! DO NOT ORDER FROM HERE!\n\nSo, I was just trying to place an order over the phone with a gentleman who claimed that he was the \"boss.\" As per the menu, we wanted to order the Daily Special of $13.95 and the Boti Kebab for $6.95. This is also reflected on their website: masalagrillbk.com. However, when we tried to place this order over the phone instead, we were told that the Daily Special was $15.95 and the Boti Kebab was over $10!!!!! When we questioned why the total was $26 plus... his response was that the prices of \"things\" are going up. What???? So that means you can increase your prices on the spot? This is unacceptable and I will be issuing a formal complaint to consumer's affair and BBB in addition to sharing my experience on social media. Thank you but NO THANK YOU. We do not need deceiving businesses around here.", "author": "Christina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Such yummy Indian food. Two personal faves of mine are chicken kurma and sag paneer. A really tasty interesting appetizer is the kachori. I've never seen it before and it's got good flavors and ingredients. Slightly expensive for me but then again I'm just cheap about food. Still doesn't stop me from eating here when I need Indian! Not the fastest of service for take out.", "author": "betty s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-04", "description": "Boo. Hiss.\n\nI really like the food here. I mean, really really. Have ordered delivery three times and have not had a bad dish yet. Lamb, chicken, veggies, samosas, oh, and that naan. Delish. Even the rice is fluffy and wonderful. And normally I wouldn't even notice the rice. It's just a vehicle for all the other delicious. But the rice here is so great it deserves its very own shout out. This is great Indian food.\n\nHowever, tonight we ordered delivery that took an hour and a half to arrive. Called twice. No explanation. No apology. No straight answers. After an hour was told delivery person had already left with our food and was minutes away. After another 20 minutes was told they would try to call the delivery person to see what's wrong. Amazingly when the food did arrive 10 minutes later (and again, an hour and a half after the order was placed) it was piping hot. On the one hand--awesome, I'm starving. On the other hand--tell me again how your delivery person has been traveling around with this food for 30 minutes yet it's somehow still steaming?\n\nAnd so I say to you, Masala Grill, boo, hiss. Honesty goes a long way towards pleasing your customers. The poor customer service I had tonight kills me because you've ruined a really great thing you had going on here. And as excellent as I think your food is, I will not be ordering again after the experience I had tonight.", "author": "Megan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-09", "description": "FINALLY!!! \n\nGreat indian fare has landed in downtown Brooklyn!! \n\nMasala Grill is serving up your favorites at a fairly reasonable cost. Since it's opened, I have ordered take out several times and have hit up many items on their menu from lamb rogan josh to chicken vindaloos, veggie dishes like channa masala (chick peas) and dahl (lentils) starters like poppadoms and samosas to rice dishes like the briyani and naans. all of it - so good! \n\nPortions are generous - between two of us we usually order two meat dishes, a vegetarian dish, garlic naan and some poppadoms - all for $40. we had leftovers of everything which made a great lunch for the next day. \n\nI only wish that you could get items like channa masala and dahl as a side dish or as a starter. Other indian restaurants offer this up for half the price - which sadly is not the case at Masala Grill so you have to pay full price of $10 instead of $5 for a half order. that said, I am just happy to not have to drive to Prospect Heights for take out Indian anymore. Welcome to the hood Masala Grill (and THANK YOU for delivering to Carroll Gardens!)", "author": "Maia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "This is my favorite Indian place in Brooklyn. I come here at least twice a month. The food is very high quality. I usually get the chicken vindaloo which has a nice kick. Poppadom and onions to start which come free and then peazi or samosas for an appetizer. The bill is usually never over $40 with 2 appetizers 2 entrees and 2 breads and there's a liquor store next door to grab a cheap bottle of wine and bring. They also give rice pudding for dessert for free.", "author": "Mike N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "Tired of all the super crappy Indian food in the Brooklyn Heights and surround section, I convinced my sister and BIL to try someplace new. On a fluke, I happened to see the owner handing out menus during Atlantic Antic and he mentioned they're opening that week. I bookmarked that in my head and was glad to finally use the old memory.\n\nWe walk in and were greeted warmly. We sat. The restaurant was about three quarters full so that was a good sign. Ended up ordering three dishes and sharing (don't remember what). Staff was on top of things and they even tried to give us extra rice pudding dessert (free with meal) but we were so full. We all agreed that this was by far the best Indian place in the neighborhood (and probably Brooklyn).\n\nWell, I'm sad to say that they've now gone several times without me. Bastards! But who can blame them? So I returned with my Indian food-hating husband while they were out of town. Why he decided to give in that day, I do not know, but boy am I glad!\n\nWe ordered the lamb jhalfrazi and the veggie curry dishes, along with samosas and garlic nan. The lamb, like last time, was super tender and delicious. I think I would have preferred the chicken jalfrezi because of how they go together. The veggie curry dish was excellent, as was the nan. I really liked the samosas as well, due to it's extra potato factor.\n\nI neglected to mention that my husband is allergic to dairy - one of the reasons he and Indian food don't get along. But the guy serving us was really helpful and honest about which dishes had ghee/dairy and which they could sub out. No bad reactions. Plus, my husband liked the food enough to go back, which is pretty much as good as it gets when it comes to Indian food and him.\n\nAs I mentioned in the prior paragraph - staff. Always on top of everything and refilling our water but without being annoying. Also, each portion is really good for two meals. \n\nThe food is good. The service is good. The atmosphere is good. Finally a place to give five stars and break my pattern of crappy one/two star places.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "Naan bread, kachori, shrimp pakora ... ;). By far better than Shahi Moghul; cost effective and high quality.", "author": "Zooey V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "The food is delicious and the prices are VERY affordable.  This is a great place to go for a date, Meeting, takeout, and/or delivery.", "author": "Malynda R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-24", "description": "Maybe the chef does not know any better, but big chunks of flavorless chicken in the sauce of choice do not make for a curry. It seems as if the meat is cooked separately, it was very dry. It is a shame, the staff is nice and the atmosphere ok. But the nan was rubbery and the chutney oddly fresh.\nThe best was the tandoori chicken, but it was not special. I was hoping for a decent Indian place around Atlantic Ave., I will keep looking.", "author": "Lars H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "I love the Masala Grill! Since their opening, I have ordered delivery \u0026 take out on multiple occasions and it's always quick, fresh and flavorful!! \n\nMy favorite and go-to order: \n- Chicken Samosa: delicious little fried, flaky pockets of chicken. \n- Chicken Tikka Masala: Flavorful, creamy and one of my favorites in the neighborhood! It's also a large portion and I'm never able to finish the entire thing in one sitting and will either split it with my husband or save the leftovers for my next meal. For only $11.95, that's a great deal!\n\nBig fan!", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "The food is excellent!  But the service is horrible! Delivery guy is great, he delivered what was given to him, but inside the bag - total mess... all greasy, allover the bag. The containers are very soft, so by the time it gets here, to me, to a customer, it is everywhere, but not in the container.  I called the restaurant, wanted to speak to a manager and may be give an advise, to use stronger containers, but a rude person answered the phone, said that the manager is not there and he is not sure when he'll be in... So, hopefully, the manager will see this review and make some changes, because it would be a shame. The food is absolutely delicious and it would be a shame if bad service would drive customers away from this place. Regardless of  how tasty the food is we, as customers, expect service, and when that's missing, unfortunately, I would not go back. I have tried ordering from this place twice, both times the same problem.", "author": "Ilona S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-08", "description": "The first time I ordered here the order took forever to receive and then it was missing items. Tonight I ordered again. Somehow when ordering through their website my order got messed up and they refused to fix it or reimburse me. I was told to call the manager tomorrow. I received 7 orders of Nan and nothing else. So hungry and out $24 bucks for bread! We will see what happens when I call the manager tomorrow. Will update.", "author": "Gretchen C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-14", "description": "I ordered a EXTRA spicy chicken tikka masala and what I got was dessert like. Can't blame the owners, I am sure most people like their curry mild or even sweet in this case. The naan was great, rice was great, kachori was excellent but there was no fork/spoon provided. Luckily I was staying at the Sheraton and called the front desk. Hate to give two stars, but there shouldn't be an option to customize the spice level if it's not offered.", "author": "Abdul R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "I don't hand out 5 star often!\nIncredibly flavorful curries Awesome tandoori chicken, perfectly cooked meats from chicken to fish and lamb.\nservices is excellent and prices are reasonable \nEspecially considering the level of quality.\nI hope they do really well and stay around while.\nMust Try!!!", "author": "Ibrahim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "I liked it.  The chicken vindaloo almost killed my mouth, but my mouth wants to be murdered again.  The garlic nanny was amazing.  Did I tell you they don't charge you for extra rice?  I mean, who does that?  Mother Theresa?  The only complain is my mango lassi was served with whip cream on top and a lot of it.  This is the first time I complain about whip cream!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-17", "description": "They gave us the wrong order than proceed to tell us they make it differently! Are you kidding me! It's because they are from Bangladesh, not Indian. Be professional about it \u0026 admit you made a mistake \u0026 gave the wrong order. Piece of advice..don't tell an Indian person they are wrong about their own food, when you aren't Indian yourself! Sadly enough, ppl in the area don't know any better!", "author": "BrooklynNYfoodie Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "Yelp We need a 6th star just for masala grill.\nOk so the food is delicious, everybody says it but the service is also excellent. Ive been eating at the restaurant and ordering for delivery so many times and both the food and the service were always outstanding!!!", "author": "Nunita B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-08", "description": "Bad food\nBad music\nBad service\nBad desert\n\nIt's nowhere close to Indian food and is very blend. Do not go", "author": "Nilesh S."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Masala Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "501B Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/s9gbwqe7daRWG-aswJhdJQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188759200"}