{"aggregateRating": {"reviewCount": 181, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Wonderful food. Wonderful staff. My wife \u0026 me love this place. Tried a lot of India restaurant in Brooklyn, but this is our favorite. Also I love Indian songs they display on tv. Really best \u0026 enjoyable restaurant in Brooklyn.", "author": "Pritom B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "The food was good, but the service was so incredibly bad that I will probably not visit this place again. Lazy server who didn't give a rat. Their staff was too busy watching TV, and talking (loudly) to notice the only customer they had... at lunch time. I would think that for a place that doesn't do so much business they would fight for every customer.", "author": "S I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-02", "description": "Stopped in for dinner in night. Nice atmosphere. Service was fair. \nI had the chicken tikka and garlic naan. Food was fresh, but the flavor was not outstanding (but not bad either) they also don't serve beer :( \nSo I wouldn't say not to go here, but I also wouldn't tell people to make a special trip to this place", "author": "Rick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "My husband and I have been coming here for about a year now. We very much enjoy the food, the flavors, the great music videos they show, and of course--the staff. Parvez is always so good to us. They are BYOB and there's a wine shop conveniently next door if you need. Such a pleasant departure from such restaurant repetition in the surrounding neighborhoods. I couldn't love this place more!!!", "author": "Daniela L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-22", "description": "The stars are not an indictment on the food. This is, by far and away, the best Indian in this area of Brooklyn--Heights, Carroll Gardens, Park Slope, Gowanus, Cobble Hill.\n\nThe problem, as other reviewers have noted, is the delivery service. It is HORRENDOUS. I don't know what the hell is happening, but it's plummeted downhill. Tonight, they forgot one of my items. They said they would resend it. It never came. When I called to ask where it was, they told me I \"refused the order.\" I have no idea how that's possible, considering I've been packing for a trip all night.\n\nThese guys are dishonest and simply don't understand what customer service is. I'm done with Masala Grill, permanently. No apologies, no attempts to fix things. Instead, they pretend they sent the item out.\n\nI can't come here anymore, and it's a damn shame.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-10", "description": "This was my first experience having Indian cuisine and was delightfully pleased. The samosas were delicious, with an interesting seasoning coating the doughy shell. I also got the chicken chicken tandoori which was very flavorful and filling. My only 2 complaints would be the naan. I ordered cheese naan expecting it to be similar in content to a cheese quesadilla but was a bit underwhelmed. I wasn't even sure if there was ANY cheese in the naan. Also, the rice was very plain. Yes, it was just plain white rice, but even when you get white rice from a Chinese restaurant there is something somewhat appetizing about it. I didn't feel that way about the rice here though. Overall this was a good meal, nothing that I would go out of my way for, but a solid choice if you're in the mood for Indian food.", "author": "Al C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "Super tasty! Enjoyed all the dips with the free pappadam and the samosas we ordered. Food came our relatively quick- we ordered the chicken tikka masala- sauce was thinner than I've had but still good-and the chana saag which could have been more spicy I think. The garlic naan and cheese poori were very fresh and very delicious. They gave us free rice pudding which was a nice sweet treat!", "author": "Candice S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "We have never eaten in the actual restaurant as we have only done delivery. \nGood lord. \nI routinely stuff myself when we order food from these folks. That is my review. Everything I've ever had from there seems to turn off some sort of part of my brain that says, \"you've had too much\".\nCan not control myself.\n\nIs this authentic? I don't know. I've yet to travel through India. Is it the best in NYC? Who knows. If you live in the area and need a solid place to get your Indian cuisine on is this a good option? Yes. Yes.\n\nI like lamb. I adore the vindaloo and the Masala Korahi. My favorite thing so far is the Ka-Chori. This is an appetizer that is described as \"too difficult to put into words but highly recommended\". Order that. It's awesome.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Great Indian food at a human price, Nothing crazily overpriced.\nBeware, no utensils given with delivery orders, at least from what I've experienced 100% of the time after a couple of deliveries.", "author": "Jhon D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-29", "description": "AMATEURS. I was the first caller of the day and they left out all the sides and a couple of items.  Not a good sign. These guys ALWAYS forget the little things that make Indian food worth ordering.  The sides, the rice, the nan or soup, and usually something you actually ordered.  Also the guy on the phone comes off as someone who would spit in your food.  And after I saw foamy bubbles coming out of my watery Raita, (remember he was mad AT ME for asking them to re-deliver my actual order) I just threw all the food away assuming he had.  What a waste, not worth the triple phone calls for crap.", "author": "Nellie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-29", "description": "Ok first impression: no people but pretty tables. Wanted to sit on the table for four but then the waiter who wear glasses and have a bowl hair cut and mustache. \n\nMe: \"I would like to sit at the four person table if we could since there's no one here\"\nWaiter: \"no sorry you can't. Just sit in the for two.\"\nMe: \"why?\"\nWaiter: \"it's too expensive to sit in a table for four\"\nMe: \"what the hell do you mean by that\"\n\nAnd then I told him it's ok I can just yelp my experience then he said no no go ahead and sit on the four table and he threw the napkin on my plate because it was on the glass on my plate.\n\nWill update soon.", "author": "Diana P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-22", "description": "Came across restaurant by accident. Like Indian food so thought give it a try. The atmosphere cute and cosy The curry chicken was good but could use a little more seasoning . The mango lassi was delicious.  The starter was tasty. Overall a good Indian place to eat.", "author": "Margaret L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "Delivery review here. I've ordered food from here a few times on Seamless. The lamb saagwala and chicken tikka masala are delicious. Entrees provide two servings - so I can split with my boyfriend or have two meals to myself. I find the garlic naan here is disappointing, but to be honest, I haven't found a takeout place that delivers naan that I like. Delivery is always made within the provided time window or before. Pricing is reasonable. Food is always delivered hot. I'm a fan.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "The best food and variety.  I have traveled from the Upper West Side of Manhattan to downtown Brooklyn to eat here. Service is excellent. Expect the amazing taste and freshly cooked food!! Highly recommend.", "author": "Nikki M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-23", "description": "Ordered for the first time tonight, as the reviews seemed good and cost was reasonable. Delivery was 30 minutes late and quite cold by the time it got here. Appetizer was wrong- instead of veg pakora it was a variety of fried things, mostly eggplant. Curries were greasy, and pretty bland. Disappointed by this place, will stick with what I know next time.", "author": "Ian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "Friendly service. The food was delicious. The price was right: $35 for app, two entrees, and naan (and they threw in free dessert).", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "This place serves the best Indian food I've experienced in Brooklyn (by far), and I've lived here for 10 years. My fiancé and I shared the fresh shrimp appetizer, which came with crispy poori bread, and then we had the chicken saagwala and chicken vindaloo entrees. Everything was so flavorful and perfectly seasoned. They also give you complimentary papadum with your order and delicious rice pudding to end your meal, which is a nice touch.\n\nThe staff members were very attentive and friendly as well. Great experience overall.", "author": "Jane L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-21", "description": "Almost everything we ordered was oddly sweet - the aloo gobi, chicken tikka biryani, curry, even the bread tasted like they had been doused with a heaping spoonful of sugar. I'm not sugar phobic but I like Indian food for what it's supposed to be - spicy, rich, salty and massively heartburn inducing. All I got here was sweetness and slight heartburn. \n\nOn the plus side, the waiters were quite friendly and attentive and they gave us a coconut rice pudding dessert on the house that was very tasty. Someone hide the sugar in the kitchen and I may be back.", "author": "Kelly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Ordered from Grubhub yesterday. The food was  absolutely delicious. Prices are reasonable. Highly recommended about this restaurant. Delivery was on time", "author": "Ih R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Excellent food and wonderful service! Would recommend. Service is great as well, the wait staff is friendly and genuinely cares about your experience.", "author": "Dee H."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Masala Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "501B Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/s9gbwqe7daRWG-aswJhdJQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188759200"}