{"aggregateRating": {"reviewCount": 181, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "I noticed this place on a jaunt down Atlantic Ave.  and it looked interesting - something different from the generic mediocre Indian restaurants throughout Brooklyn.    I couldn't stop then, but I ordered take-out when I got home....it was very delicious - definitely the best Indian I've had in Brooklyn.  The food tasted fresh and the flavors were great...also the price was good.  I'm looking forward to visiting the restaurant and eating in.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Our go-to spot for Indian delivery. I will admit that we get food from here fairly often and it is ALWAYS delicious. The quality is great and consistent. Every order comes with a magical mini cup of Khir (rice pudding dessert) that makes me bizarrely happy after a satisfying meal of Matar Panir and Chicken Tikka Masala (our usual order). YUM!", "author": "Caitlin Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "Tried this twice and very pleased - great food (we had the chicken tikka masala and lamb korma as entrees) and service. The daily special is great value, too. Their Papadams come with a good assortment of sauces. \n\nNot sure how long they have been around but they have confused or missed an item for both of our orders. But when we called, the restaurant was very apologetic and had the missing item / replacement delivered within 10 minutes. Very happy to recommend!", "author": "George W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "This place is very disappointing. The first time I ordered from here, I ordered a dish with brown rice because ITS ON THEIR MENU. First, the order was 40 min late. Then, the order arrived with white rice. I called the restaurant and explained I had paid extra for brown rice and he responded with \"we're out of brown rice.\" If you're out of something and someone places a takeout order with that item, you should have the decency to call and let them know you're out of it. Instead, they sent me the incorrect rice without any notice... 40 minutes late! They offered to refund me the extra money I paid for the brown rice and that was pretty much all they agreed to do. It gets worse... the second time I ordered, they did the same exact thing with their rice! This time, when I explained this was the second time I'd been given an incorrect order, the guy said he'd refund the extra money for the brown rice but that was it. I asked to speak to a manager and he basically told me no. Just FYI, I'm Indian and order Indian food allll the time. I completely understand mistakes happen. What is disappointing is that this place doesn't seem to recognize that or care that they've messed things up. They're disorganized and rude. Most restaurant owners will at least reimburse part of your order or give you a voucher or something. Especially if this has happened twice. Never ordering from here again!", "author": "Ankita D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "The food here has so many amazing favors and is very authentic.  The waiter was very attentive and the restaurant is so very nice and organized", "author": "Peanuttie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-20", "description": "I randomly entered to this place even though it looks abundant. I was the only customer in the restaurant and I was debating what dish of chicken should I order. The waiter kindly recommended curry dish with chicken and vegetable. I also ordered a nan bread. The nan was delicious and fresh and the side dips were rich. The dish came shortly on top of a sizzling hot pan, that keeps it hot. I was really hungry before I came in but at the middle of the meal I was so full - so I asked to take the rest home. The waiter surprised me with a yummy rich pudding on the house. Finally I got a 25% off course I came between 1-4pm, which apparently is when a lunch deal is happening. In summary, though it felt a little gloomy, I loved the place and next time I'll come with my wife or a friend.", "author": "Arnon L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-21", "description": "Waited over an hour for delivery.  Called after 1 hour told food will be here momentarily.  1 hour 6 minutes.  No utensils brought with delivery.  Ordered brown rice none delivered...", "author": "Barry H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "Delivery review: Came incredibly fast despite being a busy night and the food was still hot!", "author": "Megan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "I have ordered food for pick up from this restaurant several times. It is my go-to when I don't feel like cooking, especially in the summer. The service is fast and the quality is great. Very clean food. The sauces are made with yoghurt or coconut milk; no fillers such as flour or potato starch. I especially like the vindaloo and the chicken somosas. For the spicy dishes, you don't get to choose the level of spiciness: it is what you get, which is very hot. Hot is clear your sinuses kind of hot. The chicken somosas were very pleasant clean meat (no cartilage, no chewy weirdness).", "author": "Dullua C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "I love this place. The prices are very reasonable for your neighborhood Indian joint, but the atmosphere is a little more updated/modern and the food is a LOT better. Me and my girlfriend come here all the time, we usually order the Gobi Bhaji cauliflower dish - delicious! Seriously, everything we've ordered here has been top-notch. Great friendly service too. In a neighborhood where everything tends to skew toward trendy/yuppie, this place is a great casual find.", "author": "Alex P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-19", "description": "Ambiance is nice , my shrimp was over cooked food is tasty , but a bit salty . I may give a second chance but at this point would not recommend  ...waiter was good with refilling water", "author": "G C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "Best Indian in Park Slope hands down. I'm an Indian food junkie and have tried many different local restaurants, they're all either over priced or inconsistent. Masala Grill is always good, always fresh and always quick. So good.", "author": "J M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-03", "description": "I was excited when this place opened around the block, especially as it got good reviews early on. Unfortunately, the customer service is really bad. The food is decent (though nothing special) so I put up with the bad service for the past year (as it was mostly issues like part of an order being wrong or a requested sauce not included or unfriendly delivery men) but most recently I placed an order through their website (as I've always done so that they don't pay commission) and when the food hadn't arrived after an hour, I called to follow up. The unfriendly staff member who picked up (and seemed not to care at all) put me on hold for 5 minutes (I could hear him taking other orders in the meanwhile) and when he eventually came back to the phone, just said that they only just got the order then, that sometimes their website doesn't work. I told them I was a regular and pretty disappointed with this response (and service in general) and would like to just cancel the order/get refunded. At no point was the staff member the half bit apologetic. (He even had the nerve to call back a few minutes later to suggest giving me store credit instead of a refund!) Had this been the first time, I might have considered returning. But as I mentioned, the service has been bad for over a year- clearly they're not attempting to improve. I'd rather support a neighborhood restaurant that actually has some regard for their customers.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-26", "description": "My boyfriend and I were having drinks across the street at Hank's and were looking for some good Indian food in Brooklyn, as it was our first time in New York. Little did we know we would come across the best Indian food we've ever had. I had the Shrimp Tandoori Masala and my boyfriend had Chicken Tikka Masala. Both were outstanding as well as the sweet naan and accompanying sauces. Prices extremely reasonable as well. Highly recommend!", "author": "Melanie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-14", "description": "ordered for the first time, will be the last time too.. the samosas had stale potatoes, i called them to complain, and the idiot who answered the phone tells me that \"all is good\".. the potatoes were cooked yesterday and he just didn't wanna hear anything", "author": "Ruma F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-09", "description": "Mix seafood curry (salmon and shrimp) was good. It had 2 pcs of salmon 2 inches by 1 inches and 3 pcs of shrimp. Place was clean with good ambiance. Ras malai and gulab jamon was the worst I've ever had. It tasted  processed and not authentic. Overall, place was okay. Will not go back there again though.", "author": "Maria V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "THE best tiki masala chicken I have had! Very tender and the sauce is amazing. Also the chicken samosas are very tasty!", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "So happy about another good Indian place in the hood! Went to check this out with my hubby last week and Masala Grill did not disappoint. The joint is fairly small tho so it can get crowded, but we came just in time to snag the last good two person table (meanwhile props to Masala Grill for seating two people who came in after us on a nice 4 person table far from the door rather than sticking them at a two person table by the drafty door like most restos in the hood would do). The vibe is rustic Bollywood...no really there were actual Bollywood videos playing on TV...and they were awesome! The place itself is very nice looking not like a lot of Indian places that look like a school lunchroom, here you had the exposed brick, the mood lighting, the works. On to the food, we had our usual Indian fare and tried some new stuff and for the most part everything was very tasty! For the apps we did the Cauliflower Manchurian, which was great, and sweet and sour eggplant which was the only dish we didnt like as you couldnt taste any eggplant because it was just so deep fried. For the mains we had the tandoori shrimp - tasty, came with some sauteed spinach which was quite good, also the Bharta (the eggplant puree with peas and onions) -delicious, and the goat in some kind of sauce - goat was good but it was mostly bones and very little meat...the garlic naan was \"garlicky and naany\" (cred to Peter D. for the catch phrase). Overall the meal was quite good, the service prompt and friendly and the best part was the bill...all that food and only about $56 before tip! Oh did i mention this place is a byob?...so bring your own wine/beer and enjoy! We'll definitely be back!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "Great service. Decor is pleasant and thoughtful.  Satisfying portions. I ordered the sagg aloo and chicken samosas. Both were tasty and delicious. 25% Discount at lunch made the pricing very reasonable.", "author": "Alison J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "We ordered from Masala Grill for the first time last night and we'll definitely be doing it much more. The food was SO TASTY!! We had a large order too and they packaged our To Go order quickly and efficiently (no mess in the bags). And I can't believe how quickly it got here. One of our guests actually made a mistake ordering their food (we used Seamless) and Masala was quick to rectify it, in a friendly manner to boot. Love this place.", "author": "JaimeLee R."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Masala Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "501B Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/s9gbwqe7daRWG-aswJhdJQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188759200"}