{"aggregateRating": {"reviewCount": 181, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "A lot of food for the value, and very friendly staff. It was a great grab/go to take back to my hotel.", "author": "Phil R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "OMG! So good. I want to say it's likely the best Indian food I have had outside of India. The Ka-Chori was exactly how I remember the Mum in the homestay in Varanasi made it for me. I also ordered my favourite Saag Panir, buttery flaky Paratha and Sweet Lassi.  As always I can't stop eating even though my brain tells me to. And I still have my Gulab Jamun and Pistachio ice cream left to eat as well. Definitely hit the spot and in my sickly state made me feel much better!", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "I've only gotten take out from here but the food is great!  The curries aren't too oily; they are full of fresh flavor. Better Indian food than most other places in this area.  The service can be a little slow, but they aren't that close to me.", "author": "Tariq C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "Like others, I am excited about this addition to the neighborhood. And as it has been pointed out in other reviews, Masala Grill is BYOB and there is a liquor store next door. \n\nWe came here for dinner during one of the first few nights this place opened and had a great meal. The food was delicious (lamb, chicken and naan), the servers were very attentive and the atmosphere inside the restaurant is enjoyable. The prices are also not bad. \n\nI would recommend this restaurant to anyone looking for Indian food.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-15", "description": "I have given this place more than one try, and they cannot deliver my order on time. If you want to wait 90 minutes for cold, soggy, greasy food and then get hung up on when you call about your order, this is the place for you.", "author": "Lauren G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "A hardcore Indian place, not only the food is awesome but even the ambience is perfect. We ordered tandoori chicken which was perfectly cooked and even the mango lassi was delicious. Nans were crispy and yumm too!", "author": "Nateli S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-15", "description": "We ordered dinner from Masala Grill online and received an email confirmation of the order. An hour later, we had still not received the food so we called to check in. At that time, we were assured that the delivery man was on the way. Almost half an hour later, still no food. When we called again, we were told that they never received our order. When confronted with an email confirmation, they stated that they would start making our food asap with no explanation as to why they had missed our order in the first place. Needless to say we cancelled our order and will not be ordering from here again.", "author": "Kay O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-04", "description": "Bad service - placed order online and restaurant didn't have courtesy to call to tell me they can't deliver. I waited an hour and then when I called, they said it'd be another 2 hours at least.", "author": "Fareed K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "My go-to for Indian takeout. It's reliably tasty and fast! I think I've tried nearly all of the curries and eat one is flavorful with a rich texture. My husband loves the biryanis, too! Highly recommend.", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "We order from here at least once a week and sometimes two.  My husband is Indian, but I am also picky when it comes to Indian food.  We both love this place like its our job.  Never had a bad dish and at this point between us we are close to having tried at least half of them.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-10", "description": "The 2:30pm dine-in lunch experience was not ideal. There is basically no service. I had to go to the back and get someone to notice that I had been waiting at the counter for 3min. They put food on your table and leave. If you need anything during the meal, you have to either go to the back and get their attention, or forget it. So it was absolutely fascinating when I received my bill and saw that it had a 18% service fee already included. The flavor of the chicken tikka masala I received was below average. Will not go again.", "author": "S R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-24", "description": "Never order from here. Food took 3 hours to arrive and manager was unapologetic and didn't offer any discount. Order takers are very slow and can't process orders quickly.", "author": "casey s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "It was a nice restaurant small and candle lite    right near the Barclay center the food was very good it was so much to choose from they have a lot of different curry dishes and different types of breads they didn't sell alcohol with would have been a plus but they did gave you a good amount of food. I would recommend this restaurant as a good date night spot for couples", "author": "Leslie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-21", "description": "I loved the food and service, everything was sooooo good, Can't wait to go back, I'm hungry.", "author": "Ayanna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "Masala Grill has a really great Mango Lassi (mango yogurt drinks) and vegetable samosas (spiced vegetables stuffed in fried dough). The staff are very nice and friendly as well. Great convenient spot, located along Atlantic Avenue for grabbing a bite to go.", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-23", "description": "Placed a simple delivery order from masala grill.  They were running 30 minutes late.  I called to follow up and they were extremely rude and unapologetic.  There are better Indian establishments in the neighborhood. I would suggest going elsewhere.", "author": "Christopher W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "If this place ever closes I will be devastated. It took forever for us to find a local Indian place we like! The tandoori mixed grill was some of the best we've ever had in NYC. so juicy and flavorful! I also loved the onion naan and the helpful and attentive staff. Also- the place is very very clean, which is important to me.", "author": "Lila S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "Love the food here however on our most recent order the delivery guy asked for a bigger tip. I've always considered ourselves generous tippers , often tipping well above the recommended amount. it was embarrassing and left a bad taste, so we've stopped ordering from them which is a shame. otherwise delicious food.", "author": "Sally J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-30", "description": "3 and a half, really. 4 for food and 3 for service. My friend thought we might need a reservation on a Saturday night and called. Here is the conversation as related to me..\n\nFriend: Hi. I'd like to make a reservation for 2 people tomorrow night.\nMan on phone : Ok, thank you. \nFriend: Wait! Don't you need my name?\nMan on phone: No, that's ok. We'll hold a table for you.\n\nWhaaaat? How can you hold a table for someone if you don't have their name? Anyway, my friend and I arrived here for dinner a bit after 9:00 last night and the restaurant was empty. It was also freezing cold. Now, I like it cold, but this was like a freezer. It did gradually warm up...a few more people came in, perhaps one of them complained. Anyway, the enormous menu made it difficult to choose dishes, but we finally decided on Gobi Manchurian, The undescribable appetizer, chicken samosa, chicken Kahani (or something like that..the waiter recommended it), Saag paneer and garlic naan. Everything was very tasty...especially the samosa and the Gobi. The chicken in the main course was a bit overcooked, but tasty. The saag paneer was one of the better ones I've had, but not the best. But, overall, a very tasty and filling meal. The real issue I have with this place is the service. The couple of waiters who dealt with us were pleasant enough but did not speak English very well. One thought I had asked for tea when I hadn't (and it's not my enunciation...I'm a trained opera singer and speak very clearly). We didn't finish all of our food because we wanted to share a dessert, so we asked one of the waiters to pack up what was left to go....3 times, because he didn't seem to understand what we wanted. He brought the check with the food, never having asked us if we wanted anything else. We then said that we wanted to share a pistachio kulfi. He and the other waiter looked very confused as to what to do, since the check had already been brought. They kept reaching for the check and then not taking it. They brought the kulfi, which was delicious and then one of them finally said that they wouldn't charge us for it, which was very nice of them. The prices were very reasonable and the food is good. And I don't want to sound like one of those nasty Americans who complain that everyone should speak perfect English. I'm a lover of multi-culturalism. But it would be helpful for all of us and the restaurant, and they would avoid all the mis-communication, if the servers here spoke English a little better. Perhaps this is the issue with the very low ratings for delivery.", "author": "Lawrence R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "Nice intimate restaurant. Ordered shrimp curry with garlic Naan on the side. Very delicious. Waiter was very attentive and great service. I would recommend.", "author": "Elaine A."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Masala Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "501B Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/s9gbwqe7daRWG-aswJhdJQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188759200"}