{"aggregateRating": {"reviewCount": 181, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "I'd give give this  place more than 5 stars if I could!! This place is fantastic!! Not only is it a great value (practically a steal for NYC) but the food is probably the best Indian I've had.  They give you complimentary popadams, rice is included with your entree, and we got complimentary dessert as well.  Their sauces are seasoned very well with great flavor and are delicious. We had samosas, veggie pakoras, chicken jalfrezzi, and Dahl makhni, in addition to the aforementioned complimentary items for less than $35. I'm used to this meal being less tasty and at least twice as much anywhere else. If you like Indian food, you definitely need to check this place out!", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-08", "description": "Damn it. I didn't want to believe Megan D's review because I love the food as well, but I'm having the exact same experience as she had. \"30 minute delivery time\" has now turned into an hour and a half, with repeated calls from me only to hear \"it's on it's way.\" It's a VERY frustrating, very helpless feeling when you know you're being lied to. I'd rather hear them apologize and say it's a busy night, than continue lying to me about being on their way. I really hope management sees both mine and Megan D's review.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-01", "description": "This is the worst Indian food I have ever tasted. Everything was undercooked and the desert, I could smell milk, you know, the kind of smell that you get when it is spoiled. If I had the power to erase my memory or do time travel, I would definitely do something to delete this experience out of my life.", "author": "Arvind N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "loved!!! the food, service, ambiance.\n\nthere is no alcohol, but right next door there is a wonderful wine store you... BYOB. perfect. everything was wonderful.", "author": "Robin N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "That empty tandoori skillet? About 5 minutes ago I almost consumed the entire plating apparatus. The mixed grill was THAT good. Some of the best tandoori mixed grill I've had in NYC. Two thumbs way up people. Go! Thank you, Masala Grill!", "author": "Scott R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "One of the best Indian restaurants in the five boroughs!\n\nLoved the food - authentic, extremely -  great staff. Everything is fresh, perfectly spiced and really tastes like your'e in India! (I've been there twice, so, I approve) \nNamaste!", "author": "Carmen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-27", "description": "The food here is great. No problem with it at all! I ordered a chicken biryani extra spicy, and they did exactly what I told them . The food was fresh and hot and the rice was to die for. However, they have a very difficult time talking on the phone. To pickup something, the person who picked up the phone spoke extremely softly and I had to repeat myself at least five times for them to understand everything. Don't get me wrong, the Indian food here is definitely better than anywhere else that I have had in Brooklyn so far. But the fact that I had to repeat myself and had to have them repeat what they said on the phone is beyond annoying. If they just fix that, they'll be golden.", "author": "Tim F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Ok so it's a Sunday at 11:30 am hungover as hell in walking I see Indian food / best decision I have made all weekend / I sit down the dudes are all really nice I order  Chicken Makhani / and garlic Naan it was amazing :) I took half the meal to go/ it was sooo good / every time I come to Brooklyn I'm going to make a stop at this place/ you guys should come check it out it's so freaking good/ and everybody that works there is so nice/ thank you for taking care of my hangover I even got to bring in my own beer/ which is funny because they have a sign outside that says bring in your own beer/ lol", "author": "Nel E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "Great food, I have been trying chicken tikka masala all over NYC and this is now one of my favorites. The service was also great. I will be returning", "author": "Joey R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "The best indian I've had in brooklyn so far. Everything on point. From Tikka masala to the naan. Definitely making it my other home ...", "author": "Sousan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-19", "description": "This review is for the service, not the food. If you want to be nickeled and dimed, go here. \n\nIt upsets me to have to give this place one star. I was excited to try it because I live just a few blocks away and because of the positive reviews. I walked by and noticed a 25% off lunch sign in the window, so I decided to stop in.\n\nThe food was good. The problems started when I got my bill. I noticed the 25% wasn't taken off. I almost said something, but I decided not to quibble. I figured 25% off my one entree wasn't a huge amount, and I like supporting neighborhood business. Plus, I felt the food was worth the money. I didn't leave quite as much tip as I would've had I gotten the 25% off, but I asked for the remainder of my food to be packed up, and I walked out satisfied.\n\nWhen I got home and opened my to go bag, I noticed the rest of the soup that came with my entree wasn't in the bag. Now I had to say something. I called the restaurant and asked about the soup. I was told it was in the garbage. I asked why. He said it was too little to be packed up. At that point I also brought up the 25% off. I was told I didn't get the discount because I took food out of the restaurant--the discount was for dine-in only. But I had dined in, I told him. He said no, I took food out. \n\nLesson learned: if I'd left my leftovers to be thrown in the garbage, I would've gotten the 25% off. My thing is, if you're going to have these kinds of policies, at least let the customer know. The waiter could've told me when I'd asked to take the rest of my food to go that I was forfeiting the discount, and that the soup would be thrown away.\n\nI'd already planned to introduce friends and family to this place, but now I highly doubt I'll ever be back. So disappointing.", "author": "Kara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "Yes! So happy about this great new addition to the neighborhood! The Indian options nearby have been pretty blah for a while, but this place really brings it. The delivery comes quickly and is super fresh tasting (plus the delivery dudes are always so nice). The daily special ($14 for an appetizer + entree + rice + naan + sauce) is an awesome cheaper option. I've tried the Chicken Tikka Masala, the Chicken Bhuna, and the Matar Panir. All are great. Basically, I'm stoked about this place.", "author": "Eliza S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-04", "description": "The food is wonderful and prices great. We had chicken tikka masala and saag paneer and shared an order of naan. The only reason for the missing star is the service in the restaurant was not great.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-22", "description": "Since I work in the area, this is my go to spot for Indian food. The service is on point and it has awesome food. I've tried pretty much every lunch special and they all come at a great value. For 11.95 you can have a delightful meal and if you eat like me, you will surely have leftovers for dinner or tomorrow's lunch.", "author": "Danny S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-22", "description": "I got really excited when I saw the reviews for this place - who wants to go all the way to Queens for a decent curry? It got off to a bad start. Seamless said they were out of our delivery zone. We don't live far away, so I thought it was worth checking on the phone. They speak very little English and the first guy got so fed up of me having to repeat my question that he just hung up on me. The next guy (yes, I was so desperate for Indian food that I phoned back) confirmed that they do deliver. An hour and a half later, the food arrived. It could have been nice, and I'll certainly give their restaurant a try, but it was freezing. At almost 22.30, after ordering at 20.00 (it takes a long time to reheat all the little sides in a tiny oven), we sat down to our take away. It was fine, but certainly not worth the hassle.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "Best Indian food in the neighborhood.  I always get the chana masala and Manchurian gobi - delicious!  Very generous servings as well.  Have also tried their chicken tikka masala, very good as well.  They give a small serving of the rice pudding with every order.  It is so good I actually ordered a full portion last time.  Much needed addition to the neighborhood.", "author": "HanNa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "Very impressed with this new place! Finally good Indian food in Brooklyn.Everything we had was fresh and delish.But the lamb vindaloo stole the show !perfectly done really hot and spicy the way it should be.Also the garlic naan was a winner.Our server was so nice and attentive.we did bring our own wine which we purchased next door( but my advice is bring a good bottle from somewhere else as next door is very limited and not great , but it did the job) .we look forward to our next visit .We left feeling full ,happy and satisfied!", "author": "Mary D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "This place just opened on my block and I tried takeout from them for the first time.  I got mixed seafood biryani and bhindi (okra) masala.  Both were really good and that says a lot because I'm Indian and have a high bar.  The place looked standard for an Indian restaurant on the inside and the staff seemed very friendly and excited about their new business - it was a pleasure to give them some!  There isn't any Indian food in the hood, this is a welcome addition.  It's BYOB which is so great because there's a wine store right next door", "author": "Mary V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-24", "description": "I am writing this from a table inside the restaurant. The food is absolutely delicious. I ordered the lamb saagwala and mixed seafood curry with poori. The flavors are well balanced, the staff is friendly and most importantly, their food is delicious!! Will definitely come back. Try to rice pudding too. Yum.", "author": "Rachaela X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "I am generally very picky when it comes to Indian food.  Masala Grill does it right!  So delicious-authentic and fresh. Excited to have such a great new restaurant walking distance from my apartment.", "author": "Marjorie W."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Masala Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "501B Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/s9gbwqe7daRWG-aswJhdJQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188759200"}