{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "Very cool place. Deserts, beer, wine and food for you and your dog as well. Kinda crazy huh?", "author": "Keyshaun S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "I always wanted to try a SS but the line was always too damn long!   But viola!  The one by the fulton street mall is never packed.     They always have diners but the line seems to move effortlessly.    The only madness is the parking but what more do you want when your are next to the Brooklyn Courts.\n\n   My family ordered the burger with fries and I had the double stack.    The burger is  the real s**t!!!    It 's a bit expensive at $4 \u0026 $8 but it's worth every penny.   The greatest burger I've ever devoured.   This burger makes Jackson's hole burgers into Jackson Who?  It's that good!   They must be using a different cut of beef or something but it has this magical taste that leaves you very satisfied.  Almost like after  you have fornicated in hot summer without A/C.    You are a bit tired but very satisfied.   Yes IT'S THAT GOOD.   \n\n    The only reason, I'm deducting a star is the damn fries.   How do you justify serving up such a gourmet beef heaven next to the poor excuse for a side dish.  Maybe, just maybe the burger was so fabulous that it kinda sucked all the expectations out of the crinkly potatoes but I 'm pretty sure these are the same fries that they serve up at white castles.   I'm not even joking.\n\n   The staff was amazing.   Either they are overpaid or they get paid with  their amazing  burgers because every problem or complaint that a customer had, they took care of without an issue and with the mellowest smile.     The happiest employees ever.", "author": "Hank K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-28", "description": "Hands down the best fast food burger I've ever had!  I like the Brooklyn location because the lineups aren't as crazy as the Manhattan restaurants.  The bun is so soft and delicate while the meat and the veggies are so fresh, I must say, it's a great looking sandwich.  The cheese fries are meh, just crinkle cut fries with fake cheese sauce.  The wooden fork it comes with is pretty cute though.", "author": "H Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Salty burgers. I like that they use Martin's rolls for their burgers. Chewy, soft, delicious. Their fries are okay. Shake Shack is all about their burgers, though. Their mushroom burger is fried and filled with cheese!", "author": "Michael K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "The food is delicious! I finally walked in after walking pass this place over a dozen times. Thank God I did! Move over 5 Guys here comes Shake Shack!", "author": "Lina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "I'm a native New Yorker. That means I have an unnatural aversion to standing on line. That also means that until recently I had only agreed to eat at a Shake Shack on a single occasion when I needed to continue a conversation with someone who was insisting on eating there and I reasoned that time spent standing on a street corner chatting was pretty similar to standing on a midtown Shake Shack line so I acquiesced. But of course I was still aware of the time that passed so it was hard for the food to live up to the amount of perceived effort used to obtain it. \n\nEnter the DT BK Shake Shack! For whatever reason this place is well-run and although they do have lines during the lunch hour they move quickly and never snake around the block (I swear they just do that in Manhattan as a marketing technique!)  The staff is pleasant and professional. The turn around time is quick. The burgers and fries are fresh \u0026 delicious - especially since I didn't have to give up 45 minutes of my lunch hour in order to get them. During other hours there isn't any line at all!!\n\nAlso note the impressive wine selection.\n\nYou still won't catch me in another Manhattan SS line, unless I am trying to close a deal or something with a patient SS addict. But this spot has made my semi-regular \"treat myself\" rotation.", "author": "Kim R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "Whoa! Great burger (Smokeshack = single bacon cheeseburger) with a soda, no waiting, very friendly and quick service and a very clean bathroom. It seems $9 was kind of steep but the burger was very tasty.", "author": "Sal L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-31", "description": "I stumbled across this location on Fulton after nearly starving to death since all the other fast food places were not at all appetizing. Nothing more disgusting than a filthy BK or Wendy's that reeks of oil and dirt when you step in trying to grab a bite in a hurry. I don't think the sanitation grading system uses enough letters to describe the low standard of some NYC eateries. \n\nSo it was a serendipitous moment when I passed by this cheerfully glistening location late yesterday evening. There was a stream of customers, but the line kept moving, so it wasn't crowded. The staff looked clean and presentable and the menu caught my eye. Unfortunately, I had no time to sample any shakes or frozen custard, but my husband and I each opted for a Smoke Shack burger (applewood smoked bacon, cheese, cherry peppers). At $6.25 each, I found them a bit pricy for the size (somewhat petite). The sign says all burgers are cooked medium, but mine was medium-well. It still tasted great. All the flavors went together well, the toppings were fresh, and it was not at all laden with grease. I didn't get that usual heavy, sick feeling after eating it (and I'll admit, probably a little too quickly). I would certainly visit again.", "author": "Dr Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Love this place.  Always order the chicken shack w/cheese and cheese fries.  A little pricey for $12 but I'm a fan.  I work near the one on Fulton St. and can't wait for you to be able to order online to avoid the always lengthy lines.", "author": "Tracey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Awesome Burger place and great location in downtown Brooklyn. Love the building, good staff and great great food. Just a little high in prices.", "author": "Jorge P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "1. shake shack \n2. 5 guys \n3. in n out \n4. smashburger\n\ngreat fast, cheap burgers with good fries and shakes!\n\nlove the shroom stack - fried/stuffed mushroom with cheese + burger. its crispy, cheesy juiciness!\n\ni would eat this burger every time i'm in new york if my girlfriend didn't want to try new restaurants all the time.", "author": "Jonathan Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Vanilla concrete and the cherry shake of the week were both excellent. I had never tried before as I live on the west coast but I would go again to try more.", "author": "Anna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-15", "description": "I LOOOVE this place! Why you ask... because I have never had a bad burger here! Their fries are great and the milkshakes are good too! It's the BEST fast burger joint around. \n\nI always get the Shack burger and fries. The bun is soft and the burger has just the right amount of greasy to it. The burger melts in my mouth and shoots stars to my stomach, leaving me wanting more and making me a repeat customer! The vanilla milkshake was good and thick! \n\nIf you like burgers or even if you don't- you MUST try a burger at Shake Shack. If you don't love it, there might be something wrong with you....just sayin.", "author": "Vanessa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "A love letter to Shake Shack:\n\nI always knew you were there, I've been watching you from afar for a while now. \nNot in a stalking kind of way...although it sure seems like it.\n\nYou looked so good from my car waiting for the light to change, but i never had the courage to look for a parking spot and approach you. \n\nAnd then....Jury Duty....\n\nOf all things to bring us together, two grueling weeks on Jay Street gave me the opportunity to introduce myself. You look a bit different and offer alot more than your sister over at Citi Field in Queens. I was in love when i first laid eyes on you.\n\nOn our first encounter i went with what i know: a single shack, cheese fries and a shake. Oozing with greasy goodness, your burger is like no other! Your cheesy fries with a little ketchup on top has never been matched and your strawberry shake makes me smile. \n\nOur second date was a little bit more relaxing, i had the chance to sit down because you were not as busy, and i wanted to be adventurous. I went with the 'shroom burger' and was pleasantly surprised. Just thinking of that fried and lightly breaded giant mushroom with shack sauce got me all hot and heavy, and little did i know that when i would take a bite out of you there would be a burst of cheese in the middle! How embarrassing! \n\nYou wanted to get me drunk with your wine, but I'm not that kind of guy! Maybe as our relationship grows I'll fall for that one! \n\nI'm so glad we've had the chance to get to know each other, and i hope we can make this a long-term relationship. I know you get around and have many other partners, but I'm willing to share!\n\nLove, \n\nLouis P.", "author": "Louis P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-14", "description": "Figures if you have been to 'in n out' no need to hit this chain unless you have a pooch to feed or want alcohol. Got a regular shackburger which was nothing special. As opposed to most burger chains you could order wine and there were snacks for your pooch. By the way if you like in n out fries these were similar in cooking style. Oh by the way in n out totally rocks over this place", "author": "Ben H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-15", "description": "Love this location! Food and service is just as good as the original Manhattan spot, but it is short walk to the Brooklyn Bridge and Park. It makes for a great touristy day out.\n\nThose burgers might be greatly hyped, but I can't deny they are delicious. And the ingredients are just so fresh for fast food.  \n\nSo glad that Shack has figured out how to cross the bridges.\nJust a great lunch.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "I came here to have lunch with my friends/co worker(s) today since we were gonna have a little adventure. the service was FAST compared to the one we go to normally down at Battery Park City. I waited maybe 5 minutes?? It was kinda busy too so  that was impressive. The portion here seems bigger too and it stuffed me up for a long time too. I would come back here if I'm around this neighborhood again. \n\nAlso, it's a pretty big location which is also another plus for me since I don't like to be squashed together when eating or so.", "author": "Sue W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "In hindsight I should have foregone the fries (too thin for my taste) and just had an extra patty since I just wanted meat and the single shackburger is a bit too thin to really satisfy a red meat craving.  But that being said, it was still a very tasty meal.  I also am obsessed with soft serve desserts and the frozen custard (with or without a mix-in) is the best.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-09", "description": "Mmmm.\n\nI usually go to the one in Madison Square Park, but today I took an adventure to this indoor Shake Shack in Brooklyn. There was no line! Impossible to see at the MSP one.\n\nI ordered a regular shackburger, paid $4.95 ($4.50 with tax) and was given a buzzer. After a few moments, the buzzer buzzed (how else can I say it?) and I got my burger.\nThe cheese perfectly melted on the patty, fresh lettuce and tomato between two glorious buns. Don't know why I didn't get fries this time ..... but I was still very satisfied!\n\n*Must try the Smokeshack burger next time!", "author": "Angela H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-02", "description": "I was here two days ago. The place was packed at 7pm. It was clean and noisy . My cheeseburger was designer and great but for 11dollars I was still hungry . They really should give you a soft drink and fries for 11 dollars.", "author": "Walker A."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}