{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Before I get into my review, I want to mention that I got to this place at 11:15AM because I know how crowded Shake Shack gets.  I wanted to go to the Shake Shack in Manhattan some time ago, but when I passed by the place at 4PM, it was PACKED with a waiting line all the way to the door.  So with that image in mind, I timed our travel so that we'd arrive at this location for brunch and leave before the lunch rush.  \n\nI don't know how normal it was for people to be this helpful, but I had no idea what to order, and this guy came over to assist me pick out a full meal for myself and 6 other people (visiting relatives from another country).  7 shack burgers, 3 orders of fries, some shakes for the kid's dessert, some drinks for the adults, and on-the-go chocolate came to about $105 (not bad At All considering that's only like $15 per person in a place like shake shack!!).  \n\nThe food was fresh, hot, and delicious.  And I love how they had hot sauce available at that little table of condiments.  I'd come back here again (this specific location because idk how other shake shack locations are like...)", "author": "Rebecca K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "Good burgers. Nice creamy milkshakes. I ordered the smoke shack and a strawberry milkshake.\n\nService was quick and fast.", "author": "Lola O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "Nom nom nom, awesome burger for fast-food. Not cheap for fast food but worth it. And even better than a lot of fancy burger joints. Better than In n' out's burgers in my opinion. Spent 4 years on the west coast and had all the in n out burger variations: animal style, protein lettuce wrap, etc. I just think shake shack's meat is more flavorful, albeit a bit more greasy - but that's standard NY. Californians love their health food. They use softer bread (prob fresher), more variety in shakes. I do like the simplicity of in n outs menu don't get me wrong.\n\nFries changed from crinkle cut to little thin guys, not sure which is better, but actually don't think either are all that great. 5 guys fries are on point. If shake shack got their fries together, would be 5 stars for sure.\n\nShake selection and concretes are delicious accompaniments to your burger, best to split a large i think. Concretes are made from custard as opposed to ice cream and milk. Tho the concrete menu is a bit limiting, you can make your own with whatever flavors they have, possibilities are endless!\n\nStaff is great: cashiers, quick meal prep and even came by to clean our trays and trash. Seating is comfortable booths and tables with nice window views outside.", "author": "Reo H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "When this place opened up all I kept hearing about was the dumb line and the infamous shack stack. The line is indeed always long and sometimes even wrapped around the tiny building. The burgers, well the shack stack at least is as famous as they say. There is a portabella mushroom engulfed in cheese, a medium done patty (that you can get done however you like) and your choice of lettuce, tomatoes, or onions. This burger is worth any amount of wait in any weather. \n\nThe staff is very helpful, friendly, and quick...you'll be out of there in under 10minutes (once you're inside the building of course). Haven't tried their wine or shakes yet but I keep hearing that they are rich and of the highest quality.\n\nCash \u0026 Credit", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-27", "description": "I have always walked past Shake Shack on my way home from work but never went in. I decided to give it a try because I was very hungry, the first thing I must say about Shake Shack Brooklyn, is that the decor is awesome it's a very stylish looking place. From, the t-shirts hanging on the wall to the nice green and black furniture the place is eye catching.\n\nI ordered the Shake Burger and the cashier gave me a buzzer which I though was pretty cool, when my buzzer went off my burger was presented in a tray with a wrapper around it, something I am not used to at all. I tried my burger and it was pretty good, the only thing Is that for the price the burger is pretty small.\n\nAlthough Shake Shack burger is good, it doesn't beat Smashburger Brooklyn, which is located on 80 Dekalb ave. At Smashburger you get to create your own burger as well as a chicken sandwich and you can have it crispy or grilled. Shake Shack does beat out 67 Burger and Five Guys without a doubt!!!!", "author": "Ayisha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-21", "description": "I've tried two other shake shack locations before, but this one is definitely my favorite. My burger was cooked to perfection. Not too well done but just enough to give it a bit of crunchy texture on the edge.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "Burgers were fresh and delicious, and the shakes were super tasty... the food is portioned just right so that you'r not over eating but you still feel full.", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-26", "description": "Decent burgers, fries and shakes which is always a good combination. A lot of people rave about this place. It was decent but definitely not my favorite.", "author": "Amara B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-31", "description": "I'm kinda disappointed about this place. I expected better. I had the Shackburger, it was good but nothing to rave about. \nQuestion? Is that real potatoes fries or frozen? Because it lacks flavor, can't beat five guys fries! :)\n\nMy favorite thing is the caramel milkshake,it's absolutely delicious :) \n\nNow for the Concrete, the urban lumberShack was horrible, it's supposed to be vanilla custard, fried Belgian waffle, bananas and bacon peanut brittle . I can't believe how bad it tasted, actually it didn't taste bad, it's just with so many things in it, it didn't have any flavor. And I was so excited to try it :( \n\nI'll be back for the milkshakes only.", "author": "French L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "I'm going with the Spinal tap 'shark sandwich' style review: sh*t shack.\n\nTheir fries are ok - sorry, that's the best you'll get from me on this tourist-packed poser hub. \n\nBurgers are, simply put, not good. Over-priced, cr*p wines in small glasses and a deep feeling of shame like when you buy a bed from some scummy mattress salesman and then later you try and see positive outcomes to your having been taken. Hey that first spring only broke through the mattress in the foot area so not bad really!\n\nThis place is a waste of space - would love to have seen the Brooklyn waterfront built up with small businesses that produce real quality.", "author": "Sean K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "Shake shack has solid burgers, I pretty much order the same thing every time I'm here. I order the crinkle cut fries, hamburger with lettuce, tomato, onion and pickle, but sometimes I'll switch it up and order a shack-cago dog. Tastes the same everytime; good especially when you're extra hungry. The only con is that it's usually busy and you have to wait for seating if you're dining in.", "author": "Connie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "Shack Shake Brook-Lyn!  Who knew?  Well, probably a lot of people, but I didn't.  We got off the train and there it was, right on the corner of Fulton.  Purrrrfect!  \n\nI'm currently a veggie for lent so I was crying inside that I couldn't have a burger.  I did get the fries and their ShackMeister ale.  Both did the trick but definitely are not the reason you come to this fine establishment.  The egg bun looked amazing, the patty large enough but not overwhelming and the condiments fresh.  Soon!  Soon I say!  I am coming for you burger, mark my words, in the next year you will be mine!", "author": "Kristin Marie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "Came here right after a night out with family in Manhattan\nheaded back to Park Slope for the evening. And talking\nabout Shake Shack burgers to my mom meant we HAD\nto stop by. And we made it just before closing.\n\nOne thing that's a drawback is the fact that you have \nto hunt for table space, You hope they'll expand the \nindoor space a bit more. But everything else makes up\nfor it. The burgers. The ease in waiting for an order with\nthe buzzers. The burgers. The fact that there's a flatscreen\nTV playing a video of where all the ingredients are sourced\nfrom. The burgers. The fact that they sell WINE by the \nbottle now. The - you get my drift, the burgers are tasty.\nI always go for the single cheeseburger, but once in a\nwhile i'll go nuts with a double. You know it's choice when\nthey start to divert folks from the Burger King right behind\nit.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-13", "description": "I agree with John B. \n\nNot my thing. I shouldn't have bothered. It's not a burger, it's something else. A burgerchip.\n\nAlso, correct me if I'm wrong, but calling this Brooklyn Heights is a stretch.", "author": "Lee J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-10", "description": "Is it possible to walk by Shake Shack, not see a line, and keep walking?  The answer is no 8 out of 10 times.\n\nWalked in with dessert in mind and was not disappointed.  The urban lumberjack concrete is perfectly delicious.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-20", "description": "20 minute wait in the cold to order, 15 minutes to get your food. It's worth the wait for Brooklyn's first Shake Shack and what can I say. They did a damned good job!\n\nI took my co-worker to lose his Shake Shack virginity hahaha. I ordered two Shack Stacks and I devoured it faster than it took me to order =D\n\nThe decor is well done. I would say the bathroom is a pain to get to considering you have to squeeze your way through the line. There's like two dining areas, one wide open area, and one tucked away in the corner, both of which are spacious but like every other Shake Shack it's a fight to find a place to sit.\n\nThis like any other Shake Shack brings the same food and amazing taste like all the other Manhattan counterparts, if not better. Only difference?!? IT'S FINALLY IN BROOKLYN! And literally next door to my office building. =P", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-25", "description": "Had lunch there today.\n\nWait was two star. Order was perfect. \n\nHamburger was four star and tasty. Fries were an A-OK three star.\n\nChocolate shake was four star but quite expensive, at $5.00. \n\nShake Shack got through a long line at Noon quickly. They are organized.;\n\n----------------------------------------------------------------------------------------------------------------------------\n\nSecond visit with my wife. We had burgers, fries and chocolate shakes. Burgers were good but pricey and not as good as the burgers at Five Guys. Fries were average and way below the superior fries at Five Guys or at Nathans.  The shake was good but not that much shake for $5.00. Should have been larger. A\n\nA good place to eat but not worth the premium price that was paid. Five Guys gives more food and quality for the money.", "author": "Steven G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-05", "description": "I love this Shake Shack.\n\nWhile I am always discouraged to go to any of the locations in Manhattan as they almost always have a ridiculous line full of tourists, this particular Shake Shack in downtown Brooklyn practically begs for you to enter its doors with its lack of humans inside. \n\nI'll admit I do love Shake Shack burgers now... and of course their shakes. I'm always down for juicy patties with fresh buns and thick shakes. I still hate their fries though. If I wanted Ore-Ida style fries I would just buy the whole bag for the same price they charge at the grocery store and cook them myself. \n\nOh and they offer beer. Hey-ohhhhhhhh!\n\nI will reiterate that this location is never EVER as crowded as its Manhattan counterparts... so yeah, whenever I'm craving Shack Shake I wind up going to this one. The fact that there is no line to deter me is good for instant gratification and bad for when I can't fit into my jeans later that night.", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-08", "description": "To everyone saying it's the In-N-Out of the East Coast: it's not, but it comes the closest in burger quality.\n\nTo everyone saying the wait is too long: they're right, the wait here really is insanely long (around lunchtime).\n\nTo everyone saying its worth the wait: they're right, it is.\n\nThis Shake Shack has all the hallmarks of their other locations: great food, great service, limited seating, and long lines. I'm still coming back.", "author": "Alexander T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-15", "description": "Hmm.. how do I feel about shake shack?\n\nBurgers are good. The meat is seasoned well and really tasty. The bread is nice and soft and really different then other burger joints. Kinda small for the price though..\n\nthe fries? SKIP! even the ones with chedder.. kind of gross if you ask me.\n\nI also ordered the black and white shake and it was okay. Nothing special. I dont think i even finished it and thew it out.\n\nTip: I would get the double patty next time and MAKE SURE YOU ASK FOR TOPPINGS IF YOU WANT THEM. the burgers come plain! I would ask for onions, tomato, lettuce, etc.\n\nI visited this place a few hours after I got in to NYC so I was telling everyone I was from Cali. When the manger heard he had someone come over and give us samples of the custards on the house. Hands down the best one was the original topped with blueberry pie or something. Nice of him!", "author": "Jenny F."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}