{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "This is definitely the best Shake Shack I've had out of the several I've tried. They cook their burgers more medium rare than most - so try it if you're into that. Otherwise, the sides, etc, are standard. \n\nIt does get fairly crowded for lunch, but service is still fast anyway. However, it will be extremely tough to find seating.", "author": "Jeffrey Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "Food \n1.) Shack Stack = the mushroom in combo w the regular cheeseburger omg yummm... the battered portobello mushroom has like gooey delicious oozing cheese from it the light crunch of the batter is just such a good mix w everything, sauce adds that slight extra flavor. Man I wanted to order a second one it was so good \n\n\nSERVICE \nOrder n pickup at counter when the buzzer goes off . The workers are nice and they actually help buss your table and wipe it down after a while. There is self serve water which I appreciate. Bathroom code on receipt ticket. \n\nATMOSPHERE \nIt's nice contemporary but pretty casual n alight fast food burger vibe. Love that it's next to the Dumbo atrium park w the view of the city and two bridges. Small tables and also the bigger high top communal tables.", "author": "Angela L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "Stopped here on our journey through Brooklyn. It honestly was the only reasonable priced place we found to eat in Brooklyn and it became a pleasant surprised. \n\nThe bacon cheeseburger I got may have bern the best I've had anywhere. Very juicy and full of flavor. Stumbled upon this pose by accident and because I was trying to eat cheap. Now if I ever go back to NYC I'll purposely find it and dine there again", "author": "Joseph G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "We brought group of 61 people and had ordered ahead. Miguel and others on staff were amazing! We were fed, treated like welcomed guests, and any small problems were quickly resolved. Can't recommend highly enough!!!!", "author": "Mary Kay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "Being a Cali boy and an avid foodie, I knew I absolutely had to try Shake Shack on my recent trip to NYC. Despite hearing about this Shake Shack vs In-N-Out rivalry for years now, I came into this meal unbiased, like a true foodie should. And let me tell you, Shake Shake makes a damn outstanding burger!\n\nFirst off, we came on a weekday around lunch time, and as expected there was a decent wait time, and it took a little while to get a table. Nonetheless, it was super worth it. This DUMBO location is the only Shake Shack I've been to, so I can't compare it to other ones, but this particular location is super nice inside, and even has a toasty fireplace (perfect for that particular rainy day). \n\nOn to the food! I ordered a Shack Burger, and man, it was amazing! The beef was so juicy and flavorful, the bun was perfect, and the cheese was suuuper good! Seriously, something about that cheese is amazing, lol. The fries were pretty good as well. Oh, and also, I had a beer with my meal, lol! Something I'm definitely not used to at fast food burger joints. \n\nSo to answer the age old question of Shake Shack vs In-N-Out, it's honestly hard to answer because the two places are at two different price points. Shack Shake is about double the cost of what I pay for at In-N-Out. If you're from the West Coast, I think Habit Burger would be a more appropriate comparison. So on that note, I call it a tie because they both make the best burgers out there as far as chains go!", "author": "Dennis R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-26", "description": "The hot dog was ok the cheese fries fine.\nBut the cookie and cream shake was really good", "author": "Jean-Charles N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "It's honestly a toss-up between Chick-Fil-A and Shake Shack for best fast food in Manhattan but this Shake Shack location gets a bonus star because of its stellar location beside the Brooklyn Bridge. \n\nEven though it can get quite crowded they do a great job with the electronic buzzers and they also have clean bathrooms. You can never go wrong with Shake Shack!", "author": "Tony R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "If it's your first time at shake shack you have to try it out! \n\nLove the location of this Shack Shack! Honestly there is no better spot for a business than DUMBO! I would say the biggest plus of this Shake Shack is that you can always take your food to go and sit in the designated benches near the water outside or just by the water! \n\nThe line was quick when I got there and there was plenty of seating -it was midweek a bit after lunch time. A lot of tourists anytime of the week/day!\n\nI love the burgers, especially the Shack burger. I always tend to get the double and I like to go with regular fries, though I have tried the cheesy ones with the bacon bits and it reallyyyy good. The vanilla shake was also delicious but I can never finish one since its so heavy. The burgers are not big thats why I tend to go with the double. The portion sized generally are not big and its overpriced but nonetheless its delicious!\n\nEven if it's not you first time you gotta get some Shake Shack", "author": "Ellie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "I've been here numerous times but this is my first time dining inside. I do love this location it give a restaurant feel. Service was pretty quick faster then I expected because it such a busy neighborhood with lots of tourist and so much in that area. I ordered the chicken shack and fries. I did notice that the line for the restroom was rather long It looks as if they have only one Bathroom stall. The seating area was clean and they also had wipes for you to clean your hands prior to eating. Very  thankful for that. Will be returning again. It seems as if every time I'm in the neighborhood this is actually what I do eat, but I've never took the time write a review until now.", "author": "Sha'velle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "Here we go again. This is my second review of Shake Shack. You know why? My first review I kind of went in blind. Stumbled across the Shake Shack crazy in JFK. After my review, their customer service team reaches out to me. Offered me a second chance on them. Emailed me consistently to see if I had made it back. Well I finally did. This time I took my time. Ordered a specialty burger  rather than being a rushed traveler I had time to enjoy the meal. I didn't know they served coffee and almost skipped it to collect a cup from Dunkin' next door. With the cashiers help I ordered the smokeshake, fries and a coffee. I enjoyed the hand crafted burger that was especially made for me. The cherry peppers and shake sauce provide a tasty combination without being spicy. The fries made for a great compliment to the burger and the coffee was indeed better than  I expected. My gifted coupon from corporate didn't work at the airport location. That okay. It was worth every penny. I frequent JFK the most when I travel home. I'll be back, Shake Shack! $15", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "First visit. The burgers are seasoned well and doesn't have that heavy taste like ground beef. The fries are delicious too. Their burger sort of remind me of Zin Burger fresh grass fed non GMO burgers. Will most definitely return. Oh and a great view of the Brooklyn Bridge. Nice location", "author": "Tuarise S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-15", "description": "One of the Brooklyn locations that is testing out the recently introduced grilled chicken sandwich, the chain location does not live up to the Manhattan locations. One of the reasons for a lower review is the bathrooms, which aren't as clean as the other locations. Shake Shack is known for its fresh take on burgers and fries, but this location, using the bathroom kind of turned me off. Their half lemonade and half ice tea 50/50 drink was also mediocre because it was served room temperature. When I asked for more ice to freshen it up, the ice watered down the whole drink so it was just a waste of money and calories.  I'm not sure if the batches they prepare are room temperature and left there, before serving with ice, but the balance of the acidity from the lemonade and sweetness from tea was so disconnected. In terms of their fries - crinkle cut and served hot so definitely a win. \n\nNow, going onto the sandwich itself. The bun was its traditional potato roll which wasn't very toasted, but still buttery and delicious. The herb-mayo was a nice and absolutely necessary addition to the dry, chicken breast. I usually get the crispy chicken sandwich but given that the grilled option was there I chose the grilled version. I was expecting the same type of juiciness of the crispy chicken from the grilled, but it was quite the contrary.  The bacon that was on the grilled chicken was crispy, but not very memorable or special. \n\nI'll still enjoy an occasional crispy chicken sandwich but if you want a grilled chicken sandwich, make it at home yourself so you save money and don't eat overcooked-tasting, dry chicken breast.", "author": "Hannah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "We decided to tryout and pros vs cons...\nHamburger are small like a lid of a medium size cup. Fries are ok little bit under average... watermelon Basil lemonade is boss. Regular lemonade is really good very refreshing. We also try A strawberry shake and was a Blas. Hamburger are really tasty we try ShackBurger, DBL ShackBurger and Shack Stack Burger. Me, my wife and kids loved. Highly recommend if is in your way.\nOnly thing they don't have hot sauce, but we came prepare...", "author": "Jaime P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "We timed it just right and got in no problem. \nOne of the workers noticed one in our group wasn't drinking her shake, so she changed it out, unsolicited, for one she liked much better.\n\nThat kind of awareness and caring is why Shake Shack was a must see on our trip to the city.\n\nLoved the food, the smoke stack and the caramel shake were highlights.", "author": "Dawn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "What an amazing experience today at this Shake Shack.  Teamwork is absolutely apparent, effective communication is everyone's focus and the food was fantastic.  I have never had such an all-around positive experience in all my years of food service hospitality- this place takes the cake.  Keep it up guys!  You are all giants among dwarfs.", "author": "Scott D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Love this location. Steps from the Brooklyn bridge, DUMBO area with great views of the waterfront. But let's be honest we're here for the food. Tried the mushroom burger and omg, I think I tasted heaven when I had the burger. Crispy outside juicy inside, a great vegan option, bun buttery and soft. The fries were amazing. Now I know why east coasters rave about this place. The hype is real and sf location is in the works. Can't wait!!", "author": "Linda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Very good place..They will be crowded but they get you in and out real fast. The people taking orders were very friendly answering any one questions without being aggravated. Very personal and professional. \nThe food just put the place over the top. Best burger I've treated myself to in years. And I us the double cheese and some cheese bacon fries. Melted perfectly. Couldn't ask for a better meal after walking the Brooklyn bridge. They have shakes but i did not try it but they looked good as I watched a few with them\nThe are limited on seating. But there a seating area outside if you can nab a  area for yourself or party. Nice area signed many people you can people watch while eating\n\nDefinitely would return", "author": "Mike J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "On the way back to the car we decided to try some food around the area. We stopped at Luke's Lobster but it wasn't ready to serve, too early. So we decided to come here to get something quick. I really liked the salted caramel shake from here. I liked it a lot because I don't drink shakes, so this one time taste in my mouth was a real deal! I'm giving 4 stars for the shake. The name says it all, salt plus caramel or in short, salt and sweet taste. I wasn't crazy about the grilled chicken sandwich. Perhaps the type of bread just didn't do it for me, so I removed the bread but wasn't too crazy about the chicken taste either. Hubby had a burger with a different flavored shake. He thought the burger was so so but the shake was delicious. It was vanilla chocolate chip flavor. I tried and thought was tasty too. This whole thing about \"I don't eat sweet\" thing didn't apply that day. I'd come back for the shake, in a few months or so. I don't drink shake, so I have to remember in order to return and try another flavor. If you're a shake lover, you must try it! Although I didn't enjoy the food as much, I enjoyed the service. They're nice and friendly and happy. The place is quite big and they placed some hand wipes for patrons to clean their hands just in case, not just tissue paper but hand wipes too! Woohoo!", "author": "Nora F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "New York staple, but overpriced as expected. \n\nVery good burgers - meat quality is great.  Burger is A1, decent sized not huge.  Shack sauce is bomb.  Expect to pay like $10-13 for a double burger.  Single burger is kind of pathetic.  $7 for a thin-ass burger yo like wtf is that.  You can get like 3 In and Out burgers for these prices but thats new york for you. \n\nFries are average.  Nothing special.  \n\nMilkshake here is bomb.  FUEGO.  Get the milkshake.  Just do it.  Like $5-7 for a milkshake here but walk across the street and the ice cream store is sellin theres for $10, so this is worth.  \n\nOverall good food, classic new york burger. 4/5", "author": "Tommy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "Tourist spot and fast fast-food service. I haven't been to a shake shack in a long time. Love that there are vegetarian options (I am not vegetarian). I ordered the smoke shack bun-less burger and that was delicious!!!!! Before I ordered I didn't ask what they were going to do about a bun-less burger I just went with the flow. They wrapped my burger with lettuce. I also ordered a glass of wine which was good. It's probably the only fast food burger I'll ever eat.", "author": "Francesca C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}