{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-08", "description": "The burgers are good here, they are freshly made \u0026 the fries are also pretty good. It's fast food but they serve beer and wine too. It's not such a large space so it's usually crowded and there aren't too many tables but we've never had an issue, one of us hovers over some group that looks about done while the other orders, usually works out fine.", "author": "A C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-21", "description": "Very overrated and very over priced. The first time I came here I ordered a regular burger well done and it was ok. The special sauce just tasted like a garlic mayo. The second time I came here, I didn't ask for it well done, so I'm assuming it was medium. The meat was a really weird texture. Almost mushy, and the fries were mediocre with garlic salt thrown on top of them. Personally, I think it's trying to be the east coast version of the west coast burger chain In-N-Out...and that it is not. The pictures seen on yelp are very deceiving as you will see when you get your burger and it looks more like a kids burger from McDonalds.", "author": "Frank N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-15", "description": "I wasn't overly impressed with what I had. I ordered the single Shakeburger with fries. I love the fact that they hand krinkle cut fries and those were good, but the burger was a bit lacking. Maybe I need to go back and try something else.  On the brighter side the decor and set-up of the location were great.", "author": "Tasha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-08", "description": "Dam Good Food. At the end of the day, it is still fast food, but its good fast food. The beauty of the downtown Brooklyn location is that you can eat in or eat in the park on a warm day. I need to go back more often.", "author": "Adina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "A once in a while indulgence...The food is good but keep in mind you are paying to eat at a \"shack\" at restaurant prices.  Definitely check out the menu and their prices before you decide to make the trip out to this location.   Otherwise, you might be disappointed at the value-to-tastiness ratio.  :)", "author": "Christine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-28", "description": "Shack Shake has not undersold themselves at all! Once again, had an amazing burger, and fries. I had been talking about this place to my fiancé for months. Finally had a chance to go last week, thankfully the shack shake still has it. Knowing the Brooklyn location was brand new, I was suspicious of the quality, and wondered if the burger would be the same as the original Shack Shake in Madison Square Park. I will say without a doubt, this location was exactly the same as the others. They have not failed me. If you like burgers, you will LOVE this place!", "author": "Pamela U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "\"Yes, my friend another order of cheese fries\" :-)\n\nThat was me this past Sunday and boy was the extra side of fries worth it!! See what transpired is, I went in around 2 P.M. (no crowds by the way) and decided on a double shackburger extra pickle, extra shack sauce and cheese fries. To go, naturally because I had an engagement to attend by 4.  The transaction went smooth with the buzzer thing.......yadda yadda.....I have my food and opening the door, onto fulton Street headed towards Court Street.  While waiting for the light to change I'm eating one fry, then two..........Man I finished those cheese fries before Court Street!!! I was pressed for time, crossed big ol Adams Street and got another of those Crinkly meaty fries with cheese of course, and headed back to the car and devoured the whole meal!!!!! The double shackburger was cooked to perfection!!!!! I loved the addition of the extra shack sauce which really complemented the burger. Sheer willpower and strength will have to keep me away from this establishment!!! I love the idea of going on a off peak to places like this because you never know when you might have to go back for that extra order of fries! :-) \n(By the way I made it to the  engagement on time...yay!)\n \n*If possible go on the weekends, to avoid those weekday crowds, well try to because when the urge hits you, you definitely have to go get one of those burgers and cheese fries*  \n\n*:*", "author": "Amy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-01", "description": "Burgers very good just need to be ordered well done . Otherwise undercooked . Fries were good", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "One of my top 5 burger places, the meat is so flavorful \u0026 cooked to perfection. The service was quick and very efficient. Plenty of seating areas. Good selection of drinks. I'll definitely be back, such a nice change from the long lines at the Madison Square Park location.", "author": "Sandrine E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "I do admit I'm a pain in the butt when it comes to eating out and I can be quite critical!  I don't mind spending money for food but I just want it to be good!!  Is that too much to ask for!?!  Well  I've always heard great things of this place so you know I had to test it.  Shake shack gets a thumbs up!!  Prices are affordable and the food and service were great!!!   Only negative is that it gets crowded so seats are limited but within a few minutes of standing around I got a seat!  Definately a  go to place for a great burger!!", "author": "Marty D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "Very good food. Was slightly busy when I arrived, but worth the wait.", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "This review is based on the manager for this location.  I ordered food to go one day, got home and realized there was a mistake with my order.  The receipt was correct, so I know I ordered it correctly- but somehow, someone made a mistake.  It happens! But, I live in Williamsburg so unfortunately couldn't just go back and have them correct it.  My frustration got the best of me and I decided to go on the website and give some feedback over the situation.  The next morning I already had an email from the manager with an apology and an offer to make it right.  Not only did they make it right, but I received a hand-written apology in the mail- who does that anymore!? I am really blown away by the customer service and management at this location!", "author": "Alex G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-26", "description": "I went when it wasn't crowded to see what all the hype was about. Boy did my taste buds thank me for the hamburger and fries. The bun was soft and fresh and the meat tasted REALLY good (granted, I did add salt, pepper, mayonnaise, ketchup and mustard before tasting it without the extras). The fries had a nice taste and they were hot and fresh. The s'mores custard was okay, but it tasted like a regular chocolate frosty. The service was also on point. I will definitely be returning and trying the double burger and their shakes.", "author": "Tina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-07", "description": "The burgers are good. The shakes are better. The wait is painful. This likely stems from the first two points.", "author": "Irwin M. F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-14", "description": "This place is all hype.  Its pretty average and not very well priced.  Hill country Chicken is much better in my opinion, and more or less just across the street.  I'm not trying to say that this place is necessarily terrible, but for some good greasy lunch food the chicken place is infinitely better, and their shakes are actually better than Shake Shack's.", "author": "Evan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "haven't eatin a burger from here yet. but when I pass by they look so darn good and it be crowded. so I know the burger has to be good. i'am gonna try one myself soon.", "author": "Glen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "Love this place! Try and go at off hours or you will be waiting on line and then waiting to find a table. This is not the place to go if you are watching what you eat! You have to be willing to pack on some pounds while eating at this place. I like all of the burgers, just be careful because the shoom burger comes out piping hot dripping with melting cheese, it can burn. The fries and shakes are good also. I do think that 5 guys is better but shake shack makes me feel slightly healthier eating there than 5 guys, no idea why!", "author": "Aimee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "Found this place by accident while exploring the city. They have custard, which was awesome since I'm a Wisconsin native and grew up eating custard. The flavors are fun (bacon peanut brittle) and delicious. To top it all off, the staff is great. Luckily for me this place is two blocks from my hotel!", "author": "Matt T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "Probably the Shake Shack with the shortest lines, love it!", "author": "Shehzad G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "This is one of the best burger places I have been too, and I love the convenient location in Downtown Brooklyn.  I have described this as a gourmet In-N-Out.  The prices are appropriate, and the quality is great.  I have tried a variety on the menu and enjoyed everything I have had.  Item's I've tried and enjoyed are the cheeseburger, Shack-ago dog, Frisky dog, Shroom burger (FYI it is stuffed with cheese), and the S'mores and Vanilla custards.  For drinks, I've enjoyed the lemonade, Arnold Palmer (half lemonade, half tea), and root beer.  I haven't disliked anything and want to go back often!", "author": "Sheila S."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}