{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-30", "description": "I really don't get the hype around shake shack, first time was in Vegas this may and last week have been to this location , fries are ok, burger so so, shakes are the best part here. In and out is much better and so is whataburger...", "author": "Gabi K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "long line but moved pretty quickly , didn't take that long to put in our order and get the food . burger was good , my cousin got the chickenshack and said it was good . would definitely come back again .  didn't give it 5 stars because i am not a fan of the fries (don't know if mine were just over cooked or what but wasn't good) .", "author": "Samara D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "I was vacationing in New York when i saw this little place. Apparently, it's like our In In Out Burger chain. I got the classic single, we ordered five burgers total with two fries and it was ready in less than ten minutes. I was very impressed, the burger was really good, i liked that the bun was different from normal. We had cheese fries, which were pretty simple for about $1.50 more, but they were good. One thing i would like is for them to serve ranch. I like to get ranch with my burger and fries, not sure if its a Cali thing, but every burger shop here has ranch. Overall great experience and great view!", "author": "Arthur P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "It's Shake Shack. I love their burgers, cheese fries, concretes ... Pretty much everything. Some locations lack the ever so appreciated customer service, but this location seems spot on. They keep their lines moving \u0026 a fast pace. I like that they have menus for you while you're on the line so you an be ready to go when you are up at the register! A great spot. Try the shroom burger \u0026 cheese fries \u0026 pretty much any concrete =)", "author": "Carolina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "It's Shake Shack. You'll get the food that you expect. Pretty quick service, even for large groups. Lots of table space. Great view, so close to the park.", "author": "Audrey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-21", "description": "Everyone is always talking about Shake Shack and one of my friends work there he's like when are you coming to visit me and I'm like I'll go one day lol its like I always wanted to check one out in the past but they are always crowded so I'm just like whatever. But today.......I treated myself and took myself out for lunch and went to Shake Shack for the first time. This location is the one my friend works at. The view is so beautiful you can see the Brooklyn bridge. Also, the staff is very professional. I had the smoke shack burger and fries. The burger was sooooo yummmmmm I was taking my time to eat it because I didn't want it to finish !!!! When it was done I was soo sad lol . I think next time I go I will get two burgers and no fries or two burgers and a shake with a drink of course. Their lemonade is good I'm a lemonade freak lol and their fries are good. My friend was also nice enough to pay for my meal, God bless him. Love it !!!!!", "author": "Judie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "I am a Shake Shack fan, having visited many locations; this one is my favorite! I always receive friendly and thorough service.  Amanda, who works the front of the house, is a doll!", "author": "D.E. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "I love you Shake Shack. You are the best think food-wise to ever hit DUMBO, Brooklyn Heights area.", "author": "Bubbles McTroubles S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "It's a small little place but the food is really good. The burgers are tasty and the lemonade is so good.", "author": "Elizabeth S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "Another shake shack and it comes to DUMBO.  This shake shack is as good as the others offering mean burgers except the ambiance of this one is more rustic and downtown/factory like.  Makes a great addition to the coolest most incredible park on the planet which is Brooklyn Bridge Park.  The shop is a brick and mortar right outside of the park on the block of Grimaldes Pizza.  \n\nLet's hope the lines for the shake shack don't turn into the lines for Grimaldes and we'll all be happy.  Welcome home Shake Shack and keep up the great expansions!!", "author": "Joshua F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-10", "description": "My review is based on the service... not the food.  First I go to the C line to order and there is nobody there so I eventually move to the regular line and of course, somebody comes to take orders from the C line.  I will let that go somewhat, because the cashier mentioned it when I placed my order.  I let her know why I got into the regular line and she apologized.  I ordered 2 shakes... 1 caramel and 1 caramel and peanut butter.  Fairly simple order which I didn't expect to take a long.  Keep in mind that there wasn't a very long line while I was there.  \n\nAfter waiting for at least 10 - 15 minutes and watching multiple people getting their orders, I go to ask about mine.  The guy asked, says that he's going to check on my order.  I see him walk away and ask one of the people in the back a question but he never comes back to me.  I decide to ask another person behind the counter.  She goes to check and my shakes were just sitting there.. and looked like they had been for a while but nobody bothered to pick them up.  \n\nI take them and put straws in them and then noticed that the labels indicated that I got peanut butter shake and a peanut butter caramel.  I go back and explain what I ordered and the girls got an attitude with me and said that they had given me the right drinks.  And I keep repeating, I got CARAMEL and a CARAMEL/PEANUT BUTTER.  Then they tell me that I am right and go back and of course the caramel drink is also sitting on the shelf, which it probably had been for a while.  Then when I try to take what I ordered, they start telling me to just take the extra drink as if I had done something wrong. I kept saying... I don't want three shakes.  And they just repeated to take it.  I decided to just give it to somebody waiting in line.  \n\nOverall, I thought that the service was beyond bad and ridiculous.  Shake shack is shake shack, so the food and drinks will always be good, but they definitely need to improve their customer service!", "author": "Alma M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Love Shake Shack!  Friendly service at this location- sometimes get freebies if they get your order wrong- and the line isn't too bad considering it can get a bit crowded.  Which is to be expected at Shake Shack.  The burger and cheese fries are a staple, but the chicken shack and portobello burger are must tries!  The chicken shack is one of the best chicken sandwiches I've tried!", "author": "Fallon M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-31", "description": "I would rate the food here as I would rate the conditions of their bathrooms. Poor. Only difference was the bathrooms weren't cold. I love shake shack so I was very sad about this one.", "author": "Elizabeth G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-16", "description": "Awesome!!!  Loved this place - burgers were good, but the shakes were great!  Never have I ever had a more delicious milk shake - I got the caramel / coffee and could not have been happier.  I also tried the burger, cheese fries, and shakemeister ale - no judging!  This is the DUMBO locale, and the view is beautiful - there's indoor / outdoor seating in the summer.  Just be prepared to get a little up close and personal with your neighbor- also they only have one bathroom stall in the place - just an FYI in case you can take care of those down under issues, somewhere else before your visit.  But food and service make it an awesome treat!", "author": "Ginelle S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-06", "description": "Extremely horrible service... Workers are inattentive. Sorry shake shack but you need to fix your customer service. Waiting in line for half a hour for a shake when u was the only 1 if 2 people receiving it is unacceptable.", "author": "Jess C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "This place is heaven on earth.  I love the fact they have shakes, veggie burgers, hot dogs and great fries under one roof.  I can't wait to they come to Los Angeles.  We visited the one in Mid-Manhattan near Time Square too.  I recommend the one in DUMBO because of the view of Manhattan \u0026 the bridges.  The burgers remind me of In-N-Out.", "author": "Andre R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-13", "description": "Pretty much your average shake shack. Although I must say that when it gets super busy around lunch time, they do tend to once in a while get orders slightly incorrect... When I went with co-workers for lunch in a group of around 10 people, we all ordered separate checks, but they still messed up 2/10 peoples' orders.", "author": "Asdy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "Popular burger chain here in NYC. I always like having their burgers but I feel the quality has downgraded a bit. Also the wait here is long but that is to be expected in a touristy area. All in all the food is here is excellent and I recommend anyone who is hungry or wants a good burger to stop here.", "author": "John-Carlo B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-19", "description": "Had the fried cheese stuffed mushroom burger and fries. Phenomenal albeit small! The fudge-itaboutit was meh. Staff was super friendly !!!", "author": "Emilia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "The double cheeseburger is so fresh and juicy, very delicious. The Brooklyn pie oh my wasn't as good as I expected. ( I would prefer the pie to be hot and toasty or have a different texture than the ice cream.) \n\nI highly suggest that you get it to-go and eat outside at a nearby park next to the river if the weather permits.", "author": "Steve F."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}