{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "Really Good Burger! Top 5 I Ever Had.. The Bacon Is Awesome! Also The Fries Are Great, Get The Cheese On Them.. I Also Tried A Shake It Was OK, A Little Thick.. Go Give Them A Try!!", "author": "Giuseppe A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "Oh, my lord!! this was the most fantastic burger I have had in a LOOOOONG time. I'm from the west coast, and had never heard of this place until a friend recommended that we go there for my birthday yesterday. \n\nThe SmokeShack burger, double, and I was in heaven!! I've booked marked it and plan to go again next time I'm in the neighborhood.", "author": "Doug G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "Best burger chain of East coast (I am from L.A). A Lil salty but juicy burger an quality ingredients. I must say pretty Damn good burger. If you looking for a burger for a decent price...here ya go!", "author": "Jay P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "Shake Shack is great. \n\nThis is a fab location compared to UES and Flatiron. \nIt is spacious and draws a smaller crowd in comparison. \n\nSame great food. Same great taste. Great for casual eats with a group of friends.", "author": "Burgandy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "I love this place. The food is almost never disappointing. What's too bad is that prices seem to be going up but it's understandable with rising costs of healthy food and decent pay for their employees. It's worth it for me to have both great food and a good conscience. Had a run in with a few over salty burgers/fries hence the 4 stars. But hey still love the chain.", "author": "betty s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "Love love love! my mouth is watering as I'm writing this! This place never disappoints me. Been here many times and my stomach left happy each time! I really like this location cause it's clean and not too crowded like the rest. I love everything on the menu! Cheese fries are amazing and must have with a burger Yum!!! I would love to have this every other day but then I'd be so over weight. The burgers are a bit greasy but still delicious oh my gosh mmmmmm! The milkshakes are delish also! \n\nYUM!", "author": "Nancy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "Well, it's no secret that my hubby and I LOVE Shake Shack, and having one so close to our apartment is pretty dangerous. The staff were really friendly and quick to deliver, the food, as always, was delicious, given the cheesy goodness of their Shackbuger and the delicious crispiness of their crinkle fries. Don't forget the awesome slirpy goodness of the chocolate custard I also indulged in. Nonetheless, delicious as always, and no matter how busy the place was, everything was as clean as possible! *Take note Starbucks!", "author": "Julie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "First off -- I'd like to start off by saying I'm SO pissed I missed the gentrification rush in Downtown Brooklyn when I graduated college because apparently now there's a Shake Shack and a Panera Bread just steps away from my alma mater. \n\nSecondly -- my anger was fully realized when I had my first Shackburger and coffee milkshake here last week.  Mind you it was my first Shake Shack experience, EVER.  (So I'm probably butchering all the trademarked names for items on their menu). Because, really, fuck waiting on the cattle line at 23 St.  This shit is good but it's not waste my day waiting on line for a burger good.  I was glad to finally find a location where people wouldn't be all stupid about lines and I can still enjoy the food without having to listen to myself bitch about the line later.\n\nThe burger was filling without being bloating and was cooked to juicy perfection.\nThe coffee shake was a nice, sweet way to cleanse the palate and tell my tummy you're done.  \nOne of those things that just hit the spot when done right, you know?  And it did.\nIt was fucking poetic.  \n\nAs for ambiance... \n\nYOU KNOW WHAT I HAD HERE WHEN I WENT TO COLLEGE?  Halal food.  And that was amazing and I'll always have a special place in my heart for it but you can't buckle down at a halal food truck and bring your schoolwork and meet your friends and straight up hang out and get fat at a cool burger joint, you just can't.  \n\nThey keep the place really clean and take away your tray for you when you're done eating so you don't have to throw it out yourself.  Not that I wouldn't have done so, but I'm fucking lazy so if you give me that option and it's out of the norm for other burger place, I will fucking take note and write about it on Yelp.  5 STARS FOR YOU CLEAN-UP GUY.  YOU DONE GOOD.\n\nFuck, these burgers were good.  Would definitely make a point to stop back in again if I am working in the area.  Hope to fucking see you there.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Yesssssss ... Gotta be my favorite burger... Yea you might need 2 or 3 if u have a big appetite but with the quality of meat and taste GO FOR IT! .... If u haven't had it ITS A MUST ...and OH YES...you will be back.. They might sneak crack in them HAHA", "author": "Brendon V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Everyone's super nice at this location. They're very helpful..and make your experience enjoyable as possible.", "author": "Jasmine A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "I can honestly say this is my favorite burger in the world. I can't recall a more flavorful beef. From the first bite it's like you're transported into a state of ecstasy that you just don't get from other burger places. The double with bacon is my fave, but the smoke shake is incredible, as is the shack stack. The fries are fresh and awesome. The fair shake is definitely worth it in every way. I can't speak highly enough of this place. So glad they're coming to Austin, TX where I am moving in a week.", "author": "Stephen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-17", "description": "I won't eat a hamburger anywhere else now.  That's basically it.  The consistency in the burgers is amazing - always just right.  If you like burgers well-done this is not your place as they are typically medium to preserve the juicy factor.  There's no point in freshly grinding meat with the appropriate fat content for great burgers if they're just going to get cooked to death, IMO.  Apparently they're also adding fresh-cut fries to the menu as well.  Bonus!\n\nI'd say the one downside is the price of fountain drinks.  I can deal with my double cheeseburger being $7 because it's worth every bite but a fountain soda should never be $2 unless you're going to get a couple of refills.  I splurge sometimes for the tap root beer but otherwise go for the water cup.  Nestlé hasn't gotten to the taps here yet.", "author": "Jonah F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "Tried their new Chicken Shack, and it was really good. Chicken was very crispy, and the mayo had some sort of herb that had some great flavor. The location is nice. Went at 11:30 on a weekday and though it wasn't very crowded, the food took a bit to make.  Also, the cheese fries are pretty salty.", "author": "Arthur A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "First time eating here and it was AMAZING. I'm not a burger girl BUT this was one of the best burgers I've ever tasted. Juicy burger soft bun the raw onions and the bacon !im so shocked because I never expected for it to taste this great I'm impressed", "author": "Naquita K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-11", "description": "It's always crowded there during lunch time : waited almost 15 mins to place my order and then another 20-25 mins to pick it up. I got double shackburger, cheese fries and a blueberry lemonade. It's a bit too much so I couldn't finish them by myself. The cheese fries was sooo yummy but 5 guy burgers cajun fries was way much better and it's less pricy. \n\nHowever, the food was sooo oily, you could actually see the oil dipping from the burger  it's obviously very unhealthy and I won't go back for the burger because I don't see the difference between McDonald burgers and the one I got from shake shack. \n\nBlueberry lemonade was newly introduced by shake shack. However, it tasted like slush with sour patch. All I tasted was a sweet \u0026 extremely sour drink with blue coloration. Ewwww. I will never ever come back for the burger and the weird taste drinks.", "author": "Trista L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-08", "description": "I'm sorry shake shack but seriously why are you're burgers SO salty? This was my second time eating shake shack but first time at this Brooklyn location and I was so disappointed to find that the burgers here are equally salty as the other locations. On the other hand the cheese fries were awesome. I wish shake shack had like a meal you can pay for that comes with a burger, fries and a drink at a more affordable price instead of charging for every single item. However, if I'm ever in this neighborhood and craving something salty (which there is a 10% chance of happening), I'll be back here.", "author": "Jane M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-07", "description": "I enjoy a tasty burger (though I wish that there was a written description of a Shack Burger that I could have referenced before getting up to the counter), secretly hate buzzers to alert me that my food is ready, like knowing where to go to get a shake on a hot day and think that lemonade should be standard on all menus. \n\nThat is all. Thanks Shake Shack.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "For my first trip to Shake Shack I got the Shack Burger, Shack Hotdog and Shake Lemonade (but no shake, ironically.)\n\nEverything was deeeeeeeelicious! That sauce on the burger, yowza! Dog-friendly because there are tables and chairs outside.", "author": "Amuse B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-24", "description": "What is there not to love, especially without Madison Square Park's absurd lines. This was the first time I had the Shack Stack, a burger with a cheese filled breaded portobello and boy is that a burger. You won't be able to avoid it, but when you bite into the burger, gooey delicious cheese will just ooze out of the bottom. It's hard to describe the orgasm in your mouth, but it's about the crisp of the breading, the meaty portobello, and the incredible cheese in every bite.\n\nPersonally, I would actually order it without the burger. To me, it doesn't do much for the burger and I'd rather have the cheese and portobello emphasized. I washed that down with a great summer beer, the Shackmeister Brooklyn Brewery beer.\n\nI then went back for more with the Urban Lumberjack frozen custard. Go with a half because I can't imagine how anyone finishes a full. It comes with creamy and smooth vanilla custard, which is almost like soft serve, but simply better. The toppings include banana slices, deep fried waffle bits, and peanut brittle. One of the best desserts in NYC.", "author": "Darwin G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-31", "description": "This place is proof that location and hype can overcome mediocrity. The fries were crispy but tasted of stale, old oil...I gave up after less than half the order...and this was on a busy Sunday afternoon. The vanilla custard was overly sweet and overly vanilla-d, and the strawberry balsamic pie, admittedly not their fault, was bland and tasteless with mushy berries and barely noticeable crust. Very disappointed.", "author": "JJ V."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}