{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-05", "description": "A little disappointing for me when I came here the other night for a quick dinner. I live in Chicago, visiting NY for vacation. I was in the vicinity and decided to try it.\n\nI got the smoke shack burger. Fortunately it was well cooked so that part I can't complain about. However, I was terribly disappointed with the taste. Just the combination of everything on it didn't flow together for me. Maybe my Chicago taste buds are just used to Chicago-style burgers.  It's apparently good to the locals. \n\nI also got a concrete since I never heard of that before. That didn't impress me too much either. I don't have to return here next time I'm in NY.", "author": "Don R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "I'm a huge shake shack fan. love their burgers. I always get the shack stack because... it's simply amazing. \n\nBUT... let's talk about the chicken shack!\nSo my friends and i hit up 3 fried chicken sandwhich joints in one evening to compare. \nI'd say the chicken shack was really good.\nbread - standard shake shack bread. soft, delicious\nchicken - white meat. pretty good for breast/white meat! not too dry like some other places. good thickness\nbatter - the coating around the meat was the best. super crispy and seasoned to near perfection\nveggies inside - simple, good, nothing fancy.\n\nOverall, i think it's one of the best white meat chicken sandwiches. It rivals chick fil a, but i would choose FUKU's chicken sandwich over it. BUT you should def give it a try!\n\nThis DUMBO location is also gorgeous. spacious inside. seating was easy to find on a friday evening. but why stay inside?? take your meal to go and go across the street to the gorgeous waterfront. beautiful view of the city skyline. \nthere is also a citibike stop right in front in case you use that.\n\n(tip: if you want some good pizza after, juliana's and grimaldi's is right nearby)", "author": "Yong K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "I ordered a single hamburger on a gluten-free bun, with pickles, no onions. It's was good for a quick lunch meal under $10US. The bun was slightly sweet. The meat patty was good for a fast food spot...it wasn't overly pressed and rubbery. Fresh, crisp lettuce and slices of tomato. The staff was very friendly. Even though the line was long, things moved quickly. The staff was constantly cleaning and even asked how we liked our meal. I'd come back again. M had the chicken hotdog on a regular bun. It could have used some toppings like sauerkraut or relish. It was very basic. The bun was also slightly sweet ... possibly a potato bun. I'd come back.", "author": "Marie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Yes , I have always been a fan and for this location, I am giving an extra star. Everything tastes so fresh. Happened to visit this place to see the night view of Brooklyn Bridge. Awesome it was and quite refreshing! Trust me the burgers here taste way too much better than other places. I have been to Madison park and near times square, this one tops the list.", "author": "Divya D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-21", "description": "Call me crazy but I like it better when Shake Shack has a separate line for cold stuff/drinks. Had to wait in line for a shake and a lemonade along with everyone that wanted burgers. :(\n\nMy boyfriend got a shake, I forgot which one but he said it was good. I got the raspberry limeade. I just don't learn from my past experience with their special lemonade flavors, because this one was way worse than the last one I had. Sour and bitter. I finished it only because it was so hot outside that day, but I hated every sip of it. :(", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "There was something odd about this Shake Shack...it was virtually EMPTY when I got there! Granted, it was a 40 degrees on a rainy Tuesday night in February; I don't think the crowds were clamoring for a trip to Shake Shack, haha, but it was perfect for me and the beau because we had an 8 p.m. show to attend at St. Ann's Warehouse. \n\nWith arguably the best view of any Shake Shack in the city, this location had all of my favorites and then some. I finally got to try the new(ish) Chick'n Shack as well as the Roadside Shack Burger. I was a huge fan of both; I loved the crispy exterior of the chicken on the former as well as the generous schmear of herbed buttermilk sauce spread upon the pillowy potato bun, and the beer-cooked caramelized onions on the latter were a great sweet contrast to the salty cheese on the burger. I have to laugh because I ordered the Chick'n Shack, he ordered the Roadside Shack, we exchanged bites, and he liked the chicken sandwich better while I liked the burger better. Haaa. Go figure! But, overall, I really enjoyed them both. I'd buy either again; admittedly, it's nice to now have another option besides a burger at Shake Shack. (Yes, I know there are hot dogs, but I am not a hot dog kind of gal.) \n\nOne of my favorite reasons to go to any new (to me) Shake Shack location is to try their concretes. I have had the Brooklyn Pie O My at their location near MetroTech, which they also have at this DUMBO location. However, they had the Caramel Carousel: vanilla custard with sea salt caramel sauce, sliced banana, and pieces of sugar cone. OH. LOVE! It's one of the best concretes I've ever had at any S.S. location, hands down! \n\nI'm sure this location gets swamped in the warmer weather; quite frankly, who can refuse the charm and beauty of the view of lower Manhattan and the two bridges on a beautiful day? With many food places popping up and holding a grip on that area, it's nice to have something as familiar and delicious as Shake Shack under the bridge.", "author": "Allison C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Eating at Shake Shack was one of the experiences I was most looking forward to when I visited New York...and it did not disappoint! Ordered the Shack burger and Shroom Burger and they were both amazing. Cooked very well and the melted cheese was just heavenly. Also got the vanilla shake and Brooklyn pie concrete. So creamy and sweet! I am so sad I have to go back to the Midwest and leave this place ):", "author": "Jason Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Along side with Serendipity, a restaurant I would definitely come back to if I ever go to New York again! This location was surprisingly not busy for a Sunday night and I love that they are right under the Brooklyn Bridge, so we were able to get an awesome view of Manhattan and all the lights. \n\nI ordered a single ShackBurger with a side of crinkle fries and their featured flavor lemonade (mango). Everything was delicious! I don't know if it was because I was really hungry and just really needed to eat something or the food was just that good...i'm thinking it's both! hahaa.\n\nThis place is a must if you're ever in the East Coast, I definitely think it is worth the hype. They not only serve burgers, they also serve hot dogs, a variety of shakes, beer, wine, for dessert they have custard and they also have snacks for dogs! I'm sad I didn't get the chance to try their custard, hopefully next time! I know the closest Shake Shack to CA is in Las Vegas, so if I'm ever there I'll remember to try it then!", "author": "Freida T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "Went here for the special Chicken shack.\n\nLike always there was a line, we got trough the line real fast and ordered two cheeseburgers and a chicken shack. \n\nThe food is solid, the chicken shack could have had more sauce if you ask me. \nI think the cheeseburgers are better.\n\nThe location is great btw!", "author": "Halit A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "If you want a decent fast food burger, go to Shake Stack, forget that Mickey D's, Burger King crap, who cares if you can have it your way? I only want it the Shack way.\n\nIf you wanna go premium, I suggest you get the shack stack, it's got ALL the burgers in it, combines the shroom burger and smoke stack burger into a double patty. I decided to bring it up a notch by adding bacon, go hard or go home, am I right? \n\nThe cheese was oozing and sizzling when it was served to me. The burger was stacked so high I couldn't even bite into it completely, had to take half bites top and bottom but was juicy alright.\n\nSorry West Coast, we do it better on the east coast, but I'm gonna give you credit for the best burritos in America.", "author": "Virginia Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "Shack wine on trap. Yes. You read correctly. Wine. Made especially for them by some frog winery. Red an white. On tap. Line is long to wc. Don't drink too much.\n\nFour and twenty pie with custard. Kill two blackbirds in one for dessert. Today's flavor is peach. Pies flavors are seasonal.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "Located in the Fulton Station.  Lunchtime crowds are out the door.  The burgers are delicious.  Fries are good.  It's not overrated - as good as advertised.", "author": "K D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "I'm such a huge fan of Shake Shack but every time I pass by one its always so crowded that I usually end up  going somewhere else. However I was at Brooklyn Bridge Park and had to go back to my car to add more time to my meter and I happened to noticed that there was no line at this location. I was on my way to brunch but hey I couldn't pass getting a burger at Shake Shack without making a line. The girl behind the counter was super friendly had a big welcoming smile while she took my order. \nAs always there burgers are so delicious I ate mine on my way to my brunch, I guess that's the fat kid in me :)", "author": "Isabel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "The best chicken sandwich EVER! Juicy , tasty, and the perfect crunch to every bite.  I will definitely return!  Loved it.", "author": "Kimberly W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-12", "description": "Portabello mushroom burger and strawberry malt were good but not worth $14. Seems like a novelty niche place for people with more money than sense.", "author": "Shawndrica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "It's too easy to over eat here =( I came in here thinking I should get the double cheese burger cause the single looked small - boy was I wrong!\n\nAny-who, staff was friendly, wait time was pretty quick at 10PM on a Thursday and the food was greasy and fresh.\n\nThe bathroom, while decently clean had no paper towels or toilet paper.... WHY?!", "author": "Elaine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Had wonderful hot dogs [the buns was to die for] and good fries there. Fantastic lemonade too.  Can't wait to get back to Brooklyn in order to try their burgers.  Sigh!!!\nSigned a SoCal gal", "author": "Vyvyan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "I'm normally not a fan of shake shack, but I must say this location has changed my opinion of shake shack forever. \n   First off the burger was so juicy and amazing. The fries were cooked perfectly. The few times I had been before they were overly cooked. The shake was to die for. And the boys I nanny for were completely satisfied. \n  It wasn't the food that made this location the best it was the outstanding customer service. I'm so shocked at how interactive they were. I've been to the one on Fulton street, and it's a nightmare. But this one in DUMBO was just so surprising. The one person that made my day was Percilla. She was so kind and so attentive. Legit was talking to her like we were best friends.  \n  As we walked out I left my bag. Most people wouldn't come chasing you down, they would either leave it or take it. Percilla came rushing out of the store calling my name with my bag! If anyone deserves a raise it's her! \n Long story short this location is amazing. :)", "author": "Casey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "I love shake shack burgers and their crinkle fries. They are so well seasoned. My only problem is that I wish the patties were bigger. They are so good that I cant help but want more!\n\nThe registers and lines are right when you walk in. There is seating on either sides of the room. \n\nThis restaurant is located in a prime area in Dumbo. Because it is right next to the Water taxi overlooking the Manhattan Skyline with picturesque views, it can get crowded. Keeping that it mind, parking will be challenging and the area may be filled with tourists and wedding parties.", "author": "Erika Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "I have never tried the shakes at shake shack (although I hear they are amazing). I always only get the vegetarian portobello mushroom burger. My boyfriend says the fries are good but I only tried one of them and they tasted like regular fries to me.\n\nThis location is new, huge (with ample seating) and the few times I went over the summer it was jam packed. It's right by the waterfront on the corner and is a welcome addition amongst the plethora of pizza parlors in the area.\n\nHowever, last night I passed here and it was pretty much empty. (but so was grimaldi's and julianne's) so I guess in the winter is the best time to come if you hate waiting in long lines for your food.", "author": "Camille H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}