{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "Our first experience with \"the\" Shake Shack. We went on a weeknight after 7pm and although it was crowded, the line moved, and we were able to find seats.  2 single Shack burgers, fries, and 2 root beers and we were good to go.  The burger gets 5 stars from me. Juicy but not greasy, melted cheese, and the buttery bun. It was perfection. The fries were good but not out of the park good.  Overall I was pleased and really wanted to order another burger but the fatty in me refrained.  It's definitely worth the hype. I'm not one for milkshakes with my burgers but I may have to try one the next visit.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-31", "description": "You know I was there for the first time \u0026 the burgers form Shake Shack taste so good but not the fries though? Because it tastes to hard! That's why I like White Castle fries better than Shake Shack fries!", "author": "Telia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "I remember waiting in that unbearable line in Madison Square Park back in the day, desperate to get my Shake Shack fix. Luckily, that is now a fond memory since we now have this location in good ol' BK.\n\nI don't go here as often as I want to, but when I do I love having the Shack Burger. It is always cooked to perfection and the whole thing melts in my mouth. Fries are aight, but if my sweet tooth is acting up, I replace them with a concrete instead. \n\nThe urban lumbershack is the favorite of me and fiancé. We both love Belgian waffles, and he's a big fan of bananas. Throw in the Bacon peanut brittle and it's a match made in heaven! I also love how there are different concretes in each location. Makes me want to hit up all the locations so I can try them all (OMG.... Challenge accepted!)", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "I am not a vegetarian by any means.  I love meat.  \n\nBut I tried someone's mushroom burger and thought it was wayyyy better than my burger.\n\nGive it a try even if you are a carnivore, it's worth it!  Although don't equate the lack of meat to be healthier.  Sadly, it has more calories than its hamburger equivalent.", "author": "Suzanne P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-14", "description": "Came here with my boyfriend to  celebrate our six months.\nCool place I guess. Had regular burgers and cheese fries and I orders am ice tea but it was so bland. The only downfall though. Burgers were good and fries were GREAT.\nTERRIBLY slow. My boyfriend and I had to wait sooooooo long for our food and The place wasn't so packed :/", "author": "Yenifer Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "Though the line was a bit of a challenge, the food is great! The burgers were cooked to perfection. I do regret not getting the custard or a shake when I had the chance. Oh, well, that's more than enough motivation to go back and try it out  :)\nThank god there was one in Brooklyn so I don't have to wait on line for hours in Manhattan. The atmosphere was comfortable and it went well with the scenery. The staff were friendly, even having to deal with tons of people at the time. \nI would definitely recommend coming here instead of Manhattan. The line's shorter here anyways!", "author": "Celia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "It's a Shake Shack. You know wassup.\n\nI have yet to sit down inside but I like what I saw. I popped in to get a chocolate milkshake on the way home from work and I was surprised to find barely a line! I was in and out within less than 10mns (that's what she said).\n\nWhat I like about this Shake Shack location is that it's relatively big, with lots of seating and it's all windows. I love people watching and being right on Fulton Mall, there's plenty to see!\n\nRumor has it there's 2 special items that's not listed on the menu. Both as toppings to either the hot dog or fries so I will come back to see if that's true and if it is, give it a try.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "Definitely one of the better burger chains.  I love the minimal selection for food but the many options to add to the selections.  The Shack Stack is amazing, A fried portabella on top of a burger?  Yes please!!  They also server beer and wine which is a major plus.  They have their own draught beer which is really good.  I try to go here at least once a week but my stomach sometimes has other ideas.", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "I work around the corner and come here EVERYDAY for lunch. Every. Single. Day. And everyday I get the same thing. Shack burger. Fries. Diet coke. And every Friday I get a concrete jungle to celebrate the end of the week and congratulate myself on a job well done!!! And this routine brings me great happiness. The lines are never TOO bad which is really fortunate for us in the area because the only other one that I've been to in Madison square park has ridiculous lines and I just don't get why someone would wait that long for burgers. Even these amazingly delicious little burgers. But I don't have these issues at my sweet little palace in downtown brooklyn, my sanctuary! I just tried the chicken sandwich also and I must see it is out-freakin-standing. Definitely superior to the Fuku sandwiches. ;)", "author": "Fred C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "Would eat here everyday but would be afraid I would stop daydreaming about their melt in your mouth burgers, perfect fries, and mind blowing lemon aids. Had a delicious Chicago dog and the shake was average. So far I have had burgers from two locations but I prefer the taste to this one better. I think they use less salt. \n\nIf you find yourself in a long line there is a reason for it and don't worry you won't be waiting for long. I wouldn't stand in line for any other person, place, or thing.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-20", "description": "It was my first time going here. My brother brought the family here because he told us their burger was good. And it is similar to In and Out burger restaurant but this place looks more like a restaurant. This restaurant seems like a lot of young people hang out at this restaurant. my family decided to order 5 shack burgers, fries with cheese and fries without cheese.  My first bite of the burger, i thought the burger was very juicy and i like the flavor on this burger especially the bun too. The bun had the sweet taste that combine with juicy flavor from the patty. The fries without cheese, it had a good texture, it wasnt dry, and it was fluffy enough and moist to it. The fries with cheese gave the fries a cheesy flavor but it was very tasty. It was an enjoyable experience and it was a quick service especially the among of food that we order. I will definitely come back here again when i am in NY again", "author": "Julie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "Came early to this location in Brooklyn to surprise the other half for lunch, as this location is by the courts it gets busy during lunch time so come early. This is the only location that offers a chicken sandwich, so I came to check it out. The chicken is all white meat and tender, a solid choice. The best is of course the classic shake shack burger and some fries you can never go wrong with that.", "author": "Jaime R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-26", "description": "All of the hype I have heard was all true!\nDamn this burger! Damn the milk shakes! Damn the fries! Damn the hotdogs...just damn! \nDamn all of you calorie bastards to hell and back and then to hell again!\nI truly love this place, friendly staff, clean environment. \nI am most happy that they are so close to my school and a hop skip from home. (that was sarcasm in case you missed it)\nAnyway those shakes and I will date all summer long and maybe into the fall (depending how much weight I gain)\nSee you soon lover!", "author": "Quana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "So my co-workers voted against me and instead of Tio Pio for lunch, we went to Shake Shack.  I have never been so happy to be beaten at a vote. \n\nI walked in with six coworkers and ordered a double burger, fries, bottle of water and a red velvet ice cream. 15-20 minutes later, we all had our food. Big shock since I waited forever at New York Burger Co. The first thing I noticed was potato rolls on my burger. I LOVE potato rolls. Then I took a bite of my burger. Damn, I hated spending 16 bucks for my meal, but I forgot all about it when I took a bite. The fries are better than Nathan's crinkle cut fries. The red velvet ice cream was great! I walked out wondering how people can get full from so little food. By the time I got to my desk, I was dying for a nap! I gotta say that Shack Shack beat out Five Guys. That potato roll just did it. \n\nGood variety and good food. A little pricy for burgers but you will not regret it!", "author": "Al E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-16", "description": "They were suppose to be giving out free burgers (100) from 10:30am till 12pm. I stood out there from 10:20am. On a short line. Then after about 20min they ran outta free burgers. I don't believe that!- there was no way 100 people were on that line. I don't believe that had any intentions of giving away 100 burgers. They are full of it!", "author": "Kenneth B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "This is RIGHT across the street from one of the law schools I'm considering attending (Brooklyn Law). I've already been advised by my fiancee and a friend that this is not a justifiable reason to go with this over a place like Cardozo, but, BUT...it's Shake Shack!!\n\nI am in the unenviable position of working right next to the flagship location, which if you don't know, warrants its own \"Shack Cam\" because of the ridiculous line. This has always been the turn off for Shake Shack as a lunch option.\n\n*enter this new Brooklyn location the day I'm working in downtown Brooklyn*\n\nEEEEEEE!! Oh Shack Burger how delicious art thou! I have forgotten thee after all this time!\n\nFOOD: Burgers = amazeballs. Fries = decent, but not the best. Shakes = omgdon'tevenshutup. SO good.\n\nPRICE: Medium(ish) range. I had a Shack Burger and fries today, which came out to $7. Considering that you can get a similar price at the BK next door (don't ask me how it's going to survive the Shake Shack next door), that's really not bad at all.\n\nSETTING: Big. Clean. Nice. A huge step up from the limited benches in Madison Square Park that you might be able to snag if it's currently raining outside.\n\nIn all? I \"heart\" (stupid Yelp won't let me use the symbol/number combination). Must remember this when I decide which law school to attend... (j/k, maybe).", "author": "Shea D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "I don't want to be biased but I'm loyal to In-n-Out Burger! As a California native traveling New York for the first time with friends Shake Shack was definitely part of our itinerary when it came to food spots!! I'll be honest I've been looking forward to trying this place out after hearing so much about it and seeing it in movies! I had the option to try it when I was in Vegas but I decided to wait patiently and actually try it in NEW YORK! Anyways I had the Shake Stack which consist of a regular cheeseburger with a deep fried portobello mushroom added to it! It was really good paired with some hot crispy bacon and cheese fries and an ice cold Brooklyn Lager! Overall the food taste good but in my opinion it's over priced!!! I paid an average of $28 for the burger, bacon fries, beer. There are no meal option whatsoever! Anyways it was worth it because we don't have this in Cali. But I still choose In-n-Out over it because of food quality and affordable price.", "author": "JB L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-26", "description": "Shake Shack has been the talk of the town near my work in the city. Madison Square Park's site ALWAYS has a wrap around line which would use up my entire lunch hour just to order if I even get to do that! But I finally gave Shake Shack (Fulton St) a try the other day and it was not bad at all. The crispy crinkle fries and the simple cheeseburger was just enough to fill my crave. This is definitely more of a tourist spot but if you can get here before the crowd, you should try their various selection of burgers.", "author": "Betty B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "The easiest place to compare Shake Shack to is Five Guys.  It's slower than McDonald's and faster than a sit-down restaurant but the food is significantly better than McDo's and the like.  Though Five Guys-like, this is a different burger.  I love both the Burgers and Fries at Five Guys, but I usually leave feeling like I need to get my stomach pumped.  \n\nI had the Single ShackBurger and it felt lighter than Five Guys' Little Burger yet just as satisfying. The patty was juicy and extremely flavorful, more so than I can say Five Guys' patty is (the flavorful part).  I also had the fries, and at first thought they were okay.  Adding cheese sauce made them magical.  Though I strongly believe that Shake Shack and Five Guys offer different burgers and a somewhat different experience, if I had to say which burger was MY burger, it would be Shake Shack.\n\nAtlanta isn't getting its Shake Shack for a while, so until then, I'm counting the days 'til my next NYC trip.  Absence makes the heart grow fonder.  Sigh.", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-28", "description": "It looks and smells like a shake shack.\nHas all the symptoms of a shake shack.\nBecause it is in fact.................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................a shake shack.", "author": "Ben F."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}