{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-29", "description": "I've never had a problem with Shake Shack before but this time, at this location, I was extremely disappointed with the french fries. They were cooked in such old oil that they came out bitter and inedible. Could not get past a second fry. Everything else (Shack Stack and the Chicken sandwich) was great. But, please replace the oil frequently.", "author": "Angie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-02", "description": "They were certainly still working out the kinks when we stopped by, having only recently opened up.\n\nMy other half stood in-line for two concrete custards, an order of fries (don't mock it till you've tried it) and doggy ice-cream with peanut butter syrup.\n\nThe concrete custard was more like vanilla soup, and the fries were just ok (pre-crinkle cut return). Bella, our pup, on the other hand, LOVED the doggy ice-cream and the giant biscuit was her favorite (too).\n\nCall it early opening-itis. I've been back since and they've ironed out all their issues.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "Great location! Great views and lots of seating inside and out. Not too busy when I went on a friday early evening. \n\nTheir burgers are always good! Got a poochini for the first time and of course, my dog gobbled it up. \n\nWhen did their fries stopped being crinkle cut?! They're now thin and not as crispy! :( Very disappointed they don't have crinkle cut fries anymore!", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "I'm from the west coast so In-n-out is unbeatable in my opinion, but shake shack is a close second with their delicious burgers and shakes! This particular location is one of my favorites. Its right next to the water in DUMBO and by pier 1, with the most amazing views of the water and Manhattan. Expect lines at this location but know they move pretty quickly. Finding a table might be a bit of an issue but if you wait around a bit you'll find one. The food is consistently tasty, and remember to grab a shake on your way out!", "author": "Arthur V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "If you're around the Dumbo neighborhood and in the mood for a good burger then this is the place to come. All fresh burgers with a variety of other options such as hot dogs and shakes. Plus once you step outside the view of the New York City skyline is incredible.", "author": "Andres C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "The location. Go get a table by the window and just see the Brooklyn Bridge staring back at you. Amazing. My fiancee, sister, and I stopped by here as we were going around exploring Brooklyn (DUMBO) on a rainy day in February. There was almost nobody in the restaurant, so we got to get a table with a very nice view out the window. This was my fiancee's first time in New York, and basically her first time seeing the Brooklyn Bridge, so it was quite an enjoyable experience to be able to sit there with some nice Chick'n Shacks and the very tasty Salted Caramel Hot Chocolate, looking out the window.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "Despite the crowd and the wait, my time her was well worth it. Delicious burgers and fries in DUMBO, under the Brooklyn Bridge right off the water on a Friday night, how relaxing. \n\nThe store is designed very nice with cool seating. Love the fact you can get free cold water while you wait or as an healthier option. But sometimes that goes out the window, the SHAKE, was sooooo good!!\n\nIt's a very happening place and I'm sure it will do great because of its location. The one thing I didn't appreciate is the fact that they never gave us my daughter's burger and when my wife went back, the asshole behind the counter (I wish I had his name) insinuated to my wife that she did get the burger and just wanted \"another one\" REALLY, gonna make myself look like a fool scamming the system over a $5 dollar burger!!! Either management needs to demand respect for customers from their employees or need to have them practice counting the number of burgers they place on the tray. And that person is why I didn't feel a 5th star was warranted. And it's a shame because the first we dealt with was very courteous and professional.", "author": "Tony C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-05", "description": "visiting nyc and this was on my to-eat list. Yup - the burger was delicious. Don't bother with the cheese fries - you will be disappointed. Also, I thought it was expensive and don't think I'll go again. We went on a gorgeous summer day and the place was jam packed. It was one of those 'everyone split up \u0026 spread out to hunt down a free table' kind of day, but from what I've heard this dumbo location is almost always that way. There was a bit of a wait for our food and no real space to wait for it. People were standing in front of the soda fountain, right next to the ordering line, kind of all over the place..despite being given those beeper thingys. Why people why", "author": "Maliha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Came here on a hot day but the heat was so worth it!! It's so close to Brooklyn Bridge Park and has the best burgers ever. Totally worth the price and the inside is so cute and the lines are really short, I loved it.", "author": "Sylvia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Veg shroom burger was really good. A little greasy but not bad. \n!Beware of molten hot lava cheese fried inside! \nBlack and white shake was the best. \nQuick, tasty, and awesome views in the area.", "author": "Crystal C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Hello Ben! How are you? I appreciate your apologies for my experience, but just know that it was only my meal that I was dissatisfied with, the employees there were top notch and very kind. This is the only time I've ever had a negative experience with Shake Shack's food.", "author": "Mariah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "It's right across (well not any more since it's been sold) the Watchtower Building (Brooklyn Bethel) and they have amazing food. The first time we came to NYC my sister said this was a go to place (we first heard about it because of the movie \"Something Borrowed\") this place is amazing, and I definitely had withdrawals when I came back to LA, I'm glad that they opened up the new Shake Shack here in WeHo for me to try.\n\nIt's like In N Out, and 5 Guys combines x's 10.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Dear Shake Shack,\nI've tried you and am now forever changed.\n\nIs it strange to say my goal is to visit every Shack in the world? Or is it ambitious? Maybe a little bit of both? \n\nI'm glad I discovered your Brooklyn location after walking across the Brooklyn Bridge with some friends. I was desperate to try the Shack Stack burger, as it came highly recommended from a fellow Shack enthusiast. To wash it down, I ordered the Shackmeister Ale, which is brewed exclusively by Brooklyn Brewery for Shake Shack. How authentic and cool of me to drink that beer in Brooklyn, haha. \n\nShake Shack, I spend my days thinking about you. As a visitor from Detroit, I highly encourage you to get here soon. It'd be a hit and I'd be your #1 visitor. \n\nLove, \nAlex", "author": "Alexandra K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-29", "description": "Good food, bad service. After waiting 10 mins to place my order, my cashier DENISE was clearly annoyed to take my order. As I tell her my order, she turns to converse with the cashier next to her. When she is finally done with her conversation, she looks back at me, still annoyed and tells me she didn't hear what I said and acts like she is doing me a favor by taking my order.\n\nI have worked in customer service all my life. No matter how difficult your job is, the goal is not to piss off your customer. If you can't stand the heat, get out or get an attitude adjustment. \n\nI also ordered a double ice cream-- when the server gave it to me the ice cream was already dripping all over the cone and down to the floor. Part of the cone was also broken, no apology or anything. \n\nExpect to wait at least 20 - 30 mins for your food from start to finish.\n\nIF YOU ENJOY RUDE CASHIERS AND RUINED FOOD, THIS IS THE PLACE FOR YOU.", "author": "Nana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "My first Shake Shack experience. Crazy busy but the staff handled it well and it was a reasonable wait time. Delicious food. Worth the wait.\n\nMy only complaint is that on a busy Saturday there isn't much space for people to wait for food in the restaurant and so getting back in to pick up food is hard work.", "author": "Kelly E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "The food is amazing.\n\nBig turn-off:\n\nThe lines for the restrooms are way too long (expect 15 minutes).\n\nThis is probably due to unisex bathrooms in combination with all the tourists...", "author": "Stefan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "The most delicious burger I've ever had!!! Hands down. I love the shack burger and the shackmeister burger. Shackmeister has frizzled onions on it!! \nI've tried most things on the menu and never been disappointed!", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "Maybe I just come at the right times, but I've never had to wait in a long line at this location. Service is quick and food is great! I feel like the fries at this location is particularly crispy compared to other locations. I recently tried their new chick'n shack and I have to say that it outdid chick-fil-a. It hurts saying that since I'm from Atlanta but gotta speak the truth.", "author": "Haena Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "This is a Good inexpensive non gmo burger joint. I have no doubts of coming back everytime i'm in NYC.", "author": "Johnny N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "What a fun burger experience! First time at a shake shack! This was a spacious Brooklyn restaurant with fun decor. The bigger was good and the shake was awesome!", "author": "Jen T."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}