{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "First time ever at a Shake Shack.  Busy time of day but service was relatively quick and the food really good.  The burger was great and the fries were cooked through and crunchy.  House draft beer was good as well.", "author": "Danny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "4 stars for food and the extra star is for the view...Im not a huge fan of shake shack but 2 things got me to this one...the view of the brooklyn bridge and they have wine...The food to me is okay...My kids enjoyed their milk shakes.  the place is kept extremely clean and well maintained...Its def a place to go too off season because during the warmer months there is no way you are eating there without waiting in line for 2 hours (which to me isnt worth it)...We will def go back...my husband loves shake shack..", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "Closed at 6:15pm for a private event. No postings online or information. Traveled a long way and the restaurant is closed to the public. Not cool.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-21", "description": "Overpriced generic burger. For the price go to five guys; for the burger type, go to Wendy's", "author": "Luigi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "Place was mobbed Friday night. Had to wait for a while to get my order but it was really good. Got the shroom burger, fries and milkshake. Expensive, but the food was good and after a long evening exploring the brooklyn bridge park, I was hungry and didn't care much for the price.", "author": "Victor B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Same formula, different locations.  The food here is great, the burgers are juicy and the fries are excellent.  Even the hot dogs are good.  The food is consistent in all of their locations.  A nice bonus to have public outdoor seating in the plaza area on a 1st come basis.  The lines can be a bit hectic given the location.", "author": "K. C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "This is based on one visit. Saturday around 3:30 pm. Pretty crowded but not hard to find a table. Menu is large and a bit overwhelming with so many people i felt rushed and didnt have time to look at the different items. Workers were all very nice and professional. Waiting for my food i noticed there were several orders coming back as incorrect or people complaining that their order was not what they expected. The worker helping them was very accommodating. I ordered a regular burger fries and a strawberry shake. The burger came plain with no lettuce pickles tomato or onion. I had to ask them for those on the side. I noticed in the description of a burger that it had \"shake sauce\" or \"shack sauce\" which i assumed was some variation of thousand island as they all are. When i went to ask for some a girl stood there and looked at me like i was speaking a foreign language. Granted i asked for thousand island, she said we dont have that, i asked for a sauce they put on the burger, she said no we dont do that, then i said the magic words \"shake sauce\" and she said oh yeah we have THAT! Pretty great in my opinion. The burger was delicious. It was warm soft and sort of melted in my mouth. The sauce is some sort of thick thousand island flavored mayo. The fries were ok. The shake was very thick and silky. I would recommend it for a good burger and good people watching.", "author": "Joseph G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "foods great but seriously, falling in line for the restroom sucks, im like literally in line right now doing this review.", "author": "Paolo M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}