{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-18", "description": "So good, so affordable, so much better than the 5 Guys, Smash Burger and 67 Burger that I have to pass on the way to get here.  Also, unlike every Manhattan location of Shake Shack, I've never seen a line longer than a few minutes at this location.\n\nI LOVE the burgers.  So juicy and flavorful and fresh.  But what really sets this place aside for me is the shakes in an endless rotating variety of flavors.  Plus they have Brooklyn Brewery beer and delicious cheese fries.  I'm sorry but the only way to make a proper cheese fry is with cheez-whiz and this place does it right.  \n\nThe best quick lunch or dinner in downtown Brooklyn, hands-down.", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-03", "description": "HooRay Burgers!\n\nMy wife loves cheese burgers and had not been to shake shack yet. After nursing a wedding hangover most of the day we strolled over for burger and shakemeister.\n\nWhat can I say as I passed the gold grills and plastic covered sneakers Shake Shack is as home here as it is anywhere else in the city. It was filled with families, workers and NYPD. And two hungry hungover people!\n\nShe loved it, I loved it. Glad its in my borough!", "author": "Pete R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-05", "description": "While a shake shack is a shake shack (great, of course) the service here was great! A woman walked around, asked if we were satisfied or had any complaints, and cleared our table for us. So nice.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "I haven't been a burger person till recently so although I've heard of and passed my fair share of Shake Shack's I've never felt a strong desire to go in.  Well clearly that changed and I wanted to see how they ranked against other places I've visited and if its worth the hype.  The burger was simple but delicious.  I hate to say it but the real star of the show for me was the dark hot chocolate.  Holy mackerel!! that hot chocolate was beyond amazing.  I didn't try the fries, they seemed pretty standard and I'm not a big fry person but that hot chocolate will get me back in there so I might try them next time I go.", "author": "Samantha U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-20", "description": "Very RUDE service towards close, twice in the last month or so they have rushed me and other patrons out well before closing time since the workers are anxious to leave. They take your trays while you are still eating, and in my case, I was condescendingly treated by the young fellow cleaning tables. IT USED TO BE BETTER PLACE. I live down the street and have been coming for years but I will never return....", "author": "DJ D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "Yey! Shake Shack Brooklyn edition!  The line isn't half as insane as any of the NYC locations and the burgers are just as yummy!  Some of the tables are awkwardly cramped but this is New York so my personal space expectations are automatically lower then when in any other city.  \nHonestly, I have never truly understood the hype behind shake shack.  I mean the burgers are tasty but so is a York peppermint patty.  Maybe it's the shakes or the custards or the special shack sauce.... Who knows, but it works. \nI'm not a fan of the shroom burger which is deep fried beyond recognition and stiffed with an insanely gross amount of cheese, yet lacks a lot of flavor... the fries are tasty (with the cheese sauce too)\nWhile the prices are little more than you might expect to pay for a burger and fries, by fast food standards, there is no comparison.  It's good.", "author": "sarah e."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "I have been to several Shake Shacks in the NYC area. It is always a 5 star experience. The staff at this particular Shake Shack was so nice. A couple of friends of mine ordered some food to go. They ask you if you want the burgers packaged in a way where the bread and veggies won't get soggy. Also for some reason or the other they took a long time to make an order of food and apologized by hooking up a free milkshake. I didn't even mind the wait. It wasn't busy when we walked in but it did after we ordered so I understood. Shake Shack, one of the best burger spots in NY hands down.", "author": "Eric R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "Today I finally summoned my inner fat ass in order to see what is all the buzz about a small but famous burger joint called \"Shake Shack\". I've heard of it before since I used to work near one and the line was huge. So, I opted to stay closer to my place of residence and visit the one in Downtown, Brooklyn. \n\n          Now, after years of eating trash I've been cooking up my own food and watching what I eat a bit more since I want to live a healthier lifestyle while being there for my family. But, on occasion I do have cravings so here it goes... \n\n         The first thing that caught my attention seconds after entering is the cleanliness of the place. It was very, very clean. Even the bathroom was tidy. There are tables made from recycled bowling lanes so that gets a star right there for preservation. Even though it was slightly crowded the Staff handled their business quickly. We even found an empty table very quickly. Now let's get to...\n\nTHE FOOD\n\nSHACK BURGER: I had the Double Shack Burger which is 2 fresh made-to-order patties, fresh tomato slices, fresh lettuce, fresh pickles, fresh onion on a slightly crisp bun half wrapped gently in a white wax paper covering. Very good tasting burger with very fresh tasting toppings. You can tell that they cut their veggies fresh each day. The crunch that they gave each bite was very satisfying. I am one happy campy...full off of 1 burger but still a happy camper. \n\nFRENCH FRIES W/ CHEESE: Yeah, yeah, I know, I know...I should have stopped while I was ahead but I can't say no to good ol' cheese fries. The fries are the classic crinkled variety covered with a pretty good cheese sauce. I had a side order of it for the fries on the bottom that never get covered in sauce. They were good, not disappointing at all. \n\nPBR: That's right, besides the usual slow sugary death of carbonated drinks they also have a small variety of beer that you can add to your order as well. Finally, fast food for adults. Damn right I enjoyed my cold Pabst Blue Ribbon :) nice and cold just the way that I demand it. \n\nOVERALL: I like the place but I can't eat like this everyday or my cholesterol will be in the upper 500's. The good thing is that everything is made fresh which is a big plus so I can't complain about that. I will come back once in awhile to cure my fast food cravings though. I definitely suggest that you give this place a try. Decent prices for fresh food is not an easy find but hopefully it is a sign of more great food coming to New York City.", "author": "Brian P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-16", "description": "I wanted to see what the hype was about, so I decided I'd take my little sister out for lunch, we decided to come here! I ordered the shack burger \u0026 it was SO salty, my god ! Not to mention that my burger wasn't cooked well, the middle of my burger was red!!!! Shake shack left a bad taste in my mouth , idk if ill be back !", "author": "Sasha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "Just coming to this page is making my mouth water! \nI ordered their single Shack Burger and prepared to eat it without my gloves in the dead of winter. I was blown away! Their shack sauce is what makes it special and damn it was good! Pricy for a burger but so worth it!\n\nI really want a burger now!", "author": "Ivy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "First shot.  Wepa,  coño.  That was crazy delicious...  I had the Shack stack which was the mushroom burger with the house burger.  Very good,  but I literally left the regular burger to try the mushroom burger a second time.  What an awesome meal...  I also did the urban lumbershack.  Everything on point.  Great job!", "author": "Mike F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "Delish! \n\nPretty excited that Shake Shack has come to Bklyn. The new location is dangerously close to our apartment, and I see many a shack burger and shake in my future. I thought the fries were actually better than the ones I'd had previously, likely due to the fact that it was busy but not mobbed @ this location. I don't know if we got lucky, or if the crowd factor will just amp up the longer the new spot is open. \n\nAlso, apparently I'll be trying the salted caramel milkshake soon!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-02", "description": "I liked the  concept of shake shack with the pagers the food is good and you can grab a beer but for what u pay you i had to have them fill my cup up on the shake because half way is really not gonna cut it.", "author": "Ooooo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "SHROOM BURGERS! YUM!\n\nA bit pricey, but how can you say no to taking a bite into a deep fried portobello mushroom with cheese oozing in your mouth!? \n\nDelicious, but probably one of the most unhealthy vegetarian burgers out there!\n\nAbout $7?", "author": "Hoy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "I have been wanting to try Shake Shack for years.  I have heard so many good things.  So on Friday, after walking around Brooklyn Heights I happened upon this Shake Shack and it wasn't as crowded as the others and there was no crazy line or wait.  So I stopped in and ordered the Shake Shack burger \u0026 the fries.  I was so glad I did! The burger was definitely one of the best burgers I've ever had.  The  fries were pretty tasty too.  I didn't sit down and eat here because it was still pretty crowded and it was a nice day outside, so I just went outside and found a bench with a bit of shade and that was nice.", "author": "Karen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "So good I had to see if the hype was real.  Believe the hype!. This place has it all from burgers to wine! I can see why the lines in the city are around the block and if this juicy tasty burger remains the same, lines will start at the brooklyn bridge! \nA single will suffice any person, believe me I began with two burgers but halfway through I was filling out my new sweater.  If you get all the trimmings, a single, fries and a must shake will fill you up.  I have been to some of the best burger places from LA to NYC.  My first choice, 5 guys is at the top but with the summer coming i may need to shuffle the list.  Ps. the fries through word of mouth may not win any awards, but just remember our mothers gave us the same fries we devoured except she put them in the oven?  Take my advice they are good and taste even better drowned in you guessed it... ketchup!!", "author": "Robert J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-10", "description": "Upscale \"McDonolds\" at a premium price. They don't even offer cheddar cheese. American only at this establishment. The chocolate shake was great, but how can you mess that up? Double burger with small shake for $13. You can do way better else where.", "author": "Jonathan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "Maybe I'm blinded by the almost excessively pristine branding (triple-filtered water, tables made out of recycled material, the overarching yuppie/urbanite vibe), but Shake Shack is probably the best fast food chain I have ever eaten at. They don't have it my city, so every time I'm in New York (or Chicago/Boston), I always go out of my way to stop by, because this is ultra-simple food done very very well. Shake Shack will set you back a fair bit more than your typical burger joint, especially considering how the go-to item (the \"Shack Burger\") goes for $6 and can be consumed with ease in about 45 seconds. And it's a bit hard to comprehend why it tastes so good; the meat is juicy but incredibly lean and nothing but lettuce, tomato, and the subtly tantalizing Shake Sauce sits on top. However, it all makes for one abundantly satisfying meal, a rare fast food experience that comes with no regrets. The fries are crinkle-cut, and considering my long standing bias against crinkle-cut fries, its a bit strange that no meal feels complete without them. The shakes are quite expensive (also $6) considering the size of the cup, but if you get them malted they are thick as fuck and you will definitely have had more than enough. Of course, the shakes are super tasty too, and Shake Shack typically has some dope ass concoctions (when it went, the special was the \"Frankenshack\", which had a very unique and exceptional marshmallow texture). Also, don't overlook the \"Shroom Burger\", a fried Portobello burger where cheese gushes with each bite. No matter what you cop (except maybe a hot dog), you'll enjoy Shake Shack; it's very hard not to. You'll feel like the shit when you eat there because its aesthetic is quite well executed and the food is slick. With such elementary items and such good taste, it's easy to think you're being deceived. All I know is that Shake Shack never lets me down! Awwww!", "author": "Max T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "I've eaten at the Citi Field Shake Shack almost a dozen times, and three times at this Shake Shack.  Each and every time, the food does not disappoint.\n\nEach time I was at this Downtown Brooklyn Shake Shack, the lines were moderate, the wait was long (maybe it seemed long?) and it is hard to get seating.", "author": "D J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-29", "description": "Good burger and good fries.  \n\nMy only problem with this place is with the chocolate shake with malt I had ordered.  My shake had huge chunks of malt in it.  It was gross and I couldn't finish it.  This place is called Shake Shack.  You'd think that Shakes would be the one thing that they would definitely get right.  \n\nOverall, it's a nice restaurant and a great addition to the area.  I just don't know if I'd go there again over 5-Guys if I want that type of burger.", "author": "Lonnie James L."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}