{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "Great burgers and ice cream. Dany meyer has done it again. The fries are nothing special but good. They have a very consistent timing ~10 min after you order, because it's fresh. The line is never as a bad as the one in madison park.", "author": "Corey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-14", "description": "there is nothing wrong with shake shack. there is not a single thing wrong with this place!!!\n\nburgers are consistently fantastic... every time i eat the double cheeseburger, i want to get back in line and eat another one. this is definitely ranked in my top 3 favorite burgers. cheese fries are also crazy delicious. cheese wiz over crinkle fries... so. good.\n\nfor the vegetarians out there, the 'shroom burger is equally amazing. a fried portobello mushroom stuffed with muenster and cheddar... theres also a version where its stacked on top of a burger (shack stack) and i definitely feel like my heart stops after i eat it, but i suppose its worth it.\n\nthe location for this is great, less lines than most of the other shake shacks. also plenty of seating!", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "what a great place.... First time coming here- was dissapointed about no seating, but after having the food I didn't mind. I had the chicken burger (forgot the name) and cheese fries everything was fresh !!! A bit pricey but fresh food and cheese everything was great.", "author": "Ali C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-17", "description": "The burger was salty in my opinion. Food was ok good service with a clean establishment. Great location with beer shakes and burger and fries. Will re visit sometime soon.", "author": "Gabriel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-06", "description": "This place is excellent. The line isn't that bad. the service was quick.. the staff were really nice. the prices is decent..\n\nVanilla Milkshake--  its sooo  good . i luv it!!!\nCheese fries -   Excellent and it is delicious!!!! I love it!!!\n\nThe angus burger -  it's delicious", "author": "Laura H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Do ask questions. Just go here and eat something. I'll join you. Shakes are small and so freakin' good. Burgers are meaty and delicious. Bring a friend.", "author": "Dennis L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-24", "description": "I had the hamburger for $3.60; the bun was greasy, with little flavor.  The thin, weird looking meat patty was greasy too.  I also had  a hot chocolate for $3.50 and the cup was only 2/3 full.  I felt a bit sick after my meal.  \nI would have been just as happy going to the Burger King next door and the starbucks across the street.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-28", "description": "Shake Shack, you are racist, a friend of mine with a very ethnic name orders a burger and the two girls laugh at her name when they give her the burger. Racist. Her and I will no longer be going to Shake Shack, we were shocked to see such blatant disrespect.", "author": "Sara J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "I still prefer Five Guys but when it comes to the quality of the patties and buns, ShakeShack takes it. Everyone should try the Shackburger, I always get a double.  The Shackstack with the portobello mushroom is also really good.  The concretes are delicious as well. This location is the fastest of all the ShakeShacks I've ever been to.", "author": "Hanssy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-18", "description": "Shake Shack, I just don't get you! Perhaps it's my west coast upbringing and the fact that I'm an In N Out fanatic, I just don't understand what all the fuss is about. The burgers are mediocre and the fries aren't even crispy. I do like the mushroom burger which is tasty and cheesy, but everything else I've had has just been meh.", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-22", "description": "Crinkle cut fries! Potato bread! Thick shakes! Red Velvet ice cream! Yummy burgers in nostalgic wrappers! But no bacon and choice of cheese :(", "author": "Tracy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-22", "description": "Oh Shake Shack, once again you have spoiled me with your wonderful cheese fries. Delicious! Happy to have you in Brooklyn.", "author": "Jo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-20", "description": "Up to date these are the best burguers in NYC. \nFor this location: you can get a place to sit on holidays and weekends during midday.\nIt's kind of loud, but not as terrible as the location on UES (86th)", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-24", "description": "After much hype and praise from friends and fellow Yelpers I took the plunge and tried Shake Shack. I was on Jury Duty and had missed breakfast to make it to the courthouse on time. So, needless to say I was famished. I walk in and look at the long line, I had been prepared for that. I waited and waited. I finally ordered- a smoke stack burger with a chocolate milk shake. Sounds delicious right? At least that was one other I had been prepared for- deliciousness. It was sadly, not to be had on this day. I bite into my burger. Almost tasteless. The burger was fire hot, the sauce was ice cold as were the vegetables. Somehow, not a good combo in my mouth. It tasted like a hot/cool mix of nothingness. I go for the shake hoping it will save this experience. Nope, no bones there either. It was liquid cold fat. The chocolate flavor (what the hell do they use, chocolate air?) was barely there. All I could taste in my mouth was the thick taste of fat, as though it had been made with heavy cream with a little scoop of ice cream inside. I knew I shouldn't have done this, but I had to try it after all the hype. All I can say is utter disappointment. I shall not return even at the request of loved ones.", "author": "Will R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-02", "description": "This last time I went both my burger and fries were exceedingly salty! What's going on? It was not like this when you first opened. Let people salt their own fries if they so choose! Also, what is with the lily white suburban emo rock they put on? Play something more fitting to the neighborhood. This is Brooklyn after all.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "Shake shack, how I miss you! Just good ol american burgers. Something about them are oh SO good. I heart getting the burger with the chipotles in it, it has a nice kick. Depending on the location, there can be lines out the door, but this location is usually pretty good. A definite must try when in NY.", "author": "J L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-24", "description": "Oh the fattiness.  For 7.95, got an order of fries, semi hot and fresh burger.   Tastes better when you eat this in the summer time.", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-02", "description": "When I'm in downtown Brooklyn.  I can't help myself.  I have to take advantage of the fact this shake shack has no lines...I give in to the shake shack craving.  I'm getting hungry right now as I write this review.  Also plenty of seating and a good location right off the subway.  Only pluses...minus is that I don't live here.", "author": "Grace H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-11", "description": "Good lord.  I paid for the double cheeseburger I ate for 2 days, but it was so worth it.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-12", "description": "I heard a lot about how good Shake Shack was..so I finally gave in and decided to give it a try after having lived in New York for 6 years.\n\nVerdict:  this is the worst case of people jumping on the band wagon where its high reputation is clear is NOT deserved.  Come on folks....the burgers are really no better than McD's, Wendys or even BK.  The burger is topped with nothing special.....your basic tomatoes and lettuce...with a slice of processed cheese. Bleh!  Over salted patty.  Fries: basically tasted like McCains frozen.  What about the famous shake - melted vanilla icecream.  All in all waaaaaaaaaaaaaay over hyped for the price.\n\nFor my hard earned dollars...Five Guys is a way better burger....and fries.", "author": "Dina B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}