{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-06", "description": "After eating at the shake shack in the city\nI decided to try the Fulton location because I was in the area. I was sooo disappointed!\nMy shack stack was horrible, the beef patty was so over cooked it was just dry and very crispy, well beyond the point of being overdone. The portobello mushrooms which is usually yummy had a strong taste of raw garlic. Don't get me wrong, I love garlic just not during a work day when you have to meet and speak to people. Garlic breath iOS just a Nono.\nInconsistent, I expected much better from a $10 burger, the fries were just ok, the cheese sauce was just plopped in the middle which left most of the fries cheese free, which totally defeated the purpose of ordering the fries with cheese. Either put the cheese on the side or spread it all over the fries. \nA very disappointing experience.", "author": "Leah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "Omg, I love this place. My son and I had the Shack burger, I had single he had the double, with French fries. These burgers are mouth watering, well seasoned, and soft buns.All the staff where very friendly.", "author": "Shorell S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "I've reviewed the Times Square one. \n\nThis is the one that is closest to my home so I figured that it's time to give them a review. \n\nI came here with a friend a few weekends ago. The food was the same as the Times Square one, but I like this location better because it is smaller. Normally that would be a bad thing, but in this instance, it's fine. My food arrived on time and the customer service was decent. If I had to decide whether to go here or to the TS location, I'd choose this one, but that's just me. \n\nIt's much less touristy that 42nd. I regret not getting the cheese fries. My friend and I decided to share fries and she didn't like cheese so...but overall the food is actually really good.", "author": "Emmy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "I ordered a Shack burger and a peanut butter shake. The burger was good but because the calorie count was so high I didn't eat the bread.  Although I only had half the shake it was sooooo yummy, it was rich and creamy and the peanut butter flavor wasn't overkill.", "author": "Sabrina Diamond J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "Really good damn burgers!!! Really good hot dogs! Really good milkshakes! This place is the truth! But... Be mentally prepared to wait on a long line depending on the time of day you visit this place.", "author": "Troy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "This new Shake Shack's in dangerous proximity to where I live and go to school.  \nDangerous for my wallet, waistline, and arteries, but I just don't care.  \n\nLove the burgers and cheese fries, and please do yourself a favor and get the Fair Shake--vanilla shake blended with coffee.  \n\nThankfully the lines aren't as long as at other locations, and I've been pretty lucky in finding seats, even at peak mealtimes.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-05", "description": "It probably is just me. I feel pretty guilty eating their fatty and super expensive burger. It can be yummy but I'd rather just get five guys... Much more laid back and unlimited drinks (soda)! I guess for people who want the $$ feel as opposed to the $ feel, they got good burgers. I do have to say their milkshake is a huge rip off. It tastes just like the mr. Softee milkshake... But is a whole lot more expensive. I think I will just crawl back to my rock now!", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "Shack shack has everything I want in a cheeseburger. Soft, slightly toasted bun. Juicy, salty burger made from REAL beef. A little bit of veg for some crunch. The option to compliment said cheeseburger with a knock-your-socks-off milkshake. Handed over to you for prices that don't brake the bank. And now? Now it's a few blocks from my home. THANK-YOU-DANNY-MEYER!\n\nThis shack doesn't seem crowded yet, but I'm sure the lawyers will discover this amazing lunch option soon. Luckily for me the crowds leave Downtown Brooklyn right around dinner time :)", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-13", "description": "Shake Shack is synonymous with long line. Not even the new Brooklyn branch escapes this infamous blessing/curse, though the wait time is significantly less than its older Manhattan burger brethren. Optimally located in the crux of the downtown BK bustle, one would think it would be crazier than it actually is - especially if you've experienced the all too lengthy coil at the original in Madison Square Park with a reputation that precedes it.\n\nSo with a Burger King right around the corner where you can get the same grub for fewer bucks, why are people still waiting in line and paying top dollar for a combo meal here?\n\nFor starters, the aesthetics. Smooth dark gray stone panels the walls, top the tables, and line the floor to ceiling windows as an eating bar, while pointedly casual yet rustic wood slabs serve as bench seating. The retro cursive font on the illuminated menu fondly hearkens to the fountain shops of old, wrapping a soft cushion of nostalgia around that pricier dollar sign.\n\nAlso, quality is touted as a step up with all natural, hormone-free angus beef, trans fat-free fries, and artisan custard shake flavors like thin mint, red velvet, salted caramel, and cinnamon cream cheese. With a selection of wine and beer to boot, Shake Shack is ironically no shack at all - but rather raises itself from burger joint to gastro-grub.\n\nThe anticipation index is amplified at this location with a buzzer you receive when placing your order that vibrates when it is ready. As soon as those blinking lights flash, there is nothing more rewarding than trading it in for what you really came for. Mind games? If it enhances the enjoyment, so be it.\n\nMy taste buds were elated with my combo complete with a standard hamburger adorned with the requisite veggie fixings, crinkled Yukon fries, and the fancy Fair Shake (vanilla custard combined with fair trade coffee - it was Sunday brunch after all.) The flattened palm-sized burger patty was greasy but flavorsome layered with tomato slices, softened onions, tart pickles, and a fresh curled lettuce leaf. The bun was a sweet surprise, perfectly understated as a thin plush pillow to hand-hug the ingredients.\n\nThe fries were nothing to write home about (mine were on the soggy side, but my guest got a crispier batch), but adequately functioned as the salty foil to the creamy custard shake. Thick at first (perfect for fry-dipping), once that cream defrosts it slides up your straw at a speed your tummy may regret later. But in the moment, it feels so right. The Fair Trade is definitely fair game for the coffee-lover, but the blend of strawberry and chocolate my guest whipped together was a winner. (Yes, you can combine any plain flavors that please your palate.)\n\nWhen you get down to it, a burger with fries and a shake is fast food combo staple that satisfies to the same degree, no matter the price tag or wait time. Shake Shack elevates both above the status quo, but you will be content with what awaits you at the end of the queue.", "author": "Rebecca K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-31", "description": "Delicious burgers and fries. Sorry West Coast, but Shake Shack is better than In-N-Out in my opinion.", "author": "Eugene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "It is a battle between Shake Shack and Five Guys, but as one who Shake Shack is 2 blocks away... Shake Shack wins all of the time. \n\nThe burgers are cooked well to perfection as Chef Gordon Ramsay would say. The sauce.... is to DIE FOR! The fries are my guilty pleasure and I am NOT a french fries person. \n\nI honestly haven't tried any of the shakes as I am lactose intolarant and also have never been a shake person. But I will try and just \"zip\" on one soon.", "author": "Beautiful Badass E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-17", "description": "Shake Shack is all that and a bag of chips!  \n\nI've been pretty lucky when it comes to the line situation.  The longest I've had to wait was about 8-10 minutes.  Love the 'Shroom Burger and the ShackBurger with that mmm mmm good Shack sauce, and I had the Bird Dog (chicken apple and sage sausage) Frisky style (frank stand onions).  But the crinkle cut fries??? off the chain!  I have yet to try the shakes and custard, but I'm sold so far.  And I'm even more sold about the fact that my food held it's heat on my 20 minute drive home.", "author": "Ava H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "So apparently a Shake Shake that doesn't have mile long lines and actually has reasonable turnover in terms of seating exists. Madness. I seriously waited less than a minute to place my order, received my burger and shake in 5 mins or less, and found seating without having to hover over a family trying to eat their meal in peace in the meantime. This was on a Saturday afternoon during lunchtime, no less. If only all Shake Shack experiences could be this speedy. As always, food was delicious, and in addition to their indoor seating, they offer outdoor seating as well. A great option if you're in the area.", "author": "Christina F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "The burger is soft and delicious. The Fries tasted very good too. I ordered a single Shackburger and it was quite enough for me.", "author": "Dee D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-10", "description": "I've been to the madison park location many times and was expecting it to be just as good here. Unfortunately it's not. I got the shack stack as usual. The patty is not as juicy here. It was more on the drier side. But there wasn't a long wait, which is a good thing. I would prefer to wait on a longer line for a better burger at the madison location.", "author": "Samantha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "Best burgers, as they are always juicy and full of flavor. \n\nMy usual is the shack burger and fair shake. Shakes are pretty overpriced for the small size they come in, but are yummy nevertheless.\n\nLocation and indoor seating made the experience even more enjoyable.", "author": "Alice Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "First time at this one yesterday. Usually I'm hesitant about going to shake shack because of the tremendously long lines, but it was around 4pm on a Sunday and we waited maybe 10min for our food. It was great. The employees were very nice and the food was great. Can't wait till they bring back the crinkle-cut fries though!", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "A Shake Shack Haiku:\n\nSalt and fat flavor\nToo much can be a bad thing\nShake to the rescue", "author": "David H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-17", "description": "Sure the burgers, fries and shakes are noteworthy but is it worth navigating the post-church crowd on a Sunday? Mayhaps! The staff were friendly and helpful, including wiping tables between guests, and everything was as advertised. Stick to the standard burger, however.  The Shake Stack is far too confusing to handle for a hamburger.  If you want to avoid tourists and strollers, try the 5 Guys on Montague instead.", "author": "Jason A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-31", "description": "Wow!\nWith all the burger joints in NY you would think this place can't compete....but they clearly are the best!\n\nThe place was crowded, but if you wait long enough a table becomes available.  If not, take your food to go. \n\nI had a single cheeseburger \u0026 a black \u0026 white shake.  OMG!  It was pure heaven!!\n\nThe cheeseburger was really well made.  I love pickles on my burgers, but passed on the onions.  It was delicious!  Really well made.  Very juicy \u0026 fresh \u0026 just amazing!\n\nMy shake was a little slice of food comfort heaven!  It only made my meal that more wonderful!\n\nThe staff were very friendly \u0026 welcoming.  And there were people quick to clean up after us when we finished eating.  \n\nOverall, great place.  Definitely high ratings for the amazing food \u0026 friendly service.\nCan't wait to go back!", "author": "Traci R."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}