{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Shake Shack . Thank you for your delicious crinkle cut cheese fries.  Little did I know your fries look appealing to the eyes than the straight cut ones and tasted yummy.  For a west coast girl , you got me at your fries . Don't get me wrong ! I loved your burgers selection with its delicious amount of variety I ordered just the bacon burger and it was delicious as well but In N Out still owns my heart.  If there was a place in nyc to get some good burgers and fries it would be at Shake Shack. \n\nEnvironment :: upon arrival the place was clean and they even have table sanitization wipes for your convenience.  If you need to use the restroom , use the code at the bottom of the receipt !\n\n\nP.s. Try sitting near their fire place it is a cute corner LOL", "author": "Tiffany G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "Yawn.  I heard so much about this place and was excited to try it.  What a disappointment.  The hamburger was meh, the fries were good, the shake was good, the service was lacking, and the prices are ridiculous.  The good news is, I can now say I've tried it.  The bad (or good, depending how you look at it) is, I'll never bother with it again.  There are WAY too many other good burger places out there.  Peace.", "author": "Robin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "Um it's a shakeshack, you can't go wrong with shakeshack, it's already an automatic 4 in my book. What makes this location better is its space - wayyyyy bigger than all the other shakeshacks I've been to. On top of that, in the summer there are also tables outside where you can sit and eat. You can't beat that. \n\nAlso, it's less than 5min walk from where I live. I mean...", "author": "Lu H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Don't let the line of hungry visitors deter you, these folks are quick and efficient and keep things moving. \n\nWe got our usual order - can't go wrong with a Shack burger and fries. There's just something about it. It's just ... delicious. \n\nOf all the Shake Shacks I've visited, this was probably served the sloppiest burger. The fixings and condiments were all there but appeared to have been thrown into the patty too quickly. My burger was also a little pink in the center. Which I know doesn't bother some, but I need mine cooked through. Given that, this was the first Shack burger I didn't eat in its entirety. Sinful. \n\nSeating was limited with the crowd, but not impossible. We opted to take our food outside and snagged a spot in the nearby park. People watching galore and great sights to see. The river, the bridge, the park. You can't beat this location. \n\nI'm a fan, always have been. Giving this spot 4 stars because of location and efficiency. Closer to a 3 for the burger today though.", "author": "Katie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "I planned this trip to Shake Shack as the ultimate \"New York Trip.\" Coming from Long Island, there was no need for me to travel to the Brooklyn Bridge, walk over it and go get lunch. Now that I am in JC I can do just that. \n\nAfter my boyfriend and I walked across the Brooklyn Bridge we decided to get Shake Shack. I have never had it before, so I was really excited. I ordered a burger, no cheese, lettuce, tomato and onions. I saw someone with pickles on theirs after the fact, so I would have gotten pickles if I had known. I also had the fries and a cup for water. All together was $8.20. \n\nThe burger bun was not what I was expecting, but it a good way. It almost reminded me of a McDonald's bun, but 100x better. The burger was a bit cold for my liking, so that is the reason for four stars. \n\nThe fries we SO GOOD! They were crispy, salty and hot. They still had that potato flavor too. Shake Shack has Heinz ketchup and as a ketchup fanatic, I was very happy to see that. \n\nThe staff was very kind and helpful. Before we sat down, (yes we were able to get a seat on a Saturday afternoon) one of the staff members cleaned off the table for us and then took our trays after we were done. They were very polite and charming. \n\nI will be coming back post lent because I really want to try one of their shakes. I LOVE shakes, so I will be returning- probably to a different location closer to me.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "Good Burger. Great Hot Chicken sandwich. Decent fries.\n\nAt 2:30, still a line out the door, I guess I get it.  Coming from the land of In-and-Out Burger, I get the hype. It was a good meal with fresh ingredients, hmmmm...not too bad. Deep down I wanted to not like it, but it's Burgers and fries, how difficult can it be. It was really good. \n\nWorth the hype and the line???  maybe not. But not half bad.", "author": "Steve W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Shake Shack in Brooklyn ! Sitting on prime location right by Fulton Ferry Landing , this is a great option for quick eats when you don't want to wait in line at Juliana's or Grimaldi's.  \n\nWe had the shroom burger  which was perfectly fried portablello mushroom stuffed with oozing explorsion of cheese.  We also got the Chicken Shack which was originally lauched at this location and it did not disappoint! This is definitely the best Fast food chicken sandwich ever ! Moist and Juicy chicken breast that was thick and perfectly fried to a nice crunch.  Flavorful ranch dressing and some lettuce.  There could be more crunch to the lettuce but the chicken was the star.  \n\nThe fries  at shake shack are my favorite ever.  Crinkle cut, super crispy exterior but nice pillowy texture inside.  \n\nOptions of beer shakes concretes and lemonade are always good.  I always get the tart yet sweet puckering lemonade .  \n\nThe burgers are good though seemingly small they fill you up, if you're hungry get a double! This time we only had items other than burgers .  \n\nThis location very much impressed.  Clean efficient  and fresh food.  Crispy crunch on everything !Oh and in the evening a lovely view of the waterfront as well ! \n\nWhy eat at the snooty nose in the air overpriced piece of shitake river cafe when for 10 bucks you can have a good burger and a view.  Yes I've been to River Cafe can you tell lol !", "author": "Nancy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "Loved the food here. Fresh and hot! Im from Cali so people are always trying to compare this spot to In and Out. I personally like Shake Shack better.  All of the spots are super busy so it took a while to find a seat. That is the only reason why o didn't give it five stars.", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "The location itself is great, it's right across the street from the pier. The store is spacious and there is an adequate amount of seating. Truth be told, I only visited this location to try their ChickenShack, otherwise, UWS and Madison Square Park all the way!\n\nThe food:\n\nChickenShack- Crispy chicken breast with lettuce, pickles and buttermilk herb mayo. I thought the ChickenShack was decent, I thought the breast could use more flavor, the pickles were the predominant flavor and it was too aggressive for me and the buttermilk herb mayo was basically nonexistent. The breast was nicely fried and it had a really nice crunchy exterior but didn't offer much in terms of flavor. The sandwich was served on a nice squishy Martin's potato roll, which was nice. In the summer NYC battle of the chicken sandwiches, the Fuku sandwich is the clear winner. http://www.yelp.com/user_local_photos?userid=Y_iTTjKvV5hLy-880SZzlA\u0026select=0ItMG4InLNW0Udgh9nt-LA\n\nRoadside Shack Burger- Cheeseburger topped with bacon caramelized onions. This is a new burger that just debuted on July 27th and it was good. It was basically a Shake Shack version of a patty melt. I ordered a double burger and it was nice and juicy and the flavor of the onions were nice but the overall burger was on the salty side. http://www.yelp.com/user_local_photos?userid=Y_iTTjKvV5hLy-880SZzlA\u0026select=D_rGTajZjw8e2kdXlBSxdg\n\nCheese Fries- Topped with our special blend of cheddar and American cheese sauce. OK, so I have ordered this at other Shake Shacks and I have to say that not all of them have the same taste. The one here had a weird consistency to the cheese and it was kinda weird. It seemed oddly thinner and thicker at the same time. Meh", "author": "Ben L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-22", "description": "My burger was undercooked (bright pink in the middle...#notsafe #EColi). The bun was soggy. \n\nThe people who work here are nice and helpful. The woman at the register offered me a tasting of the strawberry lemonade. Service is fine, but I'm not going to eat an unsafe/undercooked burger with a soggy bun.\n\nUpdate: most burgers are cooked medium, you have to ask for it to be well-done. Unclear why no one asked me my preference at the register.", "author": "Monica V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "YES! Finally came back to NY to try the CHICKENSHACK which they only have in Brooklyn. \n\nThick crispy coating, perfectly fried. My friend sitting next to me heard the crunch upon biting. It was that fresh. The bread was as soft as it gets and the pickles inside gave it that kick it needed. It was GOOD, I would have it again. \n\nAlso tried the new Roadside Burger (bacon caramelized onions) which was FINE. It wasn't mind blowing but definitely juicy and so soft. I didn't care for the cheese they use. \n\nCrinkle cut fries are a must. They were a perfect ratio of starch and crisp. \n\nI was happy to learn that Brooklyn Brewery design a beer for Shake Shack. The Shakemeister Summer Ale was such a good beer I think it is one of my top ten now. Light enough to make it one of my session ales (I say that now until i have 2 haha)\n\nLines were long but moved speedily. Cashiers were less than friendly, they looked like they hated their jobs. I didn't care for that. Food is overpriced. I don't think their burgers are worth it but once a year I would have it again. Los Angeles has better burgers. Sorry beloved Brooklyn. \n\nI would come back, but not running...", "author": "Graciela C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-13", "description": "A recent conversation with several coworkers of mine wandered into the topic of Shake Shack, and the launch of their fried chicken sandwich, aptly named the \"ChickenShack\".\n\nMe: They're trying to take some of Fuku's market share, since David Chang's newest venture has had perpetual lines since opening. But since they're selling them only in Brooklyn locations and not limiting it to just lunch, it's not a direct call to war.\nCoworker 1: Why can't they just stick to their bread and butter? They make a solid burger and shake.\nCoworker 2: It's all because of the IPO, eff it. They have shareholders to answer to.\n[Insert Cohesive Sigh]\n\nWhile I can't speak to the rationale behind corporate decisions, I will say that Shake Shack's recent one-day launch of their ChickenShack certainly roped me in. The DUMBO location appears to be much less-traversed than any of the Manhattan ones, and even with the hype behind the launch, lines were quickly taken care of and seating wasn't an issue.\n\nI'll cut right to the chase: the ChickenShack comes in at a solid 3.5 stars. The star of the show, the fried chicken patty, is encased in a crisp, well-seasoned batter. The actual white meat leaned on the drier end of the spectrum, though, which indicated just a few too many seconds in the deep frier. The lettuce and sliced pickles added some necessary crunch and contrast in texture, but the buttermilk herb mayo was barely present. I did appreciate the use of the potato buns, but the ones we got weren't properly grilled - and any true carb-lover will understand the world of difference between plain versus grilled or toasted bread. At just shy of $7, it's also a bit pricey for what you actually get.\n\nThe Peach Lemonade is a nice compliment to the sandwich - nothing particularly noteworthy, but an additional southern skew to your meal. It has just the right amount of sweetness and tang to prevent it from being overpowering, which is a balance that not all sweetened drinks achieve.\n\nFor those eagerly awaiting the relaunch of the ChickenShack on July 16th... Well, it may or may not be worth your while. From my faint memories of Chick-Fil-A, I'll have to agree with the majority of my friends that their sandwiches are noticeably better (and those waffle fries!). But for the ardent followers of Danny Meyer... Well, I certainly won't blame you for making the trek to Brooklyn in a few days; certainly, I'm not one to judge.", "author": "Lori L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "Shakes and Burgers! What's not to like?\nShake shack seems to be regular fare for me, whenever I`m in the states, and it never dissapoints.\n\nLocated right across the two bridges, in DUMBO, this Shake Shack is definitely killing it.\n\nWhen you factor out Juliana's and Grimaldi's, there aren't very many food options nearby.\nMost of the pizza joints don't serve slices, and you'll be stuck waiting an hour in line for a $30 pie.\n\nDon't let the crowd scare you! As busy as it looks, shake shack is quick! \n\nThey always have ample staff working - my longest wait has been 10 minutes tops. Legit good, salivating, not cheap, but well priced burgers.\nYou won't find McDonald's prices here, but you will get quality \u0026 value better than McDonalds!\n\nShack Burger, Shroom Burger, and the Shake Stack are my go to's.\n\nDon't leave without a custard shake! \nCheck out their Custard Calender, to see what the featured shake is for the week!", "author": "SandyMj S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "I love this spot in DUMBO, the food and atmosphere are great! It is right by the river with beautiful park alongside, and you can see the NYC skyline. The interior is all wood, as all other Shake Shake joints, but this one has cute ship decorations on the wall here and there.\n\nI got their ShackMeister Burger for the first time, and it was super delicious!!! I hope they will make that a part of their regular menu forever!!! Juicy burgers, yummy fries, and creamy shake. What more can I ask for?", "author": "June S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Shack Stack with a VIEW! The food is always great at Shake Shack, but this one is exceptionally good because it's location offers some sights.", "author": "Althea A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-13", "description": "I went there right when it opened, the establishment was nearly empty and it still took them almost half an hour to make a single milkshake. The food isn't bad but the wait times can be absurd.", "author": "Alana F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Delicious. I was so happy with my burger. It had all that you expect from a great burger but it also has some great flame grilled attributes. Yummy. \n\nNot a huge fan on crinkle fries but these were well cooked.", "author": "Conor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Let me begin with, I LOVE ALL THINGS SHAKE SHACK. I really do. But this location is fantastic.\n\nI've been to this particular Shack a few times and I'm always pleased. The service is quick, despite sometimes long lines. The seating is plentiful. The staff is friendly AND efficient. The burgers are delicious! What more could you want, people??\n\nI mean, you could even have a perfect view of the Brooklyn Bridge and the city skyline if you just take a step outside. It's a wonderful thing!", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "One of the better Shake Shack locations. Very spacious and clean inside, and well organized to boot. The workers here really know how to keep things moving along and are on top of their game. Food here is standard Shake Shack fare-- delicious and always hits the spot. Their lemonade also is quite delicious. Definitely a great place to check out if you're in the Dumbo area and other places in the area (e.g. Grimaldi's and Luke's Lobster) have too long of a line.", "author": "Susan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "Great view and location !!! \n\nWe went for lunch on Sunday, two cashiers were open with 5 people on line each, took about 5-6 minutes to order. They have 2 bathrooms, both unisex, password under the receipt as you may know so they were clean since not public.\n\nWe ordered 2 burgers - one double, one single, a portion of fries and a pitcher of Meister ale. All for $35. \n\nThey have 2 saloons, try to get a spot at the water front side with the Brooklyn Bridge view. On summer time, they have tables outside my brother said so can't wait ti be back. \n\nThere are textile items for sale such as t-shirt, baby clothes which I have not seen in any other Shake Shack so far. Just to let you know too :)", "author": "Ceren A."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}