{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-18", "description": "The line goes by pretty quickly here, but the place is always crowded. You're likely to not get a seat or have to sit with random people you don't know. A lot of teens here as well. Sucks that their only non-meat option in the shroom burger. The cheese fries are also unnecessarily expensive, but they did just start serving them fresh-cut recently rather than frozen.", "author": "Tamanna R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-26", "description": "If you're looking to put on pounds this is a pretty tasty way to do so.  Get the cheese fries to speed up the process.  Really need to impress her parents?  Listen: Caramel Marshmellow shake.  The calories are delicious, the line is malicious.  \n\nOH you're on a diet.  Yeah stay the hell away from here.", "author": "Jozef M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "The long lines are a mixed blessing - good for when I'm trying to decide between a burger or a hot dog, bad when I'm so hungry I'm drooling.  Either way, extra shack sauce please!", "author": "Jaime G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-07", "description": "I walk by every day on my way home from work. I want to stop and eat there every time. If I wasn't married, I might very well do it. \n\nUsually I get the Shack-cago Dog, but the standard Shack Burger calls my name from time to time. If you're a shake person, be advised- you should give them your business.", "author": "Nick L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-30", "description": "Shake Shake concrete with 4 and Twenty Blackbirds Salted Honey pie. Can't wait to try it. Also new Shake Shake burger!!!!: Shackmeister, very excited.", "author": "Jon F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Shake Shack is always great, but the (relatively) fast service here improves things.  The fries are still not great in my opinion, but the burgers, shakes, and custards make up for it.", "author": "Manny K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-13", "description": "I get it. It's totally worthy of the hype and it truly is delicious. But the feeling you get afterwards where you have to lie down on the floor face down for an hour? I can't do it to myself. I don't feel crappy after eating other burgers! What is it about shake shack that you feel like death after eating there? Love ya shake shack but you hurt.", "author": "Zoe T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "Same Shake Shack quality without the Madison Square Park wait. The service is great and you don't have to wait around too long to get a seat. I can't wait to see how it transforms in the summer, when the outdoor area opens up!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-30", "description": "It's definitely worth the hype and the wait, though the lines at this location are much shorter than others I've been at in the city! This location is quite clean and cozy.\n\nI love my burgers well done and they always come out very juicy. Their burgers, fries, and milk shake hit the spot! It's worth every penny.", "author": "MsToks S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "Shackmeister burger is the bee's knees. You probably know if you like shake shack or not by now (I certainly don't), but if you don't, then give it a go. By the standards of NYC food pricing, Shake Shack is secretly one of the best deals in the city, for my money.", "author": "Colin J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-23", "description": "I've changed my tune slightly on Shake Shack. Still In+Out at NY prices but It's really not that bad. I like the dogs and the prices are not that crazy. I'm sure Shake Shack Inc is breathing a huge sigh of relief now and they can expect business to pick up. With my third star you may just make a success of it in this town. Godspeed.", "author": "Henry M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-23", "description": "I was pretty disappointed. You hear a lot about Shake Shack, and you see yummy looking pictures of the food, and then you go there and it's a packed place with a long line, and you end up waiting for mediocre food. \n\nMy honest thoughts on this place is that it is overly hyped. \nIt may be a decent place to get your craving for burgers, fries, and hot dogs, and possibly a beer, but honestly I wouldn't be too tempted to come back. \n\nPros:\nTry out a popular joint for the first time.\n\nCons:\n-This location for Shake Shack was very packed so seating will be hard to find. \n-The food was very ... mediocre at best. I don't eat beef so I was willing to try out any burger without beef or any item really on the menu besides beef.\nI got what is called a \"chicken dog\" on the menu. If you are curious how it looks you can see in a picture in the photos, that someone else took for a chicken dog. It's literally, only one single very dry hot dog and a lonely bun. No onions, or anything extra. And it cost around 5 bucks. \nIf you were to find a street vendor and get a hot dog I believe you have the option of onions and relish. And it will be cheaper than 5 dollars. It will taste better and you will not have to wait in a long line with high hopes.\nOr you can also get a burger and large fry from a fast food joint for around the same, and it tastes soooooooo much better.\n- The seats are nothing comfy. It's quite uncomfortable and hard. \n\nThe other pictures of the items don't look like the bland little chicken dog on their menu so it may be worth a try. That is why instead of one star I will give it two. Their other items may be worth a shot, but the chicken dog is a bust on the menu. I'm not sure I can say that there are enough options for the non-beef eaters though.", "author": "Addie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "Shake Shack five minutes from my apartment? Ruh-Roh Scooby Doo. Might have to invest in some stretchy pants soon.\n\nShake Shack is a chain of hipster eco-friendly burger joints that serve meaty hamburgers and crunchy krinkle cut fries at a decent price. It's not going to be as cheap as McD's but you can taste the quality of the beef in every bite of the Shack burger. Mmm... beefy. \n\nWhen I visited this location, the line was pretty short and we were able to find an empty table quickly. What I love about Shake Shack's are their consistency. Not all McD's make equally delicious Big Mac's. Shake Shack serves up the same quality of food at every location and this one is no different. Be sure to ask for pickles and onions on your burger and try the fair shake.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-25", "description": "Good burgers not so heavy on tummy. Shakes delicious! Fries good but competition with 5 guys cajun fried!", "author": "Asiah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "When it comes to burgers, there are only good burgers and bad burgers. Shake Shack happens to be a good burger. They cook their burgers to a nice medium instead of a well done hockey puck. Another thing to look for in a good burger is some grease because cooks often press all that fat out of the burger in order to cook it faster, leaving a somewhat flavorless-dry burger. The juicy burgers are served on what appears to be potato rolls instead of buns made from wheat flour which adds a little sweetness to it. The vegetables are fresh as well and make the burger stand out. \n\nIn Shake Shack, they serve crinkle cut fries. Often, when I do find crinkle cut fries, their quality is equivalent to the same \"fries\" you would find in a school cafeteria --- mushy and textureless, but Shake Shack does it right and their fries are nice and crunchy while cooked on the inside. Definitely get some and share it with a friend.\n\nAnother plus to this place is the lack of lines, but to be honest, I was there at 11AM (before those office workers nearby take lunch). Even if there are no seats in the restaurant, you can walk down to the court house and find seating on the steps! Really ideal for a nice spring/summer day. I'd say go for it!\n\nAlso, they give you these cool pagers that buzz when your order is ready. It's an awesome yet practical novelty.", "author": "Henry Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "The Salted Honey Pie Concrete is sooooo good, even in the middle of the polar vortex/deep freeze. Good quality frozen custard with chunks of pie? Wow.\n\nBurgers and fries less exceptional,  but I WILL be back for the ice cream!", "author": "Ms. F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-02", "description": "I got a regular burger, soda and fries. Altogether, cost $12, which is not cheap but then again it's priced between fast food burgers and restaurant burgerfare so it is to be expected. \n\nWhat makes this place different is you can pair with milkshake or beer instead of just soda. The seating is not just regular fast food seating, it's more like a Starbucks style  area with solid wood benches. \n\nIt's in a pretty commercial area with the Marriot close by so it's good area to shop in. \n\nThe burger was pretty tasty along with the fries. I liked it better than the Five Guys chain, which is priced similarly.", "author": "Kaity H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-28", "description": "More like Salt Shack.  I was excited to try this place since I've never had the chance to in Manhattan, wanting to avoid the long lines.  \n\nMy 1st bite into my Shack Burger I thought was super tasty only for it to be replaced by a lingering taste of salt in my mouth.  That's when I realized that their food although tasty is way too salty.  \n\nThinking maybe it's a one time thing, I went back a second time and it's confirmed.  Their burgers \u0026 fries is just too salty.  I really really wanted to love them because they remind me so much of In \u0026 Out (oh I so wish they exist on the East Coast) but IMO, I would prefer Five Guys over Salt Shack.\n\nThere is a cold line, and the shakes are darn good.  Personally, add the malt!", "author": "Roy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-10", "description": "I really do not get this place? Friends have been raving about Shake Shack for year, but I was really let down. Maybe that was because my hopes were so high. I should possibly think about lowering my standards for what a burger should look and taste like, and maybe I'm just being overly critical of a fast growing franchise that is still handling growing pains? \n\nOr maybe just maybe this place is over-hyped and a less commercial version of mcdonalds. The smoke shack was aight, but please fellow yelpers, it is not worth 5 stars alone!", "author": "Alexis C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-20", "description": "Super yummy! Wicked clean! Got a suggestion from the girl on the floor, who was super nice, on what to order. It stuck with me that she said to try the black \u0026 white shake, so I did. Best shake I've ever had! Mixed very well and you get little bursts of flavor, which I think are chocolate chunky bits or something. You can order wine and I think beer, but definitely wine and they have a wide variety. I had to resist buying a t-shirt and a dog jumper for my Zoe.\n\nBut...what I loved was how clean it was! One would think a quick-bite, burger joint would be greasy and gross. Not this place. the surfaces shine, the floors aren't sticky or littered on. The condiment counter is very clean. I saw someone cleaning up the entire time I was there. It's serious business to them, I guess. I appreciate that. \n\nThe staff at this location is very friendly and patient. The only thing that was a bit, eh, was the register rests behind the menu board. So if you're trying to remember what to order, you have to lean back to see it. It's not a biggie, just a side thought. I wanted to make sure I ordered the food as it is listed and not just, \"hey, I want a burger.\" I had flashbacks to people messing with my Starbucks going experiences.", "author": "Naitasia H."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}