{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-25", "description": "I've eaten shake shack a few times in the last 5 years and I've definitely noticed a downward trend in the consistency of service.  The burgers and fries are definitely still delicious but I have noticed some changes over the years.  I've been to this location a total of 3 times and 2 out of the three my order was screwed up.  One where burgers were switched with another customer and the second where my shake was missing.  Just make sure you check your orders before walking out the door.\n\nOverall the burgers are pretty solid and the shakes are good.  Just make sure you have everything you ordered before walking out the door.", "author": "Jack W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-11", "description": "Great lunch place to get burger and drink. They serve alcohol (wine and beer).", "author": "S S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-24", "description": "I love a good burger and was expecting a good burger...but I was sadly disappointed by this greasy, salty and messy thing.  Honestly wasn't impressed by the burgers at all...thou the cheese fries were yummy.", "author": "Judy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "Mmmmm.....amazing food. Tonight, I finally entered this realm and discovered what people were raving about. From the moment you walk in, you smell the aroma of the food that just heightens your anxiety to excite your taste buds. A staff member is handy just to help you navigate the huge menu that hangs over the grills and explain each food item if you're not familiar. I went with a friend who's a foodie and she was mesmerized after ordering the 'Shroom Burger (vegetarian). I had the hamburger, french fries, along with the black \u0026  white shake. I don't eat beef as often anymore but my burger was mouth-watering. It was moist and full of flavor. Absolutely delicious. I really don't know why the fries cost so much at $2.65 but my entire meal cost about $12 and some change. They even give you this shaker which is like a beeper that lets you know when your food is ready at the counter so you don't have to stand around waiting. I can't stop raving about this place. The venue is pretty spacious. The staff was friendly enough to sit down for a few and chat with us. They definitely keep the place nice and clean. We had our trays put away and table wiped down while we were still seated. I liked the decor too. It was a great experience. I'll definitely be back for more. It's definitely one of the newest hotspots in downtown Brooklyn so you can expect crowds but the lines move pretty quickly and the conversations are kept relatively low.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "Shorter lines than in Manhattan, same delicious food. Lives up to its billing as an awesome burger. The single shack burger is purported to have the ideal meat:bun ratio, but I haven't tried a double yet. Highly recommend the cheese fries, and a chocolate shake if you have the calories to spare. A very well run and friendly establishment with delicious food!", "author": "Doug H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-26", "description": "Walk in a very busy burger spot. I went with the smoke burger single and blueberry lemonade. No regrets here! And the way they have you wait for you for is very well organize. They give you buzzers with your order number on it . But seating is a bit of a drag. Like I said it is a very busy restaurant and the most me and my partner waited on a seat was 5-10 minutes. The food was great but the price is costly.", "author": "Azley K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "Love love this place. They are crazy busy during lunch hours of course, but they are well organized so if you ever see a long line don't be discouraged. Burgers and fries are my thing and the cheese fries are always crispy and delicious.  The lettuce and tomatoes are fresh. I'm so glad they're in Brooklyn.", "author": "Johanna J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "As a rule, I no longer eat burgers out unless they're from grass-fed cows (my one exception being 5 Napkin Burger, which is superb). But I've been curious about Shake Shack for awhile, walking by its various locations and seeing long lines. So, I was shocked at how bad the food was. McDonald's french fries are far superior. Shake Shack's were completely tasteless. They looked good and had a nice crunch, but absolutely no flavor. Awful!\n\nAnd the burger, which should be a star, was only slightly better than what you get at McDonald's. Tasteless, salty and unevenly cooked. I ordered bacon with it, and for $1.25 I got less than one dried out piece. The best thing on my plate was the pickle, no exaggeration.\n\n2 stars because the room was clean and the service was quick and friendly.\n\nI will never eat here again unless I'm with a group and everyone demands it. In that case I'll order a bowl of pickles and a beer and cut my losses.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-24", "description": "For some reason the flavor isn't quite as epic if you don't have to wait in Madison Square Park on a beautiful night for 40 minutes for it. All the other branches I've tried are still one of my favorite burgers, but is missing that final 10% of pure magic. Came here after Jury Duty, left satisfied.", "author": "Dave P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-04", "description": "My daughter and I worked up an appetite during a recent visit to The NY Transit Museum. Just a few blocks away from the museum, and on our way to trek over the BK Bridge, I see this glory hole. The Shake Shack!! My Shack burger and cheesy fries were...UMPH!!! But, I'd expected nothing less from my fave burger joint. My daughter enjoyed her fries and shake. Thank you, Shake Shack! Just...thank you. =)", "author": "Dez A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-28", "description": "I'm in with love Shake Shack burgers and fries! They way they cook their burgers and fries so juicy and perfect!!! I usually go to the one in the city, but I was around the area on a late Monday night, so I decided to take my bf here, he's never been! He loved it a lot! He's fav was the cheese fries! I love this area because it just seems more open space and wider than most of the Shake Shake in Manhattan and I like the ambiance. I don't know if it's because I came on a night that wasn't too crowded, nevertheless I had a good experience here! I always tell people about this place, instead of eating McDonalds or Burger King's meals.....", "author": "Yami C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-18", "description": "Can never go wrong with Shake Shack.  This one seems less busy than the others, although MSP will always retain a special place in my heart, this is a good go-to for lunch in Brooklyn.", "author": "Adam K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "This is by far the best place to go for Shake Shack.  I am not into burgers, but I love the Shake Shack burger.  This location in particular never has crazy lines, and they move fast.  There is ample seating.  I have been here several times.  Do not go to the location in Flatiron unless you are willing to wait 2 hours for a burger.  But yes, by far, this is the best burger in NY! I find ordering the fries and the burger is a little overwhelming and guilt inducing, but it is definitely tasty tasty tasy.", "author": "Vanessa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-28", "description": "No matter your views on Pat LaFrieda beef (I think it's delectable), the lines here are completely manageable (ahem, Madison Square Park!) and there are enough tables for how big the place is.  Furniture and wall decor were also made from an old bowling alley- what more could you want from a burger place??!!", "author": "Dee S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-24", "description": "This place is not worth the hype .there is nothing special about there hamburgers . You better of going to McDonald's and get a big mac.", "author": "Deneisha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-24", "description": "Great food and drinks. Burgers are made fresh to order. It's a plus that they serve beer and wine. It can be crowded during the lunch rush. Staff are ok they take your order without problems.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "YESSS shake shack has come to BK! according to the reviews here, it looks like this place has been open since december but i only noticed a few weeks ago. this shake shack is pretty big! (i might not be the best judge though; the only other location that i've gone to is the tiny BPC one.) we went in on a saturday at 12pm, waited 5 mins on line to order and less than 10 for our food. the place was a little busy with mostly small families but no trouble finding seating.\n\ni decided to finally try a shack stack and it was deliciously greasy...but growing up with a family of health nuts, i'm not quite used to eating something so heavy. (helloo deep fried ball of cheese!) then again, shake shack isn't exactly for health nuts and maybe deep fried cheese is your thing! i can't deny that it didn't taste good. either way, the beef was perfectly done and the lettuce pretty fresh. next time, i think i'll just stick to the shackburger (which costs couple dollars cheaper and causes a little less guilt). prices are a little high but not bad considering their fresh ingredients and veggie-fed beef (and compared to other options in the city).\n\nthis place is still pretty new, so it's clean and probably not as crowded as the other manhattan locations. not a bad experience at all!", "author": "Lena E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-27", "description": "Shake Shack has landed in Brooklyn!  I don't know what I can say about the food that hasn't already been said -- it's legendary -- but this location is awesome: shorter lines than most of the Manhattan locations, plus ample seating.  It's a great addition to this neighborhood.", "author": "Micaela L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-28", "description": "Really long wait but the burgers are pretty good. Definitely worth a try but pretty pricey to be considered a regular place to eat at.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "Came here on a Saturday at lunch time. There was zero wait time to order and around 10 mins to get my food. Seating wise, almost all tables were full but was able to get window seats. There was no outdoor seating like some other locations. Their burger patty is a lot more flattened (thinner but wider) than the 23rd and 86th shake shack. I prefer the thicker parties so one star off for this location but definitely go if you are in the area.", "author": "Amy C."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}