{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "Went to Shake Shack for the first time, it was delicious! I had a regular hot dog, fries, and a vanilla shake. Everything was absolutely delicious and very fairly priced especially considering the location. I would definitely go there again!", "author": "Nina P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-07", "description": "The Shroom Burger was pretty gross and a total mess to eat- the cheese was oozing out of that bad boy, which sounds great, but it just didn't taste good. \n\nBUT the 'coffee and doughnuts' concrete was REALLY good- so I guess it's a draw!", "author": "Maeve H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-23", "description": "I don't know what to say that hasn't already been said, except that if you've never been to NYC, you sure as hell had better find your way to Shake Shack, or I will take personal offense at your lack of respect for FCKN GOOD fast food.\n\nUnderstand?", "author": "Alexandria G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "I've been to other shake shacks before and tried their burgers/drinks several times, but this location along with their new smoke shack burger is a WINNER!!! Now their burgers are on a whole different level from In-n-Out , they don't even compare.\n\nBurgers. Bomb\nSpecial Fries. Bomb\nFrozen custard. Bomb\nBeer. Extra Bomb\n\nIt's like the gourmet burger gave birth to a more affordable version...kinda like the new Mercedes CLA. Boom.\n\nYou can definitely tell this location has their act together, they must have an amazing manger. If you go there, you'll just know.\n\nTIP: Thankfully this location is indoors since the weather is getting chilly!!", "author": "Kristen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Best Burger I ever had was here last summer when we took a road trip to New York. We were recommended this place by a friend of ours that lives close by. I was not disappointed! I wish there was one in our area. The closest one I have seen is Chicago. I see this being the next big burger chain.", "author": "Oso H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "I love Shake Shack however I do not care much for this location. The burgers are juicy and mouth wattering. They actually have great employees with outstanding customer service skills. I would pick Shake Shack over Mc Donalds any day of the week.", "author": "Justin R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-15", "description": "Before I came here, i was told that New Yorkers compare it to In n Out back in Cali. While Shake Shack is good, that was a poor comparison. However, that doesn't mean that Shake Shack doesn't offer something unique in terms of burgers and dining. \n\nUpon entering, I noticed that there was a lot of metal and wood panels, so it felt reminiscent of other restaurants, of the x-large burrito variety. \n\nAlso, the reason this place doesn't get 5 stars is that because of the pricing. While the burgers and choices that are offered are good, the pricing for it, being that the initial comparison was to that of In n Out, was a bit steep. \n\nI paid $8.50 for my burger, which was their regular with a grilled portabella mushroom. All in all, without including fries and a drink in the pricing for $8, there hence the steep pricing. \n\nWhile taking the comparison out of the picture, my experience at Shake Shack was really pleasant, the burger was juicy, and the grilled mushroom added a nice taste to the burger as whole.", "author": "Thai-Johnathon V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "Shake Shack is good at any location, but this one didn't have many of the items I've had at other locations, and considering its right across from a concert venue, they must step up their game.", "author": "Louisa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-25", "description": "A few years ago you couldn't pay me to eat a burger..and then I discovered 5 guys burgers and fries. Needless to say, I hold 5G close to my heart.  To illustrate how much I love(d) five guys, I will admit that I think I once said that I would probably consider a meal from there as my last meal.  But I think my love affair with 5 guys (see what I just did there? ;) )may be dwindling ever since I decided to shake it down to the shack! \n\nI always wondered if the burgers were worth the hype, the wait, and the  1 bus and 2 trains necessary for me to go to the original MSP location. Fortunately for me, the burger god smiled upon me and opened a SS in my home borough. (unfortunately for me, its in walking distance from my gym--can you say brutal temptation??), And the answer to the first question is a definite YES. the burgers are worth it.\n\nI must admit the description of the smokeshack burger is what ultimately reigned me into trying out shake shake. A burger with Bacon AND the spiciness of red peppers= yes please! The burger did not disappoint. it was cooked perfectly (medium is the default but you can ask for it how you like it), the sauces blended well, the bacon had the right amount of crisp and the peppers were fresh. My love for the food here is bordering on obsessive and unhealthy--on many levels lol.Thank Goodness, I haven't had to resort to wearing disguises to conceal how often I go here quite yet!\n\nNow on to the fries. I LOVE fries, so I was hesitant when I saw the crinkle variety. It made me think of the ones you used to get at lunchtime in school. However, that couldn't be further from the truth, The fries were sooo crisp and flavorful. My only complaint really is that there weren't more of them! \n\nSeriously though, my one slight grip with SS is that I think their portions are a bit small. The fries only come in one size and it seems to be a handful and a half of fries at best and the single burger could be a smidgen bigger IMO. But then again, I think I have been spoiled by the king kong portions at 5 guys. Whatever SS may lack in size, they definitely make up for in flavor. But then that make you wish there was more--its a vicious cycle! \n\n Besides the burgers and fries, other  notable things on the menu the fifty/fifty drink-half lemonade/half fresh brewed ice tea (Please note that they do brew the tea to order so you have to wait a couple minutes extra but its well worth it) and the concretes and shakes. I especially enjoy the weekly specials they have for the concretes and shakes. Two past specials they had were the blood sugar spike were the cheesecake and cinnamon vanilla shake and the banana graham cracker and caramel concrete--the title of the special usually tells you all the ingredients haha,  Also, every month, they have a daily concrete flavor available. I love that they have the C-line (c stand for cold), so you can quickly grab a shake or concrete. \n\nI'm getting hungry..this review was convincing-I'm seriously going to get some SS now...", "author": "Cassandra B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-17", "description": "I like that a Shake Shack opened very close to my brother's apartment in Brooklyn. I tried this place, actually eager for a hot dog instead of its famous burgers (which I had at the Times Square location) and a vanilla shake. Good stuff, even though they stuffed the hot dog with unnecessary accoutrements.", "author": "Henry T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "It's okay...I don't get the hype. I kind of think its the same as getting a burger at Wendy's (one of the meal burgers, not the value burger).\n\nThis location is nice, has ample seating indoors and outdoors. They seem really on top of keeping up with the amount of people coming through.", "author": "Diana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "Get the Shackmeister. With bacon. And this location has Brooklyn Pie Oh My custards. True love.", "author": "Yvette F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "Great burger......fries and amazing service. Such a fun stop for kids after The Transit Museum.", "author": "Linda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "I've been hooked on their shack burger and cheese fries since I discovered this place. Sure, I know there are better places in the New York area for burgers, but if you want that quick fix this will definitely do the trick. It's really dangerous that this spot is by my house. \nThe great thing about this location is that the lines are usually not out of control compared to the manhattan locations. Also, try to concretes, you will not be let down.", "author": "Heidi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "I stopped in for lunch based on a client's recommendation. I was surprised to realize I'd been there years back when it was a pizza place.  I had the Smoke Shack burger and it was great. Good service and nice atmosphere.  Not cheap but reasonable prices. Well worth a visit!", "author": "George F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "Great little burger joint, a few steps up from fast food in quality while maintaining fast service and easy accessibility. Great selection of burgers and milkshakes. Absolutely swell!", "author": "Henry R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "Best burger I've ever eaten! I love many burgers in NYC but this one is my favorite. The shake burger (classic cheeseburger) is amazing. Ingredients taste natural. I recommend it! Very crowded place and not very cosy but we really don't care. Same prices as Five Guys.", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-19", "description": "My friend took us to Shake Shack after flying in from the bay area. This franchise doesn't exist in California yet but I've briefly heard about it hear and there in the news. \n\nFor those never been, it's another burger place kind of like In and Out or Five Guys, except the menu consists of about 30% food and 70% shakes/ice cream. They have shakes, concrete (ice cream with stuff mixed in), etc. I ordered a mushroom burger, cheese fries, and red velvet concrete. Prices are extremely high but expected since this is NY. \n\nI was informed that they ran out of the flavor of concrete I wanted, yet some how my friend got his because he ordered the pre-packed ones. They pre-pack a couple of pints everyday that's always available until they run out. I asked the girl behind the counter what she recommended being my first time there. She said to go with the tuxedo, which is basically half chocolate and half vanilla. I'd say poor recommendation since that's essentially what it tasted like. It's like recommending a cheese burger at McDonalds. \n\nThe mushroom burger was really good. Portion wise the size of the patty is about the same as an In and Out burger but there was a lot of good gooey cheese and the breaded, deep fried mushroom in the burger. I could polish off two of these easily. The cheese fries weren't fancy, just crinkly fries with some cheese sauce on it. Not really worth the order or the price. \n\nI'm only impressed with their burgers here. Wish they had more burger options like their extensive dessert options.", "author": "David Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "I just adore shake shack...great food; its not your average burger joint \u0026 its always good. Ashley our host is very pleasant. If you come during lunch hour expect a line.", "author": "Nell d."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-07", "description": "This place sucks. Never ever go here unless you want to shit you pants 5 minutes after eating their awful food. Fuck shake shack. They are the other Mc Donalds. Garbage.", "author": "Bryan J."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}