{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "Beautiful, clean, well-staffed and on TOP of that - DELICIOUS SHAKE SHACK BURGERS!!!!  YAY!!!!!  And it's so nice that you can sit outside on a warm day and enjoy the lovely view of the Brooklyn Bridge.  I LOVE THIS PLACE!!!!  :)", "author": "Tomeka S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-06", "description": "Does not live up to the hype. Great location with picturesque views of the Manhattan skyline and Brooklyn Bridge. However, my burger and fries were fairly mediocre. Not really sure why all the rave reviews. Basically it's Five Guys with better views and ambiance. \n\nBTW what's with the Cheez Whiz-like cheese and the soggy bun?", "author": "Joe B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "Love this location right next to Brooklyn Bridge!!!  Great burgers!!  Little pricey though.", "author": "A H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-03", "description": "First time in this location but not first time for Shake Shack. Well, this time my burger was even cold..", "author": "Yuchun W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "Great Brooklyn location with the longest bathroom line EVER! They only have 2 rooms and the line for it is ridiculous. Food comes out quick. We came on a busy day. We barely found a table for us to sit at. It was crowded and packed, it made it hard to enjoy. The food didn't take long, which is nice. Shake Shack is a staple, so I'm not going to punish them for being busy!", "author": "Darlene B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-01", "description": "I had the shack burger, fries, and a chocolate shake.  It was great.  While the prices were a little high. The taste and portions were well worth it.  Staff was friendly and the food came out quick. I will be back to eat here again, before I leave back home to Seattle.", "author": "Rick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "Will definitely go for Shake Shack again before leaving NYC. Though it's a bit pricey for a poor traveling college student, its burger its fries and shake totally worth it. The line moves fast and the place is clean.", "author": "Joie H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-14", "description": "Soggy tasteless fries, underwhelming mushroom burger. Consistent with an experience a couple of years ago in a different location. Not sure I understand the hype", "author": "Rahul J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-22", "description": "I love the food! No complaints what so ever with the food however, if you having your food to stay good luck with getting a seat the place is always busy so I do understand the seating problem I feel they give patrons 20 minutes from the time they receive there food maybe that might help. People were sitting watching TV thou they had finished there meals while others waited for tables.", "author": "Damara L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "The site was great, located in Dumbo. When I walked crossed the BKLYN bridge for some exercise, I found this shake shack surprisingly. You knew I would never await on line in Manhattan, cause always full of people. The burgers were good, low in calories. I ordered two shack burgers and a shake burger.", "author": "Spencer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Tasty!! Smaller burgers than I though but good price. I liked the buns theyre sweet. I got the salty buttery caramel custard which was really good too! Around $9, accepts credit. Staff was super sweet and helpful!", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "Grabbing a 'shroom burger, fries, and cup of the perfect lemonade to enjoy in Brooklyn Bridge Park was no easy feat, but it was worth it. Lines are long on a warm Friday night, and the noise level inside was kind of mind boggling; however, staff was super friendly, helpful, and patient. I wish they had a tip jar, since I really wanted to give Moustapha at the counter a tip for going above and beyond! Also, the blueberry doughnut-flavored custard was insanely delicious.", "author": "Teresa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "Shake Shack serves up, hands-down, my absolute favorite burger. This location is their newest in the area and is one of my favorites! Right in the heart of beautiful DUMBO, my boyfriend and I had the privilege of chowing down on a juicy Shack burger and cheese fries while waiting for the fireworks at Brooklyn Bridge Park on the 4th. I normally go for their chocolate shakes, which are off-the-charts amazing, but to my surprise I noticed on the menu that Fridays they serve up DOUGHNUT CUSTARD (if you know anything about me, you know that I'm addicted to donuts), so I had to go with that. I chose very, very well.", "author": "Tayler S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "The best shake shack in NYC. Excellent service. Event though it was packed a staff member by the name of Marquis did an amazing job!", "author": "Amir Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-29", "description": "The burgers are great but overly pricey. The concretes are good, but I would give my fair trade (coffee) shake a 1/5. Honestly, almost everything is a 4/5 but the shake was so bleh that I'm giving the place three stars.", "author": "Davy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "Very good! Excellent cheeseburgers first time here.  The smoked one was really good.  Definitely I would come back.", "author": "Guillermo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "The best hot dog I ever ate, the burgers are a little greasy and I wish there were more tipping choices for the burgers. But I think I will only get hit dogs from now on", "author": "Brian M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-05", "description": "Burger is pretty good. Price is too high. Which is to be expected in DUMBO. The cheese fries are terrible. The fries are good. The cheese sauce on the side sucks. If I pay extra for cheese fries I expect real melted cheese. Not queso dip in a cup. Much better food options in the area. I do like that they take cards though. Hire someone to wipe down the damn tables too! Disgusting upkeep. There are 6 people standing behind the counter one of them should walk the floor and wipe down tables. Overall I have it three stars because the food is pretty good albeit overpriced, but the dining room is fucking gross.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "Ideal location in Dumbo. Good food very crowded all the time, comes with the name I suppose! Food was pretty old, had a regular hamburger which was solid. A great place to go for a classic burger fries and shake, staff was also fairly nice.", "author": "Anton S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "This ia the best shake shack I have ever been to. The food was cheap and good. Better than the shakr shack in citifield. That was full of salt.", "author": "Leo W."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}