{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "I'm told this isn't the 'original' location, but I could care less. This was my first time at a Shake Shack and I was so thrilled that we went on a weekday and there was NO line. Service was prompt and food was nice and hot. \n\nMy NYC friend ordered my dinner since she's been here a few times.  We got the Shake Shack Shroom Burger, which has a portabella mushroom with cheese OOZING out of it. SOO good. Not even a mushroom fan but this one rocks the house!! The Black and White shake was milky and creamy. The price of a burger is a little high around $10. The order for the cheese fries was a little small in my opinion, but I'm glad they use REAL cheese in their sauce. It ain't cheese wiz (phew.). They were thinly sliced w/their skins on. \n\nThey offer wine and beer as well. We even lucked out and scored a free burger because they accidentally made one to many. YAH for us! \n\nOverall for 3 people, expect to pay around $30-$35.", "author": "Mary Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Delicious and great quality food. The hamburgers and fries tasted fresh and made that day! I'm still a better fan of In-N-Out but shake shack is definitely second. Busy place, may take awhile to find a seat but the food comes quick.", "author": "Hope G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "Lunch time madness and undercooked burgers made my visit today with my children not so pleasant. I did get a replacement well done burger but it failed to please. The shake shack hype is over for my family and I. The cashier also made a mistake with counting my change and shorted me seven dollars.", "author": "Maria A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-04", "description": "As far as all of the shake shack's, this shake shack is by far the nicest. The atmosphere looks nice and lets thank the workers here for keeping the place so clean and beautiful. This shake shack is in the heart of Dumbo near the Brooklyn bridge and the carousel. \n\nAfter shooting photo for 6 hours i went to shake shack and i had the double smoked shake shack burger, the burger was great. can't go wrong with the cheese fries, that was good too. i would stay away from ordering their soda floats. i got a root beer float was not good at all, the root beer tasted water down. \n\noverall i was hungry and this place was the closes to a burger shack so i tried. in the near future i would properly return for a burger but not for their floats.", "author": "Rafael Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Love love love love love Shake Shack! This location was especially clean, even though its inside a train station.", "author": "Galen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Came here on a nice Sunday, the place was quite small and packed with people. Luckily the line moved fairly quickly. We were lucky to find a table. We ordered the shack burger, chick'n burger, and crinkle cut cheese fries!! This was my first time having the chick'n burger and I really liked it. The chicken was moist and crispy and it wasn't overwhelming at all. It was nicely portioned and not messy when I consumed it. The fries were good as usual.", "author": "Cindy X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "Shake shack, what can i say, its really good, they have good variety of burgers, i tried the birger with the red peppers and the mushroom one. I also had a shake and it was good too.\n\nBeing from los angeles, me and my wife had to try a plain burger so we can compare it to in\u0026out. The plain burger was salty, so i would have to go with in\u0026out on that battle.\n\nIt helps that they also have that line just for drinks and deserts because shake shack lines tend to be long. \n\nThis location also has a killer view of the brooklyn bridge! Especially at night!", "author": "Joseph J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-09", "description": "My son had 2 burgers. First time that's ever happened but that goes to show what great burgers get people to do. Family of 5 ended up spending $71 here but I don't regret that one bit. My only gripe about the visit was that to get a refill on a drink, a gentleman who worked that station saw me many times yet chose not to serve me even when I made eye contact with him several times. When I told the cashier about my plight, she tried quickly to remedied the situation but the damage had been done. \n\nCharging a premium for great food, I am good with but please take care of your customers. They might have paid but your service is what keeps people coming back.", "author": "Sam K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-13", "description": "Dare I say it? I will say it.\n\nIn-N-Out is better. There I said it.\n\nBefore any Shake Shack fanatics jump at me, let me explain. This place definitely has more options than its California rival. There's caramelized onions and cheese-stuffed onions and bacon if your heart so desires. Bacon is a big deal, I get it.\n\nHowever my order was the simple single hamburger, no cheese, with tomatoes and lettuce- which is probably the most comparable burger to In-N-Out's. I thought it was just okay. I really like that the beef is all natural with no hormones or antibiotics. But I personally wasn't a huge fan of the soft bread (I know that's what a lot of people actually like). I found myself wanting In-N-Out's toasted bun and animal sauce. Maybe I am old-fashioned and just like what I'm used to.\n\nAlso, the crinkle cut fries which were a little over-fried for my taste.\n\nAnyway, that's just my two cents.", "author": "Sharon O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "I love the burgers, so juicy and the cheese fries. Definitely not a good resolution for my diet lol", "author": "Maika V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "I love Shake Shack and this location is pretty good, though usually very crowded. But what's new for Shake Shack?", "author": "Kate J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "It's Shake Shack but this review is for the DUMBO location. It's not too crowded late in the evenings but during the day it's a different story. It's crowded but the space is large and well maintained. Good beers too. \n\nPro Tip:\nThey have a water tap so it's a great place for free water refills.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Best Shake Shack location with delicious food and fast service. This is my go to place when I treat my son and his friends to some delicious food. Everyone enjoys the food because the mushroom burger is scrumptious as well as the chicken breast burger. My son's meat eating friends rave about beef burgers and I love the fries with the \"Shroom Burger. The DUMBO  location also does mess up my orders which was a  problem for me in other locations.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "I actually came to this Shake Shack location, like everyone else who was looking to try the Chicken Shack ($6.29). After its debut, that is only available in a few Brooklyn locations, I wanted to be part of the crowd that gets to try this sandwich before it either goes away forever or officially becomes part of the Shake Shack family. I am glad to say I did whether or not it sticks around. \n\nThe Chicken Shack is definitely different compared to all of its burger. I actually like it more than I anticipated because I am more into beef burgers than chicken burgers. It was very crunchy and all the ingredients blend greatly together; which has lettuce, pickles, and  buttermilk herb mayo sauce.  Usually, I despise pickles and take all pickles out of everything I eat, but I thought I would give the entire sandwich a try since there has to be a reason why these ingredients were decided for almost 2 years, which I read in an article. I am actually glad I did because it taste really good. I felt like the pickles did play a role in bringing this sandwich to a flavorful satisfaction. -- Even though it is good, I would not get this Chicken Shack every single time I go to Shake Shack, of course. Shake Shack is great in general! I'm so glad SS brought back the crinkle fries.\n\nThe thing that sucks is that parking is hard to find around DUMBO...", "author": "Irene Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "I was hoping to find a food cart with chicken over rice to eat at the park but there were none, to my dismay. Hence the trip to the nearby Shake Shack.\n\nDespite hanging out in the city fairly often, I had never visited any Shake Shack locations - probably because I usually go for ramen or something that's not fries and burgers when I'm in the city.\n\nI only had a generic cheeseburger and a strawberry milkshake but I loved it! They did add lettuce even though I said just the patty and cheese but it's cool. The lettuce balanced everything out just fine.\n\nMy only complaint is that I think there were no restrooms at this location... How does that even work..?\n\nEdit: I had a misunderstanding; there are restrooms available. Kudos to customer service for reaching out!", "author": "Aimee L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "Great food but awesome customer service in the back for being so accommodating! First time being here and the food was great. We had the chicken sandwich and smoked shack. The chicken sandwich was delish.", "author": "Wil T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "I love you shake shack, you will always have my heart!!! Had the chicken shack and roadside shack burger. Both were sooooo good! The regular shack burger is better than the roadside burger in my opinion but everything is so good here that I can't even say anything negative.", "author": "Julie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "I been going to Shake Shack for years and I love the food, but this one is very un professional. The girls in the kitchen were talking all across everyone food about their personal business. I asked about my order and it was not even on the screen. I had to show my receipt. The guy that was in the back with the glasses was very helpful and attended to me and my friend quickly.", "author": "Valentina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "I came to this Shake Shack located in Brooklyn a couple of weeks ago and fell in love with it! I hadn't been to the dumbo area in a couple of years so surprisingly a lot has advanced with the different restaurants and activities around. \n\nI specifically wanted to try the \"limited edition\" chicken sandwich and it was perfect! I was born and raised in the south; having grown up on chic- fil- a you adore their chicken sandwiches. Let me tell you, I have to officially say that shake shack's chicken sandwich has caused me to officially place chic-fil-a at #2! It's that good! I'm wondering how they make the sandwich so juicy and crispy...It was cooked to perfection!\n\nYou honestly can't go wrong with the location, the cheeseburger or the chicken sandwich. Their all highly recommended!", "author": "Latrese M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Much better than DC location.  Corrected the experience and still has great food.  Great service.  Clean too.", "author": "Ernie F."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}