{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-28", "description": "It's OK.  Place is chaotic and disorganized. People seem to cut each other in hunt of having a sitting spot. Evaluating this place as a fast food chain: bathroom lines are huge with  several occasions of breaking toilet due to who knows what. The food wait is moderate,  not terribly long but not quick like most fast food joints. Portions are Ok, like any other shake shack. The place is also usually packed to the brim (refer to stealing other people's tables and saying they didn't know people were waiting)!  At least the place is clean...", "author": "Ani Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "I am from SoCal so I constantly hear Shake Shack being pitted against In N Out. However, after finally getting the opportunity to try this place, I feel like the two are completely incomparable... \nShake Shack is more of a classic style burger. The meat is very juicy and rich, whereas the In N Out patty is more generic. The bread is very sweet and soft, almost like Hawaiian bread. There's no \"spread\" type of sauce- just a very traditional, delicious burger! \nThe crinkle cut fries are also delicious! Nice and salty. I must say that I do like these fries more than In N Out's- it doesn't taste as raw. \nI got one of their famous concretes as well, but it just tasted like typical ice-cream to me. For almost $5, it's skippable. However, my friend got a milkshake and he said that was really good.\nShake Shack is pretty pricey for burgers and fries. However, if you stick to the classic burger and regular fries, you will still be spending less than $10!\nAlso, this location is awesome because you can take it to go and eat it outside, and you'll have an awesome view of the skyline and the Brooklyn bridge (-:", "author": "Jordyn Yian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Always love Shake Shack, especially when it is located by the pier and a beautiful view of downtown Manhattan and Brooklyn bridge :):) The wait is usually better comparing to other locations in the city.", "author": "Kay W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Devoured the food so fast that I forgot to take pictures. Begged my boyfriend to eat here after walking around DUMBO because I've been wanting to try the chick'n shack. We got the smoke shack, chick'n shack, cheese fries and the cookies and cream milkshake. The chicken was crispy and not too dry. Glad the bun wasn't oily and soggy like some of the other shake shack locations I've been to. The cheese fries were sooo good. It was crispy on the outside and soft on the inside. The cheese made it even better. Could not stop eating them. The milkshake was pretty good too, but it took a lot of effort to suck through the straw. Can't wait to visit DUMBO again so I can come back.", "author": "Shirley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "Yes! Dammit I love these burgers. If we don't go to Fulton St, then we are here. It's great to walk the Promenade or through Brooklyn Bridge park and then come here for a meal. It can get very crowded now with all the summer crowds and tourists but the cashiers move fairly quickly and if you stalk the tables enough you'll get a seat. In terms of food, it's just as excellent as the other locations. Shack burger with cheese is flavorful, cheesy but not greasy and the fries are crispy.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "Yes, they serve kick-ass burgers. We all know it! But when this food orgasm is combined with a stunning view of Brooklyn Bridge, this experience transforms into a a whole new level of food madness. And shake Shack delivers it all. My favourite remains the Shroom Burger while my husband loves his roadside burger. And hey, the fries are not too bad either!", "author": "Neha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "I love shake shack especially their new ChickenShack! It's so simple but so delicious! Fried chicken breast, lettuce, mayo and pickles. \nFries are always crispy, shroomShack is my go to winter burger. \nOnly thing I dislike about shake shack is the long lines. There has been a few times there's no lines but 90% of the time, there's a line out the door.", "author": "Carolyn H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-04", "description": "I didn't want to review any fast food restaurants, but since I'm here so often, I just wanted to say that it's good. I'm from the Bay Area, and it may be that I've had too much In-N-Out my whole life, but as of now, I think I'd rather eat a Shake Shack burger. I will say that In-N-Out veggies own the veggies at Shake Shack (if you're into veggies), but the meat and cheese at Shake Shack trump In-N-Out.\n\nI've clearly put too much thought into this. Just eat a Shake Shack burger and feel the greasy goodness.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "Very good place to grab a bite to eat if you are in the area. Burgers were great and the cheesy fries were on point. Go there!!!", "author": "Cody S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-22", "description": "So after skipping the one just off Times Square about a dozen times due to the size of the lines, we were out exploring Brooklyn yesterday and decided to stop in for lunch.\n\nI have to be honest and say I don't understand what all the fuss is about. The burgers were OK, but no better than what you get at Five Guys Burgers and Fries - and Five Guys is going to be about half the price.  In fact the only thing that I think was quite good, where the fries - but we ordered the cheese fries and all they do basically is put this liquid nacho kind of cheese on top of the fries.  It didn't really add anything to the fries, it wasn't what we were expecting from cheese fries, and the fries by themselves probably would've tasted just as good or better.\n\nBasically it is a decent fast food burger joint, that is way overpriced for the product that it serves.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-04", "description": "Great food - my wife and I split a bacon cheeseburger and cheese fries and found them to be wonderful.  She had a peanut butter shake that I found so delicious that I ordered one for myself.\n\nA little pricey for what you get, but hey, isn't that the NYC way?  Not much of a line around noon at the Brooklyn Heights location, so that was nice. Restaurant was very clean, and quite nice.  Recommended.", "author": "Tony H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Couldn't have asked for a better experience! Outstanding staff made our wedding day even more memorable! \n\nThank you to the lady and gentleman who went above and beyond ( November 28 2016 @ 5PM ). \n\nMuch love from Vancouver Canada!", "author": "Shaun S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "New York popular chain \nBurgers solid after being unable to get into Julianna's \nMilkshake heaven absolutely and not even shake fan \n(Calories!!)\nBut the black and white ( Amy's cookie fame) milkshake most recommended !!!\nWe fought over it \nThen bought two more", "author": "J B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-28", "description": "The burgers are good. The fries are so-so. Service is bad. There is only one unisex bathroom stall with permanent long line. For such an expensive burger joint you would expect better service.", "author": "Michael O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-09", "description": "I think this is the best Shake Shack location.  There aren't that many people compared to the other locations and there's an outdoor area to sit as well as indoors.  Even better is that you can go to Brooklyn Bridge Park and eat there.  The 'Shroom burger and fries are still as good especially now that the fries are fresh cut, not frozen.  Another plus is that they have good wifi.  I'll be back to this location, the other ones are too touristy and you have to wait an hour for your order.", "author": "Julie Ying X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Fast, Clean, and Fresh! This place has no flaws. Ordered a shack burger without tomatoes and they got it right. My order was fresh and it was quick too. Got in and out in like 15-20mins", "author": "DeAndre H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "It's all about the location, location, location.  \n\nThis is real estate royalty for any restaurant let alone a well-known franchise such as Shake Shack.  After watching Shakespeare at Sunset, my friends and I strolled over for some grub. \n\nAfter waiting on a line for 20+ minutes on a late Sunday night, and eye-balling the juicy burgers being churned out, imagine how disappointed I was when they ran out of burgers with 5-6 people to go. \n\nThe burger joint was clean out of burgers.  Such blasphemy, I was subjected to order a hot dog- which by the way, wasn't that great.  My strawberry shake was still kicking, but I was missing my beef.  A managerial type came out to let us know how sorry they were.  I asked if this had ever happened before, and she said that this was the 2nd time within their month-long opening.  \n\nThat's pretty bad- any other place I could possibly understand them running out.  But this was a true brick and mortar place, and you're smack in the center of one of the most heavily traveled areas in all of New York.  And you run out.  And you're Shake Shack. \n\nNot only did they run out of burgers, they also ran out of ketchup. When several people asked for it, the employees said they also ran out of that.  Highly improbable. More likely that they were closing soon and didn't feel like refilling it.  #LAZY\n\nThe staff was savvy enough to offer black comp cards for everyone's inconvenience, supposedly valid for one free burger.  However, and I don't know how these cards work, when I checked if there was a balance on the card, it read as zero.  Maybe it doesn't register in monetary value, \u0026 is just redeemable for food.  I don't know.  But there's a slight possibility that they've duped us all.. In which case, I'll kindly return the favor and revise this review to its appropriate rating.", "author": "Jenn F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-09", "description": "Nothing better than starting in Manhattan and walking the length of the Brooklyn Bridge to get to Shake Shack, ordering cheese fries and washing it down with a black and white (chocolate/vanilla) shake. (And then you have to walk back the way back where you came from so you feel a little better about yourself to burn off the insurmountable number of calories, but the view back to Manhattan is more picturesque because you get the skyline).\n\nIt's a little hectic here. Not only because it's busy but because of the way the ordering line is set up. I know there's a more efficient way. If you're getting shakes, the lines are different. Like I don't even really understand it, except that I was in the crazy line and then was able to go to the not-so-crazy line, but the lines aren't even clearly separated or noted. And then the condiment area. Good luck trying to get that mass of people to move out of your way.\n\nThe fries are your run of the mill crinkle fries from the freezer section at your local grocery store, with melted cheese. The shake was pretty good, glad I got the combo of flavors. They carry local Brooklyn beers and wine, but would love to see boozy shakes in the future!", "author": "Esther G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Believe the hype! If you haven't gotten a burger or shake or fries from here yet, stop by any of their locations (just make sure you know some locations are A LOT busier than others). You can't go wrong with the original, but if you don't venture out and try the mushroom stack or the chicken stack especially, you're missing out. \n\nAs a Californian, this is the closest thing to In-n-Out I'll ever get here I suppose. Just for reference, I think In-n-Out burgers are better, but I like that Shake Shack has lots of different options in case you aren't feeling like burgers that day.", "author": "Patrick P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "Service was great, the staff do a good job at keeping the place clean. Not too crazy about shake shack but the cheese fries was good. I really just come here for the root beer float, an easy 10/10.", "author": "H D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}