{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-03", "description": "Delicious but greasy! The best hamburger for a hangover! Also I love that they have crinkle cut fries, I haven't see those since I was a kid! The line wasn't too long either unlike their other locations, one issue I have though is the lack of seating you have be fast if you want to get a table to yourself!", "author": "Carla F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-05", "description": "I've been to Shake Shack twice and I must say I'm impressed. A little pricey, but good food usually does cost more. The burger was good, but I'm not a fan of crinkle fries. Now as far as the milkshake ...... LOVED it !!! I had a caramel milkshake and I didn't think I would like it so much because I'm not usually a fan of them. The shake was to die for !!", "author": "Mia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "I ordered a spicy burger with bacon, cherry chip and vanilla custard, and cheese fries.\n\nThe burger gets 5 stars. I ordered it well done, but it wasn't overcooked. I enjoy spicy food and I feel that the burger had a nice kick,  the bacon was crispy but not burnt and the cheese was MELTED onto the patty :)\n\nThe custard gets 2.5 stars.The cherry chip custard was quite icky in my opinion, but there were large chunks of chocolate within the custard. I guess this boils down to your taste preference. The vanilla custard was ok, but nothing like Rita's custard.\n\n\nThe fries get 3 stars. The fries are nothing out of the ordinary. I do enjoy that they serve crinkle fries, because not many establishments do nowadays. The cheese was a bit too salty.\n\nIn sum, I'd go back but I'd only buy the burger.", "author": "Top C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-29", "description": "Tried it because I was starving after leaving a bad show at BAM and I came across it.    I decided to go in since there was no one in line and plenty of empty places to sit.  It was okay, but really, burgers here are the same bad quality as in Manhattan:  greasy, salty, fatty, and the bun is so delicate it can't hold up to the juice and fat of what is inside so you end up a mess.  I guess some people consider that a plus.  I'd rather have a burger with a charred edge from a grill and a hearty bun that holds it all in place.  \n\nThis locale has an outdoor seating area in the summer which should be nice, unless all that exhaust from the major traffic artery from the Brooklyn Bridge is a problem.  \n\nThe great thing about this place was the house wine:  I'd come back for the red any day (if it wasn't for the $9 price tag for 1/3 of a glass pour).  \n\nReally, I do not understand what all the fuss is about for this chain of burger joints, there are so MUCH better places to eat.   But I guess lemmings need to eat too.", "author": "Garrett B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-29", "description": "This spot is the bomb!!!!!!! I love eating here and the service is great!!!!!!My husband and I truly enjoi the food and the  ambiance of this place, the only thing I must say that is not so positive is that it gets very crowded quickly and at times its hard to find seating,but sometimes a cashier will help you and all is well again!!!!!!!!!Great place to eat!!!!!! Food is surperb!!!!!!!!", "author": "Michelle E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-15", "description": "Its a good place to get burgers and shakes but I prefer Hill Country Chicken.  HCC is across the street and worth the trip. They have better shakes and soda with Cane Sugar and not corn syrup.  I'm not saying I dislike the place because I don't.  I'm just saying there is a better restaurant across the street that is similar in what it serves and its pricing.", "author": "Russell H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-09", "description": "i had a so so burger and not bad shake, nothing exceptional. Does not come close to my In'n'out burger.", "author": "Anton H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "Oh wow the greatest and fastest burgers I've ever had.The burgers were so juicy and the milkshakes were great. When I come back to Brooklyn I'm coming back here.", "author": "Anthony A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-23", "description": "the line at this shake shack is relatively short compared with the other branches. the food i assume is the same. (i've only had a strawberry shake here, which was great) there's a good amount of seating and they're open relatively late. from what i remember, their shroom burger is a glorious sight. yum!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-13", "description": "We finally have a Shack Shake in Brooklyn...hooray, hooray!!! We visited Shake Shack this week for the first time. The quality of the burgers \u0026 fries are definitely on par with the Shake Shacks in the city. The only downfall about the experience unfortunately was the service - very slow and inefficient. It took forever for us to get served. The place was also overcrowded, and hectic. 5 stars for food. The overall ambience needs some loving and attention.", "author": "Markus H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-06", "description": "Great burgers always get the double. The fries are on the ok side. The set up of the place is great the use of space, you always get a place to sit. Great addition to Brooklyn I must say. Some of the reviews need to go down the block NO LINE THERE BK need I say more crown me", "author": "C B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "I love Shake Shack, delicious burgers, totally recommended. I also tried Shake Shack hot dog. It comes with a bunch of veggies. The great thing about this Brooklyn location is that there isn't long line like the one at Madison Park.", "author": "Athena G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-20", "description": "Look, it's good... But... Five Guys is better.  So if there is a line here, walk over to the Brooklyn Heights Five Guys on Montague Street.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-21", "description": "What is there to say that hasn't been said? One of the best burgers I've had, bar none. And I've tried almost every \"must eat\" burger in NYC. The quality of the meat is worth the price-- which is cheaper than at most actual restaurants in the city. The milkshakes and cheese fries are pretty great, too. And it always feels like I'm being deliciously naughty when I order a beer here, since it feels like a fast food spot.", "author": "Elizabeth G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-03", "description": "Im gonna keep this short \u0026 sweet, one of the best burgers ive had, flavorful \u0026 cooked to perfection, I was initially dissapointed when I saw bacon wasnt an option to put on top of it but honestly I didnt even miss it. I had a caramel shake which was tasty, but not as good as the burger. The fries were no match for the burger, they kinda tasted like they were pre-frozen. Anyway great burgers, definitely worth the price!!", "author": "Samantha P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-24", "description": "I dont get the hype with this place. The burgers are marginally better than  the burgers from Wendys. The fries are like Ore Ida fries from the supermarket- so not a fan. Good enough burgers but dont bother waiting in line.", "author": "Anastasia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-28", "description": "amazing buns, great crinkle fries, they sell alcohol as well - what more can you ask for from a burger place! only reason i didn't give them 5 stars is because i am still (and will forever be) loyal to in-and-out...but this is a close second and I go here every time i have a burger craving...and now they're in the BK! woot woot!", "author": "Dianne R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-12", "description": "I would eat at this place for lunch every single day.  Shack Burgers.  Cheese fries.  Peanut Butter Shake.  Arnold Palmers.  All things I would again, literally eat every single day if eating them wouldn't kill me.  Which it would.", "author": "Ryan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-26", "description": "Great Burgers, and great fries.  A little pricey, and the lines can get insane, but you get fresh food and excellent service!", "author": "Omar F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "Today is the day I finally got to try Shake Shack.  Went to the Brooklyn location (409 Fulton Street ) with a friend for a quick bite this afternoon.  Fortunately there were nowhere near as many patrons as I normally see queuing up at some of the other locations.  We each got a Shackburger (with raw onions added) and shared some fries.  So here is my take - I thought the burger was pretty tasty (with the exception of some gristly bits, which my friend's didn't seem to have) and the fries were crispy and well salted.  Granted, I did not try the frozen custard or even a shake, but I can tell you that - while (read more at brooklynstoop.com)", "author": "Brooklyn Stoop B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}