{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "One of the nicest spots in New York City area...!!!\n\nHighly recommended for tourists or people who just want to hangout and get a great view of the others side of the city. \n\nFood is always great but the portion is smaller than IN-AND-OUT burger. Overall, good service.", "author": "Jun C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-25", "description": "What the fuss all about? The burger's are alright, (No antibiotics, got a third star), nut the fries are terrible, barely any favor and completely the wrong texture, seemingly the fries are from frozen packages, makes the no antibiotics somewhat pointless.", "author": "Olivia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Ahhhhhhhh heaven on earth \nNo matter what I write it won't do justice for this place \nEveryone hung was perfect \nBeyond amazing \nAnd the staff really nice the restaurant very clean and looks pretty and if you get a window seat you over look the bride it was amazing", "author": "Lina A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "Pros:\n-Awesome, reliable burgers if you are in the area. I had a short, fast line and the food came quickly.\n-Good, friendly service\n-Conveniently located next to DUMBO \u0026 Brooklyn Bridge.\n\nCons:\n-ONLY 2 ONE-STALL BATHROOMS!!!! NOT cool. The line was continually 10-15 people long during lunch time. I think non-customers come here after walking the Brooklyn Bridge or something. Awful line and they need more bathrooms. Also, the bathrooms are located in an awkward spot next to the backdoor of their kitchen, which means the kitchen door is constantly swinging open/close and they're carrying boxes of mayonnaise packets/ketchup in that tiny hallway. \n-Not enough seating overall. My parents and I ended up sitting at a small, coffee-table like area and it was awkward not having a table at regular height.", "author": "Jocelyn L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "SO YUMMY best burger ever. I got the cheeseburger and it was so juicy and good! I also got the Oreo milkshake and that was superb as well!!! Would definitely recommend. Lastly we got the crinkle fries which so good, a shock since I was told the fries at shake shack weren't good. Overall would definitely recommend this burger place to anyone, although it does take a little longer than your average fast food place, it is because the food is much better quality!", "author": "Candace C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "FIRST OFF IF YOU HAVE NEVER BEEN TO SHAKE SHACK GO!! Legitimately the burgers and custard shakes are a must!!!\n\nIve had a lot of different flavor shakes and no mater which flavor shake you choose you cant go wrong. One of my favorites is the traditional vanilla. There flavor custard change weekly. Like I said they spin all there custard, so there's no pumping flavors into it. \n\nThe burgers are heavenly especially with the potato bun by personal favorite is the shack burger, and the fries are alright nothing special. They do compliment each other well. \n\nThe real special thing about this shake shack is its location right under the Brooklyn bridge your directly across from the Brooklyn ice cream factory and too very renowned pizza places. Once you walk out of shake shack its such a romantic area to even just walk and bookmark a few romantic places you will see along the way, and then question why you didn't eat there instead of shake shack but hey, Shake Shack is special in its own way. \n\nAll in all this location beats all the shake shack locations in Brooklyn by far. The food delivers flavor the service is fast but it does get crowded, It was fairly crowded on Sunday afternoon/evening so maybe try and go on a day where its not insane because they will make you wait outside on a line.\n\nGO FOR LOCATION AND YUMMY SHAKE SHACK!!!", "author": "Marlena K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Ok. Shake Shack is always good fast food. Burgers, fries and shakes. Very dependable and much better than its competition. Also the chicken sandwich is delicious and doesn't have that thawed from the freezer taste, like some other places do.", "author": "Trudy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "It was extremely cold when we were here but the food was very good.  Kids enjoyed it also.  I'll come back when I'm NYC in the summer!", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "I'm here in New York from DC visiting, and always love the shake shack back in DC. For a little taste of home I decided to stop by tonight for a concrete, which is basically custard blended with some sort of toppings. \n\nI decided on the Brooklyn pie oh my because it is vanilla custard blended with a seasonal slice of four and 20 blackbirds pie. The featured pie this time I went was strawberry balsamic, and it was absolutely perfect with the vanilla custard. So perfect that I've gone two nights in a row to get the same thing! I hope they change the pie flavor so I can rationalize going back again!", "author": "Hailey F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "The neighborhood of Dumbo continues to shake things up.  The ongoing construction in Brooklyn Bridge Park and renovations to old warehouses down by the waterfront are making the area a more desirable place to spend an afternoon.  And now they have a Shake Shack!\n\nI'm sure many of you have been to other SS's in the city... this one is similar... but here are a few things you'll want to know about this particular Shack: \n\nThe location is great - offering up fantastic views of Brooklyn Bridge and the Manhattan skyline. \n\nThere was a long-ish line when I popped in around 12:30pm recently but moved quickly.  When I left 30 mins later the line was 2x as long. \n\nThings can get a little cramped by the condiment/plasticware counter.  After you order - get your napkin, straw and little plastic cup of ketchup and move out the way.  Your buzzer will still work anywhere in the restaurant. \n\nThe dining rooms are spacious and have a variety of tables, booths and benches for whatever your shape and size. \n\nBathrooms are large and relatively clean... \n\nService was quick and friendly... \n\nAnd the food came out quickly and was delicious.  The Shake Shack cheeseburger continues to be one of my favorite burgers in the city.  Juicy burgers, melty cheese, soft potato rolls.  Yum yum yum. \n\nOh and the crinkle fries are backkkk!!!  \n\nI've been waiting for this return for so long!  And they're seriously better than they were before.  Golden, tossed in a little salt and pepper.  I've missed them so...\n\nSo glad this location (and all the others) have them back on the menu.", "author": "Alyssa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-10", "description": "Shake shack burgers can be compared to five guys and In-and-out burgers! I think they have more on their menu, but as someone who likes a pretty basic burger, that didn't matter to me. It was my least favorite basic burger out of all of them. Still think it's something you should try at least once, most people really like their burgers.", "author": "Melina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Is this the best Shake Shack? It's definitely in the running. Where else can you sit in the comfort of air conditioning with a clear view of the Brooklyn Bridge while snacking on a cheeseburger with peanut butter and bacon? And yes, that's a \"secret\" menu option. One of the cashiers knew exactly what we wanted and the other laughed at the novelty.\n\nTons of seating. Also, they do pitchers of the Brooklyn Brewery Shackmeister beer.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Love shake shack! They should be called crack shack! I still rank shake shack as the #1 burger place including west coast's in and out! Just something about their soft buttery bread and fresh meat patties. I think also bc they season the patties. Idk, but every time I see a shake shack, I must! They have the new cheddar bacon burger now which was really good too! For anyone who hasn't had a shack burger yet, you better get on this...life changing lol.", "author": "Priscilla C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-26", "description": "I had to find out what all the hype was about..after seeing the lines for years at the original location I figured it must be great but I was not about to wait that long for a burger.\n   Was by the Dumbo location and thought I must finally test them out.\n   The place itself was pretty nice for a chain and very clean. The line moved quick but after ordering I waited about 15-20 minutes for a cheeseburger and cheese fries!\n   First of all it was 10 and change for the two items. The burger I have to say was so-so. Small with a oily bun. The cheese fries were blah..Nothing special at all.\n   My friend bought a burger and a chicken sandwich that he split with me...neither one of us ate anymore than the first bite. I believe it is a new item and I would suggest to stay away. Whatever type of sauce (something similar to tarter sauce) they put on it made it inedible.\n   I doubt I would return and just do not believe this place has blown up the way it has.", "author": "George G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "This was my first time at any Shake Shack. I wanted to see what all the hype was about. I wasn't disappointed, but I wasn't blown away, either. \n\nThe food: I ordered the mushroom burger. My friend ordered a burger and fries. We shared the fries, which were delicious. The mushroom burger was good but it wasn't anything special. I had been walking around all morning in Brooklyn, and it appeased my hunger for the time being.\n\nThe service: The line went fast. The order-taking went fast. We waited about 10-15 minutes for our orders to come out. \n\nThe facility: HUGE, but we sat outside because all the tables were taken. \n\nPayment: Paid with a Visa gift card, so I can't speak to if they take American Express or not.\n\nOverall: Recommend going at least once. They are all over New York, and there are at least two of them at Terminal 4 at JFK, so you can catch it on your way out of New York if you didn't get a chance while in the city.", "author": "Di W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-25", "description": "Ok for starters, it is not very clean, tables are full and good is to say OK. I have been to shake shack many times at other locations and they were eh. This place was more on the yuck side, well, that might be a little extreme, but it needs some help.\n\nA review by RodeoRestuarantReviews", "author": "jill l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "This is where I had my very first Shake Shack experience. I don't know if it was because I went in with low expectations or it was really good but I loved my burger, cheese fries and ice cream dessert.\n\nThe Shake shack sauce was great, plenty of condiments available and the cheesy fries were amazing. The sauce was delicate and abundant yet the crinkle fries stayed crispy on the outside and piping hot and soft on the inside.\n\nMy burger stayed intact and the bun was soft like a brioche bread and a tomato and lettuce was fresh. \n\nAnother great thing about my very first Shake Shack experience was the location. We ate outside. DUMBO was gorgeous that night. \n\nFudge-eddabouddit was The name of the chocolate ice cream cup we got. It was pretty good. Chunks of brownie inside of soft serve chocolate ice cream with delicious chocolate sprinkles on top. \n\nIf I ever get the opportunity to eat here again I will go for it.", "author": "Serena A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-11", "description": "Total disappointment today..\nI got a shroom burger to go and I bit sand (?) with every bite.. I guess either they did not wash the mushroom well or they dropped the patty on the floor and picked it up and put in my burger.. I don't know if I am the only one with this bad luck but I never had this with other locations. I could go back and make a complaint at the store but I was with my two kids and too busy with them...luckily other burgers were fine as usual.. but I spit out my burger and threw out the rest.", "author": "Sungsil H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "I love Shake Shack. They make one of my most favorite burgers. Not a big fan of their French Fries, but I come here for the burgers. Their shakes are good too.\n\nThis location is located in a popular tourist spot in Brooklyn, but I never had a tough time finding seats.", "author": "Rashid M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-08", "description": "Our friends took us here today because they have the best burgers and creamiest shakes in the Dumbo area of Brooklyn. Our friends were right, they do have good burgers and their shakes taste really good especially the cookies n cream flavor. The place was nice as well.  However, when we went there, their AC didn't work in some areas of their restaurant.  So it felt like an oven where we sat and it was not pleasant at all while eating our food.  I brought it up to their manager, Andrew.  I wanted to let him know how hot it was in the restaurant and how we were very uncomfortable eating there.  He was very apologetic and he was offering us something to make us feel better.  But we didn't take it because we weren't trying to get anything for free.  We just wanted him to know the unpleasant experience we had. As a manager, he is suppose to handle those things immediately.  Especially the AC problems they have.  Because it is hot and humid in New York during the summer time. Don't go there until they fix their AC!  That is the reason why I am giving this place 2 stars.", "author": "Fernando M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}