{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-07", "description": "Five Guys is way better. You atleast can get a double burger for cheaper then here. I went here because it was such a popular place.\n\nI'll pass.\n\nYou dont get a lot of french fries (compared to other burger joints), burgers are pretty small.\nI wouldnt say there was anything special about the food here, maybe the shakes but i didnt order anything other then the burgers \u0026 fries.", "author": "Shanti H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-22", "description": "Burgers were good but the lack of tables and chairs make me not want to eat there again. I had to eat outside in the cold. I'll go to a diner or Burger King.", "author": "Felix F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-27", "description": "SImply put...it's an expensive burger but it's a Good @$$ Burger!\nNot too fond of the fries and I haven't tried the shakes but I come here every now and then to pick up a double shack burger and I am literally never dissapointed. \n\nP.S: For some reason I get a little sleepy after eating here...weird.", "author": "Kristian S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-01", "description": "Ok so maybe shake shack doesn't truly understand being green. First and foremost the advertise being green throughout the restaurant however when you go for a drink refill they have you dispose of your paper cup to get another, slightly counter productive I think. Portion control is alive and well at this establishment with mini burgers and fries you get just enough for your fill.", "author": "Mekela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-30", "description": "Amazing burgers!", "author": "Nicholas R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-04", "description": "I don't get it. I really don't. They taste like McDonald's burgers, but more fresh (I'll admit that's a good thing, but SO AVERAGE!). And the cheese sauce on the fries? Like melted butter. And the fries? Like frozen fries. And the Diet Coke?... Well, some things stay the same.\n\nI came, I tried, I will move on and probably won't come back.", "author": "Tanya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Realizing I was the oldest one there 30-34age group I took my order to go.  Food is always delicious.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "This was my very first Shake Shack experience, and boy, was I super excited! On a recent trip to NYC, this was the very first stop I made after spending hours sitting on a cramped bus. It was exactly the pick-me-up I needed.\n\nThis place was so packed! I'm guessing it was because of the lunch rush... Luckily, the lines moved quickly and the wait for my food wasn't too bad. I was also able to snag a table after a few minutes waiting around. The space is pretty big and accommodating, so I wasn't too concerned anyway.\n\nI got the classic Shack Burger and a small side of fries. That burger was downright delicious! It was the perfect amount of grease, meat, cheese, and patty. I'm salivating just thinking about it. I was disappointed with my fries though... Maybe it was the crinkle cut, but they just didn't do it for me. I also didn't get to try the shakes or the custards because I was so stuffed. I'm determined to order them the next time I'm in the city.", "author": "Sue H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-21", "description": "4 stars for a tasty vege burger and great fries. \n\nI've had fries at the original shack in Madison Square Park before. I only found out recently that they opened up some chains. \n\nThe daintiness of the burger really shocked me. Even though I ordered a vegetarian burger I was expecting a true American sized burger with a 2 inch thick patty. Instead I got a bite-sized (by American standards) burger. It was an okay portion for me (with fries) but I think for a lot of people it might be too small. On the other hand, the hot dogs seemed normal sized. \n\nGreat service, friendly waiters. The place is always packed but it's not too hard to find a table.", "author": "Jamylin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "Like the best burger on the planet earth! Period! Lines are still long at this location but not as bad as their Madison Square Park location.", "author": "Jin Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-06", "description": "Beej and I, my Southern and all-around comfort food loving friend, we love us some Shake-a-Shack.  it first started about two years ago when the Times Square location opened.  We would do one of two things:  go out drinking and then stumble into the Shack, or we'd stumble into the Shack and then out drinking.\n\nNow, it's been a while since Beej and I had done the Shack, but we'd been anticipating for this new Brooklyn location to open.  Beej lives down the block from the place, and I'm jealous of that, but my waistline isn't.  I didn't realize they now had draft beer and wines.  So of course I had to order a Shackmeister Ale to go with my Shack Stack and Cheese Fries.  At $5 for the draft, not a bad deal at all.  Beej got a Cheeseburger, Hot Dog, Cheese Fries, and a Shackmeister Ale.  When we go out, we go hard.\n\nNow we both loved the toasty bun and tenderness of the burger.  However, I wasn't impressed with the cheese fries.  I could have done without the cheese.  The fries themselves had a crispy texture and the perfect amount of crunch as you bit into them.  I really like the Shack Stack, but I think I could do without the mushroom.  Except when you first bite into the burger and there's this cheesy explosion and light mushroom taste.  It's definitely an experience, but throw me a slice of American or Cheddar on top with a special sauce and It'd be just as well.  Beej enjoyed the Hot Dog, really liking how they split it before they throw it down nekkid on the grill.\n\nThe staff at this location is extremely friendly and curteous.  When you're in Downtown Brooklyn at 10pm, this is definitely not expected.  A staff member even came around as we sat down and asked it was okay to wipe the table just in case it hadn't been done before the last customer left.  It's pretty obvious how the little Shack in Madison Square Park has gotten a lotta Shake and sprouted up all over NYC.", "author": "Jonathan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "Had an amazing taste experience. The burgers are great on their own but my shake shack shroom burger has me drooling just describing it. My Newby girl friends loved the well seasoned beef. The cheese fries comes with artifical sauce and freshly cut and fried shoe string fries. Wish I owned stock in the company good lol;)", "author": "Jenal J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-03", "description": "Couldn't finish the burger. Tasted alright. But it was riddled with bone pieces my teeth are still hurting. Fries are clearly frozen.", "author": "Jeremy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Delicious and nice staff.  I love how they have two lines, one for drinks/shakes and one for food. Very efficient. Thanks!", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "The proximity to NYU-Poly is dangerous enough without the added benefit of the greatly reduced wait time, compared to other locations in NYC. Nevermind the location exclusive concretes with toppings like Early Bird granola and Mast Bros chocolate.\n\nIt's not the cheapest place to eat, seeing as it's hard to justify coming to Shake Shack without getting a burger AND a shake. And if you get fries and a drink as well, your bill is going to be as heavy as your caloric intake. It's a good place for that guilty pleasure splurge every once in a while, though.\n\nThe service was remarkably friendly for the first month or so after opening, but I've noticed every so often, I'll get someone at the counter who seems to be having an off day or is just downright rude.", "author": "Piper M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "Soooooooo gooooood, and great prices!\n\nClever headings on the menu, and titles for their different items.\n\nFriendly young staff, great location, chill environment (though the mostly black paint job could use some more color).\n\nPlease come the the Bay Area, CA ASAP!!!", "author": "Brendan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-18", "description": "On my Friday lunch break from jury duty, I decided to go to Shake Shack.  It wasn't as crowded as thought.  The staff was friendly and ordering was quick, but the wait time for the order was quite long; I would say 10 minutes.  I ordered a single with a strawberry shake for exactly $11.  Even with the low turnout, there wasn't much seating so I strolled over to Borough Hall and easily found seating.  When I bit into the burger, the first thing that came to mind was, damn this is salty!  Other than that, it was juicy and small (if there is a next time, I will get the double).  The shake was good, but does not compare to the Potbelly ones which has bits of strawberry and is much thicker.  I will not go out of my way to visit again.", "author": "Wintsun T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "So glad they brought Shake Shack to Brooklyn. There is nothing too special about Shake Shack, but they are very consistent. I have never been to Shake Shack, and been disappointed. The fries are amazing, the burgers are even amazing. I recommend the Shack Stack with bacon. Although Shake Shack is fairly over priced, I still enjoy it frequently.", "author": "Brandon C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-30", "description": "Another place that does what it says on the tin.  We actually went there because we wanted to see the \"Before I Die\" wall, which is no longer standing.  There is a photograph on one of the walls showing a section of one of the panels, it was a bit of a disappointment.\n\nWe had shakes for a snack, they were OK -- I am not sure what is supposed to be special about them and have no idea if it is a big deal to get a Shake Shack.  Shakes are $5.", "author": "Christopher K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-19", "description": "although i did'nt try there shake ,  i had a cheeseburger and fries want bad , the fries were nothing speaial ,, they closed down  i guess the yuppies didnt want it , hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh", "author": "Francesco B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}