{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Never had a bad experience with shake shack. Came on a particularly busy night (event on the piers). Even though the line was so long, the employees managed it so well and we placed our order without hassle. Then we waited some more for our food to be prepared. The nice lady restocking the supplies was so clutch. We needed to get napkins and she was like, \"I got you\" and hands us a stack. Better than us standing there pulling them out one by one.\n\nFood is always amazing. Shroom burger is now my go to even though I'm not vegetarian. Had to get the local concrete (blueberry pie thrown into vanilla ice cream).", "author": "Joey L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "The best fast food burger in town lol.  Love the food here and it's right by the water.  I have to get a chicken and a regular burger all the time.  I think I can do four of these.  Maybe I should try next time lol", "author": "J L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Competing against the long lines of Juliana's and Grimaldi's, this DUMBO location of Shake Shack more than holds its own. I really liked that they have multiple lines, and while the lines can get kinda crazy outside, it's actually managed as well as they can be. The seating area is also decent, and when the weather is nice, you can sit outside at the tables or on the steps and really soak in the views by the water. \n\nGo-to as always, is the ChickenShack. This isn't to say that the burgers aren't good, but I honestly find myself ordering the ChickenShack every time, simply because of how crispy and tasty the chicken is. Paired with the pickles, mayo and inkling of lettuce, it's just a solid, consistent sandwich every time. The opinions on Shake Shack's crinkle-cut fries are very polarized, but I tend to like them from time-to-time. I think I still like shoestring fries the best, but I'm not opposed to eating Shake Shack fries every once in a while.\n\nService has always been relatively quick at this location, although as previously mentioned, the lines have always been long. I'm a bit perplexed as to why the water fountain only gives out two drops of water per minute, when there are so many families with kids who don't want to buy their bottled water. I'm exaggerating though. It's actually more like 1 drop of water per minute. So frustrating. Prices in general aren't cheap compared to places like McD's, Five Guys, etc., but I honestly do believe the value is there, since the quality is better than most fast food burgers.\n\nThe views of the Manhattan and Brooklyn Bridge, as well as the direct access to the park really make this location one of the best. You can enjoy your fast, fatty foods with some of the best views in New York. And don't forget to get some icre cream or a concrete to go with it.", "author": "Eric J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "Perfectly located at DUMBO!\n\nI love their 'shroom burger, which contains a fried mushroom with cheese that oozes out with every bite. The burger itself is amazing and I'm not usually a fan of burgers, so that's saying a lot.\n\nOverall, recommended!", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "I just finished watching the sunset at the Brooklyn Bridge Park and was looking on Yelp for somewhere to eat. I found Shake Shack and knew I had to give it a try. Living in California , there's often this east coast / west coast rivalry as far as which is better (In n Out or Shake Shack). I was going to see for myself . \n\nNo outdoor seating . It would of been nice since it was a nice evening outside. Line was short , but almost all the tables inside were taken. I went with the Shack Burger and BBQ bacon fries . I placed my order to go, just in case I couldn't find a seat by the time my order was finished . They gave me a buzzard to notify me when my order was ready. \n\nAfter about 10 mins, my buzzard rang and I picked up my food. I was able to find a seat at the high top table . \n\nThe burger was good. Everything on it completed it well . It was nothing special though, I found the In n Out burger to be better in taste. The fries were just OK. I find the animal fries at In n Out way better. \n\nOverall the food was good and service was good. Place was clean and spacious . But I have to give In n Out the W For this one .", "author": "Eddy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Wow. Very clean.\nNow for the food... I ordered the shack burger with the shroom burger. I forgot what it's called but basically it's the shroom and shack patty together. It was $10, but SO good. I'm very picky about fast food burgers, but Shake Shack was just on point. It blew my mind away. I loved the flavor of the beef patty... and it was cooked perfectly. The bread wasn't distracting (as in, it didn't taste like a waste of calories). The shroom patty was also delicious and paired very well with the beef patty. The cheese and mushroom inside it was perfect. \n\nI also tried the black and white shake. It was really good too. But, I'm not really a shake person as I prefer the custard ice cream itself.", "author": "Mai P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "As always, delicious burgers. \n\nBecause this location is right next to Brooklyn Bridge Park, I was worried that lines would be long and no places to sit. However, I was wrong. I got here around 5:30 to grab dinner and the line was not long at all. I had the shackburger with NO salt, fries with NO salt, and a strawberry mint lemonade. Per usual, burgers and fries were good. It was my first time having the strawberry mint lemonade and I really liked it. It wasn't overly sweet or sour but just right. \n\nWill be back when I'm in this neighborhood!", "author": "Jane M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Ok so I needed to check out what this Shake Shack hype was all about. Being from Los Angeles and someone who doesn't eat red meat burgers; I figured it would just be ok. \n\nWell I was wrong. I got the mushroom burger and it was Amazing!! It isn't your typical party made from mushrooms. No, it's a fried piece of mushroom deliciousness with an oozing Monterey Jack cheese center. Complimented with the sauce they use on the burger; I was in love.  Though it is a bit small; it did fill me up when paired with a Dr.Pepper. \n\nThe Peanut butter shake!! Yum! That was also so creamy and perfectly flavored. \n\nI admit; I've eaten here now 3 times in the past week and a half. Getting the same mushroom burger; and I am yet to be disappointed.", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "The chicken burger is pretty good- no lie. I only tried the burgers bc I was like how can the chicken be good...WRONG. \n\nChicken is tender AF. It's better than chick fil la breaded chicken BUT if you get the grilled chicken from chick fil la then it is better. I am only talking about the breaded chicken bc they both make breaded chicken. Shake shack only has one kind of chicken sandwich. \n\nChicken sandwich may be better than the burger ...\n\nCrowded place but moves fast- not much seating outside, gotta fight for it...", "author": "Jessie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "It's been a couple weeks since Father's day and I'm just getting to writing this review.  I actually did the survey online but there was no place to recognize any exemplary employees, so I'm going to do it here. \n\nThis has by far been my most pleasant Shake Shack experience.  I usually go to the Times Square location which is always overcrowded and packed. \n\nIn this case we came there shortly after it opened and I was having a rough morning since we've been at BBP for a few hours and it was HOT as hades outside, and my little toddler in his terrific twos was starting to go nuts on us. \n\nI'm thankful that we encountered Rashad this day since he did everything he could to make our Father's day better.  That really was a welcome surprise since you usually don't get that kind of service and attention when you're just eating at a fast casual restaurant. \n\nOh and the food was good as usual.", "author": "Richard D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "The time we came it was super empty which my partner and I enjoyed very much! We ordered chicken shack sandwhiches and one shroom burger to share and of course cheese fries!!! The chicken shack burger was delicious! We also enjoyed the shroom burger but found it not very filling. The cheese fries are without a doubt the best!!! They are super savory and crunchy! We also aplit up a cookies \u0026 creme milkshake and omgosh it wa sone of the best milkshakes Ive ever had and that says a lot!!", "author": "Miriam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "They get my order correct every time and I don't ever have to wait long for my food to be ready! I would also really recommend using the app to order ahead if you are picking up food to go. They will have it ready in minutes and you won't have to wait in line!", "author": "Sam S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-24", "description": "Great fries but forgetting to make my burger and the smell of cleanser, whatever the hype, it's just that hype. I give it a wholehearted meh!", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Shake Shack is pretty much the burger king of New York. It is amazing everywhere you go. In this particular spot, they have it near Brooklyn Bridge Park where you can sit down and eat outside with great views. The line goes by very quick and the food wait time is average. As for inside seating, the place is based on a classic wood theme with plenty of seats and plenty of space. If going to Shake Shack I would recommend the Smoke Shack, a classic burger with cherry peppers and shack sauce that tastes amazingly good. Overall, it's a Shake Shack, a very great burger spot, and in this location particularly, you can enjoy your meal with a nice view of the pier and the Brooklyn Bridge.", "author": "Taylor N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Just stopped in for a small bite with my bf.  Ordered a beer and crinkle fries to share.  I'm not much of a beer drinker, but I thought the beer was decent, had a spicy flavor.  The fries were so good.  It was super crispy! (I stopped ordering fries from the other shake shack locations because they were too soft and under-fried).\n\nThere were plenty of tables on a rainy Sunday night, but I imagine it will be very difficult to stack a claim to a table during peak hours.", "author": "Ping F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-21", "description": "This place is always packed because it's near Brooklyn Bridge Park. So many people inside and the lines are always long. Tourist, non tourists, just people everywhere all trying to attack the next open table for seats. Be smart and have someone go find a seat while another person orders. Or else you will end up getting your food before you find a seat. And if you thought the line for food is long, wait til you have to use the bathroom. I've been to several shake shacks and this one more than once. The food is pretty much all the same and can't really go wrong, but who knows something somewhere or someone can mess up, just not hoping for it. Although the line for food is long, once you order the alarm they give you to hold sounds/goes off pretty quickly. \n\nI always get one of their burgers (duh) but depends which one I'm feeling that day, cheese fries (uh duh isn't that a must too?), and a strawberry shake (why not?). Their shakes are so thick, it's literally ice cream with not much liquid. You have to either wait for it to melt or just suck real hard (you know I mean the straw so no pun intended).", "author": "Tom L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "The burgers at Shake Shacks are wonderful. The price is high compared to other places but maybe its the quality that is driving up the prices. Their french fries are also delicious as well. Both goes well together!", "author": "Neal C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-29", "description": "Meh! But maybe it's just this location? The foot traffic here is insane because BK Bridge Park is definitely a tourist hot spot. I commend their staff on their excellent service. Smiling at each customer despite the heavy volume and heat. \n\nI usually love their burgers!! Unfortunately my shack burger was disappointing compared to their other locations. Wasn't as juicy. Oh wells!", "author": "Daisy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "I came here around 11:20am on a Friday.  It was not really busy here and the menu was on the right wall near the register.  I had looked at the menu online before to get an idea of what to order.  \n\nI ordered the Shack Stack ($9.59), Fries ($2.99), and a large soda ($2.80).  I received a pager and sat down.  A few minutes later, my food was ready and I went to pick it up at the counter.  The Shack Stack was delicious and it looked like a lot of food at first.  The big mushroom in it was good and definitely worth trying if you loved mushrooms.  The Fries were crinkle cut fries and were good in my opinion.  Crinkle cut fries were one of my favorite fries in general.\n\nOne thing to know about this place was the bathroom was only for paying customers.  There was a keypad on the two doors so you would need the code found at the bottom of receipt. \n\nThis place was great and had a view of the Brooklyn Bridge which was right next to this place.  It got busy around 11:45am with almost no tables available.  Come early if you can!", "author": "Daniel H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-30", "description": "Of course I had to try Shake Shack to see what the hype over this place was all about.\n\nMehhhhhhhhhhh. I still prefer In N Out over Shake Shack.\n\nI ordered one of their specials that was pretty much a cheeseburger with sautéed onions. My boyfriend got a double cheeseburger. My sister ordered a chicken burger.  The three of us were disappointed with our orders. It was seriously nothing special. My sister gabbed so much about how she loves their burgers, but that day, she wasn't really a fan of their chicken burger. We all shared an order of their crinkle-cut fries. It reminded me of my elementary school days haha. I liked how crispy the fries were. I was kinda scared the fries would be soft and mushy.\n\nThis location looked pretty new, very clean, and very well air conditioned inside. \n\nBuuuuut yeah, Shake Shack didn't live up to its hype.", "author": "Steffi G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}