{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "V friendly service and food even bette than last time! The smokeshack burger is sooo good, and the purple cow grape soda float was great, as was the caramel apple pie concrete.", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-14", "description": "Much higher price point and not nearly as tasty as the infamous burger joint from the better coast. \n\nDon't get me wrong, the burgers are good here. However, this burger joint is totally overhyped and overpriced. \n\nSorry, Shake Shack, In-n-Out wins.", "author": "Ashley V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "Fries so good you'll regret you dipped.\n\nI will admit it...I was a shake shack skeptic. Anytime the cost for a burger and fries climes into the double digits my cynical bells sound.  Walking into shack shack you will notice that its not like your everyday burger joint.  This place is well decorated inside but its tastefully done.  The menu was alot more vast then I had anticipated with offerings not limited to burgers.  There are vege options, hot dogs, ice cream, beers etc available all displayed on a large board to your right.\n\nI have my standard foods that I order to judge each category of restaurant by.  Pizza place? Plain cheese slice. Italian sit down? Chicken parm. Seafood? Lobster. Burger Joint? Double cheeseburger and fries please.\n\nI ordered a double cheeseburger and fries.  They give you an electronic buzzer thing to notify you when your meal is ready to be picked up.  As you wait make your way over to the condiment station that offers ketchup, mustard, and mayo.  There is also a cool beer tap style dispenser from which you can pour yourself a cup of water.  For me this is a huge plus since I rarely order a drink. When most places make you awkwardly ask for a cup of water, this place feels me, they know I just spent the rest of my rent of cheese and deep fried potatoes. \n\nThen it happened, as a stared hungrily into my girlfriend worried eyes time seemed to slow if not just for a few fleeting moments as my buzzer went off and let me know my meal was ready.  \n\nThey do a really good job with the presentation.  If you order it to stay,the burger is wrapped in paper on a stainless steel tray.  The thing just looks good, but it tastes even better. I know you are suppose to use the paper to hold the burger, but rip that puppy off and release that cheesy bad boy from its papery shackles.  I honestly have never had a burger that the cheese has actually become one with the burger in the same way as this.  It in some magical way melted perfectly with the grease from the burger to create this creamy cheesy sauce for which the beef to bathe in.\n\nGenerally, I am not a crinkle cut fry guy. These made me change my mind.  They are literally everything you would wish a fry would be.  Medium to thick density with a moist interior and a golden crunchy periphery.  Probably more salt then I would have added but it wasn't over done.\n\n\n\nCant find anything negative to say about this place. If you asked me which was better Shack shake or In-N-Out I would have a hard time judging the difference between the two because they are both so similar and good.  In-N-Out is ppriced slightly cheaper but offers less in the ambiance category. \n\n5 out of 5", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-10", "description": "Needed to use the bathroom - but was told I had to order food first. Which is fine because that's why I came to shake shack. To eat.\n\nWhat wasn't fine - was her telling me it would be another 15 minutes because we had to wait outside in the blistering heat in order to enter and order. She just kept saying \"This is the line.\" As we peered past her and saw Ions of empty space in the order lines and the restaurant's front area. She also proceeded to tell us some people wait 2 hours at other locations and \"it's worth it.\" Yes, they wait outside by choice - because the restaurant is full... \n\nAlso weird... my friend and I were told by the hostess we needed to order at the door, which seemed very odd to me. She asked if we knew what we wanted; I said yes and began to order. \"No, you order inside.\" What??? She was very rude. \n\nThis is not a club; why do you have an attitude at the Shake Shack door?!", "author": "Stephanie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "Being a Californian, I enjoy my juicy burgers with hella sauce and veggies. This burger is simple, bun - meat - tomato - ..... that is all I can remember but it is GOOD. I especially love the crinkle cut french fries. I am a fry-fanatic so these get 5 stars. Everyone who eats at shake shack compare this to in n out, but I think both places provide a different feel of the food. Shake shack to me is a classy burger, and in n out is basically, In THEN out. HAHA, overall, this burger is hella good and whoever comes to NY needs to try one before they leave.", "author": "Katie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "It recently occurred to me that I've been to a fair number of Shake Shacks in the city (6 to be exact) and never reviewed any of them. Oops. So here goes.\n\nAs far as location goes, this is one of the nicest. You get the Brooklyn Bridge and a slightly less hectic wait compared to the hordes in the Manhattan locations. \n\nMy visit here predates the Chicken Shack and its accompanying frenzy (future review of other Shake Shack location to come). \n\nWent with a group of people. It's worth noting that this particular location is not well suited for a large group (6 people or more), as there is only one table in the restaurant that can comfortably fit that many people, and it appears to be mostly utilized by individual stragglers who can't (or won't) get their own table.\n\nA few people in the group wanted to check out a \"secret\" menu item, the cheeseburger with peanut butter and bacon. Confusion ensued with our cashier when we placed our order, but the cashier next to her knew what we were talking about, and we had a good laugh about it. I consider myself a traditionalist (which will be violated in my future review of other Shake Shack location to come) and stuck with my usual single Shackburger, cheese fries, and root beer.\n\nI have no complaints about my order, all was as expected. We had a little fun trying out the cup of peanut butter sauce that came with the \"secret\" peanut butter bacon cheeseburger. For anyone who ever wondered, peanut butter and cheese fries do not go together (although it was not unpleasant either).", "author": "Steph C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-23", "description": "This is probably one of most tourist shake shacks of all shake shacks in NYC since you're near the park and bridge. You're probably better off ordering via app as it takes too long to get your order. Add a ton of strollers, tourists, and teenagers and you get DUMBO in a nutshell. The food is pretty good though!", "author": "Jay M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "Not only are the burgers over priced...they are are too salty and too small.  The so-called cheese is a slice of processed yellow plastic.  The fries are frozen krinkle fries of which they give you the smallest handful.  (compare to the generosity of Five Guys thick cut fries)  The shakes are melted vanilla ice cream.   Lemonade is diluted with stale tea.  To top everything off, there is a lack of seating and always a hassle to find seating.\n\nI would gladly eat McDonald's burgers and fries over this over-marketed garbage.  At least McDonald's prices their junk food appropriately and for what it is.  Shake Shack CEO sells this stuff as if it is gourmet burgers.  Give me a break.  This is the greatest conjob in the history of junk food, pulling the wool over those who are too weak minded to know that they are being conned.\n\nA recent issue of Time Out New York, listed stuff in NYC that is over-rated and stuff that is under rated.  Shake Shake definitely TOPS in the category of OVER-rated.  Under-rated: Five Guys.", "author": "Dina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "As always Shake Shack gets 5 Stars  they are always up to being perfect I get mad when I have to leave cuz I want more lol", "author": "Qeuyl .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "Excellent customer service when I was ordering my food! Love this spot around dumbo. It usually packed so limited seating. The food takes long to come out as well but it's worth the wait.\nI got the smokeburger with cheese fries . It taste so good!", "author": "Christy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Very reasonable for the price. Basically the meat was high quality beef, but the bun, lettuce, tomato, and onion tasted like they were from McDonald's. The milk shake was similar to in-n-out, which was interesting, but actually rather tastey. The staff was very friendly and the wait was reasonable. If I was just getting a single patty, I'd definitely come for lunch more often. They also have beer on tap which is a concept I love for fast food, but the prices for brews aren't cheap which is expected. Solid experience overall.", "author": "M K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "Good eats, shack burger is hands down my favorite! Cheese fries + bacon shack burger!", "author": "Alan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Great burgers, especially the roker burger. The shakes are really nice, we took the vanilla, chocolate and salted Caramel. The service is fast with a smile, however, it is not the place for gluten free avoiders. The chain should be aware that there are people who chooses to eat gluten free food not because they are allergic to it, but because it is not part of their diet. Just offer a gluten free bun, and I will be the happiest guy on earth \nThe location is perfect in front of the Brooklyn bridge with a nice spot.", "author": "Zach F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "I have got to give this location kudos for their service. From the host that deals with crowd control, to the lobby attendant, to the cashiers \u0026 servers, they all provided excellent service. Customer service goes such a long way in any business so I must commend them all.\n\nAs most ppl know, shake shacks are always very crowded, so I'm sure it's non stop work for these employees. The host at the front door was so very friendly, helpful \u0026 did a wonderful job of keeping the lines moving without being rude in any way.\n\nThe lobby attendant made sure all napkins \u0026 condiments were full constantly and he also kept the place very clean, with a smile and nice words. As I was waiting for my order about to get my condiments he greeted me and asked if he was in my way. I replied not at all. He then said \"if there's anything you need, just let us know\" \n\nThe cashier who took my order had a smile on her face \u0026 everyone was working super fast to get orders completed.\n\nWhen I finally got my food (it took a while, the host came over to check what was going on \u0026 actually got it for me, I didn't mind the wait though I understand how busy they are) my food was hot and tasted very good. My burger was cooked to perfection \u0026 my fries were hot \u0026 crisp. I can't complain at all. As I was eating the host looked over to us to check on us \u0026 I gave him the thumbs up sign.\n\nIf anyone from this business is reading this, I hope you give your employees kudos they deserve that and so much more. I was there yesterday Sept 6th @ about 7:00pm.", "author": "Kat R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "Like all Shake Shacks, I am in love with their burgers. It is fast food that doesn't make me feel like a total pig and their employees seem much happier than other places. The prices are great for what you are getting. I especially like this location because they hosted an adoption event for Badass Brooklyn Animal Rescue and provided doggie sundaes to all the hot doggies. The location is gorgeous. There is a nice view from outside and you can sit at one of the folding tables outside if you want.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "First time here and My boyfriend myself and my kids enjoyed it. I got the spicey chicken sandwich with slaw was tasty my boyfriend and kids got cheeseburgers and they loved it. Shakes were good too!", "author": "Chrisann N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "I'm from Southern California.  To us In-N-Out is the epitome of the quick burger.  I was skeptical of shake shack because i thought nothing could be better than in-n-out.  I was wrong.  The bread is amazing, which really takes the burger to another level.  I had this immediately after eating Grimaldi's next door and I still thought it was the best quick burger, which let me know it was better than in-n-out.  \n\nI did not try their fries or their other goodies.  This also doesnt quite compare to in-n-out because this is pricier than in-n-out.  The secret sauce is probably better at in-n-out, but just overall i think this burger was amazing.", "author": "Eri A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "Definitely my favorite Shake Shack location, so convenient to eat in or to go and eat at the Brooklyn Bridge Park.\nIt's not super huge inside (love the tables! handcrafted in Brooklyn) but there's enough seating space - even with a bit of a view of lower Manhattan lights if you sit by the windows - and there are also some tables outside, as I wrote though, it is best to get your order to go and eat at the park.\nPerhaps I was lucky but when I went there (Friday afternoon) there was no line to order and everything was ready as we had a seat!\nBurgers are yummy as always - my favorite is the Smoke Shack with cheese, bacon, cherry peppers and shack sauce... Delicious! Burger and soda for $10 - good deal! just wish they opened one in Milan! (why only in London?!?!)", "author": "Mar L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "Shake shack the burgers are really good and the fries are good. The portion isn't too bad but you definitely get filled. The atmosphere is really nice in here and the service isn't too bad, a lot of people come around here to grab their burger fix.", "author": "Vicky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "I'm from California and in California we have In N Out which I heard is comparable to Shake Shack. So I had to try Shake Shack for myself and the winner is....HANDS DOWN: SHAKE SHACK. First let me explain to you why. Their burger to bread ratio is perfectly balanced. The meat patty is cooked well but not burnt and the meat patty is thick, unlike In N Out which is paper thin, sadly. The veggies are fresh (well so is In N Out) and the sauce was pretty good. The vanilla custard at Shake shack is....THE BEST, better than the mediocre shakes at In N Out. OMG. Bring Shake Shack to California please!\n\nThe location here has great customer service and they do try their best to meet your standards and expectations. They forgot to make my brother's plain cheeseburger and I had to remind them twice. They either felt bad or they made two accidentally but this \"mistake\" resulted in two plain cheeseburgers for my brother. Which made him a happy camper. \n\nAll in all I believe I had the best burger experience at Shake Shack and it is an unforgettable experience.", "author": "Irene L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}