{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-25", "description": "Omg heart attack waiting to happen but the best heart atrack you\"ll ever have. Tastes like homemade burgers but delivered fast.", "author": "Ashleigh D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "The line always moves fast and before I know it, I am out the door with my lovely burgers and fries. The Shackburger is soooo tasty and just the right size, not too large, not too small. The fries still taste good by the time I get home. And I get serious wife points for bringing the hubby his own Shackburger and fries, a win-win all around.", "author": "Ellis S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "The fries and shakes are asome!  I just wish there was a veggir burger...I'm not a fan of the shroom burger.  The wait at this location is not bad compared to others in the city.", "author": "Felicia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "I think Shake Shack should be under investigation by the FEDS because I swear crack is in those burgers. The wait here is usually long as can be, but at 8:30pm on a Sunday I was in and out. The staff is always nice here and of course my Double Shackburger with Fries was even nicer. I've been to a ton of burger joints and Shake Shake is still one of the best in town. Who'd have thought a Brooklyn location would have been that good though?", "author": "Sonny A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-27", "description": "It's Shake Shack, so you kind of know what to expect. At this location, the quality (especially in terms of meat preparation) can be a bit uneven. Also wish they paid closer attention to lettuce freshness/selection - nobody wants a sad dark green leaf.", "author": "Irina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-30", "description": "Being from the west coast, I'm OBSESSED with the Shake Shack.  The Shack Stack burger is, I think, one of the great food inventions of all time! I've been visiting in NYC for 3 weeks and have been to the Shake Shack 4 times! LOL! No regrets, but #AbsWillHaveToWait. Thank goodness they aren't out in LA. I'd weigh 600lbs!!!", "author": "D W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-02", "description": "Shake shack is close by so if I'm ever craving a fast burger and fries, ill stop by. Their burger sauce is really good but the portions are small for the price. I love their shakes though. Especially the chocolate one. :-)", "author": "Liya D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "Their mushroom burgers are absolutely delicious! Kudos to them for thinking up a yummy, delicious, fatty, vegetarian option at a burger joint! Love their black and white shakes, too!", "author": "M J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "I've strolled past the shake shack on the west side of manhattan on a regular basis and just saw it as a \"high price burger\". I never entertained the thought of quality, much more than the cost effectiveness  of three \"dollar menu\" selections. I didn't exactly refute the idea either. Lo' and behold, Shake Shack opens on Fulton St. Far removed from the era of \"Brooklyn Bazaar\" and \"Albee Square Mall\", it seems to attract tourists as much as the local city, state and fed employees, myself included. The \"super stack\" was my first shake shack experience. Quality of ingredients were my first observation as the greens were \"greener\" and the burger was presented as such of a finer restaurant. My first bite was much later than I purchased it. I opted to save this phenomenon for dinner. Not wanting to disgrace this \"manna of the Gods\" I opted to give it 45 seconds in the micro to refluff d bread and heat the meat. The first bite was fulfilling. Not only in flavor, but substance to supplement. I enjoyed every last bite. A hungry man like myself could eat two. It leaves you wanting more. I'm appropriately pleased and see chain burgers in a dimmer light. To be finacially efficient, McDonalds Angus is also a great option. Shake Shack has a great flavor, with a gourmet presentation, in a fast food environment. Looking at it seems bitesize, but its pretty filling.", "author": "Vik D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-13", "description": "i like this location a lot better than the other. a lot less crowded and nicer seating inside. i love their daily custard flavors as well as their beverage selection. you can't go wrong with the shake stack and the cheese fries", "author": "S W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-16", "description": "double shack burger!!! I think is the best, better than In and out, five guys! The only thing to watch out for is the calories!", "author": "Eileen S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-20", "description": "well shake shack is ok..there burgers i could do at home on the grill. also the burger bread is like a kennedy fried chicken roll. overall it is ok but not for the price!", "author": "Nikel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-04", "description": "Best burgers and shakes in New York City. Hands down. No question.", "author": "El D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "The east coast has been known to deflect west coast In-N-Out boasting with the words \"Shake Shack.\" Accordingly, I walked in to the Brooklyn location of this venerable chain with somewhat lofty expectations. The Shack Burger was as delicious as it was visually appealing, with crisp lettuce and tomatoes crowning a juicy and flavorful patty dripping with melted cheese. The Shack Sauce gave it a somewhat buttery taste, adding a sweet and salty flavor to the sandwich. I'm not sure if it was better than In-N-Out, but it's certainly a close second, if only because it's a bit smaller in size than you might expect from a $5 sandwich. I skipped the fries based on the small portion and the fact that they're those cheap-looking crinkle fries that are served with high school lunches. The apricot custard (the flavor of the day) was a sweet way to cap off the meal. Of particular note was the fact that the Brooklyn location didn't seem to have much of a line, unlike this chain's flagship spot in Manhattan-- fast food should actually be fast.", "author": "Zach L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-07", "description": "It's funny, does Shake Shack taste better in Brooklyn simply because you don't have to wait on line for an hour?  The city's newest location is super shiny awesomeness perched on the apex of Fulton and Adams.  It may be the same Shake Shack brand, but gone are the garish bright lights of my last sucky encounter at the Times Sq location.  My coworker, new to the lovely decor of gentrified Brooklyn eateries, marveled at the roomy seating and high beamed glass architecture, not to mention to absence of belligerent downtown Brooklynite clientele.  My favorite update, however, would be the electronic pagers alerting you of your ready order, reminiscent of Olive Garden and its brethren, but with better food.  I went simple - just a single shack burger plus an order of fries for $6.75 total.  Though some tout Shake Shack as \"the best burger you will ever have,\" I rarely succumb to such extreme accolades.  But is it good?  Yep.  Quite.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-08", "description": "Had my first shake shack meal last night. Great concept. shakes are really good. Fries are great. The burger meat is waaayyyy salty and greasy. Kinda gross, to be honest. Though bun is excellent and if you load on fixins (pickle, L\u0026T, etc) it's ok. My son eats his burgers with just cheese and ketchup. That lets you really taste the meat. And he only ate half his burger, so that tells you something.", "author": "Eddie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-23", "description": "worst s*^thole ever....anyone that has given this place anything more than one star has got to be kidding me or you're from another galaxy and this is the first hamburger you've ever eaten...if that's the case, I apologize on behalf of all humans for the lamest attempt at a burger, ever. \nHorrendous, poor quality meat, horribly cooked burger that squirts out scalding hot asspiss poor nacho-cheese-grade \"cheese sauce\" that literally burned my hand?!\nFries - wtf? frozen fries from the elementary school cafeteria, how dare you serve these.\nCustard dessert - somebody should have stopped the machine and cleaned it out when they realized a plastic fork had dropped in the works instead of serving broken bits and pieces of it to your customers. \nThe one star rating is credited solely to the entertainment value that this place is so bad, and that  yelp won't allow a zero rating. \nA cada su proprio, I understand, but unless you're the above mentioned alien...wholly moly. This is officially thee worst excuse of a burger in the history of ground up cow.", "author": "steve b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-16", "description": "Standard issue Shake Shack, which is a good thing.  Fantastic addition to Fulton Mall.  Tough to find a seat, but genius location to have put it.", "author": "Eric T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-23", "description": "best burger i have ever had.   i hate the fact that i live in CA and there is not one here.  we ate there twice in one day because we had to get our fix before we left.  my boyfriend even just ordered the buns they use so he could try to make his own.  well done shake shack", "author": "Abby C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-30", "description": "i've now been to two shake shacks - the one in the theater district of manhattan and the new one in brooklyn. and, it's gonna be a coin flip whether i go to SS again or just go to the old dependable next store (burger king) ...i like both the whopper and five-guys single better than the shack burger ...sorry mr meyer, i'm not sold", "author": "nils v."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}