{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-11", "description": "So I am really not sure if  Shake Shack is all that good. Is it the allure of the lines of people flocking to the location pulling you in? Is it the ..dare I say it...Sinfully delicious Chicago Style hot dog available in NYC, a place infamous for our beloved street dogs located at every congestion of hurried tourist? Not sure. \n\nBut this Shake Shack caught me on a hot day. I would like to say that I like the consistency of good quality that all Shake Shacks produce, and this one is no different. \n\nMy biggest complaint would be the lay out. Due to the high number of clients that frequent the establishment, they order line, which was conveniently split in the Pick Up line, the C express which is for ice cream, wine beer and Custard Shakes, and the regular order line. There is no space to actually not have all three lines collapse into one semi confusing blob.\n\nEvery 20 minutes or so, one of the friendly staff members would gently but assertively clear the chaos, it was not enough to organize or contain the mess of tourist.\n\nThe location served its usual delicious foods.", "author": "Stephanie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "U are looking for a really tasty burger and curly fries? Than u should definitly stopy by Shake Shacke :) . At Shake Shacke the burgers are made of 100% antiobitic free angus beef and they are really tasty:)", "author": "Michaela F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Shake shack. This place is wonderful. Being a west coaster I miss In-n-Out and this place has managed to fill that whole. \nThe burgers are always juicy and perfectly seasoned. My go to meal is a shack burger, fries and vanilla \u0026 caramel milk shake. Wonderfully wonderful. \n\nThe other great thing about this specific Shake Shack is the location. If you are near the Brooklyn Piers or the Brooklyn Bridge Park then go grab some burgers and enjoy the awesome weather!", "author": "Lily A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-13", "description": "It really doesn't matter what location this business is from I think if you can get people to buy these made at home burgers and don't give any choice but one basic kind of cheese on a burger and uses buns you can buy from a supermarket it kind of makes no sense for me to keep spending my money there.....but let the followers keep following but I will say the service was excellent", "author": "Tisha C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-01", "description": "From the South so never had Shake Shack before. Wanted to grab something before crossing the bridge. Burger was actually pretty good. Speed was a little slow considering I was one of the only people there ordering. Can't speak for the shakes!", "author": "Stephen V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "I never enjoyed Fast Food Dining until I went to this Shake Shack on the Brooklyn Waterfront at the corner of Old Fulton and Water Streets. Not only are the views spectacular but the ambiance, the design of the space is elegant, and at the same time comfortable and relaxing.\nJust walking in is a good time. I'm a vegetarian so I went for the mushroom burger which was delicious. My companions felt the same way about their burgers. We couldn't resist a couple of orders of cheese fries and for desert we each ordered one of their famous shakes which did not disappoint. I've been back several times and have to add here it can get crowded on the weekends with a line outside. However I found the wait always to be worth it. The staff is excellent, efficient and courteous. This Shake Shack is the best!", "author": "Sharon L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-25", "description": "Overpriced burgers and fries, nothing special. On avrage with in n out but way hyped.\n\nIf yourr stuck then its ok for a quick meal.", "author": "Nick G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "My Shake Shake burger was on the money!!! The location is perfect. Right by the Brooklyn bridge park. Even though it was crowded it wasn't long before we were able to get a table to accommodate 8. There's only single bathrooms 1 male 1 female, the wait was definitely significant. Otherwise my visit to this shake shack was Great. Staff members make their rounds stoping at each table to ensure your food and service is good.", "author": "Sochy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "Seriously the BEST BURGER I'VE EVER HAD.\n\nI'm visiting from California, land of In-N-Out. Shake Shack wins by a landslide. I had the SmokeShack burger. So amazing! The bun is actually closed on one end, so it's like a warm little poncho for your meat and everything stays nice and neat. Uh...just SO GOOD.\n\nSeriously, eat here. Don't miss out.", "author": "Jordan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "Both the cashiers that helped my sister and I separately were very nice and helpful in helping us order our shakes Delicious \"black \u0026 white shake\"!!!!", "author": "Jacqueline M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "Come to the Shake Shack about once a week with coworkers during lunch. When it is cold outside, it can get packed for seating inside, which is pretty spacious to begin with. When it is warmer, you can sit on tables outside or head to the park/riverside spaces.\n\nThe line can get long sometimes but orders are filled pretty quickly. \n\nThe food does not disappoint -- it hits the spot every time I go. I usually go for the Shack Burger (double) with cheese fries. The burger is always great and I like how the cheese is always melted into the patties. Cheese fries are crinkle fries with cheese dip on the side (dine in and the cheese is poured over the fries). \n\nI've tried their hot dogs but it's nothing to rave about the burgers take the spotlight.\n\nI've also had their lemonades, shakes and the creamsicle float: all are good.", "author": "Simon Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-25", "description": "Way overrated. If I wanted to enjoy a burger, I could have well been better off going to Burger King. The burger wasn't that great (I had the ShackBurger).\nThe fries were pretty bland and dry. \nAnd the shakes... How can you call a place shake shack and your shakes aren't even that good?\nThey're too thick to even drink through the straws and they are way too creamy (to a repulsive point). I tried both the Vanilla shake and the Peanut butter shake. The peanut butter one was rich and had a nice flavor, but still too creamy. Both me and my mom couldn't even finish half of our shakes. I tried forcing myself to finish mine, considering the price, but I just couldn't do it. My mom barely drank hers at all.\n\nMy mom really really really enjoyed her mushroom burger though. She wanted to grab another, but the wait...\nI can't forget to mention the horrendously long wait, and the indifferent staff.\n\nNote: The outdoor sitting area, with a live Jazz trio was really nice. The beautiful view of the Manhattan skyline was a plus as well.", "author": "Rachel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-14", "description": "I went here for lunch as I was craving burgers. The premises were very clean and there was plenty of seating. The main seating area looked out to the river and promenade.\n\nI kept it simple and ordered a burger with fries.  The burger was a good and the fries were perfectly crisp. It was exactly what I was looking for.", "author": "Elyse D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "It's another Shake Shack location! That's all that is really needed to be said, the majority of you should already know what to expect food wise from Shake Shack. Instead I'll just focus on the advantages of this location. It's ideal when your on that 'romantic casual date' (burger, fries, and sharing a milk shake while looking over the city landscape, come on it's the perfect sappy romantic movie sceen!!!) or a great alternative to the government pizza line up the block (no offense to Juliana's).\n\nAnother location means the likelihood of long lines may eventually become minimal at all SS locations; there was no line when I went here and it took barely 10 minutes to get our food. \n\nThey have televisions to catch sports for the manly men! OK it's more ideal for those in a situation where their stuck bringing out of town friends and family to the tourist infested Bklyn Bridge Park. It's a win-win because who can say no to Shake Shack all the while being able to watch a live game vs on the phone?\nLet's just hope they keep up with their quality. But for now I'm enjoying the additional location!", "author": "Rich W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "It seems now that you close your eyes and another Shake Shack has appeared--which is not something I have an issue with. This newish Dumbo location boasts a great view and ample seating. When I stopped in around 5-6 on a Friday, there was no line. I repeat--I went into a Shake Shack and there was no line. The burger gods were smiling down on me that day. I sat at the communal table and enjoyed my burger--it tasted just as good as any other Shake Shack burger. I can imagine that this location gets slammed, being underneath the Brooklyn Bridge and close to Brooklyn Bridge Park, but if you can find an off-time, go and enjoy!", "author": "Chey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "It's crazy busy, but worth the wait.\n\nThe burgers are nice and juicy! The coffee milkshake is THE best. It reminds me of Timmy's Ice-cap, but creamier with a stronger coffee flavour.\n\nIf you go on the weekend, it is really busy. You can always order it to go and eat it along the boardwalk by the water. The cute patio is nice too if you are lucky to get a seat.", "author": "Ana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Without a doubt the best cheeseburger and Chicago dog I have ever had. The meat was cooked medium without request. Very moist, flavorful, and juicy. The shack sauce topped it off perfectly. The burger seriously is much better than 5 Guys, Whataburger, Grub, and In-n-out. \nI've had Chicago dogs in Chicago and this one beats any of those I had previously tasted. \nWill definitely be back here again if I'm in the Brooklyn heights area again.\nOh, and they serve a very good coffee shake!", "author": "Eric T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "The burgers were amazing!!! I recommend the shack burger. Everything was gr8 except don't order the organic iced tea bc it tastes like nothing. The wait for the food wasn't too long, maybe 6-8 min. Overall, I was very impressed.", "author": "J H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-04", "description": "I like Shake Shack.. and there's certainly nothing wrong with that. \n\nTheir burgers, shakes, and fries are solid. \n\nI feel that their Shroom Burger and cheese-fries set them apart from other places. \n\nMy qualm(s):  Each of their locations (this one is certainly no exception) are busy as all Hell ALL the time (good thing.. yes, but not for me as a customer), waiting in line sucks, waiting the time that you do for simple fare sucks, having to wait in line to use the restrooms sucks, and having to maneuver through confused tourists... sucks. \n\nI *like* the food, the experience is really meh.", "author": "Adam D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "I love a good Shake Burger, it never disappoints \u0026 always fills me up! I'm addicted to Shake Sauce! Yummy on my fries!!", "author": "Lucia P."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}