{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Hands down, the best Shake Shack. and favorite burger joint hehe \n\nQuality of the food is never disappointing, even with the high volume of customers they get (tourists and whatnot).  The fries are always crispy and fried perfectly and the burgers always so well flavored.  This will forever always be my go to shake shack. The servers here are actually nice and will joke with you, unlike some of the others I've been to. \n\nOnly downside here - there's hardly ever parking.  It's located right near the brooklyn bridge -  beautiful view btw - but will probably drive you crazy looking for parking", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Aw man. Where can I start? One of the best experiences I've had at a Burger joint. To start off, we were visiting here in NY from Houston, TX. Place was very packed. To the point where we had to wait about 5 mins before they even let us in. Immediately our group scoured for some table space, while the others went to order food. Very simple menu yet attractive. Burger is very juicy and tasty. Fries are good as well. And a plus, they have beer!!! I'm a beer lover so I was ecstatic to find out they had their own brew. Pretty refreshing also. They didn't take dramatically long to get our food out considering the horde of people. I am please to know, there are Shake Shacks back in H-town. Because I definitely will be back!!", "author": "Allan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Hot summer night. \nStarving. \nMidnight shack shack burger. \nView of the water. \nJuicy perfection.\nImpeccable proportion of meat-cheese-sauce-bread.\nSatisfying in only the way a burger can be.\nI will love you forever.", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Their burgers are so delicious and yummy. The beef patty is always juicy well cooked. Along with the burgers, make sure you don;t forget to get cheese fries. Their cheese fries are amazing. \nThis in my favorite shake shack because it's located at my favorite place in Brooklyn. When your sitting and enjoying the view of city with Brooklyn Bridge right next to you it's a great feeling. Always like going there and will always do.", "author": "Karen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "My first time at shake shack. You can never get into the one in Times Square so I don't even bother. I had two options in Brooklyn. I went to the one in Dumbo b/c it was the closest at the time. It is pretty tight in there during the lunch rush with no real place to sit, but if a seat becomes available your golden! The burger meat is juicy and delicious, the bread is soft and the fries were the best! Pretty sure I'm coming back", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "For the price and flavor.. whooooo boy this place good. I got the stack shack and the ?bacon? Shack? \nAnyways the stack shack was a little too much with the melted cheese in the mushroom but still goooood.\n\nThe bacon one was yum yum in my tum tum.\nWhile In N Out beats it in flavor and cost.. I would come back here!", "author": "Jaytee P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "After eating so much pizza at Grimaldi's, we walked over to Shake Shack to wash down all that dough with a black and white milkshake!!\n\nWe shared the small but it's sooo decadent that we were feeling pretty satisfied and sluggish after. I freakin love Shake Shack. The shake is made with custard and fudge so you can imagine how delicious and thick and creamy is was. Mmmmmm......\n\nAlso, this is a great location right next to/under the Brooklyn Bridge which makes for a beautiful walk at night by the water in the hopes of burning off even a 1/3 of the calories we consumed that night!", "author": "Tamara H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Really beautiful and huge location. Same ol, delicious, greasy, fatty food and fast, friendly service. It's a little bit on the pricey side but the food is so delicious that it is totally worth it. Love Shake Shack, and this location is fantastic.", "author": "Martin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "I love the design of this location. The lines are short, one can sit inside or outside with a gorgeous view of the Brooklyn bridge .\nThw bathroom was super cleans and the food arrived fast. I had lunch around 115 pm so hopefully that was before the afternoon rush. It did not feel super crowded or touristy like Grimaldi's right up the block.\nActually this might be my favorite shack shack location.", "author": "Dionne H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "This is the cutest shake shack I've been to! It's crazy I pass here all the time and didn't realize it was a shack shake location. It's tinier than most stores but the exposed brick \u0026 awesome employees definitely make up for that.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "I used to be so against Shake Shack. I wasn't gonna buy into the hype and to me it was just another fast food restaurant. \n\nUltimately, my boyfriend convinced me by suggesting I bite a Shack burger he had. Let me say, Shake Shack is in my top 10 for getting a burger or chicken sandwich! \n\nThe price is pretty fair for the quality and taste. I also like that they use Martin's Potato Buns! I love it. \n\nThey are way, way, way above Mc Donald's and I pretty much will never step foot in another one ever again. (I haven't in at least 3-4 years.)", "author": "Shayna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "I was craving a sweet treat and had seen Shake Shacks all around the city so I had to give it a try. I got the chocolate shake and loved it! It was thick and rich (custard based), just how I like it. \n\nThey were very busy so we had a bit of a wait but it was worth it. It was also a bit pricey but certainly better quality than a fast food alternative.", "author": "Erica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-25", "description": "Excellent Shack. Astounding customer service, kind staff, thoughtful, great atmosphere, beautiful music and energy. Dorian offered me excellent customer service, and pushed to make sure I had a great experience. I ordered the SmokeShack burger and it was beautifully cooked, packed with flavor and delicious toppings, easily THE top burger in New York City. The beer was tasty, and the shakes are perfect. I was fully satisfied with my visit, and I'll definitely be returning soon. Best place I've ever been.", "author": "Jack D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-29", "description": "Beautiful location along DUMBO waterfront but service is meh - came here on a hot day for some ice cream but the guy taking order messed up and we ended up paying for another 2 more \"dips\" of vanilla ice cream. Also waited 15 minutes to get our order of ice cream...the buzzer literally buzzed and our ice cream still wasn't ready. \n\nVery disappointed with the mishaps and slow service", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-29", "description": "First time having Shake Shack in two years and around 6 months. I had loved Shake Shack back then before I left for SD, and sorely missed it while in California. Coming back and getting a bite, I was excited. But looking at the price now and the taste...it was the deal breaker. The burger wasn't cooked thoroughly and you could see the red, which I was okay with, but the taste just wasn't the same. \n\nI was crying tears internally as I sighed and finished the Shack Burger. I get that food will no longer taste the same, but the meat not cooked more thoroughly which can be dangerous to some. I have to say Shake Shack, it's been a long time, and I'm sorry for the long wait. I still love your fries but not so much your burger. In N Out has stolen my heart for that, for the taste and the price. It was nice knowing you  plus I can get your crinkle fries anywhere.\n\nMy boyfriend also gotten the Shake Stack which came out to $10. His comparison was that he had to take 3-4 bites to get the flavor of the burger rather than just taking a bite of In-N-Out which you taste in the first bite. He also got a milkshake which was miniature compared to In-N-Out's regular, tasted exactly the same but more expensive.\n\nMost likely won't return as I've found something better, fresher, more cooked, and more affordable on the West Coast. Nice knowing you!", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Inside Fulton street train station on the second floor. Quick line and there was lot of seating. Shake shack burger is great as always.", "author": "Marlena C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "MUSTAFA was so awesome!!\n\nShack Shack is always a good idea even though the lines make you feel like you've made a mistake. This location was no different. Line out the doors on a nice sunny day and lines waiting for a table. I had some words with someone, but thankfully (for her) it didn't escalate ;)\n\nMy burger was not cooked well done as requested and the lemonade was not the correct flavor, but I'm glad I had an issue because I had the pleasure of interacting with Mustafa! He has such a nice and warm smile and a great attitude for dealing with people. He was in the area that handed out orders that are ready and when I mentioned I had an issue - he said no problem and had them make me another burger - same thing for my drink after I got back to my seat and realized that it wasn't the right flavor. He was going to bring it to where we were sitting, but they were so busy and I didn't want to inconvenience him so I waited. So nice!\n\nOf course the burger, fries and lemonade were all delicious so I'm not complaining!\n\nHis cheerful attitude is part of what makes places like this great! I look forward to coming back here!", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Heard so much about this is NY version of In-n-Out.  We tried their bacon cheese burger, hot dog and shake.  The burger was not bad at all but the dog was obviously not their specialty.  Shake was awesome.  Price-wise, it was almost twice more expensive then In-n-Out.  Overall, it was good but I personally prefer INO.", "author": "Andy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-03", "description": "Great spot to grab a quick bite after walking across the Brooklyn Bridge, have a cheat meal and even catch some World Cup games. Line-up was quite crazy on the weekend; we had to wait extra long to find a table inside (if you order beer, it is mandatory one stays indoors). I really wish I had ordered one of the shake shack burgers instead of the Chick'n Shack. The chicken was way too oily.  The vanilla shake was delicious.", "author": "Katerina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "Come here BEFORE lunch hour starts and you won't regret it. There will be seats(plenty!) and the lines are much shorter (but that's only taken for granted if you can come slightly earlier before lunch hour really begins at around 12-12:15PM.)\n\nBut for those who are in the area and are craving for some burgers and fries? This is PERFECT! My boyfriend and I have came here on several occasions and we're never disappointed. Staff was also friendly and funny! Shoutout to the lovely cashier who took our order and was slightly \"shocked\" by someone having \"too much cheese\"!", "author": "Jenny C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}