{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-03", "description": "I've been to this location three times. Twice they've dropped the ball, offering me neither good service nor a product that is representative of what they normally do. How do I know? Because I've been to three other of their locations (Manhattan and Westport). \n\nI even gave them feedback on their website expressing my disappointment, but their interface SUCKS, limiting the amount you can write and leaving practically no room for a proper expression of thoughts. Not only that, but the automated email says you're gonna hear back from a SS rep in a few days....but that never happened.\n\nThis one-star review is for the Brooklyn spot and for the home office; their other joints are fine by me. Get a clue, Shake Shack Corporate Folks!", "author": "Diego R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "Good burgers and overall fun vibe. Workers had a bit of an attitude.\nLocation is hot so I am sure it will do well for a long time.", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "I've been to the Shake Shack in Mad Sq. Park. I'm excited about this new one which will be SO nice in the summer near all of the parks in Downtown Brooklyn. Definitely this place is already crowded, while there aren't unusually long lines the seating area is PACKED and the aisles are very small for passing through.\n\nThe Brooklyn Shake Shack sets itself apart, however, because each of its wooden table tops has a wood-burned tag (in Helvetica?) making sure that locals note that these table tops were made in Brooklyn out of reclaimed wood from bowling alleys! We are an aesthetic beginning to parody ourselves, I guess.\n\nThe burgers are and have always been just ok. Dry, a little flavorless, tiny meat patties. The milkshakes are pretty GREAT, but the chocolate definitely wins out over the strawberry. I think when it comes time for summer,  I will come to Shake Shack for the custards and milk shakes and booze, and go around the corner to Five Guys in Metrotech for the burgers and the fries.\n\nHOWEVER, I am so tickeled by Shake Shack because today I dropped my chocolate milkshake --reliving every dropped ice cream trauma of my childhood -- and the woman who cleans the facilities was immensely kind. \"What kind of milk shake was it?\" she asked me, but I was flustered and thinking \"Geeze, lady, the kind that's on the floor.\" But I told her and she said, \"Ok, you sit down and enjoy your lunch and I'll bring you another chocolate milk shake.\" How sweet, and what great customer service! (Hooray Yelp for Justice!)", "author": "A S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-23", "description": "Have I reviewed all the Shake Shacks in the city? Maybe, I can't recall. But this one is definitely one of my favorites. First, it's in Brooklyn, which means I don't have to go all the way to the city to find my favorite burger. Second, the line never seems to be as long or take as long as the other locations during lunch hour. Madison Square Park at 1pm? Fuggedaboudit.\n\nThere's really nothing different about this Shake Shack than any other Shake Shack, which is good, because I like consistency.", "author": "SukMon C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-20", "description": "Worst veggie burger ever. Seriously. \n\nI've wanted to try this place for ages, even knowing that the range for me as a vego would be limited. Eventually I found myself there for lunch when the lines weren't too terrible. To start with the positive, the chocolate shake was very yummy. The fries were fine. Not fantastic, but not bad either.\nHowever.... the vegetarian 'shroom burger was revolting. I love mushrooms and I love cheese, but what I do not love is a fatty, gluggy, bland, glutinous combination of the two, deep fried and put between an overly sweet bun. The globby mess in no way resembled the menu description of  \"crisp fried portobello\" that I anticipated. Major fail.", "author": "Robyn W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "Salted caramel milkshake, walking distance from my apartment?\n\nOHMYGODYES.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "Shake Shack's burgers are 5 star. Their burger meat is basically the best non-premium burger meat I have ever had. The only thing that detracts from Shake shack is the rest of its menu. I would say that the other things on their menu are slightly overpriced and not up to the 5 star level of their burgers.\n\nShake- This stuff is good; a 4.5, great taste, just not totally \"memorable\"...thus not 5 star\n50/50- 3 stars. As someone used to a southern arnold palmer...I was very disappointed in the lack of sweet tea in this drink. Not really that impressed with it.\nCheese Fries- While the fries were crisp...they reminded me of the cheap fair fries...the cheese was basically nacho cheese. It's at best 3.5 stars\n\nThis shake shack(as compared to the other location I've been to-Gramercy Park) is very clean, very nice, and the service fast. No long lines...thankfully and it tastes just like what I've been used to.\n\nCheck out the shake shack!", "author": "Dawei L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-08", "description": "I'd never been to this location but had always loved Shake Shack. the food and sides are awesome. They even have a beer from a local brewery thats great.\n\nIf you havent, you should.", "author": "Sashi K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-20", "description": "Damn the double Shack burger is quite an experience. Almost as good as crack! just wish the milk shake wasn't as expensive but it's worth a try. I have eaten there the past two weekends and I can't stop going back. Now I know what the lines where for when I passed the park near the flat iron building during the summer.\n\nYou got to try it!!!!!", "author": "J P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "On this past trip to Brooklyn I finally got to try the infamous Shake Shack. Being from California and a HUGE In N Out fan, trying Shake Shack was the final stop amongst the trio of burger joints that always are a source of heated debate for tops in the US (Five Guys being the third). \n\nMy review is basically a comparison to In N Out and Five Guys based on my personal experiences with three. First what is awesome about this place: Beer and wine. Cant express enough how great it was to have a beer with my burger after a long day. Also the cheese fries are great. Among the three, five guys has the best fries but SS is a close second. The restaurant is also much nicer, feels above a fast food joint. \n\nI tried a Shake Burger which I thought was well cooked, fresh tasting and overall memorable. However I went single since the double is pretty expensive (over 7 bucks for just the burger) and I could have easily polished off another. In comparison I still think an In N Out double-double was superior in almost every way. Fresher tasting produce, onions (if requested) make the burger, and the bun was better prepared.\n\nI also tried a peanut butter shake since the place is call shake shack. It was delicious but again expensive. Some of the other deserts we tried we're actually a little rich for our liking. \n\nFinal answer? Maybe I am a homer but InO still reigns supreme. For less than 6 bucks you can get a better tasting burger, drink and inferior fries. The burger is better than five guys but the fries did not stack up. I would for sure return next time in New York but im not making a special trip out there just for Shake Shack.", "author": "Jameson S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "One word: amazing!! Best fast food burgers in the city. I strongly recommend the Smoke Shack!!!", "author": "Truth T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "oh yeahhh, finally a shake shack in Brooklyn! Time to get my tush off this seat of mine and head over to SS for a shack burger! There's not much to be said about shake shake. This chain establishment speaks for itself really..", "author": "Shannon Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "This place is always crowded every time I come here to order food to go. I've yet to stay and have my meals here but I'll probably will one of these days when I've got good company with me. I always enjoy their burgers (I always like them with fries!), which I always have with plain cold water at home (I think the meat tastes better when you munch and swallow it with the help of plain cold water). I like the way they make them ready for me in paper bag for bringing home. I like their set-up here better than those in the stores they have in other locations. I don't wanna be seen lining up by strangers who happened to be passing by---at least in this store, everyone's inside the store.", "author": "Jerome Espinosa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-23", "description": "This place has the best burgers east of the Mississippi and the second best burgers in the world only to be out done by IN-N-OUT.  I am from NY born and raised and I now live in California so this is an unbiased review.  Honestly if you're in NY or on the east coast by now you should know to come here.  Obviously you should get the shake burger.  There are things here that you cannot get at IN-N-OUT such as hot chocolate and alcoholic beverages and that's a plus.  Menu is limited but it has more than you need, be prepared to wait online and to get your food because perfection takes time.", "author": "Craig H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-01", "description": "I liked the atmosphere, clean, seems like a place a group of friends would enjoy when you don't mind loudly yelling across the table-a lot of places are like that. The shake selections were quite broad, and probably fantastic, but I didn't go for a shake. I was looking for a place close to my hotel as it was pouring and walking far was not an option. I had the \"smoke shack\" \u0026 felt the burger and sauce was salty and a little lacking in flavor otherwise.", "author": "Kim J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-29", "description": "i love shake shack, but this location served handcut shoestring fries when all i wanted were the crinkle cuts.  my burger wasn't even medium, it was overcooked.  plus, the woman handing me my food gave me the dirtiest look for no reason.  not coming back to this location even though there was no line and i scored seating indoors.  madison sq park, and ues locations have been the best so far.", "author": "Doris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "The line took about 10 minutes which I consider pretty excellent. The food took about 5 minutes to prepare and come out, also excellent. I love their shakes and would highly recommend any of them. The burgers are always delicious at Shake Shack but I there are a few things that could be improved.\n\nThe cheese fries - the cheese needs to be improved here. Whatever kind of cheese they have I feel like it's a little lacking in the flavor department. Maybe something a little sharper.\n\nSalt in the burger mix - every time I've gone to shake shack (with the exception of a single time) the burger has tasted salty. It's very possible that this could be salt in the cheese but I know I shouldn't be getting that taste.\n\nShake shack remains one of the few places you can get a delicious burger and fries for less than $10.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-27", "description": "I finally got to Shake Shack and the one in downtown Brooklyn did not have lines out the door and it had seating which I was very thankful for.\n\nShake Shack had the best REAL cheeseburger that I have had in a long time. The fries were fresh and delicious and the banana bread shake, AMAZING!! \n\nDefinitely my best burger experience in a long time although the portion size was a little small for the price. I wanted more of the deliciousness but I didn't want to pay the price.\n\nDefinitely someplace I will return to, whether it be at this location or one of the various other locations throughout the city or country.", "author": "La Viajera M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-11", "description": "I type this as tasteless grease still clings to my lips.  Buyer's remorse.  So not worth the calories.\n\n-- The crinkle cut fries?  Almost tasteless.\n-- The burger?  Uber greasy, lacking taste, mushy, no contrast with the lettuce, tomato, cheese.  Just a grease delivery mechanism.\n--The peanut butter shake?  Again like last time , way too little peanut butter flavor and too much milk. They make it much better at the Madison Sq. location.\n-- However I must praise the fountain Diet Coke. Nicely mixed.\n\nThat's it.  No mas. My first trip to Shake Shack Bklyn a few weeks ago wasn't a bad fluke.  It's just weak.  So weak.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "Spending an entire Saturday at the King's County Courthouse is the worst.\n\nEating a double-stack Shack burger is the best.", "author": "Amanda L."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}