{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-23", "description": "Wow and i thought five guys was good. Juicy burger, patty well seasoned, nice condiments, thick cut fries, creamy shakes and they even sell beer. The restaurant is clean, nice counter, chairs and table. Decor appealing to hip group yet conventional classy. Not sure about the cheese on my cheese fries though, it had a little too much oniony taste for me. Overall great hang out place with better than five guys burger IMO.", "author": "Kheng C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "4 stars for those crack burgers. Seriously they are really good. Their concretes are pretty awesome as well. Good luck finding a seat here as it is always packed!!!", "author": "Sheri A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-28", "description": "It's real good, it is better than in and out in the west coast and five guys!!! Defiantly worth trying", "author": "Luisa P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-19", "description": "Black and White Shake!!!! This shake is sooo good, although a bit pricey for the size. Its 5 bucks for the size of a small (or smaller) from Wendy's. Once you start drinking though, you begin to forget how much you paid for it. The line was pretty long but moved fast. I like the little beepers they give you while waiting for your order. I would have rated higher if the prices were more reasonable (i'm cheap). There are far too many other cheaper options in the area", "author": "Marla B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-07", "description": "Great burger, got to give them credit. I'm from California so I'm a die hard IN N OUT fan but the overall quality of the burgers is better here since it's fresher. The fries are okay pretty good no complaints, the hot dog was good as well. The only thing is that is place is SO OVERPRICED and you get a lot of tourists and crying children here because a lot of hipster couple's think this is the cool alternative to mcdonald's. The shakes are okay not a huge fan but the burgers are great.  Overall good place to satisfy a burger craving :D", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "awesome burgers, casual environment. my favorite is double shack burger, the best burger near my house. somkeshack is good too, but im not a big fan of sour tastes. shackstack is awesome, its big! deep fried mushrooms, definitly worth a try.", "author": "Will G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-28", "description": "i walk by this place everyday! today, i gave in to the temptation and walked in for lunch! this is my second time having shack burger. i learned to mention onions and pickles :) this was a  lot better! fresh tomatoes and medium well burger! yum yum! but the wait was a bit ridiculous and there really wasn't a lot of space to wait around for your food. the dining area was packed. it was around 1pm. \nit was a bit more for a burger for my budget. but it was delicious regardless.", "author": "Ai L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "Delicious burgers, fries, hot dogs and shakes in the quickly developing downtown Brooklyn area.  Same great Shake Shack minus the long Manhattan lines.", "author": "J K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-28", "description": "The Brooklyn location is just as good as all the other ones in Manhattan. The Shack Burger is my favorite- basically a cheeseburger with their yummy shack sauce. The fries are always perfectly cooked and their milk shakes are delicious. This is my favorite burger place in NY.", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-20", "description": "During a recent trip to the Big Apple, my travel partner indicated she would like to visit a Shake Shack. She had me a bit hyped up because what I ended up with would be a slightly better version of the Midwest's Wendy's hamburger. Was it decent? Sure. Great? Not so much. We also ordered some fries to share, which I enjoyed more than the burger itself. The chocolate malt was also decent, but not great by my standards, and small in size for the $5 price tag. Then again, everything is more expensive on the east coast.", "author": "Shanna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-05", "description": "Great burgers, average fries, but add cheese and they're delicious, lol.  GREAT shakes, though over priced.  Takes a while to get your order as it is always packed, but to be making everything fresh, i suppose it makes sense.  Decent burger joint.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-28", "description": "I cracked my tooth on a Shake Shack burger from some ground up bone fragments in the burger.  They are supposed to be  using premium organic beef.  Maybe they should say they are using premium bone fragments instead.  If that wasn't bad enough both my wife and I were sick to out stomachs 15 minutes later when we got home.  On top of that the burgers have absolutely no taste!", "author": "Robert B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-06", "description": "My double shackburger was delicious as always, and went great with my Shackmeister Ale. So why 1 star? Because the cash register employee was completely over zealous in trying to get me to donate $2 for charity. After I politely denied his request he went on to loudly point out which customers waiting for their food had donated and proceeded to again loudly ask me \"don't I want to help hungry children!!\". I should only have to say no once. He was acting as if he made commission on it or something. Not professional, not right, not courteous at all. I just spent $40 on burgers, fries and drinks for my friend and I and now you want to embarrass me in front of the whole  place over $2? You gotta be kidding me. By the way if there is a manager reading this I was there on 5/6/13 at 3pm and the employee was male and the second cashier from the left. I would retrain him with emphasis on providing respectable customer service as I'm sure your losing clients over his tasteless and unprofessional antics. I will not be returning to this location because of your employees spectacle he put on. It's a shame I will have to travel to the Battery Park location to get my Shake Shack fix especially since I work and live nearby this location. But at least I know I won't get treated like this there. UNBELIEVABLE!!", "author": "Luis C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "Damn this is a good burger. I ordered the shake shack burger and it melted in my mouth. The bun was the way I like it, not hard and keep its shape on the burger. Fries are good too, but the burger was the star. Definitly gives In-N-Out a run for its money for this West coast girl.", "author": "Bianca R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "Had a cheeseburger and a chocolate peanut butter shake. Food was delicious. Prices were good. Only reason I don't give it 5 stars is because it was super crowded and there were lots of loud little kids.", "author": "Rachel T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-13", "description": "Total disappointment from Danny Meyer's Shake Shack at this location.. The double shack burgers were so salty that my wife and I had to throw it away after few bites. It is inexcusable that the chef of his caliber allows for such basic seasoning standards to be overlooked. Take your blood pressure pills prior to consuming it.\nThe burger looked pretty though.", "author": "S M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-07", "description": "I was so excited to take my dad to Shake Shack and have my first, and his, Shake Shack dining experience.  Thinking I was going to impress him, he ate quietly and gave me the, \"Of all places in this damn city, why did you bring me here?\" look.  The fries looked and tasted like the Ore-Ida fries my mother made when she had to work late.  The burger... It wasn't bad, but it wasn't great.  I could have gone to Wendy's and left just as satisfied.  On a positive note, the ingredients on the burger were very fresh, the staff was pleasant, and the restaurant and restrooms were very clean.  Also, according to my father, a lemonade connoisseur, the lemonade was pretty tasty.", "author": "Anthea G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-12", "description": "The burgers are amazing. Sure, it takes a while to get your order, but it's definitely worth the wait. The people are nice and the environment makes the experience more enjoyable. Definitely a place I'd visit more often", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "I like Shake Shack because of the custard. The burgers look very nice, but are not better than 5 guys or what I can whip up at home. I had the fries, they were also very generic. The apple chicken hot dog was pretty good. It was upsetting that the veggie burger has cheese mixed in, so it's not good for my vegan peeps. But like I said, I'm there for the custard; and it's heavenly.", "author": "Turi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "Good burgers \u0026 shakes. Fries aren't all that so don't bother w/ unnecessary calories.", "author": "Pamela S."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}