{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-19", "description": "When I'm in the mood for a burger, shake shack really hits the spot and pair it with a milk shake. Nothing wrong with that.", "author": "Julie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-14", "description": "Any place that can get my finicky toddler to eat meat is A+ with me. Seriously, their burgers are great, their fries are perfectly crisp and their shakes are awesome (I'm partial to the Peanut Butter shake). The staff at this location are always incredibly friendly and very sweet to my little ones. The process can be a little slow at times, but it's a popular place and the quality never suffers. They've earned our loyalty on many levels, and I'm sure we'll be back again and again.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-15", "description": "Shake Shack it's nice to have finally met you! I made it my business to eat here twice in one week so that tells you how much I enjoyed the food. I've never been to any other shake shack so I can't compare the Brooklyn location to any others but my wait time wasn't bad at all. It took about 5-10 for the food to be ready. The burgers are amazing and so are the cheese fries and milkshakes. Oh yeah, and the lemonade taste like it's homemade and not that generic MinuteMaid stuff.\n\nGo to Shake Shack now!", "author": "Ameena W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "Its such an amazing experience to enter a shake shack a mere minutes after they open their doors. No one was in line. The tables were perfectly aligned. The sun was shining. It was the perfect opportunity to dine here. Not having to wait in line i was stunned by my inability to make a decision since there was no wait in line. \nI ultimately decided to go with my tried and true Shack Stack. A soft and buttery Martin's Potato Roll with a juicy burger patty topped with shack sauce, Cheese, lettuce, tomato, and a stuffed deep fried portobello mushroom. This is one helluva sandwich. \nI always order cheese fries and a root beer. These burgers look small but they are filling! A few fries in, after i finished the burger and I was waiving the white flag. \nI also tried the Urban Lumberjack concrete. The half was the perfect size. Chunks of banana, peanuts and peanut brittle in the creamy \"blizzard-like\" dessert. \nI am a huge fan of shake shack franchise and was pleased with this BK location. \nAlso, its dangerous to have a shake shack so close to home. \n*gulp*", "author": "Monique R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "I'm a big fan of Shake Shack! \nThe only \"annoying\" thing is that is always hard to find a table, beause the place is always crowded.", "author": "Talita M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "If you want reasonably priced, and delicious fast food, this is the place to go. It's a huge step up from 5 Guys. \n\nGreat milkshakes and burgers. The ShackBurger is my favorite with their sauce (what is it?!), lettuce and tomato. Their chocolate milkshake is whipped up to perfection - extra thick!\n\nI ordered their fries here. I really really REALLY hate thick cut fries but these were good! Not oily, and not too potatoe-y (yes, I just said that). They are cut perfectly. \n\nAnother great thing about SS is that they sell beer and wine! I was here on my lunch break considering the possibility but then I realized I shouldn't be talking to clients tipsy however, I'd like to try the wine here soon. In addition, I can't wait to try their hot dogs as well!", "author": "Jane R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-16", "description": "Halloween eve, had nothing else to do but take drive to Shake Shack. Half the city out of power because of Sandy but we didn't want that to prevent us from eating, so we knew this place was open, and we stormed right in. Huge line even on a night where everyone was still in panic. \n\nI can't really eat anything on the menu since I don't eat chicken or beef anymore so I always go with my amazing Shroom Burger with Shack Sauce. Breaded and fried portobello mushroom with cheddar cheese just bursting out with each bite. Ugh its making me crave one just typing it!\n\nLemonade is my drink of choice. Might have to make a stop here tomorrow!", "author": "Jerrica J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "Thanks guys for putting this in BK so I don't have to trek out into the city.\n\nAs usual, ShackStack + cheese fries = bomb dot com.\n\nI'm a fan of their custard flavors also. Last sunday - coffee and donuts. Something on their screen said that the donuts in it are from Donut Plant? HYFR!!!\n\nLast visit, I did try a ShackDog...the one with the cheese and crispy salted dehydrated onions on top. Yeah... that was a fail. It was way too salty. Case-in-point, stick to burgers at this place!", "author": "Jeanna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-28", "description": "So this place definitely lives up to its reputation of being crowded. It was a little after noon, almost one, so lunchtime for the busy downtown area and the place was packed. I didn't come in with any expectations of getting out of there fast, but they surprised me. I ordered a single ShackBurger, an order of plain fries, and a black and white malted shake. I wait, at best, five, six minutes before my food is called out. Magic? Luck? Who knows, but the food was coming out fast and I wasn't complaining.\n\nThe burger is fine, pretty good for a standard one, and the shake is delicious (I kind of want one right now) but the fries, oh my. Listen, guys. I like fries, but I can be pretty picky about them. They have to be fresh, hot, crispy, and above all, salty. Don't make me work for my enjoyment of fries. These fries were all of that. I didn't need ketchup for them or to sprinkle extra salt. Just perfect. I'm afraid that if I go back a second time, they won't be this way again because my luck runs that way. \n\nFinding a seat is hard if you want to eat in, so take this into account or you will have to hop up onto one of the stools by the window like I did. Not too uncomfortable, but if you are disabled, this can be a problem. I do like that they serve alcohol (wine with burgers? Classy as hell. Don't let anybody tell you differently.) Also, since I am one of Those Dog Owners, I especially love that they sell dog treats. They mention that the Pooch-ini isn't intended for small dogs, but knowing my Yorkie, she would down those and ask for more in a second.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "So I worked in downtown Brooklyn for over a year and less than 2 months after I lose my job a Shake Shack opens up a mere few blocks from the office. Thank God... I really would have had $0 saved up had it opened just a tad sooner! \n\nLove the multiple lines, love the Shake Shack shaking devices that notify you when your order is ready, \u0026 love how quickly the line moves. I also love that they serve good beer at a reasonable price and have a healthy (ha, ha...) assortment of shakes.\n\nWhat don't I love? Not enough seating \u0026 it's far too easy to drop a ton of cash just on lunch. That and I don't think that Shake Shack burgers are Gods gift to humans. Don't get me wrong... They're good, but I'm not gonna stab someone for an Original Shackburger.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-25", "description": "Use to be one of the places to go, short lines, great customer service. But it turned around since the last time I have been there and the customer service has definitely changed my mind from going back. The workers are all ghetto.", "author": "Natalie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-06", "description": "Move over burger joints.. Shake Shack needs to come to the West Coast.. OMG.. I cannot even think of what words to describe the burgers here. I'm not a burger-kinda-girl, but WOW.. The burgers here are so juicy and packed with yumminess!\n\nI ordered a cheeseburger with mushroom. The juices from the mushroom was amazing. I took this to go to wait at the next eatery since there is usually a 15 minute wait for a table. I should have bought fries and a shake to go.\n\nI cannot wait to be back on the East Coast and get my hands on another burger!", "author": "Anne T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Once a month I have to sit in some windowless, joyless room for a progress meeting regarding one of my projects. The last one was on Thursday the 5th and it started at 1030am. Normally for this project, we can wrap this meeting up in ninety minutes. I shouldn't say we, because all I do is sit in the back corner, charge my phone, and message my friends on Google Chat and Whats App. \n\nThursday's meeting was going smoothly until the Project Manager and Contractor got into a hissy fit about some performance review that won't be filled out for eighteen months. I was staring at the clock. It read 1207pm. If you don't get to Shake Shack by 1230pm, you'll be stuck waiting in line behind all the corporate goons talking about how they'll have to walk the Brooklyn Bridge after eating this. \n\nThe meeting mediator told the two to 'curb this discussion' for another time. I packed up my things at around 1225pm and had about five of those 'Good to see you!' fake conversations before I got to the door. I got down to the lobby and fast walked it past the courthouse (I love burgers, but I don't run for them. I hate cardio. I will only run for the ice cream truck.) and darted past the streams of people on Adams St before getting to Shake Shack.\n\nThe line was tolerable! Woo hoo! I ordered myself a Double Smoke Shack with fries and the girl behind the counter got my name wrong again because apparently my only two voice levels are 'barely audible' and 'oh my god why are you screaming at me?'. I couldn't remember if I didn't like the cherry peppers or the Shack sauce, so naturally I requested them to hold the wrong one. \n\nSeating inside is a bit limited, but on nice weather days like Thursday, there's plenty of seating outdoors. After about a ten minute wait, I walked back over to the courthouse. I grabbed a Snapple from a food cart on the walk over because I am not paying $5 for a shake that's barely bigger than my fist. I sat on the steps of the courthouse to enjoy my food.  I opened up my burger and realized that I should have requested the removal of the peppers, so I had to pick those suckers out. And of course, the klutz that I am, I dropped a sizable piece of bacon on the ground. Ugh.\n\nI tossed the bacon towards a bunch of pigeons and little birds (sparrows?). The pigeons, being the bigger jerks that they are, tried to box out the little birds. One flew away, but he only did that to gather some momentum. That little guy swooped in, snatched the bacon, and flew the hell away. That put a smile on my face.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "Ohh!! I luv the shroom burger and the Shaestack...the location is awsum..beautiful view and sitting arrangement..though hard to find a spot!!..its crowded in a good way..ambience is fun n young..!! \n\nFood is good little healthier ,I don't think they are organic...n all natural..but it tastes pretty good!!!  Portion size are small..not bite sized not Macsized...in between!!;) but pretty expensive if you think its just a burger..n they don't use more than a small piece of lettuce ...I really want them to use lil more green..:)\n\nIn summer u can sit outside n njoy Brooklyn under the ppen sky...at night it looks more beautiful with the lights.... love this place..no wonder why they are sp busy...!!!", "author": "Foring A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Came here twice and I don't even live anywhere near here! Made the journey from UES solely for the chicken sandwich. So good, especially w the hot sauce. They really need to offer this at every location. Definitely worth the time and effort. And I think it's 100x better than Fuku (yup I said it...)", "author": "Grace C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-05", "description": "I heard all the raves about this place and thought, I have GOT to try this!\nI came here, and it was crowded. I thought...well crowded must be a good sign? Right?\nFor one, I ordered a Shroom stack, cheese fries and strawberry shake. Came out to almost $20. Not complaining as it is reasonable for what you get it but I wished I'd taken my $20 to Five Guys.\n\nSecondly, I found the shroom burger to be disgusting and overly greasy. In fact, the whole burger was swimming in grease. With each bite, I can feel the oil filling up my mouth! Especially the mushroom patty, which seemed to be harboring half mushroom and half grease. \nThe burger was a great size, and the beef tasted decent but the mushroom ruined it. It had a weird aftertaste and tasted straight up like oil! \nThirdly, the fries were also a grease pool. Need I say more?\nThe shake was something I could have bought at McDonald's for $2.\n\nI left that place SO disappointed. I may try a different location, and maybe go for a regular burger. But overall, I find this place to be overrated.", "author": "D M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "I had never been to shake-shack, up to a year ago. My bf was craving a burger, there was no line, and we (I) needed refuge from the cold. A year later, I am still raving about that mushroom veggie burger. \n\nyummmm!", "author": "Queen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "THE BEST BURGER OF MY LIFE!!!!!! \n\nYou get a little intimidated when you first arrive because the line is always sooooo long and they are always soooo busy but you dont have to wait long at all!\n\nOk so I tried the vanilla shake with marshmallow sauce omg TO DIE FOR\n\nSeriously, I sipped it slow.\n\nAnd their fries are crinkly and amazingggg! Try the cheese sauce for the fries too! PHENOMENAL!\n\nAmazing Amazing Amazing.\n\nDefinitely wont go anywhere else for a burger!!!!", "author": "Jessica J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-31", "description": "Okay. I'm a Five Guys - well, trying to think of the right word... i guess - Guy. I love their Cajun fries, their burgers are fantastic, and there's an element of hometown pride (since Five Guys and I both come from the DC metropolitan area) \n\nIn the past I've been less than kind to Shake Shack. Long, slow lines - inconsistent food quality, and worst of all - they sell crinkle-cut fries (the WORST kind of french fries EVAR!) \n\n... buuuuut, and it's a big but, so I can not lie - I kind of like THIS Shake Shack. \n\n-The lines are always manageable, \n-the burgers that I've had have always come out a perfect medium-to-mid-well, \n-and even the fries are lacking the sort of \"off\" taste I'd gotten from other Shake Shacks. \n\n-Plus, Malts. Chocolate Malts. All the chocolate malts. Other places say they have them, but are always miraculously out of malt powder. Not Shake Shack. Not Here. It's like they realized everywhere else was running out of malt powder and they decided \"The line shall be drawn HERE. this far and no further\" everyone else wouldn't have delicious chocolate malts but they would.\n\nSorry, I seem to have lost focus there for a bit.\n\nAnyway, if there's a Shake Shack to go to in this city - It's this one.\n\n**** Edited for spelling \u0026 grammar", "author": "Bryon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "I'm giving it  a four star BC of the crew in the early day but don't go there later after 7 pm BC they rush you and you might have burn bread and dry over cook food but you go their around 12 till maybe 6 you be will be satisfied", "author": "Angy L."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}