{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "First time at Shake Shack. Only got a Caramel  shake which was good. I noticed they have a dog menu.. so next time Inwill treat my dog too.", "author": "Ray-Ray M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "My dreams have finally come true--Shake Shack found its way to Brooklyn! The decor  is the same as other locations, and given the smallish space I think they did a good job filling the place with seats. Everyone was friendly and my burger was just as good, maybe even better because I didn't have to go into Manhattan for it? Yes, there are other fastfood burgers available around the way, but Shake Shack is in a league of its own. I can't believe I've only been once, I need to step up my burger game.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-01", "description": "Busy, dirty place! Food is way too salty, and I like salt.\nI don't understand what is it about this place that brings people here...", "author": "Lenny B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "This shake shack is like all the others. Long line but moves quickly. Slightly difficult to find seating but if you wait around for a little and constantly scan you will find a seat. Now on to the food. You know it's a Decicious burger. Soft bun. Love the fries. The place rocks. You know it. I know it. Your mother knows it.", "author": "Mikey H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "Stopped by Shake Shake while waiting for the NYC Water Taxi  - it was freezing outside and we had 30 minutes to kill so we decided to check it out. The line was long but went fast!\n\nWe split a burger - which was perfect - just right for a quick snack and we had drinks. The best part - they have a house red and white wine blend on tap made specially for them by Frog's Leap based in Napa. LOVE it!  Reasonable prices (for NYC) for wine - winning. Great views of the water from this place - stop in!!!", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-06", "description": "So my friend told me that this place is the East Coast version of In and Out. Now I am not a burger person but I love In and Out! So for you to tell me that this is better than In and Out. I'll be the judge. \n\nThere is two options when it comes to the burger, single or double. So far so good because I dont like many options. I got the single, and I also got the shake shack original lemonade. Now I wasn't a fan of the lemonade it was too tart. But let me get to the burger....\n\nThe best burger ever!!!!!!!\n\nPotato bun!!! Let's just end there. I love potato bun!!! Score!! Learned that the meat is vegan feed and the way they cook it.. So juicy!! It does not take a lot to make the burger perfect and that's what I like! It's not fancy dressed or made with secret ingredient. It's simple and well made.\n\nYes shake shack, you won and stole my heart! \n\nThey had frozen custard dessert that I didn't get to try (I don't like eating cold things when it's cold out) but will def try it next time.", "author": "Savina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Was here yesterday for the first time and it was sooo yummy. I got a shack burger with pickles, order of fries and a peanut butter shake. The shake alone was the best I have ever had! So peanutbuttery and the perfect thickness. My burger was great too- I'm a sucker for good real pickles on a burger and I have to admit I was surprised how great the pickles were, given SS is a chain. The fries are crinkle cut and I had very few standards for them as I'm not typically a crinkle cut kind of girl. Let me tell you: these fries are amazing. So perfectly crispy and salty. Not at all like the frozen stuff you get in the grocery store. I can't wait to go back and try the chicken shack and cheese fries!!", "author": "Emily H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "Fresh burgers and amazing cheese fries. I think id go just because of their cheese fries. I love it.", "author": "Xaima M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-01", "description": "'Shroom Burger (vegetarian) -- $6.75\nCrisp-fried portobello mushroom filled with melted muenster and cheddar cheeses, topped with lettuce, tomato and shacksauce\n--THE BEST BURGER I EVER HAD! I had so much fun eating this!  The cheese gushes out in every bite! (It burn my lip on the first bite so BECAREFUL!) Oh so if you're a meat person, this is not your burger.  But it's definitely worth the try! The pattie was a sandiwch itself! Cheeses were melted inbetween the portebello mushrooms! And at 490 calories? Not bad at all! (for lunch time that it)\n\n\nRed Velvet Frozen Custard -- $4.25 (half)\nadded banana and mixed seasonal fruits\n--VERY DELICIOUS! very creamy and soft! Good thing it was Saturday!!!! Ended my meal  perfectly! (asks for samples!)  If you're concerned with the calories, share the half size with someone!! \n\nI never really liked Shake Shack in the past when I tried the ones at UES and Times Square one.  Not a big fan of their fries and I used to LOVE all kinds of fries.  After this experience, it definitely changed my mind!!  \n\nThey serve hot dogs now?! WHAT?! Definitely want to try their Chicken Dog (at 250 calories)!!!!\n\nI don't know if I can rely on their calorie count but I sure do appreciate it for listing them on the menu!!!  Btw, this is a pretty small shack shack compare to the UES and Times Square one but I feel like this location is more cozy! \n\n*heart*", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-26", "description": "Not so hype as everyone makes it out to be. I had the Shroom Burger and the Bird Dog, since I don't eat red meat. \n\nThe Shroom Burger just tasted like a cheese sandwich with lettuce and tomato. I  could hardly taste the shrooms!  The Bird Dog(a chicken, apple and sage sausage) was good. It had a good crisp on it. The best out the bunch was the peanut butter shake. Very smooth and thick.\n\nMaybe I missed the hype because i didn't have the actual burger.... but hey, to each his own.", "author": "Ramon W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "By far my favorite burger joints in NYC. Too bad we don't have a IN-N-OUT. Although the burgers are kind of greasy to my taste I add more veggies to try to balance it out. Amazing fries and shakes. One more thing I've gained 5lbs and I think shake shack is one of the reasons", "author": "Andy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-29", "description": "OH the Shack...how I love thee.  I can't count the many ways.  I came here since it was close to the transit museum, where we came for an afternoon day off.  I don't have much to say, except I was impressed that I got a table right away (I think there is a lunch rush, we came around 3 pm I think).  There was also a few minute wait, which when you're used to the UWS, seems quick.  It's pretty centrally located, and easy to access via many MTA routes.  I noticed there was a Burger King, like, right next door.  Ha.  I wonder how much business they've lost as a result.", "author": "Taryn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Let me start off by saying that I love their Shack burgers. Nice and fresh. The Fries are the right crispness I like. Free refills woohoo.The service is excellent. Shout out to Sam. He was very friendly and helpful. I think he is a perfect example of the way Excellent customer service should be. He should get a raise. I will definitely come here more often.", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "the mushroom burger is not healthy, but sure is good.", "author": "Tomi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-28", "description": "It's obviously going to be pricier than Burger King, Wendy's \u0026 McDonalds which are all nearby but oh so worth it. Kudos to the staff as well for keeping such a busy line moving at at a good clip taking \u0026 getting orders out :)\n\nIf you're near downtown Brooklyn by Fulton Mall/Borough Hall area.. Don't miss it! \n\nStop by the shack", "author": "Charlie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-21", "description": "Came in here with some friends for dinner during the weekend. I had the single smokeshack which is the cheeseburger topped with Niman ranch all-natural applewood smoked bacon, chopped cherry pepper and shack sauce. I can't take spicy foods, but I didn't think the cherry peppers were going to be too spicy...I ended up scraping off the cherry peppers after two bites. The burger was still delicious. I also had a small order of fries and a root beer float. I walked out stuffed! I also tried my boyfriend's fair shake, which is a coffee shake made with 100% certified organic Arabica Fair Trade beans.\n\nTables are hard to get so I was surprised to see an empty table when I walked in. I walked straight to it and had my boyfriend stand in line to order. The table we were sitting at was freezing! The diffusers were aimed at the glass wall behind us so the air was hitting the wall and bouncing back onto us. So, if you can, find a table away from the glass wall at the far end across from the counter.\n\nIt's also great to see items on the menu for doggies! The tabletops are finished with wood that has been reclaimed from a demolished bowling lane. Cool!\n\nIt's a quick meal if you're ever in the neighborhood. They also serve beer and wine.", "author": "S C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-01", "description": "Disappointed that my order today was incorrect when I got home: got chocolate shake instead of coffee shake. Also I was shocked to find out the patty was completely cold and very crispy?! (Like completely burnt and crunchy around the edges) Such a let down.", "author": "Anne P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "Cheap(ish) food. Tastes good. They are willing to do protein style (no bun) for those who are avoiding carbs. The food seems to take quite a long time to get to you. There always seems to be a crowd of people waiting for their takeout and the place doesn't have the best layout for people waiting on food. I wish the burgers were a tad larger...I never seem to get full after eating here.", "author": "Lizzy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-29", "description": "Sooooooooooo HAPPY Shake Shack came to Downtown Brooklyn.  \n\nI personally think it's in a great location, and the place is REALLY nice and REALLY clean inside.  \n\nThe burgers are tasty and full of flavor! My only complaint would be that sometimes the burger meat is overdone, and has even borderlined burnt at times. Other than that the burgers are very good.  The cheese fries are da bomb!  (boom) The free refills, the water fountain for self serve water along with the neat serving boxes are just some of the +.\n\nRestrooms are clean.  Restrooms have nothing to do with food, granted.  But I hate going into an establishment to eat and when I go to the restroom it looks like it may or may not house one or two people.  The bathrooms along with the rest of the place are well kept and clean, big + for my confidence in the overall hygiene of the place.  \n\n\nI recommend this Shake Shack location.  Its a great place to eat and the service is very friendly. But you need patience, sometimes the line is out the door.", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "Excellent burger, fantastic bread, good flavor, not dry. Everything you want in a burger. No complaints. I don't know what else to say but I have to keep writing because Yelp says my review is too short to post and will only let me save it as a draft. Blah blah blah blah blah blah blah.... Are you serious.... I have to keep writing. Finally! The end", "author": "shamm w."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}