{"aggregateRating": {"reviewCount": 324, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Really enjoyed this location right under the Brooklyn Bridge as our first experience with Shake Shack.  It really hit the spot right after our hike across the Bridge.  Atmosphere was hip with furniture utilizing the wood beams from local factories.\n\nOrdered the Shack Stack...cheeseburger with their fried mushroom patty.  It was worth the hype.", "author": "K W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "Everyone raves about Shake Shack...it's like the In-N-Out of the East Coast. The name implies that it's for milkshakes, and that it's a shack. It isn't really either, and that pisses me off because I am a fan of restaurant literalism. There are no shacks in DUMBO...yet.\n\nIt's like somewhere in between a McDonalds and Five Guys. Like if this were a human centipede of restaurants, a restaurant centipede, Shake Shack would be in the middle. Although that sounds like the worst place...I dunno. Who knows, I doubt those things have ever happened so I have no reference.\n\nBurgers are ok but are nothing special. Stuff can get pricey but it's DUMBO so you expect it. There are too many couples with babies in there, which is what DUMBO has been about lately. What to expect when you're expecting eh? EH?", "author": "Danny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "My favorite Shake Shack in NYC. Not too crowded on a Saturday Night. Fries were better than other Shake Shacks; were more crispy. Clean and quick service. Right by an amazing view of NYC.", "author": "Joanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "First time here service was great a little pricey yes. The girl behind the counter was super cool. I tried the Smoke Shack with everything. I believe this is the best burger I've had in a long while.... I will definitely come back...:-)", "author": "Tim K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-11", "description": "Weak! Melted shake, long lines, poor service, small burger. Two thumbs down. What a racket!", "author": "Sunita D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "First time ever here, decided to check it out as it was next to one of my favorite spots to relax at Brooklyn Bridge PArk. I know I payed a little bit of a premium cause of where I was, but over all I have to say it was a great burger( I had the smoke house double, which has bacon, cheddar cheese and chopped sweet peppers on it) with cheese fries on the side. Definitely a repeat if I'm in the area, but would  not go out of my way for. A suggestion would be if weather is nice take it to go and just walk across the street and find a table that's available and have lunch by the water. The views of the city can't be any better.", "author": "Terence S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "Had a strawberry shake, a chicken n' shak and some fries. The chicken burger was amazing and the shake also really tasty, fries were solid but not outstanding.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "Good is great here! My son's school took them on a field trip to the Brooklyn Bridge then lunch here at Shake Shack and the staff were soooo patient. Tons of middle school students ordering food was not the easiest and they only smiled. They helped each of the kids order and made sure all of the kids had their orders. Amazing staff! The area was clean with tons of seating. We had cheese fries which my son were amazing and I have a veggie burger which was a also amazing mushroom flavor.", "author": "Latrice B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-15", "description": "In my opinion, not better than an In \u0026 Out Burger, different from a Five Guys burger, not better than and real steakhouse style burger in any way or comparison. And the fact that I never get a craving to eat Shake Shack over eating cheeseburgers from McDonalds, a Whopper from Burger King, and a Baconator from Wendy's makes me think that this place isn't that good at all, but it has its own \"good\" qualities that I can see why people like it and of course the Cheese Fries and shakes and other things make it nice. But the burgers ... not my choice.", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "Excellent service and staff, solid burgers, fries, and shakes. My favorite location, not as touristy as the upper west side location, at least you can get a table here, the rotation is very good.", "author": "Lisa J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Grabbed a quick treat to snack on while I sat on the pier. The CARAMEL CAROUSEL was delicious!!! It combined all my favorite ingredients. (vanilla custard, caramel, banana, sugar cone) It was just the right amount of sweetness. Gonna have tongo back to try the burgers.", "author": "Nikki J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "Smoke shack burgers were juicy and flavorful. Buns were warm, fresh and soft. Bacon was crispy. Shakes were good - average. The portobello burger should have either had a sharper cheese or they should have marinated the portobello for more flavor. It was fried and I don't think that was necessary except it did add a nice crunchy texture. The place was packed (came on a Sunday night) but we did find seating relatively quickly and the service was friendly and fast. Plus is location and flavorful burgers and the minus would be that burgers are small and the vegetarian option had room for improvement. Price is reasonable for the area.", "author": "Chelsea C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "Love me some Shake Shack. The queue system at this location is really helpful, although somewhat confusing for newbies. This location is really nice, too, not only inside the restaurant, but outside is well - you have a great view of the riverside and the bridge. The food is, of course, amazing and tastes like heaven. The staff does their best to keep the tables and dining area clean, which is no small task given the volume of customers each day. Service can be hit or miss, sometimes friendly and sometimes not.", "author": "Jennifer I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "We don't have Shake Shack here on the west coast , but was told about it, so finding this one near the Brooklyn Bridge , I stopped in . Was a bit early for lunch , so I got a chocolate Shake , nice breakfast . tasted great , very clean restaurant . Nice place to relax before my next stop .", "author": "Marc S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "I went into Shake Shack for a smoothie to go and was directed to a line designated for simple drink orders like mine. I loved the process because I was able to skip the huge line for burgers that had begun to wrap around the building. The shake was wonderful and service was relatively quick despite being so busy.", "author": "Kayla N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "I've been to several Shake Shack locations and they've all been good but this location is just spot on! I might be a little bias since it's two blocks from my apartment, but the service here is amazing, the staff is very friendly and always helping their customers pick the best burger or shake for their liking and I know that can't always be easy since most of the tourists that come to the area don't speak a lot of English. \n\nThere was a little error on my order when I was rung up and when I brought it to their attention they immediately fixed it and then the manager gave me a free shake card! I was very surprised and they seemed genuinely happy to try and make me happy! I will totally be back to this location (probably a lot more than I should).\n\nThe three times I have been to this location the line has moved very quickly and I never waited more than 15 minutes for my food. However, I have seen the line wrapped around the building during a weekend afternoon. So, be smart, if you want Shake Shack don't go at 'rush' hours/days.  Just know that if you do wait a long time that it will be worth it! I've yet to have any thing from this location that wasn't exactly what I wanted and perfectly cooked. \n\nThis is also a very nice sized location. There is a lot of seating and even a fireplace that I'm sure will come in handy during the winter. One of my largest gripes with going to other Manhattan locations is that there is never any seating and I end up waiting around for someone to get up and hurry to snag their spot. No problem here. That and the riverfront is right there so even if you can't find a good seat there are TONS of benches and seating with the full view of the Manhattan skyline and the bridges.", "author": "Sydney O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "After seeing Shake Shake in times square by our hotel super packed with a long line going outside of the door I was ecstatic to see this shake Shack in Brooklyn not as busy and conveniently located by the Brooklyn Bridge. After walking and visiting the Brooklyn Bridge we stopped here for a hot dog, burger and their shakes and they were so delicious!!!!!!! Tasted homemade and definitely fresh. This location has plenty of seating space indoor and outdoors. I wish they had Shake Shacks in California =(", "author": "Paola B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-20", "description": "Shake Shack is everywhere (coming soon to a location near you) and Danny Meyer's bank account is growing.  Shake Shack has a successful formula, a solid buzz and strong momentum.  Please Mr. Myers, bring back Union Square Café!      \n\nThe food is better than run-of-the-mill burger joints but not as good as a bbq or solid pub burger.  The milkshakes are yummy with good ingredients and they sell beer to go with your burger.  The fries are fresh, not too salty and actually taste like potatoes.  The prices are only slightly higher than MCD or BK.  The interior feels trendy enough to make you believe that you're not in a fast food burger joint.       \n\nThis place gets super crowded, one night shortly after opening this location, they actually ran out of burgers.  \n\nBiggest negative (besides the health impact of eating this type of food) is that this spot is just like the Shake Shack in Paramus NJ, just like the ones in Manhattan, the same, the same, the same. \n\nThis Shake Shack appears to be doing a solid business and seems to be here to stay.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Yumz! Great location and layout! They also have beer, wine and you can bring your dog!! They have a dog menu!", "author": "Karen P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "The service was awesome friendly, and Shake Shack never lets me down. A late night Shack Burger followed by a gorgeous walk \u0026 view. Yes!", "author": "Dana V."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/P63u0nkbJWwhIjLXR7IQog/ls.jpg", "@type": "Restaurant", "telephone": "+13474352676"}