{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "First I had the shake - yum! Later, I went back for food (Shack Burger and fries). Amazing! What's the secret sauce?! I don't know, but it was awesome. I could eat 2 more of those meals.", "author": "Courtney C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "I'm a big fan of the shack stack, of course its a seasonal treat, unless you like your arteries clogged. If you're not big on long lines, downtown Brooklyn location is usually way less crowded than most manhattan locations, esp MSP", "author": "Kristine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-27", "description": "Great tasting burgers, but with a hefty price tag. Originally from Cali, it's difficult not to compare the burgers to In-n-Out, where you can get a Double-Double (double the size) for half the price ($2.50 instead of like $5). Alas, this is the price I pay for becoming a New Yorker. I don't mind the price too much in the end.", "author": "Alan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "The smoke shack and the fries were great! The milkshakes are just milkshakes..nothing special about them, but the food is great!! Can't wait to return!", "author": "Reese W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "Love the convenience of this location! I work very close by and I am always around Brooklyn with friends. This is the first time that I went to a Shake Shack and did not have to wait half an hour on the line which is a relief when you're starving. It was very clean inside and the service was quick. I've only had the shake stack here and like always, it's amazing...I can go for another one just writing this review. That breaded portobello mushroom is out of this world.", "author": "Andy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "Great organic burgers with a little pink in the middle mmmmm. Shakes and fries are solid. Haven't tried the custard yet but everyone raves about it. Oh yes, and they literally sell dog food also lol . Only in brooklyn.  They have liquor +++", "author": "Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "I couldn't believe it when this Shake Shack opened it!  I had never been to the ones in the city but I knew I had to come try it out since I live in the area. Boy, did it not disappoint!\n\nThe burgers are small (I'm from Texas, so i think all NYC burgers are small) but so juicy! And their fries are incredible! I can order take out, walk back home, finally eat the fries 15 minutes later and they're still crispy! And the cheese they use for their cheese sauce is so addictive! \n\nI ordered their s'mores custard the other day and it was delicious-with chunks of graham, crackers and chocolates in it. Yummy!\n\nIt gets super busy, especially on the weekend when a lot of tourists come in so it gets really hard to find a seat, but stil worth the trip.", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-05", "description": "The line was decent, around 10-15 minutes. The workers were really nice and the overall atmosphere was great.  The kids at nearby tables were so adorable and everyone was just in a good mood.  \n\nI ordered a shake shack burger with cheese fries and a vanilla milkshake.  The burger was pretty good but the cheese fries were a bit dry.  The cheese was half dry and melted so it was grainy and sticky.  The milkshakes are AMAZING ugh lovem!  \n\nCompared to this shakeshack, I would say the one on madison is definetely the better choice. The lines are twice as long but the food is better and its nice to eat outsidw sunny days.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "Came here yesterday for dinner with my family and the Downtown Brooklyn location was surprisingly the least crowded. This place also had literally NO people in line when I first arrived. \n\nWe ordered three ShackBurgers, two vanilla-chocolate milkshakes and two orders of cheese fries. I was actually expecting to wait at least 20 minutes for the food to come (I've been to Shake Shack enough times and enough locations to know) but it actually came pretty quickly (I'd say about 10 minutes?) It felt pretty short too because the outdoor seating has free guest wifi (a great bonus!) \n\nAs always, the food is delicious - no more details! I definitely feel this Shake Shack is the best location in NYC - not as crowded (probably because it's in Brooklyn though), not as big as the one in the Theater District/Hell's Kitchen for example, but has more seating. \n\nMost definitely would come here while shopping in downtown Brooklyn and looking to grab a note!", "author": "Josephine W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-16", "description": "I have only tried Shake Shack one time but  am officially addicted! I got the double shackburger with shack sauce and the cheese fries....it was heaven in a bun! lol\nThe burger was juicy and flavorful! I was a little lost on how to order \u0026 what 2 get on ur burger and stuff, but i was with an experienced Shake Shack-er (lol) and she helped me out. (she also introduced me 2 chipotle!!!)... I live in queens but would take the train or a cab to downtown BK just for a shackburger...; )", "author": "Dyanna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-12", "description": "Good burger, great shake.\n\nTakes a while to get the order, a la In and Out, but we were all pleased.  Enjoyed the cheese fries.", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-13", "description": "love this place. love their special sauce, fries and milk shake.\n\nparticularly love this location as it is clean, fast and close to the station.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "Best burgers, fries and shakes in New York City! All for a decent price - this ended up being our favorite place to eat out of all the recommended restaurants in the city.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-08", "description": "Stopped by during lunch hour rush to pick up milkshake. Went off line to use the bathroom to find out that door is locked and sign says \"for customers only code is printed on the receipt\" What if I am not a customer yet??? Asked an employee and he said I have to wait online. Obviously I left. This place has no respect for the customer or local community. Stay clear... Five guys burger next door is not asking for a paid receipt to use their facilities....", "author": "Peter N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "Living here in the big Apple for nearly a decade, I used to get laughed at for never been to Shake Shack, but not anymore! (I have recently been to their Kuwait location also, but that's for another post!) After watching an awful off-broadway show on a Thursday night, my family walked to the Times Square Shake Shack and the line is so ridiculous, so I said, \"oh well there is one right in downtown Brooklyn.\" I am so glad Shake Shack decides to open up a branch here because we did not wait at all. The vanilla shakes are amazing, and the meat taste fresh on those burgers, not that frozen crap. I also tried the hot dog, it had a touch of this fine pepper seasoning on top. My only complain was the portion of the white wine, while it was very nice, they barely filled it up to 1/4 of it in this mini cup. Overall, thumbs up for Shake Shack Brooklyn.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "I love this place. Everything is so good. My only problem is that it's always packed. No matter what time I come here there are no places to sit. But that just proves how yummy they are.", "author": "Eduardo A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "Great burger. Juicy, fresh and great tasting. Fries and shake were top notch as well. Only complaint was we got our good to go as we were staying at hotel down the block and they don't really pack the food well for travel. Get some Togo containers to keep items warm and together during transit.", "author": "R W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-17", "description": "\"Shake Shack this,\" \"Shake Shack that.\" Most people I know love this fast-growing NYC area chain. I wish I had known Shake Shack when it was a sole burger joint in its original non-commercial building. The chain atmouspher and high prices here make Shake Shack more of a novelty for our friends who are visiting from out of town. The burgers are OK, but tend to be overcooked. The fries aren't anything special - but solid. The shakes are tasty and vary in flavor depending on the season.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "Perfectly simple burger. Bun is warm \u0026 soft, meat has a nice carmalization, sauce w/ fresh crisp lettuce \u0026 tomatoe.....yum-my. Shroom burger is good too. Nothing like gooey cheese oozing out of a bun", "author": "Aisha D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-19", "description": "As\nFast food\nGoes it is\nWell designed, clean,\nAnd they have custard. Good eats on the go.", "author": "Justin L."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}