{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-22", "description": "I had a cheese burger with cheese fries and a black and white shake... Needless to say with the calorie content I won't be eating the rest of the day but trust me IT'S WORTH IT!!!\n\nThat was a damn good meal!\n\nBurger done well, cheese fries... Crinkle cut... My oh my it was deeelish! Recommend for any burger and fry lover! \n\nAnd my shake was tasty \n\nFYI ... Do have a 20$ bill on hand... This delightful meal ran me almost $17 bucks... If you're looking for a value meal hit up the Wendy's down the block!\n\n\nWill try again.", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-23", "description": "So, I've only been to Shake Shack twice, and luckily the line was not miles long either time.  The burger is nothing to write home about.  Frankly I don't understand why people would wait so long for one.  They do use a lot of salt and so it's tasty.  I mean, it isn't bad, it just isn't anywhere near the best.\n\nThe fries are good, but they appear to be the same crinkle-cut as Ore-Ida.  They are perfectly crisp on the outside and soft on the inside.\n\nThe first time I went to one, I did have a caramel milkshake with sea salt that was AMAZING!  Apparently they don't have this specialty shake at every location, but the one on the UWS is where I had mine and it WAS worth waiting in line for.  Not worth $5, considering the small cup and the fact that I can buy a whole pint of Haagen Dasz for $4.\n\nSo, my 3 stars is just to say that they're good.  Just good, not wait in line for a half an hour in the cold good.", "author": "S M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-28", "description": "It was my first time coming here. It was packed the lines were fast but we had to wait for seats. I got the shack stack burger, which is the one with the mushroom and the meat. It was better than I expected it. I thought it would just be like any other burger but I was wrong. It's pretty pricy though. Ten dollars for a burger. But I do enjoy the food.", "author": "Samantha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "Too tempting for a lunch break.  I wish my office was a little further away....\n\nI'm really excited that one opened in Brooklyn, though.... I used eat at the one on 23rd all the time!!", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "The addition of a Brooklyn Shake Shack means there really is no reason to go into Manhattan anymore. \n\nThis location is pretty large - I've been 3 times since the opening, and have never had to wait for a seat or wait more than 10 min in line.  \n\nThe custard offerings feature local Brooklyn mix-ins...the bacon peanut brittle sounded good, but tasted odd...not a fan. \n\nWish Shake Shack would get with the times and put weekly custard offerings online for each location.", "author": "Y B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-22", "description": "Yes! I'm a fan of Shake Shack. I've been to a couple of their locations with friends, and they're very good at what they do. I find the shakes to be very rich and the flavors a bit limited, so I seldom order shakes, but instead opt for a burger, sometimes with fries. I'm not a huge fan of their fries, but they're obviously good enough that I continue to order them. Their burgers are my favorite thing to get there. Yes, they're on the small side, but every bite is packed with flavor, very well balanced, and I find that I don't *really* need more than one. After all, there's a bunch of fat in them. Just let it sit for a second. You'll be full. \n\nAlso, the last time I went -- it was on a Saturday afternoon -- the line snaked out the door, but moved impressively quickly, so don't worry about that.", "author": "Azure O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "I'm beyond happy that they are finally in brooklyn. Standing on that long ass line in Manhattan is the only reason why I didn't indulge in this tasty goodness more often. But now, bring it on.\n\nFirst I love the location and the hours (open until 11pm, sweet!!!!). And the wait at least when I've gone is minimal (another huge plus over the city locations).   I visited them twice in week already. Its such a convenient location  -- get off at Borough Hall or Jay Street/Metrotech train station, and its a block or two away. This a great hang out for friends or a casual date.  \n\nI always get the Shack Burger. So freaking juicy and delicious. My vegan friend got the 'Shroom Burger. Its nice breaded mushroom wrapped in cheesy breaded goodness. She loved it so much she went back for 2nds during her first visit . She's is a new Shack convert. \n\nWelcome to Brooklyn!", "author": "Bklyn M L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-11", "description": "OVERRATED! Give me a Kosher Hot Dog Please!\n\nI ordered a hot dog and it was awful. The best thing about this place is their french fries, cheese sauce, and over priced sodas!", "author": "Kayisha T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-17", "description": "Came here with my boyfriend to experience my first Shake Shack burger. Glad I came to this location -- lines weren't too bad (waited about 10 min in line and 15 min for them to buzz us with our burgers). Service was friendly (the cashiers actually greet you with a smile).\n\nWe ordered 2 Shake Stacks -- granted they are quite expensive for a fast food burger but it was yummy. We found a table and enjoyed. Loved the fried mushroom and cheese oozing out of it. Had so much flavor (didn't even need the ketchup!).  \n\nOverall a great burger and a great location!", "author": "Siv L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "Got a shake cheeseburger which was excellent. Buttery bun, fresh tomato and lettuce, decent patty and delicious sauce. Fries were pretty bad, seemed like they were just heated from a frozen pack. Salted caramel shake was pretty good too.", "author": "A K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-24", "description": "How many people discovered Shake Shack from the movie \"Something Borrowed\" Raise your hand . . .   o/\n\nMkay, just me? Oh.\n\nWell, marketing is everything! The mere sight of the logo was attractive but in addition to that, in the movie this food was good enough to be taken abroad as a gift. I had to find this place! I checked my handy dandy yelp book and there is indeed a brand new Shake Shake in Brooklyn ... (Which apparently is a big deal since the other locations require a small expedition to the Upper East/West Side).\n\n\nDespite the bells \u0026 whistles that come along with this place at the end of the day this is nothing more than an upscale fast food restaurant. The warm welcoming customer service was not to be expected but the staff here were extraordinarily pleasant \u0026 polite. Smiles from each person on staff I encountered. \n\n\n- Fries WITHOUT cheese were good. . . With cheese, an overwhelming disaster.\n\n- Carmel shake was okay, nothing I'd go out my way for.\n\n\n\nAnd that Sweeties is the extent of nice things I have to say about Shake Shack.\n\n\nIf you don't eat red meat and want a filling meal go to a competitor. Unless you're willing to try a Shroom Burger. That doesn't sound bad though, right? \n\n I was expecting sauteed mushrooms with melted cheese and whatever dressings I was in the mood for that day. Instead I got a bun with deep fried mushroom tops stuffed with cheese. Thank God for ketchup, if I didn't have any it wouldn't have been palatable.\n\nAfter expressing my disgust with my meal I was offered a complementary chicken hotdog, or as it's referred to at SS, a \"bird dog\". It was good. I'm not a hotdog eater but if I returned that's most likely what I would order.\n\nThe franchise should strongly consider adding a turkey or veggie burger.", "author": "Vana C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-09", "description": "Good service. I think the staff tries really hard. However, I think the MGT is lacking. First, the CONSTANT HIPSTER MUSIC without ANY VARIETY is mind numbingly annoying.\n\nI can only take it in small doses.\n\nOh, and I'll be the minority and tell you that you new chicken sandwich sucks. What is that crap? Wow. Pull back on the breading and martha vineyards seasoning.\n\nSure, you're better than 5 guys but who isn't?\n\nI really should be paid for my feedback. F yelp. If I see another dick pic in a review I will sue.", "author": "A R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-31", "description": "3.5 stars.\n\nI have to say I am not one of those people obsessed with Shake Shack but I have to give them credit - they are better option than your average fast food. Shake Shack is NY response to LA's In \u0026 Out: small chain restaurant serving thin burgers that have a perfect taste because the ingredients and light and blend together nicely. This is not a monster Angus burger from your local joint; it's a completely different beast. I tried single shackburger - good and double - not a fan, not as juicy and the flavor is not as balanced. Milkshake is good but not the best I've tried so would not return for $5+ shake that's nothing to wow about.\n\nTry it, but don't expect anything amazing. And if you see a ridiculous line outside - just keep going, not worth the wait. And yeah, they have wine and beer. How cool is that for a 'fast food'?", "author": "Namik G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-13", "description": "Excellent Burgers and a great beer!  \n\nThe shake burger has some kind of sauce that is just amazing (but probably not that healthy!), so we also had a bird dog to balance it all out.  The shakes were also very tasty, we tried the strawberry.\n\nWe did have an issue with our order but the staff was excellent and responsive and kept the smiles on our faces. Best burger joint we've been to.", "author": "Chris R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "I'm not a big burger fan, however, I do enjoy eating Shake Shack burgers--maybe all the hype has got me influenced into liking them...? My husband and I usually come here right when it opens on Sunday (11am) since that's when our church ends (we attend Brooklyn Tabernacle...) so we are literally the first or second ones to order, whoohoo!\n\nMy husband usually get double hamburger since he thinks it's less greasy than the cheeseburger and/or Shack burger or Shack Stack (their burgers are bit in the greasier side...). He thinks it could be the cheese...? Who knows. He then asks for Shack sauce on the side so that he can put them in himself--he says he likes it like this better than getting a Shack burger. As for me, as I mentioned above with me not being a burger person, I usually stick with a hamburger (boring, I know...). \n\nThe fries are decent---nothing special about them, and the shakes are pretty good (we usually get Black \u0026 White). \n\nI guess the big highlight about why I like THIS particular Shake Shack is not necessarily because the food is better than the other ones, but because there are definitely less people--meaning less time waiting in line to order your food. We've came here right at 11am and also around 2pm--and both times, we were able to grab food at a decent time. I know this is very unlikely at anywhere else, especially the one in Madison Square Park. \n\n\nSide Note: This Shake Shack opened up literally a year ago (as of December 2012) or so--fairly new and clean!! There are other new places right around Shake Shack such as Panera Bread and Potbelly that just opened up several months ago, so if there are long lines, you do have some other options!\n\n\nPrice: $$", "author": "Christy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-20", "description": "I was interested in coming here for the longest. I was in the area and decided to drop in and give them a try. \nFirst impression was it was a cool place. The menu is pretty basic burger fries hot dogs milk shakes drinks.\nI really wanted to leave because of lack of burger choices.  But I chose to stay. I ordered a shack burger cheese fries and root beer my friend ordered the same. The bill came up to about $20. -__- . \nFood finally ready, I can't wait to but in. Burger was medium rare which is fine but I feel it wasn't seasoned enough. My friend liked the burger I complained about everything but the soda. The fries I felt I could have made them better my self. I always put salt and pepper on ny burgers and I also but it on the fries. There were no onions on my burger :-/ I hate that!!! Basically I give the whole meal 5 out of ten. I personally felt mc donalds is better tasting. It Definetly wasn't worth the 20$. Would I come back? Probably not on my own especially if I'm paying; I Definetly won't go back but the crowd draws you in. I would give it 4 stars for everything including the ambience but my rating is based on the food.", "author": "Kerry L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-20", "description": "Cheese fries and their smoothies is a MUST TRY!\ntheir meat especially burger however is simply NASTY!\ndo not get me wrong it looked pretty and neat. but it tasted sooo raw!\nit was under-cooked! it was bloody and nasty. it def  made me SICK ...\nOVERALL, the place had a makeover! much pretty now", "author": "Nora A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-12", "description": "Great for their frozen custard and \"concretes\" but other items (2 stars) are way overpriced for what you get.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-09", "description": "This particular review is for their shroom burger. I was very excited after hearing all the rave about shake shack, however, the cheese in the middle of this burger was not good and I felt like I was eating at Mcdonalds- nothing fresh about this burger at all. I'm sticking with In \u0026 Out.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-14", "description": "tl;dr why no onions??\n\nLet me preface this with the fact that I'm a California resident and I've had my fair share of In-N-Out. I know its secret menu, and I know exactly what to order at In-N-Out at every visit.  I had wanted to visit Shake Shack ever since I saw a post on a food blog comparing the two dining establishments.\n\nOf course I'm going to pick In-N-Out. Are you even surprised? You shouldn't be. It's because of one critical missing ingredient in the Shackburger: ONIONS. I can't believe it. I actually didn't realize there were no onions until I was done with the burger, but as a grilled onion lover, I was appalled to find out that the Shackburger doesn't come with those sweet rings of justice. Did I have to ask for them? I don't think I should have.\n\nRegardless, I thought the Double Shackburger was a great burger. The patty was extremely juicy and well-seasoned and really propelled the burger forward. Regardless, value for value, In-N-Out definitely stands triumphant over the Shack Burger.\n\nPS: Was anyone else surprised that Shake Shack sells beer and wine?", "author": "Jason T."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}