{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-07", "description": "I have heard such amazing things about Shake Shack so I was psyched to try it. Love that this location has local beer on tap, score! I ordered a Shack burger and shared an urban lumberjack concrete and a Dogmeister with my brother. That shack burger was incredibly juice and drool worthy. The taste of this charred flesh really could make any vegetarian think twice, it was soooo good! I also think it was the perfect size, not too bit, not small. However I was really disappointed with the concrete and the dog. The hot dog itself was not of good quality, I think it was pork and I prefer a hebrew national or sabret any day... the topping were okay, but I was not tasting any of the beer they said this had. The concrete was so sad...it sounded sooooo good, but I have to say the vanilla frozen custard they used was sooooo bland, it was creamy, but there was no hint of vanilla detected. The bacon brittle is a mis-nomer. I think it is the stuff \"The Redhead\" sells, I never had it there, but had some of it packaged from the Chelsea Market. If that is really not what it is like at the Red head I don't see what the fuss is about, there is no brittle but plenty of nuts with a smokey flavor, but tasting of bacon, I think not, sooooo disappointing. The belgian waffle in it was an excellent addition but they could have kept the bananas too... didn't mesh well with the rest of the flavors.", "author": "Sophia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-07", "description": "Tasty burgers with excellent service. My food came out in a timely manner and it was fresh \u0026 tasty.", "author": "Jacob T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "So happy there is finally a cool chain available by school in Bklyn. Chipotle and Five Guys was getting a little old. Anyway, we went to the Shack late one night and it was pretty busy (only a good thing for the neighborhood). After waiting in line and ordering it was a little difficult finding seats. The workers were very nice and welcoming. I ordered the shack burger, fries, and the black and white shake my favorite. The burger was perfectly cooked and delicious. Would definitely go back.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-31", "description": "I can never rave about this place enough. If you're looking for the best burger joint in NYC, this is your place. The location in Manhattan always has a minimum of a 40-60 minute wait and it is worth waiting for! If you make it over to the Brooklyn location, there usually isn't a wait at all though. Make sure to also try their custard off the day! Scrumpch!", "author": "Angy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "Absolutely, hands down love the burgers here. Very juicy and light, the secret shake shack sauce is perfect. The cheese fries are pretty good as well, but the milkshakes is the icing on the cake...rich and delicious shakes. It makes sense as to why the line is always so long. Well worth the wait.", "author": "Cathia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-01", "description": "More like cheeseburger heaven! I love their cheeseburgers they have a lot of grease but somehow it's not too much. I got a single cheeseburger with fries and a vanilla shake and my friend got a double cheeseburger with fries and a peanut butter shake and the total came out to $28 and change so not too bad. The vanilla shake was delicous..but it's a bit too much with a cheeseburger. \n\nThe best part about this place is there was no crazy line which you'd know is rare if you were a die hard shack fan! the decor is really nice too..the tables and walls are made from bowling alleys. Eco friendly and super delicous, how can you resist?", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "Shake shack is amazing. Some of the best burgers around but also, DO NOT SLEEP on their super high-quality hot dogs!", "author": "Patrick L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "The best burgers ever!! I took a ShackBurger, french fries and a FairShake and it was a gorgeous lunch!!\nThe meat is tasty, organic and well cooked, and the Milkshake was solo good! Real coffee taste! I will go back ASAP to try other burgers!!", "author": "Marc D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "Love shake shack and particularly, the indoor seating. It was warm out today and the AC was blasting! Modest amt of seating and relatively quick table turnover time. You may need to wait a bit for a table but overall, great experience! Awesome burger, cheesy fries, delicious!", "author": "Nancy N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-04", "description": "The cheese fries are amazing. The taste of burgers vary from time to time depending on the level of hunger. The lemonade tastes very home-made, a bit on the sour side. I will only recommend the cheese fries, I think it's the best thing on the menu.", "author": "Joann Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "I used to always go to McDonald's and be hesitant towards any other restaurant. However, I'm GLAD my friends introduced me to Shake Shack! I love the food! Their burgers are real and cooked very well! It's better than McDonald's and their shakes are awesome!", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "I ABSOLUTELY LOVE love love this place!! I am a burger type of girl and burger from shake shack always pleases to satisfy my craving! I always order the regular shackburger well done with a side of cheese fries! The hot dogs are pretty good too!!! i mean everything is good about this place. I have yet to try their frozen custard though.", "author": "Wankairys D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-31", "description": "Head about SS from so many of my fellow food heads who've been in the area . Wasn't sure what to expect , because I don't think its that easy to mess up a hamburger . I lived the bun, the meat , and the strawberry custard shake . My meat was a little over seasoned but good nonetheless . The fries were ok but they were a little too processed and tasted a little freezer burnt . I would return to SS again . The service is good and the food is just as good .", "author": "Bryan Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-04", "description": "So I am not a burger person and I would have never tried this unless I was convince and I was. I am so happy I was. I had the burger with the cheese, bacon and the peppers, I think it was the smoked burger or something. It was amazing! We also got fries with cheese which were good to but this burger hit every spot! Delicious, cooked perfectly and this will prob be the only place I get burgers from now on!", "author": "Elizabeth F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-12", "description": "When you are surrounded by hype, the food needs to live up to it. I was here twice. The first time I was underwhelmed. I gave it another shot today, and still I cannot see why people are hyping this place. The service was fast to order. Ordered a Double-bacon cheeseburger, fries and a vanilla shake. Came out to $17.06! Talk about getting raped on price.\n\n     The wait for food was about 7 minutes. Not bad. The portions are ridiculous for the price. The shake was one of the smallest cups I have ever seen for $5. The fries were excellent. Fresh from the fryer. However, Shake Shack is a burger joint. When one does not have to use a napkin to wipe his mouth while eating a hamburger, something is very wrong. The patties are nice, and the bacon added a good taste.\nThe problem was that the burger was room temperature, the bun ice cold, and they only have American cheese, which annoyed me because they use shredded cheddar for their hot dogs.. So, why not have the shredded cheddar as an option with their burgers? Finally, what killed this place was that the burger was a bit moist. It was NOT juicy. I did not have to use a napkin, sleeve or anything else to wipe my mouth after eating this! For a burger not to be juicy is a stunning indictment.\n\n     In closing, though there are plenty of burger joints in the area. None of them have had the hype surrounding them like Shake Shack has. Fortunately for the competition, Shake Shack has a long way to go to live up to its' own press.", "author": "Ray C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "This is one of the few exceptions I make when it comes to chain restaurants; I love having a burger and shake here. This location was fine. We actually ate inside, which is unusual for Shake Shack. There was a/c on a very hot day, so that was good. The service was a little slow; it seemed like they were having trouble managing the number of people, which was bigger, but not huge.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-20", "description": "The Mushroom Burger literally made me puke. It had way too much cheese. I've never felt the same way about Shake Shack since.", "author": "Jaslyn G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-16", "description": "I give this place three stars just because is Shake Shack and I like the food. However, employees at this location need some focus. They are more into talking and playing with each other than working. I don't like when people fix their hats or hairnet and keep on serving food with the same gloves. I know they are just assembling the orders, not actually cooking, but still that is not acceptable. They need more mature employees and the manager needs to be stricter because these kids are not behaving.", "author": "H. F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "I've only been here during the lunch hour, and it's really a luck of the draw of how long you have to wait.  I've waited 10-15 minutes from waiting on line to getting my food to waiting a good half hour.   I've only gotten their bird dog and side of fries.  The bird dog comes in a hot dog bun, and it's quite tasty.  The french fries are crinkle-cut, which is a personally favorite of mine.", "author": "Helen F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-18", "description": "This is just organic fast food.  If the only reason you are not eating fast food is that it is conventionally produced, then you have found your perfect restaurant.  I however, don't like fast food anyway.  Mushy.", "author": "Kari T."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}