{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "Super good but is super PACk I had a Shroomburger which is always really good good atmosphere here beside the line i had to make", "author": "Luis R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "Yum yum yum. Shake Shack being delicious is a given, but I'm so happy for this downtown Brooklyn location, which is always full, but never unpleasant, and has a very efficient line to boot. Plus they never spell my name wrong.\n\nI love treating myself here once in awhile with not only a Smoke Shack, fries, but also a glass of wine - such a fun, random touch of decadence. Love their cute little wine glasses too.", "author": "Crystal W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "I literally stopped short in my tracks when I was walking out the borough hall station and saw shake shack down the street. I had heard the rumors but didn't think them true or to happen so soon.  So to my delight a shake shack opened in Brooklyn and less than a mile from my apt.  There goes any new years resolution to eat better! \n\nI've already visited this location twice, ...uh in two weeks... And of course it's now my favorite. The first visit, I had food in my face within 5 minutes! Unheard of elsewhere! Food is still same fatty goodness as all other locations. This location has only indoor seating for now, and they have their special Brooklyn concretes, see my photo.  Theres not as much seating as needed, but people eat quickly and tables open up by the time your food is ready.  I have not yet seen a line out the door here, huge plus!", "author": "Kitty B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "So, this location is better than the ones in Manhattan mainly because the line isn't as long. Jeez people, it's good, but it's not THAT good.\n\nThe cheese fries are great the first few bites, but perhaps a little too cheesy (apparently, that's possible). Perhaps they would be better sans the cheese. \n\nThat being said, this place redeemed itself quickly the moment I took a bite of the amazing Shroom Burger. I mean, wow! I enjoy vegetarian dishes, but this was so delectable that I swear the mushroom can make a perfect substitute for meat. I shall definitely try the other burgers, not so sure about anything else though.", "author": "Yuliya B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-28", "description": "Loved it!  \n\nThis Shake Shack site is so close to my apartment...I may be in trouble. The space is cool, though geometrically challenged. The staff is super friendly and professional. And the food is outstanding, as one would expect. I went last night for some hot dogs and fries...everything was perfectly prepared and cooked...yum!\n\nI may claim Shake Shack as my personal summer barbecue place...I'll invite my friends over for burgers, hot dogs and beer...and just have them meet me here!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-17", "description": "Fast service, great location!\n\nChocolate shake was on the money, nice staff ... Can't say too much about the food, just stopped on for a shake", "author": "Maya C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-06", "description": "Awesome spot at downtown Brooklyn rather it is dine-in or dine-out.\n\nI'm going to start with the great location it's on- it is on the corner of Fulton Ave which allows a view and having a great siting area inside. \n\nHere is one my favorite burger place to eat at, I grab something here every week since my school is quit close. \n\nIt is very packed especially at the hours of 1-3PM  during lunch hours. Which leads on the organization of this Shake Shack-I admit it is confusing. I don't like how they make us walk around or over people waiting for their orders to take out when we enter at the side. But all the staffs...are polite and friendly when they assist you with your orders. They are in additionally, very quick with your order even when its at rush hours packed with tons of people.\n\nBut the foods are worth all the chaos when entered. My favorite is the Shack burger due to it's sauce or it's Hamburger, but....the fries are the beast. I absolutely LOVE it- they are not curly fries, shoestring  fries, wedges, or anything else, BUT crinkle' fries. They make it not too soft, with a crisp in it. \n\nThis place definitely knows what their customer wants which keeps bringing me back and keeping me with them all the way.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "I don't buy into the increasingly popular notion that Shake Shacks quality and consistency has declined as it has has grown as a brand and expanded out of the City and around the Country.  Chances are this negative hype is due to people being instinctively against expansion and mega-chains in general.  The recent relatively negative review in the NY Times is a notable example of this movement.  While this assumption is often times true, it simply isn't the case from what I've seen on my far too frequent visits to this and other locations across NYC.  \n\n   I firmly believe that the food here Is the best of its type, assembly line fast food, albeit made with premium ingredients far Superior to the major chains, that is available in the City and among the best on the East Coast.  It is also the closest one can hope to get to the great In n Out than you will be able to get without boarding a plane.  That west coast legend is proof that a place can expand to include many locations and still retain its quality, do in large part to its management tensing intensely focused on all of the branches quality.  I think Shake Shack is emulating this smart growth nicely, and this first Brooklyn branch, with it's cool architecture and signature specials unique to the branch including ingredients sourced from the Borough, and service that is efficient professional and friendly, is a great symbol of the chain overall as it stands now. Also the one of a kind cheese fries are among the worlds best.", "author": "Brendan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-08", "description": "Shake Shack in New York City period is a headache for a burger and fries. Its good don't get me wrong but the lines are long for no reason. When I go to Washington DC I am in and out sitting available and fast services.", "author": "Gregory T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "this particular shake shack is amazing. the guys working here today gave us customers some of the best customer service i've seen in this city. awesome for these guys, thank you!!!", "author": "Maria M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-02", "description": "Come on now. This is what people are raving about?  I ordered the shack stack \u0026 fries to go.  It did not travel very well.  I wish that they had better packaging.  They literally drop it in a cardboard box, put it in a brown paper bag, \u0026 voila.  I kept thinking as I rode the train with it, that someone could easily reach down in my bag and steal my fries. \n\nThe fries were okay. Nothing to write home about.  Actually, I like Wendy's fries alot better.  The burger was not all that.  I couldn't even finish it.  The cheese squirting out of the mushroom was interesting at first.  Then it started grossing me out.  \n\nI don't know if it's because the burger wasn't piping hot or if folks just really hyped this place up.  Either way, i'm not impressed.", "author": "Nafeesha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-27", "description": "There's really not too much to be said. Everybody knows it. This is simply the best street style burger I've ever had. Fresh, crispy, with lots of taste and not too much fat. The interiors are cool and minimalistic too.", "author": "Erling L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "I had the privilege of this Shake Shack sitting right across my law school for the past two years. The lines are much better now that there are an assortment of burger joints in the area. But finding a seat is still impossible. \n\nShake Shack's burgers are good, you need to try the smokeshack. Even better are its shakes. The black and white shake is by far my favorite. I'd give shake shack five stars, but I find its burgers to be good, but not great. They're a bit too greasy sometimes and I've had some soggy buns before. Not good for your hands or if you're grabbing lunch and going right back to work. \n\nGive it a shot though. It's the East Coast's \"In-n-out\" and you will enjoy it.", "author": "Sherief M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "I ordered a Shack burger or whatever the main burger was called and it didn't stand out among other burger places but it definitely tastes good. Was a bit surprised about the size of the burger since it was a bit on the small side. The fries were the best part and the ordering and pick up system is efficient.", "author": "Nabil B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-10", "description": "The food is good if you're willing to brave the line. To me, it has the freshest ingredients of all the other shacks. Afterwards, I didn't feel so poorly about eating do terribly.\n\nMy ranking of the shacks:\n\n1. The park 2.  Brooklyn 3. UES  4. UWS", "author": "renje g."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-23", "description": "Don't come here if  you are on a diet.  Seriously.  Don't .  I was/am/ was.  \n\nI did the math in my head.  Calorie count.  No way I could get all I wanted: Burger, shake and cheese fries.  Don't judge.  \n\nSo, I tried to get my son to get all the things I wanted so I could \"nibble\".  \n\nStack burger,  yum good choice son....apple-wood bacon? oh can I try?....nibble, nibble.\n\nWhat do you mean you don't want cheese fries?  Ungrateful rug rat.\nGuess, I will get those for myself and eat them all.  Shoulder shrug... It's not even warm out yet and summer isn't like until forever anyway.\n\nVanilla shake....ARE YOU SURE YOU DON'T WANT THE BLACK AND WHITE SON? Slurp, slurp.....yum.\n\nI opted for the frisky dog, a little too salty and the dog didn't have that snap I like.  Opted for the lemonade with fresh strawberry puree.  It was way too sour.  Dumped it to polish off my son's burger and shake.\n\nMust go back for shake!", "author": "Wanda N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "Smoke Shack, cheese fries, and a half and half!!! My usual order!! You guys don't even understand how it makes me feel. It's like love bundled in spicy heaven. \n\nI've had the shroom shack and the shackburger and they're both really great. But the smoke shack is where it's at!!! It's always packed, and rightfully so, so be prepared. But the staff gets your order quick and they get it right!! \n\nLove this place it's always worth it!!", "author": "Tyra M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-27", "description": "I hear so many things about this place and see so many friends going. As a self-confessed burger connoisseur I can say that it's a decent burger. Sophisticated set up. Not the best burger and fries I have ever had but it was pretty good. Not much interaction with the staff so I can't really speak to that and the wait time was slightly long. \n\nI'd visit again but it wouldn't be my first option. Going I try the ice cream next.", "author": "Tonya R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-21", "description": "Overrated.\nGiven the hype and lines i usually see while passing shake shacks, I was expecting the best burger of my life.  This wasn't it.\nI had the double shack burger.  It tasted a little too salty for me. There was a tiny sprig of lettuce and a sparse amount of shack sauce.  I wasn't impressed with the fries either.  \nIt's also overpriced.  Not sure what all the hype is about.", "author": "Dee N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-29", "description": "No parking and crowded, over priced. I  don't like the Mushroom burger. I squeeze the bun and a bunch of sloppy mess oozes out causing a mess. The fries is full of oil. I didn't like this place. Plus no chicken sandwich is a big no go for me.", "author": "Fabolous D."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}