{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "Jury duty in Brooklyn, and slim pickings for decent grub, even with the generous times allotted for lunch and willingness to hike a distance to get it.  Of course I've known of Shake Shack for years and of the fanfare with its opening of a Brooklyn outpost, but I also associate it with outrageous lines and the Brooklyn store isn't particularly near any public spaces where I could take it to go.  But when a fellow juror suggested going together, I decided to brave it to try the famous Danny Meyer concept of fast food burger.\n\nThis Shake Shack is quite large.  Located on an almost peninsular shaped corner of a block, there are plenty of window seating all along its perimeter and many tables throughout.  Much of the traffic is take-out, and the food doesn't lend itself to lingering so table turnover seems fairly quick as well.  For lunch on an average weekday, the line wasn't very long either, and moved quickly.  After ordering, I discovered one reason it moved quickly; they employ heavy-duty pagers to notify you when your order is ready, a la big chain restaurants for seats, so less clutter at the pick-up counter.\n\nBasic menu of burgers, hot dogs, and fries for food; shakes, ice cream, and custards for dessert, and an unusual beverage menu for a fast food spot of sodas, lemonade, teas, root beers, wines, and draught and bottled beers.\n\nFrom our comfortable window seats, we people-watched and enjoyed the food.  Their single patty ShackBurger is a good size, similar to In and Out and likewise half-wrapped in parchment paper, with American \"cheese,\" lettuce, tomato, and their house ShackSauce, a creamy, pinkish, mayonnaise based sauce.  It is what I think its trying to be: a very good, basic burger.  Not worth lining up long for, not worth going out of your way for.  But if I wanted a no-frills, satisfying burger without a restaurant experience attached, this is great.\n\nPerhaps not surprisingly, the more outstanding item is their namesake shake.  I took a Fair Shake to go, their vanilla shake with coffee, and was stunned by how delicious it was.  Perfectly smooth and creamy, rich but not the least cloying, slightly sweet and gently coffee flavored, this was an incredible shake and I will be back AND willing to line up for this.", "author": "Valery C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "The burgers are good. These company reminds me of \"New York Burger Co.\" They have similar system of telling you when your order is ready by giving you an alert-device.", "author": "Hikari N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-04", "description": "Fulton Location was super busy and burger was good, but not as rich as the price.  the Fries are Great", "author": "Spencer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "This place is really good, much better than Five Guys. And it's a really clean place. Smoke shack burger is legit.", "author": "Dominic C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-18", "description": "For a while now, I have seen the incredibly long lines at Shake Shacks in Manhattan.  I had happened to be near this one in Brooklyn and noticed the line wasn't bad, so I decided to give it a try.\n\nThe line moved fast, and the staff were very nice.  I had to wait a while for my burger  fries and lemonade, but this was lunch hour, a peak time.\n\nThe lemonade was so-so.  I've had better.  The fries were very good.  The burger was very good too, better than at some places I have eaten.\n\nThat being said, I didn't think it was spectacular.  If I walk by one in Manhattan and notice the long line, I'll just keep walking.\n\nI didn't have a shake (maybe I should have, since it is Shake Shack!), and I think the next time I go I will try the shakes.  Maybe I'll raise my rating a star if I try one.", "author": "Joe L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-29", "description": "I almost forgot there was a shake shack in Brooklyn, I did say almost.   It is right when you get off the Borough Hall station of the 4,5 train.   I got to finally go here a few days ago.  The location to me is the selling point, the one on 23rd and madison is great location too but super crowded.\n\n  I got the Shack Burger but took it to go on this occasion, also got the Peanut Butter Shake (which was so good).  Like I said, location so great for me at least to then find the A train at Jay Street METROTECH after a little walk and head home.  Peanut Butter shake is one I highly recommend.  The burger was really good, the shack sauce was perfect and I usually add pickles to the thing too.   The burger is one that should be eaten right away, I learned my lesson, too much grease in the bag to deal with when trying to eat it later, bun gets really soggy on the bottom, I guess full of all that grease.", "author": "Jordan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "Though it was packed the line moved rather rapidly \u0026 orders were received in a decent amount of time. I got the shack stack with fried shallots I did not like that they put cheese on my burger but it was still tasty as always. The fudg-eeedaboutit Custard was mediocre; it might be better as a milkshake. The fudge was chalky \u0026 the chocolate icecream could've been better (I wish I would've waited to go to Starbucks for a cold treat). You have to search for space because the seating is limited, experience was overall good. I go back I like the burgers.", "author": "Jameelah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-28", "description": "Great burgers...nice and juicy. Definitely not McDonald's!  The fries were just how I like them...not too salty and just the right crispness on the outside. Service was good...not great.", "author": "Lia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "Shake Shack fills my west coast void for In and Out. They have the shack burger, chicken dog, crinkle cut fries with cheese, shakes and even the poochini (peanut butter custard for my pup). This location is great, with lots of outside tables when the weather is nice and you want to get out of the office for a bit.", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-16", "description": "The days when I once looked forward to visiting this restaurant are long gone.   What use to be a experience in buying the best burger in Brooklyn has now become a nightmare of endless lines, flaky cashiers, and inattentive bag packers.   My current cashier, Tyrone, not only allowed a woman to skip the entire double line waiting to place an order, he also nonchalantly takes my order, says \"let me double check to get this right\" and still enters it incorrectly.  In my past two visits here they have messed up my order.   I know you may be asking \"well why do you come back?\"   The answer is simple; the burgers are great and my family enjoys them.  Now I will admit that we come less frequently because of the horrible service.  I just wish this place would hire a manager who can bring this Shake Shack back to its glory days.  I'm giving this restaurant a two star rating simply based on the food. As I ponder on whether or not to submit this review and give them the benefit of the doubt a lady has just complained that she asked for no cheese in her burger and the man behind the counter has shrugged his shoulders and told her it says cheese. And the closer...they've lost my order.  I have to provide them with my receipt to confirm my purchase, and have it remade.  This is unacceptable service.", "author": "Chris A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "Mouth-watering burgers with tasty cheese fries makes me come back although it is a very pricey fast-food spot.", "author": "Mariel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "The best burger I had had in a very long time. Ive been wanting to come here since I saw it on \"the best thing I ever ate\" I do regret not getting a shake. But the blueberry lemonade was really good. We got there right at eleven and out was quiet 1130 hit and it ed a mad house. Definitely worth a stop", "author": "Avriel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-09", "description": "I never see lines at this place like I see at the Manhattan locations . . . but granted, I've never eaten at the Manhattan locations, so maybe they're different enough to warrant the wait? \n\nIn any case, the burgers are phenomenal. I always think of Shake Shack as \"that place with the tasty little burgers,\" I think because I have some sort of cognitive dissonance about how amazing these burgers really are. The pictures look appetizing, sure, but how good can a burger be? And then I go back there, and I have a bite of my Shack Burger, and it all comes rushing back to me -- these burgers are really, truly, seriously, honestly something special.\n\nRecently I tried the Shroom Burger on a whim, and it was also delicious. If this were the vegetarian option at any other burger shop, I'd probably prefer it over the regular burgers -- but the Shack Burger is still the hands-down winner. \n\n(One little confession, though. I actually kind of preferred their crinkle-cut fries over the new and improved hand-cut kind.)", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "Love shake shack. Just love it. You don't have to be waiting on an ass-long line in  this one in Brooklyn! But shake shack is always awesome everywhere.", "author": "Kyungjoo C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-17", "description": "Oh my, I should have my flame suit on for giving the mighty Shake Shack 3 stars.\n\nThis Brooklyn location was my first Shake Shack experience. There was nothing wrong with my experience--none at all. I love the overall vibe of the Shake Shack franchise along with their restaurants. They got a cool hip trendy swag from their website to what you see at their restaurants. So how bout the food..\n\nWe had a Single Shack Burger (cheeseburger basically), a Single Smoke Shack (same as Shack burger but with Niman Ranch bacon), Fries, Peanut Butter Shake, and a Soda. All of that for 2 people was about $25. Mind you we only ordered a single order of fries to share and a single soda and a single shake. THAT IS PRETTY PRICEY. As hip as the restaurant is, this wasn't a sit down type of joint. It was like a typical fast food place just a lot cooler. \n\nWithout thinking of how much we paid the food was indeed good. The bun has a somewhat sweeter taste and more on the soft side. Some people like their buns completely opposite of what I described, but I'm not as picky, I like either as long as it works and this definitely worked for me. Would love to have a bit more crisp on the inside of the bun if they would just toast it on the griddle a bit more (or any). The burger overall was good with good flavor cooked just right. The Smoke Shack with the bacon was just as good which should be due to the Niman Ranch bacon. As for the fries, they are standard affair being a good compliment to the meal. Just the right amount of crisp but not over cooked. Caters to those who like either crispy or softer-- it really was just right in between. It's not the best fries I've ever had but I've never had the best fries because fries is either good or bad for me. The peanut butter shake was good. It had the right peanut butter flavor and was nice and thick and creamy, but is not as memorable as I may have just described Now here is a kicker for the soda. There is no fountain machines, but they do give out free refills. But you have to ask for it and it seems like the process is to make people be discouraged to ask. They don't even ask for your existing cup--they just give you an entirely BRAND NEW CUP with the soda you want. Strange, but I guess that's their process. A joint like this should just have the fountain drink machines out for folks to get their own refills. This seems to be a Shake Shack thing--well it sucks to be honest. I drink a lot and will definitely get refills and I know it's annoying for the workers but I will annoy them thanks to Shake Shack's way with refills I guess. \n\nSo you would imagine based on that it should be a good overall score. It would be, if that meal wasn't $25+. I just don't see how that entire meal could cost $25. Why? Because we have IN AND OUT BURGER HERE IN CALI, and the burgers are just as good, fries just as good, and shakes just as good (with me not being biased and if I was I could go on to say--and some will--even better). But $25 at in and out will get you double/triple the food. Don't get me wrong, the food is good at Shake Shack, but it does seem a bit on the pricey side. \n\nWould I go here again or recommend it? Of course. It seems to be an East Coast staple. What you can't have you always seem to want more, so I would definitely recommend it to those visiting. They do have unique items and even have items for your dog. They have hot dogs, frozen custard, and serve WINE AND BEER! Perhaps this is why the rest of the menu is priced high to pay for the liquor license?????\n\nOh the staff at this location, were all great. Nothing bad to say about them. Everyone was nice and service was commendable. \n\nI can't give a perfect score when I feel In and Out gives the same type of quality for a lot less. The portion size is about the same too! It made me realize how I take our beloved In and Out Burger in CALI for granted and why many who don't have one in their home town flock to it. Perhaps they say, \"Wow, the burgers, fries, shakes are relatively as good as our signature place at home but its wayyy cheaper\".", "author": "Eugene N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Oh Shake Shack, I love your Brooklyn location! The lines are reasonable (5-10 minutes), there are plenty of tables to sit at and your food is always on point. I've both eaten in and taken food to go from this location and I've (almost) never been disappointed. My go-to burger is the Shack Stack: cheeseburger with Shack Sauce AND a cheese filled portabello mushroom!  Probably not the healthiest thing in the world, but certainly very delicious.\n\nMy only gripe is that I usually can't get the custard of the day into a shake. I always feel teased because the custard of the day sounds so great (red velvet cake, chocolate covered pretzel, etc), but they always say they \"can't\" make it into a shake for me. I wonder why? Anyway, if I get a plain flavor instead I'm always a little bit disappointed because it's not cheap and doesn't taste very special. \n\nI can't let that detract from the burgers, though... delicious! And no (unreasonable) line here? Can't be beat.", "author": "Calvin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "A great burger place with quality burgers, fries and shakes. What more do you want?\nThe sizes of all the portions are not huge which is a good thing. Go there.", "author": "Soe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-07", "description": "can't beat it, but i could sure skip the wait sometimes. Though, to be fair, the Brooklyn outpost is rarely overcrowded (maybe I just hit it at the right time???). It's worth it for the never-ending supply of arnold palmers!", "author": "Holly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-06", "description": "Today was my first time trying the Brooklyn Shake Shack. I've passed by it a few times, but I finally made an effort to try it out. I went around 12:30PM hoping it won't be so crowded on the line. When I got there, there was just so many people eating there and enjoying the time there.\n\nThe wait for the food took about 5-10 minutes, which isn't so bad.  I never tried the Shack Burger so that's what I ordered for lunch. It looked pretty interesting and appealing. I actually didn't like the burger too much. Next time, I'm definitely going back to the shroom' burger that I have always loved.\n\nI never really had their shakes or any other drink, so I decided to try out the Strawberry shake, It was soft and frothy, tasted very much like a strawberry Frappucino but lighter.\n\nOverall, the food was mediocre and it's just no match for the original Shake Shack in Flatiron. However, I will say I will give this Shake Shack another shot in the future.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "The burgers are amazing and the ambience adds up to the taste.. I really love the interior of the place and its location. They have amazing fries which are incomparable to any other place. We had the shroom burger and chic'n burger and a few concretes but chic'n burger is the star. I can't get enough of it.", "author": "Chaithra C."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}