{"aggregateRating": {"reviewCount": 825, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-07", "description": "I don't understand the public obsession with Shake Shack.  Time Out New York named them Best Burger in 2005 or something, and the hype hasn't stopped since.  Now there's five locations in Manhattan alone, and a presence in Washington, Miami, and even the Middle East.\n\nBeneath all the advertising, what do we have?  Hamburgers, hot dogs, and fries, essentially -- with a few token vegetarian selections thrown in as an afterthought, friendly and attentive service, and an electronic alert system that lets you know when your food is ready.\n\n$10.70 for a shake and a small burger?  Really, people?  OK, so this one's in expensive downtown Brooklyn, but I can get a decent burger at Five Guys at Metrotech -- not even my favorite place -- for $6 that won't leave me hungry.  This one -- admittedly delicious -- was gone in three or four bites, and I knew it wouldn't hold me until suppertime.  The shake tasted like regular whole milk with a few drops of chocolate syrup mixed in.  I did not sample the fries -- they are crinkle-cut, which means they use more oil than regular-cut, and therefore are even further away from healthy than fries should be.\n\nEveryone waiting in those long lines obviously will disagree with me, but if Brooklyn is any indicator, there won't be any need for me to join them anytime soon.  The rest of you, beware.  This place defines \"overrated\".", "author": "Jeffrey Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-04", "description": "Black and White shake perfection. Burgers are awesome, no new news there. Be sure to check the status of the line via the website on your phone if you don't have the hookup with the Danny Meyer group or MSP Conservancy.", "author": "Maria W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-21", "description": "The food is here phenomenal. So this is my second time here in 2 days. I love a burger that's handmade juice and well seasoned. The burgers here are 4oz but it's perfect. It's made medium unless you tell them other wise and it's on a potato roll. Everything was amazing. Everyone that knows me know that I love hot dogs. There hot dogs here are huge split down the middle and grilled. I love Kraut and onions. Today I Will try there cheese fries. It looks delicious. It's a bit on the pricey end. My hot dog with toppings and cheese fries was 8.33. I'm always trying to save a buck and Nathan's is down the street.  Nevertheless , quality or quantity any day in my book. Come early and beat the court house rush!!!", "author": "Diana R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "The atmosphere is very cool, very trendy.  I went with my daughter for a quick lunch while visiting from Florida.  My sister recommended it thinking my 15 yr old would enjoy it.  I guess she did-she ordered a second burger after eating her first.  I, on the other hand, was disappointed that the burger was paper thin and didn't even taste like meat.  I don't usually eat fast food, so maybe this is the norm for a fast food burger?  Although I have enjoyed a McDonald's burger in the past, so I don't think so. They also post the calories, and most other choices were so high in calories I couldn't order something knowing it had 800 calories!", "author": "Rebecca U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-30", "description": "Let's leave aside the politics of aggressive displacement. Someone wants to sanitize Fulton Mall into oblivion, but it's not Danny Meyer. He just wants to milk every buck out of his overrated product.\n\nI haven't been this disappointed by fast food hype since my first visit to Five Guys in the early days of franchising. I'll throw DM six more bucks and try his special shake before I finalize this review. But what I've eaten and seen so far was not encouraging at all.\n\nThe hamburger: limp, garnished with a semi-gross tomato slice, oversauced (badly), and thrown onto a bun with too much buttery goop. Overcooked, of course, but that's the way it has to be. This just isn't a good hamburger. It's not even a good fast food hamburger. \n\nThe french fries: the reason this isn't a 1 star review. But also the reason it's not a 3 star review. They taste like peanut oil and some sort of weird spice that I'm sure is a proprietary, and therefore \"gourmet,\" blend. If you're going to make french fries a little higher end, the crinkle cut is the worst template to start with. But they're fine. I ate about half of them and then had a few more. \n\nAgain, I'll try a shake. Maybe it's transcendant. But the concrete I saw didn't inspire hope. Someone call St. Louis and get Ted Drewes on the line. A freshly served concrete isn't supposed to look like soft serve left in the sun for a few innings.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-17", "description": "UPDATE: May 2014: They have seriously upgraded their French fries. When we first went a couple years back, they were serving very undistinguished crinkle-cut fries that I would have sworn were out of a freezer bag. Now they're absolutely fresh-cut skinny fries and are a thousand percent better. Bravo! (The mustard is still the yellow stuff, but now you can pump it out of a dispenser into a little paper cup, which at least is a big improvement over the packets.)\n------------------------------\n\nOriginal review:\n\nYES!  YES!  YES!  YES!!!!!  YES!!!!!!!!!\n\nThat was me when I first found out they were opening a Shake Shack in Brooklyn.  Ahhhhhh, YESSSSSSSSSSSSS!!!\n\nAt my request, we had my birthday lunch there the other day, and we were very satisfied indeed.  What can I say about the classic Shack Burger?  Only that it is THE gold standard for high-end fast-food burgers; it's even better than many diner and wait-service-restaurant burgers.  It's really just that good.  (I should mention that I get mine without cheese, which I dislike.)\n\nThe rest of our meal: a frank with sauerkraut, which was quite good (wish they had better mustard than little packets of the ho-hum yellow stuff); an order of fries, which is possibly the Shack's small weak spot, as they're good but not out of this world; two shakes, a caramel and a chocolate, both creamy dreamy wonderfulness; and my first Bird Dog, a juicy, crisp-and-tender, oh-so-yummy chicken and apple sausage that may be just as great a sausage as the Shack Burger is a burger.  These items, plus one more burger, a soda, and a bottle of water: about $31, which is of course a bit more than at your typical run-of-the-mill fast food chain, but oh so worth it.\n\nThe lines were long - around 1:30 on a Friday afternoon - but the wait was not ridiculous, and we lucked out snagging a table, which I can see could be a problem.  One caution, if you come by car, don't expect to find a parking space; we ended up in a nearby lot, which added $18 to the price of our meal, but we were in such a happy food coma, we didn't care.  (I dream of the Shack opening some restaurants in areas where they can have parking lots - please?  They could buy out some Burger King sites...)\n\nIf you haven't tried Shake Shack and you like burgers, you need to get going!", "author": "marie m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "I devoured a SmokeShack Cheeseburger that came with the applewood smoked bacon and chopped cherry peppers, alongside some cheese fries, it was a perfect combination that was worth every calorie. This is the only shack that I wouldn't mind coming back to, over and over again!", "author": "Francey O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-19", "description": "It's National Cheeseburger Day and what better way to celebrate it than having a oh so yummy burger from Shake Shack! I decided to give the Shack Stack a try for the first time (I usually go for the single shackburger, but its a holiday and I gotta celebrate big!) \n\nA shack stack is a cheeseburger and a shroom burger topped with lettuce, tomato and shack sauce. The shroom burger is a crisp-fried portobello mushroom filled with melted muenster and cheddar cheeses. The combo of that with the cheeseburger patty was amazing! The mushroom was fried perfectly and oozed with tons of cheese. I love cheese so I was definitely a fan! \n\nSome sport peppers on the side to spice it all up completed a very successful National Cheeseburger Day meal! This is my kind of holiday!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-22", "description": "Have to say...that SmokeShack burger was perfect! I got it as a double with extra cheese. Oh my. The word I'm looking for is,\"Tasty\". It tasted very, very good. The order taker was funny and helpful. Entire experience ( incl. the wait... It is a VERY busy place) was pleasant. Well done Shake Shack!", "author": "Steve F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "This is a good place a lots and it's exactly good for borgers and frys! Need to get it with cat chups and for full experience. Mushrooms are so good and I eat a lots of thems like every day for 2 days a weak. Reminds me of a Windy's but more five star style quizeen! Tank U Shake Shaq!", "author": "Dougys N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "Good burgher good fries... Need I say more?  The single paddy was sufficient  ; good place to fill my belly after company medicals.  Yummy....", "author": "Jim B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "i LOVE Shake Shack! As a California native, i must admit...its better than In N Out. I don't care what anyone says. The cheese fries, the burger, everything. Lets start with the cheese fries. Hot, flavorful cheese over crinkle cut fries? Heaven. The burgers are cooked to perfection, never under or overdone. Always delicious. A must try place if you're in NY or Vegas (i hear they have one now). Try the whole menu and you won't be disappointed.", "author": "Nicky E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "FINALLY got to come here!! I knew this place was famous, but never realized they catered to non-hamburger eaters. that is until today!\n\nso for my not so romantic valentine's day lunch, i popped into this busy joint with a friend, who a die-hard 'shroom burger fan. She made it sound so tasty that I decided to get just that. \n\nHaving NO idea what to expect, it came out as a crispy patty - but once you bite in, its like an explosion of big chunks of portobello mushroom and their special cheese. WHOA!!! was NOT expecting that, but it was a very pleasant surprise. \n\nThe burger, though, is on the small side - they should make the burger bigger!! \n\ni cant wait to come back here and try the chicken dog!", "author": "Asmita J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-11", "description": "Enjoyed my Shake Shack experience, but it's important to note I have lofty standards for my burgers. 3/5 is pretty darn good in my books. 4/5 is rare. 5/5 will probably never happen, but when it does, look out waistline. \n\nCool atmosphere at the one in Brooklyn. Very clean and professional employees. Burger was very fresh. Toasty bun, thick burger and the shack burger sauce was a zesty and sweet touch. Don't know what it was, but it was lip-smackin good. Burger was very tender and could tell it was freshly prepared.\n\nHands down though...best part of the meal was the PEANUT BUTTER MILKSHAKE. I have had some pretty darn good PB shakes in my past, but this one blew them all out of the water. Nothing else to say but...go try one! Now!\n\nI will definitely be back, but the price is a little much so I won't make it a routine thing.", "author": "Alex G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-19", "description": "We were very excited to try out and support this location.  Everyone was raving about.., I don't know what.  The burgers are small, the prices are high, and the fries were an oily mess.  I'm sorry but sitting on furniture that was recycled is great for the environment but not on my back, just uncomfortable.  I do have to say the shake was good, but small!!  I'm not going back!!", "author": "Dalila S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "They have THE best burgers!  Let's just say it would be any teen's ultimate hangout spot! Although it is family friendly.", "author": "Define_Me N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-13", "description": "It's Shake Shack.  The Shack Double is still one of my favorite chain burgers of all time especially when paired with an order of fries.  The location is a bit cramped as it sees heavy foot traffic throughout the day, but as I'm a student nearby, that's never been an issue for me.  If you've ever visited a Shake Shack, then you know what to expect.  The place is always kept in tip top shape, and the food will always leave you feeling greasy and satisfied.", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-14", "description": "I do a lot of Shake Shack.  I had jury duty for two weeks in Downtown Brooklyn, and came to the shack for a shack burger/cheese fry/fair shake combo 6 of the 9 days (one day fell on a holiday...otherwise it probably would've been 7 of the 10).  \n\nI've been to the UES Shake Shack countless times, UWS a couple times, Citi Field once, Madison Square Park a few times...I even somehow found one in Connecticut once.  \n\nThis Brooklyn one is a welcome addition to the Fulton Mall area.  Oddly enough, it's neighboring a Burger King, a Wendy's, a White Castle, and it's down the street from a McDonald's.  The burger market is strong here!\n\nPS: West coast people are crazy if they think In-N-Out Burger is even remotely comparable to Shake Shack.", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "Love shack stack! One of my favorite burger place in NYC. Highly recommended their cheese fries and milk shake. Nothing beats them!", "author": "Enci C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-16", "description": "Ohhhhh Shake Shack...I'm not afraid to say it....I love you so much.\n\nBurgers that are just so soft and delicious that when its finally over, you can see the visibly upset look upon my face.  Sometimes I even look around at other tables...envious that they still have a few bites of pure happiness.\n\nThis time I tried their new burger with bacon on it. Forgot the name. Its as good as it gets for fast food burgers.\n\nThe french fries are great. Crunchy with the right amount of salt.\n\nThe Fair Shake...I could drink a tub of that shit. That is all.", "author": "Tristan A."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Shake Shack", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O8d_hzRl7FVRXW4a2Toq8g/ls.jpg", "@type": "Restaurant", "telephone": "+17183077599"}