{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "I wasn't able to score a spot to the yelp elite event here a few months back, but the pictures looked so good I knew I had to make it out here.\nBoutros is definitely a special occasion kind of place both in price and atmosphere. The service is very attentive and the staff is very knowledgeable about the food and drink. \nWith regards to the food it was interesting, in a good way. The night started off with a Mezcal mixed drink. A bit oaky and citrusy, this hit the spot. The Zaatar house made roll was amazing but I would have appreciated one per person instead of just one to split. I could have had at least three just by myself.\nWe started off with the fois gras fritters and this was really the only miss of the night. The fritters were perfectly fried but liquid on the inside. I've never had fois gras in liquid form and it was just a weird texture for me. Another appetizer the squash baba ganoush was excellent. Perfectly spiced it was a great vegetarian treat.\nFor my main dish I ordered the pork chop and it was the best pork chop I have ever had! Grilled to perfection it was juicy and flavorful. The fingerling potatoes and grilled pears complemented it perfectly. \nThe hubby had the ravioli with Lardo. I liked his dish because I have a sweet spot for lardo or anything like it, but my pork chop was still my favorite of the two. \n\nFor dessert we had the halva chocolate bar. Good but a bit forgettable. \n\nOverall we had a really nice time. The ambiance was trendy in a laid back way and the lighting is perfect for a date or a get together with friends.", "author": "Monica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-13", "description": "Interesting decor. They like moss.\n\nLebneh appetizer was good. The bread was great, the lebneh was nice and tart, the seeds and veg they put on there added a nice texture. \n\nThe ginger cocktail is really good. The red citrus cocktail was middling. The caramelized pineapple cocktail, which I had high hopes for, tasted reminiscent (and somewhat resembled) dip spit. Y'all should really fix that.\n\nThe halloumi in the hash and the raclette on the nduja sandwich were hardly discernible, which is a shame because I love halloumi. I didn't really get the flavor or texture from it at all. The nduja sandwich was pretty decent. The avocado and fried chick pea toast was really good, but I feel like it's hard to mess up avocado toast.\n\nService was prompt and friendly.", "author": "Junus A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Ammmaaaaazing food great ambiance definitely worth a trip out to Brooklyn. The mistake mushrooms, the buratta, the angel pasta all vey delicious. Definitely coming back!!\nThe ricotta cheese dessert is to die for.", "author": "Haruka H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "Sat at the bar \u0026 was immediately greeted by the host and bartender in a friendly and inviting manner. They both recommended drinks and food, which was more than incredible and hit all of my taste buds.\n\nif you're ever on Atlantic ave looking for a great bite, stop by for sure!", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-08", "description": "Went here for dinner tonight. Food was presented beautifully but wasnt as flavorful as expected.  I had the scallops appetizer which wasnt very good and the angel hair pasta which was just okay. \n\nThe restaurant seemed pretty empty for a Friday night though the wait staff kept rushing our table as though we were holding it up (we weren't as there were lots of other empty tables).\n\nWill not be back.", "author": "Farrah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "It's fitting that Chef Allen Dabagh opened his first restaurant on this stretch of Atlantic. The Middle Eastern flavors from his heritage blended with New American cookery is a perfect representation of the amazing (if bougie) neighborhoods of Cobble Hill and Brooklyn Heights, bisected by a street that gives us Sahadi's, Damascus Bakery and more.\n\nThe space itself is beautiful. From the living wall behind the bar, to the chef's counter where you can watch the efficient expediting of everything you're about to eat, there isn't a bad seat in the house. \n\nThe menu is divided into appetizers, vegetables, pizzas, and mains. I've yet to try the pizza (although the crust looked superb as one walked by, and the za'atar sprinkled bread they bake fresh for each table speaks to the quality of that 760 degree oven), but every other section sports at least a few winners. \n\nAmong the starters, the fluke crudo had heat and balance, in addition to being easy on the eyes. The foie gras fritters are foie gras fritters (can't be bad), and although I would've liked a bit more of the soujouk (think Middle Eastern chorizo), the bulgur fried rice was tasty as well. That last dish seems out of place as a starter; it's a large portion and it doesn't feel like an appetizer. With more soujouk added and a fried egg on top (as opposed to scrambled and mixed in as it is) it would make it a perfect dish to start your day (I believe it's on the menu of their recently launched brunch, so there's that). In fact, since we ordered too much, I took it home and did just that, and it was phenomenal. \n\nThe mains are well-cooked, well-balanced, and tied together by incredible sauce work. The brown sauce with the beef is something I could just drink as my meal, and the caramel that comes with the pork chop ties the entire dish together. I appreciate the way the flavors are layered as well; the perfectly tender beef arrives with both charred stalks of broccoli, and also a broccoli puree. The effect is stunning, and it's my favorite dish thus far. \n\nSimilarly (and shockingly), the peas were the most memorable aspect of our most recent meal. With charred whole peas, pea pods, and a puree on the sides, it all came together with the green almonds added in a final flourish, and it made me so happy that it (1) tasted amazing and (2) shows that vegetables aren't an afterthought at all. \n\nAll in all, an excellent addition to the neighborhood, and I plan to keep coming back.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-21", "description": "The food is good but the brunch service is SO disappointing!!! My boyfriend and I came here on a Sunday at noon, and the place wasn't packed or anything so we were easily seated. It took about 5 minutes to get menus and water in our glasses.... annoying but fine. \n\nOur waitress finally came back and we ordered: for me, the shakshuka and iced coffee; for my boyfriend, the avocado toast with an egg and iced coffee. \n\nThe food came quickly - mine was great, his was missing the egg. The waitress turned around and quickly left without asking if we needed anything. She never came back to check on us and eventually we were able to wave down someone else to tell them the food was missing the poached egg. We also asked twice for salt without ever having it brought to the table. Finally, I got up and walked to the bar so that we could finally have salt for the avocado toast SANS egg (which desperately needed some flavor from either salt or pepper). \n\nWouldn't come back - too pricey for the poor quality of service and mediocre food. Go to colonie nearby, it's much better food and better service (worth the wait)", "author": "Lucie F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-09", "description": "Each table of 2 is offered 1 roll, which, despite its average size, is presumably intended to be shared. No butter or oil is offered alongside. Based on the unimpressive taste of the bread, I can only reason that offering a full roll to each customer would result in excessive waste.\n\nThe seared scallop appetizer was lightly seared, such to the point that it was rare and ice cold in the middle. The accompanying dashi broth provided no discernible flavor, nor did the lemongrass.\n\nThe duck confit pizza was unique insofar as the crust was naan-esque in terms of flavor and texture, and the sauce was akin to a mild curry. It was topped with sliced potatoes and a tender, shredded duck. It was exceptionally flavorful, and unlike anything I had tasted previously.\n\nI additionally sampled the 'pineapple punch' non-alcoholic beverage, which was overly-sweet, and was my second choice after being informed that the beer I initially ordered was out of stock.\n\nI would order the pizza to-go if I lived nearby, but I do not intend on returning otherwise.", "author": "Jo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Perfection. \n\nI recently moved to cobble hill after 8 years of manhattan restaurants and wasn't sure what to expect. \n\nBoutros is nothing short of perfection. I ordered the Labneh Crostini to start- extremely fresh and flavorful with a crunch from the cucumber and radish that creates a perfect summer bite. \n\nI then went on to the Bulgar Fried Rice- to keep it short- I have never had anything like this in my life. Absolutely delicious and a MUST try. \n\nI ended with the angel hair, morel, asparagus, and ricotta pasta dish. It is so light, flavorful, and again has a great crunch from the asparagus. A perfect dish to end a great summer evening. \n\nWe even had the opportunity to meet the chef, Alan- awesome guy. \n\nNeedless to say we can't wait to come back!", "author": "Abby C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "I've had the chance to visit Boutros (Arabic for \"Peter\") for brunch and dinner, and I can't rave enough about it! Up-and-coming local chef, Allen Dabagh, conjures New American cuisine that represents an interesting take on Syrian-Lebanese flavors. His restaurant, which is only a year old, is a fitting, revitalizing addition to the Little Syria neighborhood of Brooklyn, which like many ethnic neighborhoods, is threatened by gentrification. Boutros is a great spot for families, friends, and dates.\n\nThe Challah French Toast with Ricotta, Pistachio Butter, Fresh Fruit, and Orange Blossom Maple Syrup was delicious and evoked nostalgic Middle Eastern flavors in a very American dish. \n\nThe Duck (with Freekeh, Fava Bean, Sour Cherry, and Coffee) must be the softest and most tender duck I've ever tried! Cutting it was like slicing through butter, and its union with the cherry sauce is a match made in Heaven! It's the perfect homage to the Cherry Kababs (Kabab Bil Karaz) in Aleppo, Syria!\n\nThe delicious Mozzarella, Tomato, Chili Oil, and Basil Pizza comes with a welcome addition: Aleppo pepper!\n\nThe Bulgur Fried Rice with Soujouk (a dry, spicy sausage popularized by the Armenian diaspora in Syria and Lebanon), Egg, Snow Peas, Enoki Mushroom, and Sesame is another standout dish that combines Asian fusion with Middle Eastern flavors. It is rich and flavorful, but also gives you a nice cozy feeling.\n\nAlso check out the Labneh toast with cucumber, radishes, and za'atar for a light take on a popular Middle Eastern yogurt dish.\n\nIf you're lucky, try the Strawberry Knafeh (Ricotta, Pistachio, Cinnamon Ketaifi, Strawberry Sorbet \u0026 Consomme). It is a lighter, flavorful Ketaifi version of traditional knafeh- a popular Palestinian/Syrian/Lebanese/Jordanian dessert made with cheese pastry soaked in sweet, sugar-based syrup.\n\nAesthetically, the interiors of Boutros are beautiful and welcoming. The chef and his staff are very warm and friendly and are willing to explain dishes. \n\nThis is the perfect restaurant for any occasion: family, friends, graduations, birthdays, or that romantic date. 5/5", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "Fantastic food, creative dishes, wonderful presentation,  and the most talented owner/ chef.  I love this place so much I just booked my big birthday party there. Can't wait to share this treasure with all my family and friends.", "author": "Fern F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "One of my favorite restaurants in the area. The place is gorgeous, and the food is amazing! Im vegan, and there are so many incredible options. Allen is the best - and the drinks are delicious", "author": "Alexandra S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-18", "description": "NEVER again. I ordered through Seamless, and I ordered the $32 strip steak. Usually when you order a NY strip- it's the WHOLE strip. And by usually, I mean always. Mine was cut in half. And over-seasoned. And overcooked. I added a photo of the steak on my plate with a fork for comparison, and a photo of the steak next to the pork chop (also gross).", "author": "Heather G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Really unique dining experience in a warm and intimate space.  I ordered two sides as an entree - the maitake mushroom was delicious, sitting atop a sweet/salty sauce that really highlighted the flavors of the mushroom.  The butternut squash was cooked well, but I didn't love the seasoning - it was warm and toasty, probably just a personal preference.  Would highly recommend Boutros and I'll definitely be back!", "author": "Katie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-29", "description": "Whenever I'm in the neighborhood visiting family or friends we always make a point to go to Boutros! Hands down the food is amazing- and I'm that person that usually dislikes something that I order! Service is always impeccable and the wine list is a perfect compliment to the menu. Owner is always friendly and accommodating. I'm pretty shocked at some of the negative reviews since I've always had such a positive experience.", "author": "Janelle I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "I recently had a birthday brunch at Boutros and it was delicious, stress free, and a great time! The brunch options and cocktails were unique and fantastic. The staff was helpful and attentive. I highly recommend Boutros for both small and large parties for any meal. The food is consisitently delicious and there are options for those with dietary restrictions. Chef and owner, Allen Dabagh is helpful, welcoming, and an awesome food visionary. Try the bulgur fried rice, it's my favorite item on the menu. \n\nIf you haven't been to Boutros yet, what are you waiting for?!", "author": "Kiera W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "I liked the space but the food was amazing!  The pork chop was one of the best pieces of pork I've ever eaten.  The steak was very tasty and the appetizers were great.  The staff was friendly and attentive.\nJust go!  It's really good.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Food is top notch. \nWe had the angel hair, pork, beef dish, the bread and cheese appetizer, artichokes and mushrooms side (fancier names)\n\nEverything is great. Dishes are $15-32. Most in $22-30 range. \n\nFantastic service.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-17", "description": "How this place gets such stellar reviews is beyond me.  Possibly the worst scallops of my life - chewy, flavorless and swimming in water, they literally pour flavorless water over them for no reason at all.  The brittle in the chocolate semifredo was stale tasting and the semifredo itself had no flavor at all.  The octopus was delicious I'll give them that and the duck was good too. But ultimately $170 for a dinner for two better send me to the moon and back and this didnt even come close. Oh yeah and me and my husband both had stomach aches immediately after we ate there. Overall for the price and quality of food totally NOT WORTH IT.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-12", "description": "No. No. No. Wrong. For the price you can get better nearby. Don't be fooled because it's located in Brooklyn Heights/Cobble Hill, this place is all Manhattan. Impersonal service and average food. Overall the staff seemed like they had better things to do than take care of their tables and would often roll their eyes at each other as they passed by. Food was OK but go to better places nearby. See Petite Crevette, Rucola, La Vara, Battersby, Colonie, etc for real food and real service.", "author": "Timothy C."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Boutros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6n_cPY4fnsm3ukFQrToF4w/ls.jpg", "@type": "Restaurant", "telephone": "+17184030055"}