{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "Came before seeing a movie around the corner. The first thing that struck me was the cocktail list. I literally couldn't decide because they all looked fantastic. Ordered the 'Bitter Tree' and it was fantastic!\n\nMy wife and I opted to order an assortment of small plates, and each was delicious. We got the miso baba, the grilled octopus, the bulger fried rice, roasted cauliflower and 2 skewers (pork belly and chicken). Everything was wonderful, and it was the perfect amount of food for us.\n\nVery recommend!", "author": "Jake T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-05", "description": "Having spent the morning searching for a new apartment in Brooklyn Heights, we decided to dine at Boutros for brunch and explore the surrounding neighborhood.  \n\nThe restaurant is modern and well decorated, service is solid, and the vibe is incredibly laid-back.  I'm not sure if this is a Brooklyn-specific thing or whether I've become too comfortable with the idea that people are just rude and that's NYC for ya?!\n\nWe ordered the Shakshuka (with poaches eggs, parsley, and house baked pita) and the Halloumi and Spinach Frittata (served with mixed greens and multigrain toast).  For the price point, the portion sizes were generous.  I do regret ordering the Shakshuka for brunch though - way too much pita for one sitting (that's my bad).  It was delicious!  Maybe it's good for sharing?  And absolutely no complaints about that gigantic Frittata!  Yum!\n\nWe really enjoyed our meal and look forward to visiting this restaurant again!", "author": "Matt M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-14", "description": "Solid, clean Mediterranean food. I ordered duck breast, which comes with some sort of grain, sour cherries and fava. The skin and meat were perfect, really nothing bad to say about the dish at all!\n\nI also tried the pork belly skewer appetizer and beignets for dessert. Both were fine, but not standout. In particular I wish the beignets came with the sauce in a ramekin for easy dipping and were a bit more fluffy.\n\nI topped off the lot with one of their signature cocktails, the \"Thistle \u0026 Smoke\" made with Mezcal, Cynar, honey and citrus. It was well-balanced and would make a great summer evening cocktail. \n\nIn terms of ambiance I enjoyed the dark wood vibe with industrial touches. The chairs were comfortable. There's a large community table in the center back of the restaurant, so if it's busy you'll probably be knocking elbows with your neighbors. But it was quiet at 9 on a Thursday.\n\nFinally, fantastic service! I was well-taken care of and enjoyed my visit.", "author": "Evan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Some of the best food I've had in Brooklyn. A bold statement.... but I really can't get over the grilled octopus, the pork belly and the brussel sprouts. Pure heaven.\n\nThe pork belly was my favorite dish of the night. Just the right amount of crispiness on the outside, and tender and juicy on the inside. The glaze that formed over it with the hint of grill flavor completely blew me away. The octopus was amazing as well. Not too chewy and unbelievable flavors, plus the potato purée underneath was a really good touch. The brussel sprouts.... some of the best I've ever had, and that's saying a lot with brussel sprouts taking over every menu out there right now. The sauce/glaze was amazing, and the sliced almonds gave it a nice crunch. Also, make sure you get a mezze plate so you can try the pita... you won't be disappointed by either (I recommend the beet hummus)!\n\nThe dishes are pretty pricey for the portion size, but they are so spectacular it makes it a little better. The cocktails were really good. Not as strong as I prefer, but very solid flavor combinations. I loved the Thistle \u0026 Smoke.\n\nDefinitely a good spot for an intimate date night or catching up with a friend.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-13", "description": "Ah Boutros... Saturday night dinner with my mate. My first impression is the restaurant was warm and inviting- nice ambiance. But...\n\nThey sat us under a speaker and proceeded to blast 90's soft-core, gangsta rap, heavy on the bass, for the duration of our meal. I mean, come'on... none of you listened to 90's gangsta rap back in the actual 90's back when I would've appreciated a deep bass line. I'm old now, so all that bass was annoying to me all night long. But I guess it's fair... I annoyed plenty of people with the same music back in the 90's...\n\nAnywho... the annoying music aside, I had a really special chicken entree here. I mean it was absolutely delicious and memorable in every way. The rest of our food was tasty (including a sorta sweet pork dish), but not as memorable.\n\nAll-in-all, I'd say what I most remember about that night was the bass of the music, the amazing chicken dish, and paying way too much for other, less memorable, dishes.\n\nBut opinions vary. You might still wanna try this one if you're in the neighborhood.", "author": "Art C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Perfect for a date with my husband. Unpretentious place with beautiful interior and fab food! \n\nHusband and I ordered small plates - mez \u0026 appetizers and drinks-perfection! Staff was attentive but not overbearing. I love that the menu changes often (I'd be back either way though).", "author": "Felicia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "My review right now won't do justice. This place has amazing food. Like, beyond next level of contemporary heaven on a plate type of quality. I will say this....BEST octopus I've ever had. Period. And a nice portion size which is rare with octopus. The edemame humus also a nice touch. Since it was our anniversary(good date spot for sure), they have us a free puff pasty dessert. It was equally insane goodness. I will definitely update my review as I remember AND go back to try everything. One of the best places to eat in the area for sure. Well done.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "Atlantic ave has come a long way since the late 90s. Boutros fits in nicely with a Mediterranean/Middle Eastern/New American mix and a strong chef that pairs quality ingredients and excellent flavors with stylized presentation. \n\nThe design of the restaurant is gorgeous and inviting. Generous amount of single strung Edison bulbs hang from the ceiling and give off a gentle hue that feels intimate. I do wish the sound levels were better attenuated as it can get loud and a bit hard to hear without yelling slightly. I also would have preferred a more comfortable chair and a place to hang a coat (since the chair design doesn't allow it to be hung across the back effectively). Do yourself a favor and get creative with a custom off-menu drink. They have some housemade sodas that beg for a kick. We had a pineapple punch with rum and Ginger lemonade with vodka. \n\nBut don't let some of these minor flaws obfuscate the great cuisine. We started with some mezze of Lennard crostini which was just the right amount for 4 and had a wonderful texture and flavors. Following up as apps we went for the kale tabouleh salad, mozzarella pizza and bulgur fried rice. Skip the pizza but must get bulgur \u0026 kale (PRO TIP: Mix the rice \u0026 kale for a treat). \n\nI opted for the fish which was a perfectly cooked halibut on a light bed of bok choy in a light sauce (which also works with the bulgur fried rice). My wife ordered the steak that came out exactly medium rare with a nice char on the outside. \n\nWe didn't have room for dessert but felt that our whole meal was excellent. Service was solid, if a little inefficient (didn't take multiple refill drink orders when one of us ordered). Water was constantly filled and a well appointed bathroom make for a fine dining experience. We'll be coming back for sure. Also noticed they're on Seamless now too!", "author": "anthony r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "Literally the best place to eat on Atlantic ave \nThe service is always amazing. Get the chicken. Seriously it's the juiciest ever! The food is simple and doesn't try hard. Also the Brussels sprouts and the carrots!", "author": "Katie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "This review is for bunch only. Strangely, they opened thirty minutes after the opening time listed on Google or Yelp...it seemed like they weren't quite ready for customers (who were already gathering and waiting outside the door), which was a bit odd. When they did finally open the doors, we really enjoyed ourselves, though. \n\nFun music, gorgeous space, and delicious food. Absolute BEST thing we tried was the avocado toast. One of the best I've had. Avocado mixed with tahini and served with a runny egg and crisped chickpeas. We also liked the shakshuka. The halloumi scramble was less exciting but the potatoes served with it were outstanding - so crispy and awesome. Prices are steep but I will definitely be back to try dinner some time!!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "Really beautiful, cozy restaurant. Love the ambience of this place. The food is pretty delicious as well. We ordered a mozzarella and tomato pizza to share as a starter. It was very good and more than we could finish. For mains, I ordered the duck with freekeh, fava bean, sour cherry and coffee. Wow, this dish was really amazing! The duck was so tender and juicy and all of the elements of the dish worked really well together, despite the oddness of their combination. Portion wasn't huge, but it was enough for me. \n\nThe only quibble I have with this place is due to a slight misunderstanding. During our starter, we decided to eat only half the pizza and take back the rest to save room for the entrees. We were kept waiting quite a long time, until we finally had to ask the server where our entrees were. Turns out that he had been waiting for us to finish the pizza before bringing them out. My preference is usually to have the server check up on us at some point, but I suppose flagging him down would have been appropriate this time. It happens, I guess.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-25", "description": "I had had one of those days, that happens once in a decade: EVERYTHING went pear shaped, capped by a spectacular wipeout on a slippery sidewalk grate.\nI decided I deserved a drink. So stopped in a lovely little restaurant in my neighborhood. \nThe bartender was wonderful, the cocktail was lovely. I looked a wee bit bedraggled... not my normal, glammed up self: wasn't filming my show that night. The nice hostess was eying me a wee bit askance, but I kept texting with Courtney Love and perusing the menu.\nOrdered a drink, then decided to have something with \"nestle sauce\". Now, usually stinging plants are t my thing, but I figured \"well, must be safe\" and went ahead.\nTook a few bites while absentmindedly texting away.. then realized PAIN OUCH TONGUE OUCH NOOOO!\n\nNettles are not your friend. Unless they've been boiled for at least five minutes. Felt like razor blades. NOT FUN.\n\nThe owner came over, and took the accusatory stance that people who open restaurants but haven't brushed up on customer service, do. \"We served 40 people thisfish today, and nobody else complained! said Mr. Owner.\nWell, bully for those fifty folks. My mouth and throat hurt like fiddledeedee. \n\nAsked how they were cooked.\nHe mimed lowering nettles into boiling water (not great at customer service, but epic at mime), and taking them out again.\n\"The chef blanches them\", he said impatiently.\nAhhh! As someone with UK roots, I have cooked nettles. They MUST be boiled. For five minutes plus. I mentioned this. Unsurprisingly, I was again oooh poohed. I shut my silly female mouth, and they comped the nettles.\nNot my drinks, which, while not necessary, would have made me less grumpy.\n\nSo.. 28 bucks for two small cocktails,\nOne sore mouth and throat. 10 minutes being scolded.\n\nWhat a FAAABULOUS experience! \nNot.\n\nLots of other good (and much cheaper!!) restaurants in the neighborhood. \n\nUPDATE: The owner answered below, and demonstrates yet again his amazing flair for customer relations. Calling me a liar, saying I used \"Yelp\" as a threat, and using my politeness against me.. what a great way to handle this! How gracious and kind.\nThe customer is not only always wrong here- the customer is a liar.\nMaybe that explains all your other one and two star reviews? Perhaps only crazy liars eat here.\nNot to worry: the words \"not twice\", apply.\n\nWell played, you.", "author": "Peri L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Al is a genius chef !!! Actually an artist his attention to details is superb!!!! The food and the service is excellent and all my guests felt welcome and all enjoyed the exquisite experience!", "author": "Michael A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "I vowed to come back for this foi gras fritters and I did just that. It was amazing. I think my favorite dish is the mushroom dish, and the octopus. I can't get that sweet tahini out of my mind. I also had the duck again, and I tried the beef and broccoli dish that was amazing. The beef was very tender. The broccoli and sauce was spicy and sweet at the same time.  We were treated to a new dessert on the menu a halvah chocolate / ice cream dish, that was truly delicious. I am more of a light dessert kinda gal, (but I love halvah) but for those must have chocolate after dinner types, a great choice. \n\nThe service was impeccable. Nobody rushed us. We sat and sipped hibiscus tea afterwards and a great time was had.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-23", "description": "I've been dying to come to Boutros for a while now being that my daughter lives right around the corner. We decided to stop by for dinner on November 16, and when we entered and requested a table for two, we were asked if we had a reservation. We didn't. The hostess got us a table anyway and then things proceeded to go south. \n\nThe hostess brought us two menus. I'm used to ordering a bottle of wine with dinner so I found it odd that there wasn't a wine list. My daughter thought they didn't have one so I asked and sure enough they had a wine list. We also noticed that a couple seated at the table next to us were given two menus AND a wine list. \n\nThe hostess? Very standoffish. Barely smiled and didn't make us feel welcome at all. And to make us feel even more unwelcome, another hostess came to our table and asked us if we had a reservation even after we were seated.  That basically ruined our dinner. What a terrible experience at what I thought was a decent place. Don't even ask if we would eat there again.\nNO THANKS.", "author": "Marilyn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Having recently attended an amazing Yelp Elite event at the restaurant,  I booked a brunch for me and a friend this past weekend.  \n\nMy friend enjoyed her Shakshuka, and I thoroughly enjoyed my avocado toast with poached egg.  The egg is not really necessary though (an upsell item at $3 extra), as the dish with its fried garbanzo and stewed fava beans, provide plenty of protein.  Unless you really love beautifully poached eggs.  The dishes are nothing fancy, just very tasty, filling, and comforting.  The coffee was delish as well.  \n\nService was pleasant as well - one of the standout elements of this place.  Definitely merits a return visit in the near future.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "One thing I'll never complain about is the explosion of new trendy and upscale restaurants opening up in the neighborhood. I'd been following Boutros' Instagram for a while (since before they opened) and finally made my way there for dinner.\n\nThe space is as gorgeous as advertised. It wasn't a restaurant before, which is even more impressive. The bartender told us it was actually an ice cream shop decades ago, and they kept the floor tiling. There are cool lightbulbs hanging from strings, and tons of awesome cooking/cocktail books lining the shelves. There's also a big mossy thing on the wall behind the bar and in the bathroom.\n\nAnyway, the entrees range from $18 to $31, but I recommend doing a bunch of starters to share and a pizza if you're just 2-3 people.\n\nWe did the foie gras fritters, grilled octopus, smoked halloumi, and the clam pizza.\n\nYou'd think deep frying foie gras wouldn't work, but it does. I especially loved the strawberry sauce that it was set on top of.\n\nThe octopus was cooked perfectly - tender and not at all rubbery. Could've gone for a little more char though. The red pepper chutney was a great complement.\n\nThe grilled halloumi was basically a sizable arugula salad with watermelon. The halloumi was hidden underneath and the whole dish was a nice contrast of flavors.\n\nThe clam pizza was pretty damn good as well. The crust was airy, and the clams were plentiful. It's not quite a New Haven crust, but it's probably one of the better clam pizzas in the area (which is no small feat since there are a TON of pizzerias nearby).\n\nTheir beer selection was respectable, and they have a hell of a wine list. Service was great, and I'm looking forward to coming back for brunch!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-24", "description": "A fine brunch. Nothing was as revelatory as had been advertised, but a fine place for brunch.", "author": "Quaker W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-06", "description": "I wanted to like this place so much as it's in my neighborhood and love this type of food. The ambiance is warm and the staff is friendly (although slightly clueless).\n\nThe food:\nFried baby artichokes - these lacked salt and general flavor.\n\nAngel hair pasta - very light, fresh and perfect for summer but unfortunately served luke-warm.\n\nDuck  - a great dish in concept and flavor, with 2 beautiful pieces of duck, but unfortunately the duck was also served stone cold.\n\nThe service:\nThe baby artichokes came first together with the bread to share. Both were lacking flavor and not necessarily the opening of the meal that we were looking for. \n\nService was a bit rushed even though 70% of the restaurant was still empty. Before we could finish the starter, the two mains came. The rush was totally unnecessary but I guess the kitchen was eager to get food out (but why expedite cold food?). Service was clumsy in terms of timing and not sure what to do with all the plates on our table. \n\nWhen I mentioned that the duck was cold to the waiter he asked me \"if he wanted me to take care of it\"? Yup. For a $30 entree, I think I can expect it to be piping hot. With little apologies or explanation he took the duck back - a quarter of the cold duck still on my plate. Five minutes later the remaining 3/4 duck came back on the same plate but now hotter. Since the actual plate wasn't hot, I suspect some microwave action. Heck, even if it was the oven, that is not what I'm expecting of a restaurant at this price level. Just refire the dish....\n\n$147 total meal for two (1 starter, 2 mains, 2 glasses of wine each) and a disappointing experience.", "author": "Neil W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Jordan the bartender is reason to come here alone! The drinks are very good however they're pretty expensive... But the ambience is really really cool. I love the living wall that you can just stare at for hours while just having a drink. I came here on a Thursday evening and was very well attended to, and very well taken care of, even though I was only ordering drinks and didn't get anything to eat. The people next to me ordered flatbread pizza, and it looked so good! I wish I would've ordered dinner. When I come back to Brooklyn Heights, I will for sure order something off of their food menu. This place is quiet enough to have a conversation, but lively enough that you don't get bored. It would be good for any kind of mixed drinks, cocktails, beer, or wine.", "author": "April C."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Boutros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6n_cPY4fnsm3ukFQrToF4w/ls.jpg", "@type": "Restaurant", "telephone": "+17184030055"}