{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "If I lived near this place, I would end up sending my paycheck here. Great space and vibe. Phenomenal customer service. Excellent cocktails. Great menu--the Bulgur Fried Rice is  ridiculously delicious! Even when it was crazy busy, the overall atmosphere was still relaxed, and that is due to the great service. Bottom line: this is a destination spot for those of us from out of town, and your \"go to\" neighborhood place for those that live close by. No matter where you live: GO.", "author": "Carlos D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "This has been the best dining experience I have had anywhere in a long long time. They even make it look easy, and it's refreshing to see a new spot flourish like this in BK. \n\nFrom start to finish, service was at its best- friendly, timely and they just were being excellent at their jobs. Food was unbeleiveabley good. The nice complimenary bread starts you off to a good start, and then all the dishes thereafter 5stars. Probably the best pork chop I have had in all time. Hats off guys. \n\nWe also sat at the Chef's table which was an amazing experience- the team in their works so well and dont stress its amazing to see. Spotless as well. Cudos Butros!", "author": "Tony M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "Ok BACKSTORY. . . so my friend Isabella somehow found out about an app called Seated (originally called VOCO LIFE) which pays you $15 in Amazon or Itunes to make reservations through their app. We skeptically made a reservation at Pair Wine and Cheese which has since closed LOL. Anyways, we get to Pair Wine and Cheese and they did not have our reservation on file and the chef had left! \n\nThrown to the street, we didn't know what to do. Walking around Brooklyn Heights with a hungry belly is not fun, let me tell you. Suddenly, across Atlantic Avenue we see \"Boutros\", beautiful soft lighting shining out, visible greenery etc. We run across the street only to find what looks like a bar and a closed dining room after all it was 9:30 pm on a Wednesday. We ask the bartender if the kitchen is open still and he says \"Sure!\" and seats us at the table closest to the bar so we feel included. \n\nWe order cocktails and I am ECSTATIC when I see Isabella's drink has a perfect spherical ice cube. Spheres have the lowest volume to surface ratio which means the ice melts much slower than a cube, which has more surface (sides) than a sphere of the same volume. \n\nand then. . .the food. OMG I don't even know what to say except it was divine. We had a salad of rocket and peas DRENCHED with the most fragrant olive oil, sooooo good I wanted to lick the plate. The salad was served with hummus and hold up- green almonds. What's a green almond? Green almonds have the briefest whisper of a season in the spring before their shells harden and start looking (and tasting!) more like the almonds we know and love. They are tart and crisp and subversively addictive around cocktail hour. If you see them, promise me that you'll give this uber-seasonal delicacy a try. Then I had octopus which was nothing short of stunning. I can't remember what Isabella got for her entree but I'm sure it was as good as mine. I can't wait to go back here.", "author": "Ryan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Our meal here was exceptional. There was no fail. We had the leben crostini, bulgar fried rice, smoked haloumi with arugula, spring peas, angel hair pasta, and the duck. All the dishes were perfectly executed. The flavors are multidimensional and complimentary. This was a truly superb dining experience and we will be back for more. AND the beignets OMG delicious!!", "author": "MrandMrsAfterTast E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "Worst place for brunch. Waited 20mins for the server to come and take our order and then 40minutes for the food. Did tell them that I cant eat raw eggs and they should be well done and of course they bring the runniest poached eggs ever. They weren't even that busy...never coming back again.", "author": "Besa A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "Plastic piece in entree-no comp. \n\nWe live very close and always want to try new places in the neighborhood. We finally had our chance (after a year). There were only two other tables occupied but we still sat a while before being greeted. The server (Justin) was lovely and kind and recommended some apps and meals and we chose the duck. \n\nApps were fine and the duck was good but the sauce was a little strong and when my husband took a final bite he got \"a shell\"...which was odd since there was so shellfish in the description. Turned out it was a plastic \"40\". Justin apologizes and took the duck off the bill but the owner neglected to come out. We requests his presence and he came out...was kind... but admitted that the last 40th celebration was \"a month and a half ago\" and offered us dessert (which we couldn't do) and his card for us to come back in the future and he'd \"take care of us\". \n \nThe meal should have been comped. The owner should never have sent the server out to handle the mess. And the food was not on par with equally priced establishments in the area. Go somewhere else in a two block radius and you'll be happy you did.", "author": "mama d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "We visited Boutros a couple of weeks ago and I am still dreaming of their agnolotti! We rarely had a dinner so well served, every dishes completely thought through, tasteful, innovative and light (by light I mean not greasy or too garlic flavored...). The atmosphere is cool but not excessive, service very friendly and food perfectly timed. I had a tartare with Aleppo pepper and it was amazing, I could have eaten a whole pound of it! Followed by this incredible Agnolotti with cauliflowers and a special lemon cream... ! I will definitely will go back, alone, with my boyfriend or with friends and family... totally recommended!", "author": "Giulia D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-28", "description": "This food is highly mediocre and flavorless. We had brunch here and I had to return my salad because the dressing has such an overwhelming lemon flavor it was hurting my mouth. The haloumi frittata has barely any haloumi and zero flavoring. We waited almost an hour for our food and another 20 minutes for the check. Very disappointed food.", "author": "Lucia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "Booked up last minute and nicely surprised. Decor is modern and nicely done. Service was totally on point. Not rushed but we were never waiting - I love that sweet point ! \n\nFritters were great appetizer as was the steak tar tar. Duck was perfectly cooked although sauce was a bit strong for our tastes. Steak was perfectly cooked but again the sauce was bit over powering. No big deal. Certainly didn't spoil anything. \n\nOverall if you are looking for good meal and service at reasonable price then I'd say go check boutros out. Nice spot.", "author": "Stu K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "So far so good. Great service,  decor, music, and you gotta try these two drinks: the Almond and the Ancho Chile. We will try the pizza one day soon. Come visit all you crazy #tourists!", "author": "James O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "High end cocktails fabulously made. Great service. Tried the pistachio flavored cocktail, very cool. Awesome vibe inside, cozy place. Went in the middle of the week, servers were great.", "author": "L. J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "I love when it's easy to give a place five stars - and this is one of those places. \n\nHad a superb experience here last night. It's such a delight to walk into a neighborhood restaurant and be treated... like a neighbor! The service was wonderful from the moment we arrived. \n\nEverything we ordered was excellent. The flavor combinations are beautiful - a lot going on in every plate, but incredibly balanced (which is hard to pull off). My favorites were the spring peas with hummus and black garlic, and the foie gras fritters, which we had to start. Even the rolls are special! They're baked with za'atar (how can you go wrong being next door to Sahadi's?) and are served fresh from the oven. The desserts are killer too. Absolutely recommend the beignets!\n\nThe setting is lovely, the food is as close to perfect as you can get, and the people are friendly and attentive. So glad to have this place nearby!", "author": "Hannah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "This restaurant is a hidden gem. The food is amazing, and we had the chance to talk with the chef/owner (Super kind man) who came to check on us and he told us about how he does everything from scratch. There is so much work put into every dish I enjoyed even more my meal knowing all of these details and really felt like he put all his love into it. Definitively a must try.", "author": "Stan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Mashes up Middle Eastern spices with local flavors and ingredients - truly a unique experience. Chef Dabagh visited our table and shared recipes and stories. Exceptional evening in every way. Looking forward to returning.", "author": "J B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Let me say upfront, interpersonally I love the chef-owner and I find the rest of the staff to be friendly and attentive.\nThe food is Nuevo-American but with subtle Middle Eastern spices.\nBrunch is imaginative as well.\nThe restaurant has become the go-to last minute restaurant.\nConstructive suggestion: they need more specials to increase variety on the menu.", "author": "Lawrence M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "Had brunch at Boutros this past Saturday. My boyfriend and I both ordered the Halloumi and Spinach Scramble, which was excellent. The brunch menu is relatively inexpensive compared to other local brunch places. The ambiance is really lovely.", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "I went to Boutros with a party of 4, no reservation during the holiday week between Xmas and New Year on a Tuesday evening around 7:30pm.\n\nThe food was good, but as others have noted the portions are very small. The menu is split between 'small plates' and 'large plates'. My husband ordered the Ricotta Agnoletti (basically ravioli) which was a large plate for almost $20 and it was not a lot of food at all. I ordered the Lasagnetta which is like tagliatelli with a carrot ragu and mushrooms. It was also a large plate, and while it wasn't as small as my husband's entree, I was definitely still hungry after eating. For dessert we split the beignets which were great, but again very small.\n\nMy larger issue was with the service. While our waiter was friendly, he did not seem very experienced and his explanations of the food (when asked questions) were somewhat unclear. For example, I asked 'how thin the pizza crust was' and he struggled to describe it and ended up saying something like 'it's thin if you press it flat.'\n\nThe restaurant was half empty, however for some reason the other waitperson (a woman) kept passing behind my chair which was positioned somewhat closely to the corner chair of the community table even though I think she could have taken a different route and avoided the narrow passthrough. She knocked into a tote bag I had hanging on my chair three times, each time actually moving my chair when she hit it. The third time she knocked in to my chair she actually knocked my bag on the floor. She didn't really apologize but instead looked backwards and looked slightly annoyed. My questions were 1) if it was in her way, why didn't she ask me to move my bag 2) or why didn't she adjust the chair of the community table (which was completely empty) if the opening was too narrow 3) why didn't she go a different way 4) why didn't she apologize :-)\n\nAll that said, we probably won't be back. The interior of the restaurant is nice, and hopefully they will get a better rhythm going with their service as time goes on. The food is good, it's just very expensive for what you get, especially considering the service.", "author": "Jen Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "I went with Hannah H., who beat me to the review, so I won't repeat everything she said, but I do concur on all fronts. It's a very attractive, comfortable space. The food is excellent; well thought out and executed dishes, super fresh ingredients. And everyone who works there clearly wants you to enjoy yourself, which we did. Will be going back to check out more of the menu very soon.", "author": "Jack C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-09", "description": "This place is OK, but needs some polishing. Each of the dishes were tasty in their own right, but the overall menu lacked continuity. The mushrooms had a delicious Chinese sauce, and the burrata with grape jelly was like a decadant breakfast treat. Maybe you can see how these don't quite feel right on the same table? Our bass entree was tasty but the sliver of fish was lost in a massive glob of celery root (I think?) puree. Overall, we felt the pricing was about 15-20% too high - $14 for a plate of sautéed mushrooms.", "author": "Jordan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "Extremely delicious food you don't feel bad about eating. A healthy meal without the sacrifice of taste! I've been to Boutros twice with my husband and parents since it's opening and both times the food was outstanding. It is consistent and I have tried almost everything on the menu! The must order apps are definitely the bulgar fried rice and octopus, which are cooked to perfection. My favorite main is the lasagnette! But my husband loves the beef and broccoli! When I say you can't go wrong at Boutros, I mean it!\n\nThe manager is also extremely attentive and professional. We loved our experience and will be return patrons.", "author": "Riki K."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Boutros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6n_cPY4fnsm3ukFQrToF4w/ls.jpg", "@type": "Restaurant", "telephone": "+17184030055"}