{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "Great service, great atmosphere....\nHowever.. the \"chicken\" dish I had was confusing. I couldn't quite put my finger what the chef was going for. 27 bucks for a tasteless chicken breast?  I'll come back and order something different.", "author": "Kaleb M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Had a delicious meal at Boutros tonight. The ambiance is cozy and warm.  Every dish was delicious - the eggplant, duck confit pizza, agnolotti, bulgur fried rice, octopus, fried artichokes, labneh crostini, basically everything on the menu!  Attentive service too.  Will definitely go back soon.", "author": "Lauri B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "Perfect spot for Atlantic Avenue.  Blends Brooklyn-y vibe with Middle Eastern roots, and the fusion works crazy well.  It's so good - I think everything we've tried across the three times we've been there we've loved.  We've probably had more memorable bites here than at any other place in the hood.  It's on the list.", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "This restaurant has been on our radar ever since it opened a few months back. Finally having the time stop in for dinner we were instantly blown away at how stunning the dining room is. Aesthetically, Boutros oozes charm and character. As soon as you walk in your eyes go right to the bar, which is tucked under Edison lights, surrounded by living greens, and finished off with a modern moda. Simply put, this place was designed beautifully.\n\nBoutros is a Mediterranean oriented restaurant with a New American twist. \n\nThe menu at Boutros consists of easily shareable small plates, pizzas, and large dishes. It was in the starter section that the kitchen really put together some wonderful dishes. We were amazed by the bulgar fried rice accompanied by beef soujouk, egg, enoki mushroom and snow peas that created complexity of wonderful flavor that made me wonder what kind of magic went into this simple-looking dish. Grilled Octopus, potato puree, chutney, and Chive was also remarkable. Every bite was delicious with a lot of different ingredients working together in harmony. In my opinion, the best item we tried all night was something we didn't even order, it was the Maitake Mushroom. The chef/owner stopped by our table to ask about our dining experience, but also to have us try this delicious hen of the woods complements of him. The refreshing sensation from the dish and the textural effect from the combination of different ingredients was quite memorable. We were practically scraping the plate trying to get the very last drops of the sweet tahini drizzle. We also opted to try the clam pizza as a starter. Another great dish to share. The clams and lemon sat well together on pizza dough that was just the right amount of crust and crunch. For a main dish, we split the lone pasta dish at Boutros: the angel hair with asparagus, pistachio, and ricotta salata. Erika was surprised with presentation of the dish, but the overall balance of flavor was still there.  We skipped dessert as we were both very full and satisfied from all the outstanding food I mentioned above. However, our waiter did bring us over two lemon meringue macaroons which hit the spot.    \n\nOverall, we were pleased with the overall direction of the kitchen that emphasizes the freshness of locally sourced Middle Eastern ingredients found right here on Atlantic Avenue. I can definitely see this restaurant becoming quite popular among local Brooklynites. We will for sure be back.", "author": "Mark D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "We really enjoyed our meal.  They were out of their world famous octopus -- so we had the grilled haloumi and water melon salad on wilted greens,  hen we has a delicious side of \"peas\" -- English greek sugar snap and snow peas in a delicious sauce.  They brought us a warm roll. But it was not accompanied by butter,spread or olive oil.  The bass had crispy scales on it..ion a bed of greens and a curry sauce.  It was tasty but the fish was no cooked well enough.  The pork chop with grilled peaches was awesome!  \n\nWe skipped why wines -- kind of pricey - lowest was $12 for a Rioja?  But we had a fresh glass of lemonade which complimented the food beautiful. Our sweet waiter was kind -- and offered to turn on the AC to combat the heat of summer.  The owner is a warm host and his son runs the kitchen. We will be back for the octopus.", "author": "MIranda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "The food and service here was terrific. We shared a number of plates and had great cocktails. \n\nGreat ambiance and bar as well!  Definitely check it out.", "author": "Mussie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Such an amazing addition to the neighborhood.  Everything from the ambiance/decor, to the service, and most notably the food exceeded my expectations.  I haven't written a review here on Yelp for almost a decade but you guys need to RUN NOT WALK to Boutros.\n\nI shared the duck confit pizza as an appetizer -- it was DELICIOUS and particularly exciting because it was my first pizza in my life due to my cheese allergy.  Sea bass entree was made perfect by the celery root sauce.  We capped it off with the beignets and merengue macarons.  The decision isn't so much whether I'll be back, but rather whether I will order the same things since I loved it so much or venture out to some of the other interesting items on the menu.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-27", "description": "Creative bistro cuisine where small plates and vegetables are the stars. Attention to flavor, texture and quality ingredients permeate virtually every dish. Grilled octopus with pureed potatoes is wonderful. As is the roasted and honey sweetened brussels sprouts.  Bulgur fried rice with Armenian sausage is rich and satisfying. Only the quinoa 'ceviche' was a bit of a miss for us -- a bit too tart, as it was left swimming in a pool of 'tiger's milk' - aka lime juice,\nService was warm and on point. Place itself is inviting and attractive. Great for a date of just a nice dinner after work. Frankly, this place reminds me of Colony up the street, but with better atmosphere. \nMusic was a bit too blaring for my taste, but hey, I'm not in my 20's anymore (or 30's for that matter).", "author": "Barry P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "Really enjoyed brunch today -- delicious Halloumi and Spinach Scramble and Challah French Toast. Will definitely be back!", "author": "Janice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Could not ask for more from this AWESOME neighborhood addition. Been here twice for dinner in the past two weeks - the service and food were completely on point both times. Wait staff is friendly, energetic, engaging and not at all pretentious and the food is fantastic... I've tried most of the menu at this point and every single dish has exceeded my expectations. The ingredients are fresh, everything is cooked to perfection and the variety of spices and flavors the chef uses in each dish pleasantly surprise the palette.  \n\nThe menu descriptions don't do the food justice; everything is REALLY good, but the Angel Hair pasta and the Maitake mushroom are among my faves. The knafeh dessert is also delicious (am usually more of a chocolate person, but the flavors in the knafe were perfection). \n\nCan't wait to try brunch!! :)", "author": "Mia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Amazing food, the Kale tabouli and burglar fried rice were delicious.  Great atmosphere, staff was very accommodating. I will definitely be back soon !", "author": "Cynthia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "We live very close and have eaten here regularly since they FINALLY opened a few weeks ago ... it seemed like we would have to wait forever!\n\nFirst, the staff is absolutely lovely. Kwan runs the front of the house and he is warm, professional, and invested in every detail that might make your dining experience more enjoyable. Plus, he's put together a wine list, cocktail, and beer menu that is excellent without being overwhelming or stuffy. The two bartenders will serve you efficiently and with a flourish - plus they'll speak to you in any number of languages. The wait staff is attentive and quick with a smile and they'll take care just about anything you need. Chef Alan and Pastry Chef Pietro are also engaging and love to come out for a chat and to check in on the food.\n\nNow the food - it's very good and and it's a perfect reflection of this particular block - the heart of modern Little Syria. You'll start with a freshly-baked olive oil roll seasoned with za'atar - if you don't know what that is, come try it. For small plates, the squash with lebneh and pepitos is unique and delicious and you will want to order three more bowls of the bulger \"fried rice\". The quinoa with leche de tigre is also a fabulous party in your mouth. For large plates, that agnolotti with smoked trout and caviar will surprise you with flavor, the seabass is crispy and well-seasoned and balanced with a celery root sauce that is, again, unique and delicious. For dessert, you have to try the uncooked cheese cake. It's a cloud of cheese cake mousse with a thin, hard meringue flavored with cardamom, and a smooth, yummy Concord grape sorbet. It's a dish that says, \"Welcome to Atlantic between Court and Henry!\" \n\nJust eat here. You won't regret it!", "author": "Nick R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-15", "description": "This was my second visit to Boutros. I brought my Lebanese family this time for brunch. Unfortunately it was a major letdown. We arrived early when there was almost no one in the restaurant at 11am and it took more than 2 hours to get out of there. While I've found the food generally very good, the service was astoundingly bad or just vacant. They forgot our initial appetizers and took over half an hour to bring those. An hour and a half into our meal, our main dishes hadn't arrived and the service staff showed no indication of that till we complained more than  once. In the time we waited the restaurant filled up and many tables that came long after us were served. Food was good but not amazing. My shakshouka was only ok. $4 extra to add soujouk sausage to it and then only found a few tiny bits. No one was very impressed.", "author": "Lenora S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "My husband and I ate here last night for an early pre-movie dinner.  I could not believe how few people apparently know about this gem.  (Granted, it was 6pm.)  People- please.  YOU MUST EAT HERE.  The food is excellent.  The cocktails are to die for and the atmosphere is lovely.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "I've been waiting for this place to open for a while since I live nearby. Stopped in last night for dinner and it was fantastic! Service was friendly and thorough. I had a Sazerac which was delicious and my husband (a beer nerd) had a nice craft beer from Michigan (name escapes me). They had a great variety of wines and craft beers that were all reasonably priced. My husband and I shared the duck confit pizza, the bulgur fried rice, the lasagnette and the Brussels sprouts. All the dishes were excellent, the pizza and lasagnette were the standouts. For dessert we had a deconstructed cheesecake with grape sorbet that was unreal. Probably one of the most interesting and delicious desserts I've had in a while. Overall, great experience, we'll certainly be back.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "I've come for brunch three times and have been waiting a bit to post a review, because the atmosphere is lovely, it's always easy to get a table, and the service is very nice. And yet, Boutros is never fully satisfying: the food is good, but portions are tiny and most dishes are seriously overpriced. I have tried the shakshuka, the fattoush, the bulgur fried rice, and my husband likes the halloumi scramble. All of these dishes, except for the scramble, will leave you slightly hungry. All the times I dined there I did not find them very \"balanced\" -- one ingredient prevails and all the other ingredients will be more hinted at. In other words, they're always stingy with some ingredients, whether mushrooms with the fried bulgur (hardly there), bread with the fattoush (three crumbles), and eggs with the shakshuka, which should be mostly eggs but when I got it it was mostly tomato. I would especially warn you from getting the fattoush. With an egg added it was $18. When the dish came to the table I was baffled. I had expected a substantial salad, and what I received was a small arugula salad with a few pickles served on an *appetizer* plate. The halloumi scramble is the only dish that will leave you more than satiated. It's also the closest to a traditional American brunch dish and so may seem less exciting, but at least you won't feel like you're being robbed.", "author": "Branfa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Boutrous has totally found their rhythm. Went back to this restaurant as a guest of a friend and I was totally wowed. Not only have the figured out appropriate portion sizes, but the food, service and cocktails are splendid. Check out this new dig in the bk heights area.", "author": "Neetu M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Excellent food and excellent atmosphere.  The head chef really blends in multiple food cultures to make a very unique taste.  We had a large party and everything was top of the line", "author": "Chris G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "Had a fantastic meal at Boutros. Food was creative and delicious. Service was excellent. Will definitely be returning.", "author": "Mary H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-02", "description": "Good food and vibe! I was there last week! Service was excellent! I think they are going to be a neighborhood staple! Glad to see diverse food on Atlantic Ave!", "author": "Greta P."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Boutros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6n_cPY4fnsm3ukFQrToF4w/ls.jpg", "@type": "Restaurant", "telephone": "+17184030055"}