{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Thrillingly good ! That is what we told chef/owner Allan Dabagh after our first meal last night.\nWhy did we wait so long to come, we asked ourselves.\nThe food is superb, new American with some interesting accents showing the chefs Lebanese \u0026 Syrian roots.\nLast nights appetizer special was SO good, it was titled Spring Peas, Hummus, Black Garlic\n\u0026 Green Almonds. Dani, our very pleasant server, recommended the combination of the Spring Pea salad and the roasted lamb chops with beets and zaatar.  The hummus in the Spring Pea \u0026 Snap Pea salad was made with peas, it was unique and outstandingly fresh \u0026 delicious.\nEverything was on a very high level from the cocktails to the dessert. We will be making many return visits. Chef Allan's commitment to his first restaurant is thorough. He designed the space himself and was working on construction on a daily basis. The room has a really nice feeling that has to be experienced. Also a communal table as well as a handsome bar with a beautiful moss and wood that Allan created himself, lit beautifully and fronted with the wonderful ambers of whisky bottles. \nThis deserves to be a neighbourhood staple and a destination restaurant for many years to come.", "author": "Kate P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "I love this place! It's right near my apartment and I've been twice already. The food is delicious and the decor is so unique and warm. The people who work in Boutros are professional and so friendly - we got to meet the owner/chef - this guy is 28 years old and is behind ever detail of making this place great. Really impressive and I can't wait to go back. Try it!", "author": "Betsy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Amazing food and drinks!! The service is excellent and I truly enjoy coming to this restaurant each and every time. If I could rate it 10 stars I would !!", "author": "Susan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "Great atmosphere, food and drinks. This place is just what the area needed. The kind of place you can go multiple times a week after work, enjoy a drink and a great meal and then repeat.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Absolutely amazing - food was beyond perfect \u0026 the place is gorgeous! Attended for a baby shower Saturday - meal was perfection", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "Fantastic food and service.  I couldn't stop ordering ginger gimlets, and the lasagnette and smoked trout were absolutely perfect.  I'll definitely be coming back again.", "author": "Noriel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Food was delicious, but service was even better. Quan was our host and he was absolutely incredible, accommodating and just really friendly. It's nice to go to a restaurant that has it all. I was pleased with the service and the food. Definitely going back!", "author": "Lissette C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Everything was outstanding. Creative and delicious. All of the vegetable sides are amazing. The house made zatar bread was hot and fluffy. The pork belly entree was full of flavor. And the \"unbaked\" cheesecake was a delight. A great addition to the neighborhood. Highly recommend.", "author": "Patricia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Absolutely fantastic food, ambiance and service! They kindly accepted to make the Ricotta Agnolotti vegetarian- plus the menu is overall vegetarian friendly. The strawberry Knafah is really good. Highly recommend!!", "author": "Ma L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Wonderful meal with excellent service. Just opened but already packed and bustling. Try the octopus, the sea bass, and the junglebird-- all amazing! My friend had the lasagnette and loved it. I'm gluten free so I really appreciated the crustless cheesecake, which was light and delicious.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Five star all the way.... from the decor to the desserts this was truely a stand alone meal. Pork Belly and Steak entrees we're cooked to perfection and the Kale Taboule might be the most refreshing thing on earth. And to end the perfect meal the best cheesecake I've ever had in my life.", "author": "Jose R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "This is an unusually interesting and very good restaurant that seems not to have been discovered yet. We've eaten the pasta, duck and bass there. All had flavors we have never tasted. The desserts were also excellent.", "author": "judith f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Absolutely amazing food. A real neighborhood gem.  Every dish we had was inventive and hit the mark perfectly. Would absolutely recommend to any and all. The maitake mushroom was a real surprise and delight, but you really can't go wrong at this place.", "author": "Adam K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "Cool place but the brunch menu needs some work.  The place was empty at 12:30 on a nice day, so my wife and I probably aren't the only ones thinking that way.  The menu itself is unintelligible;  people have no clue what they're ordering and that lack of convenience (having to ask for clarifications) isn't likely to be well received.  Prices are a bit off too:  $21 for a bacon burger is just inappropriate.  Cocktails should include basics for people who don't want to have to make an elaborated choice on a Sunday morning after (maybe?) a tough night in town.  Just a few thoughts.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Delicious,friendly, enthusiastic. Ambiance needs a little tuning. Will definitely be back", "author": "Dave S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-28", "description": "The space is very nice. Love the \"look\" of the place but our waiter made the evening not enjoyable. He kept saying they were closing at it was only 11:00 on a Friday night. He made us feel like we needed to get our check and pay now. We were only drinking; so he knew we weren't going to be very long but continued to ask us if we were done. We live very close and from this experience will simply choose to go elsewhere.", "author": "Tori M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "I don't know how there were reservations available so last minute, but there were! We started with some drinks. Strawberry Basil soda was great, spicy stirred drink and ginger drink were also delicious. We shared the tomato basil pizza to start bc the foie grass was sold out. It was delicious. I had the beef and it was fantastic, perfectly cooked. My husband and friend had the pork chop which was also fantastic. Our other friend had the angel hair which was great, portion was on the smallish side,so if you have a big appetite, maybe order as a side. Service was great, I think our waitresses name was Demi? She was attentive, friendly and very helpful with the menu.", "author": "Megan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Absolutely everything is amazing! I could eat plate after plate of the Kale tabouleh and fried bulgar. Mozzarella, tomato \u0026 basil pizza with red chili oil was phenomenal.", "author": "Randi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "This restaurant is superb. The drinks were original and perfectly balanced. The service was impeccable. We ordered the burglar fried rice as a starter and the flavors were complex and delicious. We ordered the pork chop as an entree and it was tender and cooked perfectly. The overall experience was supreme. Do not pass up this gem.", "author": "Melinda T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-04", "description": "this place is meant for people who don't understand lebanese food. good luck spending 200 dollars on fried rice. terrible food. service and atmosphere were good.", "author": "Eva G."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Boutros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6n_cPY4fnsm3ukFQrToF4w/ls.jpg", "@type": "Restaurant", "telephone": "+17184030055"}