{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "The food was delicious and so flavorful! We tried the duck confit pizza, and the clams pizza! Both were thin crust heavenly bites perfect for sharing! Also really loved the food gras fritters and the Bass! The atmosphere is relaxed and the space is gorgeous! Maritime meets hidden NYC garden with plenty of room between tables. The service was outstanding! Our server, Nate was very knowledgeable and friendly! He answered all of our questions with ease, and accommodated our (sad to say) many allergies! His command of the food knowledge assured us that we were in the right hands. Kwan, the manager extraordinaire was so welcoming and really just the perfect host. We traveled from Queens upon hearing word of this new hot spot, and boy were we glad we did! Boutros and team,.. SEE YOU SOON! Bravo!", "author": "A A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Boutros has it all. Great ambiance, wonderful staff who provides unbelievable service and the chef serves up fantastic food. The food and drink menus are on point!  I would highly recommend this Brooklyn gem!", "author": "Peter G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Decadent food, a tasteful wine selection, and a charming atmosphere is what Boutros is all about. From the tiled floor to the moss covered bar wall this place is everything but basic.  I have been twice in the last three weeks with my wife and we can't stop talking about the food we devoured, yes devoured.  The Kale Tabuleh and Bulgar Fried Rice apps are two dishes that shouldn't be passed up.  The Tabuleh has a lemony dressing with hints of mint. The Fried Rice is cooked with Middle Eastern Pork Sausage that adds the perfect amount of sweet and salty. These two dishes alone will make you want to come back for more.  The house made Ricotta Agnolotti is light and filling, with a delicate smoky flavor.  The Beef and Broccoli however is the star of the show.  I don't know what type of sauce this sits in, but I could drink it with a straw.  After all is said and done, make sure you leave room for dessert because the Unbaked Cheesecake will have you thinking you've died and gone to heaven.  It's unbelievably light and unlike any other cheese cake I have had, paired with house made Concord Grape sorbet you can't go wrong.  And don't forget to wash this all down with a glass or two of Broadside.  Try it out you won't regret it.", "author": "Alex D."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Boutros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6n_cPY4fnsm3ukFQrToF4w/ls.jpg", "@type": "Restaurant", "telephone": "+17184030055"}