{"aggregateRating": {"reviewCount": 42, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "The best tacos in NYC. The best chile relleno in NYC. The best carnitas in NYC. Seriously. Check this place out.", "author": "Will M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "This place is the best Mexican in the neighborhood and the best Mexican I've had in Brooklyn frankly.  The carnitas is amazing and there hand-maid tortillas are amazing.  Fish tacos are a must try.  Order here now and order here often.", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Probably the best Mexican restaurant in Fort Greene/Clinton Hill Area. Their tacos and tortas are amazing you can taste each ingredient within just one bite. Their fresh juices are also amazing, my favorite is the orange juice! Totally would recommend to check this place out!", "author": "Luz M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "I've only gone here twice, but it has been an amazing experience. Great (large) burritos and they were super, super nice.\n\nI asked for lime in my water and they gave me a whole half of a lime and a smile.\n\nBest,\nGreg", "author": "Gregory B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "best chile relleno burrito in town\ni get mine with no rice extra beans\nit's massive but not super heavy\nchile relleno and cheese are super flavorful \ndelivery is reliable and friendly\ni order at least once a week from them\nmouth is watering just thinking about that burrito", "author": "Atisha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "this place is AMAZING!! their food is authentic, inexpensive, and soooo good. i came late with my boyfriend and ordered a shrimp taco and he got a chile rellanos taco and omggg. definitely order the homemade tortilla, its a little extra but worth it! (i didnt know it was extra and said nevermind but they gave me one anyone and theyre super sweet and nice and really care about their customers. couldnt recommend more!", "author": "Alayna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "The best Mexican food in NJ and NY. Very nice people with authuntic and delisious foods. I had too much foods and now I am regreted why I didnt take more food for home.", "author": "Pejman S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Wow.  Ok I admit I only had 1 thing 1 time. But this is perfection.  Chile relleno torta.  Standard deli bread with a very tasty egg battered poblano, soaked in red mild salsa, dressed with shredded lettuce, tomato, crema \u0026 pickled jalapeno.  \n\nIt's a proper battle between you, sandwich \u0026 the paper it's wrapped in.  One in which you will surely come out the winner.  \n\n$7 and will keep you fueled.   Pure taste and, though a little hard to maintain, is well worth the struggle.  Do not eat on the go or in a car.  Have plenty of napkins.  No additional hot sauce needed. \n\nA very necessary mexican injection that is hiding under the BQE.  A gentrified version of this would surely be about $15 and would likely be at smorgasburg with a 30 minute line.  Please support this place.  \n\n5/5", "author": "Lipton L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "This place is a hidden gem!  I live very close by and find myself ordering from here roughly 2-3 times a month.  The tacos are always on point, and the burritos are MASSIVE.  The service is amazing as well.  It's family owned, and everyone is very sweet!  A few times they even threw in some free plantains with my order.  The hours tend to fluctuate slightly from day to day, just an FYI.  But overall, I would highly recommend this place.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "I had chips, guacamole and a camarones  burrito-- delivered in under 30 minutes (thumbs up); it was very filling. \n\nI would describe the food as surfer burrito esq.", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "What can I say, its a hidden gem. No really, it is almost hidden, which is a shame because the food is bomb and the owners are super nice. My first time coming in here I needed a specific ingredient for something I was making then realized they served food too. What I noticed most though was for the 10 minutes I was there the phone was ringing off the hook with delivery orders, all spoken in Spanish. Once I heard that I knew this was going to be legit. As a Los Angeles native I will say not only is everything good quality (like white meat chicken without a bunch of grisel) but the prices are super reasonable and the owner brought me a cup of pudding once when they were out of the flan I wanted. No charge. I just love that kind of customer service, and I think this place will be around for a long time. \n\nDo note that this is more of a pick up or delivery type of place. There are very few tables inside.", "author": "Audrey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "I'm so glad this place is right down the street. Their menu is extensive (tacos, burritos, flautas, huaraches, quesadillas, pozole, tamales, and a variety of other platters), affordable, and it looks like everything coming out of the kitchen is quality stuff. The staff is also super friendly and welcoming, and they offer free delivery.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Don't let the facade of this place scare you. Just had lunch at this little, authentic hole in the wall and it was a quick and delish meal. \n\nI had one carnitas and one steak taco. Both came dressed with onion, cilantro and guac with a side of lemon and radishes. Loved the salsas, too. The red one tasted like paprika and the tomatillo was tasty. Neither were too spicy. Yum and yum.", "author": "T. B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "One of the freshest, most honest tacos I've had in a while.  You can tell they put a lot if love into the food.  Ambiance is deli with tables, but the food more than compensates.", "author": "Jonathan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "You honestly cannot imagine how incredibly delicious and fresh my lunch was! Pleasantly surprised at this great hole in the wall TREASURE! Don't let the store front spook you. I mean-  GOOOOOOOOD!", "author": "Ruben N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "authentic mexican food.\n\ncooks are great.\nmanagement are great.\ndelivery is great.", "author": "DooDoo B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-06", "description": "I lived around the corner from this place for 18 months before I tried it. I was apprehensive as one could be, but after talking to some other people in the neighborhood I had to try it. Now, after going here a few times, I haven't had anything I didn't love. This place is super awesome! No frills needed, just good-ass food.", "author": "Luv2 L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-27", "description": "Definitely an authentic place and I would go again. I got the vegetarian burrito, which was tasty, doesn't necessarily stand out in my mind. FYI their burrito is more of a sit-down-with-knife-and-fork burrito as opposed to a one-handed-eat-and-walk burrito. Their red salsa was pretty good, though not too spicy with almost a smoky chipotle flavor to it. Oh, and they sell Jumex. So good.", "author": "Tim P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-05", "description": "I must admit, I'm a bit embarrassed to say that I've lived a block away from this place for 7 months and never noticed it until today! I saw the Mexican flag flying on my way home tonight, and knew I had to check it out. My instincts were good - this place is awesome! It really is everything I've always dreamed of (I'll admit my dreams may be a bit strange). It combines an awesome little Mexican grocery store - well stocked with Mexican cheeses, produce, hot sauce, and other fine products - and an awesome little Mexican restaurant in the back. It reminds me of some of my favorite spots in California. The owners are from Puebla and are super-nice. And the food is delicious! I had a carnitas burrito, with extra rice and beans, chips, and fresh guacamole. Absolutely fantastic! I highly recommend this place, and I hope it flourishes!", "author": "jeremy f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "I work at the Brooklyn Navy Yard and is hard to find decent food around. I read the review on the place and decide to try it. Have to admin I wasn't disappointed at all.\n\nFirst of all it's not the kind of food you'll get at tacobell or chipotle, this is the real deal. All ingredients are fresh and the size of the portion are decent-huge. I had a carnitas burrito with guac, pico de gallo, beans, rice and veggies and it was only 7 bucks.\n\nDont let the look of the entrance scare you, definitely worth the try and you wont be disappointed at all.", "author": "Enrique P."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "GMC Temaxcal Deli \u0026 Grocery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "163 Park Ave", "postalCode": "11205", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DneldCUfyBEmoKjaS8y02Q/ls.jpg", "@type": "Restaurant", "telephone": "+17183078100"}