{"aggregateRating": {"reviewCount": 42, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "I have lost track of how often I've ordered delivery from here on the days I work from home. Literally everything on the menu is amazing. The orders are always correct, warm, and quickly delivered. \n\nI've passed by but have never actually eaten inside. It's kind of a hole in the wall and seems a bit small, but charming! \n\nThe tacos, the breakfast dishes, the horchata (!!!), EVERYTHING IS AWESOME.", "author": "Kiersten J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "We landed at GMC Temaxcal Deli after dinner plans fell through at a nearby joint, and I am really glad we stumbled across it. When looking here on Yelp we have scrolled past this place a few times, mostly because we thought it was just a bodega that had a little food in it. Inside, you see that this is a legit, albeit small, Mexican Food restaurant that happens to sell a few groceries.\n\nPrices are super low, nearly everything is made fresh in house, including tortillas. It's clean, tasty, and locally owned. What's not to love?\n\nWe got a baby-sized Carne Asada burrito (comes with guac and all the fixings included), some Mole chicken enchiladas, a tamale, chips and guac (both homemade), and 3 Jarritos. Total came out to just $40 and we left stuffed with a doggy bag.\n\nThis place is nestled on Park under the BQE so you may not notice it unless you live/work in the area, but it's close to the Navy Yard, and worth a trip if looking for something tasty in the area.\n\nI am trying not to use the word \"authentic\" when describing cuisine, but as somebody who grew up in Southern California and had access to Mexican food which is close to what you would actually find in Mexico, Temaxcal Deli seems about right. Check it out.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "Mmm. It is surprisingly hard to find a good taco in NYC. But here, under the BQE overpass is a little shop with some tasty food. \n\nI tried the chicken and spicy pork tacos both on handmade tortillas. They came with cilantro, onion and guacamole on top and a few pickled cucumber and mild peppers on the side. There was also a green salsa. \n\nThe meat was fresh and cooked well. The seasonings were great. \n\nThere is also a good bike shop near by so if you need a tune up and a taco this is your spot!", "author": "Erik F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-09", "description": "So while this neighborhood store transformed itself  from a simple store-bodega to a bright cafeteria style eatery. It is clear the transformation has caused prices to go up. While i dont have a problem with paying, quality has to be under control, right along with taste and consistency. \nMy torta had a thin, sliced like piece of chicken. Let me just say i forgot i was having a milanesa de pollo. The usual suspects were there, avocado, beans, pickled carrots was un expected but they were good. Sadly it left me unsatisfied and hungry.  My buddy had the al pastor torta, not sure how it was.  This is not how I remember this place, it used to so much better years ago.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-21", "description": "Yum yum yum!! Super authentic, cheap, delicious Mexican food!  I had the taco flight and shrimp fajitas.  The taco flight was by far the best, though the fajitas were delicious.  My go-to Mexican delivery place!", "author": "Jen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Wow. I love this place. I ordered lunch here last week and I will be ordering again. Best chili relleno I've had on the East coast. What a great find for me, it's unfortunate my office is moving out of dumbo soon, because I won't be able to eat here regularly for much longer.\n\nEverything about this was so good. I got mine with a salad and tortillas as sides and it was a great choice because I didn't know if i wanted tacos or the plate. I ended up having both options.\n\nI just wish it was a tiny bit spicier. But I'm always looking for that with food, so I wouldn't say it took away from the quality. I loved it just the way it was.\n\nIs you are in Brooklyn heights area, check this place out. You won't be disappointed.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "This place is always good and their delivery guys are also super nice. Thank you !!", "author": "Wade V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "Traveled out of our way to have some delicious carne asada tacos, carnita chorizo tacos, steak quesadilla, and mole poblano enchiladas with chicken with the owner's special spicy sauce. The son and father are very friendly/honest people. Has fresh ingredients and tasty food. Definitely coming back even though it was a bit far.", "author": "Christeen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-09", "description": "Very authentic, and very low-key. I've always dined in since I work a 2 minute walk away and I've come here for lunch a couple times. Everything's made to order, and is ready relatively fast. I would say that the prices are a little steep. Paid $12 for a small plate of shrimp fajitas - I was a little disappointed by the portion. But the taste was great. They have some habañero pepper sauce at the tables.", "author": "Myles C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "I love carnitas more than a girl should.  GMC makes them beautifully and brings them to you fast.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "Hands down best tacos in the neighborhood. Owners are friendly. Nothing bad to say about this place!!", "author": "Heather L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "I order delivery for several people at the office and food was great!!\nI highly recommend the cemitas! (really tasty), we also order tortas, huaraches and tamales and got hibiscus and pineapple on the house.\nAMAZING!!\nwill definitely order again from here!", "author": "Ana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Excellent little spot! I had the mole poblano plate and loved it. Prices are good too :)", "author": "L O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Delicious and unique sandwiches. Such nice people. Just a great little place with a ton of heart!", "author": "Ilona W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "Best Mexican delivery place in the hood. The quesadillas on homemade tortilla's are amazing!", "author": "Brian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "If I could give this restaurant 10 stars I would. I originally was going to Jay street for Mexican food and I happened to walk in this establishment. Everyone was so friendly and family oriented I didn't want to leave. I explained that I'm vegan and the guy there gave me great advice on what to get. I had a rice bowl with lettuce, tomatoes, cucmbers, black beans, Pico de gallo, avocado and radishes. This meal was SLAMMING. This meal was so good I want to be their spokesperson. I want to wash their dishes for free. The hot sauce green and red were a perfect mix of spice. I can't stop eating it and I will most definitely come back here again. Well I did stop eating it because unfortunately I just took the last bite. Great service, great people. The lovely lady up front is so amazing. You guys rock!", "author": "Nina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Great place . Humble lady. Opens early sunday morning. Witch is great bc my kids have sunday skool. Around the corner. Decided to bring my husband in . I was worried bc hes a picky eater. But turns out he loved it.  Even orderd to go. I was also surprized with my choice of food. I orderd huevos rancheros . I got a big plate. Im very pleased. Deff coming back to try the rest of the menu.", "author": "Raquel R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-11", "description": "Editing my review - I had originally given 1 Star as The food took roughly 3 hours to arrive (I live a 15 min walk away)\n\nThe food was actually really good. 4.5 or 5 stars on the food - Similar to another Mexican deli I used to live very close to. \n\nThe delivery was the issue - I called asked, etc they said a few minutes. I'll probably give them another shot because of the quality of the food. \nPrevious delivery text is below\n\nDelivery  literally  never came  and charged me. Do not order food from here!\n\nI ordered  over two hours ago and I am still waiting, they do not answer  my calls as well.", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Wow real authentic mexican food located on park ave. If I can give it a 10 star I would. Real Mexican food made fresh when order. Castro's can't beat GMC homemade food 100% delicious and mouth watering making you want more. Price are reasonable and taste is out of this world. Will definitely continue on eating here.", "author": "Annn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Best tacos. They are very delicious! They service is really on task and early. I totally recommend to order from them.", "author": "Klethy Q."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "GMC Temaxcal Deli \u0026 Grocery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "163 Park Ave", "postalCode": "11205", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DneldCUfyBEmoKjaS8y02Q/ls.jpg", "@type": "Restaurant", "telephone": "+17183078100"}