{"aggregateRating": {"reviewCount": 148, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-07", "description": "It's great that they serve organic wings. You can taste the difference as they are not roided up like most places. These wings are superior. Their traditional buffalo sauces, from mild to super hot, are buttery and with the perfect amounts of heat. Their dry-rub lemon pepper wings are a personal favorite. \n\nThey offered a super bowl special: prepay, no line, designated pickup time. When we arrived, the place was full of angry customers who were waiting an hour or longer for their orders. Most of the staff stayed in the back avoiding the crowd and the music was blasting so no one could hear what was going on. And with the super bowl kickoff approaching, they didn't even change the tv channel to the pregame. It was chaos. Luckily we got our wings after an hour but others had to ask for refunds. Needlessly stressful and unpleasant.", "author": "Janet G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-19", "description": "The chicken ain't really bad it's just you can tell the chicken isn't always completely sauced. It looks and tastes like they prepared the chicken and just sprayed whatever flavor on top. It didn't blend in at all. I personally prefer the chicken that has the flavor all over and tastes juicy. You know the one where the flavor is cooked on the chicken no squeezed. The fact that it looks like someone took a bottle and squeezed sauce on it doesn't please me and when I take a bite not ever bite has a sauce so I have to dip it in to make sure the chicken has the flavor. Your better off going to Buffalo Wild Wings they're similar in price anyways.", "author": "Mohamed M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-08", "description": "Everything but the wings were good but the wings themselves slightly below average. honey BBQ sauce seemed watered down to make it stretch. Their homemaker blue cheese was great (no longer regret the extra dollar it cost) and made the wings a whole lot better. Fries were pretty good. Not stingy with the portions.", "author": "Christina L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-01", "description": "Whaat. Some places you leave happy, because it was money well spent on good food by good people. \n\nHere, staff was mad salty (\"That's the tax. This is America, we pay taxes.\" Nah girl, that's not sales tax I'm asking about, it's your shady unadvertised \"split fee\"). \n\nWe left feeling nickel-and-dimed getting charged for requesting half one flavor, half another. That's standard at wings places, cmon?! To borrow the staff's words... a hidden fee for wings... man, that's pretty un-American.\n\nNail in the coffin: After I got home, saw they got my basic order wrong. Waack. \n\nWingstop, I'm coming back to you.", "author": "R L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-04", "description": "The fries were very crispy .. delicious actually! I also ordered the BBQ wings, they were literally DRENCHED in BBQ sauce. It was everywhere! No matter how hard I tried, it still ended up all over my hands and parts of my face unexpectedly. \n\nI was actually walking around Brooklyn shortly after and I thought that I removed all evidence of eating the wings --- I got on the subway and looked at the window reflection of BBQ sauce still on my face! Only me! Hey, they were good though! \n\nI wish a moist wipe came with their pre-made packet of plastic silverware, ketchup and a napkin. More napkins please! POR FAVOR! You can't have that much sauce on your wings and expect someone to only use a single napkin included in the pre-made sandwich baggy. \n\nThis place literally has about two tables, so there is no where to sit. Luckily the weather was nice and I was able to sit in that public area with picnic tables next to Shake Shack. \n\nFor the price, not bad food. Try it take out only though.", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-07", "description": "First time to this place. First they got the whole order wrong. I ordered a rice bowl, asked for boneless wings. They gave me classic wings with no sauce at all. The wings were dry as well, couldnt even eat them thats how overcooked they were and there was no sauce and i asked for 2 sauces. And the rice, omg the rice were soo undercooked and tasteless. \nThis was the worse lunch i ever had. I couldnt eat anything at all. Had couple wings and one fourth of the rice and throwed away the rest.\nNot to mention the staff was rude and kept pushing to make it faster. I wish i would have checked my order before taking it. And they also charged me $1 extra. \n\nAvoid this place at all cost. Even if you are craving wings find another place.", "author": "Pam K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-14", "description": "I don't ever leave reviews, but absolutely felt it was necessary this time. This was my first time trying this place and even after reading the reviews, decided to give them a try.. The wings are RIDICULOUSLY small \u0026 for the money \u0026 extremely long wait should be WAY BETTER. They also nickel and dime you for everything. $1.08 for dipping sauce? Not sure what they expect you to eat the wings with. Save your time \u0026 money. Go elsewhere. Much tastier \u0026 healthier options nearby. First and last time eating here.", "author": "H C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-22", "description": "The wings here are not good. I've had them once and that was more than enough.\n\nHowever, I am a fan of their french fries and have made numerous trips to just get fries. And I've always had good customer service.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-09", "description": "Over priced wings starting at $9.00 WITHOUT french fries from which I asked for in the first place. The sauce was overflowing in the bag and spilled when given to me. I was so disgusted that I just threw it in the garbage. I would not recommend this place if you are looking for a good meal. You have a better chance going around the corner to Burger King.", "author": "Arthur J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-20", "description": "If I could give them 0 stars I would - soggiest and shittiest boneless chicken in the entire Barclays Center!!!!!!!! Couldn't even get their crappy sauce on the side instead of on top of my \"chicken\", I'd rather eat a half cooked guinea pig and put my $11 toward chicken at Buffalo Wild Wings", "author": "Sebastian G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-10", "description": "PFFFFT....where should I begin?? The food was DECENT at best. Edible but nothing to brag about. \n\nMy work partner is currently in the bathroom and I'll unfortunately have to follow. That being said, the place actually has a nice variety of hot sauces. \n\nChicken tenders were over cooked. Fries were okay. A little expensive for \"bodega-grade\" chicken. \n\nThe customer service was awful. Extremely unwelcoming and a bit unsightly.\n\nI received a nickel with gum stuck to it in my change.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-04", "description": "If you are lucky enough to ever get the delivery, chances are the order will be completely wrong, cold, and soggy.  I'd eat rat droppings out of the subway before I ever order from here again.  THE BEST part is the rude, inept witch that answers the phone, and lies to you, and/or slams down the phone when you ask if the food left yet.  This place is either a front for something else (i.e. El Pollo Loco) or is a tax write off for the owners.", "author": "Robert F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-01", "description": "I frequently visited the Buffalo Boss location on Fulton and minus a few mishaps here and there, things were fine. Now that the Fulton location is closed, I now frequent the one on Jay and Willoughby. \n\nMy favorite thing to order from there are the boneless BBQ wings. I usually find these to be delicious and filling, however, the last four times I have visited or ordered from Buffalo Boss, my chicken has been cold, tough, and/or taste stale. I am not sure if it is a result of over-cooking the chicken or other factors but this has happened one too many times to be overlooked. \n\nWhen I order food, it usually takes a really long time to come and when it does arrive, I end up having to reheat the wings in the microwave because they are COLD.\n\nI hope that they get it together soon.", "author": "R C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "This place is good for take out only. I do not recommend buffalo boss as a place to sit down and eat.  Now to the food, the Honey BBQ wings and the honey mustard wings are pretty good.", "author": "Jelani R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-01", "description": "Ok, so my mistake - I came here a second time thinking that the lousy experience the first time might have just because they were busy. Nope. Here again waiting 15 minutes for chicken tenders and fries and there are only two other customers in the store !! Maybe they take 15 minutes because (again) they had to make sure they were completely dry and chewy before they serve them. \n\nOh and good luck getting a cup of tap water to help wash them down. \"We don't do that here - you'll have to go to Chipolte if you want that\". That's customer service.", "author": "J T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-18", "description": "Gave them two tries both times the wing quality was terrible, they weren't crispy at all even though I asked for extra crispy. The second time I attempted it with a free order with Uber eats and it ended up the same, I also asked for the sauce hot and it tasted nothing like Buffalo sauce.", "author": "Xavier C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-14", "description": "If I could give less than 1 star I would.  I live less than 1 block from the restaurant and ordered wings via seamless.  I got the confirmation email that stated delivery would be 30-45 min.  An hour and a half later, I still hadn't received my food.  I called the restaurant and they told me the delivery guy \"got lost\".  How you get lost going less than 1 block is beyond me, but I can safely say I will not be ordering from here again.  If you are in the area and want wings, walk the extra couple blocks to Buffalo Wild Wings (yeah, not the best wings ever, but compared to this place its a 5 star restaurant).\n\nEdit: Ok, food finally arrived after 2hrs and 15 minutes.... and its COLD!  The wings, the fries, everything is cold... except for the soda, which is warm... \nI could not be more dissatisfied with the service and the food from this place.", "author": "Coby B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "Horrible customer service the lady rushed me to pick up my order and was more concerned about leaving them making business. Back home we never would do that the more money the better! 08/7/16", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-17", "description": "If you want skin and bones covered in sauce, this place might do it for you, but don't expect to find much meat on the wings. I wasn't impressed by the sauce either.", "author": "Ken W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-01", "description": "I just tried the wings here for the first time and I'm disappointed. I ordered the wings and fries combo. The service was great and the fries were fresh and hot just like I like them. The wings on the other hand weren't fully cooked. After biting into one and checking to see if the others were cooked I ended up just throwing them away.", "author": "L. Joy W."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Buffalo Boss", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "400 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C2FGmcBxFrwc5paHhLw-MA/ls.jpg", "@type": "Restaurant", "telephone": "+17189230800"}