{"aggregateRating": {"reviewCount": 148, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-29", "description": "Food is good, but staff customer service is really bad. I felt it was too expensive for ok wings, but they have a $5 meal now.", "author": "Tamara L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-14", "description": "Was originally reluctant to go in. Should've followed my instincts. It was difficult to order. In part because the counter person was too busy holding a side conversation with a coworker (who was out of uniform) about the past weekends work schedule. And perhaps she couldn't hear me over Cardi B's new album playing loudly over the p.a. system. Nonetheless, I make my order, walk away and return to ask \"can I add fries to my order?\" She then replies \"can you?\" Suggestion......keep the street sassy attitudes in the back and not in the position to represent your brand. I'd rather spend my money where I feel respected and/or valued. NEXT STOP......WINGSTOP!!!!", "author": "Phil M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-23", "description": "Love the Blue cheese. The only meat item I order is the TENDERS which are delicious paired with the blue cheese. Hate that the blue cheese is 99cents each small size, 8.99 for the 16oz if u order tenders. The blue cheese (1) comes free if you  order wings_ boneless or boned. But I am obsessed with the Tenders,  fried soft not hard. And the fries are really good. \nService is friendly. Do not like eating in the establishment because of the size of the place. However the food is yummy yummy for my tummy.", "author": "Shakeema G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "I LOVE their wings. I come in and even when it's packed, every cashier is friendly and thorough. I make my own blue cheese (which is WONDERFUL!!!)  and theirs is BETTER than mine. I have hade them cater for several events and will be placing an order for the upcoming holiday. Service with a smile and EXCELLENT food.", "author": "Paryss L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-05", "description": "This restaurant has the worst customer service I have ever seen. Even if there was quality food here, it taste horrible because of the poor quality of the service. I went there last night. The cashier didn't want to take my order, asking instead that I use the kiosk. Okay fine. Once I still needed her to cash me out she did so with a complete attitude. Next, my order was up in less than three minutes and it was wrong! When I asked for my money back the cashier lied and said something about my flavors being mixed together. She begrudgingly gave me money and said it would have to be in cash (as if that's ever been a problem). She then followed up by commenting to what seemed to be a manager that I wanted my money back because my order was wrong. \nI highly recommend that you do not waste your time going here. The customer service is poor. The staff are young and seem unconcerned about providing customers with a good experience. It sucks!", "author": "Brittaney H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-01", "description": "We ordered boneless wings -- they were actually more like chicken-less wings. Soggy, gummy, overpowering breading with not much chicken inside. The seasoning is also way, way overdone.", "author": "C.K. W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "Fries are delicious, tenders are very juicy, but not as flaky on the outside as I wanted.  Wait took a little while, but worth the food. Delicious!\n\nCarried out our food- not many places to sit inside and not a great vibe for dine-in. Definitely a carry-out kind of place.", "author": "Katie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-23", "description": "it was my first time here and i was highly disappointed not because of the food or service but because it took too long for me to get my food not because of the staff or lack thereof, but because it was about 9 customers and 1 CASHIER!!! not even sure if there was a cook i couldn't even ask him about my order because he was attentive to other customers and he noticed me and asked for my receipt and made my food which was good but it's just not worth the wait.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "I tried their honey wings and they were great and flavorful. My co workers recommended this wing spot, thanx guys. Fast service, good prices", "author": "Guido F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "If you're looking for great wings, look no further. When I order, I usually get the medium wings with fries. I love the sweet/tangy ratio of the sauce and when you dip them into the blue cheese....#Heaven. The fries are really good as well.\n \n Some reviews are complaining that the wings are too small. You must keep in mind, these chicken wings are ORGANIC. They are not shot up with hormones. \n\n  The customer service could definitely use some improvement. But this place is more of a takeout spot. \n\n  I give this place 5 stars because the wings are amazing!", "author": "Karl B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "They are actually unprofessional with the delivery, I got no ketchup or serviette, my fries were all cold and soggy when I got my order", "author": "Ruth K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "I'm only giving one star cause their customer service sucks. Me \u0026 my co workers order food from here all the time \u0026 it's always some shit. Then after we spend our money they reluctant to fix it \u0026 take forever. Mind you my job 6 minutes away... Cut it out! \n\nOverall the wings \u0026 fries are good but if customer service sucks then the business sucks...", "author": "Sliim G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-17", "description": "I frequent the Jay St and Fulton Mall area really often and every time I do, the vast options for food have my stomach playing the gurgling. I was really hungry once and nothing else in the area was appealing to my appetite, so my mind quickly decided on Buffalo Boss.\n\nThe place is small. There's a few high seats and enough standing room for a few people to be comfortable.\nThis location will tend to get crowded and noisy during after school hours, so if you're not patient enough, just be aware of that.\n\nNow, on to the food. We ordered the combo deal they have that comes with 5 wings and a side of fries (approximately $7). The order didn't take too long to come out and when we received it, we decided to eat it walking home. \n\nI see a lot of reviews commenting about how tiny the wings are and let me just say, please don't forget, that's actually a good thing. It's organic and antibiotic and hormone-free.\n\nAs for the taste of the food, it was mediocre. If I recall correctly, we ordered the Honey BBQ wings. I loved the fact that the wings were organic and everything and these didn't taste bad, but they were overly sweet, which made it less enjoyable. I love fries and these were just a-ok.\n\nThe service itself was typical for a restaurant this style. Not friendly but not bad either. No real communication with customers.\n\nOverall, good for a quick snack, but for it being your full meal, I personally recommend to head somewhere else.", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "Went on A Saturday.  There was a small crowd.  I saw some Pos system, no one said anything and the server/cashier was busy with orders.  He finally asked if I wanted to order.  I ordered the 12 piece with 2 drinks and sweet potato fries.  I traded my drinks for a regular fry.  You should have natural drinks . I only saw soda. The chicken was tasty! Well done!  The fries were delicious This is my first time you should tell your customers what to do, people that knew; jumped in front of me.  Pay attention to what's going on and hire a person to handle the front of the restaurant.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "Only giving this place three stars, i ordered takeout and have been waiting over 30 min. BECAUSE of fries, the girl at the front opened the frozen bag and said another 5 minutes, what? I've been told to wait 6 more minutes 20 minutes ago. The wait time was ridiculous but the wings are great.", "author": "Mel C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-25", "description": "Ordered delivery at 8:07 pm and it didn't get to me until almost 10 pm. When I checked the order they kept pushing the delivery time out further and further. When I called to check on the order they said the delivery was picked up 40 minutes ago, but when I got it it was still warm so how did he just pick it up? The wings are delicious but the delivery is an awful mess. Definitely know to pick up instead of order.", "author": "Bethany S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-03", "description": "The hot sauce is terrific.  The quality of the chicken is mediocre at best, not much meat on the wings.  My biggest issue is that the delivery orders often fail to show up at my place.", "author": "Pravin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-30", "description": "Pros: homeade blue cheese is the best, chicken is edible.\n\nBut, their service is a bit off, so is the crowd. It can get rowdy and messy waiting for your order that even bums come in to steal drinks from the soda fountain since its so unregulated in there.\nMy last time here I ordered hot buffalo wings and garlic parmesan wings. The garlic parmesian were good but nothing special. I was given plain wings without buffalo sauce so I had to do it myself at home because the plain wings tasted.. Plain.\n\nI would come back for a blue cheese jar though, I could taste buttercream and diverse seasonings in there that makes it very worth it.", "author": "Edith R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-30", "description": "They'll charge you $2 for tap water even after you just payed $12 for 7 tiny peices of spicy chicken.\n\nThe chicken isn't even worth it. If you want over priced chicken check out stickies. Or if you don't feel like flexing your wallet, get some cheap wings somewhere else and you'll probably have a much better experience.", "author": "Bryan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-07", "description": "I've came here more than a few times. \n\nThe first reason why I deducted a star was because the staff do a TERRIBLE job at cleaning. The last(and finale) time I went inside to eat lunch with a friend, a roach popped out of from around the napkin dispenser and tried to scurry along the table! Not to mention the napkin dispenser was empty and not clean. This is a place of food, I still cannot process why they will not do a better job at cleaning. I mean c'mon, this place is too small to not clean ._.\n\nThe second reason I deducted a star was because they are not the best with keeping up with orders. I always have to check my bag to make sure they don't forget something and this just really irks me. \n\nBut on the good side. The wings do taste amazing, especially the buffalo wings. And their fries are just as good. \n\nMy advice, if you want to eat here just order to go. But don't stay here to eat.", "author": "Nylajah D."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Buffalo Boss", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "400 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C2FGmcBxFrwc5paHhLw-MA/ls.jpg", "@type": "Restaurant", "telephone": "+17189230800"}