{"aggregateRating": {"reviewCount": 148, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-11", "description": "The food is decent, however that's all that can be said about Buffalo Boss. \nTheir delivery drivers are rude. Delivery usually takes over an hour. The order accuracy is always off. They rarely give you everything you paid for and when you call to inform them they seem rather uninterested. I love me some wings, which is why I have no problem giving them several tries. No more. There are much better wings to be had in Brooklyn without all the hassle.", "author": "Jason F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-05", "description": "Please, for goodness sake, train all cooks on how to cook the wings. The quality is extremely  inconsistent. Celery and the homemade Bleu cheese dressing is your best bet. The fried oreo is not even something that should exist but since it does, try one and hate yourself later. It tastes good hot. If they get cold, throw them at people in self-defense because they will taste like sugary rocks. Fried poptart...who comes up with this stuff? Anyway, bottle that homemade Bleu cheese so I can cover myself in it on cheat day.", "author": "Shanora S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-21", "description": "Only been there once, their hottest sause - N'Sinerator just killed all my sense of taste for 2 days. Insane. Quality of rice was real bad, Not my kind of food. will not go back there again", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-15", "description": "2 hours later, no food.  Had called after 1 1/2 hours, they said it was being \"expedited.\"  Over 2 hours later, they claimed the Grub Hub driver wasn't around and I would have to call Seamless to get a refund.  Having received messed up orders and cold chicken in the past, let's just say it won't be a loss to not have them in my life.  For a chicken fix, you can't beat Hill Country Chicken and for wings I'll go to Papa John's.", "author": "Z B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-29", "description": "Today was the first day I've tried this place.. Highly disappointed !! The wings are like little baby wings and not worth the price.. The onion rings were tasteless and our order was wrong and the delivery was almost an hours wait... I'm probably not going to patronize this place again.. Too much money for too little wings..", "author": "Desiree S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-18", "description": "I went passed by last night starving and was taken in by the bright dining room. I had not heard of this place before. The front counter girl took my order. I was cautious and ordered a 5 piece honey bbq wing combo with fries. The atmosphere was nice while waiting with music and videos playing. After devouring my food, I can honestly say that it's good. I've never had the lemon pepper that was reviewed earlier, maybe I'll try that next, but I will certainly go back. I think they're new and working out the kinks. But the food is really, really good!! I enjoyed myself and for the money, my combo was totally worth it. Don't think I spent $7 bucks all in.", "author": "R A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-14", "description": "This place is ran by young adults. Unbelievable. I stopped in on 1/11/2014 at 10:30 pm, coming from work tired and hungry. First, the MUSIC is so LOUD, the lady taking your order can't hear you \u0026 you can't hear her, so it seems like you are yelling at each other.  Next, the music that is playing has FOUL language to the extreme. I'm sitting waiting for my food and the things I'm hearing is an ear soar. Hardcore sexual explicit rap music is loudly being blasted.  This is not the type of music that should be playing in a public restaurant. All the employees were dancing, singing \u0026 playing in the back. It's like one big party for the employees. Finally my food is ready. I get home, my wings are fried SO HARD they are unable to be eaten. My fries are missing, no celery sticks, no blue cheese sauce. I will never visit this place again. It needs to be ran by responsible employees \u0026 the staff needs to understand that this is a place of business to work \u0026 not the club on a weekend night.  I often visit the location near Fulton \u0026 Nevins \u0026 have never experienced any of this. Awful experienced.", "author": "Shelina M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-28", "description": "I actually loved their food.  But my last four delivery orders have been a bust with this location! The first time, they didn't mix my sauces.  The next time the sent boneless instead of regular.  Third time.... Should I keep going. Well this last time, our order took almost two hours to arrive.  We ordered as a group at work and every one of us was disappointed.  Even the cheese on the fries had reshaped into a block, it was so cold.  Ashley, the manager, did attempt to replace the order.  But when it arrived, three of my coworkers had already threw their meals away.  And since I could not provide the old food, of course they would not give me the new food.  I wonder if they are going to reuse that food and sell it to the next customer.  I'm not sure, but the delivery guy left with the new order.  So we were out our money and just ordered that dependable Chinese chicken wings from next door..... Oh well, they just lost 10 customers from our office.  I'll be waiting for Mr. White's or Mr. Lee's call...", "author": "Danielle J."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Buffalo Boss", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "400 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C2FGmcBxFrwc5paHhLw-MA/ls.jpg", "@type": "Restaurant", "telephone": "+17189230800"}