{"aggregateRating": {"reviewCount": 148, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-18", "description": "Some of the best wings I have eaten besides the hot wings at Okeef's.  The french fries are delicious, and the blue cheese sauce is amazing.  It's a lttle small, however; the food makes up for the space. I enjoy the Honey Mustard wings. The staff changes often and they are friendly. It will get crowded at lunch time so just be patient and enjoy.  P.S. don't forget your Blue cheese sauce it does not automatically come with your wings.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-03", "description": "The only good thing about this place is the location and fries. They literally take foreverrrr. If you come here expect to wait at LEAST 10 minutes for your order. And it makes no sense to charge 70 cents for ranch or bleu cheese. WTF are we supposed to eat the wings with?? Ridic.", "author": "Cici C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-28", "description": "Do they go to Buffalo to get the chicken  for every order. The wait for my order was entirely too long. It took about 10 minutes to tell me they didn't have the flavor sauce for my tenders. Then another 20 minutes to get the next sauce put on. I was offered an apology.  Thanks, But I Will Try A Different Location.", "author": "Genie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-01", "description": "I was bothered that they closed the location on Fulton but this one delivers up to Clinton Hill so no problems there. \n\nThey did forget the side of fries, but I ordered on NYE so I'm surprised everything arrived hot. \n\nI'm just reading the reviews and I'm a little shocked. We ordered the 24 combo of wings. The \"Hot\" sauce was more peppery than I would have liked. The honey bbq left much to be desired, but honey is kind of bland to me sometimes anyway. The \"blazin bbq\" and \"medium\" were my favorites. Very flavorful.", "author": "Olivia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "Ordered from this place through UberEATS. Wings are amazing. Ordered mild and they have a sweet hot taste to them! Must say they are a bit pricey but other than that, I had a great experience. Will be ordering from here again!", "author": "Brielle W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "25 minutes' wait for an order of chicken tenders? With barely any customers around? Never again.", "author": "David O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-28", "description": "is there a zero star? poor customer service\n\nthese guys should shut down\n\nthere's cockroaches in the kitchen", "author": "Vhalerie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Be sure to order on seamless before you arrive to pick up.  OMG wings are the best if you like spicy food, purchase extra blue cheeses like 10. They have the best in NYC.", "author": "Don D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "I love that I can get organic, hormone free chicken wings! My friend said the wings were small, but I told her they were probably hormone free. We looked it up and bingo! If you want a healthier wing option, this is it. The hot wings are great, medium spice, sweet, tangy with a hint of garlic. The blue cheese dressing is really good too, seems like a better quality than other places. I have to say that the sweet potato fries were really soggy though, I prefer fries to have at least some crisp. I threw half of them away:(\n\nWill def be ordering again. Got it off Seamless.com and the price was a little high, but it's quality chicken. So it's worth it to me. Enjoy!", "author": "Sara W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-03", "description": "The worst wings ever!!\n\nLet's state the facts:\nWe found hair in our food.\nWe were charged for extra sauce and didn't receive it.\nThe wings tasted old and stale, they were overcooked and barely had sauce on them!!!\n\nFirst of all the wings were the kind you find\n on a cornish hen. For almost $20, we got 18 tiny wings. Which when you think about it is a rip off. \n\nI called the place, I can't even form the words to say restaurant.  The manager didn't seem surprised.  She said we could bring them back or get something else. We live in Bed Stuyvesant, so you want us to come back downtown? Oh and hang onto the hairy food?! Not in my fridge!! That's a no. At the end of the day we wanted a sincere apology and a refund. We got neither.  I did call the health department.  Who knows what other atrocities lay oozing in that place!!!! I will never eat there again. I will never refer my friends there. I am stll nauseas at the mere thought. \n\nYou can take Buffalo and Boss out of the name more like Lame and shame.", "author": "veranda b."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-11", "description": "Very disappointing.\n\nWe grabbed food on the way back to manhattan and we ended up having to wait ~20 minutes for our wings. My salad did not have the chicken i paid for, which was very disappointing. the wings are small, but decently tasty.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "\"Hot\" wings were delicious! Incredible sauce. Rivals Croxley's for me. May even beat it - will have to go back.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "It's alright, but if you crave some wings, this is a fair place, but not a place I highly recommend. \n\nI'll start off with the decor - it's beautiful and in a dreaded industrialized sector of brooklyn, the colors are really attractive, which makes it stand out from the competing restaurants. It's pleasant, but the store itself is rather small and seating is a tad cramped. But it's a takeout place, so I won't penalize it too much. \n\nThe staff was also rather friendly, so that's a plus, or this place would've gotten lower ratings.\n\nNow onward to the food. The meat is really bland. Like what other reviewers said, the wings are REALLY small, but they claim it's organic. Now, lemme get to the point of organic food - it's supposedly healthier and tastes better. But with Buffalo Boss, it tastes as if it was dumped directly into the fryer without a complete defrost (and it wasn't breaded either). Basically, you have raw chicken and its skin, being fried. So whatever nutrients and vitamins in the organic stuff they promised you is virtually non-existent because it's almost completely fried. \n\nThe meat is also rather hard since they overfried it, so I don't recommend this place to the elderly and etc. \n\nMy only one compliment on the food - the celery was really fresh and the bleu cheese had an avocado mixed into it, which was interesting. Not everyone will like that taste, but i liked it, tbh. \n\nBe sure to check into yelp for a free soda to sweeten your deal.", "author": "Ronald Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-11", "description": "Hands down this is the worst wing place I've experienced.  Disappointing cause I love wings and had my eye on the spot since it came into the hood.  The two stars were because the lemon pepper spice was tasty but even then the wings are not grade A, which doesn't stop them from charging $1.40 per wing.  The standard buffalo hot wings were inedible, unless you like squishy wings drowning in uninspiring hot sauce.", "author": "E E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-12", "description": "The official wings of the Brooklyn Nets?  I'm honestly surprised.\n\nI tried some of their hotter wings, but wasn't totally impressed.  They do get points for creativity by using black pepper instead of hot sauce.  It provided a dirty heat that even a spice hound like me had trouble getting used to.  Did I enjoy the meal?  Absolutely.  I'll definitely go back, try a hotter flavor, and try to get a better opinion.", "author": "Colin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-30", "description": "This was a disaster. Ordered on a Sunday night and after an hour I called to see what the holdup was. They just told me what I wanted to hear so I wouldn't get angry. After 90 minutes no wings so I called again. The girl said something to the effect of \"well , your order is not the only one we got tonight\" as if that is my problem. Finally approaching 2 hours I lost it.  People on phone were little help. Finally at 2 hrs, 5 minutes my wings showed up completely dry with no dipping sauces. I called and said I won't pay for this crap and they told me to call the site I ordered through and ask for a refund. When I explained that they need to do that I got nowhere. Finally they said they would refund it but of course that never happened. Everyone else - I suggest if you want wings your local dive bar will be far superior to this garbage place. Never again!", "author": "Kyle S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-13", "description": "Terrible service...\nI went there today, ordered 12 wings all flats. Everything was fine until I got all the way home, undressed and ready to eat, to see they were all drum sticks . Every single piece. So I call and the girl says my next order will be compt. Ok fine but then I continue to eat and I'm not enjoying it at all because I don't normally eat drum sticks. So I hop right back on the train to jay st and reorder the wings all flat , extra crispy. This time they had me waiting 30 mins. Only 30 because after the last guest leaves with his order who also came after me, im basically pissed. They couldn't tell me whether they started to make my order or not. Clearly the communication was off and also if you see a guest waiting for longer than usual, aren't you suppose to contact the guest to make sure everything is ok. That was not done today. I paid almost 19.00 for 12 wings, I have a right to get what I paid for . 1 star is because I had to.", "author": "Alivia T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-17", "description": "Not sure why I gave this place another shot after having two prior horrible experiences, but it was late and the smell emanating from the place pulled me in I guess. That third time will definitely be my last though. There's always a problem with my order and this time, I was actually shorted a bunch of wings. So mad I didn't bother to check until I got home. It doesn't help that the wings are the tiniest excuses for wings that they could find. I'm assuming that they only use newborn chickens, fresh out of the egg or something? I mean... I suppose if you're a toddler, then they're a decent enough size. Anyway, besides always messing up my orders the customer service is usually a problem, except for this last time when they (manager included) actually had a smile on their faces as they were botching things. So I guess that's an improvement? Because after those first two times, I was beginning to think that rude customer service was an intentional part of the Buffalo Boss experience as if it was their \"thing\", or something. Please do yourself a solid, and don't be suckered into going there by the amazing smell. There's always more places to cop wings from. Besides there's a Subway right across the street and that bar Dining Room close by has wings if it's that serious. We have a friend that is hosting an upcoming event and she asked us about getting the wings from there. I remember saying no, but now in order to make sure we save her from guaranteed disappointment, I'm changing my response to \"absolutely the heck not!\".", "author": "Tony B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "I'm surprised by all the negative reviews because the buffalo wings were pretty freaking good. I wasn't expecting anything gourmet but my expectations were met. THe wings were well cooked and the sauce i ordered was very spicy. I ordered my food from seamless and it arrived within 15 minutes. No complaints.", "author": "Kia R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-17", "description": "Thursday lunchtime--PACKED.  I knew it would take a while for the food (30 mins), but was comitted to trying these wings.\n\nI spent 3 years in Buffalo and grew up nearby--and I regularly fry, bbq and broil wings at home with various homemade and store bought sauces--so I (and my friends) consider me a connoisseur of chicken wings.\n  \nIts not really a restaurant because there's almost nowhere to sit.  The store is very small with 3 cashiers tapping orders and yelling out first names for customers to pick up their food.  As with most 'Fast' food eateries customer service is lacking, but they clearly don't have the cooking capacity to remotely keep up with the orders.  I suspect as word gets out this will be less of a problem, but for now its a $hitshow.\n\nI ordered 12 wings \u0026 a soda(Pop), which came to over $15--pretty much a ripoff.  Additionally, I almost took another Johns' order but quickly noticed the error and found doppleganger John.\n  \nThe wings are allegedly organic free-range, but they are quite small and a dozen easily fit into a Whopper-sized container.  I ordered the 'Hot' sauce which is NOT organic, home-made, from scratch or anything made with love \u0026 care.  Tastes generic and chemically--basically just red, hot goo--and not memorable.\n\nThe white dipping sauce is decent stuff made from yogurt with no bleu cheese.  It might not be everyone's style but I was OK with it.\n\nThe fries, (which I did not order-but tasted)  were quite good.\n\nIf you must go....which I do not recommend, order the wing/fry/drink combo which is the only 'value' available.", "author": "John B."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Buffalo Boss", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "400 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C2FGmcBxFrwc5paHhLw-MA/ls.jpg", "@type": "Restaurant", "telephone": "+17189230800"}