{"aggregateRating": {"reviewCount": 148, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-10", "description": "Location is very small. Minimal seating is offered here but there is seating. I wouldn't dine in a group though.\n\nYou place your order via a self order kiosk. It wasn't immediately clear as they also have a cashier's station to the right but it wasn't in use. I'm actually pretty sure the woman making the food was the only employee there this late morning.\n\nPlacing orders are pretty simple and they allow you to type in your name so that they call that out rather than the order or the order number.\n\nThe food was handed to me in decent time. It smelled good and enticing. I got it to go and so I ended up eating it at home.\n\nI had more fries than I really needed but they were delicious! The wings - I got the lemon pepper rub 5 piece combo which included the aforementioned fries - they were nice. I think they were fried hard (which is an option on the ordering site) and so I needed them out maybe 4 minutes earlier than the actual cook time used.\n\nI would eat from here again. I did not see any breading whatsoever on the wings, which I love because I can't handle large amounts of gluten at this point. I'll update tomorrow if I see any gluten signs - but that'd be more my fault than anything. I was seriously hungry this morning!\n\nThe only unpleasant part was the lady with a beard who was panhandling in the store. The cook/cashier absolutely shut that down though within 4 minutes and I'm grateful.\n\nBTW, they have separate tip jars. One for the cook, and one for the cashier. Nice touch. It also smelled like food and not like people, so I'm satisfied.\n\nStop in and give them a shot.", "author": "Lori A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-16", "description": "Smelled so good I decided to try it. Entered while cashier was helping another customer. Once that exchange was finished I stepped up. The worker turned her back to me and remained that way for a measurable amount of time until I just walked out. No hello, no \"I'll be right with you\" etc. Young lady, you just lost a new customer.", "author": "T F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "Good chicken. Cooked well and sauce was great as well. I got the bbq chicken that's always my go too; or spicy. Gives you celery and carrots with it!", "author": "Anastasia J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "We found this place when looking for a late night munchie spot. Only one stop from my house. They let us come in and order at 11:45 (they were about to close) which I thought was so nice of them. The chicken was super crispy (how I like it haha) and the fries just as addicting. Highly recommend coming here with the munchies!", "author": "World U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-26", "description": "Wings here were saucy and tender. They had a nice bbq flavor to them. Although I do think they could go easier on the sweetness of the sauces. Overall a pretty solid wing joint.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-02", "description": "It's a rarity when I give a 2 star or less. But this place deserves it. When businesses base making money off of good customer service and great food it shows. This place was probably the worst businesses I've had the displeasure of entering and ordering from. \n\nService: the main reason this place got a two star review was the horrid, rude, dismissive and flat out missing any attempt at good customer service. The cashier eyeballed my Yelp \"free soda\" coupon like it was a forgery...and all I wanted was a freaking cup of water-Which, by the way, this place refuses to let you get a cup for water without charging you for a soda first.  \n\nCleanliness: tables dirty from prior customers, floor was dirty with food and trash. \n\nAmbiance: casual, rap music playing on a continuous loop. \n\nSeating: this place has some seating for about 12-18 people, but I'd recommend just grabbing your order to go. \n\nFood: the ONLY reason why this review has two stars instead of one.  smaller wings, more tasty than the normal oversized chunky wings you get elsewhere. Cooked perfectly and seasoned nicely. Really good flavor. I ordered the 6 piece garlic parmesan. My husband orders the 8-piece hot wings. Good flavor and cooked perfectly. \n\nNOTE: No bathrooms, cramped seating, limited menu and they refuse to let you buy extra celery.", "author": "Audry P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-31", "description": "I come here because the wings are organic. MANAGEMENT OR OWNER NEEDS TO STEP IN! \n\nA lot of people just hanging out in here. That includes bums. It smells like the subway. I literally just saw a bum walk in and refill a cup at the soda machine. He walked in from off the street. The tables are dirty. Things all over the floors. It's dirtyyy. I sat on the side where I can see the cook in the kitchen because I'm feeling my 40 min commute may be for nothing. A few of the female workers seem somewhat ghetto. One came out to talk to her friend and went back in to ask him what he wanted. \n\nWhen we I come I order a lot of wings for my family. Make the trip worth it but it's just ridiculous now. \nI'm happy it's organic- but please make it better!!", "author": "Tinnil S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-03", "description": "Okay so I've only ordered the lemon pepper dry rub wings so take this review for what it is.. the chicken is prepared as you order only. That saying the wings are always hot and crispy when I order. It's easy since it's right at the Jay Street stop of F,G and R trains was well as a few buses so it's convenient too. The special for those in store is the $1 self dispensing drink with any order.", "author": "Wes D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-15", "description": "Service is absolutely terrible but the wings are amazing. I ordered to pick up before I left work last week, I had to catch a flight that evening and was in a rush. When I got there a full 30 minutes later, my order STILL wasn't ready. The cashier told me they were waiting on the fries, which I then watched her open up a bag of frozen fries and dump it into the oil. I then waited another 15 minute for the fries to cook, so essentially there was no point in me calling 30 minutes before. When she handed me my order half my fries were cold and the other half were piping hot. I live fairly close so I've come here a handful of times and every time there is a wait even though its never packed, service is painfully slow, and there is always some time of mix up on the order. I have to say its not that hard to get your stuff together when your menu has less than 10 items. \n\nI do keep going back though because as bad as the service is the wings are amazing. I love the buffalo sauce classic wings, the honey mustard sauce is also great. Their blue cheese ranch is also a big crowd pleaser, just make sure you wash your hands well afterwards otherwise you will smell like your meal.", "author": "Joanna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-16", "description": "Buffalo Boss has an AWESOME concept.  Ordering was a little confusing, but the service was not bad.  I love the fact that they have Halal wings.  Unfortunately, the sweet potato fries were just too dry.", "author": "Ace P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-11", "description": "Ordered via uber eats at 12:30am.  Order was accepted at 12:30am.  I get a notification at 1:04am saying that my order has been cancelled.  I call the restaurant and they say that \"we're closed.\"  I asked why I had to wait thirty minutes to find out my order was canceled, and they couldnt give me a good answer.", "author": "Don K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-05", "description": "Third and last experience, I've tried different things each time and each failure out does the last! This is Buffalo Boss's take out lemon pepper heavily salted chicken tenders with a side of stale fries. I've eaten better food at homeless shelters! The service is not any better, it reminds me to never return. Eat at your risk and good luck. Probably will not eat here again.", "author": "Shu J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "You are the best wings and I love you.  I'm coming for you tonite so get dressed in that delicious buff sauce and garlicky blue cheese and I will see you at 9.  Xoxo foreva, Monica", "author": "Monica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Wings are good make sure you get the halal wings they are bigger then the regular and has more meat... So good. Try different sauces and make sure one is dry rubbed a different taste sensation.  Now because the wings are bigger they will take a little longer to cook so be patient it's worth the wait.  The other thing I like but I wish it was way from the cash wrap area is you can put your order in without a wait... wonderful idea seems like everyone is doing it and it cuts down the wait time.", "author": "RICHARD J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Y'all asking for 5 star service. It's chicken wings and fries. Relax. Wings are bomb. Fries are bomb. I appreciate that they are open late on weekends. They really hit the spot after a night of drinking.", "author": "Shamire J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "tl;dr - perfectly crunchy wings with great flavor..and they're ORGANIC! We ordered from DoorDash and order was early so can't speak to the poor/slow service other Yelpers complain about.\n\nRandom Sunday night wing craving totally satisfied by this place!! I've struck out majorly in finding good wings in Brooklyn so I'm thrilled to have stumbled upon them on DoorDash (they had me at \"organic\"!) Ordered mild 6 pc for me and 10 pc lemon pepper for beau. We expected the lemon pepper to be a sauce, but we were sooo happily surprised it was actually lemon pepper seasoning (There's a major difference!). My 'medium' weren't spicy at all, which I should've realized since there's a sauce called N Cinerator. Lol. I see reviews talking about terrible and slow service; we didnt have that experience. Also read concerns about the size od the wings...blah blah! I'd rather my wings be this size instead of the ginormous wings at other places. We will absolutely order from here again. Oh and the blue cheese/ranch dressing that came with the wings?! BOMB!", "author": "EarthaStarr P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "I love coming to this place for their outrageously delicious boneless buffalo wings.... the blue cheese sauce is to die for and it's hands-down the best blue cheese I have ever tasted.\n\n\nThe buffalo sauce is Tangy and delicious and when you get the Boneless Wings they come in a lot of extra sauce which is so great. This is not a place that you sit and eat in.... the music is so loud that you can barely talk.. the seats are uncomfortable. The fries are crispy and delicious the staff is very friendly. \n\nAnytime I'm in the area I had straight over here. You've got to try this blue cheese dressing. Whenever I go there I pay extra money to take some home with me it's just the best I've ever had and I am a huge buffalo chicken affictionado!!", "author": "Mandy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-14", "description": "Fries are too oily and the wings are pretty decent. They use way to much sauce though and naturally, they don't cook the wings to a crisp. I would probably eat here again.", "author": "Shanee S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-07", "description": "Wings are small and dry, even I ordered regular cooking. They are not cooked in the sauce. Sauce is added after. Celery was old and dry. Probably cut yesterday. Overall not a good place at all.", "author": "Helen D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "Got the 18 piece wings with the hot bbq sauce and the wings were amazing! No doubt! Smaller than usual but the flavor was spot on and cooked really well. So why the 2 star rating then? Well we also ordered the crispy fries which only come in one size and they cost $4.50!!! The size of the bag of fries was smaller than the medium fries you get @ McD's and the quality wasn't all that great for the price they are charging. DO NOT GET THE FRIES!!", "author": "Amruta A."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Buffalo Boss", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "400 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C2FGmcBxFrwc5paHhLw-MA/ls.jpg", "@type": "Restaurant", "telephone": "+17189230800"}