{"aggregateRating": {"reviewCount": 148, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "I see the very mixed reviews here and I luckily had a decent experience here.  The service was not great by any means, but the wings were really really great.  I can't say I loved listening to rap music the entire meal, but that's what they played.  I'm rarely in Brooklyn, but was here with friends. I can't say I'd return only because I live in the city.  But it you are looking for good wings, this is a great spot.  Maybe order in if you live in Brooklyn.", "author": "Lydia Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "I'm completely and dangerously obsessed with the honey barbecue sauce. It's legit amazing, and I want to pour it on everything. Also, I'm never a blue cheese person, but the blue cheese sauce is out of this world. It's super super creamy, and crazy delicious.", "author": "Elise P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-06", "description": "The wait was over an hour and a half for a Wednesday night. Did not even hear from the restaurant. Did not hear from the driver. Had to reach out to grub hub support twice. Even they had trouble reaching the driver. Don't waste your time or money.", "author": "Sophia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-08", "description": "I hardly write reviews but the negative experience has definitely inspired to write one.  Their customer service is horrible.  They delivery takes too long.  We ordered online and called right away to make sure they got our order because there was a previous incident when we didn't get out order at all.  Then it was 25 minutes late when we called to check and they put us on hold for at least 10 minutes.  When we called again they picked up and put us on hold without saying a word.  Then I get a call from the delivery person asking me to come downstairs for it.", "author": "Graciela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "\"6 STARS\" I don't eat chicken I am a steak and sea food Type of person and never or rarely would you see me eating anykind of poultry ever. But ever since i ate their wings I been hooked line and sinkered. Will wait a half an hour for an order and not give a care one bit\nBecuase I know the reward lol ... \n\nThe wings are Amazingly delicious and flavorful my favorite is the spicy honey bbq with some of that blue cheese yummmmm meeee and a sweet potato fries on the side oh lord have mercy on my soul ... \n\nI go there at least 1-2 times a week ... STRAIGHT UP IGNORE THOSE NEGATIVE REVIEWS ...", "author": "Issac L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "We really liked this place! Sauce was yummy, and they were very hospitable and kind. They answered my questions about gluten professionally. My only complaint is i wish we didn't have to pay for water cups. Delicious food tho", "author": "Holly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Best wings ever! The fact that they were organic really added to the flavor as there was really no grisly pieces on the chicken.  I had the lemon pepper, mild and honey bbq. All were flavored great and my favorite was the lemon pepper.  It had great flavors and a dry rub to it. Now the blue cheese is out of this world.  I actually have never liked blue cheese and this blue cheese sauce was so good, I dipped everything in it  I will definitely be back!", "author": "Daraja A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-05", "description": "Love the food buttt the appearance of the restaurant is a NO soda machine not clean workers working in socks tables are sticky and as much as i love the food i don't think i will b going back unless i see some improvement y'all gotta do better!", "author": "Yana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Great variety of flavors and who doesn't like organic food?", "author": "Craig S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-13", "description": "OMG. To cook \u0026 serve commercial \"food\" this store is Slooooooooow.Music way too loud. But mostly the amount of time the staff wastes is shameful", "author": "G.R W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "I'm from Buffalo, and stumbled across this place more or less by accident. My interest was piqued, figures it would never be as good as the wings back in Buffalo, but it couldn't hurt to try.\n\nI ordered their 5 wing combo which came with fries with regular Medium sauce. The wings are smaller than the ones typically found in most wing joints in Buffalo (a common occurrence for pretty much every other restaurant in every other city from what I've seen). So you don't get quite as much meat as you would in the home of the chicken wing. \n\nThe sauce was actually kind of close. It evoked a similar zing that Frank's hot sauce (a staple base for chicken wing sauces) would have, but was actually a touch sweeter and not *quite* as strong of a spice. \n\nThe sauce's biggest flaw was that it was FAR runnier than I was used to, to the point that the wings were in a pool of sauce right out of the box, and the wings would drip more than usual when eating them; watch your lap as you're eating, there's a high risk of dripping on your clothes. The leftover sauce did make for decent dipping for the French fries, however.\n\nFor most wing places in Buffalo, the fries are a bit of an afterthought. The fries here were fantastic. They must have been fresh out of the fryer. They were thick cut and had a lot of texture. Hot, crisp, delicious.\n\nIt wasn't terribly busy when I went and I got my food in short order. Without a restroom, only having napkins available to clean my hands was a bit annoying; having some wet wipes would have been a huge help (especially with that much runny sauce) since one cannot go wash their hands in the nonexistent restroom. \n\nWhile it wouldn't compare to any place in Buffalo, this place put forth a pretty noble effort.", "author": "Bryan Patrick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "First of all, the sauce is addicting! Amazing. After trying Buffalo bosses wings for the first time, I am hooked.\n\nTypically when I eat wings, I'm turned off by the amount of fat that is on the skin. These are organic wings and   had none of that!\n\nI look forward to our next catered event. I can't wait to bring these wings in.", "author": "Scott K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-03", "description": "This is just a horrible ratchet place! I ordered the 6 piece wings extra crispy and a can of sprite. The wings were extra saggy and the can of soda was hot. I'm talking about just taken out of the box hot. I called to complain spoke to Renee \"the manager\" whom informed me i didnt have to eat the wings, and the soda was hot cause they have no ac. ‍‍ Never again!", "author": "Darlene D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-07", "description": "Unreasonably slow. Employees hanging out and amusing themselves instead of preparing food.\n\n10 min after I ordered they took cooked strips from a drawer and re-fried them, making them greasy, stringy and overcooked. \n\nI'll get my splurge calories elsewhere in the future.", "author": "Lane G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-15", "description": "I ordered the boneless wings. The coating on the chicken was so hard, can't use the word crispy, I broke two plastic forks and still struggled to spear the chicken.\nSauces were tasty but without chicken.....pretty useless.\nCounter staff were very nice but could hardly heard them as the music was so loud .\nDefinitely not an eat in place.", "author": "Guy T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "Fast forward to after I had finished my 5 piece wings and fries meal and I would have given this place 4, maybe 4.5 stars. Unfortunately the service, that one piece of the business puzzle that makes or breaks an establishment, is what made me give it one star. So, back to the beginning....though my order had been ready fairly quickly, the  orders of the other two people I had been with took forever. Literally and figuratively. And one order had to be sent back twice! to be corrected. We arrived around 1:30, placed our order and we did not leave until 2ish. And the one whose order had to be corrected left closer to 2:15! I had heard the wings were delicious and wanted to give it a try. And though they were delicious (Lemon Pepper seasoning and Fries) service was horrible and therefore my visit stays at once.", "author": "Pedro J M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-05", "description": "Unfortunately the newest addition to this franchise in Jersey City isn't up for Yelp reviews yet. Also unfortunate is that today was my first time trying it as well, probably my last. First I would like to start on a positive note. The layout of the food court restaurant is very nice and I like the self serv POS. Now for fun part. Staff is less than polite, my food was cold, I had to wait for my soda as the server told me I had to wait for the cashier to pour it while she had 8 people in line. This is my reason for the staff comment, why couldn't you pour my soda while you are running the orders? If this place does not work on these, I don't see this spot staying open for long. First impression is key. And I am less than satisfied. Also I need to reiterate that this is not for the Brooklyn store, but for Jersey City store.  Orders 557 \u0026 559.", "author": "Vic Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Great organic wings. The lemon pepper and mild sauce wings are the best flavors in my opinion,", "author": "Quecvas J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "Pretty good wings at reasonable prices. Gets very busy so order ahead. perfect po lace to order a ton of wings if you're having a party", "author": "Costa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "I don't get the negative reviews - I ordered online for pickup in store. I got there 10 minutes later and it was ready, cashier was friendly and quick and the food was hot. The chicken was delicious and better then the average chicken wing - the blue cheese was great and almost had a French onion taste to it. I'll definitely be back.", "author": "Dylan F."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Buffalo Boss", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "400 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C2FGmcBxFrwc5paHhLw-MA/ls.jpg", "@type": "Restaurant", "telephone": "+17189230800"}