{"aggregateRating": {"reviewCount": 148, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "The workers vary. Every time I come here there are different ones each time. These past two ladies were the best. However...I'm not at all sure wtf goes on in the kitchen! My sweet teriyaki wings, fries and fried oreos took 30 min to make and put together. Now how my fried oreos sat in a sea of teriyaki sauce is beyond me but not sure why it had to taste a day old and a few temperatures too short after 30 min. I'm guessing the teriyaki sauce in the fried oreos made up for the lack of teriyaki sauce on the wings. I would guess this was a mistake but after 30 minutes of trying...I think his one is a big fail....since this is my third time here and I've had the exact same problem (horrible ticket time and cross pollinated food that is cold and old) ....\n\nI just give up. Lmao. Either buy ur own wings from the grocery store of find somewhere els....definitely Not worth it", "author": "Eternanda F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "Service isn't the best, the workers didn't interact.. or speak actually. I ordered the o.m.g boneless wings which is one hotness level above the original hot buffalo sauce. MY MOUTH IS STILL BURNING AS I TYPE THIS! The flavor was there but I could only force down 2 of the 5 boneless wings. They were drenched in ranch and that didn't help a bit. I would eat it again but I'd definitely get mild or MAYBE medium.", "author": "Diamond B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "So they didn't tell me that one cook never showed and told me it will take 10 mins for my wings. When I asked where is my food after 10 min. They said they haven't started and because the cook never showed . Never going back there . First time and last time", "author": "ray w."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "If I could give zero stars while also writing a review I would because this place deserves none. \nFirst the service was terrible and extremely slow. It's not like we came during a lunch or dinner rush. There was only 2 other diners inside and out order took over 30 mins. \nWe got a take out order and after taking so long to get the order ready, we get home to find no dressing on the side for the wings even though our receipt said that it was included. \nThe taste itself was sub par. The garlic Parmesan flavor was basically salt and Parmesan cheese over chicken tenders and the hot original style buffalo sauce was barely even spicy. \nDon't even try going here. Absolutely terrible.", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-27", "description": "Customer service is slow. \n\nI bought the $5.99 special.As mentioned in a previous review the fries are nice and crunchy and salty.\n\nThe wings are the worst I have ever had. They were cold and they literally just threw sauce all over them, not to mention they were really small.", "author": "Romi J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-22", "description": "This review is for 3.5 stars. I've had Buffalo Boss three times - eaten in once, and had delivery twice. The first time, at the store front, I was really impressed with the food. I had the medium buffalo wing meal and the wings were amazing, and the fries were really good, too. Both times I ordered from the same location and delivery was really quick - contrary to some of the reviews... The issue with my last two experiences is that during each at least 2-3 (of the 8) wings were essentially non existent... Shriveled little wings - basically skin and the bone. I'll definitely eat from here another, though, and hope that it doesn't happen again because the wings are good.", "author": "Katarina D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Whenever I'm downtown Brooklyn I make a stop for the tasty mild wings and signature blue cheese at buffalo boss fast and friendly staff!!!!!", "author": "Gregory P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-28", "description": "Went during lunch peak hours so you would expect great quality wings instead of late night. Got the 6 wing combo with fries and a drink. The absolute worst wings I have ever had. Small, dry and on top of that barely any meat on the bone. HORRIBLE.", "author": "Tahrik F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-30", "description": "OMG just left this place. I had a craving for wings and it's the closest to the job. WOW is all I can say. You have 2 people standing behind the register and no one acknowledged me, then when I ask who do I order from Danalique you can't miss her, definitely  not the brightest crayon in the box looks at me like I'm the slow one and says her, as I'm ordering she's staring God knows at what, I told her my name for the order, spelled it out twice and she still misspelled it ummm... she didn't give me my cup for the drink and as I'm asking she gets on the phone completely disregards me , I'm lying, she can't multitask that's clearly it, more than 2 things at a time clearly presented a challenge. \n\nAnd the music, I thought I was at a club and the music choice, every other word was \"f*ck this, b*tch this\" lolol I SWEAR!!! No wonder it' has the reviews it does. You have very young, not too bright people working there.\n\nThe food, hmmm the fries were god, the chicken was the wrong flavor and dry and very chewy blahhh \n\nKennedy chicken is a 5 star spot compare to this place :-/", "author": "Paula M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-08", "description": "Don't come here if you're looking for a life changing wing experience. It's just chicken. \n\nStaff was extremely friendly and helpful. I was struggling with my sauce selection so the girl behind the counter offered to give me a sample. I ordered a six wing meal and she offered us two more wings for $1 more - I couldn't resist. \n\nGood value for average food.", "author": "Cassie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-23", "description": "Wings just aren't that good. I got the medium buffalo sauce and it tasted nothing like buffalo. The sauce was really sweet and tangy, which didn't suite my expectations considering the places name is Buffalo Boss. Service was good, and the wings came out faster than expected. Somewhat reasonably priced I would say, given its NYC.", "author": "Jake M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-27", "description": "I came in here at 2:26 p.m.  It is a bit confusing about which side you're supposed to order from.  I wanted the Buffalo wing and rice combo but the person didn't hear rice. She heard fries and I realized it way too late.  The 5 wings and fries combo 699 plus tax.  It took about ten minuets to get my order. I chose the  level of sauce hot which was describes as original Buffalo style but it seemed a bit hotter than your average sauce. \n\nThey give u 3 ketchup packets a few napkins and a fork in a plastic bag. They have extra napkins. They put food in paper and plastic bag. If concerned about environment given the sign about taking only the napkins you need, why give patrons who are eating in both a paper and plastic bag. Granted they didn't ask if I wanted to stay or go but again they should ask these things so they don't waste things like bags. I also did not receive any blue cheese or celery.  The French fires tasty like they had corn starch or something to give it that crispy exterior", "author": "Suresh D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-21", "description": "This place was the best when they opened their first store on Fulton street. The sauces were in point. The prices were great. Since they shut that down it went to the birds. All their hotter sauces are so peppered down they're horrible. The wings are so small you could just stare and laugh at them. They also raised the prices I guess because they have a spot downtown and the Barclay center so I'm sure the rent is higher. Totally not worth the price. I will miss the original OMG wings form the original Boss. Probably the best wings I ever had.", "author": "Paulie X K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-03", "description": "To Owners: Jamar White \u0026 Ron Lee\n\nNot unlike many of the other reviews on here, my experience with this establishment has overall been TERRIBLE.  I really liked the wings so I began ordering from here whenever I wanted wings.  The problems began immediately. Each time I have ordered delivery, the food has been short on the number of wings I ordered, or missing another menu item that I ordered.  But still I kept ordering because I liked their wings and wanted to support the business.\n\nHowever, after my most recent encounter I will never spend money here again!  A few days ago, I placed an order for delivery at 9pm.  I waited for one and half hours and the food had not yet arrive so I called to check the status.  Although I was told that it was almost ready and waiting for the driver to return, I could tell that my order had not even been started.\n\nAfter another hour passed, I called back to find out when the food would arrive.  I asked to speak with the manager after being told my food had only just left the store (it would have a total 3 HOUR wait). The manager (Cecilia) that I spoke with began to tell me that the delivery driver went to the store to buy more french fries because they ran out. Rather than apologizing for the delay and offering a discount, free item or some other form of actual customer service, she became verbally combative and spoke with attitude as if I was bothering her.  She then barked \"well what do you want me to do about it?\"  Before I could even process how out-of-line she was being, she abruptly said that she would just cancel my order and tell the delivery driver not to deliver my food.\n\nI have never experienced such disgusting behavior; especially from an establishment where I am choosing to spend my money on such a fungible item like wings.  I was excited to be able to patronize a minority owned establishment but I was so put off by her behavior that I refuse to spend money here ever again. \n\nAlthough Wingstop and Buffalo Wild Wings don't deliver, they have a larger selection and 100x better customer service.", "author": "Devon S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-29", "description": "I've ordered from here 3 times and each time the delivery wait time increases.  The first time was about an hour and 15 minute wait (too long).  The 3rd time I ordered, I called to check on the status after an hour and a half.  They told me it was \"out for delivery\".  I got my food an hour and 15 minutes after that.  To their credit, it was hot (so no chance it was out for delivery when I called).  \n\nThe wings are good, not great but good.  Certainly not 3 hour wait good!  Do yourself a favor and find somewhere else to order from.  I won't be ordering again.", "author": "Matthew A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-03", "description": "Had 2 chicken strips bathed in 2 different sauces, the BBQ and garlic ones.\n\nBoth were really good. The garlic didn't need as much coating, but it still tasted good.\n\nThe fries were really good!\n\nHad that really good crunch and taste you like in your fries\n\nIt sucks they don't have any other sauces, other than the ones they put on your chicken, except ketchup! And even that is only available in packets..", "author": "John K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "CHICKEN TENDERS ARE AMAZING! I told my co-workers to order from there, and they fell in love! The best chicken tenders of life! The crispy fries are also amazing. Worth the try for the tenders. \n\ndownside - they don't give a lot of ketchup. BUT, they offer you a sauce, I got blazin' bbq, and it was seriously hot. fire. I love heat, but wooh, super hot.  \nagain ... tenders, bomb.", "author": "Adila K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Buffalo Boss was a pleasant surprise and can be stumbled across if you're in the Boerum Hill/Downtown Brooklyn area. The chicken was good. I'd recommend calling in your order prior to going to pick it up. Also, very few tables as this is a grab and go type of place", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-31", "description": "Another new food destination in the heart of Downtown Brooklyn, but sadly it's been nothing but slow and poor quality at Buffalo Boss.\n\nMy co-worker warned me that the wait for food would take a long time. I went around 1PM on a Friday afternoon, thinking the wait wouldn't be long or bad at all. \n\nThe line to order and pay for the food moved quick, but the line to wait for your food is another story. Customers that ordered their food in advanced by phone and in-person waited forever and was asking for refunds on their food and etc. The amount of time that I waited for sweet potato fries was horrendous! I waited at most 20 minutes for the damn sweet potato fries. I thought if I waited this long, it better be damn good, but far from it.\n\nAfter I got back to my office, the sweet potato fries were hot and steamy, but soggy! Oh gosh. I was hoping it would be sweet, crunchy, and crispy, but SOGGY? Seriously?\n\nBuffalo Boss is a new establishment and you would expect they would shine with their food, but they seriously need to step up their \"A\" game.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "The only thing I came here looking for was Blue Cheese, after my horrible experience at the nearby Papa John's a few weeks back. The blue cheese was absolutely spectacular when paired with 2Bros Pizza. I would definitely come back again for their blue cheese sauce; it is phenomenal.", "author": "Timöthy H."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Buffalo Boss", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "400 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C2FGmcBxFrwc5paHhLw-MA/ls.jpg", "@type": "Restaurant", "telephone": "+17189230800"}