{"aggregateRating": {"reviewCount": 148, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "This is the second time we order from this place. The wings are cooked well and the hot sauces are on point. They are pretty quick and very friendly. All out questions were answered with no hesitation or attitude. I would recommend for a gathering or social event.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-15", "description": "No,  just no.... This place is serving some grade D meat(?). The only reason it's surviving is because of the stadium.  Pricing as usual is way over what it should be, Service is mediocre,  and the variety of options are limited.  I'd keep walking if I was at or near the location.", "author": "Anonymous T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "We ordered from them and loved it! The delivery time exceeded the estimated time and the food was delicious and exactly what we wanted. We will definitely order from them again.", "author": "Rhonda D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-05", "description": "The wings are very poor quality. The sauce selection is decent, but wasted on horrible wings. The service is truly why i give one star. Horrible employees are extremely un-welcoming and rude. They treat you as if you are a major annoyance, and when i had to wait over 20 minutes for a small order, i asked the woman at the counter what was taking so long. She simply rolled her eyes and turned around and picked up a bag and just handed it to me.... IT HAD BEEN SITTING RIGHT NEXT TO HER.. Do not waste your time or money.", "author": "Rick B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "I really do like this place.  It is very small, but I usually get it to go so it's not an issue.  I do like their wings and have nothing but good to say about it.  I have eaten their several times and the food is always fresh and hot and the order has always been correct.  I will repeat often.", "author": "Tim B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-09", "description": "This place is super tiny so it's only good for pick up . They have a few good lunch specials like 5 wings and fries and drink for 6.99. But the wings suck !!! They're small and not that flavorful. I had sweet potato fries also and they were so soggy and tasteless. I wouldn't go back.", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-23", "description": "Worst wings in bk. service to wings. Wings were sooo dry and asking for blue cheese she tried charging me.  Handled trash receptacle with bare hands. Gross. Had to get wings somewhere else just for principle", "author": "Alan D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-11", "description": "This was the worst buffalo wings I'd ever had period...plus they forgot my fries and extra blue cheese on top of that it was $35", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-09", "description": "The fries are pretty legit.  The wings are aight for the price.   They definitely left me wanting more. If I'm paying $16 for my lunch, I hope to be blown away.  I think Hill Country Chicken just down the street would be a better bet at this price point.", "author": "Forrest C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-21", "description": "Horrible service, do not order delivery, takes forever and when you call they say your order left 5 minutes ago. I ordered 12 wings, took 2 hours for delivery.", "author": "Asif L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-07", "description": "I had high hopes for this place when my sister in law was visiting and wanted wings close by. We ordered a 12 wings and chicken tenders. The wings were only edible because they were doused in sauce. The sauce was okay. We had the chicken tenders as well. We had them cooked twice because the first batch was over cooked and burnt. The woman at the desk asked if I wanted them fresh. Of course I did. Isn't that the standard for food? I was very disappointed! Each part of the meal was more depressing than the last.", "author": "Malinda S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-01", "description": "Much better experience! Service was a bit slow but friendly. I accidentally ordered from the wrong location for pickup but they were very accommodating and prepared a new order for me for pickup at this location. I always get the 6 honey BBQ wings with the 2 extra wings for a dollar and the Bleu cheese sauce and it is a solid choice! Their Bleu cheese has a nice twist to it and goes perfectly with the sweet and savory wings. I will be back!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-07", "description": "I ordered honey BBQ boneless.  The chicken has Noooo flavor.  The BBQ sauce was all you tasted and after eating a few bites, I felt like the residue was making the underside of my tongue gummy. The same feeling you get when peanut butter sticks to your mouth. It was gross so I threw out the rest. I was so disappointed. :(", "author": "Johanna J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Chicken wings with bones are fried very well ... The French fries are so crispy and delicious ... Fried Oreo yum yum . Be patient for wing preparation time ..", "author": "Keisha H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-29", "description": "The boneless wings are not very good. I ordered a 12 piece and did not finish them because of this. I also went during a lunch rush and the place was very understaffed. I know that falls more on the MGMT than on the employees working that day though. Overall I don't recommend this place. Seek a better option.", "author": "Chester C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-02", "description": "I am happy to be the first reviewer. \n\nMy office is down the street. I have anticipated the opening of this place since I first saw the sign a couple of months back. I was really hoping this would be a homerun wings place. \n\nI think today was their first day open for business. Everyone behind the counter is super nice, which is not that common in this area. When I first walked in I saw that there were a handful of people waiting. They were quick to take my order. A few minutes later a super rush had started and it got really quick and crowded, really fast. \n\nI ordered the 6 Wings Combo which comes with fries and a drink. Portions are definitely on the smaller side. With tax it came out to $8 and change. It took about 20 minutes to get the order. You could tell because it is their first day they are still working out the kinks and still in the process of getting into their rhythm.  \n\nI might go back, but not for awhile. If and when I do go back I hope they are faster as I would love to leave a better review.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-24", "description": "Great food .. Good delivery service but lines move slow in the store.. It's much better for delivery service than walk in to enjoy your food ..", "author": "Brenda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-26", "description": "Wings are ok, not great. The counter person was polite. Would definitely not stay there to eat.  get take out.  It's a pretty dirty area being right at the subway entrance.", "author": "K C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "I am craving this place so badly right now. Their wings are amazing, as well as the fries and that blue cheese is so delicious! Omg!", "author": "Djenne G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-04", "description": "Big, well-cooked chicken fingers (4 is a lot of food for one person). The \"hot\" sauce was pretty crappy. There was not much of it on the fingers and the vinegar aspect of the sauce dominated the flavor.", "author": "Christopher R."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Buffalo Boss", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "400 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C2FGmcBxFrwc5paHhLw-MA/ls.jpg", "@type": "Restaurant", "telephone": "+17189230800"}