{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "We stumbled upon this place walking around the neighborhood, and wow, we were so sorry we had not discovered it sooner. It has a relaxed and chic feel to it, we sat comfortably at the bar and enjoyed great conversation with the staff. \n\nBut it was the drinks that were the winners, they were crafted with care and the staff really offered unique selections. We asked for a gin drink, and the bartender made us a creation he had recently came up with. It. Was. Stellar. \n\nAdditionally, the food was amazing - surprisingly good seafood and oysters. This place is worth the time out of your day - stop reading this review and head on over there!", "author": "Jesse M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "I really wanted to like this place. The outside was super cute and I love the idea of having seafood around the area! Unfortunately, this was a major disappointment and the only thing I would suggest getting here are their cocktails (but it's so expensive).\n\nOverall, everything is way too overpriced for what it is and it didn't taste amazing. I also came here for brunch and I really wish they had a brunch menu instead of just a set menu that's for brunch and dinner. And everything on the menu was basically just super overpriced and not special tapas (sorry :( but that's literally how I feel).\n\nI made a reservation at 2 pm (the time they open) and I we actually the first customer to walk in. I get seated but my chair has crumbs.. I kid you not, they did not do a good job cleaning. There were crumbs that were obviously either from last night or the staff's breakfast, just on the chair.. uh.. not super amazed. The hostess was nice and apologized since she saw me wiping the crumbs off of the chair. \n\nI ordered drinks and food with my friends and errr everything is so overpriced and not that yummy. The shrimp cocktail itself was $12 and it came with 6 shrimps and they weren't good... then there was maybe 3-4 strands of asparagus for $13 (wow...) and the steak tartare for $18 that was not delicious (yikes sorry). The deviled eggs were whatever because.. they're eggs, if this was also awful, I'd be extremely upset.\n\nI am only giving this review a 2 stars because of the cocktails. I honestly want to give it one star but I think the drinks were pretty good overall. I still don't think the cocktails are worth what it is and I also have to say that their happy hour menu is not really happy hour... $1 off of beer and wine. That's, wow. Not even your cocktails and just $1 off? Not enticing at all. Would not come back and would not recommend ever again unfortunately. And that actually brings me to 1 star just thinking about this happy hour rule and how overpriced everything is for what it is.", "author": "Suki W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-11", "description": "The food/drinks were good, the service was HORRIBLE! Since we got there our waitress (Christen) had an attitude, also she dropped the Tabasco sauce all over my friend's pants, we ordered a bottle of wine and dropped it in the middle of our table hitting/breaking a candle, dropped the wine all over us and food was all covered with tiny pieces of glass, she didn't even apologized, the manager came replaced our food, otherwise the drinks are really good, we ended up leaving the place because we all felt uncomfortable with the bad looks/attitudes. \nWhen we got the check, we were charged for the full amount. If I'm in charge of a restaurant and the waitress drop a dipping plate of tabasco sauce on one of my costumers, then dropped a glass of wine on another costume, the LEAST I can do is give a compensation as an apology.\nTOO BAD, looked like it was a great place.... won't be back!!", "author": "Ana L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-07", "description": "Everything one can possibly loathe about Brooklyn in one grossly pretentious hipster self hatred den.  \n\n1. I asked for a men's room and was sarcastically told that the UNISEX bathroom was in front of me \n2. Place famous for oysters but OUT of not one ...not two...but THREE out of six oyster selections.\n3. We eat oysters with saltines...we bring our own to all restaurants on this planet and have never heard an I'll word..from a single restaurant...ever!  at this pretentious shit hole...we were told that the oysters don't come served with crackers and to put them away..and were literally not allowed to eat their fishy oysters the way we enjoy them.  \n4. No horseradish or cocktail or Tabasco ...only \"tinctures\" hahaha wow ...pretentious much!?!? Carrot \"tincture\" for an oyster !!? For real? Can you over complicate things more ?\n\nAll this plus dumb insanely loud music ...ants (YES ANTS) ...and awful pretentiously complex and overly sweet cocktails makes this place a keep-away-from ...by anyone with self awareness outside the ages of 28-35.\n\nNever come back ...", "author": "Gary L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-29", "description": "Seems like this tries to be a neighborhood spot but with big city menu and prices. With a mainly seafood menu and an intensive cocktail list, it's easy to over order. Unfortunately while many of the items were delicious, the small portion sizes made it an unsatisfying dinner \nMost of the \"entrees\" were over $25 and seemed more like tapas. I still want to come back the happy hour specials like dollar oysters at the raw bar but maybe not for dinner again ⁣⁣", "author": "Janet H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "OMG the happy hour oysters are AMAZING!! This place is so chill. Only minor problem is that during happy hour the service is a bit slow, but the deliciousness of the oysters make up for it.", "author": "Yanqi W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-05", "description": "Grand Army would be the perfect location for a go-to restaurant/bar for me, as I live a mere two blocks away. Unfortunately I cannot justify coming here often, as there is a lack of bang relative to the amount of bucks one has to drop during an ordinary outing here.\n\nPro: the charcuterie board is delicious.  Consisting of four unique items such as octopus terrine, trout rillette, and others, the flavors are excellent and nicely contrast one another.\n\nCon: above-mentioned board, while only an appetizer, is nearly $30 and really leaves you craving more food for that dollar mark.\n\n\nPro: dollar oysters at happy hour, woo! One night the oysters were even Wellfleets, which are reliable.\n\nCon: the most recent time I had said oysters, they tasted fishy and quite slimy. Yuck.\n\n\nPro: lovely decor and overall cool space, on a beautiful street. I do love when my girlfriend and I can snag a seat at the front window when it's light out.\n\nCon: the place gets absolutely jammed to the point where I simply wouldn't dare test my anxiety levels by walking in. Also, being on State St results in elevated price points across the menu.\n\nSo overall I have mixed feelings about Grand Army. There are parts of it that I love (the bread and butter appetizer is actually outstanding), but certain aspects keep me walking past far more often than not.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-10", "description": "I have been here for both brunch and happy hour. Think this spot is more worthit for happy hour special ($1 oysters) \u0026 nice cocktail service. Added plus, on a blistering cold winter night they had their fireplace going. Love the ambiance albeit it can get loud.", "author": "Marianne D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-10", "description": "I love this place for the oyster happy hour. One dollar delicious oysters - always fresh. The shrimp cocktail and the deviled eggs (topped with crab and crunchy stuffl) are the bomb too. But it is small bar and really loud. I mean loud. Though the bartenders tonight tolerated my annoying friends - smiles on their faces and all - so polite. Extra thank you to those guys.", "author": "D P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "I have been to Grand Army a couple of times now, which is no surprise considering I live a block away. The decor is very hipster chic and easy on the eyes, with fun posters and random collections of trinkets occupying various corners. The staff is friendly and attentive. Food menu is not very long, but changes periodically. The cocktails and oysters are the real stars here.\n\nDaily Happy Hour is all about the $1 oysters - one type of oyster will be marked down from about $3.50 to $1, which obviously is a much better deal. I love the unique flavor infusions that come with the oysters, like taco and smoked cucumber. The drink deals during the happy hour are really nothing to write home about - just $1 off all glasses of wine and draft beers.\n\nTruth be told, the food prices are a bit high for the tiny portion size. However, I do feel like the quality is there, which leaves me feeling slightly better when signing the check. The seafood charcuterie board is a favorite of mine, mostly for the smoked trout spread (which I swore to my boyfriend I would attempt to replicate at home) and the shrimp sausage.\n\nThere's no doubt in my mind that I am on my way to becoming a Grand Army regular. Can't wait to see this place in the winter with their cozy little fireplace going.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-14", "description": "Amazing cocktails! Grate personal and delicious oysters!!!\nWe made an reservation for Valentine's Day and we are highly satisfied! Totally recommended !!)))", "author": "Olha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-13", "description": "Every visit is a pleasure. This is by far the best happy hour in the area. No rowdy 20 somethings here. This hip mix/ oyster bar is a gem with its seasonal selections. A little pricey but you get what you pay for. Seating can be tight and if you want a table at peak time it will not be easy. Recommend this stop for drinks and appetizers before heading out to BAM or into the city for a night on the town. They need to extend their happy hour oysters till later in the evening.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "If I lived in the neighborhood, this would 1000% be my go-to spot. Happy hour oysters + good cocktails + extensive menu for brunch AND dinner + cute atmosphere means this place checks all the boxes. It even has a fireplace in the winter to create some cozy vibes that are a must for me this time of year. \n\nThis place is known for its oysters that come with a set of droppers with unique sauces to put on top. Honestly I am a fan of just keeping it simple and sticking with lemon but I totally appreciate the appeal and thought it was really fun!\n\nFor food, I have had the mussels twice and they are my absolute favorite. They are always really big and juicy mussels and come in this fantastic spicy coconut sauce. It was a really big portion as well so I recommend you share. \n\nThe cocktails are also phenomenal. They offer a daily \"bosses cabinet\" for $12 which has never let me down. Most recently it was a mezcal negroni, combing two of my favorite things into one - #blessed.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-21", "description": "Pretty good atmosphere, crowded but cozy and intimate setting. Good place for a date, but expect smallish portions and highish prices.\n\nI shared a dozen oysters, my favorite part were the different sauces which come in little droplet vials which allows for great precision when applying to your oysters. \n\nAlso shared the \"seafood charcuterie.\" which was alright. the best thing in there by far was the smoked trout dip. Other items has somewhat strange texture. Small portions. \n\nOverall, good intimate setting. Somewhat pricey and small portions.", "author": "George T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-20", "description": "Excellent service, cocktails and dollar oysters for happy hour in a boisterous Boerum Hill Brooklyn Bar.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-25", "description": "This may be the coolest place in Downtown Brooklyn. If you were fans of Prime Meats on Court St, then you will love this place. Damon Bolte was the bar manager at Prime, and he created a super cool spot to dine and drink on State St. They have a raw bar, beer on tap, wines by the glass and a delicious menu. I've been there three times, and I plan to visit more often.", "author": "Randall M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-04", "description": "Went here expecting to eat dinner and turned out to be more light apps and cocktails than I thought. The menu online did not match menu at restaraunt. I hate when that happens because I plan what I want to eat, and then my plans are all messed up! \n \nThe food is good don't get me wrong but its just not a satisifying dinner. We had the bread and butter which was amazing, great tasting bread and the seasoned butters it came with had great flavor as well. Then we had the seafood charcuterie. All seafood no meat like the name, but they smoked the compilation of fishes to taste like meat and even put shrimp in a casing like sausage. Very good again, but not filling at all and expensive. We ordered the goat cheese brulee which took the longest to come out for some reason, and was legit just a huge wedge of goat cheese carmelized on top. Tasted very good though but way too much cheese since they only gave us 2 bread crisps to eat it with. We had to ask for more bread. So mostly our dinner consisted of bread. \n\nSaw a lot of people ordering oysters and they do have a happy hour where the ones from Virginia are 1 dollar a piece. We are not oyster eaters though. We wanted to try something we saw on thier online menu that's why we went there and then they didn't have it... \n\nCocktails are every good. A lot are very smokey. \n\nReally cute environment too, very nice and relaxing. They play heavy metal music which is an interesting juxtaposition to their light menu and pretty decor.", "author": "Marisa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "I was craving oysters and found this place via Yelp. Who knew that the presentation of oysters could be so well thought out? My goodness, the little bottles of flavor to sample from were AMAZING - I enjoyed the habanero the most, and loved that it was in the form of a dropper. The shrimp cocktail was also divine and I had two of the party people cocktail. \n\nYou'll find super attentive bartenders here, and really really good seafood apps. It does get a little noisy though, but you won't notice after a cocktail (or two) and an oyster (or six).", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "Came for a birthday dinner with friends since claw daddy's was packed. It was awesome. From the oysters to the cocktails", "author": "Jody-Ann C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-24", "description": "From now on I want all my oyster mignonettes served in tiny medicine droppers. Fully functional and totes cool. This place is your quintessential Brooklyn neighborhood bar. Really tiny but welcoming. \n\nBetween the music and the conversation it was really loud for my taste, but glad I went. I threw caution to the wind and asked the bartender to surprise me with a bourbon and he didn't disappoint!", "author": "Alison D."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Grand Army", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "336 State St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/m68a_lC0uSyYONJGz58Zzw/ls.jpg", "@type": "Restaurant", "telephone": "+17186431503"}