{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-18", "description": "Sitting here for 15 minutes felt like sitting in the middle of a campfire. Poorly ventilated, couldn't even enjoy my cocktail.", "author": "R J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "Update: we went back for the oyster happy hour, which was fantastic. Oysters a bit small, but at $1 each, can't complain too much. They labeled the sauces, very helpful. Cocktails were fantastic and the veggie plate was noticeably better. Still wouldn't recommend this place for a full dinner, but definitely adding this to our happy hour rotation.", "author": "Christina C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-30", "description": "Walked by this spot Wednesday night, and decided to come in for a beer.... Upon entering, I was impressed with the ambiance and decor. Simple, yet elegant. We sat down mid bar right next to the drink service station, without any welcome, or menu's dropped or offered.. Bartender was just staring off into space instead of being attentive to new customers walking in looking to patronize their business. I approached the bartender for menu's. My date and I ordered beers; and after 5 minutes the server comes back and tells us they had to replace one of the kegs and that it'll be another \"40 seconds\" for the line to pressurize. Another 8 minutes passed. We watched the drinks for 5 minutes next to us ready to be brought 1 foot over to our area while the server was socializing and laughing with other staff. The drinks were not even served to us properly, the server, Mark, reached the beers over the bar into our hands instead of onto the table. The waiter made sporadic appearances which made it frustrating and difficult to order more drinks, so we then again had to wait for him to come back when we wanted to look for our check, and then 10 minutes for him to come back around to pay our bill. Another thing, when it's cold and raining, blasting the AC on your customers who are sitting near the oysters is not fun and it made me wanna leave ASAP. The icing on the cake is as we were leaving the clumsy server, Mark knocked over a bar stool onto another customer who was leaving. I just felt like nothing was right. Not going back.", "author": "Joshua G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-27", "description": "You see all those nice bottles of liquor in the cabinet behind the bar? Those aren't for sale. Display only. You can order the crappy stuff if you'd like though. As long as it doesn't come from the cabinet full of private stock liquor *on display* in plain view behind the bar of a drinking establishment.\n\nOr maybe you want a beer from their beer list? Well, they don't have it, sorry.\n\nTo make up for it, they'll put your drinks on other people's tabs and other people's drinks on your tab. When they weren't mixing up tabs, the bar staff was inattentive and unhelpful. The owner seemed to be entertaining a group of bro friends, meaning the bar's patrons were crowded out. \n\nThis place seems like a great hangout spot, if you happen to be the person who owns this bar.\n\nFor real: this place needs to shape up fast or it isn't going to last a year.", "author": "Mark L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "Oyster happy hour was perfect. Great tasting oysters, great service, good drinks etc. That bread tho.... had high hopes for carb overload but it was kinda cold and hard. Butter almost made up for it... But didn't.", "author": "Sasha V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-16", "description": "Went with my brother on opening weekend. \n\nThe oysters were actually pretty good, but the toasts were *terrible*. As in, not toasted and covered in various things that just tasted bad. Our cocktails were oversweet and not that great. \n\nI switched from cocktails to a dry sparkling white, which was pretty good. There's hope, but they definitely need to figure some things out.", "author": "S B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "We are big fans of this place, especially as a weekend lunchtime stop for a bite and wine. The staff is always nice and the music in particular is top notch.", "author": "Mark C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Best bar/dining experience I've had in a long time. For the yelpers complaining that this is a 'hipster' spot, there are plenty of boring spots in midtown where you would probably feel more comfortable. Cool staff, well thought out bites (I had the mushroom salad/bread + butter/pork tenderloin), great ambiance/music, and bartenders who can make you a perfect drink based on spirit preference. Wish we lived closer.", "author": "M. S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "Glad there is another bar in downtown Brooklyn. This place is really cute and has decent cocktails. Our server kept coming back to ask if we were ordering food besides happy hour $1 oysters. When we placed the order for the food, it didn't come until 45 minutes later. So... take that for what it's worth.", "author": "Jane P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "This review is just for the bar at Grand Army. The female bartender was friendly and knew her drinks. We enjoyed a nice vodka gimlet, one of the signature cocktails, and a refreshing glass of prosecco. The atmosphere was lively and the decor has nice details like a vintage bar from upstate New York. We didn't try any of the food this time. I look forward to seeing how it grows into the space.", "author": "Jayne H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-01", "description": "Decided to go here for brunch because my BF read a review that said Grand Army was one of the best new brunch spots. Huh! Don't believe everything you read! First of all, it's a very small menu of non-typical brunch items.  I had trouble selecting, but finally decided on scrambled eggs and salmon.  10 minutes later I was told the salmon wasn't ready yet. So I had to reselect from the sparse menu. I chose a bacon, egg and cheese. Totally basic, hard to screw up.  My boyfriend's food came out first. Clam chowder was good and he also had the lobster toast. Tasty as well, but not worth the steep $17 price tag.  My sandwich came after, due to the fact that I had to reselect.  \nPretty basic BEC except the eggs were freezing cold.  They had obviously been pre-cooked in a square mold (ala McDonalds) but not reheated properly.  They took it back and cooked a new one, which, by the time it arrived, I was already full from sharing my BF's food. They comped the BEC, as well they should have. But, it couldn't save the added insult to injury. \nYou can get freshly made BEC at any deli for half the price.  Skip this place, it's not worth the money.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Excellent cocktails and dollar oysters for happy hour. The food is delicious but a bit pricey.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-27", "description": "The oysters and drinks are great, but the service could use some ironing out. I have been to Grand Army five times since it has opened, and each time I waited at least 10 minutes before being seated. I always have to ask multiple people if there is a host, and when trying to seat myself have been asked to move. Once we figure out how to get seated, the service and food have been delicious, but the initial introduction always sets a weird mood. I know it's a new place, so I hope this gets sorted out soon.", "author": "V P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-05", "description": "Food and drinks were good but severely overpriced. We left and picked up a pizza pie to put something substantial in our stomachs after a pretty big check at Grand Army. Would not come back for food.", "author": "Nikki C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-23", "description": "We came here with another couple for dinner. The food at least 4 stars - the oysters were fantastic, the scallop was great, the shrimp was great, everything was very fresh. However, it is very expensive for what it is; perhaps it's those inexplicably high Boerum Hill rent prices being passed on to the customer? These small plates have gone too far. A bocquerones crostini order had 5 bocquerones but only one piece of bread -- perhaps it should be called crostino, since there are no multiple crostini? It's also pretty crappy to try to split one tiny crostino with 4 people. Oh, and this is a place that charges people for bread and butter. Granted, it was nice bread and butter, but still.\n\nThe service is why  I am giving this place 3 stars. It was SLOW. Bringing the wine list took 10 minutes, bringing food took forever. The order in which things were brought made no sense, and we were only able to order a second bottle of wine after we had almost finished our food.\n\nAfter ordering what seemed like many pricey small plates, we were all still kind of hungry, but there are no desserts on offer.\n\nI might come here for a drink, but not for a full dinner.", "author": "Jane S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-20", "description": "Most reviews are spot on, this place needs to step it up. With all the great people involved our expectations were definitely high but the food is so average to low average even.  Octopus and cured meats were below average. I tried a few other things as well and nothing caught my attention. I had the homemade gin martini it was ok.  ON the Plus side, it had a fun city vibe about it. I'd go back for drinks but let's the grub together fellas!  We are counting on you and you have the goods and we know it!\n\nI know, it's process and it'll all be great by september!", "author": "jay b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "This one of the top spots in all of Brooklyn.  Drinks are top quality and the service is excellent.  The decor of this place is perfect the art work on the walls the fireplace all add up to make this place special.  One of Brooklyn's best.", "author": "Justin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "Perfect in every way. Cocktails over deliver. Hosts/staff (and you can't tell the difference) make eye contact and ensure you feel welcome.", "author": "Kathleen L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-14", "description": "The space is great but nothing else works.. Our waiter asked to read the menu from us every time we asked him a question about a dish.  Food was HORRIBLE.. And I do not use that word often when eating out in New York.  Also the acoustics were not thought out at all in planning the space. At times it was so loud that we sat silently rather than try to yell at each other over the volume.  Very disappointed expected much more from this team.  Unacceptable service and food quality..not sure who is running the place..", "author": "J C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-08", "description": "I made a reservation at Grand Army for Chinese New Year as my gal was sad to be away from her family over the holidays and it is custom to eat fish on Lunar New Year's Eve.  I really hoped to make the occasion special even if we were to spend it on our own.  When we arrived at Grand Army, we saw a sign on the door indicating the restaurant was closed for a staff party.  Given the circumstances, my gal was devastated.  Although Grand Army was one of our regular places, I don't see us going back anytime soon.", "author": "A M."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Grand Army", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "336 State St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/m68a_lC0uSyYONJGz58Zzw/ls.jpg", "@type": "Restaurant", "telephone": "+17186431503"}