{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "Amazing cocktail den with bartenders choice that never fails. The baby octopus is delicious!", "author": "Victoria L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "I was excited to score happy hour here. The mussels are very fresh, and the various flavors to add are very interesting, such as pastrami and rum, my two favorites.\n\n I was kind of surprised by how loud the bar was, and it was hard to hear my 3 friends speaking, but talking louder is totally doable. \n\nThe beer list is nicely curated, and it included some big names such as The Alchemist and Stillwater. I did find that the draft for pours were pretty small for the price, though. \n\nI rarely mention this unless it's very noticeable, but I was very surprised by how unwelcome I felt by our waitress. It seemed like we were annoying her since we didn't know exactly what we wanted to order right away. She also didn't ask how things were - something you only notice when you're not asked. Note that it was not a particularly busy day either. Unfortunately, it's often the little things that stick out.", "author": "Jess L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "This place is a really great cocktail bar. The entire aesthetic is cozy, warm, and very inviting. Between the books stacked on the shelves and the flickering candles, the atmosphere is on point.\n\nI went during the springtime (on purpose) so I could enjoy the Gilmore Girls themed cocktails. Personally, I reaaally enjoyed The Glass Chimney, which threw out respect to the Pilot episode and had some nice smoky mezcal. \n\nThe happy hour oysters were fun too. They throw in five different pipettes with different flavors to add to your oysters - habanero, pastrami, and bamboo to name a few. \n\nI would also highly recommend the gnocchi. Awesome spring flavors going on there. \n\nWe would have ordered more, but unfortunately, the staff was way too busy. They genuinely were super pleasant, so I won't hold it against them. BUT be prepared for some slow service.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-13", "description": "How do you screw up deviled eggs? These were bland and lacking in any flavor. And the Taglietelle -- looked so delicious, but tasted like a salt lick. Had to send it back. The steak tartare was just ok. Though my friend said her Bass was delicious (albeit teeny tiny portion wise). That's all.", "author": "Brandy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "Great and unique ambiance. My gf were able to get a table during peak hours. Food was about average. We tried a few different things from the menu but nothing that wowed us. This is the place you can bring friends or dates.", "author": "Hugo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "This review is for the bar only.  \n\nI was meeting a friend of a friend here last night, which made me happy because this place was on my list.  It was a really cute interior, it smelled SALTY and like the ocean - so if you don't love seafood, don't come. That sad, I LOVE seafood so game on.  We sat by the oyster ice area (I'm sure there is a name for this). The staff was very cool and got us seated and was friendly etc etc.  The cocktails were all fun (should be for $12+) and it was a nice little place to hang out.  I really wanted to try some food, but we were going to dinner after and $3+ for oysters is a bit much.  I may be a spoiled snob with a Mainer boyfriend, but none of the ones they had listed seemed worth it. NOW I'd come in for the $1 happy hour anytime, and if they had some from PEI or Maine I might have jumped for $3.  \n\nOther than that, all the food looked good.  It struck me as more of a date spot than a friend group spot, so good to know.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "Ah, Grand Army. I live a block away, and I've been inside your gorgeous space five or six times now, and I still don't know how to articulate how I feel in an overarching sense. So I'm going to do that thing where people break up the review into its main components, mostly because the elements of this bar are pretty disparate. If you don't want to listen to me babble on and on, there's a TL; DR at the end. \n\nCocktails.\n\nLet's start with the good. Your cocktails are uniformly excellent. I've ordered off the menu, I've ordered off-menu, and I've never been sad. There's no vodka-shaming when my wife wants a martini, and even when you incorporate ingredients I'm not necessarily fond of, the overall effect has been balanced and quite tasty. The Bosses' Cabinet in particular has always been a good decision, especially since it's a rotating cocktail that is always a slightly more affordable $11 (to the standard $13). \n\nI would love to complain about that pricing in general, but that's pretty much just what good cocktails cost these days. Do I wish they were more affordable, so that I could be a regular? Of course. Do I wonder who could pay that much for cocktails regularly? Yes. But then again, you're on the same block as $4.5 million townhouses...and I'm betting whoever lives there can handle it.\n\nFood.\n\nThe oysters have always been fresh, and when you come in for happy hour, $1 apiece is a welcome price point. (Actually paying MP? I'm not going to do that because I futilely dream of one day having one of those townhouses.) Some may find it too cutesy, but I actually appreciate the eyedroppers of different sauces; I like the variety of a little bit of jerk on this one, a little bit of ponzu on that one, or the standard mignonette or cocktail sauce...all in exact amounts that I decide. I do usually go sans sauce with fresh oysters anyway, but options are nice.\n\nUnfortunately, none of the other food particularly appeals to me. I've tried a few of the \"larger\" plates, some of the raw bar, and I've had all the breads (formerly known as the fancy toasts), and I didn't find any to be worth revisiting. They tend to be prettier than they are tasty, and that kills me. I was sure I'd love the breads, too, as with such a small menu you expect them to be carefully curated, but it hasn't happened yet. Perhaps their food is just not my style, but living so close I wish it was. \n\nService.\n\nUneven. My bearded bartender friend, I believe his name is Damon, is great. He's generally friendly, obviously well-versed in the art of booze, and he's a pleasure to watch. No wasted motion in his game.* Unfortunately, some of the table service has ranged from just fine to inexplicably rude to painfully awkward (twice I've seen a teenager working, and he dropped silverware and flushed/cringed so hard I hurt for him). It's also a bummer when I come by for a nightcap an hour before they ostensibly close, and I'm turned away. I understand that folks are just trying to get home though, and I suppose I can save some money and drink my own booze. But my cocktails (usually consisting of liquor and ice) aren't nearly as tasty.\n\nAll in all, I will continue to come back for oysters and cocktails. And I'll keep trying the food as well, because I want to update this review. I want to be a regular. I want to love Grand Army. And I hope it happens. \n\nTL; DR: The food is overpriced and underwhelming, the service is uneven, but the cocktails are excellent and worth the trip.\n______________\n\n*There was also a day I came in that he was grinning ear to ear, and let me know that his 1st grade teacher had just walked in. Which is awesome.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "This place is truly a hidden gem, and so underrated! I probably passed by it many times - there is no sign outside.\nBut somehow, my partner in crime found it in search for fresh oysters, and here we were, enjoying their happy hour for drinks and oysters.\n\n4 kinds of east coast oysters were available for happy hour special ($1 each), but we also could not resist Kusshi from BC. All were fresh, and Kushi was so tender and so good! (yeah, we reordered *few* more times, could not stop!)\n\nOther items on menu are worth trying, of course - grilled octopus with celeriac \u0026 celery oil was tender and perfectly cooked; and \"Surryano\" Ham is nice charcuterie dish to nibble on.\nThey also have pretty extensive drinks menu - I had Little Blue, and liked it a lot. Served in frozen metal blue mug, it's bourbon-based drink with a little bit absinthe, and minty aftertaste.\n\nAtmosphere here is relaxing, it's down-to-earth bar. Staff is super-helpful and very, very nice.\nEverything came on time, no delays in food or drinks - which was muchly appreciated since we had to go to the theater after this little adventure. Even check arrived in seconds after we asked for it.\n\nI enjoyed it a lot, definitely will come back for Happy Hour!", "author": "Nadia Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-24", "description": "We live right next door, and so wanted to fall in love with this place! We have been half a dozen times. The cocktails are nice but overpriced, same thing with the food, small portions and insanely overpriced! It's a cool/hipster bar scene but it's just way too expensive for what could have a neighborhood gem. \nBartenders are also curt. They have an overboard hipster/snooty vibe.", "author": "Dee L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Really delicious seafood and share plates. Went one evening for oysters and a little extra. Had heard about the bread and butter, but I am not eating bread at the moment. They were very accommodating and brought me a side of asparagus so I could have the butters with the rest of my group. All the food was excellent. Notably, the octopus. It was perfectly sliced and cooked. Melted in my mouth. The asparagus was some of the best Ive ever had and it was so simple. I imagine then that the asparagus entree is great. The deviled eggs were great. Nothing spectacular, but the crab on top was really fresh. Will definitely be returning when I have a less restrictive diet and can indulge in all the sauces and the starchy carby sides. \n\nOne negative was that the service was incredibly slow. Didn't even get water for almost 20 mins and it took a long time to order and then get our bill even though our entire table had been cleared. It was ultimately fine though because we weren't in a rush and wanted to chat and catch up.", "author": "Bea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "If you're coming for a huge heavy meal, look elsewhere. If you want to enjoy some small plates, a fresh raw bar, and well made drinks, keep reading.\n\nI had a fancy date during late fall at Grand Army, splitting a few oysters, the deviled eggs, and an octopus dish. I think the menu changes seasonally because the cocktail I had with beet juice isn't on the menu, but it was strong and I had more than one, possibly more that two (oops). My date and I sat near the back and had good service--our waitress checked in on us many times during the night. The ambiance was upscale and the lights were dimmed pretty low. The bar itself is beautiful and you feel the need to take the time to enjoy yourself, your company, and your cocktail when you dine here. I'll be back the next time I want to feel fancy.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "Good little bar off the beaten path.\n\nStopped in for dinner / drinks on a Wednesday night, place was packed but we only waited about 10-15 minutes for seats at the bar.  Very small quarters, but nice and intimate.\n\nDrinks are prepared well and tasted great.  Menu offerings were a bit small, but the food was tasty.  We had oysters, shrimp, cheese plate, and some cauliflower dish.  All were very well prepped and tasted great.  The food was a little pricey for what was offered, but overall it was a good experience and we will be back.\n\nGood to get away from the normal hustle and bustle to find this hidden gem.", "author": "Bob H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "This bar is a must. The beer selection is absolutely on point and the cocktails are not only delicious, with hilarious names, but they're also super affordable. The raw bar is fantastic! \nMy bartender, Damon is a frigging legend. He's incredibly approachable and knowledgeable. When the bartender braids your lil brother's hair you know you've found your new local. I love going here, I always leave a but bleary eyed but with many stories to tell. \nThe overall feel of the bar is warm and inviting. I strongly recommend this place for a date or reconnecting with friends.", "author": "Jacob T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "Bustling little seafood and nightcap spot in a quiet Brooklyn street. A strange My Little Pony fixation aside (a concession to the hiply tragic and the tragically hip?), the menu jumps right off the page. Everything was fresh, served quickly, and was mouthwateringly good (as several others have pointed out, the oysters are a highlight). Service is very good. Would definitely recommend for anyone in the area.", "author": "Hamish M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-22", "description": "I'm kind of conflicted on this one. As an FYI, this bar has a very strong Hipster Vibe to it. If you don't like that scene, this may not be for you.  \n\nCocktails - Fantastic. They run around $13 but are delicious, strong, and are definitely made with care, but still to pricey to really have often. They take a bit of time, but when you get it, it is fantastic. \n\nService: It seems to be hit or miss on who you are talking with. Some staff members are incredibly helpful, and understanding, while others don't seem nearly as much. I had came with some friends who are, well to say very far from the usual clientele for here, and one of the wait staff had made a comment to the effect that this 'wasn't what we were looking for', while other staff members were helpful and pleasant. \n\nFood: Haven't tried yet, planning on at some point. \n\nI'm going to stop by here again, but more out of curiosity to really get a feel.", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "Great cocktails. Great raw bar. And you can make a good (though not inexpensive) meal.", "author": "Ruth P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-28", "description": "I like oysters. I like drinking cocktails. I love seafood.\n\nI like Mile End. I follow Daniel Krieger on Instagram. And I love Prime Meats.\n\nBasically, Grand Army had all the ingredients to be an awesome bar. I went even though there were several bad Yelp reviews just to see for myself. Unfortunately, the 50,000,000 Elvis fans weren't wrong this time.\n\nMaybe I should save this review until after they complete their first month, but Pete Wells I'm not.\n\nI came by on a Tuesday and according to the bartender, it was unusually slow. That should mean great service, right? Actually, no.\n\nThey really treat this place like it's an industry happy hour. The head bartender spends his time talking to his friends seated at the bar. When asked what's good on the menu, he provides a very unhelpful answer of \"it's my menu, so I think it's all good\". He also told my friend the same thing when he asked later. Come on, dude. You know what the fuck I mean. After some teeth pulling and telling him I wanted a drink on the stronger side, he came back with The Granville, which is a pretty weak gin drink with mint.\n\nI had the misfortune of being sandwiched between two people who were also friends with the head bartender, so I was basically ignored for a good 15 minutes before I could place a food order with a different bartender, who was a much cooler/warmer guy.\n\nTheir oyster prices are actually pretty ridiculous. I feel like they're trying to be Maison Premiere, but don't have the oyster variety or the reasonable prices. I ordered a variety of Washington oysters, starting at $3.75 apiece and ending at a whopping $4.25 each. The Kushi's were pretty bad, and the Shigoku's weren't anything special. The Totten Virginica's were pretty good though. Everything was a little on the lukewarm side, which isn't a good sign. Their eyedropper bottles were really gimmicky, and kind of spit in the face of fresh oysters. But I'll have to admit, the Jamaican jerk sauce was interesting enough.\n\nSo that's at least three strikes, if we're keeping score.\n\nAgainst my better judgment, I stayed for another drink and more food. The drink was the Kansas City Southern, which was a much better drink and basically what I wanted the first time around (and when I was $13 richer).\n\nAround this time, the head bartender overheard my friend and I talking about other bartenders in the area we knew, and he finally started talking to us like we were worth his time. It felt like a networking function.\n\nAnyway, I also ordered two of their small plates. The first was the dayboat scallops, which were two small portions of scallop pieces with pickled jalapeno, puffed rice (which gave it a weird texture and no extra flavor) on top of what looked like leaves. Not filling at all, and really did nothing to emphasize the scallop flavor (and I love scallops).\n\nAlso had the shrimp cocktail, which was 4 pieces for $12. The shrimp were fresh and decently sized, but at $3 apiece, I expected better.\n\nAll in all, Grand Army has a lot of promise, but I'll give it a month or two before/if I return so they can hopefully get their shit together. Because right now, it kinda blows.\n\nGood beer selection though.\n\nIf we're still keeping score, they're at 5 strikes and minus 3 stars.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "My friend and I stopped in Grand Army pre-dinner for a snack. It was before the dinner rush on a holiday weekend. After confirming twice that we did not have a reservation, we were reluctantly seated in the non-crowded restaurant. We ordered the deviled eggs and some oysters. The deviled eggs were delicious. They were more expensive than normal, but stuffed with crab. They were mildly flavored, but surprisingly, the breadcrumbs made them pop. The oysters were fresh and I really liked the variety and unique flavors of the sauces. But oysters really shouldn't be $4 each. They were definitely over-priced. My friend commented on the unique beer selection, but didn't really enjoy the one he selected. Service wasn't wonderful once our waiter realized we were not getting rounds of drinks and much food. Overall, I found the place a bit pretentious.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-12", "description": "Service was super slow. We sat for about 15 - 20 minutes before they even acknowledged us, they sort of forgot about us. And the restaurant wasn't even that full as it was a weekday early evening. Then the appetizer and one entree came all at the same time, which was awkward as we had to wait for the other entree with one of the entrees already out. My pappardelle was super salty as if they accidentally dumped too much salt. But because it took so long to get the waiters attention that it wasn't worth bothering to get it changed. Our dinner came out to $120 total for two people, definitely overpriced for what we got. Won't be going back. The only part that was good was the atmosphere which wasn't too loud or quiet but a good mix.", "author": "Adelyn Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "This was a great place right around the corner from our hotel. Food excellent , cocktails delicious and service was outstanding.", "author": "Kimber H."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Grand Army", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "336 State St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/m68a_lC0uSyYONJGz58Zzw/ls.jpg", "@type": "Restaurant", "telephone": "+17186431503"}