{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "Quirky but cool. Bartenders don their newest additon to their \"hawaiian\" shirt collection and they keep the lighthearted theme throughout their service: greeting you as an old friend, humming along to the music, grooving along while making a cocktail. It's a cool space with cool drinks and yummy (but pricey) snacks.", "author": "Kait M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Sooooo my first time at this fine establishment was yesterday with my King. What a lovely time. Service, environment, the staff, the food, the drinks, oh THE Drinks are All so excellent. This will definitely become one of my favourite establishments.\n\nThank you Elizabeth", "author": "Sacheen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Cool cocktail lounge in the heart of Brooklyn.  Candle lit with a big craft cocktail menu and solid drinks.  Outstanding service.  Made to feel welcome and attentive wait staff.  Didn't have food, but a huge oyster bar at reasonable prices.  Great spot for a date or a casual chill eve with friends.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Delicious food, beautiful ambiance, professional \u0026 friendly service. Definitely one of my favorites in Brooklyn.", "author": "Mark A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-24", "description": "Really fun place for dinner in Brooklyn Heights! A bit on the pricey side, but still really fun. Had the baked oysters (very tasty, if kind of small) as well as the really excellent poached salmon. Highly recommended if you're in the area.", "author": "Aviah M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-28", "description": "The music here is so loud that it's not possible to be heard even when shouting. When I've asked politely if it could be turned down the manager said no, that the volume is \"their policy\". \n\nEverything here is perfect, but because of the loudness, it's ruined. Don't go.", "author": "Jane s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Just went back for brunch, and once again, I was very impressed with the flavors, textures, and attention to detail. Sure, the vibe is a little hipper than thou, but they have a lot to boast about. The soft scrambled eggs with salmon and caviar was absolutely glorious, and the bloody mary was good and spicy, loaded with horseradish, crisp and creative garnish.", "author": "Jack C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-30", "description": "Last Wednesday after a mini family reunion at my cousin's home down the street, five of us (female cousins) decided to try this place out. I think we got there about 11 pm. Nice looking place, and interesting menu, but we weren't hungry so we just had drinks. All the drinks were good.\n\nI would have given a higher rating, but some guy who works there came over to our table and told us we reminded him of \"The Golden Girls\" - what???!  Dude - that is NO compliment!  That show was about some 65+ year old women, and none of us are anywhere near that! What an insult. The manager needs to school the employees on how to talk to customers - especially females.", "author": "Joan D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-11", "description": "My husband and I had been looking forward to coming here, and what a disappointment. I'm giving two stars, for three reasons:\n\n1. Wait time was too long for a New York bar. \nSeveral people around us were also annoyed at how long it took to get a drink.\n\n2. Cocktails tasted bad.\nWe ordered two cocktails from the specialty cocktail menu (at $18/each). I had the only cocktail on the list with gin, and it was practically ROOM TEMPERATURE and tasted awful. The bartender explained it was made with Brooklyn gin which doesn't taste \"piney\" like your conventional gin. Well, I love the taste of gin, and the taste of this cocktail was just awful. \n\n3.The oysters were horrific. \nFirst of all, they were a little warm- a little cooler than room temp, when oysters should be served really cold. Secondly, they didn't come with a lemon wedge or cocktail or mignonette sauce, rather they came with several sauces in little dropper bottles. These sauces were ALSO room temp- disgusting. I opened each one to smell them and one literally smelled like dog food. One of my oysters had huge visible pieces of shell sitting on top of the meat on the oyster and I had to spit it out in my napkin. \n\nI'm giving two stars only because the staff were nice but the quality here is severely lacking.", "author": "Abbi A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-20", "description": "My girlfriend and I were waiting with bated breath for MONTHS for this place to open. We're big fans of all the people involved and have been looking forward to a new, potentially go-to spot in the hood.\n\nFOOD - 1.5 Stars\n\nWe ordered the smaller of the seafood platters. The oysters were good, and the variety of sauces they provide with little drippers attached earn points for ingenuity. They certainly added a sense of adventure to the whole thing. The shrimp were decent. The scallop was disappointing. All in all it was overpriced. I really really hope they add a $1 oyster happy hour.\n\nWe also had a crostini that was tasty. \n\nAll-in-all I don't think we would come back for the food without some changes.\n\nDRINKS 5 Stars\n\nThis is where Grand Army really excels. They seem to have a truly excellent bar program. The menu is interesting and the bartenders painstakingly craft each cocktail. We were very impressed.\n\nSERVICE 4 Stars\n\nWe really enjoyed the helpful staff. We were there on one of their first few nights and it was jam packed. However, everyone kept their composure and made us feel very welcome. I was worried about the whole place being too cool for school or pretentious, but ultimately it was not. Noah from Mile End was working hard to take care of everyone. We do wish them all success\n\nAMBIANCE 4 Stars\n\nCool atmosphere with young interesting folks from the neighborhood. The vibe is a welcome addition to the neighborhood. The bar area is well-crafted.\n\nOVERALL 3 Stars\n\nThis will likely become our go-to spot for a nice drink in the neighborhood. However, I don't see us sitting down to eat again anytime soon. A good happy hour deal ($8-10 cocktails? $1 oysters?) would go a lonnnnng way.\n\nI hope this place survives and thrives!", "author": "James A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Oh man there's this drink called the Trans-siberian that tastes like how I imagine a cocktail would taste in a fairy tale. It's like orange blossom and magic. \n\nI had two drinks and was feeling super buzzy. The bartender had a nice pour, which I appreciate. \n\nThe bar is really pretty. The toastie things are really good. The oysters are yummy. I wish they would label the dropper things for the oysters. That's my only complaint though. :) I look forward to many tipsy evenings here.", "author": "Nicole G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "These guys are killing the game. Those droppers with the oysters are the most genius way I've ever sauced my bivalves. All of the food is on point. When they're slammed, they're still friendly. Great spot.", "author": "Karyn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Great wine list (orange wine, sparkling Chardonnay from Jura, Pulsard). Fresh and delicious seafood raw bar. Very expensive. Loud. Good service.", "author": "Jesse G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "I just went again, and it was even better than I remembered.\nThe ham appetizer was absolutely amazing. Smoky and delicate, one of the best ones I've ever had.\nAnd again, the oysters are to die for.", "author": "Dick V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "Phenomenal cocktails, beautiful layout and a great time all around. A proper bar was severely lacking in this part of town, and this spot is really exceptional. \n\nThe food that I had was delicious - especially the ricotta toast. Not sure if there's plans to expand the menu, but I'd love to see more non-seafood items too.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Great happy hour. Nice servers. Great oysters. Lots to choose from. Octopus was off the hook. Tartare was also exceptional. Accommodated 7 of us at the bar nicely even during high time.", "author": "Adam X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "Stopped in for a drink and some oysters with a friend after work. We were there early and the place had a very relaxed neighborhood feel.  The bartender was friendly and knowledgeable.  I tried the Granville.  My friend tried the City of New Orleans .  Both were excellent, and as described. \n\nThe happy hour oysters are a great deal!! They were fresh, tasty, and served with a variety of interesting sauces. We also tried the Little Neck clam appetizer, suggested by Noah, also very tasty.  \n\nI will definitely be back!", "author": "Ted J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Those were probably the cleanest and best oysters I've ever had. And all for a buck each between 4p-7p. Hope to be back!", "author": "Ray W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Cute bartender Henry is the BEST!!!!!!!!!!!!!!!!!! By the way, he is here only on Tuesday.", "author": "Haneul C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "This neighborhood gem is walking distance from our apartment, and we thought we'd check it out one weeknight. From what I gather, it's a nice, quaint bar that serves small plates, beer, wine, and delicious cocktails (which we will have to try next time). And, not to forget - fresh $1 oysters for happy hour daily 5-7pm! They serve it with tiny droppers filled with 4 different types of sauces. I'd also recommend the brandade and bread with seaweed butter (as weird as that sounds, it's quite tasty!).", "author": "Rachel D."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Grand Army", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "336 State St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/m68a_lC0uSyYONJGz58Zzw/ls.jpg", "@type": "Restaurant", "telephone": "+17186431503"}