{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-13", "description": "Really cute place in downtown Brooklyn, that's nice and sunny as opposed to the typically dark caves I'm usually accustomed to in the area. \n\nService was a little slow (looks like they only have 1 cook?) and our waitress seemed a little overwhelmed.\n\nFood is really good, but poorly portioned. So don't come super starving unless you want to order a few dishes. I had the shrimp toast, which was essentially a decent-sized snack.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-24", "description": "Very cute space with delicious food. Unfortunately it was the service that brought the whole experience down to the mediocre, especially the curt bartender - a snootiness that belongs in manhattan and not boerum hill. Was hoping to make this one of my more regular neighborhood spots but unfortunately it proved to be a member of the growing cast of the cute/pricey/average.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "I'm not into seafood but the cocktails are amazing!! Each drink is specifically crafted to perfection and the presentation is on par.", "author": "Gabi M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "Upscale-cafeteria-like feel with consistently poor service. \n\nNice oyster selection but comes with gimmicky \"flavors\" (e.g., pastrami) that you apply with eye droppers and either no horseradish or uphill battle to obtain from waitstaff who seem supremely irritated that they work here and have to deal with customers. (As noted by many other reviewers, the waitstaff here are truly awful.)\n\nUndersized beers sold at normal-size rates. Simply overpriced and overrated. Come here if you wanna feel like a real sucker.", "author": "Ali R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-30", "description": "Decent bar.  Came for happy hour.  Got the one-dollar oysters... probably the worst oysters I've ever had, but you get what you pay for!  The medicine droplets to apply the mystery sauces are really weird; we asked for some cocktail sauce.", "author": "Danny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Oyster happy hour.  Yum.  Interesting concept with various flavoring drops, some better than others.   Cocktails were fantastic. Great balance and not too sweet. Original ideas, not just different names for the same old drinks.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Excellent presentation and quality with respect to all of the dishes we tried, and the cava by the glass that I ordered was outstanding and reasonably priced, at that. Wait staff was definitely pretentious, but such is life in \"DoBro.\"", "author": "Dana L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-11", "description": "I want to give 2.5 stars. The appetizers were good. We had shrimp curtails and cherry stone clams. For the entrees, which are the true disappointment, we had grouper and baby octopus. For the price, they were definitely too small... the waiter didn't explain the size of the food. Especially, with the baby octopus, you get only tiny 4 pieces. Really? Also the food was cold. It's a $13 appetizer amount. The menu is very limited.not many options and no specials. If you go there for only drinks and appetizers, this place might be OK.", "author": "Miku T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "Such amazing service here. The foods great and awesome date spot and everything really fresh but this 5 star is all service related. I'm sad that I don't know his name so I can shout him out on this but the server that's on the floor late nights makes the whole experience. He's smart, quick, knowledgeable and makes you feel at home. Easily following who had what and where even though late night everyone's moving around. Just feels so professional and welcoming.\n\nGo in earlier for a great, very chill and fresh dinner with great raw options. Awesome oysters.\n\nI'm sure everyone else is also great and reflects so well on the management. Thanks guys for a superb experience.", "author": "Fer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "Stopped in for happy hour recently, since it's in my 'hood and they have oysters.   Oh, and I just had to see those eyedropper tinctures for myself. \n\nThe place is dark and cute - interiors are in the Brooklyn vein of trendy rustic Americana.  The gap between the wide floor planks ate my stiletto heel.  It was as if the place was goading me for coming in dressed as if I was visiting the meatpacking district.  \n\nOn to the libation and oyster review... We had a couple of east coast oysters - the names of which escape me, but were appropriately fresh and briny.  The small glass tinctures were a nice touch.  Thai pepper, mignonette (without the actual shallot bits), hot pepper and ponzu were on offer for the day.  The cocktail I enjoyed was a fruity rum based drink, named Ziggy's Stardust  (this was the week of David Bowie's departure). \n\nAll in all, a nice option for dollar oysters and fancy cocktails for the neighborhood.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-22", "description": "I understand why restaurants are replacing FOH staff with IPads and such. \n\nWhen a couple walks into a bar the first thing you should do is greet them and smile, not check your watch, suck your teeth and walk away. But I didn't come 30mins out my way to leave, especially when you close in an hour. \n\nRude waitress tells us tables are out and we have to sit at the bar, cool no prob I came for liqour anyway. We over hear that the kitchen is closed but the kitchen guy doesn't mind doing oysters, wanted to see if we could also do shrimp cocktail since its from the raw bar. At this point the bartender has yet to greet us. ( I know we should've left) Anywho, rude waitress is walking by, I tried asking her a question but before I could even get the first word out she states \n\n\" You're going to have to ask the bartender since you're at the bar\". \n\nJust know, Rude waitress that you are an EPIC TURD. \n\nBartender comes over she's sweet a little bit crazy but we like it. Makes my drink, super weak, I ordered GIN (The Fountainhead) because I Like to get a bit tipsy not chug it down and still be sober. \n\nWe ordered oysters which are ridiculously priced especially for a place with such little variety. They were okay anyway. The concentrated sauces were delicious! \n\nWe only like ratchet once were drunk, please get us drunk before you as the staff start sitting at the bar and cursing loudly and talking about all the other crap in your life. We definitely wouldn't have minded if someone asked if we would like another round. \n\nBusiness is business, teach your staff this. \n\nTwo stars for the Male Asian guy who was talking his mess and still doing his job thank you for clearing the empty dishes that sat in front of us.", "author": "Natasha J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "Happy Hours Review \n\nCame here for the $1 Oysters and oh man, these very great. They were tasty, fresh, and came with different sauces. I tried some of the sauces but they oysters were just fine \"all natural\". \n\nBefore we got the oysters, we were provided bread and butter, it was was delish.\n\nAlso had the drink of the day, a vodka based refresher. I really enjoyed it. It had the perfect balance of vodka and other ingredients, truly refreshing.", "author": "Tim R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "Great place to come for a nicer night out - fun and relaxed vibe, creative cocktails, and nice menu. I had a fabulous octopus entree that was really fresh and light.", "author": "Jamie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "Absolutely freaking cool! Their mixologists are so on point - it's unbelievable! Loved the ambiance, oysters, and especially the drinks! Must seat at the bar to enjoy the skilzzz demo.", "author": "Yelena S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "came here for brunch yesterday.\n\nBloody mary was average, but the biscuits and gravy and the sardine toast were delicious. It's impressive what they can do with the small space. looking forward to going back for oysters and dinner.", "author": "Sasha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "I didn't eat here but the cocktails were really good. I think the thing that really sets this bar from an A-Ok to a Yay! I'm a fan was the bartender. He was really nice and personable and genuinely seemed to like his job. He chatted and joked with us and made us drinks after asking us what kind of things we liked and told us to trust him. The stuff he made was great and he let us taste the interesting rums etc that he put in them. The service at the bar was unlike any I have gotten at a fancyish cocktail place. No surly hipster vibe here. It's nice to feel wanted!", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "This review is for happy hour (5-7 Monday to Friday) at Grand Army. Love the ambiance of the restaurant but loved the $1 oysters even more. So, so worth it. We came and waited only a few minutes for a table and then splurged on 24 beautiful, cheap, delicious oysters perfectly presented on two tiers of ice with little droppers filled with different sauces. Beer prices were lowered for happy hour too and I loved the mixture of a sour beer with my oysters. Definitely recommend this place for drinks and snacks, although doesn't seem like the menu is really for a full dinner.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "I arrived here on a Monday evening, meeting a friend. We were both craving oysters and it was happy hour, so it was perfect. I loved the decor, full sized bar and shuckers in view. We get a dozen oysters, a gin martini and my friend orders off the menu. Drinks were very well prepared. Oysters were briny and fresh. The sauces were interesting in the little eye drop bottles, but were not needed.\nI'd come back sometime for a full dinner.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "This gem in an unexpected are is a nice addition to the neighborhood. It is great for a variety of diets- gluten-free, vegetarian, and clean eating. The vibe is intimate and comfortable. There is a decent-sized bar, a couple of booths, and seating for a few dozen at small tables. The space is cleanly decorated and dimly lit so that I felt about 20 years older as I read the small-printed menu by the glow of the tea light on the table. \n\nDrinks- They definitely try hard to be the creative cocktail joint so much so that they do not even have cranberry juice. That being said, the drinks taste great and are heavy on the alcohol; so put aside your judgment when the server brings a tiny glass for which you paid $13. \n\nFood- warning** I do not eat shellfish and this will not include info about the oysters. That being said, everything else I tasted was absolutely delightful. The combinations are creative and well-thought out. The sea bass is served as almost a sashimi and topped with a curious blend of sweet pickles and spicy peppers. The burrata, don't freak out fellow Italians, is served with beets and (gasp) curry sauce. This is a must try! Downside- only 1 dessert :(     Nevertheless, get a few plates and share with friends; you're gonna want to try it all.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "This is a great spot to take a date, your kid, your mom, your friends, your co-workers. Very few places in Brooklyn can do that. The atmosphere is really beautiful and spacious, grand and open with the large windows. We came in for $1 happy hour oysters and we got 36 between the 3 of us. The volume of the place made it fine for us to not feel too guilty about having our 4 year old there and the $1 oysters and $1 off delicious drinks made that guilt fade away even faster! Service was friendly from the start and the oysters were very fresh and the little droppers of 6 different flavors were very fun! Shallot and habanero were my favorites! We will definitely be back again soon!", "author": "MR S."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Grand Army", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "336 State St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/m68a_lC0uSyYONJGz58Zzw/ls.jpg", "@type": "Restaurant", "telephone": "+17186431503"}