{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-09", "description": "Sea urchin!\nFancy toast!\nAwesome cocktails!\nYes. \nThis was that little cafe space on the corner of State and Hoyt that has somehow been expanded a bit. It's a small space. There's a good sized bar and then maybe... 10? tables? Lots of fancy custom cocktails (although the table next to us thought that $18 was too high for Brooklyn - usually I would agree but with apartments in the area topping $4-zillion a month things may have changed).\nYou'll come for the cocktails and stay for the oysters with all the little eye droppers of sauces. The octopus is on a bed of dashi and celery root that will hurt your brain as it is so light and airy. The uni is served on a shiso leaf: delicious.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Not too crowded at 7PM on a friday night, ordered a dozen happy hour oysters and the windrider. Both of which was great and refreshing to start the night off. Great upbeat ambiance and friendly staff. Would certainly recommend to anyone in the area.", "author": "Wesley S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-17", "description": "Only good for oyster happy hour.\n\nVenue - A clean dive bar with a pretty good amount of seating. \n\nOyster Happy Hour - Only one type of oyster available for $1 happy hour. They have cute little droppers for the different sauces.\n\nCocktails - Nice selection of interesting cocktails. Not bad.\n\nFood - Horribly disappointing and OVERPRICED.\n\nLobster Dashi - Comes with at most three little medallions of lobster/shrimp sausage and the smallest portion of cheap rice noodles ever. \n\nCrab Cakes - Much more decently sized portion of two nicely pan fried crab cakes. \n\nDinner portions left us hungry and we had to go elsewhere to eat after.", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Great cocktails! Dollar oysters M-F from 5 to 7pm!\n\nTry the Westbrook Gose - this beers sour, salty after taste is delicious.", "author": "Seth S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Things got a little political lol its what always happens when I hang out with my friend \"john\" which is not his real name but I dont have permission so I gave him a fake. We talked about - terrorism racism Iraq war muslims pasifism you name it. We talked about things like what we would do if someone wanted to hurt you do you have it right to stop him, turn the other cheek? Its like the Iraq war. I dont know if \"john\" and me see I to I on some stuff but anyway it was good to talk anyway and we definitely could at this bar. The bartenders all wore colorful shirt he told us \"take your time its not a race when we were deciding that was nice. I felt bad for talking to loud so its not like Im not going to give five stars right?", "author": "J H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-17", "description": "Fine. Elegant. OK happy hour. A tad expensive for what it offers, but very comfortable. For example, happy hour is only one dollar off usual prices for beer and wine. Wine is in the 12 to 15 dollar range.  Very nicely seasoned tomato fish, but sad cheese offering. Kinda snoozeville. Excellent service by cheerful waitstaff makes it all worthwhile.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-12", "description": "This place is lovely but every time I ago, I can't believe how rude the service is. I've never had anything better than perfunctory service, and most of the time they are surly and snippy. There are just too many great bars in Brooklyn with smart, friendly servers for me to continue going here. Disappointing.", "author": "Sharon R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-06", "description": "I work in the area and really wanted to like Grand Army because it looks so cute and inviting from the outside. So I was looking forward to the experience when I got around to meeting a friend for drinks there one rainy Friday evening.  I hate to say that I was disappointed.  The place was packed (not unusual for a Friday evening in trendy Boerum Hill) but beyond that, it felt like the layout and seating arrangements inside just weren't designed to handle that number of people, in that configuration.  It was impossible for me to join my friend at the bar because all the stools were taken.  Luckily, a couple had just vacated two seats at the window bar, so we moved there.  A-ok.  Mind you, none of the waitstaff either noticed or cared that I was having seating issues, except to tell me that I couldn't sit next to my friend.  Thanks - I got that memo already.  Anyway, so we relocate to the two window seats and it's still so cramped that I think my back was touching the back of the guy sitting behind me.  The waiter sees me at the window seat now, and remarks \"OH.  I didn't know you were here\" after he saw me at the bar purchasing drinks a mere 3 minutes earlier.  He muttered some perfunctory apology and proceeded to provide meh service.  Now, I'm the kind of person to overlook crowds and aloof-bordering-on-passive-aggressive service if a bar can pour even a halfway decent beer.  Nope.  I ordered an Allagash White, a beer I've had numerous times.  This one tasted like rancid french fry grease.  But rather than send it back and/or brave the crowd and wait 10 minutes getting a new beer, I sit tight and finished it.  Still wanting to give them the benefit of the doubt, I order another Allagash White for my second round.  Still stale french fries.  Mea culpa.  I won't be coming back.  \n\nThe only reason I didn't give one star was that the bartender was really warm and friendly.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "Everything was great, and the ambiance is spectacular. Gorgeous all round without being too much. Warning, however, the portions are tiny. Could use a little more food in each plate to not come off as being somewhat stingy. Wouldn't kill you to add couple more ounces of couscous to that $30 entree would it??", "author": "Tony M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-06", "description": "Update: I have been told, accurately, that cocktails are $13. I apologize for the misunderstanding and have edited my review accordingly. \n\nA nice place with a nice feel, and not much else nearby. Still, we thought it pricey for what you get during regular hours. We understand that there's a happy hour special on oysters and will give it a try. In the meantime, if someone is putting the bill on a corporate card, go!", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "Had an incredible time here last night. Took my boyfriend here for his birthday and we had a fabulous experience. Service was incredible and they really made us feel welcome and celebrated. Ordered the Crudo, the Mussels and the Gnocchi and they were INCREDIBLE. Portions were just right. We left full but not sickly stuffed. Drinks were great. Really loved the night.", "author": "Kat G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-03", "description": "I'm kind of borderline between 3 and 4 stars.\n\nWhat I loved:\n-Smoked Shrimp Fancy Toast - shrimp were diced up and combined with a cream cheese like spread; shrimp themselves had a great smokey flavor and the combination of flavors with the pickled veggies was excellent\n-Ricotta Fancy Toast - Another terrific marriage of flavors, and the ricotta was outstanding.\n-One of our servers\n\nWhat I didn't:\n-My old fashioned.  Wasn't on the menu, but I expect a place like this to be able to make a decent old fashioned.  Mine seemed like nothing more than bourbon with a little sugar and some zest.  Not good, and kind of offensive at $13.\n-Bread and butter also disappointed, and was a rip off at $8.  The bread service at maison premier, a place I don't especially like, is $4, a selection of breads, and better seaweed butter.\n-the server in training who said, \"chef suggests you...\"  2004 called, they want their style of service back\n\nMiddling:\n-Octopus - it was OK, but Melanie thought it was kind of expensive at $17 for what it was...she was right!\n-Scallops - too much garnish; couldn't taste scallop; better with half the shiso leaf and jalapeno.\n\nLoved the decor.  Cool and comfortable.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "I love this place. Admittedly, it's on my corner, so I can scope out the scene and find the best times to arrive. It can get very busy, but with good reason! The cocktails are the best around - hands down. (I've paid double what they charge for a cocktail at some trendy spot in Manhattan and was seriously disappointed.) The staff is friendly and welcoming, even in the busiest times. Every dish I've had here is excellent. They come up with some crazy flavor combinations that you'd never expect, but they work! Most recently, loved the seared (torched, actually!) scallops with carrots, quinoa, and pistachios. Incredible. Happy hour recommended for a slightly more relaxed vibe - and $1 oysters! Come on.", "author": "Hannah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Great spot for a late night drink. I work at a cocktail bar, but sometimes I like to go somewhere chill and professional in my neighborhood just to relax. This is such a place. Rock on, Grand Army.", "author": "Logan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-06", "description": "The drinks were good but the bartender was a total douche. He thought it was funny I think but it was just offensive. Baldy", "author": "Casandra M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "Cocktails were on point!!! Tiki inspired drinks, date night spot, with chill music and candle lit tables. Bartenders were attentive and knowledgeable. Will definitely return.", "author": "Vivi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Come for oyster happy hour, stay for more oysters and cocktails, and love yourself. \n\nJust try not to get distracted by the chef: I accidentally made eye contact with him while slurping a shigoku, and it made both of us feel all sorts of feels I don't think we'd felt before. But I liked it.", "author": "J L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "Popped in for a drink with a bud a few nights ago.  The bar was full so we snagged a table. Our waitress was quite nice and well versed with the menu/specials.  Drinks were good, grabbed a few snacks, portions a little small.  I liked the spot.  It looked to have several interesting seafood options. Planning on going back for $1 happy hour oysters and to give the rest of the menu a spin.", "author": "Mitch Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "Grand Army is an amazing find in downtown BK! They have $1 oyster happy hour from 5-7pm daily and all of their oyster fixin's come in these cute lil eye droppers that are ever so convenient. The drinks are schamncy handcrafted mixologist-guru stuff and they're all $13 (and not on happy hour). \nDo yourself a favor tho and ORDER THE LITTLENECK CLAMS! They are delicious. You'll end up ordering at least 2 rounds. I don't know what the exact magical concoction is that they flavor the clams with but it is so so so good.\nI've been to Grand Army twice this month \u0026 plan on keeping it in my happy hour bar rotation.", "author": "Angela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-21", "description": "Was here around 1am on a recent Thursday. A few folks were milling about. \n\nNot too much going on in the area around then, so this is a solid option. \n\nIt's definitely more of a restaurant with a bar than a traditional bar-bar, but hey whatever. \n\nAverage drink prices, average service. Food will set you back a few $$. Overall, not bad.", "author": "John J."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Grand Army", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "336 State St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/m68a_lC0uSyYONJGz58Zzw/ls.jpg", "@type": "Restaurant", "telephone": "+17186431503"}