{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "For beer, get the Mikkeller draft for some nice fruity note from raspberry.\n\nHappy Hour on Weekdays from 5-7PM, Dollar Oysters + $1 off drafts or wine by the glass.\n\nThe Orange wine on the menu was not available so I ended up getting another glass of Orange wine (forgot the name) but it was really nice!\n\nSuper friendly service, attentive servers even though they are very busy, great cozy atmosphere and perfect place for a date or chill with a couple friends! I have yet to explore their food menu (except for the oysters) to make any judgement about the food. One thig for sure, I will definitely be back for more happy hours since I live nearby.", "author": "Melanie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "This place is solid. I come here mostly for the happy hour oyster, good drinks and ambience. I love all the flavor sauces for the oyster. Great neighborhood bar!!", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-10", "description": "Cute bar. Fresh oysters. Happy hour. What more can you ask for? Recommend this place for some light day drinking with some friends before you head out to your next spot.", "author": "Sasha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "I really enjoy Grand Army for oysters and cocktails in a cozy setting.  Seasonal menu is delicious.  Pinky Pie for the win - balanced citrus smoke and bitters.  Great bar and restaurant for style and unwind.", "author": "Eve H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-29", "description": "this place is so cute! It is definitely pricey but the flavors are amazing, especially the goat cheese brûlée!! The drink I had was too sugary for me but it was overall really great.", "author": "Tashnuva S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Came with a friend for happy hour: $1 oysters are hard to beat but couple that with the craft cocktails and we buckled in for the afternoon.\nI had a savory gin cocktail that was solid and the oysters were great. Definitely try out the droppers with various flavors - makes for some fun taste testing.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-17", "description": "Went here with reservations for a group on a Saturday night. Our intentions were to grab cocktails and oysters before dinner elsewhere.\n\nThe interior is small, and it was LOUD. Like, not pleasant. Our waitress was fine but hard to hear.\n\nMy cocktail, the Seven Ravens, was great. It was large (I know, ice), and strong. A few others really enjoyed the Godfather Death. My husband got the Girl Without Hands and they should call this drink the Drink Without Alcohol. This was seriously a watered down Paloma. Someone else got one, too, and it was also watery as hell. For $14. Not sure what is happening there. This drink was so disappointing that I wouldn't go back unless I was with someone who really wanted to.\n\nI can't speak on the food because I didn't want to eat anyone else's oysters since they were $3.50 a pop.", "author": "Emily R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-19", "description": "Great ambience. $1 happy hour oysters. $1 off glasses of wine and draft beers during happy hour too. Would come back. \n\nThe entrees were tasty, but ridiculously small for the price (~$20). And I'm not known for my large appetite. Some of the bartenders were friendly. Others less so.", "author": "Himali W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "Food was great, came quick, atmosphere and music was very nice. wait staff seemed very knowledgeable of the menu. Specialty cocktails I tried weren't all that great, but overall I was very happy with my experience, will definitely be coming back.", "author": "Jake S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-09", "description": "Cute tragically hip restaurant for the bearded and those who love them. Food was shocking in its goodness - roasted broccolini was peppery and surprising, gnocchi was delicate and yum, very veg friendly and easy to share. They even made me a ti punch like it was no big thing. Service friendly and perfectly timed.\n\nSo why only three stars?\n\nCause while I was at the bar waiting for a table, the bartender called me \"sugar booger.\"\n\nYou're not as charming as you think you are, dude.", "author": "Katherine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Great oysters and can't beat the dollar oyster specil 5-7 on weeknights and 2-4 weekends. Oysters come with a fun assortment of toppings to try like taco, Coco, spicy, cucumber, shallot etc.  \n\nCocktails are point. Great service and great place!", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "I live about a 5 min walk away and have been coming here since it opened. Being from New England, I'm always on the lookout for a decent seafood spot (which is harder to find here than you might imagine) and this one fills the bill. I can always depend on great scallops, shrimp, oysters (including a $1 oyster happy hr), you name it. In addition, last night my gf and I split a goat cheese salad that she said was one of the best salads she's had in a while. To quote her, \"many places overcharge you for a plate of lettuce and something on top that you could make on your own, this one was unique and delicious\".  Yes it gets crowded, but we had a reservation and after a couple of people near our table left the bar, it was no more crowded or loud than a average NYC spot. The bar scene is hip and the cocktail selection decent.  Recommended.", "author": "John D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-29", "description": "3 of our 3 main courses were WAY over salted this evening. We informed the server and we were not offered compensation. The drinks, oysters, bread and butter were all fine. At ~$25/plate I expect a properly salted main course.", "author": "Kris T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-06", "description": "Hummmm not impressed. It's a hipster paradise. I came only for $1 oysters as anyone who knows me knows I'm all about oysters. \n\nI arrived about 4 minutes prior to opening and waited to be seated. Once I sat down at the bar I ordered immediately, and being as I was literally the first person I figured my order was first, however I watched 3 identical orders ( dozen oysters)  go out before mine. In addition when my order did come out  I saw a gentleman walk in my direction looking around, he stopped at the only other brown girl and asked if the order was hers, she said no, he looked around some more and brought the order back to the raw bar station. Moments later another man brought the same order back out to me... I can only image why that happened... I have my suspension but hey maybe the first guy had bad eye sight -____- \n\nI decided not to linger because some obnoxious women was asking if I would move down for her and her friend so we could squish in the bar. And I was not about that life. Mind you majority of the tables were still empty, and I'm sitting in the far corner of the bar...\n\nAnyways...I deem this hipster hole #826384  Enjoy with the company of pretentious early 30 somethings from the Midwest who came to New York to chase their dreams...\n\n*Deep eye roll*", "author": "Wanda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "We had a lovely dinner here one cold winter night. The decor is warm and inviting and the service was attentive. We had two cocktails, one with bitters and mescal and a Paloma with tequila (excellent). And we shared a trout dish with butternut squash puree (delicate and yummy and gorgeously plated), and some oysters (fresh and served with adorable eye dropper bottles of sauce). It's a bit pricy but if you've got the cash, worthy.", "author": "Abeer H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-25", "description": "Fun bar with good drinks in a nice area next to downtown Brooklyn. Some of the bartenders are friendly and others couldnt be bothered to even try. I haven't eaten here however the cocktails are genuinely good. Prices are expensive but not overly so for Brooklyn these days.", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-16", "description": "This place has the worst drinks and food. I hated everything I got. The salad was so caked in dressing and salt it was inedible. I returned it and cancelled my dinner. Never again.", "author": "Francine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "The only reason I didn't give this place a full 5 stars is because their cocktails aren't a part of their happy hour deal. And let's be honest, with the vast array of cocktails on the menu, you'd want to try them all, but that $13 price quickly stops you in your tracks. \n\nWhat IS a part of happy hour? $1 oysters, beer and wine. The $1 oysters pulled my friend in and I followed. Never really been a big fan of oysters, but after 4 drinks, I'll try anything. And I did. They were delightful. Our bartenders Kevin and Matt were attentive and kept our cups full. Kevin made us drinks that weren't on the menu, so I can't even recommend any, but they were all good. \n\nNot really a place for dinner. They had some some finger foods, but nothing was really appealing to me. After 20 oysters and 4 drinks (each), we left and had dinner somewhere else. \n\nIt's close to work so I will definitely return.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-07", "description": "First off - dining at around 9pm on a Saturday night. We order the baby octopus and the grouper. The grouper (not sure this was on the menu?) was served with - corn. Like what appears to be frozen or canned corn as a legitimate side to a ~$23 grouper. The grouper itself was maybe 4oz tops. The baby octopus was truly two dry, unremarkable baby octopi in a pool of couscous with a sauce that resembled ketchup. While we're not usually bothered by a somewhat expensive entree, this was borderline insulting. Probably a fine place for drinks and oysters but there are many better places nearby for dinner.", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "This was our second stop for the evening hop and it did not disappoint! We were looking for a pretty spot with a few small plates and creative cocktails. This place is perfect for sharing small plates, slurping oysters, and drinking excellent cocktails. \n\nIt is is dimly lit with dark wood cabinets behind the dark wood bar. When I walked in I felt like the vibe was romantic and friendly. It has a huge bar and lots of tables. We were sat in the back at a corner table with a bench that we loved because we could sit next to each other and see the whole restaurant. Cause who doesn't love to people watch and make up stories about everyone's life. \n\nI had the cocktail of the evening and then had another one as I drank it too fast cause it was simply delectable. I wish I knew more about it so I could try to make it at home. We indulged and shared three plates. The first was the bread and butter. The bread was a bit too cooked in some parts, but the rest of it and the butter were so yummy that we overlooked it as I know some people like their bread more toasted than I do. We wanted to try the deviled eggs, but we had eaten some at the last place so we had to place. Next was the shaved Brussels sprouts with smoked gouda, pumpernickle, and chayote.  We wanted to lick the plate when there was no more left. The last dish was charred octopus 'al pastor' with black beans, barley, and tomatillo salsa. We have eaten a lot of charred octopus in our lives and this was one of the best dishes we have ever had as it was cooked perfectly and the spread that went with it were divine! Who else knew that black beans and octopus would taste so lovely together?! There were many other of things we wanted to try but they will have to wait for next time. \n\nThe toilet seat cover is a must to see; seriously not ruining it by explaining any more.", "author": "Carrie H."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Grand Army", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "336 State St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/m68a_lC0uSyYONJGz58Zzw/ls.jpg", "@type": "Restaurant", "telephone": "+17186431503"}