{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-18", "description": "not a place for hungry male friends or friends who come after first round of food has been ordered \u0026 consumed. ratio of food to hunger salvation is not good for the wallet. \n\nfluke crudo, standard and good. oysters, yes. \ndeviled eggs, yes. you can't say no to those suckers. \nlittle gem salad was surprisingly good despite the blue cheese\nand lastly, crab cake was really good. \n\nspace was beautiful but does get crowded. however, reservations were easy to make online and once seated in the back, you're fine on space.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Amazing fresh seafood. Loved every dish especially mango salad and scallops. shrimp cocktail was a revelation. Creative and boozy cocktails, fun vibe, friendly staff.", "author": "Tara R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-02", "description": "This is strictly a cocktail  a bar with snacks -- some light, tasty  - but not inexpensive food.\nThe cocktails are amazing!  The $1 oyster the deal if you get here in time.\nLoved the lobster/noodle/dashi -- yum but $17.  Everyone is friendly - but go have dinner someplace else.  \n\nThey really should add an entree salad or a grass-fed burger for those of us who want dinner.", "author": "MIranda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-23", "description": "I love this place on Sundays and they have a great special. The environment is great. The food is great. The drinks are great.  The only fault I have with this place is that they don't have a lot of carbs on the menu, and I'm a big fan of French fries.  They do have really awesome oyster trays with delicious concoctions to put on them.", "author": "marisa p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "We stopped in for happy hour one night while wondering the street.  Very nice little spot. I could see myself as a regular if I lived in the neighbourhood.\nThe oysters were very good and came with a variety of sauces.  I really enjoyed the jerk (as in jerk seasoning) vinaigrette.", "author": "Danny I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-22", "description": "In Brooklyn, a good value if you are looking for happy hour oysters. Not a very big food menu and service was ok but not amazing. If you are looking for some small, but good local oysters and a few beers your good.", "author": "Art R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "So so much potential, great location, cute little bar and good music. But the service sucks. The bar tender with her extreme resting bitch face was unhelpful and actually rude. No need for it whatsoever. The food looked good but we left because we couldn't deal with the girl.", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-02", "description": "Shrimp cocktail with 5 shrimps cost $15 dollars, it is a lot more expensive than the other seafood place in the neighborhood. It also doesn't have a oyster happy hour during the weekend. To be fair it's probably more known for the drinks but me and my husband were on the hunt for food.", "author": "Hao L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Really excellent - far exceeded our expectations. Surprised it doesn't have better reviews. Little gem salad was a real winner, bread and butter were awesome, carrots awesome, great oysters too. Loved the sour gose that went with them. Definitely a great spot to stop in if in the area. Super cute interior and very pleasant wait staff.", "author": "Elizabeth E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-10", "description": "Steamed mussels are microscopic! \n\nIf this place didn't highlight seafood so much I wouldn't have bothered to write a review but..C'mon. Are you serious?! The oyster fork was too big! Sure, they'll give you 25 mussels but I couldn't even fight with them all and didn't get through half of them before I gave up. I'd rather 10 nice sized mussels that I can enjoy.\n\nWhen I asked the server over I told him they were way too small to navigate. I asked him (Ethiopian-looking dude) has anyone else ever commented on the size of the mussels? He said, \"nope.\" That's gotta be a lie. It HAS to be.\n\nHe wouldn't do anything to make my experience there a bit more pleasurable. He was utterly inflexible. I ordered it and I had to pay for it. That sucks.", "author": "Che M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "Really enjoyed the food and drinks. Bartender who served us was excellent and took his time to really mix a nice drink. I tried the New Orleans which is their take on a Manhattan and it was great. \n\nWe just missed the happy hour so had to pay full price for oysters but they were fresh and tasty... Love the eye droppers for their sauces for the oysters!\n\nAll said the service and food were great, the atmosphere fun... We will be back but a tad earlier next time!", "author": "Brian O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "I love this place. Love it. I have yet to find a cocktail bar that such a great place in the neighborhood to meet people for drinks after work. I can't say that I've sampled much of the food here, but it's an excellent place to meet up with friends for a tipple.", "author": "Roxanne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "What a great spot for a cocktail.  The bartenders and servers were knowledgable and delightful.    We went with a large group and ordered a bunch of appetizers all of which were very good.  \nMust try - bread and butter. Simply odd and delicious.", "author": "K C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-18", "description": "Seafood tower was great. Cocktails and wine were delicious and well priced.  Salad and octopus was sub par. Over cooked Israeli cups cous, fibrous peas, pretty disappointing. I would come back for oysters and drinks, but not much else.", "author": "Samuel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "Come for the sweet oysters, stay because the smell and taste of their scallops are like crack cocaine and their drinks are inventive and seductive.", "author": "D L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "This is my go-to spot in the hood. The cocktails never disappoint and the staff is always super friendly and nice. It's a great vibe and I love the decor.  They switch up the drink and food menu all the time, which keeps things interesting. Definitely a good spot for drinks with friends. For a date, it can be loud if you actually want to talk.... depending on the night and time.", "author": "Brianne C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "Came here on a snowy Monday night and it was definitely poppin'.  Our server was friendly and efficient, offering us great advice when we asked for it. Portions are slightly on the small side, but the fried hen and oysters were excellent. Loved the little droppers of mignonette, hot sauce, et al.", "author": "Katie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "Love this place! Great addition to the neighborhood. The happy hour special is a great deal - the $1 oysters were delish and they offered several topping options in eye droppers which was unique and a fun addition. The bar is really nice, it's lively but not so loud you can't hear the person beside you. The bartenders also serve a good pour of wine which I appreciate.", "author": "Katie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "I really enjoyed this place. Went for oysters and a few drinks. I have to say, they were absolutely delicious. The bartender made me an awesome off menu drink I just remember I knew what it was. It's a great place to take a date. Will make a stop here again soon.", "author": "TJ F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-28", "description": "This was one of the more disappointing meals I've had in my 15+ years in New York.\n\nFirst off, be aware that no entrees are served at dinner. So this is really a bar/raw bar place at most. If you're looking for a full restaurant you'll be disappointed.\n\nDrinks took nearly 10 minutes each round and it wasn't very crowded.\n\nMost of the food that we ordered was mediocre at best. The shrimp cocktail was obviously not fresh. For $12 for 4 shrimp at a raw bar, I did not expect mushy shrimp. We sent it back and they offered a replacement shrimp cocktail, it was equally subpar. The octopus tasted like it was made yesterday, stuck of a bed of mayo and placed in the fridge. Neither the bread or butter in the $8 bread and butter were very good...the butter had a very weird taste and texture to it that our table didn't really appreciate or understand. Even the bread wasn't great (and when you're paying for bread and butter they both better be amazing). \n\nI didn't have any oysters but others at our table did and they thought they were good (and it was a cool presentation). That plus the hip vibe earns the 2nd star from me. But the food doesn't deserve a full star in my book. Maybe they don't receive fresh deliveries on Mondays and we were eating 4 day old frozen seafood...it certainly tasted that way. I won't be back.", "author": "Adam K."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Grand Army", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "336 State St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/m68a_lC0uSyYONJGz58Zzw/ls.jpg", "@type": "Restaurant", "telephone": "+17186431503"}