{"aggregateRating": {"reviewCount": 2, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-28", "description": "I can't let Peter D. be the only reviewer for a dumpling place. I mean, this is the food of my people. I have really truly been craving pan fried dumplings in the neighborhood, so I'm pretty excited already to have my comfort food closer to home.\n\nThank You Come Again is a Chinese dumpling place, that has a pretty big menu if you'd care to read it. The decor is a little kitschy, but the flavors and people are legit. The YiYi behind the counter was super excited to hear me speak Cantonese and we had a nice little chat. The menu it's also very snackable and priced accordingly, which makes it a win for what is a pretty expensive food hall.\n\nToday I ordered the pork mini dumplings (25 for $7?!) It's like popcorn shrimp for dumplings. They're tiny quarter coin sized morsels of goodness with the perfect ratio of carbs to meat, fat and salt and dough. They are perfect toddler food, like goldfish crackers. The flavors were on point and the serving size was just right. \n\nI'm excited to try more of the menu (they do soup dumplings, gluten free dumplings, stir fry, fried rice, ho fun/stir fried broad noodles, soup, fried appetizers, and even specialty drinks.) I think I will go for a beef ho fun next, assuming I'm translating the menu correctly. I do think having a menu on the counter would be helpful - it's hard to really digest the menu while staring at the wall and trying to avoid looking like you're checking out the cashier. Also, would be helpful to envision the dishes you're ordering. \n\nPrices are fair, people are nice, food so far is delicious. Thank you! I'll come again!", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-08", "description": "I wasn't even hungry, but a new vendor in Dekalb Market Hall? With a big sign that promised Super Fresh Dumplings?\n\nI'll never not stop for that.\n\nThis new spot is slanging soup dumplings (and non-soup dumplings), skewers with various meats, fried rice, and noodles...all sorts of Asian favorites that seem to run the gamut from Shanghai to Bangkok. \n\nIt seems like a family biz, with grandmas cooking in flower print, and the younger generation handling the front facing side, and everyone super friendly.\n\nI rocked the classic pork soup dumplings ($7 for 4), because I'm a classic kind of guy. First off, I would believe the nice lady when she tells you it's really hot. I burned the bejesus out of my mouth on the first one. I only mildly singed my tongue on the second, and I properly enjoyed the last two. FYI: their house dumpling sauce isn't as vinegary as is traditional, but rather sweet and a little spicy, like a hot honey. Different, but good. \n\nAnyway, I liked the soup dumplings, and I'm going to listen to the nice lady that reminds me of my grandmother and come back soon to try everything else.", "author": "Peter D."}], "servesCuisine": "Chinese", "priceRange": null, "name": "Thank You Come Again", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Qog0ix36hKE_Vj_YdAOOwg/ls.jpg", "@type": "Restaurant", "telephone": ""}