{"aggregateRating": {"reviewCount": 37, "@type": "AggregateRating", "ratingValue": 1.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Have only been here once but it was a very positive experience. Multiple employees very friendly, outgoing and wanting to make your experience better. \n\nVery clean an for the amount of traffic coming through. \n\nRestaurant layout is a bit disjointed and definitely could be tricky when busy, especially with food being delivered to the table with the new ordering system. \n\nHas a kiosks that allow for quick and easy ordering for those who are comfortable using them. \n\nAdditionally, they have most, if not all national deals and menus (Can be a rarity in cities or malls). \n\nCan't beat the $1 large soda!\n\nSolid WiFi too!\n\nRecommend if you are looking for something quick and easy while waiting for a train!", "author": "Lloyd R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-06", "description": "Not good at all. Soda was flat and no one cares. Bugs flying around. And they tried to charge for ketchup $1.50 at the register. Started at the order here machine and couldn't get past to pay because couldn't find one of those table numbers but my total was $12.60 so went to the register and order same thing and it came to $14.60. I ask the lady behind the register why at the machine it was cheaper, she mumble something and the price went back to $12.60. Look at the receipt and she took off charge for 3 ketchup. Amazing they are ripping people off because lots of people don't look at the receipt and I would not have known if I started straight at the register. How many people have they ripped off and how much have they made? 100 people a day is $150 x 365 = $54,750 a year - nice chunk of change.", "author": "Judy W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-08", "description": "Tip 1) if you are at the Apple store across the way getting something repaired wondering where to go - do NOT go here.  Whole foods 365 has restaurants upstairs and hot bar downstairs.  This place is also literally an advertisement for shake shack which is 3 or 4 blocks away.  You have been warned.  \n\nTip 2)  Order at the KIOSKS even if there is a wait - despite having to wait in line again if u are paying cash. Go KIOSK.  \n\nTip 3) your chances of ever coming back will be low anyway - so why bother.  When would this food ever be worth this experience? \n\nThey have people taking orders that don't say anything (staring at me for 3 seconds i had to ask if *they* were ready to take my order.  And you guessed it, she botched the order (did not repeat my order back to me).  Makes sense - put people at the registers who don't like to speak.  Perfectly fine human being, bad management.  \n\nWaited for 20 minutes, did not hear my number, nor was it anywhere on the computer screen which displays orders.  But apparently it had been back there the whole time.  The (assistant manager?) basically gave me some serious hand wave and fast walkaway saying she called my number \"twice\".  I asked for a fresh meal which she finally did provide.  So, I am guilty of going to McDonalds - that is what i felt like just being there.  awesome.  At least they didn't charge me for the side of Sass.  \n\nBTW, ive been plenty of 'super ghetto' mcd's - Central Harlem, Brownsville, Bronx and plenty of other cities.  Nothing was ever this bad as far as the quality of the employees.  This is the worst MCD I've experienced in NYC, although admittedly i would never step foot in one after 7pm FWIW. \n\nIf this were my company id just NUKE this entire effing franchisee.  Its far too small a location (unruly customers plus a cattle auction atmosphere) and too many employees dont want to be there, a manager that clearly cant keep this place together.  Bring in / rotate a team from other locations.  \n\nThis location totally ruins the corporate brand.  \n\nIve never wished for robots as much as i did today.  However catch 22 - im pretty certain an AI bot visiting this location will ponder the need for our existence as a species.  Thanks McDonalds - you have also made me frightened for singularity.", "author": "Jelly B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "Avoid this McDonald's at all cost. It has got to be one of the worst McDonald's I have ever been to.\n\nHonestly, the workers are pretty good. They are trying their best to deal with the crowds and get people their food. There is table service and computer kiosks for ordering at this McDonald's but unfortunately it does not enhance the McDonald's experience. We waited a really long time for our food and when it was brought to our table it was either wrong or missing some items. The lady apologized and asked us if we were willing to substitute food. Sure, whatever. It was really no big deal.\n\nHowever, it is the crowd I have a problem with. A group of ghetto teenagers (maybe about 15 total) caused a ruckus throwing chairs and cursing while we were there. Imagine this, the elderly, babies, and families in the middle of a brawl. Mall security wouldn't dare stop what was going on or enter McDonald's. Cops wouldn't even show up. What McDonald's did have was a very stern manager and front line employees yelling at the kids to stop it and get out. They really stuck to their guns and I'm thankful to these ladies for doing their best to protect the store and the customers.\n\nBut sorry, never again and I suggest if you like eating in safety, don't come here.", "author": "Rachel A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-02", "description": "Today I dined here with my group of 20 band/choir students. We placed a large order of about $200, so it was important we assured all food items were received. \n\nIn short, the manager on duty was extremely unhelpful and demonstrated a poor level of customer service. It seemed that he just wanted to get rid of me and my students - paying customers - rather than assure that our order was filled correctly. \n\nI suggested that we receive our items, and then step outside to disperse them to my students, and double check the receipt to confirm we received all items - all of this so that our large group would be out of the way in the already busy restaurant.  He continuously told us that if we left the restaurant with our food items that the location would not be liable for any missing items. We then moved to check off the items at the counter, and the manager rushed through this process. When I questioned his certainty on us receiving all of the food, he became snippy and flippant, rather than meeting my concerns with positive customer service. \n\nAnother wonderful employee, BRITTANY, saw the issue and poor process happening and proceeded to disperse our food to the students one-by-one - a much more efficient method that I would have expected the manager to lead. During this we discovered MANY ITEMS WERE MISSING, and she simply called to the crew staff to make sure we got them. All the while, the manager watched over her shoulder, commenting on the missing items as if my students and I intended to steal food that we had already paid $200 for. \n\nThis experience was a nightmare and not at all the level of customer service I expect in retail. I understand that large orders and groups are daunting, but those occasions should be met with HIGHETENED kindness and efficiency, not an attitude or sloppy, inefficient processes. When we left the store, we realized that after all of the above we STILL DID NOT RECEIVE ALL OF THE ITEMS. I was so frustrated with the experience that I did not even bother to return to get them - it honestly was not worth the headache at that point. \n\nPLEASE BEWARE ordering here. The store is always busy, and the leadership does not seem to have a handle on quality customer service approaches.\n\nTHANK YOU BRITTANY for your superior customer service and improvisation in a hectic moment. NO THANK YOU, MANAGER.", "author": "Damarcus B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "Extremely slow and the people are rude. For someone that wants to get paid 15.00 an hour, they should be nicer. Thankfully the fries were warm but the chicken nuggets were under cooked. But first they give you your drink THEN 20-25 minutes later (which feels like 1hr) they give you your food.", "author": "Chloe M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Very fast, but always double check the amount of fries, many times the large are not filled enough, so it is the same amount of the medium ones.", "author": "Mei S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-27", "description": "Horrible customer service. Fast food workers are usually rude and uninterested. These people's jobs can easily be replaced by a kiosk and one day it will. They have attitude every time i asked something and were reluctant to give me sauce  also this McDonald's doesn't have items from a regular store such as a wrap. or a ice cream machine. Also the tables and everywhere is dirty and unkept", "author": "Wendy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "Everyone was rude and i saw a worker on his phone during a rush didnt even taste good", "author": "Adrian K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-09", "description": "First, I'm not a reviewer so this should be my first, and the last review of lifetime. \nI don't even wanna give you damn one star because of the customer service at this Mcdonald's. \nI and my sister walked in and a cashier, a woman and named MADJINA, seems to be rude to other customers. Well, thank you for the whole Damn service with your stupid, and ugly expressions. But you know what? If you earn money from the other people, you can't act like that. You should treat people as \"CUSTOMER\" not as your \"FRIEND\". If you're a cashier, remember you are the store's face which means, the one who meet the customer for the first time when they walk in the store. I ruined all good feeling from the whole day because of this woman. I'm sure I will never revisit this damn store as long as she's working there.", "author": "Jeong Hee K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-03", "description": "No space and they gave my order to someone else. I said me when they called out my number but this lady came out of the line and raised her hand and the man gave it to her. When I confronted the man he said, \" I don't care nothing I can do.\" Then when he was confronted by other people working their he claimed to have checked the receipt when he clearly didn't. Someone else had to get my order. Terrible place, terrible service, and overall just go eat somewhere else", "author": "Aroldo G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "Where do I even begin? The person at the cash register seemed to have the biggest attitude problem while I made my order. It seemed as though I was inconveniencing her by being here. The food took to ridiculously long to come out, and this was not during a rush, there were only a couple other customers in the store with us. No one informed us of, or apologized for there being an unnaturally long wait. The staff was overall unprofessional, making jokes and having full blown conversations with each other, with their backs turned to the registers. The entire time, I got the impression that the customers showing up somehow ruined whatever it was that they were doing, and they just wanted us to all leave, with or without our orders. This was by far the worst fast-food experience I've had in this city, and I will not be coming back here.", "author": "Brooklyn G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-29", "description": "WHERE DO I BEGIN? The staff seems pleasant and punctual when it comes to customer service . Other than that , this McDonald's DOES NOT SERVE HOT CHOCOLATE amongst other things. For such a small restaurant , located within the Mall , there isn't a bus boy cleaning the tables but I did receive my order in timely fashion. Because it's not too many people dining .\nUmm ,they could use some help", "author": "R P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "Slowest service ever.  Waited over 15min for a cheeseburger happy meal.  When I got there the line was minimal ( only 2 people in front of me).  It wasn't busy at all.  By the time I left the line was long people after me got served, and left.  When I asked about what happened to my order \" it is just a cheeseburger happy meal burger.  Burger fries and drink these are staples and should be on stand by\"  the idiot looked at the food area and handed it to me.  My next question should have been how long was it sitting there that no one knew it was there.  But I had a train to catch pure incompetence.  And for this they want 15 an hour.  How about better service then we could talk", "author": "LAWRENCE A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-07", "description": "Slower than dog shit. Took them 10+ minutes to make nuggets and fries. Had to leave before I could get my food because I was going to miss my train. Everyone was moving around like snails. Literally counting out loud every nugget that they put in the box. It was like they were trying to piss people off.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-23", "description": "I mean, I don't really eat McDonalds, but I wouldn't be expecting much when I do get it...like today. \nIt was fairly empty. I reckon it was because it was 7:40 in the morning. Only a few other people who talk to themselves were sitting around. \nThe service was prompt, nothing to write Yelp about.....The place is super small, but I'm sure the rent is crazy in this \"mall\".", "author": "Alicia G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "No service whatsoever!! That African American girl give zero-shit service and excusing me of yelling  at her! The line the restroom is unbelievable 'LONG' because three employees were standing forming a line and chatting before they can go and enjoy their restroom break. Fantastic! Don't you see customers(two kids) are waiting?????!!!!!!! Please, please, please....... train your employees before releasing them", "author": "June L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-08", "description": "One of the worst McDonalds IN. THE. WORLD. Not that I have been to them all, but it is difficult to imagine a worse one.\nLines are always literally to or beyond the door, staff is rude and slow and always holds up the line to talk to their friends / family. Meanwhile the only thing I go for is a coffee and sometimes ice cream cone.\nThe walls in this place seem to ooze with filth and the people here are not any I would associate with or consider clean.\n\nAvoid this place, unless you're looking for scabies.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "Its kinda sad how most fast food restaurants have such a bad review. Well, my experience here wasn't so bad. I had a really bad stomach ache and needed to use the restroom, and I went here from the subway down below. The bathroom was kept clean constantly and I really like that. (Who wouldnt...?) There were two toilets, and they had toilet paper in both (yay!)\n\nMy friend and I didn't order much, just some cookies, and the cashier was okay. He had a bit of an attitude when I asked him if they had any more chocolate chip cookies, and that was it. \nI mean I know I could've just said I wanted the cookies but then what if there weren't any more? ._.", "author": "Amy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "Due to its location in the mall, you can expect a full house or large lines.  The restaurant is poorly constructed so it will seem like there's one line, but you'll soon hear from one of the cashiers that there are three lines. Thankfully, they move pretty quickly and have a system that works. You place your order on your right and pick it up on the left. Bon appetit!", "author": "Kristia B."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "McDonald’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/UXikT2_5B5HiUSvg7-KbMA/ls.jpg", "@type": "Restaurant", "telephone": "+17182300176"}