{"aggregateRating": {"reviewCount": 37, "@type": "AggregateRating", "ratingValue": 1.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-06", "description": "Came in at 9:00am for breakfast. Tried to get the dollar menu Sausage McMuffin with round egg. Cashier charges me for the meal. No, I wanted the dollar menu McMuffin. Angrily, she re-rings up the order and says theres no such thing as the dollar menu. \n\nI rarely eat at McDonalds, so I guess I didn't know. Maybe they should update their menu then. But more importantly, don't come at your customers with bad attitudes. What do they care anyway...", "author": "Ricky H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-20", "description": "I'll frequent the Golden Arches for their soft serve, apple pies, and fries any day.\n\nThis location needs help, if corporate is listening, please send 1-20 people.", "author": "Will C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-31", "description": "McDonald's is one of the many reasons why I detest the Atlantic Mall.  Usually, I end up at McD's because I didn't eat anything before shopping and I refuse to pay for Applebees.  Or, I'm waiting for the LIRR train and as usual, I didn't eat before I have to travel.\nTonight, I was just shoppng at my new guilty pleasure, Target.  Going down the elevator, I knew I had to eat something and I resigned myself to McDonalds.   I look at the menu and when I was finally called, I told the worker what I wanted.  \"The McDouble is not a dollar, we don't have a dollar menu\" said he.  I snottily told him that I didn't ask him if it was a dollar, I want my damn McDouble, hop to it.    He did not hop, he crawled over to the soda machine and with an air of resignation, looked at the other people working.   The drugs I'm taking for my sinus infection must be really good because I thought the whole scene was hilarious.  Loud little children, shrieking, trying to be cute and annoying the hell out of me were there.   I got my food and sat down near some white kids, one asian and one of the white girls' mom.    Those little yuppie bitches was eyeing people up and down.  OH my gawd, we are in a ghetto enclave!   I rolled my eyes as I looked at the expressions of snobbish fear played on their faces.  Those little wenches were ordering their mother around, I wanted to slap them in the faces and tell them to get shit their own damn self and that their mother wasn't there to cater to their every whim.  That woman was frazzled.   While this was happening, I'm eating my McDouble.    It was GOOD!  I was really surprised.   It was the best tasting McDouble I have ever had.\nThe neighbor hood has changed.  All neighborhoods surrounding the Atlantic Mall are gentrified or almost on their way.  It's going to be interesting how this pans out.   Atlantic Mall is now an excellent place to observe the changes in the community.   As far as McDonald's goes, well if enough Yuppies go there and complain, we'll be having a well run McDonalds.", "author": "Barbara L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-22", "description": "This particular location has the rudest staff in the world.  In the several of times that I've been there,  the cashier will walk off to get everyone else's food, without fail, whenever it's my turn up in the line.  One time- while finally being able to order and already paid -the cashier got everything ready except for my fries and walked off saying that more needed to be made, which was true.  However, as soon as the next batch was ready, she was nowhere to be found.  Then other cashiers went there to get fries.  I told one of them that all I needed was a large fries in my order and asked whether they could help me out because my cashier was nowhere to be found.  Her reply, \"you're going to have to wait for her to get back\".  Then another cashier asked her what I said and replied, \"that guy said something, but I didn't hear a thing.\"\n\nWhen my cashier finally returned, the same cashier specifically wouldn't let her get any fries.  So I had to wait for that cashier to eventually use up all the fries and for another batch to be made.\n\nThis place is beyond appalling.  Even the Mcdonalds' in the ghettoest of ghettos that I've been to provide better service than this hell hole.  Bottom line: they'll treat you like the scum of the earth if you don't look and act similar to them.\n\nI'd give no stars if I could.", "author": "John K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-04", "description": "If I could give this place a 0 I would.  Every time I come here I experience or see the rudest parents and children alive. As you try to enjoy your nasty food some parent always seems to come sit with you and seat their kids on your table. Like hello biatch, I'm sitting here! Anyways food sucks and I feel sorry for the employees who have to deal with this crowd. I try to give this a chance every 6-10 months but always fail. I give up! Beware there is a chuckee cheese upstairs.  Apparently the dumb ass parents who failed to use protection and suck the government dry end up her. I don't know maybe wic, welfare and illegal immigrants are accepting at this mcdonalds location.", "author": "Tima A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-20", "description": "I am not a big fan of this Mcdonalds. i went in there a few times for a burger and each time i stand in line forever with a stroller pushing me from behind. Last time i went it was filled with screaming crying children or kids just being rude in general. The place is very small and noisey i honeslty wished there was a mute button. The people that work there are very rude and always get the orders wrong. they need to clean up or leave seriously theres places they could go in the mall.", "author": "Immy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-10", "description": "Utterly disgraceful. This has to be the worst McDonald's ever. They only get one star because one of the employees let me use the bathroom. The lines were short but getting a bottle of orange juice took 15 minutes! Only one cashier was open at 9pm and there was a build up of people waiting for their orders - way bigger than mine. As a vegetarian I don't eat their food as it is so my rating is on the service mainly...but a few years back I DID order a filet fish meal with fries and a sprite soda....ended up being about $8 and took 15 minutes to get. The service then was terrible with employees looking lost behind the counter, over salting my fries and giving me a cold filet sandwich after all that waiting. The table I sat at was dirty and the lobby attendant couldn't keep up with the messy patrons who didn't bother to take their trash with them especially when it is busy. There were arguments over orders being wrong with other patrons, drinks being spilled on the counter in a hurry to keep things moving (my bag got wet) and the guy gave me the wrong change. Next time I will go to Subways to eat or use the bathroom at Target upstairs.", "author": "Freedom J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-12", "description": "In liu of spending all my dough at starbucks for a frappuccino, I sometimes head inside the atlanic mall for an ice cream cone at this very friendly and well run mcdonalds.   Oh wait. Did I say that?\n\nSometimes I don't even want the ice cream, I just wanna see if I can't top my last miserable experience at the worst mcdonalds in the universe. I always do. \n\n I'd tell you that I feel like a winner if I weren't dripping tears in my cone", "author": "Angela H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-16", "description": "This review is specifically about the McDonalds in the Atlantic Mall on Atlantic Avenue in Brooklyn. This is by far the worst managed fast food restaurant in the country. Because of it's small size compared to other McD's, you would think the manager of this one would recognize the importance of organized service. Though kids will love it here (mainly because it's so zoo like), adults will tear up and long for the good old days when customers were important and not treated like cattle. The cashier's all have major attitude problems, as if they are looking for a fight!. All I want is a friggin fish samich for Pete's sake!\n\nRun upstairs to Target to their Starbucks for something to tide you over until you can get home, but stay away from this McNightmare.", "author": "La La J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-23", "description": "(1 star review to even out my score distribution.) They tried to hide the dollar breakfast menu from me but I found it in the bottom right corner of menu. I got the mcgriddle but it was too sweet for my liking - prefer the standard biscuit or mcmuffin.", "author": "Kevin W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-24", "description": "Anna S.'s pictures are factual.  I think they are probably screen caps of an actual documentary filmed at the McDonald's around the corner from the DeKalb station.  \n\nListen, I know it's bad.  I know it may - sometimes it's so damned good, though, no? - even taste bad.  But you know, at times, I'm just bad.  A bad person.\n\nAnd, well, you know what happens to bad folks . . .", "author": "Arthur O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-02", "description": "this mcdonalds is so small, there are not enough seats for people to eat. i dont understand how a company that makes billions of dollars would get the smallest location in the mall. it makes no sense to me. well i guess it makes  sense to the company because they are geting richer since there is no dollar menue at this location. i'v never seen a mcdonalds that dos'nt have a dollar menue.", "author": "Sharlene B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-26", "description": "Why the HELL this McDonald's stays crowded when Buffalo Wild Wings and Chucky Cheese is upstairs beats the living crap out of me.  I'm just trying to understand how someone can justify waiting in one of like 4 lines to get a value meal.  When has Mickey D's ever been that serious?  Are they sprinkling a little extra on the fries at this location?", "author": "Koku K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-13", "description": "Admit it, you go the too. I'm actually happy that it is open 24 hours. They and the cab drivers lined up across street provide some security late at night on an otherwise sketchy corner. By the way, the black building in which it is located in has to be one of ugliest buildings in New York, if not the world.", "author": "Universal R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-05", "description": "um im just reviewing this because im in a weird mood and i feel like reviewing the worst restaurant ever to land on america - and other countries\nwell lets put if negative infinity was an option on this star rating thingy thats wat mc'ys wuld get\ntrue story: my friend was in china eating all the weird fried duck feet-another story- and his stomache was fine- one nite he wanted to eat normal american food so he ate at mc's for dinner - that nite he threw up\nu do the math", "author": "lauren c."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-06", "description": "I try buying something once and a while but keep getting out before getting something. It seems like too much work. It is worth a burger.hummm I don't know . My fav one is on chambers st. It's clean and fun.", "author": "ndeye n."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-15", "description": "the worst mcdonalds in the country, stay away, staff never listen to your order, always seem to be having there own conversation.  store is always out of something, for example, tea bags, cream, milk, splenda, sugar and milk,  recently the have been out of mcdonald coffee.  i have been given a cup of hot water without a tea bag.  this location is bringing down the brand", "author": "P T."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "McDonald’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/UXikT2_5B5HiUSvg7-KbMA/ls.jpg", "@type": "Restaurant", "telephone": "+17182300176"}