{"aggregateRating": {"reviewCount": 50, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-21", "description": "Excellent beef noodle!\n\nTheir hand made noodle were not too chewy. I love the broth but it was a bit salty. The beef were soft and not chewy and tasted great!!!!!! The portion was just right. If you get spicy, it is actually spicy and not just mild like other places. Would love it if there's a bit more vegetables though. \n\nDef would try other soups next time I'm in town.", "author": "Oanh P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-28", "description": "I really hate to do this to my Asian brothers and sisters, but as someone who takes Yelp seriously, I cannot lie. \n\nHana Noodle Station seemed like a good budget friendly, not as meat heavy option as the other food stalls in Dekalb Market. The wait was almost nonexistent on a Saturday night, and I was excited to try something new - the Shanghai Cold Noodles with Shredded Chicken.\n\nI was hoping for a delicious cold noodle, and while these noodles were chewy and fresh, they just didn't stand out in any way to me. The noodles themselves didn't have any real flavour except salty, and while the chili sauce helped a bit, the dish was very flat and 2-Dimensional. The chicken was fine, a bit dry, obviously, since it was shredded white meat, but the noodles and cucumber itself I could not finish for the heavy salty soy sauce that it was drenched in. I really wanted to like Hana Noodle Station, but I am wary of trying anything else after the bad taste of the Shanghai Cold noodle in my mouth.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-08", "description": "Summary: microwaved food that's overpriced and light on flavor. \n\n1) The cashier prepared my Zhajiang Noodles. She use her gloves to put toppings on my noodles, then turned to help another customer with the iPad (with the same gloves on), then turned back to finish. \n\n2) After she finished, she heated up my dish in the microwave. The food didn't even touch any of their hot plates. \n\n3) I got a ton of noodles and a ton of heated up frozen peas (not even sure that's part of the dish?), and a few spoonfuls of meat. \n\nWhat? Why is this place in this awesome market.", "author": "T W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "Ordered the Scallion Oil Noodles, which are pictured on the menu with shrimp. The noodles arrive without shrimp, and when we asked the cashier about it, she claimed that she thought we knew they did not come with shrimp, which cost $3 extra. Nowhere on the menu is this indicated. The noodles tasted like toothpaste mixed with oil. Update: got food poisoning and threw up once we got home. Do not ever go here.", "author": "Caleb W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "The Shanghai Cold Noodle is my one of my favorite foods on planet earth. I cannot find another place that makes something this good. I would die for Hana herself.", "author": "Mary G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-03", "description": "Food here was TERRIBLE. \n\nI was in the mood for Asian food so I decided to give this place a try. It is extremely overpriced for what you get. I had the peanut noodles with pineapple. Let me tell you, the entire thing came with three small cubes of canned pineapple. The peanut sauce for the noodles had no flavor whatsoever. It left me feeling nauseated and I could not even finish the noodles. I also got the pan fried dumplings. It looks like they only fry one side of the dumplings on the pan. Also after eating these dumplings, I was completely indigested. I did not enjoy the food here at all. Also the girls that work the cashier are really rude.\n\nJust skip the food here and try something else!!!", "author": "Jane M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "Quick Summary:\n- Found on the far end of the Market Hall\n- The bowl comes with a lid, so easier to carry around\n- One large serving\n- Air conditioning is good and the place felt cool\n\nThis was enjoyable to visit! There were so many restaurants to choose from and eat, and I wanted to eat at this noodle place. I ordered a hot noodle dish with chicken. I liked the portion - it was just right for the appetite I had.\n\nThere were lots of places to sit, so I took a break here and had a nice meal. I'm not a huge fan of chicken, so I felt there was a lot more chicken pieces that I had hoped, but the noodles stood out. It was just the right texture, nice and chewy.", "author": "Mito I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "Initially meant to come here to try the noodles but ate too much going through the Dekalb Market Hall to order food, so we got drinks instead. \n\nWe got the Thai bubble milk tea and passionfruit iced tea, both large with tapioca and unadjusted sugar levels.\nThe Thai bubble milk tea wasn't very strong like most Thai tea is and it was VERY sweet, definitely recommend cutting the sugar levels (unless you're into that).\nThe passionfruit iced tea, on the other hand, wasn't too sweet.\nBoth bubble teas were still very good overall, but they tend to skimp a little on the tapioca.", "author": "Joy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "Food: 8/10\nService: 7/10\nAtmosphere: 5/10\n\nHana Noodle is a great spot for hand pulled noodles!  It's one of my favorites for a quick lunch break when I'm working in Brooklyn and the weather is cold!  I've tried all of the noodle soups (stick to the traditional beef ones), the dumplings, and the minced pork noodle.  The food is really great, and you can watch the cooks pulling the noodles right in front of you, to order.  The service is typically awesome (including hot oil or soy sauce at no charge, upon request), but my biggest complaint is actually their location in Dekalb Market.  It isn't their fault, but the Caribbean stall next door blasts music so loud that it can be difficult to justify waiting in line for Hana, unless you already know that it's worth the wait.  My tip is to put in your ear plugs and wait it out - hand pulled noodles from Hana are definitely worth a bit of inconvenience.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "Came here since I was craving a bowl of warm noodle soup, and getting the lanzhou beef noodle soup here with 微辣 (low spice), I'd say it partially satisfied that craving. You get a medium sized bowl with beef slices and bok choy in a hot broth. I've definitely had more savory broth elsewhere! The chili oil they add is pretty spicy so I'd recommend getting little to no spice if spicy is not your jive. To customize, you can also choose between rice vs. round vs. flat wide noodles.\n\nPros: Fast service, lots of seating in this corner of the food hall\n\nCons: Portion sizes could've been larger, soup base was average", "author": "Yang Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-14", "description": "Chewy handpulled noodles!!\n\nNoodles tasted great and fresh. Ordered the original beef noodle soup. Soup broth was quite clear for beef noodles and the broth itself was a little too cold for my taste. A good amount of beef and bok choy. Dish was noted to be spicy, and they had a nice dollop of chili oil in the soup, but it was the weakest chili oil I think I've tasted.", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-02", "description": "So I ordered take out from here - chicken noodle soup. I expected more but the soup was a bit bland. I have had better. The noodles are fresh which is good. However the broth is not that good. There is something missy. \nHowever I would not say the other options aren't worth trying. But maybe not the chicken noodle.", "author": "Phi C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-29", "description": "So bad. I ordered the peanut noodles with pineapple and asked if the dish was served \"hot\" - to which they said yes. Well, they use a microwave - which is horrible - and my noodles were still ice cold and the pineapple was legit frozen. What a waste of $15 dollars.", "author": "Ashley M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "Omg great great great noodles easy friendly and a blast to eat, waited 7 months to come back to New York and when I did I can straight to this place if only we had places like this back at home, but I guess you can't win them all", "author": "Alvin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-19", "description": "Awesome service! Great food! This place is quick and conveniently located in the heart of downtown Brooklyn. The Bubble Tea is a must!!! Can't wait to go back !", "author": "Brent L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Came here while visiting from California. These noodles are amazing - I'm surprised that the rating is so low (3 stars at the time of this review). \n\nI ordered the Classic LianZhou Beef Noodle Soup, with medium spiciness. The broth is light and very drinkable, while the noodles have a good flavor on their own. The beef is really tender and soft too.\n\nI feel if I lived here, I would eat these noodles very often - for breakfast, lunch, or dinner.", "author": "Kim N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "So where do I start? This place is perfect, super clean and fast service. Not to mention you can see the guy on the line freshly making the noodles by hand! It was so cold the day I visited and I truly enjoyed my bowl of noodle soup. The flavor in the soup was amazing. Everything about this bowl was perfect from the meat, the spicy sauce and the fresh noodles. I will make another trip to enjoy this again.", "author": "Alise G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-21", "description": "The vegan soup bowl is delicious. The broth is flavorful and the noodles are cooked just right. They have hand-pulled noodles, so make sure to specify that's what you want in your bowl. Veggie dumplings are nothing special. Service is friendly and the food comes out fast.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "I ate here with a friend for lunch and had the langzhou beef noodle soup. I think it had a really good noodle texture which is part of the draw of coming to this vendor. Make sure you specify the type of noodle you want because it's not just hand pulled noodles sold here.The broth is flavorful and yummy.Also make sure you specify if you want it spicy otherwise it may not be spicy enough for you. I would come back and try something else they have on the menu but not for a while- there are so many other places to try at Dekalb Market. The price was a bit steep for what it was but that seems to be the trend in Dekalb Market!", "author": "Kia A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-06", "description": "Hana serves hand pulled noodles, dumplings, and bubble tea. They are located in the back of the Dekalb Market food court, next to Likkle Jerk and Doner Kebab, right next to the big seating area. I've tried the spicy beef noodle soup and, I hate to say it, they were pretty meh. The noodles were cooked al dente and were nice and springy, the beef had good flavor and the right kind of spiciness. However, the dish was served lukewarm and the beef was a bit too salty, which just deflated all my expectations. How does a noodle shop serve lukewarm noodle soup?? Note that dishes a served with a helping of chili oil, which floats on the top and is very typical, but I've seen gwei lo get a bit grossed out. \n\nMaybe if other people come back with better reviews, I'll try it again, but for now its not worth my dollar.", "author": "Suanne L."}], "servesCuisine": "Noodles", "priceRange": null, "name": "Hana Noodle Station", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "408 Albee Square W\nDekalb Market Hall", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/yEv2a-1Cpyl9-sCLfqOrFg/ls.jpg", "@type": "Restaurant", "telephone": ""}