{"aggregateRating": {"reviewCount": 50, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-29", "description": "I was on my way to trader joes and starving! Stopped by Hana because i made it my mission to try all the stalls at Dekalb mkt, and I was in the mood for some noodles. I ordered the minced pork noodle dish. After ordering I found out that the health inspector was checking out their stall. It took 30 minutes to get my order. Anyway, the bowl was good, a little to salty for my taste but the noodles were the best part. I'm pretty sure they were made right there at the stall (I saw the guy playing with dough). I took some home for my gf later and she told me she didn't like it too much. Neither of us we're impressed butbthere are other manu items ofnfourse, so who knows? Maybe i'll try something else if I ever go back.", "author": "Arthur V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-08", "description": "Noodles taste like any boiled noodles you buy in a store. I usually don't leave bad reviews, but this time I have to write it. We placed two orders to go, one of the orders was wrong, my husband got chicken noodle instead of vegetarian. It was very disappointing cause he is a vegetarian. I mean... you really don't want to mess it up that bad! We did not find it out until we opened the bag at home.", "author": "Lilia D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-27", "description": "Ate the minced pork noodles... Immediately after eating a few scoops began to feel nauseous after, both me and my fiance. We ended up vomiting the food not even 30 minutes after. Now we feel sick to our stomach. Noodles were very overcooked, and the pork did not taste or have the consistency of actual pork. Avoid Hana Noodles altogether if you love your stomach.", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "Please note that I haven't tried all their offerings, mostly the dumplings, which I like but didn't find them memorable (wish they have veggie option), a sampling of the spicy peanut dish (which I plan to try the full dish), and the bubble teas (more on that later). I never had their entrees because I never felt that hungry and they seemed heavy. I'm tempted too but looking at most lukewarm reviews here I might pass.  This is mostly about their bubble teas as I am a bubble tea fiend and was pleasantly surprised to find another spot so I don't have to go to Hoyt for Kung Fu or all the way down Court St floor for Vivi (just found out there's a Gong Cha about a block away but I digress) for my fix. Haven't tried all their flavors but the ones I go to the most is the honeydew milk (better than the non milk), which I didn't think I'd like since I'm not a fan of that fruit, and the regular milk tea which I have to say is the best bubble milk tea I've had by far. I never was a fan of the bubble milk teas in other places cuz they tasted so blah, even with the sugar at . But this one, which I get with green tea to not feel jumpy, I don't know what it is, (is it the bubbles, the sugar level, or the color (not white like others but more of a coffee look)?) But I can't get enough of it. Only thing is unlike other places where I can adjust the sugar level and it'll still taste good, here it's best to leave it as is. They don't do slushes FYI. Bottom line, don't know about the dishes but definitely go for the bubble teas for a nice refreshment.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-06", "description": "Dumplings are large but very over done. The dumplings were absent of texture, very mushy.\nNot impressive.", "author": "Guy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Pretty nice place. Ordered the beef noodle bowl. The noodles were good, the vegetables they added were a pleasant surprise. The customer service was great. The workers seem like they actually like their jobs unlike some other places around. When I received my food I was gifted with a nice smile and a thank you and a have a good day. Food's good, service is great, location is in a mall but still pretty good. What else can you ask for in the middle of Dekalb. Not sure if they have deliveries but I would understand if they didn't. The fact that it is in a mall and probably does not get much opportunity is upsetting. However, if they continue the way they're going, I'm sure this place will be a favorite for all.", "author": "Emre D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "the noodles are amazing, freshly hand-pull at the spot. Love their minced pork noodles and pan-fried dumplings. Definitely would go back to try everything on their menu.", "author": "Christine T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "Had the original beef noodle soup. The broth was nearly flavorless. Spiked a bunch of chili oil in there to help but to no avail. Noodles were decent but I won't be back. Too many other better options in the food hall....", "author": "Paul T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "Just tried this place 1st time and only had the dumplings, the dumplings were so good, I can tell the dough is hand made and fillings were very fresh, I am happy finally I can get the dumplings for my kid and not have to worry about it not being healthy. I will definitely come back and try the noodles!", "author": "Celine L."}], "servesCuisine": "Noodles", "priceRange": null, "name": "Hana Noodle Station", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "408 Albee Square W\nDekalb Market Hall", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/yEv2a-1Cpyl9-sCLfqOrFg/ls.jpg", "@type": "Restaurant", "telephone": ""}