{"aggregateRating": {"reviewCount": 50, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "This place has an outstanding great tasting hand pulled noodles , I frequently get superior and I am absolutely amazed by the quality taste it comes with beef slices bok choy scallions parsley instead of the braised beef broth absolutely fantastic . I'd recommend for someone in a quick mood to get something light and satisfying ! Have a great day to whoever reads this", "author": "El C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-02", "description": "One of the best value places in the food hall. Filling, delicious, and not too greasy. Still overpriced compared to other shops of the type in NYC but not every place can be a dirt cheap dumpling paradise", "author": "Cherie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-29", "description": "Food is ok but cashier was so rude. I spoke Chinese to her and she just had to respond back with broken English. I didn't know when to insert my credit card she did not even bother to say insert your card now. No thank you from front to end. Such a shame they hire such a bad cashier. Not coming back for $10 noodles with bad customer service.", "author": "Sherry A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "Ive gone here many times and had a great meal but recently things has changed and quality has dropped... i didn't get enough soup for the noodles and having a good noodle to soup ratio is important...the recent meal tasted slimy. \n\nsome feedback for the cooks and preparer is to ensure good noodle and soup ratio...\n\nedit: i had to boil extra chicken broth.", "author": "Awula Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "3 to 4 stars because I liked the dumplings, but oh boy it's so hard to eat them with the fork.. and then they slip and the filling goes all around. I am tired, need to rest after the \"dumplings fatigues\".\nThere is a set of tables right next to them which is good, at least if it's busy you can seat and keep an eye on your order at the same time.\nOrder comes with 4 dumplings. \nOn the menu they state steamed or fried but they only have steamed now.\n\nWhy did I order dumplings in a hand pulled noodle place?\nI also wonder why...\nI guess because I already had a snack and I was not too hungry for a noodle dish. Easy.\nLooks good though... while writing I am seeing nice bowls around!\n\nTill next time Hana!", "author": "Gessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Hana Noodles is not the place to spice up your life. \n\nThe noodles are fresh and taste great! The soup is more on the brothy clear side. I felt really good after enjoying the original beef noodle soup.\n\nIf I wanted a flavor punch. Their seasoning is delicate and for those seeking more simple or light seasoning.", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "Update! I have gone back several times to try some of the other food here and it was all very good. Especially the steamed dumplings! In my opinion this is one of the better spots in the DeKalb market. The food is very good and the price is within reason that you don't feel ripped off. Wait time and overall ordering experience could be better. Also food while quite good doesn't get to 5 level. But still this is one of your better bets in the DeKalb market.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-18", "description": "If I could give a negative star rating, I would do so. The waitress/cashier was so rude that I left telling the owner that I would not patron again. Quickly browsed over past reviews and seems other people had similar experience with her. \n\nI was asking for my caviar order politely and cannot believe what I saw when she rolled her eyes and gave me a dirty look. She may have a tough day. However, that is not a legitimate reason to treat anyone like that without any reason. If I had a rough day, I would not do the same to her.", "author": "Jenny W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "I never write reviews, but definitely had to today. The food here is terrible. Everything is microwaved to heat and they give you half a piece of beef in the lukewarm beef noodle soup...and what for $12.50? Never again.", "author": "David K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "Well two star mainly because of the waiters there, extremely rude and unprofessional. It happened twice the same day. I spoke to her gently and considered the day might be rough for her. Her behavior was well with her colleagues inside. Despite, letting her know that her behavior was not pleasant in a gentle and polite manner the waitress and rest of staff cared less. \nWhen requested for some soy and chilly oil they simply refused to give.\n\nFood isn't great either, soup and noodles are generic and bland it's not worth the amount of money at all.\n\nI would rather spend my money and time in \"HAN DYNASTY\". The staff there were professional and pleasant. Food is authentic sechzuan comparable to \"famous Szechuan\" in Chinatown.\n\nHIGHLY RECOMMEND TO INVEST MONEY AND TIME IN HAN DYNASTY. NOT WORTH IT HERE.", "author": "Binav S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-12", "description": "I saw this place inside Dekalb Market Hall and figured I'd stop for noodles since It was cold outside. I ordered the classic beef noodle soup, but substituted chicken for the beef...they give you the option.  I was not impressed at all! The taste was very bland. It was definitely not packed with flavor. I wouldn't purchase anything else from here. My friend requested the noodles with peanut sauce and pineapple and they had run out. She got dumplings instead, but was not impressed either.", "author": "Allyson A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "I ordered the scallion oil noodles. First of all, no scallions! I found the balance of sesame oil and salt to be off -  too much for the amount of noodles - making the dish very one note. I definitely should have asked for some hot chili to give some depth and additional flavor to the dish. Wouldn't have minded an egg either. Was told there were vegetables in the dish but only came with bok choi, which I love, but was looking for a little more variety. The noodles themselves were decent. Overall not my fav dish of noodles.", "author": "Susan D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-22", "description": "We ordered the braised beef noodle soup. It was a little on the sweet side. I really liked the hand pulled noodles, you can just tell they were hand made. It was good. We waited a while to get our order which was weird because there was no one else there besides us.", "author": "Axl-Rose A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Best place to get a quick dinner. Noodles are always fresh. Beef is always tender. Tastes just like my mom's noodle soup. 4 stars because of the crowds and setting at city point.", "author": "Edmund L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Deliciously flavored noodles/dumplings made perfectly thin. Definitely the best noodle spot in DtwnBk right now. Overall I obviously highly recommend it. Only complaint I have is the wonton soup if the masa/noodle casing was a bit thicker (or something else) then it probably wouldn't disintegrate, but not a real complaint because I still gobbled them down:)", "author": "Clari B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-03", "description": "It's  situated near the escalator.  Sure wish the mall has a diagram with names/location of eateries and specialty at the bottom of escalator. Hana appeared authentically Chinese: we could see the noodles being hand pulled through the glass partition. The braised beef noodle soup was served hot in a plastic container with nice color presentation (beef with green vegetable and carrot). Perhaps because of the latter the soup tasted sweeter than expected. It was quick and satisfying.", "author": "Geri C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-08", "description": "Takes 20mins for food to come. Staff gives zero cares when you ask how long. noodles are delicious but the beef is mostly fat. The chicken noodle soup was pretty good.", "author": "Jeremy A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-04", "description": "The peanut butter noodles are incredibly disappointing. If you want to eat noodles with some watered down peanut butter then this is the place for you.", "author": "Allie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-22", "description": "Stay away. Tonight I ordered rice noodles and chicken and I stood waiting for it for 35 minutes. To boot, They were nasty when I told them that I'd been there that long. No apologies. No nothing. Very underwhelmed by the service, attitude and maybe ok food.", "author": "Melanie A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-31", "description": "I tried this place at Dekalb market and ordered the minced pork noodle bowl. It looked promising, even though it didn't list any of the other ingredients. It came with tofu, peas, and other things, which wasn't a problem since I'm not picky. However, the sauce was so incredibly salty, all I could taste was salt; I couldn't even taste the pork. I stirred the dish up as much as possible, but it was still too salty to finish. I asked them if I could have some extra noodles to stir in, hoping to dilute the saltiness enough to eat the dish, but they said that would cost extra. Since I had already paid $10, I didn't want to pay extra and ended up throwing the rest in the garbage. \n\nHowever, I will say that the texture of the noodles was good , and I'm happy they take credit cards. It's also nice to have seating right next to the booth.\n\nThis experience makes me to wonder how the other dishes are, but I would not recommend this place with so many other options in downtown Brooklyn, and I especially would not recommend the minced pork noodle bowl.", "author": "Adam C."}], "servesCuisine": "Noodles", "priceRange": null, "name": "Hana Noodle Station", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "408 Albee Square W\nDekalb Market Hall", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/yEv2a-1Cpyl9-sCLfqOrFg/ls.jpg", "@type": "Restaurant", "telephone": ""}