{"aggregateRating": {"reviewCount": 164, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "Food was good my son had burger with fries, which he did not get and i had the turkey sliders, but every time I needed service i had to get up and walk to the waiters to request assistance even for the check , while everyone was definitely served quite well but my son and I was quite ignored which kinda sucked because it was his birthday and didn't get the orders right.", "author": "siomara a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Perfect neighborhood local...everything you'd hope it would be. Great draft choices, excellent cocktails low-key vibe, A+ bar food. Legit Irish bartenders. My mom, a non-drinker is a fan too...the quesadillas are perfection.\n\nMy go-to, fries with a side of honey mustard. Yum!", "author": "Day H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Was here for dinner with some friends in the evening around 7pm on a Wednesday night--- was able to get a seat in the back part of the restaurant.  The server was very attentive and made some great suggestions regarding their food.  We ended up starting out with some wings (which were nice and crispy--- some of the best wings I've had in a while).  For dinner we had the steak frites, salmon, and fish and chips--- all very good.  The favorite at the table was the salmon--- it was perfectly prepared.  I am definitely coming back and sampling more from this menu.  Great atmosphere, attentive staff, and excellent food made this a great experience for me and my friends.", "author": "Chris K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-21", "description": "See What a Bad Manager Can Do to a Great Great Experience\n\nOne Friday night, my partner and I along with our 1 year old visited Custom House, a restaurant that we once frequented often. It was our first time back since we welcomed our expanded family. Unfortunately, the manager does not like kids and went out of his way to inform us of this as we were exiting. \n\nIt's a little sad because we thought the server was kind and attentive. The meal and cocktails were also pleasant. Apparently, the minimal amount of debris (crumbs) left by the baby were enough for him to approach us to complain. \n\nI wonder if he does this to all parties who leave crumbs or only the ones with children. Hope it wasn't deeper than that -- this is America after all.", "author": "Kimberly S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-21", "description": "Extremely over priced for very BASIC diner food. Terrible stay away from this place. Terrible terrible terrible", "author": "Aga N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "WOW!  AWESOME! Super Glad I found a establishment like this!!! Great atmosphere and Super friendly/accommodating staff!\nMe and my party of 4 had a blast! I've recently chatted with a few others after my experience, and they also had good times as well!", "author": "Oscar R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-26", "description": "Went here Saturday night with some friends (5 people) the food was pretty good, brought out in bad order. One of my friends was done eating by the time some others got their food. One of my friends asked for honey mustard 4 times (literally) and was brought to us when we were all done with our meals. We asked for a box 3 times (literally again) and when we ordered, we asked for separate checks. Guess what happened? Same check. Server was rude, inattentive and unapologetic. Could've been a 4-5 star review if it weren't for the service. Our server was Jillian. Horrible", "author": "Mel S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "Manager/owner was the rudest guy in service I've encountered in my life.\n\nI was sitting on an extra chair, the 5th person on a 4 person sitting, to join some friends and didn't plan to have anything. The other 4 people were having breakfast and drinks. The guy came over and asked if I wanted anything, I said no thanks, and he said \"really? You're just going to sit there and drink water all day?? I have 20+ people waiting for a seat\"\n\nFirst of all there wasn't 20 people people waiting. He was referring to people standing around the bar watching the game. The place did not have any queue. Also, I wasn't taking up a seat at a table. \n\nAnd I understand if it's policy that you want ALL patrons to order something regardless, but  anyone in service industry should have the basic EQ to simply explain \"I'm sorry but it's our policy all patrons have to order something\". \n\nDon't have to be a dick about it. we all have once or twice joined friends at a bar and not wanted to order something.", "author": "Charissa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "I always have a good burger at custom house along with a beer or a cup of coffee depending on my mood so far staff has been good with me will be returning soon thanks again.", "author": "Frankie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "Chic hip spot to check out for a drink after work. Happy hour seems pretty biz class. Popped in one or two times last Christmas, and their Xmas decor was stunning!! I have yet to eat here, but can't wait, and will be sure to report back!", "author": "Meri K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-14", "description": "If I could give this restaurant NO STAR I would.  I stopped today  on ASH WEDNESDAY to order 2 grilled shrimp ceasar salads.  I paid for my order, gave a $5 tip for a pick up order, left the restaurant and got back to my office only to realize i was given 2 grilled chicken salads.  I called the restaurant and was in essence told, it was my fault, if i want shrimp i have to pay for new salads. Well, there goes $41 of my hard earned money.  I DO NOT RECOMMEND THIS RESTAURANT AND WILL NEVER EAT THERE AGAIN!", "author": "Yvonne R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "Custom House is a lovely neighborhood bar and restaurant on Montague Street in Brooklyn Heights. \n\nI only went here to drink with friends after a sumptuous dinner in a nearby restaurant.\nThere were few diners and people at the bar when we came in. The place is considerably quiet. The over all ambiance is cozy, especially the leather couch by the fire place in front of the entrance door. \n\nThe sports fanatics sits at the bar since they are showing live sports events on TV.\n\nThe place is pristine with baroque tiles on the floor. \n\nThe staff are friendly and attentive. They checked on us every now and then to see if we needed anything.\nFor me, it's a great place to chill after work day or to come just for a nightcap.", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "Was turned away by the rude bald headed owner because my colleague ordered a MealPal from there and he rudely informed us it was for takeout only.   Even though I was ordering to eat in!! Made absolutely no sense and after reading more comments about him I have a feeling it was more racially motivated than a ridiculous \"policy\"-do yourself a favor a support elsewhere!!", "author": "Christine R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "Popped in around 1pm on a Thursday for lunch. There was plenty of indoor sitting. The outdoor space in the back (about 6 tables) was all full. Like everyone else we wanted to enjoy what is left of summer and eat outside. \n\nThe restaurant is very well designed. It's a mix of bar-scene and trendy restaurant in SoHo. \n\nWe sat out front. It was noisier because of the street, but you'd have no problem carrying a conversation. \n\nMy friend and I got the Steak and Fries, and 1/2 roast chicken. We ordered our steak medium rare and came perfectly cooked. Cooked and seared on the outside and pink to bloody on the inside. The steak was pretty bland. But a tiny amount of salt does the trick and makes it taste 10 times better. I don't necessarily think it's a bad thing. Many people don't want that much salt on their food. This makes it more flexible; just add salt to taste. But I do wish they'd seasoned it better in terms of flavor. If I wanted steak with salt I can easily achieve that at home. The fries were perfect. Very crunchy. \n\nThe roast chicken was cleaned and prepared well, but was the same level of bland as the steak. The skin did not roast at all. More like heated by fire from afar. The meat was very dry. You'd get some fatty juiciness and flavor from the skin. That's pretty much it. The sides of spinach and rice paired the chicken very well. \n\nThe prices are more on the $$-$$$ side. Easily more than the typical $12 lunch. Lunch for 5 came out to a but more than $100. But I do think it's worth the price. I would go back for the atmosphere and food, but maybe not anytime soon. Overall it was an enjoyable experience. The food could use more flavor, but still enjoyable.", "author": "Bennet G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "Big and welcoming with classic bar favorites like spinach dip and burgers as well as some upscale and healthy offerings. Went with a big group and the salmon on the Mediterranean salad was outstanding. The veggie burger was a huge hit as well as the steak frites. Easily a neighborhood favorite but welcoming to out of towners. The cocktails weren't the best but they have a great beer selection.", "author": "Lis M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-17", "description": "I went to Custom House on St. Patrick's Day because of a sign saying live music starting at 7pm. It was a fake to lure in customers. We left at 8:15 and when it was just starting. We asked the hostess and bartender several times about the scheduling and they were evasive about it. It goes along with the employees' attitude and their lack of care for patrons.", "author": "Nick B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-19", "description": "AVOID. This place deserves less than one star.  Like many Yelpers have reported, there IS a bartender here that kicks you out if you dare not order alcohol.  My boyfriend and I were there for 45 minutes to an hour max watching the football game, seated at the bar.  We ordered an app and two dinners, which was definitely a larger bill than just a drink tab alone would have been.  No more than 5 minutes after paying the bill, (and as we are about to collect our things to leave) the big, bald irish bartender comes over and yells at us to get out.  That \"people like us who sit here all night, not ordering drinks, prevent him from paying his rent\".  We looked around confused, thinking that: \n\n1. We were ignorant to people waiting for our seats, or\n\n 2. We were on candid camera.  \n\nBut there were neither cameras NOR people standing around waiting for our spot.   Conversely, there WERE plenty of other empty seats, both around the bar and for table service.  We told him that we had been ordering food since we sat down, that we paid to be sitting there,  and that we were just about to leave anyway, but he continued to tell us to get out, and that if we didn't like the way he did business, we shouldn't come back.  I couldn't believe such a scene was caused over nothing.  It was shocking and mortifying.\n\nIf you are in the Brooklyn Heights area, there are plenty of other great bars and restaurants that are vying for your business, as well as plenty of other hardworking servers/bartenders who are more deserved of your tips.  As for the Custom House, the fact that the owner keeps this bartender here after so many reports of customer mistreatment is a testament to just how much he takes his prime realty in such a charming neighborhood for granted.", "author": "Leigh S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Decent tap selection (not particularly enlightened). Nice environment and friendly staff. Food is mediocre at best. Avoid the spinach dip.", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "Brooklyn Heights has many things; literary history, amazing views of the harbor, beautiful brownstones and one heck of a good dog park. But, sadly we are seriously lacking for nightlife. Luckily Custom House has filled the void with pretty good pub food and a decent beer selection. \n\nIt loses a little bit for being quite loud (something about the architecture of the space just makes it echo-y as all get out) and for being a tad on the pricey side for Brooklyn ($8 a pint). \n\nBut, there wings are some of the best and definitely the best in the local area. Their chicken fingers are fantastic. Burgers and fish tacos are pretty good too. They always have a lot of interesting specials - arrive early or they will run out of meatball heroes. And they're pretty cool about letting us order off menu sometimes (seriously they do need to add a Buffalo chicken sandwich to the menu - they have all the ingredients).  \n\nGreat place for a pint after work or a lazy weekend day and a nice place to sit and have a late night meal. They have outside seating in front and back too, which is perfect for a summer afternoon pint or snack. \n\nAlso, I think \"Custom House\" is just a name, because I asked the waiter about the duties and tariffs on my shipload of timber, household goods, wheat bushels and other sundries from the Continent. He didn't seem to have any idea what I was talking about and for some reason wouldn't let me speak with any other customs officials nor would he give me the address of the Consular.", "author": "Emily P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Love this local spot for sports and week nights when you just want to sit at a bar with a TV. The back area and front also have a lot of character. \n\nHonestly, this is probably more of a 4 star place, but the lack of competition puts this place into a category by itself.", "author": "B C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Custom House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/YA36TCIWwOejtm5eLKilSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436000"}