{"aggregateRating": {"reviewCount": 164, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "Came to Brooklyn on a Monday night for the first time looking for a beer, bite, and some playoff hockey/basketball. This spot had everything, plus a great tap list.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-25", "description": "So rarely am I inspired to write a bad review for a place, since people have off days, but when the bartender and owner are both so clearly in the wrong, I have to say something. \n\nSorry, but if your burger falls on the floor and they try to serve it to you anyway, and you ask for a new one, and they cordially concur, BUT THEN THEY CHARGE YOU FOR TWO BURGERS on your bill, they are in the wrong. \n\nTHEY SHOULDVE GIVEN A REFUND for the additional charge to that nice young girl today, who had an issue with their rancid product. It was unacceptably bad service.\n\nThough I did enjoy the part where the owner claimed airing wine makes wine taste worse than a brand new bottle. Haha. Cheap putrid wine would be better if it sat a few minutes, even though it didn't. That was classic misinformation that I got a good laugh from. I hope he was just being stubborn and rude and didn't believe aerated wine is worse.", "author": "Fair C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-25", "description": "We live in the neighborhood and DID like to come to Custom House on Montague but WILL NEVER RETURN. I ordered a glass of Cabernet Sauvignon at the bar and it tasted old so I asked for their Malbec instead. I ONLY TOOK A SIP OF THE WINE TO KNOW IT WAS BAD AND SENT IT BACK. \nTHEY CHARGED me for the Cabernet anyway!!\n\nWhen we told the owner, he said the wine was not bad and refused to remove the Cabernet from the bill.\n\nHORRIBLE CUSTOMER SERVICE.", "author": "Marika S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "My fiancé and his team are regulars to Custom House so being the fact that I'm curious and wanted to see what he liked so much about this place, he brought a friend of ours and me there for dinner and most of the staff knew him. I definitely liked the ambiance because it wasn't crazy or loud. It was pretty spacious, clean and had a bit of an intimate feeling to it.\n\nMy fiance got the Cajun Chicken Sandwich (but in a wrap) with fresh mozzarella cheese and apple smoked bacon. That's what he typically gets at Custom House and it's his favorite! Our friend just got the French onion soup which looked amazing and was good for a chilly night that night. I decided to get the Mac-n-Cheese and even though it was an appetizer, it was really filling! The Mac-n-Cheese was cavatappi pasta baked in a three-cheese Béchamel sauce, topped with golden bread crumbs. It was probably one of the best Mac-n-Cheese I've had! I would definitely order it again.\n\nOverall, an enjoyable and laid back pub to grab lunch or dinner in. It's opened until 4AM so you can even come here for a late snack or grub. Looking forward to my next visit!", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-31", "description": "Stumbled upon this place that looked inviting walking through Brooklyn Heights. Bartender made my Old Fashioned with Irish Whiskey when the menu specified Jefferson. Tomato sauce on the flatbread tasted like Ragu.", "author": "Derek C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-15", "description": "Excellent. Great service and a solid menu. Bartenders are really attentive and totally professional.", "author": "Jay S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-28", "description": "This place truly has Irish character and warmth, thanks to its proprietors. The food is good-quality -- they do very well by the pub standards such as burgers and fish \u0026 chips, and brunch is really solid too. It's a good place to watch sports. And another enjoyable Irish touch is the traditional musicians they bring in on St. Patrick's Day to perform live.", "author": "Rory C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-13", "description": "I have tried to give this place a chance, multiple times, since it could be considered my local bar. They charge for seltzer water, even when ordering other stuff (on multiple occasions). They play the same playlist everytime I go in. The food isn't anything to write home about. I held off from writing a review, but the last time I went in, I wanted to watch my alma maters's basketball game and only ordered a coke. The bartender put on the game but when I said I didn't want food he threatened to turn off the game since \"no one was joining me\" and \"I only ordered a coke\". To be honest I will probably come back because it is the only bar in the area, but I will do so very reluctantly.", "author": "Christopher H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-10", "description": "Went here to see the end of the Croatia Russia soccer game. Atmosphere was fun and laid back. I ordered what was essentially spiked lemonade but it barely had any alcohol in it. Bummed I paid $11 for basically just lemonade.", "author": "Sydne P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "Great selection of bourbon, whiskeys and ryes!!! I've only sat at the bar for drinks. It's a long marble-topped bar. It can be loud in here but it's merry.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-13", "description": "The first time I went, the service was great. The server (Cedric) was nice and attentive. I had the Caprese pasta with shrimp (it doesn't come with shrimp; I paid $6 extra). It was very good, though it needed more basil. I ordered the French Vanilla cocktail: French Vanilla Ciroc, creme de cassis, pineapple juice, and fresh raspberries. It was delicious.\n\nThe second time I visited, I walked in, watched the hostess look directly at me and continue her convo instead of seating me, waited for 5 minutes, then walked out. They need better service.", "author": "Sonjay M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-30", "description": "Place has gone way downhill. Flatbread pizza was practically raw with supermarket spaghetti sauce on it. Fried calamari was bland and soggy. Bartender was rude and wouldn't switch sound from terrible and out of reach Jet game to a much more exciting Giants game.", "author": "Bruce U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-10", "description": "Always good food. Nice cocktails and wines. Perfect service even when busy. Definitely reccomend", "author": "greg j."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-16", "description": "I enjoy having a local spot to grab drinks and food after work and what not so I was really excited when I moved into the neighborhood with a place such as this.  Strangely this place just isn't welcoming and the service is actually \"terrible\" (bar tender/owner whatever - can't speak on server/wait).  I don't have a specific experience to share but I gave this place at least 6-8 tries before I realized I would rather walk much much farther to get a drink in Cobble Hill or around block up Henry St.  I really hope something else pops up on Montague", "author": "Son-Huy P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-25", "description": "Driest buffalo chicken wrap ever. If you don't want to eat, it's ok. If you do, go elsewhere.", "author": "Matt J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "I've eaten here a number of times for lunch. The food is consistent and the service is good. Their chicken wings are sooo good! I often came here just for those. The drinks are good as well- normal bar prices. This place replaced an old favorite of Montague Street but I'm glad the food and service made up for the loss of an old haunt. They also have a small outside area in the back which is pretty cool when the weather is appropriate.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-13", "description": "I can't give too much of a detailed review of the Custom House.  We popped in here for about an hour to meet up with some friends visiting from the U.K. before heading over to Lantern for dinner.\n\nWhat I can write is Custom House is on the cool and very vibrant Montague Street in Brooklyn Heights. The pleace is pretty spacious inside and comfortable. It did get a little loud as more people filled in the bar area. Our waitress was great and checked up on us frequently. Custom House has a decent selection of beer on tap and in bottles. We didn't order any food but the food we saw coming out from the kitchen looked good. \n\nCustom house is a good choice for a beer or two or three and I would go back if in the area again. Like Emily P. I was a tad disappointed we could not find any one to clear our shipment of widgets while we were enjoying our rounds.", "author": "Richard R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "(It seems the same bald Irish bartender tried his best to ruin another lovely evening. And I also think he's a total homophobe.)\n\nTOTAL DISCRIMINATION. If you are gay or queer or in any way progressive, AVOID THIS BAR. I cannot believe this happened to us in Brooklyn. In NYC. In 2017.  My dear friend and I were hanging out tonight on the sofa, catching up, next to the Christmas tree, enjoying the fireplace. We'd ordered two rounds of drinks, spaced out by two hours--which is normal, a round per hour. Eventually we were sitting closer and I was leaning against her, her arms wrapped around me--- on a big sofa, in front of a fireplace at midnight on a Friday night. She had just closed out the tab. The bartender, not our waiter who had been serving us all night long, came up to us 5 minutes later and rudely and abruptly said: \"are you ordering anything else? because if you're not, you need to leave. Other people want this sofa. So order or leave.\" \n\nThere was no one around us. No one hovering over the sofa-- the bar was not close to being full. No one was looking at us or waiting on us. The bartender was clearly uncomfortable with us, two women, showing affection in his bar. We weren't kissing, not touching in any type of sexual way. Fully clothed, fully appropriate. \n\nWe are shocked.  We pack up our things. I walk over to the bartender and say, \"who? Who is asking to sit on the sofa?\" He replies: \"That's none of your business.\" \"There is no one waiting on the sofa, \" I say. \"We've been here for two hours and have ordered two rounds. You are pushing us out because we are two women showing affection. If we were a heterosexual couple, you wouldn't have noticed us.\" \n\n\"It's time you leave,\" he says. \n\nI should have caused a scene. I was too shocked. I felt disrespected and humiliated. I should have raised my voice so that everyone could hear what he had done. Instead I'm writing this review, calling his manager and  complaining to the BBB. This is the Trump era, the patriarchy fully activated. \n\nDo not support this establishment.", "author": "Julie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "I love going to Custom House. My grandma and I eat brunch there every Sunday. The owners--Red and Oli--are nice people that care about their customers and the positive energy in the place. The food is great: you can add steak, chicken, salmon, or prawns to any of the salads; also the muscles and burgers are really good. Great for friends that want a place to watch the game and have a few cocktails. And also equally as great for family gatherings. They have a front and back patio for when the weather is warmer. The whipped cream is homemade too!", "author": "Lily B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "Don't take this the wrong way, but this is an old person bar. A place where the older crowd goes after work for no-nonsense beers, chain restaurant type cocktails (like choco-tinis), and just the right amount of sass from the bartenders who have seen some shit. Lots of TVs and sidewalk seating. A ton of tables in the back too, and the burgers smelled delicious.", "author": "Kenny C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Custom House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/YA36TCIWwOejtm5eLKilSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436000"}