{"aggregateRating": {"reviewCount": 164, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-11", "description": "Worst place in the neighborhood. They thought that we were drunk and refuse to serve us.... Guess we are not fancy enough for the neighborhood", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-13", "description": "I prefer to not go back and I live just a block away.  The food, basically just bar food, was good and the waiter was friendly and attentive but the space is depressing.  We had asked to sit outside (on the sidewalk) but they wouldn't let 2 people sit at a table for 4 - all but one table were still empty when we left.  The did seat us alone in the \"garden\", a tin and concrete block strip with dying plants in overhead boxes.  Other than being outside, it was not pleasant.  The dining room was not much better.  I'll go elsewhere next time.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-29", "description": "Great Tvs and layout but consistently get sick from the beer and water.  They need to clean/change the taps at that place. It could be the water.  I have to remind myself every 3 months as to why I don't like a place so conveniently located with a desirable layout for sports games.  Fix the taps and it's a great spot but otherwise bring some tums.", "author": "R D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-31", "description": "My friend and I came here for an early dinner. It was my second time here. We ordered the mussels and they tasted really bad. They were extremely sour. The manager claimed that they had them delivered daily. They whisked away our plate, she tasted them and said that there was nothing wrong with them. They then said they would have to charge us, since there was nothing wrong with the mussels. This is just bad customer service. Not likely coming back.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-28", "description": "This place is definitely not worth your money or time. The staff is extremely rude and racist. So at around 1am me and 3 of my friends went here for a night recap. We ordered our drinks, sat down at the couch ( all the tables were free) and chatted while having our drinks. Not 10 mins after we finished our drinks the bald bartender came over to tell us that we had to leave, that their establishment is not a Starbucks and there was no \"hanging out\" allowed. Keep in mind that while we were there none of the white customers ordered a single drink, nor were they asked to leave. Me and my friends thought oh okay the bar must be closing but as we were getting ready to leave, none of the other customers were asked to leave or even harassed for \"hanging out\" at the bar. This place is total garbage and I wish I could get my money back. Not worth your time. Also that bartender needs to be fired as I have read other reviews of his rude and unpleasant demeanor.", "author": "Iyesogie O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-03", "description": "The food, space and drink selection are average. So three stars. It's a pretty standard Brooklyn attempt at a brewpub, with white walls, a long bar and plenty of seating. True to form, there are some attempts to elevate the standard burgers and wings with some inventive salads and crab sliders.\n\nA highlight was the spinach dip, which boldly was much more spinach than dip, but wound up being lighter and more flavorful than elsewhere. Pretty great. \n\nThe beer list has a  couple of local beers, a few moderately upscale imports and some domestics. It's not inspiring and takes almost no chances. Experiment! We're in Brooklyn, we can handle it.\n\nAs it stands now, there's no compelling reason to go back, but also no compelling reason to avoid a second visit as well.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-28", "description": "Why do I make such thoughtless food choices when I drink?  Grand Canyon is right next door!\n\nI hate to be so negative in my review, but after coming here 3+ times, and spending 3 times more than I truly believe the food was worth, I can honestly say I won't be back for their food, drinks only.  This rating has nothing to do with the service or atmosphere, either.  It's strictly based on the food/pricing.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-23", "description": "Terrible place to eat food. Don't eat. Just drink there. I ate there twice and both times awful. My buffalo wrap was dripping with sauce. It came sloggy and salty.", "author": "Wilson L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "Very good veggie burger! The inside was green, which makes me think there are avocados in it. There were also whole peas and pieces of corn, which was a nice surprise. The side salad that came with it had too much dressing, but that may just be a personal preference. The meal itself is the perfect size to fill you up without weighing you down.\n\nPinot grigio is definitely worth a mention.\n\nCute interior, with a decent amount of tables and room to walk around near the bar.", "author": "Rianna G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-04", "description": "Walked into the Custom House at 4:00 on a 100 degree day dripping with sweat...Desperately seeking a glass of water before I had a \"real\" drink. Was very dehydrated and there was no place to sit down. Patiently waited for the customers in front of me to finish their order, and then kindly asked the (angry) red headed man behind the bar if I could please have a glass of water. He snapped, \"We don't do that here\". \n\nConfused, I then turned to my sister and asked what kind of beer she would like. She responded IPA, so I kindly asked the man if I could order an IPA for her along with a glass of water.\n \nAgain, he said no and then turned to my sister and said, \"And for the little person?\"pointing at me (FYI I am plagued by insecurities about my height). She politely responded, \"She will have a water for now, and then will order a beer\". He said, \"NO! WE DON'T DO THAT HERE. SHE NEEDS TO ORDER ALCOHOL.\" \nI then jumped in and asked, \"You do not serve tap water? I have never heard of that... I guess I will order a bottled water.\" \nHe refused to bring me water and I had to ask a different waitress. I almost passed out. \n\nI will not be returning to the custom house. You shouldn't either.", "author": "Prinz S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-17", "description": "I was walking in what will be my new neighborhood, anxious to check out new places. The reviews were good, and the place looks great.\n\nThree big screens on a Sunday afternoon all with the soccer championship from Europe - would have been great if they chose to put the baseball on one, but, hey, everyone seems into this tournament, so no complaints.\n\nI LOVE the layout of the place - its comfortable, clean and cool.\n\nThe bartender was nice enough to me, though inattentive at times to customers at the bar.\n\nOrdered the crab sliders with fries, $9.95.  Not an unreasonable price if it had been better, or if there had been three sliders rather than two.  I had to ask for salt, pepper and ketchup,.  No lettuce.  No tartar sauce.  Fries were generic diner fries but cold and tasteless, crab dips (cannot call them crab cakes) were also cold.  I KNOW sliders are small - this was tinier than small and only two of them.  Bread was not toasted and bland.  Presentation surprising unappetizing for a place with this much emphasis on decor.\n\nWoman next to me at bar - who took five minutes to get the bartender's attention though there weren't even 8 people at the bar - said burgers were bland - maybe she was just unhappy with the service.\n\n$7 for a pint?  A bit much.\n\nNot much to recommend.  I will say I politely mentioned the food issue to manager as I left, nice gentleman with Irish brogue, and he was very nice and apologized and said he would have tried to fix if I had brought it up to him when served, which, in fairness, I did not - what would they have done, heat up the fries?  Should I really have to ask for tartar sauce for crab cakes and ketchup for fries?", "author": "Jb B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-05", "description": "Average food, with slightly above average beer on tap, including Boddingtons, which does make me happy.  Decent service, a nice outdoor dining area.  Not bad, but don't expect to hear angels singing.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-18", "description": "It's a tall order to open a bar around the corner and not pull at least three stars from someone like me, but Custom House is up to the task.\n\nI've been to this Montague Street establishment a few times since it opened earlier this year. I was pretty excited for its arrival, as anyone who has spent time in the Heights knows that the bar options, especially around Montague, are pretty damn weak. Atlantic Avenue has some decent spots, but they're mostly cash-only and a little out of the way for North Heights folk. Henry Street Ale House and Jack the Horse are great, but certainly have their limitations.\n\nEnter The Custom House, a comfortable-looking, versatile bar that could have easily claimed its spot as the all-occasions venue at the heart of the neighborhood. And really, the beers here are not the problem. They have a decent selection of craft and macro stuff, and they're cold. They aren't cheap, but it's Brooklyn Heights, after all. The problem with Custom House is the food. It's terrible. Really some of the worst bar food I've ever had in my life. Fries that are clearly frozen and straight out of a bag. Wings that taste like something I'd pay $14 for at Yankee Stadium. Dry, perfectly bland sliders. Everything is just so blah here. And, as with the beers, it isn't cheap.\n\nI'll give the House a star for being fairly spacious and a good mix of indoor/outdoor seating, but I've yet to leave this place feeling good about the time and money I've spent here. If you're looking to drink a few beers and you absolutely need to watch a sporting event on a television without leaving Brooklyn Heights, this place is an option. I'd probably still walk to O'Keefes on Court Street, but you can probably have a decent time here if you try. Just remember to skip the food.", "author": "Brian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "Great martinis. I ordered a slightly dirty Belvedere martini with blue cheese stuffed olives. Just the right amount of dirty and perfectly measured out and chilled. Kudos to the bartender!", "author": "Kristen F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "I came here only for drinks + if I find myself in the area again, I'll definitely be back. The prices are pretty good for the area + the overall look of the bar is great. It's an inviting bar with a lounge area with a couch, an outdoor area \u0026 three large TVs at the bar. The staff is great - they are really nice, friendly, and extremely accommodating. My clumsy self spilt my drink and I was given another one. I didn't even ask - the bartender really didn't have to do that but he said it was no problem and there wasn't any attitude towards having to clean up the mess. This bar is definitely a great addition to the area.", "author": "Jess P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-20", "description": "Sexist, homophobic, and rude bartender. I decided not to go there again after I saw him making disgusting comments to two young women who were showing each other affection.", "author": "Ahmet H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-26", "description": "Although I'm still mourning the loss of the Italian restaurant that used to occupy Custom House's building, I came here last night for a law school function.  I guess they're doing pretty well, considering it was absolutely packed on a Thursday night, so much so that I found it overwhelming.  \n\nIt's a nice enough bar, with a decent selection of beer on tap and plenty of good wines as well.  The food looked good but I have yet to try any myself.  Also, prices are not $$$$, not sure what's up with that...", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "The bar area of this place is super nice. I love their marble bar and the three huge screens behind the bar. Its a great place for watching sports or for a chill drink when there is no game on. Their food is ok but they have a nice selection of beers and wines as well as fun seasonal cocktails. The staff are super friendly and service is fast. Its a nice spot for a quick drink, bar snacks or brunch.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "The margarita flatbread is delish and reminds me of margarita pizza. At $8.95, this dish is one of the cheapest vegetarian dishes on the menu and I enjoyed it with a bottle of Cabernet-Sauvignon shared with two others, which made more sense than buying three separate glasses.", "author": "Adrienne Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-07", "description": "Cocktails are good. One time I had really great service. Another time I had a very rude waiter. Food is kind what you expect from a sports bar.", "author": "Quinn J."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Custom House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/YA36TCIWwOejtm5eLKilSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436000"}