{"aggregateRating": {"reviewCount": 164, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "Came here for happy hour and I was not disappointed. Great service at the bar. Our bartender Alise  was a treasure. I would come back just for her. Will certainly be back.", "author": "Cathy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-26", "description": "We were visiting family in Brooklyn Heights and decided to stop here for lunch. It was pricey, mac and chz was $11.00 and was not that great. I had the quesadillas and actually they were pretty good, partner had french onion soup and it was very plain tasting, not onion-ey enough, beers are priced reasonably. We went back later had the mussels and drinks. It was ok, my favorite thing was Jimmy, our server, very friendly.", "author": "Teri S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-08", "description": "Went in last wednesday. My 2 pieces of advice are: 1. If you aren't going to have a happy hour, don't say that you have one on yelp just to draw people in. 2. Tell the blonde behind the bar to focus more on attending to customers and less on playing with her hair and staring at herself in the mirrors behind the bar. Got no greeting or acknowledgement whatsoever even though there was barely anyone in their.\nMy husband and I chose to sit at one of the high bar tables in the front so we could still watch TV. Proved to be a good choice. Wait staff was nice and actually attentive. Food was pretty good. Bland menu but they had a nice selection of specials that we chose from. Place has potential to be better, but not a bad choice overall.", "author": "Natalia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-20", "description": "Looks like it would be a fun place to go for dinner or drinks but not the best place for brunch. Limited entree choices. The help was very slow and mixed up my order several times. Because I am lactose intolerant, I can be pretty particular with my order and the manager came out and tried to argue with me that I should not be eating eggs, because they are dairy...ummmm, I beg to differ.", "author": "Emily T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "We went during Custom House's first week open (which is usually a risky move b/c of kinks, etc) and it was incredible!  The space itself is worth seeing - incredibly tall ceilings and outdoor seating in front and behind the restaurant.  Beautiful.\n\nThe beers were fairly standard for a pub but the selection was huge (~30 taps), though it was a bit pricey at $7.00/pint.  There are also huge TVs behind the bar which we will definitely take advantage of during football season.\n\nThe food was great!  I got the Bistro Burger, which was a burger with an oozy fried egg on top, bacon, and a dijon shallot sauce - it was absolutely perfect.  The burger meat was good and juicy and blended perfectly with the saltiness of the bacon and the semi-sweetness of the sauce.  Although I love me a good burger I had said at the beginning that I would only eat half of it and after 10 minutes I had mistakenly eaten the entire thing - I couldn't resist, it was that delicious.\n\nI really hope Custom House is successful because it would be great to have another bar in the Montague Street/Brooklyn Heights area!", "author": "Kathleen C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-18", "description": "Stopped in here for a beer and a bite after viewing a movie at the nearby theater. I liked the decor here, except the TV looked out of place. I sat at the bar and ordered a hitachino, the calamari and the custom house burger. Calamari was good, but it needed salt. The burger was okay, it came with bacon that was chewy instead of crisp and the onion dijon was plopped in one spot, not spread out. Again it was under seasoned. I got the check, which was around 50 something, I was a little surprised, the beer was 11 dollars. Next time I'll check out the seafood spot next door.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-07", "description": "Food portions were appropriate but not incredibly flavorful; hummus, however, was quite good. Drinks were good. Took a long time to get drinks initially but then it got better.", "author": "John V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-27", "description": "Can't speak about dinner but the brunch is pretty good.  They have a good mix of brunch fare with slight twists - the pancakes are tasty, their flatbread could be much better.  I would give it 3 stars for just the food but the extra star is for the ambiance.  They have great outdoor seating (both up front and in the back garden) as well as a very spacious interior.  Also, the bathrooms are clean and large - two thumbs up for that. Finally, the service we had was pretty nice.  You'll find me hanging out here again on a Sunday afternoon.", "author": "Syddie A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-04", "description": "Restaurant was clean, food was good. The cold Avocado soup was really good. The service was bad. Been in the industry a long time, so I kinda get that the bartender wasn't in the mood to serve food and Cokes at 11:00, but the wood was half full, and we would have been a very easy 20% for half an hour of below average service. Problem was it was below below average. He didn't run the food, didn't ask how the food was, or didn't offer refills. Three pretty basic service standards.", "author": "Ian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "Friendly service, a great environment and delicious food. The chicken fingers are my absolute favorite because they are hand battered and fresh, definitely not frozen. Custom House has become my after-work spot for sure!", "author": "Kayla B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-28", "description": "So i find it fascinating that since I posted this review, no less than 7 randoms have written me on Yelp either in message or in the guise of a \"compliment\" telling me that I need to go to Custom House on X night when X \"the best waitress\" will be there. Each of these \"best waitresses\" is described in detail. All these notes feel like form letters. This is public please to whoever is doing this to stop the nonsense. I will never approve any of these \"compliments\" for posting. If you really want me to feel better about this joint, have the owner or manager write a response to my review that actually sounds genuine and interested in addressing the situation rather than spamming me with these ridiculous notes.", "author": "Milly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "I gravitate to this place like a moth to light. Okay okay!! I am warming up to CH: it is pretty, inviting and the staff is very very nice.  This is a great addition to Montague Street and I am happy to have it!", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-05", "description": "4th of July, just trying to grab a drink before the fireworks. It was raining, the place looked nice. That is where it all went down hill. First of all the bartender was rude the moment we sat down. Demanding to see my ID before I even actually even order a drink? Okay, whatever. Maybe he was just upset to be working on a holiday? We get out drink quickly, there being a near empty bar, and then I overhear the bartender literally say \"looks like all the %#$@ing idiots came out tonight\" and have a good laugh with an other employee. Three things: I don't care if he was speaking about me, the sheer ignorance to do so within earshot is insane to me. The idiots you speak of are kind of the people that you know....tip you, pay your bills. Then he comes over, and demands we all start a tab or pay right at that moment. I say \"i'm going to finish my drink and then pay\" and he tell me \"that's not how this works\"....UM....Are you joking? No yes, in restaurants around the world, that is how it works. But whatever,  I don't have time to deal with a moody bartender. But oooh, there's a $10 minimum for cards? A policy normally found in a dive bar? The irony is my drink was $9, I would have left at least a 2-3 dollar tip. Such a rigid policy seems a little cheap to me. But whatever, However, at this point I was done. I asked to speak to the manager who was literally right there and let him know what I heard his employee say, and he gives me this shocked look and says he doesn't know anything about that. The bartender  looks at me with crazy eyes, exclaiming \"what are you talking about man\". Once again, whatever. I work in the restaurant industry. And I can deal with a lot of things, slow service, wrong orders, little mistakes, because I get it. It's not easy to always deliver 100% no matter how hard you try. But rude, frankly insulting staff is not cool. Get some employees who have the whole, service thing down. Reading the last few bad reviews was enough to make me write this, because clearly it was not a one time thing. Get it together. Will never be back. Have fun rude bartender, fyi your drink was weak and the menu is uninspired.", "author": "Joshua M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-25", "description": "My co-worker wanted to eat here because she thought the decor was nice.  We ordered the sliders and pasta.  The decor is nice and I am told the cocktails are pretty good but I dont drink alcohol anymore and so I can only talk about the food.  IT. WAS. GOD. AWFUL.  At first I thought this was something I could have made at home and then when I mentioned that to my boyfriend (he ate there once for lunch and had a similar experience) he gave me a face and said \"how dare you\".  The food is pretty terrible which is too bad because the decor and service was pretty good.  Try the cocktails but avoid the food.", "author": "Noam P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-05", "description": "Custom House is a great addition to the Brooklyn Heights neighborhood.  I hosted an event there last week and the entire staff was extremely hospitable and helped make the event a huge success. They easily accommodated our large party and even threw in a few trays of delicious food to serve to our guests. All of our guests complimented us for choosing the perfect location. \nI've also had the opportunity to eat here a few times and the food is really good - very solid, better than your average bar, and great options. Definitely a great place to try, and if you're looking to host a casual party, this is your place!", "author": "lauren l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "Nice new spot for drinks and a bite to eat.  Good dinner menu although we only had appetizers and beer and wine. There's outdoor space in the front and back of the restaurant and a huge bar and separate dining area. Our waitress was very nice and gave me a good wine recommendation. Spinach dip was yummy as were crab cakes.  We'll definitely come back to see how the dinner items are and to sit in the back outdoor space again. Beer prices were average and wine prices were good (many $7-9/glass - rose tasty at $7). Appetizer prices were also fair. Hope they keep up the good service and don't raise the prices when it gets busier.", "author": "christine f."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-04", "description": "The service was poor, the bartenders were rude and the food was bad.  I won't be coming back.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-12", "description": "Not a destination, but a welcome addition to the Montague strip, which sorely lacked drinking holes with ambiance.  It was the perfect location to celebrate my former coworker's departure from NY to move to London.  She spent the evening cheekily perfecting her British accent, with a little help from the waitstaff, including reference's to British pop culture via their iPhones.  We perched at the bar for bit before the group became too big, then moved the crew into the front area, which was warm and cozy.  The high ceilings, fireplace, Christmas tree, and candlelights all contributed to the festive vibe, and the space was more than ample for our group of a dozen.  My beer fiend coworker found the beer list sufficient.  A few of us also ordered the burger and fries, which was on the reasonably pricey end at $11, but was a serviceable meal.  Nothing was spectacular, but all in a solid place.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "Custom House is our new, local place for a couple of drinks and sliders. The wait staff is friendly and the tvs play what ever games are on. We're happy that a sports bar has come to Montague Street.", "author": "Whitney A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-08", "description": "Pretty average bar/food.we were there on a Saturday evening and were greeted by a pretty and friendly Irish waitress we both went straight to main course and were served promptly and efficiently..intact the best part of the whole experience was the service as our waitress was both friendly and attentive without being intrusive..the downside of our visit was the disgusting way in which the supervisor/ manager spoke to the staff..which we unfortunatley both witnessed..this woman sums up everything which is wrong with the world..crass and rude!!", "author": "Bernice C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Custom House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/YA36TCIWwOejtm5eLKilSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436000"}