{"aggregateRating": {"reviewCount": 164, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-08", "description": "Came here for dinner with some friends who live around the corner.  I ordered the Brooklyn Bistro Burger, which came topped with a fried egg (always a bonus) and was cooked perfectly to medium-rare.  It was a pretty big burger - I actually took off the top bun so I could eat it.  The fries were underseasoned, but I was so full from the burger that it didn't bother me as much as it normally would.\n\nService was really spotty - they were really attentive at first, but it took forever to get the check when we were ready to go - and we had to ask at least twice for it.  Check it out if you're in the neighborhood, but not exciting enough to warrant a special trip.", "author": "Krista G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-23", "description": "My go to on Montague when by myself and hungry and want to see people. Sit at the bar. Lots of folks doing the same thing. Comfortable, easy ambiance. Sports on TVs but not overpowering. Quick service. Decent food. Very mixed crowd. Some kids but mostly mature gays and straights", "author": "K C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-01", "description": "I've been here twice, and the drinks were good both times.\n\nUnfortunately, the last time I was there, the service was absolutely terrible. I was there with my husband and a friend on  slow night. We ordered a round of drinks and sat at the bar chatting. We paid with cash and tipped the bartender well. \n\nThe bartender came by, and we asked for some water. He looked right at us, but 10 minutes later, no water. Ok, that's fine. Maybe he forgot. He came by and asked what he could get us. I said, \"We'd like some water please.\" \n\nThe bartender then refused to serve us any water and said that if we weren't going to get anything else we had to leave.\n\nWell...guess what, we WERE going to get something else, but after that rudeness, we decided to leave instead.\n\nAre you even ALLOWED to deny patrons water?", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "Great local bar with great service and great food. There is almost nothing on the menu that is a bad choice. The bistro burger is a special treat with caramelized shallots, an egg and bacon and absolutely add cheese! Try the Brooklyn Heights Lemonade on a hot day. The staff is warm, friendly and always accommodating. In the winter, do not miss the Shepard's Pie and to wash it down, they might just make the best hot toddy in New York.", "author": "Kate M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "Great crab cakes! Drinks were good, glad to have a soccer game on,  and as tourists,  felt we found a gem after our bike ride across the bridge.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-31", "description": "Service is so-so, food is bland and pretty flavorless. Burgers and wraps are ok. Large bar area which is nice if you want to meet a few friends/", "author": "Maura T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "I've updated my review since I first visited this place..It has greatly improved. \nTo be sure this place makes a great watering hole after work..and it's busy as it should be...I find having dinner here a little problematic. The portions especially the sliders are 2 instead of three and the quality is just OK. For a pub it's rather dull with iron looking chairs and tables..Service is good but not great..I would say inexperienced..I don't think much attention is given to the service anyway...", "author": "Jerry V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-01", "description": "Food is just average. Went with a group of coworkers to watch a soccer game. We had a tab open but I didnt feel like drinking so I told the waitress I didnt want anything. She got mad and condescendingly told me I was at a bar so I ordered a coke.  She told me that \"if youre not going to drink then dont come to the bar\" Needless to say not going back anymore.", "author": "J K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "Great Mac n cheese , steak flat bread was pretty good ,cool atmosphere , friendly staff, jimmy was our bartender made us feel right at home, mistook him for an owner cause he was so cool and courteous , really treating me and my five friends well, Me and my boys deff will be back for more grub and beers . Cool place in Brooklyn two thumbs up for the custom house and Jimmy the Greek !", "author": "Pippi F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-12", "description": "nice decor, comfortable setting and not crowded on a thursday evening. \n\nthe food is alright. they make pretty good flatbreads and should expand on that for the bar setting. \n\nboyfriend and i stumbled in for dinner and had 2 drinks, steak flatbread, the spinach portobello salad, and chicken francese. my salad was pretty small for the price but the chicken entree was big and pretty tasty. overall the experience wasn't bad. good for conversation and drinks with a snack. keep an eye out for katie holmes doppelganger waitress!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-22", "description": "Friendly yes. That's about it. Had the flatbread pizza and was quite disappointed. Undercooked with way too sweet of sauce. Old fashioned was bad and beer selection leaves much to be desired.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "Really don't see why this place gets so many negative reviews. Walked right in and a waiter greeted us with a smile, hello and brought menus to where we sat down. He was an absolute doll the whole night. Checked in on us several times to make sure we were satisfied with our drinks and food and was just a charmer. I just wish I remembered his name. I got the mac and cheese which was pretty good. I would've liked a little extra something like the option of bacon or something meaty but it was delicious and rich. Got several of their cocktails and all were delicious. As far as price goes, I didn't feel like there was that much of a difference for the area.", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-21", "description": "This place is down the street from my office and I've been here for many Happy Hours and have never been disappointed. Their service staff is excellent. I was just there this past week a group from work. Great bar for a happy hour with co-workers.", "author": "Bryan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "Great place! Came here for a company party, food was great, atmosphere was great, and staff was extremely friendly. Now I go for lunch every now and then and I have never been disappointed. Food continues to be great and staff continues to be friendly and accommodating. Definitely recommend!", "author": "Michelle J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-02", "description": "The staff here is very friendly and accommodating. But the food is just kind of average for its cost. They don't have an extensive menu. I've never had anything I didn't like there but I haven't loved anything either. I always feel like everything needs just a little bit more flavor.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "I'm here on a short business trip. I needed a pub break with fish and chips and an English style beer. I got it at the Custom House. The beer is cold.  There is a friendly inviting atmosphere and Solid service.", "author": "Mark J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-07", "description": "Good locale for a neighborhood bar too bad the food is average and the management is worse. This place just wants to turn over people and profits and not be friendly. I have tried this place many times and can't subject myself to this type of torture or rudeness any longer. Maybe I'll go back again when they go out of business and it's called something else.", "author": "Rich R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-10", "description": "Wish I could say this night went better.   I stopped by a day earlier and said I wanted to bring 20 of my clients there for drinks the following night.  Thought I would bring some business to the new place on the block, and give them a chance.  The manager said absolutely, gave us a reservation, took my name, and told me she'd put some tables together for us, no problem.  \n\nThe next night all of us show up, and I was told our tables weren't ready, and would be a little longer.  No problem so far.   However, 45 minutes later the other people were still there, and the manager offered my party the \"couch\" around the fireplace instead.   I politely mentioned a couple of times that we had made a reservation (with her), and that she promised we would have an area for me and my clients set aside.   She said there was nothing she could do, and so we were forced to sit on the couch and on the floor next to the couch.  It was embarrassing.   There were open tables, but we weren't allowed to sit at those, because those people had \"reservations.\"   And there weren't enough chairs for us.   The tables we had \"reserved\" were never ready, and so my party spent the rest of the night around a tiny couch, with a waiter that didn't seem happy to be there.   \n\nThe manager came over at the end and offered to comp one of my drinks, but when I got the bill, I was actually OVERcharged.   Bad first impression, bad customer service, just lost alot of business from me.   Really wanted to like it.", "author": "M N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "My wife liked hr salmon salad but my half chicken lacked much flavor and wS disappointing. Server was nice.", "author": "Mark E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "Great spot! I go here often and the staff is wonderful and the food and beverage is great as well!!  When the weather is good, the front and back outdoor seating is great!", "author": "Katie B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Custom House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/YA36TCIWwOejtm5eLKilSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436000"}