{"aggregateRating": {"reviewCount": 164, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "This place was great! The food was delicious and so quick and the drinks were well made too. Not to mention the service was very good. We had a burger with fries, a salmon burger with a salad and wings to start. For drinks I had a martini with vodka extra blue stuffed olives and my fiancé had a blue moon. Everything was wonderful we were very surprised it wasn't busier. It made us have faith in bar food again! Everything is priced right (don't expect dollar menu cheeseburgers and complain when it costs 12 dollars) because the food is clearly fresh and not cheaply made. I'd come here any day if I lived in the area.", "author": "Raven L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-24", "description": "Very nice and friendly staff, good burgers and beer. The location is lovely because it's just 5 minutes walking to brooklyn heights promenad. \nTry Bistro burger and guiness, it's the best match! \nAlso hummus is pretty good with their homemade bread. \nCosmopolitan is like it should be, thanks to bartender for that!", "author": "Renata Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-23", "description": "Update on my most recent Custom House visit and Bozo the Bartender.  Despite spending a few meals at Custom House recently which were rather pleasant, Bozo the Bartender was there this evening.  He made a mad dash from behind his podium, before I had even sat down and confronted me, knowing my name from my review back in November, and telling me to \"F--- off, I will get no service\"\n\nNow I have never owned a restaurant, but I am pretty sure management does not approve of that kind of gutter behavior.\n\nNow Bozo was probably lucky I was in a good mood tonight, because I let his lapse in professional conduct lapse without embarrassing him, which would have been very easy to do in the half filled restaurant, and given his clear anger management issues.\n\nI appreciate management wanting to have an authentic Irish bartender as a draw card for their pub, but I think the days of having European skinheads scraped out of gutters of Europe are past their prime.\n\nIt's a pity because Custom House does a solid job with their food, but Bozo the skinhead has effectively banned me from the establishment.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-24", "description": "Food good, service bad. Would've loved to have another round of beers or maybe a water but server never came back around. Tried paying check after we got it server couldn't be found.. She was having dinner with some other guests apparently \u0026 host was trying to cover her.. Ridiculous have never seen anything like it.. Feel bad for the host so left our tip with him!", "author": "Alison D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-06", "description": "OH MY GOD THE VOMIT. I ran in here as a last resort because I was starving. I ordered a chicken quesadilla. It was disgusting (ESP the cheese, which was like plastic that was melted over garbage that was set on fire or something). I had one forth of the whole thing. I came home and threw up SEVEN times.... I had to take off work and wait like 48 hours until I even felt like a human being again.  \n\nEvery time I even think about it, I get nauseated. Thus, this review was a great risk! So BEWARE.", "author": "lena p."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-11", "description": "0 stars. As many of the other reviews mention, there is an awful awful rude and racist bald Irish bartender who works here.  I was there for dinner recently, and roughly 20 minutes after closing out, the bar tender yelled at us and told us to leave because \"this isn't a Starbucks\". Meanwhile the bar was practically empty! How this person still has a job after all of these reviews is unbelievable.", "author": "Dani K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-28", "description": "Beware!!!!!! This establishment doesn't even deserve half a star, all thanks to one disgusting and rude bartender. It was around 1 a.m. when I went to the Custom House with a few friends for drinks and chit chat. Out of 4 people, 3 of us ordered drinks. The place had a group of about 6 people at the bar; besides them and my friends, the bar was completely empty. Approximately 10 mins after finishing our drinks, the bald Irish bartender rudely comes over and demands that we leave. He rudely said \"you have to leave, this isn't a Starbucks\". At first we were confused and thought the bar was closing, however the group of 6 Caucasian people weren't asked to leave. Well, he was certainly right about his bar not being Starbucks; at least Starbucks gets more business than they do. I would never return here again. The bartender was racist, rude and knows absolutely nothing about customer service.", "author": "Joanne R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "I came here with some friends. We sat outside on a very nice day. I ordered a Cobb salad and my friends had a sandwich and macaroni and cheese. They liked the food and my salad was good. The service was very good as well. I really liked that they did not rush us out after eating. We stayed at the table and ordered rounds of drinks but they did not pressure us in any way. Overall, would return and sit outside on a nice day.", "author": "Jeanine Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-02", "description": "AVOID. This appears to have been amply covered in reviews below but I want to add my voice to the chorus noting that the bald Irish bartender here is one of the rudest people I have ever met. It is inexcusable that the owner keeps him on (unless he is himself the owner). It makes me upset to know that such valuable commercial real estate in our quaint hood is being held by such an unfriendly establishment.\n\nI walked in to the bar to meet a friend to watch game 7 of the World Series over a plate of wings and a drink. I can't drink alcohol bc of medicine I am taking. When I sat down at the bar and requested a water to start, the bartender asked if \"my friend would be holding my hand for a real drink later.\" I laughed that off. My friend was a little late in arriving, and after 5 minutes, the bartender came back over to me and said, \"this isn't starbucks, you're going to need to move on if you aren't going to order something.\" He said this in spite of the fact that (a) the bar was half empty and (b) that I'd already told him that I was awaiting a friend before ordering. I got up and had my friend meet me elsewhere.\n\nLife is too short to deal with a**holes like this. I sincerely hope they fire this guy or the place closes.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "I had my party here last night and it was amazing! The food delicious and not outrageously priced. The drinks are also well priced, the staff is so warm and accommodating. They gave me a tiny brownie with a scoop of vanilla ice cream and sang happy birthday to me. I was so touched!\n\nI will recommend this place to friends and family for future events!", "author": "Layla N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-04", "description": "I came here after work to meet a friend for some drinks and food. Very nice space and impressive draft list. However, I am knocking off a star for no happy hour specials. it's located right down the street from the courts, and numerous office buildings - you have to have a happy hour! \n\nI ordered the veggie burger with the side salad. Good veggie burger and a sizeable portion. The greens were dressed well. \n\nThe bartenders were very nice and gave me and my friend a drink on the house, which I guess in retrospect was just as good as happy hour. Based on the friendly service, good veggie burger and proximity to work - I would come back here. \n\nOh, and the ultimate 90's alt rock place list - amazing.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-19", "description": "Wow.  This place fails to deliver pretty hard.  When I go out and pay too much money for what I can make at home for pennies, I expect very little.  I expect average food and average service.\n\nThese guys are definitely below average on the whole and the management is proud of it.  Classic NYC bullshit.", "author": "Zed I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-03", "description": "Rude bartender! Guy yelled at me for ordering a coke. Said I had to order more to be in the bar.", "author": "Ryan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-09", "description": "If I could give this place zero stars, I would. I've given this place multiple chances given the fact I live within 2 minutes walking distance... Bartenders/waiters have absolutely no training in customer service. The wait time to even get noticed in this place is ridiculous. Food is sub-par, if that. And the waiters, bartenders, AND managers are the most rude, disrespectful people I have ever interacted with. If you want to be respected as a human being, do yourself a favor and head to any other place on this block.\n\nUpdate: witnessed the creepy redhead scumbag of a manager standing outside the restaurant trying to catcall attractive women into the restaurant. Based on most of the other reviews, you'd think this place would try to run some sort of damage control... Clearly not.", "author": "Rachel Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "I love this place so much. Their food and drinks are always extremely good. The waiters are super friendly and fun! Im surprised this place has such bad reviews. I lived in Brooklyn Heights for four years and came here all the time--I have yet to have a bad experience here.", "author": "Ericayup L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "Great ambiance with good selection of drinks!\n\nStopped in for an after-dinner drink. The Christmas decorations were fantastic in an otherwise classically beautiful pub ambiance. They had a fair range of beers as well as some wines. Service was friendly and enjoyable. Lovely place to spend an evening.", "author": "Nathaniel K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-12", "description": "Meh. Breakfast granola had like five  blueberries and one strawberry. Eggs were watery.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "I only came with a friend for drinks; the mango lemonade cocktail was really good and its great to just sit outside, quiet enough to have an intimate conversation and good food/drinks", "author": "Rodge P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-03", "description": "All these years no bartender has asked me \"Are you going to just sit there and drink Gingerale\" I have eaten here before, but did not want to today. This is no way address a paying customer.", "author": "Suhas V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-19", "description": "Mediocre food in a neighborhood full of good food.\n\nUnfriendly service in a neighborhood full of friendly service.\n\nGot hands-down the worst Bloody Mary of my life (tiny and weak), and though I'd never complained about the general mediocrity of the place, I did not want to pay for this.  The manager said that's just how they do their drinks, and essentially told me to get f#$%ed.\n\nSo if you must come here, get a beer.", "author": "R M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Custom House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/YA36TCIWwOejtm5eLKilSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436000"}