{"aggregateRating": {"reviewCount": 164, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "I cannot remember ever being treated so rudely by an owner and server in a food establishment.  I don't feel great about writing this review.  Trust me.  I would NEVER do anything to intentionally damage someone's reputation, and I have NEVER written a bad review.  The owner of this establishment and the waitress (who we think may be a relative of the owner) unfortunately, in my opinion, deserves this.  My husband, who is really spot on with any kind of food and drink gone bad, simply explained to the waitress, in the MOST polite way, that his Guinness did not taste right.  She came back and said, \"The owner is the bartender.  He poured the beer and is certain that there is nothing wrong with the Guinness.\"  So my husband said, \"I think there is.\"  The waitress then asked if we wanted something else.  We ordered a different beer on draught.  The beer came and the food was served-MEDIOCRE at best, trust me.  When the check came, THEY CHARGED US FOR THE GUINNESS even though we didn't even drink it!  \n\nThis is where I have a problem with the Custom House--and I can say that I would not recommend this establishment to anyone.  I approached the waitress and said, \"I think there's a mistake.  You charged us for the Guinness.\"  Her response was, \"Yes, I charged you because there was nothing wrong with the Guinness.\"  Well...  Unfortunately things got heated.  She was explaining how Guinness is poured--we KNOW HOW GUINNESS IS POURED.  I trust my husband 100% to know when something is not quite right.  Even so, why charge a customer with a beer they didn't even drink.  Then things got REALLY REALLY BAD!  The owner came over.  An attitude RIGHT AWAY.  He wanted to explain how he pours Guinness.  My husband did see the beer sitting on the bar for a bit before the owner topped of his Guinness.  That really wasn't the point.  The beer DID NOT TASTE RIGHT.  They assumed we knew nothing about how a Guinness is poured and how a Guinness should taste.  Trust me, Guinness is my husband's first choice for beer on tap and he knows what he's talking about.\n\nThat is totally not even the point.  When I interrupted the owner telling him he should be ashamed of himself for charging a customer who felt there was something wrong with his beer, his response was, \"What do you think?  You know what would happen to me if I didn't charge everyone who ever had a complaint about something they ordered?!!?!\"  Oh my GOD!  I couldn't' believe what I was hearing.  Isn't that the breaks you pay for owning a restaurant? Aren't you supposed to go out of your way to please a customer?  I dunno.  He was SO RUDE.  I could hardly believe it.\n\nNow here's the cherry on the topping...  I told them i refused to pay for the Guinness but then we ended up deciding to do the right thing.  We paid for the Guinness even though we didn't drink it.  We did not, however, leave a tip.  We paid the bill IN FULL.  Upon leaving, I went up to our server to let her know that if she was planning on charging us for the Guinness she really should have told us BEFORE WE ORDERED ANOTHER BEER.  I approached her at the bar saying, \"You should have said, you know I still have to charge you for the Guinness even if you want a different beer.\"  This was her response...  \"MAAM, STEP ASIDE.  STEP ASIDE.\"  She would not even acknowledge that she should have told us she was going to charge us anyway.  And trust me, her \"step aside\" was EXTREMELY THREATENING.\n\nShame on them.  That is absolutely no way to run an establishment.  Even if they thought we had ABSOLUTELY NO IDEA what we were talking about, they were so combative and really not nice at all.  We will never go back.  I'm sure they don't ever want to see us.  But that's really not the point.  Bad manners.  Bad attitude and BAD FOOD.", "author": "Barbara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-03", "description": "Came here for Brunch... This place is a RIP OFF!! First thing is first, the drinks were all watered down! For $8.50 per Bellini I would hope that I can at least taste the drink and not the watered down champagne and mango puree. Ordered Eggs benedict and asked for Smoked Lox instead of the Bacon... got Charged an Extra 7 bucks on top of the 11 that the eggs benedict dish costs, for a lousy COOKED!!(Asked for smoked)  piece of salmon... With all that competition around this place really aught to step up on their A game. \n I Will not be coming back to this joint...", "author": "Tamara P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "I was a Eamonn Doran's fan. It was the first bar I got drunk at when I was of age to drink and growing up in Brooklyn Heights I'd always pass it as a kid and say \"one day I'm going to drink in there.\" So it was a sad moment in my life when Eamonn's closed. BUT the Irish pub made a comeback on Montague with The Custom House and I have to say I am very happy. This place won't knock your socks off with its food selection but it's good pub food and the drink selections are solid. Plenty of beers and liquor to choose from and the staff\nis friendly and helpful. Can get a bit rowdy at the bar on some nights but nothing to be scared of - just enjoy the atmosphere - and be happy Brooklyn Heights has an Irish Pub back on Montague.", "author": "Dean R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-13", "description": "I checked out the bar area of the new Custom House last week and was pretty happy with the new Brooklyn Heights watering hole. \n\nIt's fresh and clean with a familiar appeal. I love the fireplace and couches near the entrance, and the outside seating is nice for a warm summer evening. \n\nThe bartenders were friendly, the drinks were wet, and the clientele was mixed. \n\nI'll have to go back to try some food soon.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "Although Custom House is only a few blocks from our apartment, we've never been inside - except when it used to be an Italian place called La Traviata. So I can't speak to the in-house service or the bar environment. But for delivery orders, they excel in a way that many places fail. The food is solid, always cooked perfectly and always packed well (the missing link for many places that deliver). We've got no shortage of good burgers in the neighborhood, but theirs is really quite good. Love the spinach dip, can't go wrong with the grilled salmon and the salads are fresh. Delivery has always been fast and our orders have always been accurate. It's become a staple in our Seamless order rotation over the last few months. Keep up the good work!", "author": "Laurie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-22", "description": "Breakfast on the weekends is good and the service is great. Dinner was not so good. I order a mac cheese appetizer that was good but my entree (salmon, potatoes and broccoli) was dry, the broccoli taste as if it had been soaked in some sort of wine that did not compliment it, the potatoes were cut into wedges and beyond a doubt the savior of the plate. The service from the door was substandard. No more dinners here.", "author": "Johnson O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Dropped into here to garb a quick drink and use facilities but ended up staying for a few more and some lunch. Really friendly bar staff (Kerry is great), good menu with lots of choice from sharing plates to full menu and overall good vibe about the place.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "great food/ big tv's and fireplace! the bartender Kelly is the best, always friendly and attentive!", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-24", "description": "The beer here in NYC is spendy. In addition, the mussels were a little fishy and unflavorful. Overall, unimpressed with the custom house.", "author": "Cassidy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "Great little bar on a terrific packed street. There's so much to do in this area but make sure you stop in to the custom house for a drink. The bartenders are fast and friendly and pour generous drinks. \n\nTVs inside to watch the game on is a definite plus in my book.", "author": "Nikki T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-04", "description": "Recently moved to the hood \u0026 this place popped up on Seamless. I called to confirm there was no garlic in the grilled chicken, spoke with a really nice guy on the phone, he assured me I was good to order the cobb salad and my boyfriend got the cajun chicken sandwich. The food was tatsy + our fries arrived steaming hot! Happy to find Custom House in our new hood.", "author": "SK H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-20", "description": "This review is specifically for delivery. I ordered one of their flat breads and it came soggy and with the slices stacked on top of each other. I had to eat it with a fork because there was sauce and cheese melted on both sides of the slices. It was a sloppy mess. Don't deliver if you can't deliver.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "I'm honestly shocked that this spot has such a low rating.  Look alive, people - Custom House is great!\n\nThis place keeps their kitchen open super late, in a neighborhood lacking in quite a bit of night life.  The staff is pretty friendly, though occasionally snappy, and the ambiance is hella cute.  Burgers?  Incredible - but get the fries on the side, not the salad.  They have a ton of drink options, and lots of outdoor seating.  A perfect spot for a post-performance hang out by the local theatre kids, or anyone who wants a great meal at a great price with a great atmosphere.  I've been here over a dozen times and have never been disappointed.  Custom House for the win.", "author": "Hilary G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "This place has awesome food but if jimmy isn't working don't bother coming because the other waiters are so rude and don't know what they're doing. \n\n\nThe Brooklyn Burger will be one of the best burgers you ever have. Do yourself a favor and get it medium rare. Thank me when you're done.", "author": "Rose D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-03", "description": "Well, where to start-- I've been in the service industry a long-time so I know it's generally bothersome when a customer asks to be seated in a different section than you prefer but in an empty house I didn't care to be seated next to two chatty Cathy's in a bright corner when I came here for a nice evening dinner with my beau. I was polite to our server in my request but he still made a passive-aggressive \"Oh, I couldn't find you!\" joke as he took ages to bring us waters \u0026 a menu. We decided to have a bottle of wine with our meals--which NEVER came. My burger (the teriyaki burger) can only be described as a pile of vinegar infused cardboard. Nothing appeared to be fresh, and if it was, the flavor had been completely oiled out of it. At the end of our meal-- again, despite the empty house --our server spent a solid 20-30 minutes not bringing the check, and he neglected us throughout the entire meal. Not checking if our waters needed refilling or if everything was alright-- he must have known that it was in fact very far from it. I wish I hadn't wasted my precious time or money on poor food and poor service here.", "author": "Mystery B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-25", "description": "I picked up a burger for lunch. Service was efficient and friendly. Fries were frozen not fresh and mediocre, burger was good and cooked correctly. I probably will not return.", "author": "Nancy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "Came here for an early dinner on Sunday. Had the Cajun chicken sandwich, which was spicier than I would've liked but still delicious. They also have the best side salad! I don't know what that dressing is but it is delicious. \n\nGood beer selection, didn't try the cocktails. Our waitress was friendly an attentive, which definitely added to how much I enjoyed it.", "author": "Maddie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "Cobb Salad and Shepherds pie are delish! Large servings, friendly staff, nice atmosphere. \n\nWorth the price.", "author": "Terrie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-06", "description": "This place is ready for a change, I feel.\n\nThis bar and grill is over-reaching a bit. Attempting to be a bistro with mussels in a white wine sauce and a burger with a fried egg on a brioche is not working out for this small, Irish jewell. \n\nThe service is very good and the bar, one of the only reasons that people go, is large and well taken care of. The food needs a lot of work. \n\nRun by Irish immigrants, the place should be serving pub food like Shepherd's Pie. The executive chef is a little out of his depth. \n\nIt's worth going here if you need a good beer and want to watch a game on one of the screens or if you wanna catch a good brunch on Sunday morning. Other than that, the execution on the food is off.", "author": "Hunter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "Excellent spot for brunch in brooklyn heights.  I'd definitely go with the banana french toast and eggs with bacon, which comes with a huge pile of bacon btw.  Also, coffee is very strong and will wake you right up.", "author": "Matthew V."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Custom House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/YA36TCIWwOejtm5eLKilSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436000"}