{"aggregateRating": {"reviewCount": 164, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-29", "description": "Just had an incredibly racist experience at Custom House at 139 Montague . Staff member was utterly disrespectful about a Black woman friend who went to use the bathroom as I sat down at the bar . Asked about wine got a gruff response from the bartender and then got a menu thrown down at me , the I asked his name which he refused to give and began cursing at me . I  was refused service because of being Black . Then once outside was physically attacked by his drunk friend . Who is the #whitesupremacist #Skinhead running #CustomHouse ?", "author": "Imani H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-13", "description": "I try not to give one stars, but there was not a single redeeming quality to my experience at Custom House.  Rude service.  Overpriced food.  As a customer, their staff made me feel like I was \"in the way.\"", "author": "Joshua D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "Small gem in brooklyn. \n\nI came here on break one day and they are pretty quick. I was able to get in there, order, eat, and have conversation in less than an hour including my walk there.\n\nI ordered their cheeseburger and it was AMAZING! One of the juiciest burgers Ive had. It was cooked perfectly and I had no complaints. Also, their fries are very good as well. I enjoyed my feel to the fullest extent.\n\nThe waitress was also extremely friendly and attentive. I would definitely recommend and come back here often. The only reason it doesn't get 5 stars is because their menu isn't very long and for picky eaters it might be hard to find any beside burgers.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-16", "description": "Foods always been good. Im mostly writing this because of their service. I came in, sat by myself at the bar and watched two servers look up at me and continue to play on their phones and the third just stand there and stare at me blankly. I just wanted a menu.. once i got my food no one checked up on me and It took a while to get the check and their where only 3 customers in the whole place. The manager walked by me with my dirty plates pushed aside and didn't bother to pick them up or ask what my status was. Sort of disappointed. Probably won't go back", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "ZERO Stars if I could - Met a big group of neighborhood friends here on Saturday night around 10, the place was nearly empty with the exception of our group. Most of our friends ordered beers and were getting apps, my friend's husband asked the bartended for a couple of waters (my friend is pregnant, but not showing yet) and the @sshole of a bartender (old irish guy) BLEW UP out of nowhere and goes \"nobody tips on waters man - you want water? go back to the last place you came from and ask them for a water! This is a bar, order a beer or leave!\"  My friend's husband took it in stride, and didn't make a scene (bigger than the one the bartender had already made) partly b/c he's a chill guy and partly b/c he didn't want to draw further attention to my friend's early pregnancy in front of the whole group... We left shortly after and will never be back. \n\nDear Custom House - You are in Brooklyn Heights, not Murray Hill - Age range here is ~30+... If you want a sloppy crowd of young bucks that go shot for shot until they are spilling beers on your floor and puking in your bathroom, consider relocating.  If you plan to serve the neighborhood clientele, swap out that @sshole bartender for someone with some common decency. Until then, never coming back and neither are my friends.", "author": "Mia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "My go to after-work bar. I generally deal with the same two or three employees all who have been nothing but gracious and fun. I have not a single negative thing to say.\n\nFair prices, good food, good drink selection, and excellent service. Id suggest to anyone in the area looking for a late night bar.", "author": "Eliot S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-08", "description": "I like the Custom House, but only go in if the bald bartender isn't there. He is exceptionally rude. They should honestly fire him and the bar would be much better.", "author": "Hana E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-09", "description": "Came here with two girlfriends after a night of square dancing. They had worked up an appetite and wanted food at almost midnight. We stopped in at a cute wine bar and was told the kitchen was closed but the custom house would be open for another hour serving food.\n\nWe walked a few blocks over and indeed, the custom house was open. There was a large party in the front of the restaurant chowing down on food. We snagged the couch right by the entrance in front of the non working fireplace (which seems to have a gas fire that wasn't lit) and my friends perused the food while I scoped out the place.\n\nIn the back, there were tons of people drinking, eating and perhaps glancing at the game on the few tv screens placed throughout the space. One of the first things I noticed was the incredibly high ceilings, birdcage lamps and exposed brick. The interior / ambiance is pretty nice at this spot.\n\nIt took a while for the server who handed my friends their menus to come back. In fact, one of my girlfriends had to get up to go find him to place her order. One of them got the french onion soup and the other got the burger with fries and a beer.\n\nThey both polished off their meals so I would assume it was decent enough. At least it did the job in an area where late night food doesn't seem to be a thing. The area of course is quiet, safe and again - not a lot of noisy bars since this a residential / family oriented neighborhood... although there were a few obnoxious drunks staggering out of the custom house while we were there.", "author": "Camille H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-15", "description": "Easy drinking and dining with a little bit of style, in the neighborhood.\n\nThis part of Brooklyn Heights has been lousy in terms of bars for a long time. Custom House is a welcome addition, a large but cozy spot with a great selection of draghts and a friendly staff that is on it.\n\nCustom House has a lot of TVs and is like a lot of places all over that serve up beer and burgers to a rowdy crowd of sports fans. But they do it in a great looking space, with extremely tall ceilings, marble and wood fixtures, and lots of light. There's also a large seating area on the sidewalk. My favorite area is this odd room between the front door and the bar proper, with a fireplace and a sofa that always seems available.\n\nThe crowd is a lively mixture of locals and people who work in the area. Lots of crusty Brooklyn \"characters,\" too, depending on what game's on.\n\nThe menu is sandwiches and other bar-type food, slightly fancied up and pretty good.\n\nCustom House is a welcome addition to the neighborhood and an easy spot to love.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-07", "description": "Terrible customer service. Ordered buffalo wings and asked for extra sauce and instead was given buffalo sauce on the side. Wtf?? Then lady proceeded to argue with me saying I definitely said that... yeah ok. Then was given attitude for it. I eventually got the correct order and wanted an extra BLUE CHEESE SAUCE, and again got attitude. I understand things cost money, just tell me there'll be an extra charge instead of giving me an attitude about the whole thing, don't mind paying. First and LAST TIME HERE.", "author": "Kastalia G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-07", "description": "Rude management - I can't comment on the food or drinks here so this is basically just a whine fest. But I think service and overall atmosphere is generated by staff and this experience turned me off. Minor incident. Read on if your interested.\n\nI was considering whether to eat here and went in to use the rest room. The manager stopped me so I asked politely if that would be ok and he pointed to the door and said 'for customers only' shaking his head as if I had committed a crime. He could have asked if I was planning to have anything or said anything else, but he assumed I wasn't a customer and it felt to me like I was getting the boot. I'm familiar with this 'rule' and normally would always observe it but a. this is a sports bar b. there are easy and polite ways to act in customer service (I have plenty of experience in it for restaurant and other industries) and this guy failed at it.", "author": "Liana G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-20", "description": "I don't mind the atmosphere. There is outdoor seating in the front and the back. The service is about a 4 out of 10 but nothing so terrible. The food is really not great. I'm hungry and the wait for the food was so long that I am going to eat this frozen microwaved salmon burger before I return to work. \n\nI won't return though.", "author": "India A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-21", "description": "I only come here for the drinks \u0026 I usually sit at the bar. I've had a few of the appetizers but I've never had a full meal here.\n\nI've had the spinach dip, hummus w/pita bread, buffalo wings and mozzarella sticks. All were decent. \n\nLove the ambiance in there. 3 large flat screen televisions are over the bar. They're cool with changing the channel to what ever sports event you want to watch as long as no one is watching. Not too loud. Nice and dim. The tables have candles. Very romantic with the right company. \n\nThe staff was attentive and friendly as well. 4th drink is free!\n\nI frequent Custom House. I'll definitely be back.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-19", "description": "Beware of bald bartender. Incredibly rude and not worth your business. Try a different bar on Montague or Court street.", "author": "Rob O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-19", "description": "The food was good, the service not so much: \n\nOne of the forks fell off the table and I called the server to give to  him and I never got a fork back. After the food was served, I started eating with the knife. We were trying to get the attention of who apparently was the manager or owner to get the fork to no avail. When the server passed by we asked for it. My wife had ask for a tea BEFORE the food and she was asked about it AFTER the food was served. I asked for the gravy on the side and it was over my TexMex Meatloaf. When I made the comment I never got an apology. The server server said he asked for it on the side and offered to change it. At least he did offer another plate. \n\nIt's sad, the food is good. Go if you don't care about the service.", "author": "Jorge B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "server was attentive, drinks were good and food was delish! just got a burger, so did my mom and my dad got a chicken sandwich that he was obsessed with. cute little lunch spot if you're in the area, not too badly priced but not as cheap as other spots in brooklyn. deff recommend", "author": "Kristen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-05", "description": "BEWARE!! if I could give this place no stars I would. The food is bland and overpriced for the quality. The starters were so bad after a few bites. It seemed like it was prepared near chemicals. We decided not to have our entrées. The manager refused to remove it from the bill though it hadn't come out to the table. I do not believe it was prepared either. We spent about 15 minutes going back and fourth. We decided to call the cops. The time it took the cops to come they prepared the food. The cops advised us to pay for the food to end the back and fourth. The server was excellent though. Otherwise the customer service was terrible. The manager even worst.", "author": "Harmoni W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-15", "description": "Zero for this place. I will never go to this place again. Bartender was very rude to me and my friend and then I ask for a manager and he introduced himself as a owner. I was surprised how owner could be so unfriendly to a client! Seems they don't care about customers at all.", "author": "Anna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-12", "description": "Return? Not a destination spot but a good option if your in the area \nAtmosphere (3) - We ate outside. Interior is pretty basic.\nFood (3) - club sandwich (4), fries (3+), Bloody Mary (2 - tiny glass filled w/ ice, only about 3 sips worth of BM)\nService (3) Friendly\nCost = $127 before tax/tip", "author": "Will S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-30", "description": "It's a bar. Decent food. Semi pricey drinks. Big TVs. \nThe only thing that stood out was our waitress didn't seem super interested in taking care of us. We literally had to go up to her 3 times (to tell her we wanted to order, to ask for the check, and for her to run our card). We were certainly very patient and never made a fuss. But every time we went up, she was scrolling through instagram. Sad.", "author": "Nick G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Custom House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/YA36TCIWwOejtm5eLKilSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436000"}