{"aggregateRating": {"reviewCount": 33, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "Pros: \nGreat customer service, unique flavors and delicious\n\nCons:\nThe cost of one is the cost a meal somewhere else.\n\nCost:\n$11 for two bao buns including tip\n\nExperience:\nWe were skeptical about buying these because we didn't know how they tasted and if they were worth the price for small portions.\n\nSo we bought the BULGOGI and KOREAN FRIED CHICKEN, and we ate the Korean Fried Chicken first and that was a mistake because it was so damn good when we finally tried the Bulgogi it just didn't match the same amount of flavor punch.\n\nThe bao bun has always been a problem because they might be too doughy, too hard, too stale and etc but this was was just RIGHT!\n\nConclusion:\nTry it once and try that Korean Fried Chicken because it's EVERYTHING!", "author": "Irving B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "Tried 2 buns and they were great. Maybe a little pricey for the buns but the taste was there. Had the bulgogi and the Korean chicken. The buns were classic, soft, with a bit of chew. The bulgogi beef was sliced very thin and had a hit of vinegar flavor. The chicken was crispy and had a bit of a kick to it. Straight forward ordering board so you can't go wrong. Wife said the bowls looked excellent and may have been a better deal.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "We stopped here for a snack while shopping at the Dekalb Center. I ordered a Spicy Korean Fried Chicken bun and a Pork Jowl bun (with shichimi soy \u0026 scallions). The staff was super friendly and the food was out in no time. It was hard to chose a favorite between the two because they were both mouthgasms. The spicy fried chicken was similar to eating a general tso sandwich only better. The pork jowl was perfectly cooked and the flavors kept unfolding long after you had eaten each bite. We grabbed a couple of beers nearby while we enjoyed these and it was a perfect combo. This is a must try in the Market.", "author": "Renée G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-27", "description": "Damn! Out of all the places I tried at the DeKalb Market Hall, I was most disappointed with Bunsmith. Maybe my hopes were set too high by their Franklin Ave location. I mean, go look at the pictures of their buns on the Franklin Ave Yelp page, they're works of art ... Playboy would have a hard time competing with those buns.\n\nI had 2 buns, the Korean fried chicken, and the Bulgogi beef. Both of which were genuinely not good, like if I had bought 2 of each, I would have considered throwing the other one out. The beef was dull gray, and questionably seasoned, it almost tasted as if they had just boiled it. The chicken was no better. Remember that beautiful chicken bun you saw over on their other Yelp page? Now compare that to the mess I present to you as exhibit A. The chicken was completely drenched in sauce, to the point where it had lost almost all of its crunch, and tasted almost nothing of chicken. Making it even worse, the sauce wasn't even that good. In my dejected state, I forgot to take a picture of the beef bun, but you're probably better off not seeing it; it was as ghastly as the chicken bun.", "author": "Mike F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "At $4 a pop, you want to make sure your buns are all that and a bag of potato chips. And they are! The sweet korean chicken bun is awesome - a big piece of chicken, battered and fried, smothered in sweet sauce. Places beautifully in a soft bun, topped with pickled onions. One can't go wrong.", "author": "Leah K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "Advance notice in case you plan to order the korean fried chicken plate. this is what your investment will be...", "author": "Kevin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "My 1st Korean chicken experience!  Honestly, walking around the market it was my first choice of food to try.  They worker was super nice and friendly.  I ordered a piece of the spicy chicken on the bun.  $4- great price! It was not that spicy and very tasty.  The bun was extremely soft and a perfect combo with the chicken. If you're at the market- give it a try. I don't think your tastebuds will be disappointed!", "author": "Holly W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "I was at city point and wanted a bite. Pretty much everything else was large portion. The bun was perfect size. I got the pork jowl one and it was absolutely delicious. Unlike some other pork buns I've had which usually had one square of pork belly, the pork was roughly sliced and sautéed to just the right tenderness. It's not as greasy as pork belly but still had a good amount of fat, which I liked. \n\nStill waiting for my friend to finish her Chinese pull noodle, I got the spicy fried chicken bun this time. I was told it's the most popular one on the menu and indeed I saw many people getting it. The texture was really nice, a bit like a cross of General Tsao chicken and fried chicken. However, like General Tsao's chicken, it's too sweet to my taste. \n\nI'd definitely come back and try the other ones on the menu, bulgogi beef and the tofu shiitake one. Also extremely interested in their cauliflower nuggets.", "author": "L T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-28", "description": "It was worth it when they first opened. Unfortunately not only did they increase the price, the portion size has been cut down by 1/2. I used to eat there once a week. Have not been back for months now. Food is decent, can be very salty. There are better options  in the food hall.", "author": "Pam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "This is my favorite spot at the hall! Everytime I make a trip to TJ's I always have to make a stop at Bunsmith. I have tried their spicy korean fried chicken bun, pork jowl bun, and beef bulgogi bun. My favorite is the spicy korean fried chicken bun. It was just the right amount of sweetness and spicyness. The pork jowl bun is my second favorite. I did not know was it was and they told me it was pork cheek. It had a good amount of fat and it just melts in your mouth. The beef bulgogi is my least favorite of the three. It was good but did not have the wow factor that the other two had.", "author": "Axl-Rose A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "Very tasty. Bun was super soft. Meat was tender. It was probably the best bun I've had. Would go back again. Clean place.", "author": "Sonia D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-09", "description": "I came here one evening to grab a quick bite while I shopped. I ordered the cauliflower nuggets and a chicken bun. Unfortunately I ended up cancelling the order because I watched one of there cooks/ preparers handling the foot without gloves. He was literally grabbing the actual food with his hands and plating it. Disgusting. When I brought it to the manager and cashier's attention they were unapologetic. To make matters worse the cashier charged my card 3 times instead of actually refunding the money forcing me to call my bank. Smh. What a joke. Won't return.", "author": "Tish B."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Bunsmith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/88rgpfuiDH4wqPXYqx-UIA/ls.jpg", "@type": "Restaurant", "telephone": "+13474066660"}