{"aggregateRating": {"reviewCount": 33, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-20", "description": "I had the fried Korean chicken with bread and I must say i enjoyed it! Had me licking my fingers! The bread was very different , a bit spongy but loved the taste of it with the chicken. \n\nThis spot is located in the DeKalb market food hall and with a whole of options available I'm glad I went with these guys. Spot is a bit pricey but I think worth it. Give them a try if you're around this spot.", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "The soy ginger fried chicken bun was awesome. The bun itself is soft and fluffy - you barely even know you're biting through it. The chicken itself is super crispy on the outside, with a hot and tender piece of meat inside. The options are spicy or soy ginger, and I went the soy ginger route. I started with one because I wasn't sure if I would want to try spicy, but soy ginger was so good there was no point in my trying anything else. I went back for a second soy ginger bun. They are pretty small, but I am glad that I spent $10 on two of them. Also, there is some pink pickled cabbage nestled in the bun next to the chicken, which was a great touch. \n\nThe service was also pretty quick and efficient. Everything was made to order right there. The whole market is a cool spot to hang out, get food, grab drinks. I would definitely recommend.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-29", "description": "Love it. Always been a fan of Bao. \nHad the pork and bulgogi Bao. So much favor. \nThis place can take it to the next level if they produce there own Bao. \nThis place hit home. The wings was on point. Really enjoyed. Spicy crispy tender. What more can you want?\nDefinitely will be back.", "author": "Benito M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-03", "description": "Didn't even have the chance to order because of a very rude employee . I approached the register to order and asked the lady at the register \" Do I order with you\" in a very polite way as she is looking away and no one is at the register ordering . She proceeds to state in the nastiest tone and without making eye contact mind you \" I have a customer \". Needless to say I didn't order and will not with that kinda service especially with all the other restaurants in the immediate vicinity.", "author": "Kern C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-06", "description": "Since Dekalb Market Hall opened, the pork jowl bun here at Bunsmith has been one of my favorite bites in the whole hall. \n\nOne day I was making my rounds though, and I noticed that the menu had changed. I stalked up to the stall, ready to strike down upon the unsuspecting and undoubtedly innocent employee with great vengeance and furious anger...and then I realized that the pork jowl bun was just now being called the \"braised pork\" bun. It's the same fatty, rich, uncannily porky bun, and you better believe it's the best one here. \n\nPerhaps they had to rebrand because \"jowl\" was turning off the masses by conjuring up images of Mitch McConnell's jiggly neck. Is there anything less appealing than Mitch McConnell's neck?*\n\nAnyway, whatever it's called, the pork bun here is stupidly delicious, and the Korean fried chicken is no slouch either. Plus, they come in at like $5 apiece, which is an excellent price for such a tasty bite. \n_____________\n\n*The way in which he's singlehandedly been responsible for much of the recent corrosion in American politics, maybe. Or the rest of his face. But that is neither here nor there.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "First off, get the buns! \n\nMy favorite bao buns are the spicy fried chicken ones. Its deep fried dark chicken meat smothered in chili sauce and garnished with some pickled radishes. The bun is fresh and soft and I would honestly recommend all the buns. \nFor my vegetarian friends (or just tofu lovers) the tofu shiitake bun is delicious. Thick fried tofu in soy garlic sauce yum! \nBulgogi bun is also good! \n\nCauliflower nuggets are amazing. Fried cauliflower is always amazing \n\nDownside is that its a little overpriced. Paid $20 for 4 buns (2 for each) \n\nGreat staff and quick service", "author": "Ellie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "Favorite neighborhood spot that is tucked away deep in Brooklyn. You want Korean fusion with a twist that has a fun vibe? This is the place to be. Biggie adorns the wall. Fried chicken is the bomb. And the beats will keep your head bobbin all night long.", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "This place is delicious but a little pricey. \n\nThe artichoke bun is my favorite. It's truly a flavorful one-of-a-kind recipe that I can't find anywhere else. \n\nThey are about $7 and they're very small. I usually like to eat 3 or 4 of them as an appetizer (lol) but it ends up costing me a little under $30 which I find expensive for a snack. \n\nOther than that, I love this place so much and the staff is very nice and sweet!", "author": "Marley M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "One of my favorite places in Dekalb. Great every time i try it. The buns with meat inside are super tasty and good deal compared to rest of Dekalb. Place is located at far end opposite escalator. Definitely worth checking out.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "Korean fried chicken hits the spot.  Freshly fried and sauced with spicy gochujang.  Comes with corn and edamame as sides.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "Came here to top off my meal with some cauliflower nuggets and I was pleasantly surprised with this purchase. It's pretty substantial so I split it with some friends but I could see getting a bun and a side of this for a meal. It comes with a sauce for dipping and they packaged it to go for me. I eat a lot of cauliflower and this stuff knocked my socks off, I'll be back for the buns!", "author": "Michael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "It's always an amazing feeling when your expectation of a restaurant matches reality. I could even say it was exceeded at the Bunsmith. They have very friendly staff who provide excellent service! More importantly, they serve delicious food! I ordered the Spicy Korean Fried Chicken bun and a Half spicy and half soy-ginger korean fried chicken bowl with rice and a fried egg on top.\n\nThat was a really soft and not \"doughy\" type of bun. The fried chicken was tender, juicy and seasoned all on its own. The sauce just served as an added bonus to an already amazing dish. I was indecisive when it came to deciding between the soy-ginger or spicy chicken again in my bowl. Then the staff member told me I could get half and half and I was sold! Both sauces are amazing and the veggies, egg and rice all came together beautifully in the creation of this dish. \n\nI WILL be back soon!", "author": "Wesley M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-26", "description": "Tbh the only bun I truly cared for was the Korean fried chicken bun. I also purchased the pork belly (also great) and the bulgogi, which I didn't care much for. Overall, it was a little expensive (about $14) for all three, but I left feeling satisfied with my meal. The chicken easily complimented the pork belly, but the bulgogi was simply not good, relative to the other two. Staff is nice and attentive. I would definitely come back to have their Korean chicken bun again", "author": "Tommy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "I enjoy Korean food and very picky on the quality of it. This place satisfies my palate. I ordered the Korean chicken bowl, which comes with white rice, edamame and pickle cabbage. Also ordered the Korean chicken bun and both are delicious.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Had the fried chicken, pork and beef buns. My favorite was hands down the pork, nice combo of sweet and savory. The beef was kind of an odd flavor but not terrible. And the fried chicken was pretty tasty. The largest issue was that it was extremely pricey and I don't feel like the price is justified for the quantity or quality.", "author": "Len N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-22", "description": "Love the spicy Korean fried chicken here; it's amazing. Good service and quick turnaround. The only downside is the rice bowls. They need a lot of work. Not loving the hard rice and cauliflower. Would be better with a softer rice and maybe a salad. \n\nTime to update my review due to their new item: the most amazing fried chicken you've ever had! Jesus I don't know what they do to this stuff, but damn. Perfectly cooked; juicy, crispy, and not greasy. They also make it fresh on the spot. Forget everything else, just get the chicken. They need to rename this place \"ChickenSmith\"", "author": "Charles A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "I'm of a mixed mind about this place. First off, their buns, from the bulgogi beef one I had a few trips ago, are good. Their cauliflower nuggets actually have the honor of being the first food I've reordered in the food hall- my goal is usually to try something new. But they're just SO GOOD! Although, at $9 per order- my gripe here (and It doesn't look like I'm alone in this) is the price. Their buns are almost all over $5/ea now before tax. I mean. It's expensive. And I'm not sure their portions would be enough for most people to be content with just this one item (the nuggets) for a meal. For me they are, but I have an exceptionally small appetite. Worth a try considering how good the food is, but, it might put a dent in your wallet for a food hall meal.", "author": "April H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-14", "description": "For $14, there are many other options available that are worthy of your money at Dekalb food court.\n\nPlain white rice / canned beans \u0026 corns / mediocre fried chicken with some sweet sauce / pickled radish....\n\nYou can do so much better. Come on Bunsmith!!\n\nThis is not how an authentic Korean fried chicken should taste...", "author": "In Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Bunsmith is one off my first stop I mostly go too for a good meal. My go-to most times. Their buns are a must. If you want a meal the bowls are good. Also a beer is a must.", "author": "Davin G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-07", "description": "The good: the food is fantastic! It's not anything too authentic, but it still tastes really good and really fresh. I like the stuff I've ordered here.\n\nThe bad: I'm being GOUGED to eat here. I'm pretty sure the price went up enough that I noticed since this entire place first opened and they also decreased the bowl size. The bowl is the size of my hand and it's $14 (after tax) for two TINY pieces of Korean fried chicken.\n\nI really really liked the food here and have gotten it several times but, after they changed the bowl size and decreasing the portion and upping the price for that tiny thing, I will sadly not be coming back. It's just not worth it for the tiny portion of food (and most of it is rice and cauliflower!! Two things that are dirt cheap. I can get a lot more from the other vendors in the market hall for the amount of money I spent AND I can leave a tip for he employees. I didn't do that for this one since I was so thrown by how tiny the bowl was for the price. Sorry, I'm not shelling out real money for two little pieces of fried chicken on rice, not here, and not again.", "author": "Alex L."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Bunsmith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/88rgpfuiDH4wqPXYqx-UIA/ls.jpg", "@type": "Restaurant", "telephone": "+13474066660"}