{"aggregateRating": {"reviewCount": 213, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Very excellent dinner option for meat lovers. The meat plate for 2 is served to you sizzling hot on the grill pan! Sooo much meat we had to take some home as leftovers! We were seated right away for a Saturday night dinner without reservations.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-23", "description": "After seeing this place sit unused for a number of years after Bonafide Deli moved from this location to Kane and Hicks it was nice to see it reopen as something interesting. Libertador is a high end yet casual Argentinian restaurant with a meat-centric menu. The rustic yet classy atmosphere is beautiful and fits the neighborhood wonderfully. Prices are a bit higher than what you'd want to pay for a weekly casual dinner but is reasonable for what you're getting as most meals are $20-30. To start we tried a couple of their empanadas (2 for $8), we ordered beef and chicken but recieved beef and ham. The crusty dough was perfect but I wasn't thrilled with the fillings, especially as the beef had lots of peppers and even olives inside of it, something they should have described on the menu as my girlfriend loaths them. \n\nFor a meal we split the Parillada Para Dos (mixed grill for two for $45). This comes on a cast iron grill with short ribs, prime skirt steak, new york strip steak, chicken breast, chorizo, served with salad and your choice of homemade mashed potatoes or their \"famous\" french fries provenzal (of course we opted for the fries). I found most of the meat to be a bit greasy and not the most tender cuts of meat except for I believe it was the strip steak which was perfect. The salad came in a tiny bowl on the side which wasn't anything special. The fries definitely did live up to our expectations however, they were super crispy garlic fries that I would definitely get again. \n\nAlthough I wasn't blown away by everything I had here the atmosphere and service was wonderful and I would definitely consider coming back for the NY Strip and fries in the future.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "This restaurant is excellent.  My wife and I ordered the mixed grilled for 2 and it was exquisite.  The service was also great.  I plan on going back soon and I would definitely recommend this restaurant to anyone interested in a good South American meal.", "author": "Julio A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "I have been to this restaurant at least 6 times within the past year.  \nGreat selection of old world, and new world food.  Yet at the essence they deliver well prepared Stakes of your choice. All food is fresh. Staff is courteous. Great casual wine list with great prices per glass. I ordered a glass of red. It had turned. I politely brought it to their attention.  No questions asked. They came to my table with a sealed bottle fresh in hand. Gave me a pour to insure all was good, and it was. \n\nThe only problem, and this has nothing to do with the restaurant.  The neighborhood is changing, and you have your jerseys and transplants ruining the very casual relaxed vibe of this carefully executed decor, and menu.  Sunday through Thursday is a sure shot for a more low key great dining experience. Sorry if you are not a NYC native.  The majority of transplants and jerseys hanging in Brooklyn, can ruin the best dining experience. Whatever happened to restaurant etiquette regarding the way the customer should respect a fine dining establishment??????  I'm being honest yet picky. I'm getting tired of all you to cool for school transplants mucking everything up.  Yeah. Btw. At Least learn your cuisine before you critique it.", "author": "jay r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "One of the better steak places. Great experience,  not a long wait on a Saturday night", "author": "Olesya C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "Came for my farewell dinner form.my old place of employment and the servers were very attentive. Returned today for brunch and received the same attention. Loving it!", "author": "Sara P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "Hard to see why it's packed...the mussels were good and so was the wine but nothing amazing. 2nd time we went and had the same impression the first. Nice atmosphere though", "author": "LeAnne B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "Glad we found this spot! In a nice and quiet neighborhood. It wasn't too busy on a Sunday night. The restaurant is dimly lit and it has high ceiling so it feels very spacious.\nThe food is definitely on point! We ordered sweetbread and yellowfin tuna carpacio as appetizers. It was my first time trying sweetbread, it was grilled perfectly, tender and moist! Got skirt steak and another steak dish for entrees. The skirt steak was cooked perfectly! Seriously to die for! This place is bookmarked, definitely a place worth returning to.", "author": "Christine W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "Consistently awesome, amazing food. The decor is great and so is the wine list. Service is a little slow and uneven, but nothing to really complain about. You will leave so happily full -- but save room for dessert!", "author": "Andrea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Simple food, but executed beautifully. Steak, eggs, avocado, mozzarella cheese, and toast are all simple ingredients but they are fresh, and cooked perfectly and together make a great combination for a brunch meal. The coffee was strong and the atmosphere is very welcoming. Will definitely come back for brunch and maybe try their dinner.", "author": "Gustavo G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "The food is always good, yet no wifi?  What does one do on a Saturday morning with a tablet?  Every other restaurant in the area has wifi - is the password really this important to the bottom line?  Just to be clear,  I was 1 of 2 people in the restaurant at the time. \n\n I had to leave to go to another restaurant that had wifi (fyi, every restaurant in the area has wifi or wifi access).  I adore the owners  but the decisions made  by staff are interesting at best.  \n\nHope things change!\n\nConcerned neighbor.", "author": "A B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Had the 14oz skirt steak medium rare. Excellent  very tender and cooked to perfection savoring every bite.\nThe fries also had a special taste with a very rich seasoning. \nEstablishment is a bit small, but very warm and welcoming.  Very clean , and our waitee waa on point and bilingual. Cheers\n\n Highly recommend to everyone and will be returning soon!.", "author": "Isaiah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "This place is amazing! We chose this restaurant based on its reviews on Yelp to celebrate my mother's 67 birthday and we were NOT disappointed. Mom's request was that she wanted good steak and boy did she and all of us get that. \n\nFirst of all there were 18 of us and some in the party were running late because of traffic. And I mean late. \nThe hosts had our tables ready to go and seated us so we could wait for the rest of our group to arrive. \n\nSome places won't seat you unless the entire group is there AND within a certain time frame. Nope, our hosts were awesome. \n\nOnce the entire group made it in and the food was served everyone and I mean everyone was delighted with their dish. The meat was tender, juicy and just perfect. I don't eat much meat and ordered grilled chicken but I tried my daughter's and nephew's strip stark and porterhouse respectively and quickly regretted it. Don't get me wrong the grilled chicken dish was amazing but it's rare that I have such regrets about passing up a steak. I guess we will have to go back soon and make that up! ; ) \n\nAmazing atmosphere, food and people. Thank you Libertador for making our family gathering an amazing and memorable experience!", "author": "Tania L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "The atmosphere and decor is really nice, good choice of wine, friendly staff and the food was really good! \nParticularly liked the grilled eggplant and the blood sausage.", "author": "Aurelie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-28", "description": "As an Argentinian, I can say I was really  disappointed  with the food. The way they cook the meat, the provoletta wasn't grill. Not a real Argentinian restaurant. They don't even serve the full menu on weekends, which is dumb. Terrible service the staff was rude and didn't even know how the dishes were made. Not a real Argentinian place.", "author": "Jorge O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "The steaks really are great. Food in general is quite good. One thing though - the service can certainly stand to improve - the busboys and servers were all good and on point, but the maître d' was just okay. He could have been more pleasant and accommodating (he seemed a bit anxious/stressed/overworked, but all was forgiven once those steaks came out - delicious! I'd return for sure when in the mood for Argentine steaks.", "author": "Ben G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "We love the ambiance and food. So happy to have this restaurant in our neighborhood. The food is fresh and delicious, especially the meat platter. We wish they had more happy hour food options, but, hey, you can't have it all.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "Finally, I have a place to take my Argentinian mother for a good meal when she visits NYC!\n\nI came here on the coldest of polar vortex nights when all I wanted was a warm meal and big glass of wine. Thankfully I got both served with a smile when I frigidly stumbled into Libertador. \n\nTry the empanadas for sure, and the skirt steak was out of this world. There's even a few salad options for the gluten-free crowd.\n\nWine is a little on the pricier side, but I still think it's worth it to pair with the food here.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-03", "description": "I stopped by this spot for brunch this weekend and was surprised how empty it was. My bf and I tired two different empanadas and weren't impressed when they gave us the wrong kind. We ate them anyways and they were decent. I then tried he burger and my bf got the steak breakfast. Both we're decent but I'm not sure I would come back for either. I was missing the wow factor in the food.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Food and the service is always spot on. The mixed grill really stands out and the wine selection is fantastic.", "author": "Tara G."}], "servesCuisine": "Argentine", "priceRange": "$11-30", "name": "Libertador Steakhouse - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/jSmvGdTiHDB2XRrYBH9XbA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893122"}