{"aggregateRating": {"reviewCount": 213, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "It IS an Argentinian restaurant, but the food is just plain good--whether it's Argentine cuisine or not. I've had the ribeye steak there a couple times and it was one of the best steak dinners I've ever had: perfectly grilled and delicious flavor. It's also inexpensive, given the quality of food and portions. The design is simple, somewhat rustic but elegant, with high ceilings, good lighting, and beautiful large windows on the exterior. The entry doors are often propped open so you get a feeling of being outdoors, and the ambience has a comfortable vibe. It's also in a very nice area on Henry Street in Cobble Hill and a very pleasant and comfortable walk south from Atlantic Avenue. It's become one of my go-to restaurants in Brooklyn.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-09", "description": "My husband is Argentine and we were so excited that this place opened up a few blocks from our apartment. The service and atmosphere were wonderful. One small downside is that the servers do not (as someone else stated previously) know much about the wine. This point doesn't really bother me. \n\nCons: The steak was extremely thickly seasoned with PEPPER! So thickly, in fact, that my husband scraped it off. Argentines just don't cook steak like that. The provoleta was delicious but the portion was about 1/4 of what you'd get in most other NY restaurants even though the price was higher. Which brings me to the final con, and that is the price. Nearly every dish is overpriced by a few dollars. (And yes, the menus is huge...not sure why they have so many salads. Seems bad from a business standpoint, i.e. lots of product and not a lot of money coming in.)\n\nPros: The dessert was fantastic; definitely the best part of the meal. The milanesa was good but not great. Atmosphere and service were good enough to keep me coming back!", "author": "M M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "Get the skirt steak and black beans/cheese empanadas. Skirt steak was a bit saltier than you may expect but still delicious.", "author": "James L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "My gf and I discovered this place en route to another restaurant, confirming that everything happens for a reason. We were accommodated without reservations and enjoyed a fantastic skirt steak dinner in the process. The wait staff (Steven I think ) was friendly and I  got  to chat it up with the owner before leaving. We are both looking forward to dining here in the future. Highly recommended.", "author": "Wesley H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "My husband and I came here with our 18-month-old son for an early weekday dinner. We ordered the meatballs, calamari and parillada para dos (mixed parilla for two so we got a taste of several meats). Not only was the food very good, the service was excellent. They were incredibly kind with our son and since it wasn't crowded, they let him walk around and even played with him in the window telling us not to worry and to enjoy our dinner. How nice is that?!!", "author": "Alissa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "We went here last night, just for a cooling sangria and a light meal, so can't speak to the steak, but the selection of appetizers we got -- mussels, grilled provolone, and Argentinian potato cakes -- were all delicious.  And the service was a friendly as it gets, without being at all obtrusive.   \n\nThe place is pleasant on the eye, but  unadorned and unaffected, and honestly we love it that way.  Smith and Court street have plenty of restaurants striving to please the poseur gourmand, so it's nice to have a place off that well beaten path.  We'll be back.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-12", "description": "We live on the block and were excited about trying something new. \n\nThe atmosphere and the wait staff were prompt, pleasant, and attentive.\n\nThe garlic shrimp was disappointing. Is the shrimp frozen? The flavors have not fused into the shrimp.\n\nMy mushroom ravioli was good, but my boyfriend's seafood pasta was not fantastic. The mussels were actually poor.\n\nI was hoping dessert would save the day, but the apple cake was a disappointment.\n\nThis place has real potential because of the atmosphere, but the food isn't quite up to snuff.\n\nMaybe focusing on a smaller menu might be helpful. Doing fewer things better.", "author": "Darcy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "Had a wonderful dinner last night.  We had an early reservation and were seated immediately. The staff was attentive and friendly. We started with the Beet Salad and an Eggplant appetizer that were very good.  The eggplant was thinly sliced and baked with melted cheese on top and was absolutely delicious.  For entree we had a Porterhouse, a Rib Steak, Lamb Chops, the Strip Steak special with Grand Marnier sauce on the side and three huge potato croquettes, and the ravioli.  All of the steaks and lamb chops were cooked perfectly and well seasoned so they were flavorful.  The Grand Marnier sauce was barely used as that member of the party felt it took away from the flavor of the steak!  The only disappointment was the ravioli which were 6 small ravioli swimming in sauce on a large plate.  I know, it's a steak house, but it was odd to have such a small portion of ravioli for $16.95 when the amazing steaks (all 14oz and up) were between $22-$28. We finished the meal with a flan and a poached pear dessert.  Very nice way to end an enjoyable meal.  Will definitely come back.  A great find. Oh, and the restaurant itself is charming - an old bar/restaurant with beat up wood floors, high ceilings, nearly floor to ceiling windows in front so you can see the charming brownstones across the street.", "author": "Judy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "My husband and I are SO HAPPY this place is a WINNER. We live really close by and are excited to see Libertador join the ranks of the awesome restaurants in our neighborhood. We ordered two Syrah, one from Chile and the other from Argentina-both great. The meatballs are to die for, the empanadas are delicious as is the house salad! We were glad to see it busy on a Saturday night, and despite the rush the bartender was super friendly and calm and our food was fresh and hot. Can't wait to go back with friends!!!", "author": "Rox F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "This place has great food and excellent service. We went on a Monday night so it was not crowded.  The grill for two is awesome and the vanilla ice cream with crushed almonds was the cherry on top.  It's rare for me to find a place that gets right but they do here. Keep up the good work!", "author": "Herm E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "This place is amazing, but the food can be on the rich side.  I went with my mom and we ordered empanadas, sea food pasta, and the steak envolitine.  Everything was delicious, but when served with surgary wnie cocktails, can be a bit too much for one sitting.\n\nI recommend very carefully picking your drink and food pairings and watching out for over ordering, as the portions are sizable.\n\nOverall, amazingly delicious!", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "Came here to Valentine's Day - perfect choice cause I came for my two fav things, my bf and MEAT.\n\nWe ordered a carafe of red sangria, 2 empanadas and the mix meat for 2. Everything was ON POINT. I was crying when I bit into the empanadas cause I haven't had one so good since LA or Maria's Cafe down on Ave C. It doesn't matter which ones you get cause none of them will disappoint.\n\nThe Mix Meat for 2 ($45) is a REALLLLLLLLY good option (price wise and portion wise). As someone who is a happy carnivore, there was so many different types and parts of the cow, chicken and pig just grilling on their skillet between you and your partner. \n\nThe ambience was perfect, although the tables were really close to each other, i didn't even notice other guests when my food arrived.\n\nThe service was rocky at first cause it was a very busy night but after they served us sangria, the service sky rocketed to flawless. I seriously recommend everyone to come here, especially those who are meat LOVERS. I trekked all the way from the city and it was completely worth it.\n\nOverall: outstanding food, outstanding service, TO DIE FOR options of meat and just all around great dining experience.", "author": "Elton W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-24", "description": "So far I've had the arugula salad with grilled pineapple topped with flank steak, twice because it was so good, and the blood sausage.  Yum. Really nice place, cozy  but not tiny. a great addition to Henry street.", "author": "Patale M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "Great food at a great price. The food was fresh and tasty. We all had different meats and they were all good. The seafood soup was spectacular as well as the crab cakes. The service was excellent. I'd go here again.", "author": "Elizabeth G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-08", "description": "This restaurant is absolutely exquisite.  The décor is simple yet very intimate.  The service is amazing.  The waitresses are very pleasant and sweet.  Their empanadas were to die for ! I had the skirt steak and French fries which was amazing,  The steak was cooked to perfection and the fries were delicious.  Overall a great and wonderful experience I would definitely go back !", "author": "Jeanine G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Great find off the not so beaten path.  Had the mixed grill with my Girlfriend, pretty good, but next time I'd go for the skirt steak, best cut on the platter.  Overall really nice place.", "author": "Peter Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "I went for brunch last week with some friends and were pleasantly surprised.  The space is very nice with what must be 15-20' ceilings and with giant windows in the front.  It just has a very nice feel to it.\n\nAlthough, my omelette was on the small side, it's taste and sides were very good.  The others had burgers and raved about them.  I'm looking forward to going back dinner in the near future.  I'm glad to have another great spot to eat at in the hood.", "author": "Casais C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-31", "description": "Poor service. Waited an hour for an appetizer, two hours for an entree. Then, when actually the food comes... Found to have burnt octopus, undercooked empanadas, undercooked eggplant. I will not come back to this place and would not recommend this place to anyone.", "author": "Jennifer Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "Excellent place, nice staff, and super food. Only misses out on 5 stars because one of our dishes was a litte salty. Otherwise, fantastic.\nTRY THE MIXED GRILL FOR TWO!!!", "author": "rob p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "In this former delicatessen with expansive bar, brick walls and original wood floors and homey, welcoming ambiance, we enjoyed a lovely and intimate New Year's eve with our friends who live around the corner from this marvelous restaurant with courteous, congenial, expert and unobtrusive staff. The appetizers of octopus and shrimp were fresh and tasty. Our entrees of grilled salmon, chicken and butter-like steak with salads and vegetables were perfecto! At midnight no one complained that we were still finishing our wonderful desserts. In fact, on the bar counter silvery, sputtery candles were lit and our waiter brought us four flutes of sparkly, chilled champagne as a generous gift. Before leaving we used and admired the cozy, unisex bathroom with pull-chain old-style toilet, recessed brick alcove in which a candle burned and two photos of the three stooges. What a special way to ring in the New Year!", "author": "Serena C."}], "servesCuisine": "Argentine", "priceRange": "$11-30", "name": "Libertador Steakhouse - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/jSmvGdTiHDB2XRrYBH9XbA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893122"}