{"aggregateRating": {"reviewCount": 213, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Top notch service.   They warmed up the restroom before let me get in ( since I visit them on a early brunch during the weekend).  Love that personal touch.  All food taste clean and delicious.  Love the baked empanadas especially the onion one.  I enjoyed the baked eggs with chorizo ( it is not salty like most of the place) and their southern steak breakfast served during brunch is great.  I'll try their dinner on next visit.", "author": "Kammy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "AMAZING. Adorable decor, great service, unbelievable food. We ordered 6 empanadas to start: 2 black bean and mozzarella, 2 beef, 1 corn, 1 ham and cheese. They were delicious and I couldn't get enough! I ordered the 14 oz ribeye and my boyfriend ordered the bone in ribeye.... UNREAL. The steak melted in my mouth it was one of the best steaks I've ever had in my life. No joke. With alcohol, the bill came out to $114. I think that's a great price considering how delicious the steak really was. I highly recommend coming here, I will definitely be back!", "author": "Toni P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Came here for my friend's birthday brunch. After calling about 10 restaurants and being told that they would not be able to accommodate a party of 13, Libertador definitely delivered. It was super easy to book the reservations, and they were extremely friendly and helpful in the process. The food that we ordered was delicious as well. Would definitely recommend.", "author": "Roksolana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-14", "description": "My family has been visiting Balboa Restaurant for years now.  The food is amazing, they have a great selection of cocktails and beers and the desserts are to die for.  We love the atmosphere and the great service!", "author": "Madeline C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-29", "description": "This was the first time and clearly last time. We came from Manhattan looking for good Argentinian food. We ordered the grill meats for 2 and were underwhelmed. The meat was poorly seasoned. The chicken has a rubbery texture  when you bite in to it. The french fries were ladden with garlic. Then the waiter informs us the credit card machine is not working and we must pay cash. This place needs tech support and kitchen support. And the manager or owner should not leave the poor waiter by himself to wait on tables, take phone orders and manage the place.", "author": "Eva V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "Went on a Saturday night around 8:30, it was pretty crowded lots of families so we expected it would be a wait to be seated. \nThe 1st person that greeted us said it would be 30mins for 2, fine. \n\nThe 2nd person came after about 20min and offered us a table but it was in the middle of the floor and so awkwardly positioned we did not feel comfortable sitting there. The staff had to constantly squeeze by us spilled water on me twice while trying to walk by with pitchers of water, so we asked to move or wait for another table.\n\nThey were fine with that but literally just slid the table to the left right on top of a family of 8-10 ppl with kids that couldn't sit still and kept running around the tables. \n\nSo we told the waiter we will wait for another table and they were very nice about it. \n\nNow to the ordering all of the main dishes come with either fries or mashed potatoes. We were ordering the steak \u0026 lamb chops , they were out of both sides they only had salad left. And from looking at the other tables nobody was eating the salad. \nWe were going to leave when the waiter came back and said they had enough fries for 1 side order, fine we got the meat dish for 2 chicken and steak no sausages. \nIt wasn't that great sauce could've been better. Or they could've had some American steak sauce available. \n\nWe got the food around 1030, over an hour for the food so if you are starving eat before you go here because the wait for a meal is crazy", "author": "Sapphire B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "Loved this place!! There were literally only like two servers but they definitely made things work. I brought my boyfriend here for his birthday and everything was great.\n\nSo 1st, I wanted to bring in a birthday cake there was a 3.5$ charge per person, which wasn't too bad because I'm pretty considerate about the ambience of the place and its quiet, calm and romantic, not really a big loud \"Happy Birthday\" singing type of atmosphere. Also I brought a sparkler birthday candle and backup candles and the head waiter said he can use the sparklers if its not too busy. There were a good amount of people but he did for us! (We sat outside tho)\n\n2nd, I don't have too much words for the servers besides that they were just some kind people. They forgot my side order of roasted veggies but we were so full anyways. It's difficult to talk to them over the phone because they dont speak english isn't very well. But if you're patient, they are too and will come to an understanding of what u want.\n\n3rd. So the food, crab cakes, very good. They put gauc on top which is nice but I scrapped off a little cause the gauc was overpowering the taste of the crab itself but still very good. The MUSSELS. Must have. Sauce was so good. I ordered another one to go. The steaks were pretty good also. Not super amazing but for the prices, there good. The sauce on the filet mignon was nice too.\n\nOver all, great dinner and we were both happy.", "author": "Lin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Me and my boyfriend came here on our dinner date. The portions were perfect. I love the spread that comes with the bread. The steak was cooked perfect as well as the octopus. I'll definitely be coming back here again. :-)", "author": "Candace M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Really impressed by this restaurant. Thankfully Yelp found this place for me. It's a real romantic, affordable, delicious establishment. We ordered an appetizer, glass of wine each and two steak entrees coming to $100. Worth every penny! Staff is excellent too. I'll be back without a doubt", "author": "Nychoopaholic B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "This steakhouse is a Very nice and intimate restaurant in the heart of Brooklyn. The staff is very friendly and accommodating. \n\nFood-To start I had the fried calamari which were very clean and tasty and is accompanied by two sauces. For entree I had the rib eye steak (medium) with French fries which was very delectable and cooked perfectly. My date had the skirt steak with mash potatoes and a side order of oven roasted vegetables which she couldn't stop raving about. \n\nDrinks- I had the sangria which wasn't as strong as I liked it to be so it was decent. I fell in the love with their Malbec wine and Chardonnay was good as well\n\nMy only con is since it is a small place it can get smoky in there but if you don't mind the smell of amazingly cooked meat then this place is for you!", "author": "Noel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "This is a hidden gem in Cobble Hill! \nIf you're into music, they were playing Phantom of the Opera and Four seasons, and a few classic violin pieces, with a cool vibe.\n\nTheir server was awesome, he's the one that picked the play list, he was running around the whole place by himself, our table was 10 people, he took very good care of us. \n\nWe ordered pretty much all the steaks, salmon, ravioli, pasta, all the appetizers, that rimbeye was to die for. The server introduced us to their \"Famous French Fires\", do you know why they are \"Famous\"? Cause he put garlic and other seasoning on them, they were so good we ordered another bowl, everyone grabbed them all in two seconds.\n\nTheir avocado smash on crab cake had very good texture, their mussels were very tasty as well. \n\nOverall very good ambience, great for big groups too!", "author": "Weili H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "This cozy Argentine restaurant will attract you not only for the ratings on this app \u0026 Google, it will by seeing it for yourself. The cuisine is exclusively Argentine, which is a rarity in NYC \u0026 not feeling like the \"neighborhood\" spot in the least, if you know what I mean. Classy all around. The virtually all-male staff is attentive \u0026 most likely, the host who\ngreeted you at the door will be your waiter.\n\n      Look out for the vintage phone \u0026 toilet in the single bathroom.", "author": "Timeeka M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "Had a family dinner here recently and we were very pleased. Empanadas were the best I've had so far - not too doughy, lots of different fillings to choose from (I loved the bean and cheese and the spinach ones), the grilled provolone appetizer is divine if melted cheese over fresh tomatoes (with spices) is your thing. Very kid-friendly (kids had spaghetti and chicken milanese, fries were outstanding!), nice sultry atmosphere. Was too full to have a main dish so I tried some of my husband's mixed grill - which was generous enough in size for 2 or more and I'm happy to report it was delicious. Beet salad also gets honorable mention.", "author": "Jen O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Simply amazing! The empanadas are to die for! I was a with a friend browsing the area and we stepped in. We got an order of two and split it. The beef one and onion/mozzarella are sooo good! I could have eaten 2 dozens easily. For the entree we got the seafood pasta and a chicken roulade. The chicken has bell peppers rolled inside and shiitake mushrooms and mashed potatoes. So so good! I ate a bite of my friends pasta which was also cooked very well with mussels, shrimp and scallops. We weren't going to order dessert but then got even more blown away with the choice: The ice cream\n'Charlotte' IS A MUST. Its a square of ice cream cut and rolled with almond pieces then topped with strawberries and frozen Nutella. A M A Z I N G. Round of applause!", "author": "Paulita P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Neighborhood gem. Fantastic food, attentive service, rustic Brooklyn meets Argentina decor. Music was upbeat background music and at appropriate volume. Enjoy.", "author": "Paul C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-27", "description": "The fries were unexpectedly delicious; the garlic and onions medley was like wow. The steak cooked to perfection and the suggested wine by the waiter, on point. (But it did have a sticker shock , when the bill came). The dulce the leche and mocha coffee hit the spot at the end of the meal. We had a great time. + the staff were very friendly and made us feel right at home.", "author": "Diana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-17", "description": "Excellent, service 5/5. Food 3/5. Decoration 4/5.  It was a nice and quiet experience in this Argentinian restaurant. Usually I don't find find places interesting, but Liberator was a nice.", "author": "Joe T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "Excellent steaks! Perfectly done and excellent value!! Great professional service. Very much recommended.", "author": "Danielle A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-20", "description": "The meal started out well. The appetizers were fine (octopus, garlic shrimp and meatballs) and the waiter was very pleasant. Where it went wrong was with the steak. One of my dinner companions had the filet mignon, medium rare. It's not my favorite cut of meat, but it is hers and she was really looking forwards to it. Unfortunately, when it arrived it was a little tougher than the knife and a good 2 ounces of the 14 total was pure gristle. Cutting through the meat was literally impossible. That can happen (when it's not properly butchered) but what was worse was the waiter's response when he was shown the chunk of inedible cartilage -- nothing. No offer to get  a properly butchered piece of filet, nothing. That was disappointing. My other dinner companion had the special, NY strip steak. It was a hard sell (he originally wanted the ribeye off the bone) but he was game so he relented and took the special. That steak was OK, though there was no description of the seasonal side so he was stuck with some melon and corn hash rather than the \"famous fries\" he thought he was getting. My own steak, the 22oz on-the-bone ribeye was unfortunately flat, though it was cooked and seasoned properly. When I get a 22OZ ribeye on the bone, I don't expect a thin stick of a bone and 1/4\" thick steak. A great deal of the steak was attached to cartilage instead of bone (there was little bone) and about 1/4 of the steak went to waste.\n\nThis was an unfortunate evening. It's clear they have a good eye for seasoning and they can cook a steak to order. I am not confident they know how to prepare a steak before it is cooked.", "author": "Douglas P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Ahhmazing. Worth every penny from the drinks and appetizers to it's desserts. Extremely friendly and helpful staff as well. We ordered empanadas, provolone grill, mixed grill and the crepe dessert. Would recommend time and time again. Thank you for this great experience!", "author": "Maranda T."}], "servesCuisine": "Argentine", "priceRange": "$11-30", "name": "Libertador Steakhouse - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/jSmvGdTiHDB2XRrYBH9XbA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893122"}