{"aggregateRating": {"reviewCount": 213, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "Absolutely delicious food and great ambiance! Prices are reasonable. The waiters and staff are extremely polite and attentive. Will be coming back soon!", "author": "Anastasiya M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-09", "description": "Made a reservation in advance and when we arrived the reservation it was useless. Was just 2 of us. Me and my friend from Australia experiencing her first day ever in This country. \n\nLiterally the first worker who spoke to us said our reservation didn't count for anything and to wait in line. No one asked our names, nor cared when we offered our names for our reservation. They dismissively told us to wait by the bar and walked off. \n\nThe small bar - it was so very full we were bothering customers sitting at nearby tables so had to wait outside in the winter air. \n\nNo waiters or other staff gave any care or concern, ignored anyone waiting outside in the cold. It was really really dispiriting. \n\nWe left and went to one of the many other amazing and far more friendly restaurants nearby (petite crevette)\n\nI get they were busy. But I've been to far busier and restaurants and I've never experienced this disregard of customer care.\n\n\nI'll be sure to tell all my friends never to go here based on such a lack of service or basic care.", "author": "Joey E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-09", "description": "Had dinner at Libertador tonight and it was GREAT!  Staff was attentive without being overbearing.  The sauce for the mussels appetizer was delish!  And the grilled meat for 2 was AMAZING!  Enough food for 3-4 people!  Over all it was a really nice experience, glad we tried this local gem!", "author": "Paul B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-18", "description": "Went here for a family member's birthday.\nBased on the majority of the reviews, I was really looking forward to it. \n\nFirst off; I emailed for a reservation and they never responded. I followed up with a call several days later and got a reservation 2 weeks in advance. When we arrived, we got crammed seating right by the door where everyone enters the restaurant. Considering I made a reservation very much in advance, I would've expected a better table. \n\nThe wait time was insanely horrid. The staff was ok, but not attentive and constantly forgot to bring things to us. It took over 15 minutes before we got our order taken and water poured. Then, we waited over 45 mins for appetizers (two of which were salads). Then we had to wait another 15-20 minutes for the main. We saw a table next to us get their meal and finish it while we were waiting. They also constantly forgot to get things to the couple next to us. \n\nAmbiance was very nice, but not well ventilated and a little too loud of a restaurant. We had to yell to have a conversation. \n\nPricing was ok, but definitely on the higher end. The meal for 4 of us was $200. We were full, but the quality was subpar. The appetizers were so tiny!! Stay away from the seafood pasta. It tasted like boxed spaghetti. Also considering how terrible the service was and how short staffed they were, the pricing is not justifiable. Also NOT COOL: they priced sangria at $9 a glass on their menu and charged for $10 a glass. When I flagged it, the main host just said \"oh, we didn't update the menu\". You should probably honor your menu that's put out to your customers. $1 extra per sangria won't break the bank, but that's terrible customer service. \n\nMaybe it's just me, but I felt like the main host picked to be more attentive to only a select few parties who were dressed up nicer (in hopes for a higher tip?)\n\nI live close by to this place and would not return. The price point doesn't match the level of service and quality. I'm highly disappointed in the $200 we dropped on this meal.", "author": "K W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "After being vegan for a few months I decided to have a \"farewell to meat\" party in NYC before I decided to make a permanent lifestyle change to being vegan full time.\n\nMy friend suggested coming here before our paint night and I'm glad we did.  We got there early for dinner and the place quickly got packed, so I recommend reservations.  It's a small restaurant but good for couples and groups.\n\nNeedless to say the meal did not disappoint.  We enjoyed Sangria with our meals.  For our meals my friend got the sirloin and I got the platter with sausage, chicken, steak, and an empanada.  The menu is definitely not vegetarian friendly so I fully capitalized on the meat\noptions.  Everything was seasoned properly and was super tasty.  The steak was cooked to perfection.\n\nWhile our food was delivered super fast, service was a bit on the slow side (-1 star) that I can only imagine being slower when the restaurant is busy.", "author": "Anita A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-22", "description": "Lets start with the positives.\nThe location is great\nStaff is great real friendly\nPrices are reasonable for the area\nPlace is clean and nice\nI was expecting it to be very good.\n\nWhy the 2 starts.\nThe food is not good. I eat argentian food at home and out alot. I can name 10 other places in queens that are 10x better including boca juniors. The steaks simply are not good. All presentation no follow through.\n\nHowever the place is clean and you will not get sick or anything remotely close. Its just bland and highly over rated.\n \nIf you want to understand Argentine food theres an excellent documentary on netflix called asado ( literally translated as grilled meaning bbq)\n\nBtw the deserts are amazing. 5 star", "author": "Jake C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "Went there for the first time tonight. Menu looked reasonably priced online. \n\nThe normal ribeye was $22 on the menu. However the waiter highly recommended the nights 'special' which was a ribeye with a stuffed onion with spinach...so that's what we ordered.\n\n  The steak portion wasn't great, and the special came with a steamed onion with a small filling, a few leaves of steamed spinach, and the price jumped to $37 which we only found out once the check came !!\n\n Its highway robbery to charge an extra $15 for a steamed onion and not even inform the customer of the price hike.\nThe scam 'special' got them an extra $30 on two plates and lost them two new customers that would have continued coming.", "author": "Taher A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "This spot is in the corner of a block outside it looks like a small cafe spot but it's so cute inside. It's small but i like it. I came here for an anniversary dinner with my sisters, their was about 27 of us and we honestly had a wonderful time the food was absolutely great. This was my first time here, I had steak with fries. That steak was banging honestly and the fries were good too. The appetizers were pretty good too. But the desserts were ok. But oversell everyone was really cool and I would recommend someone to eat here for like a date.", "author": "Mickie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "This restaurant is essentially meat lovers heaven!! They have a great selection of wines, the decor is cute for date night, and the food is delicious. We ordered the Mixed Grill for 2 and it was a good amount for us both. It's the perfect choice for those who want to have everything, BUT can never make a decision. You'll get the Prime skirt steak, short ribs, New York Strip steak, chicken breast, choice of chorizo or blood sausage, choice of mashed potatoes or fries, and salad. The meat was cooked medium rare as we requested and it was very well seasoned. We chose the fries and I LOVED it because it paired very well with the meat. It's never been pack the times we've been here (Thursday and Sunday nights) and the service is great. Will definitely be back!", "author": "Gina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "Awesome food great service fantastic wine! What more could one want? Why do reviews on Yelp need to be longer?", "author": "Michael A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-17", "description": "Went here (Manhattan location)on Saturday night for a date. Ordered the mixed grill with an extra side of asparagus. The side only came with 3 asparagus but everything else was great. The meat was seasoned well. We also ordered the mojitos that were tasty as well. The service was good and so was the ambiance.", "author": "Sasha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "MEEEEATTTTT. MEEEEAAAAAT! Just give me all the MEATS! When it comes to great mass quantity AND quality cuts of meat look no further. My better half and I always come here when we need our meaty fill. Get the mix grill for two and you will have a variety of succulent cuts of beef, chicken, sausage. So good. Such a good deal. A beautiful atmosphere and wines by the carafe. Libertador hits on all all cylinders. I wish I could expand on my experiences here, but I come here for one thing.....yea....you guessed it....salad.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Buttery garlic shrimps were cool and yummy! Per my son.  We ordered the Parillada for two and three of us shared it. Excellent quality and very fresh meat.  Very tender and tasty.  Fries were crisp and tasty.  We brought our own wine bottle and corkage fee was high at $35 but we decided that was relevant to ordering three glasses of wine.  \n\nOrdered panqueques de dulce de leche.  And tiramisu.", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "Went in not expecting much but boy were we wrong. I had one of the best Rib Eye steaks ever while my husband had the T Bone. Both were out of this world. We also ordered a variety of empanadas made fresh while we waited but the dessert were unbelievable. Crepes and chocolate mousse were Devine. The place is small so make reservations", "author": "Barbara S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-22", "description": "Have been twice now and both experiences have just been so-so. The meats are just okay. I've had the sirloin, skirt steak and the mixed grill. Empanadas and meatballs. Overall, meats were always either over or very undercooked from medium rare (skirt steak ended up being rare). Chimichurri is kind of bland. Empanadas are good - I would choose the beef over the chicken and potatoes", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "This place is absolutely amazing, from the food to the drinks to the dessert. \n\nService is very nice and doesn't keep you waiting. \n\nSteaks are great! \n\nReasonably priced for the quality of food. Amazing decor. \n\nMust try! \n\n(So good I forgot to take a picture of all the other food)", "author": "Marcelo B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "Come here to eat all the meats. Do not come here if you're a vegetarian.\n\nMy boyfriend and I split the meat plate (it's made to share between 2 people) \u0026 it was so delicious. Came with your choice of blood sausage or chorizo (not spicy), hanger steak, chicken breast, short ribs \u0026 strip steak. Everything was seasoned so nicely \u0026 we both left very full. You can also get side salads for each person plus your choice of mashed potatoes or French fries, though we got extra salad instead. Total was $52 for all that food, but you're really splitting that in 1/2 so the deal is definitely worth it.\n\nThe ambiance is romantic with candles and dark wood everywhere, plus it's nice that it's off the beaten path \u0026 not around a majorly busy area.\n\nCome here for a meat extravaganza \u0026 leave VERY full and ready to take on the night (or day).", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Our absolute favorite restaurant!!!We have been dining here religiously, on Tuesday's for  the past two years. We are greeted so graciously by Geo, whose service is second to none. The food is always well prepared and totally delicious!! We highly recommend this quaint and welcoming restaurant.\nGrace R.", "author": "Grace R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "Very good price for a very good service, quality and location. The location is not ordinary, but in the nice neighbourhood of Cobble Hill. The Steak is great and the chicken fillet is also the best!! Also the Argentinian beer Quilmes is provided.", "author": "Dennis N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Ok... You Need to go to the restaurant ASAP!!\nEven if you have to wait a little bit (which very much might be the case because it's a South American restaurant and time is very skewed), it is WORTH THE WAIT!!!! \nThe food, the drinks, the staff, they are all incredible. The food there. Holy Moly. We waited an hour and I've never waited an hour to get seated before, but it was so worth it.\nEmpanadas are to die for. The meat is incredible. Drinks are fantastic. Our waiter, Geo, was the man. He is so awesome and the sweetest. Literally nothing bad about this place except that we had to wait a bit to get seated.\nHIGHLY RECOMMEND! (better to make a reservation though)", "author": "Amanda S."}], "servesCuisine": "Argentine", "priceRange": "$11-30", "name": "Libertador Steakhouse - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/jSmvGdTiHDB2XRrYBH9XbA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893122"}