{"aggregateRating": {"reviewCount": 213, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Had the skirt steak and it was absolutely delicious. The steak was perfectly cooked and a bigger portion than what I was expecting. The service was friendly. I like how quiet and cozy the atmosphere is - it's a lovely date night spot and our new favorite!", "author": "Mary C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "This place definitely delivers!!! I had a great experience here. I took my girlfriend here this weekend, and while the place is small, it's intimate, and very cute decor. Even in the bathroom, they had the old fashioned chain on the toilet bowl. \n\nSat down, our waitress was very attentive. They had the menu, and the special was the seafood paella. Although, we passed on it, hopefully they have it again. There was a large party on the other side of the restaurant, to which I've caught a glimpse of it as I went to the bathroom. It looked delicious. \n\nWe ordered a lamb appetizer, that came with some potatoes. Delicious! The meat melted in my mouth like butter, and the potatos were already salty. Not excessive, but just enough to be right. I ordered a Cabernet-Syrah blended mix wine, and I was thrilled to see that some of their wines had the points on the side from the wine spectator. This one was 92pts, which is very very good, FYI. I forget the name of it, but I would definitely have it again. \n\nThe Steak Tanafare, I'm probably spelling it incorrectly it was the last choice of steak the bottom of the dinner menu aside from the traditional steak menu. Whatever! It was delicious. It was a steak which they wrapped in pecorino romano cheese, peppers, and cilantro. DELICIOUS. Although, at times a little too much on the spices, the dish was excellent, along with the mashed potatoes that went with it.  \n\nAnother great date place, or if your living in the neighborhood, and are looking for a nice hole in the wall place with great food, this place will not disappoint you. It's not that noisy, the service is great, and I will definitely be going back.", "author": "Frank B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "First things first.... The service here was really good. Our waiter was attentive, informative, and timely. The appetizers were excellent you MUST have the meatballs and the crab cakes, the empanadas were good, albeit a little overrated when you see all the rave reviews of this place. We ordered the grill for 2 and were very happy with the tenderness and flavor of the different meats. I'm a huge French fry lover, so I am gonna say the fries are very tasty but not all world like previous reviews. Red sangria was nice but, too much ice in my cup makes me unhappy! Lol I would def comeback here because I had an overall good experience. Hope this helps.", "author": "Rossano B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-08", "description": "WHY BE AVERAGE WHEN YOU COULD BE GREAT?\n\nI went here last weekend to celebrate a family friend's birthday and let's just say we all know our way around Latin American cuisine.  \n\nWe were all very excited to have another Latin American option in South Brooklyn. Unfortunately, this was good but not great. I say that because this neighborhood is filled with some amazing restaurants and if Libertador is going to stand the test of time, it needs to make some upgrades.  My recommendations to you: \n\nService = attentive but not intrusive. Need to strengthen your reservation process. \n\nWine selection = we had an excellent Cabernet. The whole table was raving about it.  But your waiters don't know anything about what wine goes with the food. \n\nMusic and ambiance = very good. Should upgrade music. Consider pandora/spotify account.  Put some art on the walls. Everything else is great.  \n\nMenu= Your menu is too big and not that creative. We were never informed of specials. if people want purely authentic Argentinian they go to Queens. But a modern restaurant in South Brooklyn needs to be edgy.  You need to think about Argentinian food that is authentic and outside the box. Get creative.   \n\nFood =  I give you credit for the skirt steak, mash potatoes, and fries. All very delicious. Your picante was also good. But the rest of our parillada was just okay. Why does the parillada not have morcilla which is an Argentinian food staple? The chicken and other meets were uneventful.  Because the meal was so average, we did not order dessert or a second bottle of wine. \n\nYou can get there. But really push yourselves to be better than average.  I'll give you another chance in a few months. Lets see if you can get the kinks out.", "author": "Ana P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "My  wife and I walked in without reservations and managed to grab a table on Saturday evening 1/28/17.The décor was very pleasant and inviting to conversation. Service was flawless and attentive. Their wine list was more than adequate and met all types of budget. We ordered the mixed grill for two; it was not top notch quality beef but still tasty enough. What disappointed was that the traditional morcilla was not included in the mix grill. In thirty years of consuming such a traditional dish it has never gone without. The check came at $ 161.- without tip and morcilla !!", "author": "Marcelo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "Stopped in here for dinner and enjoyed our time here a lot. The meat sampler was delicious and the sides of salad and fries that came along with it were equally good. The meat was cooked and seasoned perfectly and served with a side of sauces that added a nice touch of flavor. The service was very friendly and the ambiance was cozy and lovely. Would go back again.", "author": "Kristen O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "Two words- Mixed Grill.  It is by far, the most delicious item and the best value.  I recently held a joint birthday dinner party here and they were able to accommodate our party of 20 nicely (and were very understanding when several of our guests showed up late).  They also make a delicious pomegranate and arugula salad and their empanadas are great.  The servers are attentive, but they could turn the air condition higher on warm days.", "author": "Harold H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "Is it Wulfgang's, The Palm, Morton's or any of the other big steak houses?  No.  BUT... For a neighborhood steak restaurant, Libertador is the best we know of in the Cobble Hill / Carroll Gardens area, and it's a good value too.   My husband our teen age sons, and I have dined here a handful of times.  Consistency matters a lot to us, and Libertador is consistent, indeed.   We are always greeted quickly and warmly, and seated immediately.  We find the steaks, apps, salads, and desserts are always excellent.  The steaks are all quality cuts, and expertly prepared.  Service is personable, efficient, and attentive.  My water glass never runs dry.  I love that!  \n\nOne pet peeve:  To settle a family \"debate\" by Googling, I asked for their WiFi password, and the manager wouldn't share it :(  It's ok.  We'll continue to go for the food!", "author": "Jo Anne R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Grass fed organic steak for 2 for 45 bucks? Yes please. Grilled octopus, fresh salads, proper sides...all good. Nice wine selection. Attentive service in a romantic, exposed brick, cozy room with tin ceilings on a lovely corner in Cobble Hill. Really can't beat this place for price point v. quality. We went in the winter and it was quite cold due to inadequate heating. We will be revisiting next month, in August, for our 2 year anniversary. Hopefully, the AC will be working properly and it will be a perfect evening.", "author": "Ilyce M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-09", "description": "Walked by this place a few times and finally stopped in with our daughter for dinner. Within a moment we were greeted with exceptional, pleasant and genuine hospitality from the staff, a theme that carried through the evening. The atmosphere is somewhat formal by Brooklyn standards and \"romantic,\" but it didn't feel out of place at all to bring our 18 month old.\n\nI would say more about the lovely decor and atmosphere, but cant wait to say that the food was just mouthwateringly delicious. I want to go back and have another course. Sounds funny, but the meatball appetizer was unlike any meatball I have ever had. Nothing over the top or too bready, everything perfectly balanced - can one talk about meatballs like fine wine? The mussels and empanadas were quite good. The porterhouse steak - recommended by the waiter despite being $20 cheaper than other options - was among the best I have ever had. \n\nI am by no means an expert on Argentine cuisine, but I was thrilled to find this unique addition to the neighborhood lived up to the high culinary and atmospheric standards of its neighbors while maintaining excellent customer service.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "I just walked in without knowing a thing about this place and thought it looked nice. Its in a very residential area and has a nice atmosphere. Menu seemed nice. We started with a sangria and a malbec. The sangria was a bit on the sweet side, but not bad; the malbec was good. Apps were meatballs and sweetbreads. Both were delicious, but the sweetbreads were absolutely awesome. Served with a dollop of creamy mashed potatoes and a couple of lemon wedges, the grilled sweetbreads were tender and juicy. My main was a savory crepe stuffed with chicken, veg, and cheese, served in a pink sauce and it was also just awesome. Dessert menu looked interested, but I was too full to try anything. I will have to come back and try some of the items off the menu that people are talking about most here.", "author": "Steve G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "Great neighborhood joint. Well priced and the steak is great! Wine list / selection could be a bit more extensive.", "author": "Helen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-16", "description": "It's with a heavy heart that I give this restaurant 2 stars. This is my third time at Libertador Cobble Hill. Was very impressed with the food the first two times even though the service was sketchy. Met the owner, Paulo, during my first visit. Great guy and the beautiful interior is his personal handiwork. Just a lovely place ...\n\nThis past Saturday night, my wife and I took our out-of-town friends there and I'm now convinced they'll be going out of business fairly soon unless drastic changes are made. Hear this: the food is good. Kitchen staff is on their game. Grilled meats are delicious and beautifully seasoned. Salads and sides are imaginative and tasty. Kitchen guys, the two stars aren't directed at you. \n\nOn Saturday, I experienced the most inept service of any Brooklyn restaurant I've visited over the last twelve months. \n\nLaundry list: \n\n--Restaurant was half full on a Saturday night (red flag) yet had to chase down the waiter to take our drink order after having sat for five minutes.\n\n--Only bottled beer available. That's fine. Ordered Stella which is up on the wall in the line up. Waiter had never heard of it and they certainly don't have it. Uhhh ... okay. \n\n--Bottled beer came without glasses (forgiven) yet requested glasses never arrived. I looked over my shoulder and the bartender was holding two of them in his hands (apparently he received the request) but stood there chatting it up with the two waiters. They were paying zero attention to the tables. Had to stand and walk over to get them to bring the glasses. \n\n--My friend needed water. Where was the waiter? (not making this up) Out on the sidewalk having a friendly, prolonged chat with a couple walking a dog. You feel like a jerk standing up and walking around trying to find someone to help you but what can you do?\n\n--Time to order appetizers and entrees but no one's coming to take our order. Let's wait patiently for five or ten minutes and enjoy the evening and surely someone will come over. Well, that's not working. Had to turn and wave our arms. \n\n-- No one comes to bus the empty appetizer plates and serving forks and spoons that consume the table. We piled them up as best we could and (again) had to flag someone down to take them. Our waiter was over by the bar, buried in his iPhone. Someone finally came over and nicely took them away. We didn't bother asking them to give it a wipe cuz we knew that wasn't going to happen. \n\n-- Okay, I can hear the steaks coming off the grill so I guessing they'll be brought over any second. Now completely in self service mode, I again hail a waiter and ask them to bring forks, which were taken away after the appetizer, and steak knives. No anticipation whatsoever. \n\nNeed I go on? To be clear, I've seen this staff in action before. They're nice guys but the restaurant is truly rudderless. Is there a manager? Anyone in charge? Hello? \n\nDidn't want to post this review without reaching out to the restaurant directly but their website has no contact info so I have no choice.\n\nLibertador. You have a beautiful space, good food and a kitchen that's on its game. You'd better get a handle on the staff or you'll be out of business come this time next year. That kind of service might fly in Jamaica or Acapulco but not Brooklyn. Too many other good choices.", "author": "John S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-26", "description": "The restaurant was good. Nothing spectacular. The appetizers were OK, the seared octopus was tender but wasn't cleaned fully, the burrata was good, the calamari on the other hand was not very good-at all (chewy, soggy, and not seasoned well). For dinner we were all able to share, the skirt steak was good, cooked well and seasoned well. The fries were FANTASTIC. My husband had the lamb and while it was seasoned great it was VERY under cooked, and this coming from a couple that will only eat lamb the way it should be served. This wasn't even rare...this was not cooked. The dessert was good overall, the flan was not for me but that is most likely just because my grandmother makes it better. I'm not sure if the restaurant is very good for groups either, we were kind of in the middle of everything because it was the only place they could squeeze us in (group of 10) and i felt like we were intruding on a few nice quiet dates.", "author": "Tami M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "There's not much I can say about Libertador that hasn't already been said by other reviewers. I love this place. Generally quiet and cozy (but can get busy), and I've never had anything resembling a bad meal or poor service. Like all restaurants, some dishes are better than others. As a self-professed carnivore, the red meat dishes are the best. However, I've had the various salads here a number of time and you can't go wrong there either. Others have praised the appetizers, especially the empanadas and the meatballs. Definite starters. I can't comment on desserts because I've never been gluttonous enough to try one - at some point in the future however, I'll tone down the dinner and try the dessert. \n\nCan't go wrong here.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "Neighborhood gem. It's off the beaten path. We wandered into here when PokPok looked ridiculously busy. So glad we did. We had a bottle of malbec, the blood sausage, beet salad and the steak for 2 which came with salad and fries. It was way more food than we anticipated, we could have been full with just the steak entree alone. Service was good, food was good and the atmosphere is intimate in a nice open space. I'd definitely come back.", "author": "G C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-25", "description": "Octopus was chewy but delicious. Empanadas were tasty but not real pies. Steak for two was a waste (there was no skirt steak). Slices cooked on grill at the table were grey not charred. Instead of medium rare, most were well done if edible at all (slice of fat/gristle). Fries were tasty but soggy. Won't be back.", "author": "Ruth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "Really good place for an Argentinan experience. Amazing steak and Malbec selection.  And good service too. \n\nIf you want a unique, Argentinan experience libertanor is worth the trip. Good food, Amazing wine and just a solid experience. Enjoy!", "author": "Neil K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "I love this place. Cozy atmosphere and yummy empanadas. I'm a fan of the Steak Envoltine with a salad. Their specialty salads are savory and fresh. Nice red wine selection. They do not have a full bar because they are across the street from a school. (Makes no sense...they open way after school hours but whatever) but the food and service makes up for the lack of trendy drinks. The owner is lovely and I love to bring my kids there for brunch. Nice for a date night too.", "author": "Kate S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-12", "description": "This 'restaurant' fails in so many areas. I'll start in chronological order.\n\n1. If you haven't been here before, the restaurant is difficult to find. Where is the sign?!\n\n2. There was only 1 server present on a major holiday.\n\n3. The tables are wobbly, floor uneven.\n\n4. The Sangria is the WORST sangria I've ever had and the highest price! $38 for a SMALL pitcher? Its nothing more than poor quality watered down wine.\n\n5. Silverware - if you ask to have the silverware replaced, they start arguing with you. \n\n6. Do not order the sirloin. They don't know how to prepare it properly. \n\n7. The food is way overpriced for the level of quality and service.\n\n8, Automatic 20% gratuity for a party of 5?! An automatic gratuity should trigger for parties of 6 or more.\n\nThe only reason why I didn't give it a 1 star is because the appetizers and coffee were OK.", "author": "Allen K."}], "servesCuisine": "Argentine", "priceRange": "$11-30", "name": "Libertador Steakhouse - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/jSmvGdTiHDB2XRrYBH9XbA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893122"}