{"aggregateRating": {"reviewCount": 213, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "I got the mix grill for 2 . It was awesome . No complaints . The steak was medium rare just the way I like it . It was sssooooo good . The sides were a mashed potato \u0026 salad which were ok but the winner was the steak . As we we got in , we were seated right away. Customer service impeccable as well . Small quaint beautiful place.", "author": "Sybil N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-21", "description": "3.5 stars.\nLibertador is up the block from me and a quiet, easy spot if we are looking to grab dinner in a pinch. I've tried all the empanadas they offer and I can't say I'm terribly blown away but it's still a good solid option. The corn one is very interesting though, and probably my favorite. The thing I really appreciate about Libertador is the service. The waitstaff is always attentive, friendly, and happy to offer suggestions. I always feel right at home. The atmosphere is also very nice, though I wish they didn't have TVs up near the bar.", "author": "Alexis S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-20", "description": "Steak and fries were good. Prime cuts, cooked as requested, good-sized portion and fair price. Everything else was mediocre - mussels, salad, bread. I might go back for steak, but I am not in a huge hurry.", "author": "Molly P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "Great quiet ambience. Must get the corn empanadas, I think it's home made which is a plus +++. The mixed grill was OK, too much meat for this omnivore. But if you are a meat-lover like my boyfriend, then you must get the mixed grill. Great value for a great price. I would give the place 5 stars for the empanadas alone. We shared the tiramisu, which you can taste the strength of the expresso on the bottom. Overall, you should try this place.", "author": "Khanh T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-19", "description": "Hubby and I were happy to sit by the window and enjoy this sweaty Friday night.  Our staff was very friendly and attentive.  Our grilled octopus came and I was again very happy.  However our entrees (lamb chop and skirt steak) were less than great, and the sauce could use some more flavor.  I would come back again (and try the grilled meat for two and the empanadas that seemed to be very popular) because I'm a sucker for high ceiling restaurants and rusty decor...", "author": "Juan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "Really yummy hearty plate of meat. On a beautiful, quiet corner in idyllic Brooklyn, it melds into the neighborhood. But they serve delicious salads and great plate of meat. Got the sampler for 2 and it's enough to feed 4 people for sure. Will definitely be back!", "author": "Larry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-10", "description": "All numbers out of 5\nThe grilled octopus  5. Tender with  a perfect slightly spicy sauce. \nThe mixed grill = mixed feelings.\n\n Skirt steak was a 5 perfect seasoning, grill, juicy and tender. \n\nPrime rib and grilled chicken 2.5 (wouldn't do again) \nRibs 2 \nSome of the meat was over salted. \n\nTiramisu just average 2.5. Can taste freshness but didn't deliver on flavor. \n\nTo be fair I'm judging based ok other Brooklyn Heights fare.\n\nThe owner or manager was there eating as well. He's a very nice guy with a huge warm smile. Checked in on us more than the wait staff (who were also very good).", "author": "Ghazi S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-19", "description": "We have been watching this space since the deli closed years ago and were so glad to see a restaurant opening a block away. We tried it last night and can only say that I hope it gets better.\n\nATMOSPHERE\nIt's pretty. The restaurant has great lighting and the decor is very understated warmth but it's a bit tight. The bar and open kitchen take up about 1/3 of the width, which isn't that big to start, so tables are close together and the walk to the single bathroom located in the back is narrow with bar patrons, servers and runners and diners all trying to get through. Also, some patrons are obviously confused by the hard-to-pull chain on the old-fashioned toilet as both times we went in, it wasn't flushed.\n\nFOOD\nFood was ok but nothing to shout about. \nMy lentil, arugula and goat cheese salad was excellent. I wasn't that impressed with the steak - it was unseasoned and a bit tough -- came presented on a plate with a pile of mashed potatoes and no sauces offered. Didn't try any of the sides.\n\nWe ordered the corn empanadas and ravioli for our 9-year old and she wouldn't eat either of them. The empanadas were way too cheesy and the ricotta/mushroom ravioli were a bit sweet - didn't get any flavor from the mushrooms at all. (Note: a friend who had been the day before raved about the spinach empanadas though). Our friend's calamari were undercooked so the dough was pasty and tasted of flour. She gave one to the man celebrating his birthday at the next table, 10\" away, and he agreed. My husband liked his chicken Milanese and the fries were excellent - cooked to a crisp perfectly in oil infused with herbs, rosemary perhaps.\n\nFor dessert, panqueques dulce de leche were tops and what kid doesn't love chocolate gelato? Mine does, especially three scoops piled high.\n\nI found there are no small portions on the menu -- smallest steak is 12 ounces and the salad was enough for the table. \n\nSERVICE\nWe were seated fairly quickly and the staff moved a table to accommodate us at the peak of the dinner rush. Our orders were taken and drinks arrived promptly followed not too long by bread with olive oil and then our appetizers/salads. And then it slowed down considerably. It took a very long time to get our main courses after they'd cleared the first course plates. The table seated next to us, and about 10 minutes after us,  finished their full meal, paid and were out the door before we ordered dessert.  Service felt rushed and uneven as if they just couldn't handle the volume. \n\nOverall, it wasn't a bad meal but I suppose a steak house where the salad and dessert were the best courses isn't quite cutting it. They obviously have some glitches to work out with the food and service and I am hoping sincerely that they do because the potential is there and it's sooooooo close.", "author": "b w."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-05", "description": "Visit was not what I hoped it would be. The restaurant quiet and clean, however the food did not live up to the reviews I read on Yelp prior to visiting. The mixed grill was okay nothing spectacular and the crab cakes were served pretty cold and nowhere near fresh. The two stars is strictly for the ambiance and the mixed grill, would not recommend to a friend.", "author": "Reene L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-03", "description": "Empanadas - hot, packed with filling and nice crust on the outside. I recommend the corn empanada.\n\nMixed grill for 2 - it's cool that its served on a hot sizzling plate, but the meat wasn't anything special and the chicken was dry. I would recommend getting something else like a steak dish instead.", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-19", "description": "Brooklyn is so blessed w/ so many great restaurants! This is one of them! We totally enjoyed ourselves here for a quiet intimate Sunday night dinner. My other half was craving steak, and I came across Libertador via yelp. \n\nWe were torn between ordering the Parillada grilled steak for 2, or the Cortada Marinada Dos (marinated in olive oil/brandy/thyme/rosemary) for 2. Both looked great, but went with the Cortada Marinada. This delicious sirloin was so aromatic w/ flavor of rosemary/garlic... so good!!! We usually like our steak medium well, but they recommended medium because they are thinly sliced and comes out on a hot grill so it'll continue to cook when its on your table. I was unsure about it, but went with it. Definitely a great choice, it looked like it was going to be too much for us, but we actually finished it and enjoyed every bit of it. We also asked for seconds on the chimi churi sauce \u0026 sliced tomatoes. The salad that came w/ it was a small portion, seemed to feed only 1. You also have your choice of mash or fries... go w/ the fries!!!! \n\nHad 2 glasses of red wine sangria which perfectly complemented the meal. The waitress was excellent, and even gave us another glass on the house as we stayed a bit longer after our meal to enjoy the ambience. Will definitely bring back some friends/family, we know they'll enjoy it just as much as we have! Definitely a gem in Cobble Hill!", "author": "Janine D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "We went there this evening for dinner, as my 7 year and 22 month old sons are in love with the train in the window. My hubby and I had been there for dinner alone and had no complaints. And today was no different. The staff was very tolerant and seemed slightly amused by our boisterous boys. The acoustics and music do not lend themselves to a very romantic atmosphere, which was great for us.  \n\nThe waiter was very excited about the menu, offering suggestions, presenting us with options and then breaking the news gently when he reported that they were down to one last beef empanada.\n\nAs far as food goes: the empanadas were great we had the beef, the corn and the chicken/potato. Was not a huge fan of the chicken/potato but LOVEd the beef and the corn. They ARE piping hot. EVERYTHING came out piping hot. The hubby loved the skirt steak. I Had the chicken moulade which was savory and good. My son had the spagetti with bolognese sauce. I know its not an italian restaurant but man. That was one good sauce.\n\nI do like this place. I have never been to Argentina, and therefore cannot speak to the authenticity of the fare. But considering that this neighborhood is getting filled with chains and unique restaurants are closing down left and right-i say HOORAY to Libertador!", "author": "Df F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "Libertador is a solid place, and this could be a decent regular spot if I lived in the neighborhood.\n\nFirst, I must complain about the bill situation I experienced.  You can see with the attached photo, that a suggested tip of 20% was pen-written on our check.  I have no problem with that, service was actually pretty on point when I came.  However, the suggested 20% was well above what actually 20% was.  It was higher than 20% of the bill even if you included the tax, which in my opinion was VERY shady and shameless.  Come on, I can calculate simple arithmetic in my head.  If you want to trick someone into tipping you more, use a more obscure percentage...\n\nAnyway, onto the food.  I did not dock the restaurant any stars for the bill incident.  And I will say that this restaurant would be four stars if you made a meal of just certain items on the menu (primarily the actually Argentinian dishes)\n\nFirst off, the empanadas here are AMAZING.  Garlic fries that top the ones from Yankee Stadium any day of the week.  Mashed potatoes were good here, but if you had to choose one side with your meat entree, get the fries.  \n\nAppetizers:  \n\nThe empanadas are amazing, possibly the best I've ever had.  The shell is flaky, and soft, with the insides nicely moistened by whatever filling you ordered it with, similar to an awesome croissant.  We had the beef, chicken, and black beans/mozzarella.  They were all good, but my favorite was the chicken.  \n\nThe grilled octopus was very solid, very soft and tender, and flavored well.  You get a tentacle's worth.\n\nFried calamari was very mediocre, not quite slow-cooked to perfection like the octopus was.  It came with a chipotle sauce and a tomato sauce, with the chipotle one being pretty tasty.\n\nYellowfind tuna carpaccio I had no complaints about.  Couldn't really tell how good quality the tuna was because it was so thinly sliced, and had a lime flavor to it that masked the tuna taste quite a bit.  \n\nMussels were good, with the sauce being a great dip for bread as well.  \n\nSalads:\n\nWe had the Pear Arugula Salad, and the Avocado Mozzarella Salad.  Both were salads not bad, with decent portions of the toppings (pear for the former, and mozzarella for the latter, though the avocado portion was somewhat skimpy).  \n\nMeats:\n\nSkirt steak was very good.  Seasoned well, very tender and juicy.  I wish all of their other meats were like this.  \n\nRib eye was ordered medium rare, but was way overcooked, was dry, and lacked flavor.  At first glance at the menu, I was surprised that the rib eye was slightly cheaper than the skirt steak, but after taking a first bite of each, I understood why.  \n\nLamb chops were decent.  Not bad, but nothing to rave about.  It was juicy and tender enough, but lacked flavor as well.  \n\nPastas:\n\nWe ordered the Ravioli with pink sauce and the Seafood Pasta with the garlic oil sauce.  To be brief, their sauces were done well, particularly the olive oil and garlic with seafood.  However, the pastas itself were overcooked and not al dente like I like it.  \n\nDesserts: \n\nThe pancake rolls (crepes?) were good, very light, and complimented well with the ice cream on top.  Almond ice cream was just vanilla ice cream with almonds in it....And the chocolate mouse was pretty nice and smooth, topped with whipped cream.", "author": "Dennis L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-17", "description": "My friend offered to take me out for my birthday and asked me to choose the restaurant. Based on Yelp feedback, I chose Libertador. \n\nThe restaurant itself is very cozy and tastefully decorated in a rustic sort of way. It was a rainy Tuesday night so the place was pretty empty. I imagine this is not always the case but being the holiday season and all... \n\nThe service here is excellent though they should check on your water a little more often. Special kudos to our very accommodating server, Frank from Peru...gracias! as well as his friendly assistant.  I liked the music they played but I think traditional Argentinean music would have been better especially since they have soccer games on a large screen to view during dinner.\n\nWe ordered the mixed grill which is served on a very hot iron grill with potato and salad as well as two sauces. We split the garlic fries that were very good. The salad was a disappointing lettuce and tomato salad...nothing special. The two dipping sauces were excellent.\n\nI would love to rate this restaurant four or five stars but unfortunately part of the mixed grill we ordered was not up to what we expected. The chicken and skirt steak were above average, the sausage average but the the short ribs and New York strip (I think that was the cut) were too fatty. Thus while we would come back, the meat was a bit of a disappointment.\n\nI am settling on a 3.5 star rating and a thank you to the staff for being so accommodating.  At this point I am hoping to raise the review to 4 stars on my next visit if the meat is a bit tenderer and less fatty.", "author": "Neil B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "The food is exquisite. The service is usually on point. The food variety is admirable for a steakhouse. The decor is a rustic/Argentinian rural home style and the ambience is well balanced between romantic and family. Been here 4 times and will be returning.", "author": "Norbe D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "My wife and I came for dinner. I had the Matambre de Pollo, a chicken roulade with mozzarella di buffala and roasted red peppers. The entree was excellent, but slightly salty. I would definitely have it again.\n\nThe real star of the dinner was dessert. We had a fig dish, the figs, marinated in a sweet lemon reduction, were served over slices of mozzarella that were sprinkled lightly with sugar, all served with a light caramel sauce on the side. Absolutely delicious.\n\nMy only complaint is that the music and television was a little too loud. Other than that, it was a very enjoyable experience. \n\nI will definitely be back!", "author": "Alfred F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Yum and Yum.  One of my favorites in the neighborhood.  Incredible value for the price.  So many options, all the meats have fresh sauces -- the mixed grill for two can easily feed a family of four -- the empanadas are amazing!! Even sides like beefsteak tomato comes well seasoned. Service is attentive and friendly.  I could not recommend this place more  My two asks: delivery (or at least Caviar) and full bar (although the wine is also really good and a good value).", "author": "aimee m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-22", "description": "Service was good. Closed the door when told it was getting chilly. \n\nThe medium well steak was well done like leather, probably because it was sitting on the grill as the bigger table was getting all its dishes out. This seems to be a common complaint about this place when you read their reviews. But any charred meats are still good to me. \nThe pappardelle was a bland stomach churning mess. It was a sign when they spelled it wrong. The pasta was significantly overcooked and frankly tasted pretty bad. \nTypical of a lot of restaurants that use pasta as their menu filler but don't know how to cook it properly. This goes for the French restaurants in the neighborhood as well", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-28", "description": "I thought this place looked good and I followed the Yelp average -- big mistake.\n\nI took some friends here and was embarrassed about my choice. The severs are way, way overworked and as such were hard to flag, hard to ask about missing menu items, hard to order more drinks from, etc. Meat also was just average. So why bother?\n\nOne saving grace was that it really isn't that expensive considering other nearby options.", "author": "Leigh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "My boyfriend and I found this place 3yrs ago and it is never been disappointing. The place is cozy; from the smell to the lighting, it's quite perfect. I would best describe this place as - if a romantic French style restaurant and a steak house restaurant had a baby it would be Libertador. So you get good portions but its not savage and you still get amazing unique flavorful tasting Argentinian food. \n\nWe ordered the zucchini soup which was creamy and a great light appetizer. We drank a wine based cocktail (don't remember the name) but it had a hint of tang and mint. So simply refreshing. The empanada are unique so it's worth a try but not our go to on the menu. \nFor entrees we ordered the lamb and the porterhouse. If you like lamb check out my picture it's like 5-6 pieces of this amazing lamb rack. It was very tender and very satisfying.  Don't get the mashed potatoes it's super plain. The porterhouse was huge had a great grilled taste. Definitely get their fries because it's unbelievable with garlic and Parmesan. We ordered the pouchy pear for dessert but they accidentally brought us the pancake dulce de leche which was the best mistake ever. It was more like a thin crepe flute filled with a fluffy warm dulce de leche filling with vanilla ice cream and fruit. We were quite content with this. \n\nThe staff here by the way is probably the one main reason we love coming here. Never have I had such great service. And I love great service. There's nothing worse than feeling like you hate the waiter, it can ruin the experience. Not here. We were asked how we were doing and the conversations with our waiter were brief (perfect) but it was polite, attentive, and nice (perfect). We asked our waiter where we could find an ATM we were a couple dollars short for our cab and he literally suggested we just borrow it from him since it was cold out. We didn't take his money but still the gesture was so genuinely nice. The staff really makes sure you feel like you're their number one concern and friend. \n\nWe literally fell in love with this place all over again.", "author": "Sofia B."}], "servesCuisine": "Argentine", "priceRange": "$11-30", "name": "Libertador Steakhouse - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/jSmvGdTiHDB2XRrYBH9XbA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893122"}