{"aggregateRating": {"reviewCount": 213, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-27", "description": "We've been here twice. It's not a high end steakhouse (nor does it try to be),\nand I think it's very good for the price point. We've really liked the provolone/tomato appetizer. The menu is pretty large although the past two times I've gotten the grilled chicken and my husband ordered steak.\n\nIt does get quite busy and almost has a diner-like feel on weekend nights. The second time we ate here, we went earlier in the evening and it was a much calmer experience than the first time we went here.", "author": "Ann L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-01", "description": "I made reservations for a group of 8 people for my birthday on Google website and we showed up to inform them that we made reservations. We were expecting a table inside. The restaurant is small and it was overcrowded. The staff were scrabbling around looking for a table for our group and asked us to wait 10-15 mins. I was lil annoyed, being a little perfectionist when it comes to planning and making sure everyone is ok. I always put my friends first before me. \n\nOne of the staff asked me if we are okay with setting the table outside and eat outside. I was a little embarrassed. So I asked every person if they were okay with the idea of eating outside and they were all okay with the idea. Mind you, it was a beautiful breeze night on Friday night of September 28th, thank God it worked out. After I gave them the OK! Everyone started to set up tables on the side of the restaurant and started to serve us. \n\nAll night long, I was little mortified and I kept checking on my friends if they were okay and they kept saying don't worry, enjoy your birthday. \n\nIt's a fun way of celebrating my 27th birthday and I will always remember this day. I mean who would improvise tables last minute on a breezy night. It is almost like having a summer birthday!\n\nMost of us ordered steak dishes and one-two of us ordered salmon dishes, they all enjoyed it. I wanted something different, I ordered Steak Envoltine and it's delish! \n\nThey gave me a flan on the house for my birthday and I did not get to enjoy the dessert. It did not taste sweet at all and it tasted like stale milk. \n\nI would like to come back to this restaurant and hopefully we will have seat inside this time, so I can enjoy the scenery on the inside. Haha\n\nIf eating delicious steak is what you want to do, this is the restaurant to do so.", "author": "Nat P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-16", "description": "First impressions were not great thanks to Giovani. I've read some other reviews on this page who have called out a host or waiter who acted rudely/told them they needed to wait a long time even though they had reservations. I'm pretty sure that person is Giovani. We checked in at the front and mentioned that we had a reservation for two. It was a beautiful night out and the sun was just starting to set, so we asked if we could sit near the window where there was a 4-top and a 2-top set up. Giovani rudely dismissed my request, saying that he was holding the table for larger tables of 5 or 6. He directed us instead to a table off to the side that we had to squeeze past people to get to, and hurriedly set the table even though the busboy didn't have a chance to wipe it off yet. The busboy came a minute later and removed our plates, silverware and glasses so he could do a proper wipe.\n\nI kept an eye on Giovani the rest of the night. The same rudeness he showed us was repeated to many other customers hoping to sit up front. By the time we left two hours later, no one was sat at the front window table for two, though a 4-top was sat.\n\nI have worked in restaurants for a long time. My advice to management is to give arrogant Giovani some hospitality training and tell him to check his ego at the door before coming to work. I understand that he prefers taking larger tables, and as the Head Server he gets first dibs on those large tables that he doesn't have to work as hard on (for those of you who aren't in the business, having three 2-tops is always more work for the server than one 6-top). With that being said, as an employee you need to think about the needs of the business in front of your own interests. Having people having a good time in your restaurant be visible from the street is going to draw business in from folks who have not dined in your restaurant before - it's basically putting your food and the guest's experience on display as free advertising for your business. Your instinct should never be \"no\", you should want to accommodate when possible or at least offer an alternative that the guest is happy with. Giovani did none of that, and his rudeness had us seriously considering blowing off the reservation and finding a new place to eat (which wouldn't have been hard to do in beautiful Cobble Hill).\n\nI'm glad we stayed. Our server Leonardo gave us great service and we had a lovely meal. The empanadas (we had the beef and the spinach and cheese) were a great appetizer with lots of flavor and very reasonably priced. The calamari was a bit rubbery and a smaller portion. For dinner, my date had the mussels appetizer which was a larger size and really fresh and delicious. I had the 14 oz Ribeye - it was exactly medium rare, lovely marbling, and paired perfectly with garlicky, buttery mashed potatoes. With a bottle of wine, the whole meal was about $120.\n\nThanks very much to Leonardo for changing our perspective and giving us a great experience. To management - please have a conversation with Giovani and let me know when you do. I'd love to come back sometime.", "author": "BC C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-29", "description": "They really need to pay attention to details. Drinks came out and were given to the wrong people...no problem, we just exchanged drinks so everyone got the correct ones (there were only three of us). Food came out and was given to the wrong people...no problem, we just exchanged plates so everyone had the right food. Dressing (ordered on the side) was missing so we had to ask (and wait) for it...but then they brought the wrong dressing. Started eating and noticed that they brought the wrong steak (didn't send it back, ate it anyway...no problem). As for the food, the asparagus was overdone and stalk ends were tough and fibrous and inedible. The pear/arugula salad was really great, though. If they just paid more attention to details our experience would have ended up being better than \"Meh\".", "author": "Michael J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "Review is specifically for brunch, A+ experience. \n\nI got the classic style south, which has all the things you could ever want really. Steak, avocado, eggs, and fresh mozzarella. Yummmm. Steak was delicious and cooked just right. Great service. Prices are very reasonable as well, it was ~$17. Definitely will be back again.", "author": "Shirley W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-27", "description": "I agree with all the reviews about this place. I enjoyed the ambience a lot and it was such a beautiful day when we went that they had doors open so you got fresh breeze coming through. We had the mixed grill where it was all these different cuts of steak and chicken as well as a sausage. It wasn't the most amazing steak I've ever had but it was good. I wanted some more Argentina spice or flavor cause it didn't taste much different from other steaks", "author": "Tracy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-16", "description": "As a vegetarian, I was pretty skeptical about this place since I thought I would have nothing to eat. But, turns out their veggie dishes are delicious. I had the eggplant and the soup of the day (zucchini) and thought both were amazing.\n\nMy meatatarian coworkers seemed to enjoy their food too.\n\nService was great! Our waiter was attentive, friendly and funny.", "author": "Erika M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-16", "description": "Came for steak and got the Steak Envoltine, which was a roll of thin steak around cheese and peppers, with a Malbec wine sauce. It was sublime. I got the salad (instead of potato) which was ordinary, and ordered a side of the roasted vegetables which included peppers, asparagus, and zucchini - it was a great vegetable side dish. With a glass of Malbec, the price was just under $40.  The food was flavorful and service was prompt. I will definitely return. Note: prices on the online menu are out of date - expect prices to be a bit higher.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "Perfect steak and over easy eggs for brunch for only $16. The dish also came with fresh mozzarella and sliced avocado. The strip steak was seasoned well, had nice grill marks and had a perfect medium rare center. These steak and eggs really can't be beat for this price. Our servers were also incredibly nice.", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "We found this spot after looking through the Yelp reviews for best restaurants in Cobble Hill/Carroll Gardens..\n\nThank you Yelpers for such a solid recommendation for an authentic Argentinean restaurant. The attention to detail, the friendliness of the servers, the freshness and the quality of their ingredients make this the very best dinner we have had in Brooklyn yet.\n\nSeeing Nick Sandow, Warden Joe Caputo from Orange is the New Black, while we were eating made it extra special for our girlfriend who was on her first visit to the City.\n\nThe owner stopped by and chatted with us as we were getting ready to go. He was warm and engaging and seemed to really be interested in our travels. You just can't hope for more when you are showing someone one of your favorite cities for the first time.\n\nWhat a wonderfully special treat. Thank you.", "author": "Dawn B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-10", "description": "I went here twice.  The first time, I was with a group that was the first in the restaurant.  The waiter took care of us.  The food was great, and the ambiance was good.  It did take time for the food to come around m, and the wait time did increase as the restaurant got more crowded.  This restaurant was a great introduction to Argentinian food.\n\nThe second time, the place was packed and the waiter dismissed my notion of \"I have a reservation on Yelp.\"\n\nTHEY DO NOT HONOR YELP RESERVATIONS.\n\nBecause than the curt service - I left for El Mate. \n\nI just wished Libertador would treat its customers better.  I know it draws a crowd, but it wouldn't hurt to respond with:\n\n\"We're really busy right now.  Sorry we can't honor the reservation - we really should remove that from Yelp.  Stand by, I'll try to get you a seat when one opens up.\"\n\nBe nice to your customers.  If you're nice to one customer, he'll tell one friend.  If you're rude, he'll tell five.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-19", "description": "Simply wow! You get good value for the price. My bf and I came in on Saturday with reservations. The place was packed! We started off with 2 empanadas (ham \u0026 cheese and onion with cheese). Both were delicious! Different from other empanadas I've had (more baked than fried). We had the mixed grill for 2 and it was more than enough meat for us! The meat was nicely seasoned. It did not take too long for the meat to come out for us! I will definitely come back!", "author": "Kim D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "Great little steak place that is pretty much for carnivores. Their brunch menu is nice although portions are kind of small which is why i had to order a ribeye steak to supplement my meal. I'd definitely recommended their big rib eye and their skirt steak is quite tasty. Their grilled shrimp salad is very good too plus the shrimp is pretty fresh.", "author": "David H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "Meat lovers - leave your vegan friends at home!\n\nWhen my husband's best friend and twin sister kept telling me how amazing this place is for brunch, I wasn't too skeptical since I had already experienced dinner here, and it was a meaty heaven.  Libertador should be on your brunch list in your Top Five - let me tell you why.\n\nLocation - this place, although is intimate, there is enough seating to make you feel like you're not in Brooklyn anymore.  The rustic decor gives you a vintage vibe, as if you're in Argentina somewhere, and you're in search of a meaty brunch.  Opt to sit by the door to get to sit on a cushion topped bench; great people watching to be had here!\n\nLibertador is fluent in all things meat, so don't be shy in asking how big their meat is...um...the size of their meat...ummm, yeah well you get what I mean.\n\nFor the three of us, we started with the muled wine and coffees all around.  I shared a half of a muled wine with my friend's twin, and she explained that although hot, it was quite sweet.  She was totally right!  This could definitely pass as a dessert wine, but on a cold Saturday morning, it's 5 o'clock somewhere - am I right?\n\nAs a starter, we each got two empanadas - the spinach and cheese, beef, and black bean.  The beef had peppers, bits of hard boiled egg, cheese, onion, and crumbled beef, making this a fluffy pillow of yum.  However, my go-to would have to be the spinach.  Get it, even to go!\n\nFor the main entrees, we all decided to share amongst the country style breakfast, the breakfast burger, and their french toast.  The country style breakfast and the french toast were the two I decided to make up as my final plate, and it was so beautiful I could have cried!  The french toast was deceptively light and airy, unlike most french toasts, with some fresh cut strawberries and marscapone on top.  I would come back to have just that with maybe a piece of meat on the side, just so I wouldn't feel like I was missing out on the carnivore feasting.  The steak with the country style breakfast came out cooked to order, and had the sexiest grill marks I've ever seen; a MUST for newbies.\n\nService was excellent, and we weren't rushed or smothered in anyway.\n\nYou can't keep me from coming back!", "author": "Jaclyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "Nice Argentinian restaurant. We had empanadas and they were vey good, the only thing I didn't like is that the beef empanada was full of curry, definitely not the Argentinian style, but if you love curry you will like them. The service was very nice too.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "Great little restaurant! Amazing steak and wine selection! Steaks cooked to perfection!", "author": "E Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-17", "description": "Good food, but service is a bit slow. Had to ask for water 3 times. However, we ordered dessert...i was the only one who ordered tiramisu...it had a strange texture. Later, at 3am, i was violently sick. Was throwing up the entire dinner, which was followed by a migraine and intense cold sweats. \nSo i have a feeling that the tiramisu was bad or spoiled. All other dinner guests from our party are fine", "author": "Vlad K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-14", "description": "Our server forgot our order and we waited for over an hour to eat. We sat down at 5:30pm on a Saturday, place wasn't too busy and we were seated right away. Our server came about 15 minutes after we were seated and took our order, keep in mind we still did not have water at this time, matter of fact our wine came before the water. At about 6pm the host was finally done chatting his life away and came and poured us some water, thank goodness because wine can dry you out! ... 6:30pm people came in and were seated, two large groups behind us and a couple next to us... about 7pm we notice that the group of 5 behind us all got served their steak and the couple next to us as well. The waitress come to our table and asks us \"have you received your food?\" (Well honey we just finished a whole bottle of wine and you don't see food here so clearly NO) and then apologizes and blames it on the kitchen. It was CLEAR she forgot to put our order in and took no accountability for her mistake. We waited for nearly and hour and a half and watched everyone who came in well 30-40 minutes after us eat. We were starving. She didn't compensate us when we ordered desert (which was blah by the way, don't get the mousse it was watery) and continued to blame the kitchen which was a lie because obviously  the kitchen didn't have an issue.", "author": "Emilee S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "Good food at good prices.\nWe ordered the prime steak for two.  It was good but not great.  The sauce helps but it's not the sauce you get in Argentina.   They make the steak at the table so nice theater.  The salad and fries that come with the meal were both good.  \n\nIt's a neighborhood place so if you are in the hood its a decent option.", "author": "Rene B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-15", "description": "Enjoyed my t-bone on my first visit, but this time around I am totally disappointed. Came back last Sunday... and it was a mistake!\n2 of us ordered a $52.95 sirloin for two. What a disaster!!\nInstead of well done steaks, we had to eat bloody chunks of boiled beef (photo attached). It was literally boiled!\nYUCK!!\nIt also tasted terrible. I marinate my steaks all the time and I know how marinated for 24 hours meet tastes like. And on the top, our fried calamari were uncooked too. The place was pretty busy and the cook was in a hurry - I get it. but for God's sake, its two of us and if you serve a tiny sauce not enough for half of the portion, do not charge extra $3 when we ask for more. That's totally messed up!\nNo. I am not going to eat at the Libertador again and won't be recommending this establishment neither.", "author": "Michael W."}], "servesCuisine": "Argentine", "priceRange": "$11-30", "name": "Libertador Steakhouse - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/jSmvGdTiHDB2XRrYBH9XbA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893122"}