{"aggregateRating": {"reviewCount": 213, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-29", "description": "Food is great, service sucks. The service keeps tables open during weekend prime time. So if your plan A and B have long waits, this is a solid plan C.", "author": "Joel L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-04", "description": "i was encouraged by the rave reviews on yelp, but i was extremely disappointed...not sure if three out of four of us just managed to order horribly wrong, or if everyone else is crazy. \nanyway, the service was good - the waitress was very nice. she did, however, steer me in a bad direction when she recommended i order some kind of rolled meat with cheese inside. the mashed potatoes were the saving grace. my boyfriend had this potato pancake dish that was sour and just bad. usually he's able to stomach just about anything and will try to eat as much as possible just to be polite, but he didn't even bother this time - he couldn't. it was that bad.\nmy friend ordered a salad with steak - the pears were gigantic but not in a good way because they just weren't cut in an appropriate size for eating. her husband's meal looked good but was basic, just a steak with fries. \nall in all, i do not recommend this restaurant unless you are maybe wanting a steak and have no other options.", "author": "nikki s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-29", "description": "I would imagine this place to be a great date spot, being that I walked in with a friend and I noticed almost all the other patrons were on a date (haha)! Dim to dark lighting with candles on each table, wine glasses in hand, all with that dewy \"look into your significant others eyes\" thing going on. DID I PICK THE WRONG PLACE TO EAT?! Surely I was not on a date, BUT I was craving skirt steak after a long Wednesday and this place had great reviews. Located on a corner, it wasn't overly packed and the waiter was quite attentive. Started off with one of their specialty drinks (forgot the name, but it looked like a white wine sangria). Too sweet for my taste, but having some beer to even it out did make it better. As for the meal itself, I ordered the skirt steak (medium rare), with mashed potatoes on the side (there is a fries option as well). My friend had the pappardelle in bolognese meat sauce. My steak was cooked PERFECTLY medium rare and it came with a side of two different sauces-loved and finished both (ask for extra, it may come in handy)! I also loved the pappardelle - fresh pasta and wasn't overly sauced. If you're coming in super hungry, I'd recommend ordering an appetizer first, being that the dishes aren't huge. Overall, a great experience in what seems to be a quiet neighborhood.", "author": "Bonnie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "We watched the quarter final soccer World Cup game there - great environment in a beautiful neighborhood. I had the skirt steak sandwich, with the Argentinian beer quilmes. The waiter was very friendly. If you're looking for an Argentinian restaurant in this neighborhood, this is a great place to go.", "author": "M O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "Best Argentinian food in the city. Buttery-delicious crust on the empanadas, and an outrageously huge parillada for two. The tomato chimichurri sauce is fantastic, and our waitress, Carolina, was a gem. Very recommended.", "author": "Nick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "Amazing chicken.....the best homemade dish - so savory and yummy! I highly recommend it.", "author": "Nancy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "I was very pleasantly surprised by this restaurant.   The restaurant was adorable and the prices were very reasonable.  The food was fantastic especially given the value for the money.  For the quality provided, I expected to pay a lot more.  Additionally, the portions are quite generous.  My boyfriend and I ordered appetizers and a combination plate for two and we had enough food for another meal the next day.  My boyfriend is 6'3 and athletic so he can eat, but, despite our best efforts, we had quite a few left overs.  It was a great night out!", "author": "Gabrielle H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-05", "description": "I love this place. The food is great (big portions) and pretty true to what you get in BA. Also it is very affordable and just a great vibe all around.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-29", "description": "Had dinner with a friend the other day.  Was pleasantly surprised at this little Argentine restaurant in Cobble Hill.  Their beef empanadas are wonderful.  Nicely spiced with cumin, they have the raisins and a piece of hard boiled egg and the beef is knife cut, not grounded.  A must!!!!  We shared a \"sample parrilla\".  Mostly beef and a  chicken paillard. Served on a cast iron grill, the beef finishes cooking at the table, so, you may want to ask for medium if you like your beef well done.  The beef is high quality, no doubt about this.  Would have liked a less Brooklyn and more Argie parrilla, with blood sausage, grilled tripe, sweet breads, kidneys and the ribs cut the other way around.  The mixed grill comes with one Argentine style pork sausage, which is pretty good.  Salad and mashed potatoes.   We ordered an arugula salad with a mustard dressing, excellent choice.  As for the side salad, you may want to ask dressing on the side or simply olive oil and lemon juice, they use balsamic vinegar which is too sweet to pair with the mixed grill.  Salsa criolla and chimichurri are also pretty good.  The chimichurri can use more flat parsley.   The \"dulce de leche\" crepes, are excellent.  You may just go for coffee and crepes if you have a sweet tooth.  Warm and sweet, light and the perfect bite for an all protein meal!!!!! Will certainly come back and recommend this place.", "author": "P L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "Whatever you get here, this place will not disappoint. The 1/2 chicken criollo is so nice and juicy. The staff are very nice and attentive. They are also very flexible with sides. Even if the menu says 'served with mashed potatoes', all you have to do is ask to get it with salad or fries instead and they gladly will do it for you. The chicken milanesa is SO GREAT! I can't get enough of it. When the dessert menu comes around, be sure to get the strawberry gelato. I haven't tasted better since Italy! All in all, a very nice spot. I'm lucky to live so close to it!", "author": "Cosmo C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "nice location, nice staff but the food was just okay. we had the grill for 2. Everything was nicely cooked but it was nothing out of the ordinary.", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "I don't know how some of the reviews are low. I am giving this five stars since this rating is relative to what we have in our area.  There is nowhere in this neighborhood that has better cuts of meat, good, balanced sides all for reasonable prices in as nice an ambiance than this place. My father is Argentinian so I have been to my handful of authentic Argentinian restaurants before, and I had been hoping for a good meat spot around here. I think this place is spot on for what this neck of the woods needs. The vibe is sexy, but totally child friendly and we really enjoyed our meal and the service.  We had the mixed grill and all the different meats were perfectly cooked. The fries were delicious and they were super helpful about getting us in and out as quickly as possible so we could get our five month old home.  Definitely better than some of the mediocre restaurants that have opened up in the area that only take cash, take forever to get a table and you spend more money than you can even understand how, and are still hungry when you leave. Go! It's worth the experience.", "author": "Cora J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-20", "description": "the skirt steak is amazing- honestly the best steak i've had in years.   we've been going here every week for over a month, and it's always consistent.  the meat platter for 2 is also great.", "author": "J R."}], "servesCuisine": "Argentine", "priceRange": "$11-30", "name": "Libertador Steakhouse - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/jSmvGdTiHDB2XRrYBH9XbA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893122"}