{"aggregateRating": {"reviewCount": 213, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-13", "description": "charming location and decor but the food was average. I was not impressed by the meat, i did not even finish my dishes. It's not worth the price at all. They only had one server for the entire restaurant who was very friendly but not quick. I could see a supervisor (or owner) roaming but he would not get in to help when I was clearly tying to get someone to pay for the bill. i would not recommend and most likely not return.", "author": "Lilly P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "Excellent wine. Excellent food and decent atmosphere. The flan was okay but I must say their steak and mashed potatoes were to die for! The food really was exquisite. I had a great time.", "author": "Slim B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "Great place for Argentinian food and true experience. \n\nThey have a large choice of very good red wines, the meat is what you need and expect: good piece of meat with no fluff around and sauce only on the side. The waiter had a lot of nice attention and was very patient, not rushing us to finish our meals or order what's next. \nThe empanadas are good, though a bit filling. The salad (4 colors) is very refreshing with the meat, the French fries are homemade and very garlic-ey, so good! \nAs for the desert, the 'charlotte' is quite simple (vanilla ice cream, almond and chocolate), but so delicious and don't forget the dulce de leche on the side, soo good!\n\nThe place in Brooklyn is nice, no queue on a Friday night, cosy, warm and nice music not too loud. The place is not posh but you can feel that people who are here know fine cuisine or live in the area and are 'usuals'. Overall a great experience, it's right around the corner so next time I'll try the chicken. They also do brunches and I'm sure it is damn good too :)", "author": "The Traveling F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-25", "description": "Went there with friends from out of town.  Saturday night at 7:30pm.  By 8:30pm we were yelling across the table because the noise was so intense.  The skirt steak was excellent (said my friend) and the chicken was ok - still a little dry in places.  The french fries were delicious, but not sure why they're award-winning.  The lamb chops were okay.  The service was very good and friendly.  It's a nice place but I wouldn't go back on a weekend night.  Just too much noise.  Also, some of the pricing is a little high for this budget.", "author": "Lynne W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "One of our favorite spots in the neighborhood. Libertador is consistent - friendly service \u0026 good food at very reasonable prices. It's a small restaurant and the atmosphere is very warm, but you can usually find a spot at the bar. The Empanadas, Garlic Shrimp, and Eggplant Rollatini are some of our favorites.", "author": "S. K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-31", "description": "I've been here before and I really liked it. However, this time, I came in as a party of one. There have been almost 15 tables open for the last hour and a half, but the server insists on sitting me at the bar. I spend nearly 50 bucks on a steak that was just ok and a salad that was also just ok.  After my salad arrives, the waiter hands me a dessert menu. Huh? I just ordered an expensive steak. It took everything I had to get the attention of the wait staff...mostly concerned with cracking each other up than providing service. The only thing that happened quickly here was eating my check, while the same server who couldn't have cared less about anything I needed hovered over me. Meh. Save yourself some money.", "author": "Alicia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "My mom was in town and she confessed to me (mind you, a vegetarian of some time) that while she was away from my little brother and step-dad, she had one thing on her mind: a delicious steak.  As for me, there is rarely a time when steak isn't on my mind.  I did some digging and found Libertador-- a quaint Argentinian Steakhouse tucked on a corner in Cobble Hill.  Walking distance from my apartment?!: Sold.\n\nWe made a reservation and was warmly welcomed upon arrival.  The table they had set aside for us was right next to the door (honestly didn't look like it was normally supposed to be there-- right in the way) so we politely asked to sit at the bar since no other tables were open.  We sat for a moment and then a waiter came by and let us know that a couple was finishing up and that we could have their table.  It was refreshing that they didn't just stick us at the bar, cursing under their breath that we didn't take the first table they offered, as many other restaurants would have done.  They made sure we were happily and comfortably seated.  Let the eating commence.\n\nThe smell of steak and the spicy salsas and breads gave the restaurant this wonderful smokey aroma that made our mouths water as we waited for our meals.  I ordered the filet mignon and my mom got the strip-- side note, soooo reasonably priced!  Compared to chain Steakhouses where the cheapest, smallest steak is $50, this place is a total steal.  Our steaks were both 12 oz, came with a side (mashed potatoes or french fries) and two sauces (homemade chimmichuri and this vinegary-onion-tomato-salsa, both of which were unbelievably delicious as a pairing to the steak).  We also had two glasses of wine each and split a dessert.  Total bill?:  about $100.  And, the best thing (I rarely say this), is I would have even paid more for the quality and taste of the food we received.  Steaks perfectly cooked, mashed potatoes creamy and flavorful, and the Malbec added a perfect earthy compliment.\n\nIt was honestly such a pleasure to dine here.  Please go give these guys your business-- we were also told on our way out that they are now open for brunch on the weekends!  I cannot wait to go back and try more.", "author": "Des M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "What a great place. Great meat, wine and especially service. The waiters were very attentive and not pushy. My bf and I had the parrillada for 2 and they did everything possible for us to enjoy our meal. The area is very quiet but the place is nice, intimate and very comfortable. I look forward to going back especially for the nice service. Manager make sure you keep your good guys happy", "author": "Elisa P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-19", "description": "Service was rough... Food was pretty decent.  I'd go back and try again.", "author": "Peter G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "I was completely drawn into this place by the atmosphere, and bookmarked it on yelp, walking by. When I returned, I was not disappointed! They have a large selection of salads to which you can add salmon, shrimp, tuna, chicken, or steak. The salad portions are generous as well! Anyplace with flavorful salads in large portions to which you can opt to add protein of choice is a winner in my book! The empanadas were fantastic (it was actually my first time having an empanada), and they have a nice variety of wines.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "We went with the meat sampler plate. It was a bit overwhelming bc it was humongous. A great option for two people.  The empanadas are a must. My favorite was the ham and cheese.  The staff want to friendly but def a nice set up with great food.", "author": "Chelsea G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "The French fries are a must have. I ordered the skirt steak which was very delicious with lots of flavor.  My boyfriend had the filet and it was good, but nothing special.  Definitely recommend the skirt steak with fries!", "author": "Becky E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "This restaurant serves a delicious high quality meal at an affordable price. We originally came here for my grandmother's birthday back in November, and have come back for multiple birthdays ever since! The staff was exceptionally attentive and made my family feel right at home.  The waiters gather around to sing happy birthday, and the owner himself came to check on our table. We always have the eggplant and calamari for appetizers which I would highly recommend.  I love to get the porterhouse steak with french fries as my main course. The meat is always perfectly cured and seasoned, extremely flavorful, and melt-in-your-mouth tender.  Two others in my party have split the mixed grill, which they did not find as satisfying as getting an individual steak due to smaller portion, higher price, and less flavor in the meat. This is one of my favorite places to go in Brooklyn- I cannot recommend it enough!", "author": "Courtney S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-05", "description": "Stopped in after a run tonight, hoping to get a nice salad. B/f and I started with the 4 color arugula salad. Delicious and generous portion, the bell peppers were so fresh and fragrant! Next we shared what I'll call a sampler platter including chicken, an empanada, the skirt steak, and the Argentine sausage! The skirt steak was incredible; buttery, tender, perfectly seasoned- a generous portion, chicken had a great seasoning, the sausage was moist and flavorful, empanada was golden brown and packed full of flavor. The presentation was great and food came out piping out on a hot griddle. This was a great portion size for two. We ended the meal with a glass of their homemade warm  Malbec wine (amazing- cant wait to come back for this when it's colder out). I'm not a big dessert girl, but the dulce de leche crepes were caramely and gooey and the crepe was buttery and rich ! This is a must have dessert! \n\nService was wonderful and really enjoyed every bite! Prices are really reasonable for the quality of food.  Will be back soon!!!", "author": "Abnous V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "My son turned 13 on Saturday and he really wanted steak, so we made a reservation at Liberatador for my family of 5 and my sister, her ex and their three kids. Our numbers kept changing, but we were easily accommodated. The service was excellent, the food fantastic, and they even let us bring our homemade birthday cake. All of us had a great time. I'll be back!", "author": "Ash M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-02", "description": "I LOVE Libertador. Been there a couple of times and can't help but order the meat parrillada for 2 every time. The salads are also great - as was our chose of wine, the Malbec. The ambiance is nice and definitely suitable for a date.", "author": "Tim V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-07", "description": "I was psyched when this space finally reopened and even more so that it became an Argentine steak house. Having spent a lot of time in Buenos Aires, my favorite places to eat there remind me much of this restaurant. The meat is very authentic and delicious and the ambience is nice but straight forward and NOT in competition with the hipper restaurants of Cobble Hill. I hope this is not its downfall. Reasonably priced, lovely help and my new favorite spot.", "author": "Tim I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "Wonderful food and atmosphere! The grilled octopus appetizer is fabulous as is the skirt steak. Of course the frites with the garlic are a must. The house dressing for the beet salad used to be better but it's still fine.", "author": "Jessie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "I can truthfully say that Libertador was, all around, one of the best experiences I've had at a restaurant.  From first seating, the staff was friendly, knowledgable and attentive.  Then. . .the food.  Wow.  The steak grill for two was just unbelievable - cooked in part at the table!  And the apple cake?  Yum.  The ambiance was as delicious as the food. Even in a neighborhood with many great restaurants, Libertador stands out.  Truly outstanding.", "author": "Tommy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "Everything was delicious.  Service was perfect, the food was yum and the atmosphere was fun!!! Prices were reasonable.  Great place for dinner with friends, family or a date.", "author": "Stephanie M."}], "servesCuisine": "Argentine", "priceRange": "$11-30", "name": "Libertador Steakhouse - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/jSmvGdTiHDB2XRrYBH9XbA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893122"}