{"aggregateRating": {"reviewCount": 213, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-31", "description": "this place is ok if you have a quick craving for grilled meat but nothing great. I've had way better for a lot less in queens, where its know for these types of restaurants. Nothing in this place would warrant me to make plans to go. I guess if you never had good south American grilled meat before this is the spot for you but I really wouldn't recommend it off the top of my head", "author": "Billye D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "Good food, I tried the Entraña with the French fries and it was delicious.  My boyfriend had the porter house steak with mashed potatoes and he said it was really good. I don't have any pictures beacuse I was so hungry that I totally forgot to take pictures. The sangria it was so so.  The reason I'm not given them 5 stars is beacuse the place is really small and when we arrived it was packed and they don't have a waiting area, we were almost on top of each other but other then that it was worth the wait.", "author": "Carla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "So delicious! The seafood soup, crab cakes, empanadas, the meats, French fries and the dessert is extremely delicious! Our waiter was so nice. We were there towards the end of the night and the owner came over and introduce himself and talked with us for a bit he was a cool guy and very nice!", "author": "F R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-01", "description": "We looked for a nice new place (for us) to eat on Halloween night. I was looking for a place that had a mix of great salads that also had some good entree options. We found this place on a \"best salads in NYC\" list and decided to try since it was in our neighborhood. We arrived and there were many families with costumed children (so cute!) having dinner. We did not have a reservation so were asked to wait at the bar. This was fine, and we looked over the menu while we waited to be seated. Once we were seated by the hostess, it wouldn't be until I asked the hostess after FIFTEEN minutes of waiting with no \"Hello!\" \"I'll be with you in a moment\", nothing. She grabbed someone and then after another 5 minutes he came over and quickly took our order (we ordered everything at once since we had a sinking feeling we wouldn't see him again), and rushed off. We saw him again once. On top of the lack of attention and service, the wait for the food was very long (I ordered a salad with steak topping and he ordered a chicken dish). This, coupled with the below average service made the experience sour before our plates were even brought out. Luckily, the food was the only saving grace although I wouldn't say it was the best or even worth the long wait. The manager could be seen around the restaurant, greeting and talking to other patrons, but somehow always skipping our table... At the end of the night, the hostess brought our check and charged it for us (our \"waiter\" was just much too busy to be bothered). As I stood to put my coat on, the manager came bustling past to ask how the meal was...\n\nNote to management: Your food is good. Take the time to train staff that can manage and provide service at any traffic level. Never make the consumer fee forgotten. Also, you may want to come up with a more efficient timing plan for the kitchen staff; you have to make some decisions regarding priority if you are going to be partnering with Seamless.\n\nFrom the boyfriend: Overall experience was disappointing. The only saving grace was the food.", "author": "Amanda T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "I'm surprised there are no reviews, so I'll add mine. \nWe don't get to dine out much, but when we do, we head here often. The dinners are delicious, the wine selection is good. We love the steak, my son gets that salmon. It's delicious every time, and service is attentive. \nIt's family friendly, and we usually dine with our 3 year old. But it's certainly not a watered down family restaurant. \nFor lunch/brunch on weekends, I've found this place to be quiet, while Smith and Court Sts are a buzz. Great burger, salads, and again, great service and accommodation for our kiddo. \nIt's also the place we take my inlaws when they come, and they are not an easy audience. They love the service, the Argentinian steak and fries. And it's not terribly difficult to get a table. \nI highly recommend you check out this place. \nI was looking it up for a possibility for Mothers Day lunch today. We've moved out of the neighborhood, but still eat here when we visit.", "author": "Ricki Jean T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-25", "description": "Great place for a family meal. They easily accommodated our last minute party of 7 for a birthday dinner. The food came out to everyone's liking. The prices are great for a steak house. The restaurant felt lively yet quiet enough to hear conversation across the table. It even received my mother in law's approval and she hates just about every restaurant for being too loud. Will definitely return.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "This was my first time at this lovely Brooklyn gem. I was pleasantly surprised even though the night was a rainy ugly one for walking it was very centrally located easy to find in a great neighborhood. Food was fantastic service was great this is a must check out location if you are in Brooklyn or interested in some great Argentinian style steak.", "author": "Sean W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "Went here on a Tuesday night just to check it out. The ambience was great and the food was out of this world delicious. The burrata and the empanadas were incredible apps and I had a delicious salad- though what I really wanted was to try the ravioli. Oh well! Next time. My boyfriend had cheese stuffed skirt steak with mashed potatoes and we were both in heaven. I want to try everything on the menu.", "author": "Kate A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-09", "description": "I gave this place three stars instead of four because although there are some outstanding dishes, there are also some serious misses; although the busboy was fabulous and just the right amount of attentive, the waiter was huffy and pushy, so this place is a bit skitso. Also, keep in mind that this place is not entirely Argentinean but more fusion-e.\n\nThe good: Outstanding tuna carpaccio was meaty and a significant portion. Mashed potatoes were very authentic and delicious in the creamy Argentinean style. My friend got the steak salad and she said it was very good, but not amazing, which is what you would expect of an Argentinean restaurant. Very reasonable prices.\n\nThe blah: Waiter was frazzled and easily annoyed, was a little too pushy about us getting more food and drinks. For desert we had the Charlotte, so kudos to this place on even having that on the menu because it is a very traditional Argentine dessert, but then the thing itself was terrible: cheap ice-cream, cheap chocolate sauce and not too much of it. Just bad. \n\nThe neutral: Ambience is nice and chill, albeit not really Argentinean. \n\nOverall, this place is just fine. Don't think I would go back, but I might order the tuna carpaccio to go.", "author": "Erica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "We found this place through Yelp otherwise we'd have no chance of coming by here.  Located on quiet Henry street in Cobble Hill, you'd have to be referred here in some way to find it since it's some ways off off the more popular Court and Smith streets.  Parking is hard to come by in the area, as well.  \n\nOnce we got here, we were warmly greeted by the staff and felt welcomed right away.  Great, friendly people who made you feel right at home.  Giovanny enthusiastically welcomed us in and explained the menu options to us.  There were many meat options so we went with the mixed grill for 2 and some empandas for apps.  The empandas were nicely seasoned, meats were flavorful, and pastry was fluffy.  The apps were perfect to start off, nothing too heavy.\n\nThen came the mixed grill, the massive platter served on a deliciously enticing sizzling platter.  There was sirloin, short ribs, chicken, and sausage, all sizzling hot and delicious looking.  The meats were more than enough for 2 people, but it also came with fries and a salad.  The meats were perfectly cooked to order (except for chicken and sausage).  The flavor was good at first bite, then they all start mashing together and all meats tasted the same.  Chimichurri was not the best we've had, could definitely use more flavor and less oil.  \n\nOverall it was a wonderful spot for a quiet dinner and lots of meat.", "author": "Leila L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "This is the one restaurant that I compromise my no-red-meat diet for. Their 2-person dinners are a must (I prefer the all-steak one). It's quite affordable and you get quite a bit of delicious food brought on a hot grill and cooked right in front of you - me and my partner are never able to finish it all!\n\nBut make sure you leave room for dessert - because their dessert drinks and panqueques are even tastier. I would have their mulled wine any day of the week!", "author": "Rey N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-27", "description": "I was brought out a mistaken meat dish and when sent back, the waitress was, as we found out, charged for the meat...which she tried to recover by sneakily charging for refills on coke. food was amazing..! Management terrible", "author": "Stephanie J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-02", "description": "Cozy place, the tables are a bit too small to fit everything on them, food was not really exciting.. come here for wine not for food", "author": "Niclas M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-07", "description": "I've been to Libertador twice and had a very similar experience both times.  The atmosphere is wonderful, the staff incredibly friendly and warm.  We loved the empanadas and the appetizers, but there's something lacking in the entrees.  The meats are just not that great. I've now tried the steak for two, the lamb, and the steak for one.  Our friends had the mixed grill and said the same thing.  It's ok, just not great.  \n\nI would recommend stopping by Libertador for a glass of wine (or two) and a couple appetizers before moving on somewhere else for the main event.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "All around amazing dinner. From the salad to the mixed grilled platter for dinner. Don't forget to order the Flan!", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "Service was great! The food so so Yummy. Got the mix grill for 2 and the food was for so much more people. Food tasted fresh and dessert was yummy as well. Love loce love", "author": "Tima A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "I wish I could give it a 4.5 - this place was really a treat for my husband and I.  We came in on a Tuesday night for a romantic dinner before my husband was going out of town.  There were so many delightful options on the menu that it took us both awhile to narrow down our selections.  The mozzarella and avocado salad was amazing!  The mozzarella was milky and soft and the avocado was perfectly ripe (not easy for March!)  the salad itself was perfect - not too much dressing - just a touch.\n\nI got the lamb chops and there was a lovely serving and it was seasoned very nicely - a hint of seasoning but not too much and not too salty which happens too often.  My husband's skirt steak was AMAZING!  I mean, write home about it good!  So juicy and tender and lick your lips good!  \n\nThe atmosphere is warm and cozy yet light and airy because of the giant windows and tall ceilings.  \n\nThe wine by the glass list has about 15 white wines and 15 red wines on it as well as several sparkling wines.  I was impressed: where else can you go where they have 4+ Sauvignon Blanc by the glass on the menu or 4+ chianti on the list?  \n\nI can't wait to come back and try more things on the menu (although I definitely want the mozzarella and avocado salad again!). \n\nThe service was very attentive yet not intrusive.  5 stars for the wait staff for sure.", "author": "Abigail M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-18", "description": "This place was a travel for us, but it is hard to find Argentine cuisine in Bensonhurst Brooklyn. We gave this place a try, since it had some good reviews. My son's father and mother both came from Argentina. \n\nThe ambiance was nice and romantic. \n\nFor Appetizers:\nHumita Corn Empanadas: Good \nChorizo Of Morcilla: Okay- I had better in Queens \nAlbondigas De Carne (Argentinean meat balls): Never again to order\n\nEntrees:\nParillada Para Dos - There was plenty of meat for both of us...but there was one kind of meat that came just one, we needed to split that tasted very good.\n\nCostillas De Cordero (lamb chops) - The chops were served cold, we sent it back to warm. My son's grandma did not like the chops. \n\nSangria - Good but expensive\n\nService - was great, Jon was very attentive.", "author": "Angela K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-01", "description": "Brooklyn is definitely good for certain things but authentic ethnic foods, not so much.  It's funny reading people saying how great the steak is or how this is the best Argentinean restaurant they've tried. Well, it's probably because most of these folks live in Brooklyn or Manhattan and have never stepped foot in a real Argentinean or Uruguayan place. \n\nThe place is cute, I give it that. And the octopus that everyone raves about was decent. A little salty but decent and nicely sized. And then everything went downhill. Me and a friend ordered the mixed grill for 2. It came sizzling on a weird cast iron skillet that keeps the meat cooking. Why? Why the fuck would you do that? This made absolutely no sense. Have these people been to a real Argentinean steakhouse? No respectable parrilada would do that to steaks. My short ribs were already super thin and I knew right away that they would be well done in a few seconds. They need to be served in a metal box tray that keeps the meat warm, not cooking. You can go to any parrilada in Jackson Heights and they'll show you how it's supposed to be done. As for the meat, very very disappointing. Everything was salty and the short ribs were salty as shit. It was like they poured a box of Morton's right on the meat before serving. The chicken was dry as expected, the skirt was chewy and flavorless, the short ribs were so thin, they reminded me of kalbi.  They all had so much black pepper that I couldn't even taste the meat. The sirloin was the only piece of meat cooked right - medium rare, but was still flavorless and chewy. The best part of the grill was the sausage, because that was the least salty - imagine that?  I was surprised that they didn't include morcilla or chinchulines in their mixed grill but I should've expected that given the mostly non-ethnic clientele here.  The chimichurri they served was absolutely not what a respectable Argentinean restaurant should call chimichurri and the amount they give is embarrassing. And what kind of Argentinean steakhouse doesn't give bread? \n\nI can go on and on about what's wrong about this place but I'll stop here. What I've realized is the low standards that Brooklynites have to give a place like this 4 Yelp stars when the worst parrilada in Queens is head and shoulders better than what you are being served here. Go to El Gauchito, La Fusta, La Esquina Criolla, Chivito d'Oro and see how it's really supposed to be done and thank me later. And don't worry, these neighborhoods are safe.", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "We were actually walking past this on our way to another but knew this just popped out so checked the menu. Wooooot. Walked past it mentally checkin' it in, walked two blocks past and gave each other a double look and turned right back around. THe menu looked too bangin' to give up. And we love Argentinean food, and my dude esp love Argentine steaks\nThey have been open for two weeks and so far so good. Attentive and funny staff who are super accommodating and RIGHT on the money when you ask for recommendations. Skirt steak over rib eye, really? Fine.....The Verdict: SKIRT STEAK was AMAZING, medium rare and buttery on its own, didn't really have to dip into the chimichurri sauce, which we loved as well. Fries that comes with it was superb, that's only if you like them greasy potatoes crispy. I got the papardelle bolognese, did i mention HOMEMADE??????????? perfectly a la dente, mi gente, every spoonful like a heroin addiction. WOOO. ask for a side of chili flakes and we have a grandslam ball game.\nAppetizer- we tried to go healthy and got asparagus but it was fancied with prosciutto and cheese, can get greasy but WHOA. that was slammin'. \nDon't forget a bottle of Malbec, homes. \nThey're gon get slammed once they get more publicity but we native Native New Yorkers and nearby Libertador locals know how to shimmy our way in. Get out our way.", "author": "Davina L."}], "servesCuisine": "Argentine", "priceRange": "$11-30", "name": "Libertador Steakhouse - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/jSmvGdTiHDB2XRrYBH9XbA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893122"}