{"aggregateRating": {"reviewCount": 213, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Nice outdoor seating in the summer. No wait on a Sunday night. Great service. Spaghetti with shrimp, mussels and calamari was good, nice and saucy. Mixed grill was also good, the steak was delicious, chorizo was just ok. Excellent chocolate mousse for dessert.", "author": "B H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "This restaurant is pretty awesome. Right when you step in you can smell the wonderful aromas. The ambiance is quiet, cozy and intimate. The waiters are extremely attentive and friendly. Now, let's get down to the food! I got the mixed grilled for 2 for $46.95, which to me, was an amazing deal. The textures and flavors within these meats were amazing! The sides were fries and salad which were also extremely tasty. In other words stop what you are doing and come here! LIBERTADOR will definitely see me again!", "author": "Nichole R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "Liberator is a restaurant that I have been dieing to try for quite some time.  After my visit I realized I waited too long and wish I had experienced their food sooner.  It's simply amazing.  Liberator is a quaint, dimly lit, rustic in decor, Argentinian style restaurant with an extremely welcoming and friendly staff. \n\nI came to Liberator on a Saturday evening around 8pm, with no reservations.  I was cordially greeted by the maitre' d who said my wait for a party of four would be about 20 minutes. We sat at the small bar that is located upon entrance and we ordered a glass of Alma De Los Andes, Malbec. $10.00.  It was worth every cent. By the time we were done with our wine our table was ready.   \n\nWith no hesitation our friendly waiter came to take our order.  We had no appetizers and went straight for the main courses. Everything we ordered was served for two, such as:\n\n22 Oz Grilled Sliced Marinated Prime Sirloin for two. It was ordered medium rare.  The sirloin was tender, juicy and extremely flavorful.  The meat itself was not veiny or chewy.  It comes with the option of mashed potatoes or french fries as a side. $45.00 and worth it.\n\nMixed Grill for two, which is really portioned for three.  It comes with, Short Ribs, Prime Skirt Steak, New York Strip, Chicken Breast and Chorizo.  It comes with the option of french fries or mashed potatoes.  This dish is served on a piping hot skillet.  Each piece of meat was tender, juicy and flavorful and the meats were quality for the size of portion you get. $45.00. Exceptional dish.\n\nLiberator's wine list is pretty extensive.  Offering wines from different countries and options of red or white.  I chose a Malbec Reserve by the name of \"Alma De Los Andes.\"  It was a dry, full bodied and smooth finish wine that left no aftertaste. $50.00.  Excellent wine. So good we ordered three bottles. \n\nWe were so stuffed there was no room for dessert.  I was pleased with my experience at Liberator. My friends and I will definitely be back and would like to try more options on their menu.\n\nThe link listed below will provide additional information on Liberator and their menu. \n\nhttp://libertadornyc.com/brooklyn", "author": "Michael M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-08", "description": "Had a little chuckle to myself when I saw my wife reviewed this place after the first time we came and gave it 4 stars. \n\nWe came tonight to satisfy our morcilla (blood sausage) craving and it was hands down the worst we've ever had. Coupled with the terrible chimichurri and the fact we weren't asked how everything is I have no choice but to leave 1 star. \n\nAlso our friend's calamari was tasteless.", "author": "Edward C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-27", "description": "On the plus side, the steak was flavorful, the fries were crisp and the beer was cold. On the minus: the staff works very hard but are overwhelmed. Our waiter was polite and friendly but the food took more than an hour to get to the table.  I would not recommend Libertador until they hire more staff.", "author": "Robert R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "This place is a gem, with friendly staff and a compact, cute, and clean brooklyn location.  As a meat eater, this places was so great!  Loved the homemmade mashed potatoes as well. I can't wait to come back and try more dishes.", "author": "Marina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "Very cute ambiance and I called about a table for 2 on a Friday night and got one reserved no problem so that's awesome.\n\nHad the half dozen empanadas \nTried everything but the ham and cheese \nDidn't like the beef too salty\nWas pleasantly surprised by the spinach that was the winner followed closely by black bean\nDidn't like chicken either oddly enough\nThe rest were ok \nThe dough was baked and golden and beautiful\n\nHad the octopus it was exceptional and the side salad was on point too with some great dressing and a few pieces of potato this was the perfect appetizer\n\nWasn't crazy about the meatballs \n\nHad a nice bottle of red mixed malbec and cab\n\nThe mixed grill was large but the meats were fatty cuts not the best quality and we asked for medium not accounting for it continuing  to cook a bit more after the fact. TIP - wear something your not afraid of getting oil splatters on or plan to come late so you have room to sit back. \n\nThere is another grill for 2 option which I think might have been a better choice the table next to us had that and were super happy.\n\nTried the famous fries and they were basic. Mixed grill came with that and salad so it's a good balance.\n\nThe service was top notch however through and through which is why this place gets 4 stars", "author": "Maya B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-23", "description": "Wanted to try this place for a while. Finally made it out as a birthday excursion. The food was good but as other reviews have mentioned, the cuts really fatty in some parts.  The service was extremely unfriendly. We were there at 5:30, totally empty and he acted like we were a nuisance more than anything else. Definately did not deserve the mandatory 20 percent service fee. 300 dollars spent and they weren't inclined to waive the cake cutting fee. They wanted to charge us 3.50 a person for our cake that we had unknowingly brought in. Bad business.  No less flies everywhere inside, they need a fly trap or something. \nDisappointing especially for the bad service.", "author": "M F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "I walk by this very cute restaurant every day and was very happy when I finally tried it out. Their steak is delicious but the true star of the show are the empanadas. I tried every option and loved them all, but the beef one was my favorite. The skins aren't too thick and it's bursting with flavor.", "author": "Jasmine F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "The best steak at cobble hill mix grill excepcional and pitcher tinto de verano very good prices excellent and good tasty I will back to libertador soon", "author": "Geovanny M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-27", "description": "We waited 45 min for our appetizer (burrata) an hour and fifteen minutes for our entrees.  I got a steak and fries and my boyfriend got raviolis, not exactly the hardest things to make. We saw our waiter one time when he took our order, we spent the rest of the time trying to catch eyes with him to check on our food. My boyfriend had to walk into the restaurant twice to ask for our food and our check.  Horrible service. Also, when the food came out my boyfriend's raviolis which cost the same as my steak were severely disappointing....6 sloppily plated raviolis for $16 ?! Chipped plates?! Sauce everywhere? Obviously a rushed job.\n\nThe manager came out to ask what was wrong when we were about to leave but just said he was sorry....no offers to make it up to us.", "author": "Mariah K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-21", "description": "Worst service ever!! Don't trust your OpenTable reservation when coming to this restaurant. We made a reservation there and once we got to the restaurant, they said they didn't check OpenTable. They have a manual reservation system - how come they include the restaurant on the app and fail to honor the reservation? We waited for an hour, with promises over and over again that we would be next. It never happened. I am pregnant and they never offered me a seat, never apologized for their mistake. We had to fight over and over to get the little respect we deserve. In the end, a table for our group became available, and they put another group there instead of us. Unbelievable!!!!", "author": "Maria T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "This Argentinian restaurant is nice and cozy. The service is good and there is a great selection of wine to go with the meat platter for two. Make sure to get the meat done a little under cooked because it comes on a hot skillet which continues to cook the food after being served. Also grab a few spinach empanada which to die for.", "author": "Marvin M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-21", "description": "Horrible experience. Even though we had a reservation, we waited for over 40min before they gave our table away to someone else. They are completely disorganized and do not honor reservations.", "author": "Marcelo B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Epic ribeye and outstanding soups. Go. It's the perfect off the beaten path spot for a dynamite meal with friends!", "author": "Lars A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "This is a cozy hangout in Cobble Hill. The servers are very nice and the food is splendid. An assortment of delicious food to try and love all of them. Highly recommended.", "author": "Joe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "Still tipsy over the Sangrias, delicious food! Just happened to be driving through the neighborhood   trying to avoid Atlantic Ave traffic. We were hungry and the reviews looked promising. It's a small \u0026 cozy lil restaurant but worth the stop. If you plan on driving good luck with parking, there's absolutely none in these narrow residential streets of cobble hill. 20 minute wait at the bar, we ordered appetizers and a choice of red or white Sangrias. After being seated and ordering food, the wait wasn't bad. I enjoyed the nice lil date night with the wife on our way home from shopping.", "author": "Helmut D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "This place is super cute. They have indoor and outdoor seating. It wasn't really crowded tonight, so we got a nice table next to the Windows. I love the decor of the place. I never mention bathrooms in my review, but they have the most adorable bathroom ever. \n\nAnywho. The food was great. My drink was fabulous. My friend and I sat and talked for hours without being rushed out. \n\nI'll definitely be returning.", "author": "Audrey D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "4.5 stars. That's my write in rating \n\nI really liked all the food I tried and I tried a lot. I had a real fat boy night and ordered way too much. I tried every app aside from the crab cakes. No exaggeration. Empanadas were all great, octopus was delicious, sweetbreads were very good. And on and on.\n\nDinner was also great. Split up a bunch of entrees with my people and got a good tasting. As expected the skirt steak stood out, as well as some enchilada type thing on the menu. \n\nDessert happened but I don't even remember what I ate. Must've been good.", "author": "Mitch K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "Solid Argentinian spot for groups or a date\n\nCame here with a group 3 and we had the following:\n\n-Mixed grill for 2 for $45. Solid dish with tasty meat and lots of food. \n-Empanadas (spinach was ehh, beef and chicken with potatoes were money) \n\nThey serve wine and beer only.\n\nThe ambiance and service was great.", "author": "Tim R."}], "servesCuisine": "Argentine", "priceRange": "$11-30", "name": "Libertador Steakhouse - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/jSmvGdTiHDB2XRrYBH9XbA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893122"}