{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-06", "description": "Love their unique twists to various asian cuisines. Their chance mojito might just be the best drink i've ever had in my life.  Cobble Hill is great and I love this place.", "author": "Cynthia O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-10", "description": "$2 beers and $4 martinis all night if you eat at the bar. Sun to thurs only.", "author": "David R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-09", "description": "This place is great -- fantastic dim sum, good decor, and a really cool bar.", "author": "Anthony K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-10", "description": "I've only had lunch here but damn it was good and cheap! The lunch box deal is the best way to go. Make sure and get the shrimp wonton soup, it was amazing. I went with the orange beef and I loved it. All the specials looked great and for under $10 it was wonderful. They also have some lunch specials of dim sum which is fun too.", "author": "Jenn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-29", "description": "Some lovely food happening at this place. Chance chicken is a staple. Beware the chilli peppers, they will shred your palette. Best lunch deal in the city. Nice dim sum flights. GO.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-15", "description": "This is becoming my favorite spot for Asian food. Delivery is fast and hot. Pad Thai, spring rolls and the ribs are very tasty. Good value for $$ also.", "author": "Heather C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "Fantastic food, cute environment. I had the $20 price fixe with curry mussels (amazing), sweet \u0026 sour duck and coconut cosmo", "author": "Ishma'el A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-07", "description": "Did you know that Chance stands for China / France? Knowing that made me feel better about eating here - sort of. I've been passing this place for a while and it really stands out like a sore thumb which is part of the reason why I've been passing it by for so long. The food was really great. I loved my meal, spicy miso chilean sea bass... really tasty Chinese style but healthy tasting at the same time. Good ambiance. Great service, very attentive. I recommend this restaurant and will definitely go back.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-22", "description": "I have been coming to this place for years and I love it. The food is amazing and very reasonably priced. Try the Ocean Box. The drinks are fun,unique and they get the job done! The place is very small and ideal for an intimate dinner. Ordering a bunch of appetizers and dim sum is my suggestion. The staff is super friendly and the people who have been going there for years are very friendly as well. Apparently many celebs have gotten hip to this place because I have heard of some sightings a la Johnny Depp and Tyra Banks. If it's good enough for them than it's good enough for me.", "author": "L. W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-03", "description": "Yummy food, pan-Asian in the sense that you can get your favorite Chinese, Thai, etc. dishes.", "author": "David M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-28", "description": "GROSS! Chance fried rice was barely (not?) a step up from mall food.  The vegetables (peas and carrots) were definitely from a freezer, and possibly the shrimp as well, which were teeny tiny.  The fried pork dumplings were okay.  Affordable, yes, but not very tasty.  With so many better options in the neighborhood, I would never recommend Chance to anyone.", "author": "cory b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-04", "description": "Amazing food and great service, I've been comming here for years and love it ever bit as the first time i came. Their house Peking Duck gives Mr Chow a run for his money! Love their new lobster appetizer I think its the Dynamite Lobster! Amazing from start to finish, and Drinks! OMG Love the DRINKSSSS, LYCHEE Martini all the way baby! You can go to places with more fanfare, but this place is comfortable, amazing food and great service, you will not be dissappointed!", "author": "Joe R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-09", "description": "This USED to be one of my favorite places to go with friends, family, and co-workers. We went last night and now understand the 'B' rating. A roach crawled across the table that I was sitting at, right over the napkin. I killed it and showed it to the waiter. He took it, gave me a new napkin, and a meek \"Oh, I'm sorry\". That's it.  The owner and management changed hands within the last year or two and things have gotten increasingly worse.  A roach walks across the dinner table, dumplings take almost an hour to arrive, it was freezing, and we were the only people there right after work. A friend came by later and ordered some take-out. We got our check with her take-out included on our check which automatically gave them the 18% gratuity rate. So now we are to pay $20 in a mandatory tip for a ROACH. When asked about any concession or response to the roach, I was told that the owner said to give us a free dessert. I didn't eat anything after my soup because a roach crawled across the table. My bill was $4 for soup. I was not adding an additional $5 tip for a roach. The friend with the takeout got her ticket separately and we were left with our bill. No tip should be given for a roach and no care was given for the incident. Then to top it off the food was less than satisfactory for the rest of the party they did eat. Two of my friends continued to examine their food for fear of further bugs. It was a great spot 2 \u0026 3 years ago but no more.", "author": "M.D. S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-11", "description": "This place has received good reviews in various magazines, but I was unimpressed on a recent visit. The decor is very stylish but the waiters are almost overly attentive and seemed to be hovering. They do offer several types of sake and a decent bar selection, but the food was unimpressive and a bit expensive for what it was. Ordering two Dim Sum combos and the special appetizer, we ended up with fair to middling shrimp tempura and a series of dumplings that you might expect to find on a $7.99 all-you-can-eat buffet. Maybe the regular entrees are better, but the Dim Sum was featured and it was nothing special for too much money.", "author": "Devin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-26", "description": "I've been to various places with good food but never bothered to write a review. But with this place I just feel that I HAVE TO mention about here. Found out about CHANCE last night searching the internet for a chinese place in Carroll Gardens on nymag.com and menupages.com. What a discovery !!! Went there for lunch around 1pm. The place was almost empty but the interior was encouraging so I took the CHANCE. And boy, was it worth it !!! I chose the seared salmon and the whole dish came on one big plate. Garden salad with delicious ginger sauce, a little spring roll (to die for !!!) with some unbelievably tasty mayo (I think) sauce and, of course, the salmon. I'm not kidding: I already told the waitress she's gonna see me there every Friday. I have no idea how people come up with the negative reviews about this place. I'm going back !!!", "author": "JUSTYNA K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "Great restaurant... food is delicious, service is great. The servers have an amazing memory and will remember you after only being there once. Very quaint!", "author": "Eveliza J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "Yeah, Where are these negative reviews coming from? Snarks-ville? Been going here for years and It's always been spot-on awesome. The dim-sum is really, really, really good (try the pork and foie gras dumplings). Great drinks, decor, food \u0026 service. What more could you want?", "author": "Brian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "been here a few times (mostly drinks). The cocktail list is amazing..... a huge variety of mixed drinks you probably haven't seen elsewhere.... i like the lychee mojito.... had a few appetizers (although I've forgotten the names...one had tuna).... it seems like a nice fusion place.... only reason I gave it 4 stars is cause the crowd can be a bit ghetto at times (at least for the area)", "author": "C. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-11", "description": "Been here a bunch of times.  Good pan-Asian food at a decent price.  Place can get really noisy when it's packed, which is often because it's so small.  Everything is good, especially for the price, but nothing really stand out as amazing.  I would say the best thing is the bar.  They have some interesting cocktails and their fairly cheap for the size glass it's served in.  Best time to come is in the summer when the sidewalk tables come out.  Nothing like some plum chicken, pomegranate margarita and people watching.", "author": "James V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-14", "description": "The worst dining experience I have ever had.  Food is not good, and not fresh at all, i was worried about getting sick.  But to top it off, their drinks are disgusting, its like they use the wrong liquor for very easy mixed drinks, for instance- vodka in a mojito.  ick!  There are sooo many great restaurants on smith street, I suggest to skip this one.", "author": "Cheesepatoot P."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}