{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "The food was good, the drinks were good, it has a nice, calm vibe, and the service was good also.", "author": "Nay N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-28", "description": "I came here for dinner on a Wednesday night.  We ordered the rock shrimp tempura appetizer, the mongolian lamb dumplings appetizer, the kimchi fried rice, and the eggplant tofu stir fry.  The shrimp was okay, a little too much mayo for my taste.  The lamb dumplings were way too salty.  I didn't even need to dip it in the soy sauce that came with it.  The kimchi fried rice wasn't spicy at all - the kimchi wasn't even seasoned, tasted just like pickled cabbage without any red pepper paste.  The eggplant tofu stir fry was the only decent dish really but still was not memorable.  The sizing of the eggplant and the tofu was very strange - 6 tiny pieces of tofu and like 8 giant pieces of eggplant.  I feel like they should've cut the eggplant smaller.  Overall, the portion size was really small for the price and mediocre at best.  I expected the portion size to be larger.  I feel like I could get better food and prices in Manhattan.", "author": "Julie Ying X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Cozy place with good service and very good food. I had sangrua, and I liked it. Live music doesn't hurt either. One suggestion if I may...when you bring a steak knife, offer it or place it on the table handle towards the customer. Will return.", "author": "Andy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "My favorite Asian restaurant in the neighborhood. I've been coming here for years and every time I'm here it's better than the last. They change the menu often enough so you can always try something new, yet they keep all my favorite go to items. I would recommend the sea bass, and fire crackers from the cold appetizers. The drinks are always served in a big glass and never watered down. They also have great happy hour deals. Overall, I love this place and can't say enough great things. I will continue coming here, for the food, atmosphere and great service!", "author": "Vicky K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "Chance is my favorite spot for good food and great atmosphere! On a strip with a lot of restaurant, Chance definitely sets itself apart from the rest. Highly recommended, you won't be", "author": "Yanni S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "We just had dinner here to celebrate my daughters birthday. The food, ambience \u0026 service was EXCELLENT  \nThey even sang happy birthday to her with ice cream \u0026 candles \nWe will definitely be back!!", "author": "Ivette E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "Great place for a Saturday night dinner. Love the food and the drink in this place!!!", "author": "Sam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Love this place happy hour prices are amazing!! Especially for smith street. I went here with an old friend and we loved our waiter, he was so sweet and personable. The the food was also great!! I highly recommend--the food was great too. 10/10!! Come for happy hour or just a tasty treat--you won't be disappointed", "author": "Maya H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Great !!! I got what I expected. G chicken is amazing and dumplings are really great. I will visit you guys soon . Thank you", "author": "Lobsang D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "I'm giving this place four stars because they did not have my lobster and spinach dim sum and I wanted to try them so baddddd. Anyways, we walked in around 2pm and we had the place to ourselves. I tried about four different types of dim sum-pan fried beef with pine nut, steamed shrimp, pork pot stickers and the deep fried vegetable (not good). Also, my friend had this shrimp and mango entree. It came with some brown rice. It was too sweet and gooey for me. Too much sauce. I had a lychee martini and the lychee tart for dessert. Yummy! The place is worth a try for some tasty dim sum.", "author": "Tamra G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "I love this place, they have amazing happy hour selection and the bartenders here are heavy handed. Happy hour  does have little snack for 3-4.50 but the portions are very small so be mindful you are getting what your paying for. Their happy hour is longer than others it ends at like 8 or 9 some days they have all day happy hour. This is my go to place when I am in the downtown Brooklyn area.", "author": "Milan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-06", "description": "Been hanging around Smith street for a while and never tried this place, so I tried to take the chance (yes I said it). I'm glad I did. The food was really good and I particularly loved the Fried tofu which i think they should start calling \"tofu nuggets\". Thw happy hour sangria were really good too, specially the hot one which had a nice coconut flavor. \nPRO TIP: \"tofu nuggets\" aka Mcveggies", "author": "Cesar I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "I always enjoy this place!, I have been going to this place since 2011, the food is always flavorful, customer service is friendly, accommodating and courteous. Try the peach and mango sangria, food, drinks and service is always consistent. Definitely recommend!!", "author": "R R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-29", "description": "I am sure that in their menu there are dishes that I will love, from the pictures I would say so. But my first experience has not been as exciting as I was expecting. \nWhy?\nWell, that day I woke up dreaming of Dim Sum. A serious Brooklyn-Chinatown Dim Sum. I have already tried a couple and was deciding, with my husband, which one to try this time. \"...This, that, no let's go there, come on let's try this, uff let's go to the same of last time....\" \n\nAfter half an hour and no parking spot at the place we had chosen, we decided to go back and closer to home, and try Chance Asian Bistro. Seems they have Dim Sum too!\n\n26th of December, Lunch time, quiet day, few people.\nOf course, we order Dim Sum. A nice mix of 16 pieces. \nUnfortunately, disappointing. All missing juiciness and freshness, almost all lukewarm, and with a pretty chewy dough. Some of the filings were nice, but not even closer to the Dim Sum I had been dreaming about.\n\nThe Chance style noodles were good, it is a kind of Singapore Mei Fun which I usually like to order. These were juicy and tasty, a good choice.\n\nService...too slow, it took a while to get anything, from the order, to the dirty plates taken, to the check.\n\nCome on guys, I am sure you can do much much better!!!", "author": "Gessica D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-24", "description": "3 veggie dumplings for $5! - the place is dark in the middle of the day and in real need of some updates design love - the menu was so beat up and worn out I could barely read it - credit card minimum (annoying) - honestly I can't think of a reason I would come back here. Too many other good options in the area.", "author": "Papa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "Was in the mood for some Chinese delivery and was really looking for something in between:\n\nA) Dirty Chinese - fogged over menu pictures, B health rating at best, 0 - 1.5 chairs, buffalo wings on the menu, sad stomach hangover, etc.\n\nand\n\nB) Fancy Asian - uses the word 'fusion', over-priced, food from multiple Asian country's cuisines, dark interiors.\n\nLanded on this place, but it ended up way on the 'Fancy Asian' side. My stomach thanked me later, but the 'spicy orange Chicken' wasn't the General Tso's I was craving (it wasn't even at a Corporate Tso, or Lieutenant-Colonel Tso level), and the price tag was way higher than the local joint. \n\nEverything tasted fresh and delicious though, so still a solid delivery option if you have plans later in the day that don't involve being curled up in a fetal position.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "The service was great! The Crab Corn Soup and so were the Lychee margaritas were amazing.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "If ever in the area, I definitely recommend stopping by. Nicely dimmed lights \u0026 very cozy aesthetic. I loved my red sangria.. made with just enough of everything \u0026 not too much anything. I kept it simple and ordered the Pad Thai which was really tasty. The waitress was also attentive.. always appreciated. Also very easy on the pockets. Overall very satisfied with my experience!", "author": "Iesha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "I absolutely love this place.  I have been coming here since 2010.  Hands down some of the best food in Brooklyn.  Edgar is the best, he will take care of you and keep you entertained.  There is a new Bar Tender that works with Edgar, she is also awesome.\n\nI am very picky and particular about my food and this place has something for everyone.  You must try this place!\n\n#Chanceforlife", "author": "Sergio D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-02", "description": "I asked for brown rice, got white rice. Noodles were good, but my dumplings were burnt!", "author": "Motunrayo M."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}