{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "Been here a few times and have not been disappointed. The mojitos are great and the food is amazing.  The Chance chicken is sooo good, as well as the sea bass.  The dim sum is tasty, especially the steamed pork rolls. The sleek decor is elegant and modern.  This is one of my favorite  Brooklyn restaurants.", "author": "Carrie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "The boyfriend and I have walked by this place a thousand times and for some reason never been tempted to go inside, it looked so predictably pan-Asian and I guess I expected the food to be predictable also.\n\nAhh, how wrong I was. To start with, I love me some wonton soup, but I don't eat pork so I was thrilled, THRILLED I tell you, to find shrimp wonton soup on the menu, and it was delicious.\n\nWe also shared a bunch of dumplings of which I like the fish ones the best.\n\nThe portions were large, the prices were low, and we left satiated and proud of our newly found neighborhood joint.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-16", "description": "My roommate and his girlfriend end up here almost every weekend for their lunch special (soup, rice, salad, entree, salad) so eventually I had to see what all the fuss was about.\n\nSimply put: it's a good lunch deal, which you normally can't get on a weekend day at other restaurants in the area. It's not a ton of food, but it's enough and it's tasty. I'll be back.", "author": "Sean E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-31", "description": "great value\ngood food\nnice venue", "author": "robert W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "The dim sum brunch dumplings are pretty damn good, and you truly can't beat the lunch specials for 7 or 8 bucks, with soup, salad, spring roll, rice and entree.  And go ahead and snicker condescendingly, but I found the black cod to be right up there with some more famous and much spendier offerings over there on the granite isle.  \n\nService is brisk and businesslike, and my only beef is the music, which all too often has a KTU/gay bar in Cincinatti kinda vibe which clashes mightily with my usual Sunday hangover.  Does anyone really want to hear the latest Madonna album in its entirety, let alone at a lazy brunch?", "author": "Eric S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-17", "description": "I think this place is OK, its a good place for a few drinks and appetizers or small dishes. I would not get any major meals here.  Place is decorated very modern, it looks clean, nice place for dates as you can get to know each other over small shared dishes.", "author": "Caterina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "Love this place! Amazing happy hour and fantastic service!", "author": "Stef W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-20", "description": "I've noticed some real mixed feelings about this place but I have to say my experience was a very positive one. \n\nI had never been to this neighborhood before and was pretty blown away by all the lunch choices. I was in a mood for duck so this place caught me and my brother's eye.\n\n2 main complaints about this place seem to be:\n\n1: The decor. and\n2:The food itself.\n\nI have to say that this place wasn't cheesy or ugly or campy or anything like that. It's a pretty simple, clean layout with alot of black and white, I don't know what else to say about it. It definetely didn't strike me as anything to complain about.\n\nAnd the food...I must say...was really, really GOOD! I had the crispy duck in black pepper sauce and my brother had the walnut crusted sea bass pilaf. They were fantastic! The wonton soup and pork dumplings were equally great. Light and filling with delicate flavors.\n\nAnd to top it all off, these large, exotic lunch specials were only $8 each! I mean. c'mon, who could complain about this place?? On top of it all our waiter was super nice and attentive and you could tell that other people eating there were regulars and that everyone knew each other and was having a good time. It was a very nice environment.\n\nSo there. I may not know the back history of this neighborhood and it's decline. And I may not be a chinese/french fusion expert. But I know this place is darn good.", "author": "P S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-27", "description": "The Chance experience I was expecting despite the decidedly awful decor was well, kinda awful. With a good review from one of my foodie friends we went with good to high expectations. Maybe we hit it on a wrong night. Friday doesn't seem to be the night to get it wrong though.\nThe duck was overcooked and greasy, the filet mignon was good but not awesome, and the sea bass was just not on. I'd hate to say it epitomized the worst of smith street but it certainly is another average meal with maybe more hype than it could deliver.", "author": "carl g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-13", "description": "I've only come here for dinner or drinks but after reading all the reviews I can't wait to go and try their $7 weekend lunch. The food is good but we come here more for the drink specials on weekdays. They have $2 beers and $4 mojitos and wines. The bar is always lively but not too packed. Good place for a group.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "Great food! Great service and my favorite dish is the coconut curry shrimp. Their coconut cosmo is delicious.", "author": "Tasha O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-04", "description": "A friend of mine took me out to Chance for my birthday this year \u0026 now I'm hooked. I went back the next day with my boyfriend!  \nThe 1st night I had the $28 prix fixe.  I had the shrimp lettuce wrap for my appetizer, it was warm with crunchy veggies \u0026 a nice light sauce. My entree was the sesame crusted salmon with asparagus, so GOOD. For dessert I had the deep fried green tea ice cream.  I had the Chance mojito, it was strong but tasty.  I also tried some of my friend's food. The two flavor shrimp was very flavorful \u0026 while I'm not a big fan of chocolate or banana, the chocolate banana pyramid was pretty awesome.\n\nThe next day I went with my boyfriend \u0026 pigged out on appetizers, soup \u0026 salad. I had the pork pot stickers, you could tell they were freshly made. The spicy thai mussels were really good \u0026 I probably could of eaten the bowl of the sauce on its on as a soup.  I had the crab \u0026 corn soup, it was very rich \u0026 piping hot.  The green rivier is refreshing \u0026 I could probably eat the rainbow salad everyday of the week.  My boyfriend had the pan-fried oysters \u0026 the chilean sea bass. I was so into my own food that I forgot to taste his.  He said it was great.  I had the lychee mojito \u0026 it was STRONG but good. Kinda heavy on the lime pieces though.  \n\nIts a great date spot because its cozy \u0026 dimly lit", "author": "Pynk L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "Friendly staff, nice dim sum and bonus points for the creative fusions.", "author": "Tabby M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-11", "description": "The waitress poured soy souse all over my husband's back and pretended that nothing happened. When we confronted her and asked for a manager she told us that the manager is out of town. We left without trying the food - this took place on June 10'th 2011.", "author": "Olga S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-16", "description": "\"meh.  I've experienced better\" - the equivalent of the 2 stars sums it up.  (this is for the lunch special takeout)  It was ok.  And...it was ok.  \n\nFor $10, yeah you'll get full for your money.  But for my tasty $10, I'd go for a vietnamese sandwich and salad down the street at Hanco's.\n\nThe spring roll was heavily fried/overly heavy; the pilaf sauce was also over-heavy; the dipping sauce for the roll was forgettable - I chose not to use it.  The salad was quite nice, that is - fresh and varied greens.  The fish entree was cooked nicely.\n\nOverall, edible, filling, and forgettable.\n\nI've heard from a few friends its a decent place to do eat-in dim sum.", "author": "saffronnsomag L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-16", "description": "Chance kind of sticks out on Smith in terms of decor, but that's what made me stop there (something different, not that I thought the decor was particularly attractive).  Dim sum was delish. Cocktails are inventive and tasty. I like this place for when I am in the mood for a light/healthy asian style meal. Menu highlights: miso marinated filet mignon, crispy peking duck, chocolate souffle w/ strawberry compote.\n\nOkay so I just realized the 'highlights' are not so light/healthy but whatever...I dont go home feeling sick and guilty (like after eating lo-mein or something similarly greasy)", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-03", "description": "I've never been to the restaurant but have ordered from Chance many times. I like the dim sum dumplings, the steamed shrimp and steamed pork are good. Also the crispy pan fried noodles are good, the sauce comes separate from the noodles so that you get the right amount of crunch when you assemble it at home.\n\nOnly thing is that it takes a while for delivery, which they will warn you, 30-40 minutes most of the time.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-29", "description": "I order from Chance all the time, the mango chicken is delicious...my favorite place in the neighborhood for an exotic, filling meal", "author": "Mike W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-15", "description": "Just ordered delivery, chance chicken and XO fried rice...it was DISGUSTING! frozen chicken tenders would've been better! Eating cereal because fried chicken was SO GROSS!!", "author": "A. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-25", "description": "This restaurant has been consistently good, both in terms of food quality and service.  I've tried almost everything on the menu.  My favorites include the land box (which is a mix of dim sum appetizers) and the fried rice.  The fried rice is excellent!  I can't tell you how many places make crappy fried rice.  Don't you hate it when fried rice has no flavor?  How about fried rice with frozen mixed veggies mixed in?  I can't stand that!  Chance's version is so far the best I've had in New York.  Plus, when I ask for a dish to be made spicy, they listen to me.  If I have to drink at least 3 glasses of liquid to tame the heat, then I'm content.  Chance meets that standard.  In fact, they even bring me a little dish of spicy sauce on the side, just in case.  I dine in Brooklyn quite often and Chance is one of my favorite spots to visit.", "author": "Mimi R."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}