{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "The service was super slowww and the place was not even packed. Minus one star right there -- everything took forever, from ordering to getting the bill.\n\nThe grilled pork chops were not bad but it wouldn't hurt if they used less oil. The white rice that came with the chops was so-so, too dry in my opinion. \n\nThe mango shrimp salad was delicious and the grilled shrimp came out really well.", "author": "brb b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-13", "description": "My wife and I  were greeted and seated immediately.\nThe whole setup and seating arrangement and the furniture were nice.\n\nWe ordered:\n1 order SPRING ROLL- delicious\n1 order chicken teriyaki/brown rice-delicious\n1 order salmon/brown rice-delicious\n2 mango mojitos- mistress said it was good\nTOTAL $58.00 \n\nThe service was horrible, the waitress never came and checked on us the whole time we were there, matter of fact she didnt come to anybody seated next to us either.\n\nParking is readily available at the meters in front or in the vicinity.", "author": "Kwame J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-19", "description": "We were meeting friends for dinner, but the evening wasn't off to a good start: we waited for the bus only to discover my Metra card had expired, so we had to walk, and, when we reached our destination (albeit late), we found our original destination was packed and estimating at least a 90-minute wait.\n\nBy the time we arrived at Chance, we were cold and starving.  We ordered some red wine to warm us up (even though the martinis looked attractive!) and some appetizers to keep us from gnawing off our own arms.  We had the spicy Thai mussels, vegetable potstickers, steamed miso lobster dumplings, and seafood pancake.  Each was incredibly delicious, and, by the time we were done, I was already plotting coming back to have an entire meal of appetizers and dim sum.\n\nThe entrees were tasty as well.  I had seared salmon, the boyfriend had curry red snapper, and I can't remember what our dining companions had.  (I think his involved shrimp and hers pad thai.)\n\nAnother point in Chance's favor is the atmosphere: it's cozy without being cramped, stylish, and a little sexy.  Although I'm generally hesitant to use the term, it's a great \"date spot.\"", "author": "Kathleen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-09", "description": "Food is so so. The waitress is unprofessional. I was there for a lunch on a weekend. The place had three customers. One of them were already done. it took like 20 min to bring a piece of Sushi. There was a group which I assume was a customer who come there often or friends of a waitress. She was talking about her personal life so loudly. I felt like I happened to be in some stranger's home and was eating my at a corner.\n\nThey also had a TV on. Some really gross vampire show was on, like blood all over.", "author": "Athena G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "Very nice place, friendly staff, the food was excellent (I had the peking duck and my mum had the snow pea shrimp) and the prices were reasonable. Would definitely come back here again.", "author": "James D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-02", "description": "Totally Outraged!\n\nThe decor was nice the food was good for the price. However I was surprised that the server, when questioned, could not explain nor describe the menu items. 1 member of my party ordered sushi appetizer, what he recd as condiment ginger sticks for pickled ginger and jalapeño peppers for wasabi?  She was unfamiliar wtth the drinks menu and when it came time to order desserts, the server could not give a description as to what  a particular dessert is. I ordered the creme brûlée that was terrible! It was a vanilla flavored paste with caramalzed sugar on top.  They're in need of a pastry chef.  \n\nCONSUMER BEWARE...carefully look at the bill. I'm in battle with them now over their tipping policy. Chance factors the tip into the meal. I don't have a problem with this my problem Is when you pay with a cc. The receipt (ROC) shows the total to be charged to the card and a line requesting another tip. I signed the cc receipt and gave $40 cash tip, forgetting the tip is included in the total. The server recd $80 tip! When brought their attention they did not deny the cash but refused to return it. A claim was filed with my bank and to my surprise they will not issue a credit due to my signing the receipt agreeing to the total due. Chase bank stated I have to prove I paid the tip in cash! I intend to get that money back and rpt this to BBB and FTC how they are robbing the consumer with these dbl tipping practice.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-20", "description": "The Happy Hour brought me in and I must say, the drinks are insane. The Happy Hour only works at the bar, but it was well worth it! The food is OK and that is why I did not give four stars! I ordered a simple Pad Thai and on another visit I had chicken teriyaki with brown rice! Both were really good but not knock my socks off!\n\nOverall the happy hour works and the food is good! Definitely make this a place to go!", "author": "Mike M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-23", "description": "I have ordered here at least 5 times but the combination of wait time and poor customer service are simply too much to bear at this point.  If you are OK waiting up to an hour and a half for food this is a good choice.  If you actually want to eat your dinner the same night that you order it, this is a terrible choice.", "author": "Alex V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-24", "description": "UPDATE- 11/27\nOk. back to 3.0 and I wish I could give it more because the dumplings are soooo delish. More after I order again. Shame it's so hit and mis because I want to give it 4 *'s plus!!\n\n\nUpdate 7/1/10- Within the past month or two, the quality has gone way down on deliveries... Stale pork buns, undercooked gyoza... Sad.\n\nThe best dim sum in Brooklyn. I heart the steamed pork buns and delivery is always quick and fresh. It's also a fun place to dine-in.\n\nYUM!", "author": "lara d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "Came here for the weekend dim sum- it was delicious and quite possibly the best tasting ingredients I've had. Amazing service at the bar.", "author": "Stephen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "To me, Chance fills the void of my PF Chang's craving that I desperately miss from my college days!  \n\nSince the first time I came here 3 years ago, I loved it!  I have been back countless times, and it's always the same.  Although, I will admit I only order 2 or 3 things that I rotate that contributes to this same-ness (but I can't help it - they are just too good!)\n\nI always find an excuse to suggest Chance to people when deciding where to eat on Smith and because of the diverse menu, everybody is usually satisfied.  The prix fix 3 course is a steal.  While the place is quite small, I have never had to wait more than a few minutes for a table since I tend to go on the earlier side (7).  It is usually very crowded with a longer wait by the time I am leaving.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-08", "description": "I've been here twice.. I truly enjoy this spot, the decor is awesome. The waitresses and customer service are awesome. The food is delicious. The prices are not expensive at all very reasonable (Drinks \u0026 Food) If you're in downtown Brooklyn area. Drive over or better yet take the train and have a nice dinner. The setting inside is trendy and interesting I think you'd like it it's not big inside at all, so large groups I wouldn't recommend but it's perfect for a 2-4 person dinner or an intimate dinner(a couple).", "author": "Dre D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Chance is amazing! They go above and beyond to help customers out, and the food is delicious. I guarantee a great experience there.", "author": "Jazmin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "Awesome takeout.  Love their Dim Sum selections and the fact that they're open late.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "This is me and my husbands go to spot when we want to have some decent Thai food and awesome drinks. Chance has always been good to me. I wish they would get that rating up to a solid A. And it would be pretty cool if they could offer $1 oysters. That would be an awesome addition to a place that already offers a ton of awesomeness.", "author": "D C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "Tasty fresh food.  Awesome variety.  Large menu so you can eat anything depending on your diet.  Chance is nice for a double date, great place to hang out at the bar as well.  \nWent for dinner, and a few appetizers, tried all my friends entrees and had two nice desserts.  The pepper tuna app is great.  Try the cheese dumpling.  Rock shrimp tempura!  Chilean Sea Bass, fantastic!  Fillet mignon was good.  \nTry this place!", "author": "Jim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "The food here is very good (rock shrimp tempura - yum!).  \nBut the highlight for me is their \"happy hour\" deal.  They have $3 beers and $4 or $5 mixed drinks (all types of cosmos, martinis), mojitos.  Note, these prices are available at THE BAR ONLY, not at dining tables.  I would suggest getting a few drinks at the bar and then sitting down to enjoy a meal.  The drink special are until 11PM Sunday - Thursday (not weekends).  Definitely worth checking out!", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-10", "description": "Dim sum lunch specials are what drove me here and I am very happy I took the voyage.  $2.50 for three pieces was the extra special when I went and I was happy to test out five different dim sum options:\n\nPork pot sticker - great flavor, excellent texture, pan fried the absolute perfect amount\n\nSteamed chicken shumai - good flavor, fuller than the dumplings, largest of all the options\n\nSteamed pork dumpling, steamed shrimp dumpling, steamed sea bass and carrot dumpling - the best thing about these, the most traditional of the dim sum, was the texture.  That sticky but tasty outer coating was just the introduction to the main course inside.\n\nChance is nice inside, with windows that open onto Smith Street.  The service was friendly and attentive and the dim sum came out super quick.  I can only judge on one lunch special experience, but it was a great one.  Only mark against Chance was a sub-par coke, everything else was great.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-22", "description": "Just randomly stumbled upon this place last Sunday at about 2 pm.\nThey have awesome lunch specials, all for around $7, which include the main entree, rice, salad, soup and dumplings.  I had vegetable pad thai which was average and my friends both had tilapia which was amazing.\nThe staff was super friendly and helpful as well.  I will definately come back for lunch!", "author": "Holly D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-06", "description": "One word of warning: I have never been to this establishment in person, so please take this consider this a review on the delivery service only.   \n\nMy dear friends, some of who are on a \"freelancers budget,\" love this place because the Chance lunch box special includes a main entre, soup, salad, and a dumpling or spring roll, all for around $6 to $8. Great deal, right? \n\nIt would probably be an amazing culinary experience, however we made the huge mistake of ordering it for delivery.  The delivery man must have crashed his bicycle into a hurricane that sent him flying triple somersaults in the air, crashing into the Gowanus Canal, of which he had to get pulled out of the sludge in order to deliver our food. The food arrived so late that all of us had already resorted to eating marshmallow fluff on white bread by the time he had arrived. The lunch \"boxes\" were all mixed up, so it was a lunch of damp Pad Thai salad with crushed pork dumpling. \n\nI know I should not be so judgmental and just go to the restaurant to avoid the risk of tossed damp Pad Thai salad with crushed pork dumpling. However, I just cannot take that chance.", "author": "Anne K."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}