{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "I really love Chance, but I don't love their prices. Luckily, there are ways around that.\n\nFirst off, Chance offers some affordable lunch specials that provide you with more than enough food for as little as $7. It almost feels like you are ordering from a completely different restaurant. If it is not convenient for you to get lunch here, which it usually isn't for me, there are still smart ways to order. I suggest getting 3 different types of dim sum. They don't skimp on the fillings, so you won't need to order as much as you think. My favorites are the beef with pine nuts, lobster with spinach, and seafood and sweet corn dumplings. The standard pork dumplings are also good; I recommend getting them pan fried rather than steamed. I think you are better off mixing and matching your own rather than ordering one of the pre-assorted boxes. It feels like you get more that way. They also come with some really tasty spicy mustard, garlic chili, and soy-vinegar dipping sauces. Do not underestimate these sauces! They give these dumplings an edge (and they're free). \n\nThe green river roll and cucumber special are great sushi alternatives without the carbs, but they are a little pricier at $9 and $7, respectively. I would stay away from the xo omelet fried rice, though. It's not as good as the description makes it sound. In reality, it resembles something you would make when you are hungover, and the only things you have in the fridge are eggs, rice, and ketchup. \n\nSpeaking of hungover, I have heard their drinks are fantastic, but I haven't tried them. I would also love to sample some of their entrees like the miso chilean sea bass or the glazed black cod but at $20 a pop,  they're too rich for my blood.", "author": "Sandra G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "We happened upon this restaurant by...chance. The restaurant we had originally reserved didn't have any air conditioning so we hit the streets and looked for a nearby place with good Yelp reviews. Everyone loved their entree (Mango Chicken, Mango Shrimp, Korean Short Ribs, Brook Trout) and we liked the Miso Eggplant so much, we ordered a second one. The only negatives were they were out of sake and my dish, ordered with sauce on the side, came heavily sauced. But the wonderful waiter Deo had it replaced quickly and without fuss. The final plus? A surprisingly low bill.", "author": "HM E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-04", "description": "So how did I a guy who works in the city and lives in LI end up in brooklyn?\n\nWho knows?  My friends dragged me out here.  But this place is a little gem.  \n\nThe atmosphere is modern and cozy.  Cozy is a code word for small.  Either way I didn't mind.  Me and my friends sat at the bar and just ordered from there.\n\nWe sampled a huge variety of food.  This is easily explained because 3 of us ordered off a pre fix menu.  We ordered miso lobster dumpling, shrimp shumai, on top of the pre fixed apps of scallop, foie gras, and I forget the third.  The plates were small, but tasty.  Was it the best ever?  No but for the price it was great value.  I know this is a Asian fusion place, but I got the filet mignon as my main course.  This was the highlight of my meal.  Perfectly medium rare and pre sliced no less.  (less work for me!)\n\nOn top of all this they had $10 macallan 12 on the rocks!  Not skimpy portions either.  You would expect a trendy place in brooklyn to cost more.\n\nIt's just tough to give it 5 stars because I like to eat and the portions were not consistent with the prices.  Other than that I would recommend this place if you're ever in town.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "Stopped here on a whim.  Our family that lives on Smith had never been here.  What a find!  We all had the lunch box specials: brook trout, chicken and noodles. All were outstanding as was the service.  And for a great price.  We will come back here on our trip s from Flagstaff.", "author": "Rick D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-01", "description": "they forgot items we ordered, delivered a wrong entree, were rude on the phone and the chance chicken and crispy noodle dishes tasted like dirty socks and dog food.  They refused to reimburse what they didn't deliver (insisted on a credit which we refused bc the food was horrific and will never eat there again).", "author": "Matt K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "This place is great I really do miss Edgar the bartender I will be going back hopefully for some lychee mojito and now I heard there 's a peach sangria", "author": "Sheena B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "So I can only be a judge of their drinks because I didn't have a chance to eat here. I've had the mango mojito and it's super delicious and strong and that's just all you can ask for in a drink. The bartender is super awesome once you start talking to him. He gave us complimentary drinks during our visit here which is of course the best. The service and atmosphere is really chill and a great place to chilllax and enjoy yourself subtlety !!!!", "author": "Angelique C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-28", "description": "I was a little nervous when I arrived and saw that they had a \"B\" grade. My date assured me that it was safe and I'm happy that he did. \nThe place was packed  with a mix of couples and groups but we only had to wait 10 minutes for a table. The drinks and food were on point. \nI had the pineapple mojito, the ginger chicken, and the banana spring roll for dessert. Everything was delish!!!\nI will be back.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-05", "description": "I'm a big fan of their food. We order lunch for work often. Their fried rice is one of my favorites. Excellent happy hour bar food deals - duck medley in lettuce wrap, delicious salmon and shrimp. Great deal! But their cocktails are too sweet and weak. You can't go wrong with the $5 Malbec!", "author": "Veronica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-31", "description": "Walked by this place a million times but never actually got anything.  Finally one night I wanted something different so I got take out, and I was very pleasantly surprised.  I'm usually turned off by places that have generic asian dishs all over the menu, but what I got here was top notch.  The orange beef was nice and tangy, and the miso cod was really flavorable.  Hot and sour soup was great as well.\n\nI've ordered from this place 1/2 dozen times now over the past couple of weeks and have been really happy every time.  Some day I'll try them in person.", "author": "Nikolai S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "Didn't east there but the drinks were out of this world! The bartender, a blonde friendly mixologist  named Aline, is simply superb. Best bartender on Smith St. hands down.\n\nSunday Specials: $5 Martinis, $5 Mojitos, etc... prep for the hazards of Monday Morning at the office for about $20. Can't be beat!", "author": "L A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "THIS IS, BY FAR, THE BEST RESTAURANT/BAR ON SMITH ST! The interior is chic, the service is great, and the food is good. But my favorite thing about Chance is the drinks- it's really the reason I come here. Edgar, the bartender, mixes the best drinks. Seriously. Try one of them and I promise you won't be disappointed.\nWhether you come in during happy hour or not, the prices are always reasonable, especially considering the size of the drinks. THIS IS NOT THE TYPE OF PLACE THAT'LL CHARGE YOU $15 FOR A COCKTAIL AND THEN HAND YOU A TINY GLASS THAT'S HALF FULL AND WATERED DOWN. If you're looking for a place that'll give you your money's worth, trust me, Chance is the place for you.", "author": "Mia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "I went for valentines dinner and has a reservation. We called to say we'd be 15 minutes late and they said that wouldn't work so we needed to rush. We were put at a table by the door that was absolutely freezing so we kept our winter coats on. I felt so bad for the people next to us who ordered before us and didn't get their food until after we finished!!! The server was overwhelmed even though she only had 3 tables. She forgot our rice and the table next to us. I am giving this place 4 stars bc my salmon was cooked to PERFECTION !!!!", "author": "Liz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "Another intimate spot that I love! They also have happy hour after 4! Lychee martini yo die for.", "author": "Zena A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-21", "description": "Came here for lunch because the bf has this thing where he has to try places....after reading the reviews I was like ok...let's go...so we did....ordered veggie pad thai and he got some beef things, along with some dumplings...let's just say...I couldn't drive home fast enough because we both got so sick from the food....it wasn't even funny.  \n\nThe restaurant itself is very clean and the decor is lovely, the waiters (both get 2 thumbs up) were so sweet and attentive...shame the food (2 thumbs down) wasn't as good to us as they were...O well.", "author": "Judy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "The food here is really good.  Everything I have tried has been very good. The prices are reasonable and if you get there early you can get a lunch special.  The lunch specials  are good.  The drink prices are also reasonable.  The only thing I don't like about the place are the bar stools.  If you sit at the bar plan to be very uncomfortable.  The low back stools make it impossible to hang out there for a long period of time. I know they go well with the decor and they might look all hip, but they are not at all comfortable.  Bar stools aside, I really like this place.", "author": "Lisa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "Service was AMAZING.  Dio was our waiter.  Everyone in establishment was very nice.  The sea bass was very good, best sea bass in Brooklyn and for the price, it might be the best I've ever had.", "author": "Tommy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "The food is ok but the bartender is always on point and always conversing with customers. If your not hungry or thirsty just stop in for their fried green tea ice cream, you will not be disappointed!", "author": "Jonathan V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-20", "description": "Excellent food.\nGreat bartender (Edgar) makes amazing concoctions is very attentive and gives good recommendations..\nVery good service.\n\nTry the baby bok choy with garlic and the Chance Chicken.  Udon is great too.  Nothing has been bad so far.\n\nThe decor is nowheresville but who cares when absolutely everything else about this place is great.", "author": "Chilly P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "It was tough deciding between three and four stars but the friendly service, good prices and proximity to my job raised it a star. Usually I only go to Chinatown for my dimsum fix, but since I didn't have as much time for lunch, I decided to keep it local. \n\nMy coworker and I ordered 6 different items to share and all were decent to good. My favorites were the steamed pork dumplings (which were juicy little buns), steamed shrimp dumplings and steamed seafood with corn dumplings. All were nicely done and flavorful, plus creative with the corn since I have never had that in my dumplings before. My coworker liked the chicken shumai which I also thought was tasty as well as the deep fried bean curd seafood rolls. The only item that we weren't a huge fan of was the fried pork dumplings. They had a flavor to them that we just weren't too fond of. They were nicely executed though, so I will give them credit for that. \n\nService was very friendly and attentive though and the lunchtime prices for each of the dim sum items was only $2.50 for three pieces. I am still a fan of the traditional dim sum houses of Chinatown but Chance is definitely recommended as a good option in the Cobble Hill area if you are craving some dim sum with a nice restaurant vibe.", "author": "Cynthia M."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}