{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "I have been had a few things on their menu and always satisfied. Happy hour on weekdays is 4-11pm. The drinks are nice and strong. Weekends are also a good time for post brunch for drinks too. \n\nI find their prix fixe to be delightful aswell. There is a small TV if you're trying to watch a game. The service is awesome (in my opinion) the times I have been here and Fan will take good care of you.", "author": "Horace S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "think there chicken witht he orange peel sauce is really good. I dont really like asian food but kinda like this place.", "author": "Adam P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "My family and I were visiting from VA and my son in law suggested Chance. What a great choice! Our waiter, sorry I forgot his name, was super friendly from the beginning. My granddaughter was making conversation with him and he really was attentive. I enjoyed my mango mijito...both of them. The rest of my party also enjoyed their drinks as well...smiles all around. We all enjoyed our entrées and really didn't have room for dessert but was given an ice cream sampler which the green tea was delish! Definitely will make this our go to spot when we come back to NY. I would of given 5 stars but towards the end of the meal, the restaurant got busy and our server got busy and less attentive. Overall visit was  pleasant.", "author": "Eileen E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-23", "description": "This place is under rated. So I over rated. In actuality it is probably a 4. Great happy hour  and great potstickers with an abundance of varieties!!! The manager Katie is amazing and remembers everyone's name and preference!  We have been coming for years and never had a bad experience. The decor, lighting and music are pleasing. Can't say enough about this place!!!", "author": "Vanes S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-01", "description": "I had the rose chicken here which wasn't bad at all when it was hot. But as it got colder it started becoming gamey for some reason.\n\nMy friend ordered the noodles and couldn't eat it all because the end of it was soaked in oil.\n\nI don't know if I will be back...", "author": "Sera A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "I love Chance, I save it for when I have a craving for mangos shrimp and sangria!!! The service is on point!!! Staff are very attentive. Food is amazing!!", "author": "Melissa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-05", "description": "What an amazing place for first dates, romantic dinners or just a place to hang with friends. The food was fantastic! The tai mussels....omg. And being with an incredible man........priceless.", "author": "Abike M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "My boyfriend picked this place cause of the lunch special, I'm glad he did.  Based on these yelp I would of skipped this place.  However, I am so happy we lunched here.  Specials are great, very clean and pleasant! Food was delicious, I had the salmon and my bf had the duck, both very satisfied!  Go!", "author": "Nelly B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-01", "description": "Amazing place! Excellent drinks, great food! We went there twice. First time we had a great service: our waiter was very attentive, fast and on top of things, but second time around we had a different waiter, who seems to be lucking a lot of skills. We tried dim sum, lychee martini, sea bass, spring roll. Everything was fresh and delicious! I'm definitely coming back. I didn't give 5 stars just because WOOHOO and as good as it gets, according to my understanding of dining, more applies to the fancy upscale restaurants with $$$$. Otherwise I will give it a 5!", "author": "Iryna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "Chance serves better dim sum than most places in Chinatown. The orange chicken called \"Chance chicken\" is a party, the happy hour is a great deal, the staff is very friendly and efficient and the decor surpasses that of every other casual Chinese inspired restaurant in the city. A really great place with well composed dishes!", "author": "Lars H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "A hidden gem!  The place has delicious food , great atmosphere and awesome drinks. \n\nLove there duck lettuce wrap, chicken satay, baked seafood and the numerous range of dumplings.\n\nThey have 2 desserts that are a must (green tea crepe and warm chocolate cake)", "author": "Nelly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-11", "description": "Very delicious! Had the spring rolls and the pad Thai, both were very good! The pomegranate margarita was also yummy!", "author": "Blair C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "We come here several times a year...birthdays, NYE, saturday nights, etc.  I love that there's so many selections and a great drink menu.  I didnt know martinis went with asian cuisine so well before coming here.  And homemade ice cream!", "author": "Austin A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-03", "description": "Had a lovely date here, the food is pretty good and the drinks hit the spot. It's in a nice intimate setting, not too packed on a week night. The music in the background is decent, yet you can still herself to have a conversation. I would absolutely come back for dinner and drinks. And to try the other Dim Sum boxes along with their cocktails.", "author": "Cathia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "my wife and I went there last night, what a nice place we found, the food was the best, got try their drinks. will go again next time in Brooklyn.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-13", "description": "This Chinese place was a great way to spend a nice cool August night with my friend who is leaving soon for college.  I had the prixe fixe for $28 dollars.  The tuna tartare rolls and filet mignon were done perfectly.  However, the banana mousse dessert was still halfway frozen.  The chance mojitos were an excellent paring of pineapple, mint and ginger and had a nice kick.  \n \nAlso, Anne K should know better to complain about their delivery service.  If  she was in such a hurry to get dinner, she should have picked it up herself.  I recommend that she do some research about how hard those delivery people work  (they were recently on strike at Saigon Grill.) \n\nOftentimes they are paid under the table bc many are here illegally.\nPlease excuse my digression", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "Went to Chance last night with family. The food was soooooo good that I am planning on going back tonight for take out.", "author": "Kimmi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "Excellent food, very clean, nice ambience! The staff is very friendly and attentive. They have very good sangrias-and in big portions. However, if you're planning to come there on a weekend and with more than a party of 4-reserve fast and in advance!", "author": "Lina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-03", "description": "We came through for some drinks and dessert. Everyone was friendly, cocktails were fantastic, and chocolate molten cake was to die for!!!!", "author": "Chantelle E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-16", "description": "3.5 Stars\nCame here for dinner. I enjoyed the food overall, but there were some missteps along the way. Starting with the appetizers, we got spring rolls and crispy tofu with black bean asparagus sauce. The spring rolls were mediocre at best and have had much better elsewhere. The crispy tofu was very tasty and one of the highlights of our meal.\nWe both had the Curry entree--one chicken, one vegetable. The portion was large and very good, but compared to Song (a similar restaurant in Park Slope) it is overpriced with less flavor.\nAlso, the service was jumbled, and seemed unorganized.\nA good experience, but probably won't go back.", "author": "Dennis P."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}