{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "My favorite are Chance Rice Noodles and Pecking Duck however all the food is very tasty here and drinks are truly the best!!!!", "author": "Felix K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Hands down the best Asian fusion spot in the area. The pre fix is definitely a bang for your buck. I ordered the land box, chance chicken, and crepes. Couldn't have asked for anything more delicious than this meal.", "author": "Samer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-04", "description": "I had a craving for Chinese food tonight, and ended up at Chance.  I really dont feel comfortable or confident about ordering take out Chinese from one of the typical NY store fronts that look dingy and worn down, and wondering what the kitchen in the back might look like.  Instead of take out, we decided to actually dine in at Chance.\n\nI am not the best at distinguishing between Asian foods, in terms of the originating country.  I could be wrong but this place seemed to have a little bit of everything.  There were definitely dishes that were Thai, that were Chinese, and that were Japanese.  The menu and choices are quite large.\n\nThe food was delicious and I have no complaints.  Everything tasted fresh, and the meat was \"clean.\"  By that, I mean the chicken was of a good cut - (As opposed to when you order a chicken dish and end up with a few bites of mystery meat - often gross fat cuts, or something hard like a piece of cartilage).  I will return to Chance, and/or order take-out from them.  \n\nServers were busy but efficient, and friendly if you needed something.\n\nI also appreciated the decor of the restaurant.   Nice lighting, and some sort of metal art of cut out trees lining one wall.  Loved looking at that metal piece!  (Dont mind my vast lack of knowledge regarding art)", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "The chance chicken is amazing. Order the ocean box and the land box. Trust me you will not regret it! This is by far the best Asian fusion spot in the Brooklyn area.and you definitely have to try the green tea crepes. Definitely give this place a try if you want a good Asian fusion restaurant!", "author": "Jeff N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-15", "description": "Had dinner here late on New Year's Eve. The menu was pretty large, but because time was limited (again got there close to closing) my friend and I could try a lot.\n\nThat said, what we did have was good.  And the service was good enough to make me want to come back and check out the rest of the menu.", "author": "Pablo G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "The service, and food, are unparalleled; definitely enjoyed the congenial atmosphere - couple that with a great meal and drinks - always a great time. Nancy made sure our orders were prepared in an orderly manner and magnified our already great experience.", "author": "Michael O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Great place! The Mongolian lamb dumplings were delicious and their Chance Chicken was also great. The waitress was very kind and the food came quickly. I definitely recommend this place if you are looking for authentic Asian cuisine.", "author": "Jovan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Never not good. The brunch is cool: Ocean dumplings are bomb. So is the crab corn soup with lots of crab. Both $5. Ask for a lychee mimosa with shredded ginger.", "author": "Vanessa G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-06", "description": "If I can give them no stars I would chance Asian Bistro is the most racist place I've ever been so I took a chance with chance Asian Bistro it started off with me ordering 10 different types of dumplings on their menu on takeout they decided they wanted to give me for the same thing when I spend $50 it took them 2 hours to get to my house then the food was cold and they did not give me anything that I ordered ...i asked the manager to the dispute the problem they told me it would take 3 to 5 business days which happens to take two weeks and the money never return to my card I went the actual restaurant to get my money back the manager was so racist he did not want to give me cash you want to give me a check and then told me to get my dark skin ass out his bar do not ever go to chance Asian Bistro", "author": "Shanice G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "We had dinner and drinks sitting at the bar. I had the peach sangria and my boyfriend had the chance mojito, both were spectacular.\n\nFor dinner, I had the miso sea bass and he had the short rib these two dishes were also delicious, but what really made our night special was the service.\n\nThe bartender, Edgar, helped us pick our drinks and dinner selections, he was attentive, enjoyable to talk to, and didn't bat an eye when I asked to substitute my veggies for another option and requested additional rice.\n\nService goes a long way and we will certainly be back to see Edgar again! Thanks for making our night great. --- oh and the fries green tea dessert WINNER!!\n\nGrace \u0026 Trevor", "author": "Grace G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "I came here by myself, as soon as I walked in, I was greeted by a very friendly manager, he offered me a drink from the bar, it was a hit! I really enjoyed their veggie spring roll and orange chicken!", "author": "Kevin X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-03", "description": "Hate to give reviews like this but I was disappointed from this place; ordered a very basic chicken and broccoli dish- it was not good.  The drink I had was too sweet and the service was not great.", "author": "Annie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-05", "description": "This place just isn't worth the wait.   Previously Wait time for delivery was over an hour.   Today I called in an order in for pick up.  Called 20 minutes prior to arrival and then waited 15 minutes when I arrived.  And there was no one in the place except at the bar so it was not because they were busy.  Never again.  Too many other choices.", "author": "Jason F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-21", "description": "Take this with a grain of salt (and sake, and mirin, joking) from someone who rarely likes Asian fusion.\n\nSurprised this place has the reviews it has.\n\nBest dishes were the butternut squash soup with pinenuts as well as the beet salad (aka the most American things) while the miso cod, chance chicken, chicken teryaki, and eggplant were underflavored and overpriced.\n\nIn terms of my dish, the \"orange miso\" cod, the tempura pineapple at the bottom got soggy from the sauce. It's odd that the fish itself did not have that much of it (I guess the pineapples got the majority.) In terms of orange miso, they put a bit too little miso in there, resulting in a dish more resembling a light orange chicken.\n\nThe main issues with this place were not the food itself but rather the portions, the semi-attentive waiters (with one waiter questioning whether one of us had the price fix which would have included dessert,) the exceptionally long wait time, the serving time changes where appetizers came out ages before and especially so with dinners, and that there were three people at the bar who were talking so loud that it was annoying all of us.\n\n2.4, this place would have gotten a 3 if not for the service.\n\nThe house sake was good though.", "author": "Glenn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "The only thing better than the curry red snapper was their service! The bartenders and waitresses are super friendly and accommodating. Definitely a place to bring a friend/date.", "author": "James Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "I went with a couple of friends and had really good food like their dumplings and lunch boxes. They had attentive staff and good service. I would visit again when I am in the area :)", "author": "Katzy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "This place was a great find. I went here on a first date and just the atmosphere and the staff were incredible. I especially enjoyed the mango chicken and steamed shumai. Definitely coming back.", "author": "Chris Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "LOVE Chance! All the fish entrees are great. Also love the pot stickers.  I get a craving for their food. A great local secret.", "author": "Christine A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "I have been coming to Chance for years! My dance instructor brought us here about seven years ago, and I've been coming back ever since! I moved out of New York but it's definitely a place I visit each time I return! Chance chicken is the best, and if you're feeling adventurous try the chance pancake!", "author": "Kalin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "Food was good.  Had the shrimp shumai, which was really good.  The Lychee mojito which was better than it sounded, and it sounded like it would be a really good drink", "author": "Mark W."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}