{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "Nice service, better than average chinese food. Nice desserts like fried icecream and coconut banana sundae. Love their weekend lunch specials.", "author": "Arline B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-15", "description": "Food was just terrible ,oily and soggy! It took a very long time to arrive. Never gonna order!", "author": "LuLu K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "Absolutely delicious!! My family and I were looking for a place to eat on Christmas eve and came across this cozy, delicious restaurant. \n\nThe service, drinks , appetizers and entrees were absolutely great!! And the prices are great for the service received. Definitely will be coming again!!", "author": "Jeanine H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-15", "description": "This probably the worse Thai Restaurant I ever went to. Today, I took my friend out for lunch and I can say I wasn't please with this restaurant, food, and service. We order calamari and spring rolls, both tasted horrible. The calamari came without sauce and spring rolls was very greasy and tasteless. We seated and waited for a while for the food to come out to the table, the brought out my friend food first and I waited another 7 plus minutes for mines to come out. While we were sitting eating, we saw several flies flying around the restaurant which caused us to loose our appetite. I personally recommend that no one visit this Restaurant.", "author": "Carl C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-15", "description": "This is a nice quiet Asian fusion restaurant. I only stopped in for a happy hour. The raspberry margarita was tasty and the duck was good. This isn't a happy hour for a single person. If you come here bring a friend or date.\n\nSide-note: The sign outside says Patron margaritas but the happy hour special is well tequila.", "author": "Kia H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "They just started to deliver via seamless (at least, in my hood) and the delivery was fast, the wok ginger chicken was tender \u0026 delicious, and the roast pork buns were great but on the small side. Love having another delivery option for Chinese food!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "I enjoyed most the dishes my friends and I ordered. We ordered steamed shrimp dumpling,steamed sticky rice with chicken and shrimp, and steamed chicken shu mai dim sum. My favorite was the sticky rice with chicken and shrimp. I had the teriyaki chicken lunch box with jasmine rice, salad (I didn't like the salad dressing, most of us didn't ), shrimp spring roll and the wonton soup. Small portions but enough to fill us. I had the tiramisu, was delicious. A friend ordered the ice cream sampler that was good. Chocolate ice cream is the best.", "author": "Nika G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "My new favorite Thai fusion place in the hood. Amazing drinks. Omg the Chance Chicken is my favorite dish. Very cool decor. Love the darkness and black lights. Cool music. The owner is such a sweet woman. Was there last night and plan on going again tonight with some friends for dinner. First time Ever doing that. That's how much I love this place.", "author": "Anthony F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-18", "description": "Be ware...the \"unlock this offer for 15% off\" is expired...draw your own conclusions!!\n\nWait there's more...this just in...\n\nHad my credit card to be run about 20 minutes ago. Was told the computers are down...no problem. I have patience. Now the bartender has just exclaimed his feelings about \"how this place is still operational???\"...can you say \"Red Flag\"\n\nIs this for real???  Unfortunately...yes. \n\nWait, there's more. Just got my check and it has been handwritten like back in the day. I ask if I have cash would that be easier. He says yes, throws away the handwritten credit card slip and all is well. Would have paid cash as soon as it was brought to my attention that this would be the easiest way to pay...don't make me wait unnecessarily. Thank you.  \n\nCould just be a bad day...or...", "author": "Derrick Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "I have been there My self several times.   The waiters are so kind the food taste delicious too. Most importantly the price is affordable", "author": "Gelek S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "Good service especially at the bar .... The bartender was the best he had plenty of conversation and was really into the arts . \n\nAppetizers were very tasty overall a good experience .", "author": "Valerie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "This is my first time writing reviews on food. I was there a few times during my lunch break from work and surprisingly finding this place fits well to my appetite. It has a large selections for lunch menu, delicious oriental food with good mix of Mexican style. My favorites are those teriyaki lunch boxes, especially the brook trout! Don't forget the dumplings. Friendly service, not too crowded, a good place to relax and enjoy your food.", "author": "Sean X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Restaurant on Smith st food is delicious, service was great the pork dumplings were awesome. Take a chance on chance Asian bistro \u0026 bar..", "author": "Manny V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-03", "description": "either the food or their margarita had me sick for my entire weekend. i really tried but, this place was a no for me.", "author": "Kisa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Restaurant was excellent. Food was excellent. I recommend the the lobster firecracker and the charcoal grilled salmon.", "author": "Sabine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "I love Chance I've been dining here for many years. I even had my bridal shower here in 2016. They allowed my friends to decorate it was so awesome. The service, food and drinks are always good. I've recommended this place to so many people, even my best friend and her husband call Chance there fave. I was here 1/20/18 and it's just as good or even better. Looking for a great intimate place with great service this is the place !! See you soon Chance !!!", "author": "Sparkle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-06", "description": "I've been here a total of two times and both times I've been extremely pleased. The place isn't the biggest and a bit of a stroll from my job at Metro Tech. \n\nWait Staff: 5/5\nDrinks: 5/5\nFood: 5/5\nSpace: 4.5/5\nLocation: 4.5/5\nDecor: 5/5\n\nThe place takes cash and credit (except Discover), is open till late, and the bathroom is simple but elegant.\n\nOh yea, the waiter you want is the tall (Asian) guy....his name escapes me but he is EXTREMELY helpful and will make you night that much better.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "Had dinner on Saturday with my daughter \u0026 niece. The food was fabulous  \u0026 so was the service.", "author": "MICHELE P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "I would like to say, this is one of my best restaurant in neighborhood, Chance is inexpensive and the food is so GOOD... my friend and I had Deep-Fried Shrimp Winton, Steamed Shrimp Shumai and Chance Rice Noodle. Everything we had was so tasteful. The service is great the workers are polite. I well recommend this restaurant to anyone. The astomphere is just awesome!!!", "author": "Jay A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "I Love This Restaurant! Neighborhood Favorite. Order the pot stickers and the brook trout. And the salmon And the short ribs!!!!", "author": "Randi C."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}