{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-04", "description": "So I feel like I rarely don't like a place. Something has to seriously be wrong for me to not like a place. In terms of service this place is stellar. They were super attentive and personable.\n\nHowever, when it came to the food I was underwhelmed. I had the pad Thai with beef...my go to when I'm hungry. It was tasteless. I wish I could've liked it because the staff was super. But yeah...it's a no.", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "I've coming to Chance for a while now and the wait staff is always extremely friendly. The beautiful decor on the exterior and interior always seem to be kept in pristine condition! Furthermore, the food is exquisite, Chance is my go to restaurant on nights out. I highly recommend Chance!", "author": "Katie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "The food and drinks at Chance are excellent and are reasonably priced for the neighborhood. I was there last Saturday night and the live acoustic music was a nice touch. I really enjoyed the performance by Albert Huang. Will definitely come back and bring friends to this restaurant soon. Highly recommended.", "author": "Tessa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "Chance is a great place to dine. I've been there a couple of times and have always enjoyed the experience. The staff is nice and attentive.", "author": "Jenny G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "I have performed at Chance on about 4 times so far and have come to know the owner and staff very well. The service is always great here as are the food and the drinks. My friends that came to see me perform have all fallen in love with the place. \n\nThe dishes are creative and prepared with great care. I particularly like the pork soup dumplings and the red snapper with curry sauce.\n\nAs an added bonus, there is always a group of regulars sitting at the bar - they are super friendly and fun!", "author": "Al H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "Our Go-to.   Edgar's drinks are magical.\n\nthe Chance Pancakes are equally magical.  The curry sauce too, is magical.  I think you see where I'm going with this.\n\nGood atmosphere, drinks and food. Sometimes there's live music, and everyone (from staff to other patrons) is super friendly. \n\nFor my wife and I it's our feel good go-to place.", "author": "Jiimy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "A must if you love fun service and great, satisfying food. Virginia took great care of us and the menu offers an option for all dietary restrictions and tastes. Plus, they offer Pellegrino water (in glass because plastic might as well be LA tap water). Consider me a regular.", "author": "Andy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-14", "description": "Just ordered for delivery. Got a call from the restaurant that the Lobster and Spinach dumpling was not available. No problem, switched to spring rolls, even though it would cost more.\n\nDelivery was prompt and service was polite, but the portion sizes are a joke. \n\nFor $17, we received less than 6 shrimp in the two flavor shrimp entree. I am in shock. Our order total was over $40 with tax and tip and barely have enough for dinner. \n\nAnd the spring rolls we had to pay extra for? They came cold and nearly inedible. \n\nI can't speak to the in restaurant dining experience but for delivery this was a total bust. Definitely not a good deal...expensive bill was not matched by quality.\n\nI should mention we called the restaurant to share this review before posting. We asked about serving size and were basically told it is what it is...okay.", "author": "Megan D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-17", "description": "I used to love this place and have been ordering from there for over 10 years. My past 2 orders were so disappointing we didn't even keep the leftovers. They used to do the best steamed shrimp dumplings, and now I'm not even sure it's made out of shrimp (they taste more like ground fish to me). I'm officially done with this place.", "author": "Elle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "Chance was my first take on Asian fusion food close to 10 years ago. They also introduced me to quality food for under 10 bucks from their lunch menu. The food and portions are excellent on their lunch menu. I love their chance spare ribs and duck. Over the years the quality of their food went down a bit but not by much. They still serve a solid meal. Their soups are also spot on. I can here for dinner and for some reason I found their food during lunch to be better. Their desserts are amazing too!!", "author": "Subashis P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-24", "description": "It was a dreary, rainy Sunday and we were looking for a Chinese spot while hanging out in Cobble Hill. We wanted something quick but nicer than your typical take-out joint. \n\nWalking in I was surprised by how fancy it was. Definitely nicer than I was hoping for but cold + hungry = unhappy Sara \n\nSince it was that weird time between lunch and dinner (linner?) we weren't able to take advantage of their lunch specials but they did have some pretty sweet happy hour deals. \n\nTheir .50 cent wings were perfectly crispy and served with a sweet and sour sauce. We also split an order of the steamed pork dumplings from their dim sum menu. Unfortunately, the dough tasted a little undercooked and the soup didn't hold well in the dumpling. \n\nAlthough there were only two tables (including us) dining in, it took almost a half hour after our starters for our entrees to arrive. Like our appetizers, everything was piping hot. I was surprised by how delicious the sweet sesame beef was. It struck that perfect balance of crispy and tender. \n\nMy veggie fried rice was filling but nothing to write home about. It also had mushroom (which wasn't listed under the ingredients) which I had to pick out. Luckily I noticed them before my boyfriend (who is allergic) accidentally ate one. \n\nI'd definitely come back to Chance for drinks and  starters. If you're looking for a sit down Asian fusion spot this will definitely fit the bill.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Yummy, happy hour specials are awesome and the food is delicious. Only had a bunch of tapas but everything was good. Can't speak for the entrees.", "author": "Laurel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "Every time I'm in the city I always go to this place. It has good food and great service. Sadly I live a hour away from there. If I'm closer I will go there more often.", "author": "Anjie Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-01", "description": "I haven't been here in a very long time but the Spicy Chilean Sea Bass (my personal favorite) is still on th menu as well as the Fire Cracker Lobster.(spicy but delicious!) Can not guarantee the quality now. They have a daily lunch special 12-4pm. 3 tables and one person at the bar. There was a bartender and waitress handling everything. Service was slow and poor.  About ten minutes after ordering she asked if I wanted something to drink. When I mentioned getting the drink menu she pointed out the happy hour menu sitting on the bar. Yea! Thank you very much. (But I would have still liked to have gotten the drink menu.) 1 table(couple), 1 person at the bar, \u0026 2 requests for water= water finally.  This may have been an off day but poor service + mediocre food = no return. So sad.", "author": "Me 2."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "Attentive service. Good food. Nice ambiance. Definitely will return. The pork buns and the lamb dumplings are very good appetizers. The udon noodles are delicious. Everything was fresh and well seasoned.", "author": "Cosmon B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "The best place for friends family and colleagues for this wonderful  scenery and energy , incredible waitress/bartender and a Great chef", "author": "Synofia J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Everything from the food, to the drinks, to the atmosphere was soo good! I give this place 2 thumbs up! The bartender and the host/waitress were very social and kind, they made us feel like family.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "The atmosphere is amazing. A lowkey spot great for date night or hanging out with friends. The drinks are amazing and the staff is very friendly. This is my second time coming here and I will definitely be back again. Also try the mango leechee mojito, it's awesome!", "author": "Athena T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "So I had dinner with a friend there the other night, overall it was good service and the eggplant and Thai fried rice were on point. They served me a whiskey sour in a martini glass which I thought was a bit strange, but the drink was so strong that I couldnt really give a damn about the glass it came in.\n\nThe only downside was there was this godawful band playing in there while the place was packed. The music was atrocious and it made for a loud dining experience. I almost left because of the music, but I am glad I didnt. It is a good place with good food and strong drinks. I will be back.", "author": "Richard S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-28", "description": "I hardly ever write a review, due to the unprofessional service I couldn't help myself.  Well, my family and I decided to try this restaurant  for the first time last night; we were pleasantly surprised how great the and drinks were. However, we were extremely disappointed with our waittress/bartender.  Our server/bartender was awfully rude from the door. We noticed a dog in the restaurant decided to inquire and received such a rude response.  Only for her to check and inform us that it was possibly a service dog?; which was never confirmed by the owner.  Anyone who is dining at a restaurant and notices a \"DOG\" hiding under the table would have the same inquires, so I was confused on way she came off so rude.  This was just one of the incidents we experienced during our family dinner.", "author": "Rashidah B."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}