{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Amazing restaurant! Service has been great from walk in. Food cane quickly and fresh, lychee martini is a must!", "author": "Tallulah M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-03", "description": "Probably the worst food I've had in Brooklyn. The staff was nice and the atmosphere was okay. The menu had food stain. I rarely not eat my plate of food and even less send it back. Unfortunately I had to do this. Chicken was rubber feeling and cheap quality. The other 3 dishes we ordered all did not taste good. They need a new chef but keep the bartender and wait staff.", "author": "Keith S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "Bartenders are great! Food is decent. Ambiance is nice as well. Its just a really solid restaurant. I usually go there for drinks but the fried rice and other items are good too.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-10", "description": "I live around the corner from this place, ordered delivery tonight and it took ONE HOUR to arrive. Towards the end I kept calling to ask where my food was and they kept saying 'it went out' but would never tell me where the delivery guy was. This may be a decent place if you go in person but I would say never order delivery from them.", "author": "L R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "Very good food - inattentive service. We ate there mid Sunday afternoon and there were few other people in the restaurant. It was nice not to be rushed, but we had to ask to have our water glasses refilled, when our server stood there. The sea bass and duck were good enough for us to consider returning.", "author": "Alan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-18", "description": "Food is good but service is not great.  It felt\nAlmost depressing.  The one waiter wore his winter coat and was not attentive and the waitress had a bit of a flat affect. \nThe place is dark so between the wait staff and the lighting it was just not the best experience.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "I have not been this is place in quite a while and from the moment I walked in, I felt like i never left. I sat down to dinner with an old friend and we laughed and joked. The food is delicious as always. I have a few new favorites. I recommend you try the firecracker lobster and the spicy Chilean Sea Bass. I will be back more often. Such a beautiful night. Made my belated birthday dinner so worth it", "author": "Tamika J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "Unpretentious atmosphere and good vibes. Oh, and the food is pretty good too. I tried something new on their menu and fell in love with their Spicy Miso Chilean Sea Bass. Nice portion size and seasoned very well with great texture, the filet is accompanied with string beans. I wouldn't recommend their Chance spare ribs as it was mostly big bones with no meat--though seasoned well, it left you feeling cheated. \n\nYou must not leave Chance without trying their lychee nut ginger sangria. If you dare go for a second round, call a cab.", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "The two flavor shrimp is awesome.. Food is great.. I recommend this place to eat on any dat. Nice place to eat, resonible prices.", "author": "Summer H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Great place to relax and have the best Asian meal... Nice calm setting .. The drinks was on point .. Just all around great place", "author": "Eric D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Been Coming Here For About 4 Years Now..... Never Fails To Satisfy... Great Drinks, Great Food And Great Service!!! During My Recent Visit I Must Say The Waitress Was Great, Engaged Me And My Date And Kept Us Laughing Keep Up The Good Work Chance", "author": "Orbin L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-10", "description": "I have been visiting this restaurant for nearly as long as it has been open. The restaurant's staff have celebrated many birthdays with us. Gradually, the restaurant's quality has slid from excellent to unpleasant. The restaurant is chronically understaffed--frequently by new hires who have little knowledge how to make things go. The menu has changed for the worse. The restaurant often seems more motivated to sell liquor than food. However, many times, it doesnt seem motivated to sell anything. \n\nAs a family, we have decided we are done. It needs a new concept, a new menu, and a new kitchen staff. \n\nI wish them luck.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "This is my first time here at Chance and it's really neat! I went to Chance with my best friend and it's very small and intimate. We had mojitos which were awesome. The Very Berry Mojito was really potent but tasted amazing. I would definitely come back!", "author": "Denisse C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "After raving about the food at Chance, my friend and I came here for dinner last night. The waitress from last time, Katie, recognized me, which I thought was really nice. When we ordered drinks, I insisted that my friend try the sake mojito that I'd been going on and on about... but the waiter (Fan, like Katie, was also super friendly) told us it wasn't on the menu. Turns out the chef, Ahfan, had made it especially for me last time. And guess what? Like Katie, he also recognized me. Before I knew it, we were surprised with two sake mojitos at our table. I can't believe Ahfan went out of his way to do that; seriously, if that isn't amazing customer service, I don't know what is. It made my night.\n\nMy friend loved it as much as I did and told them it needs to be put on the menu because it will be a huge hit with customers. The food was just as great as last time.\n\nGreat food, amazing staff... I'll definitely be a frequent regular at Chance from now on.", "author": "Megan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "My husband and I come here all the time whenever we are in Brooklyn. I usually get the teriyaki salmon, which is pretty tasty. The Mister gets the beef Pad Thai, which he loves. Drinks are strong and great. The staff is courteous and pleasant. In fact,  we are here now for Fight Night (Mayweather v McGreggor).", "author": "Nadia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "Not much to complain about this place but also not to many things to awe about as well. Its in the same area as JOYA for those who know this place and it almost felt like they replicated JOYA a bit. Trying to achieve the same success. I believe they have done so. The place was busy throughout our whole time being there. \n\nThe main courses were so so and their were differentiations in portions which I found weird. I am used to places either having large portions, average or small. The sesame chicken had a weird taste to it and portion was small. The peking duck was pretty good. Other things in pictures were average. Its worth trying and going once in a while when suggested but not a place I will pitch people on the regular.\n\nThe service was below average and that is the primarily reason for the 3 star rating rather than the 4 star it actually deserves. The waitress planned out the ordering poorly which we had discussed with her while ordering. The entrees took extra long to come out. The drinks were pretty good but way over priced for a place like this. \n\nHalf of us were drinking tequila and the other half were drinking vodka at a point one of the rounds they screwed and pretty much forced all of us to mix which is not good at any times for those who know a thing or 2 about drinking alcoholic. After we were done I wanted another last shot and approached the bar to purchase the last round but made a joke to the bartender that this last wrong should be on the house due to the earlier screw up and he made a rather rude response and charged me $50 for 4 shots which I think was wrong and over priced. But it is what it is. That experience left a sour taste in my mouth.\n\nWorth trying for a variety but beware of the slow and rude service!", "author": "Alex M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "This is one of those \"three is not bad\" reviews, as a matter of fact I think I'd go with three and a half stars.  The atmosphere is nice, though at some point the music got to be a bit too \"club-y\" but not terribly distracting.  The place wasn't packed on a Friday night and the staff were more or less attentive and pleasant  The short rib special appetizer sounded amazing but unfortunately for us they ran out.  We went with the cucumber special - it's sort of a naruto roll with crab meat - wasn't terribly impressed, I think if the dish was served chilled it may leave a better impression but as was, it was sort of warm crab meat wrapped in a sort of warm cucumber.  The kimchee fried rice was definitely my favorite - loved it (though needed to add some soy sauce for a bit more flavor).  The sticky rice was ok as well - can't say it left a lasting impression.  I'm glad I finally tried this place and will probably try it again at some point - it's a nice, inexpensive option in the area.", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "I went to chance for dim sum and it was amazing. The ocean box and crab corn soup are soooo yummy. Seriously, I wanted to lick the bowl of my crab corn soup. The seafood kimchee pancake was also bomb. I will definitely be coming back for more!", "author": "Latoya C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-29", "description": "Nice little place on smith street\n\nI think the dumplings shouldve been cooked longer\n\nDrink was so tasty", "author": "Mislade C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "I took a client here because I always talk about Chance and I learned the owners changed. Well the staff were really nice and drinks and food were as amazing as always. I will be taking more clients here", "author": "Missy H."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}