{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-04", "description": "Went here for the first time last weekend and wow - delicious. The only reason I'm giving it four stars is my margarita wasn't great but the food was amazing and the waitress was super cool. Will be going back for sure.", "author": "samantha z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-29", "description": "Their lunch specials are a real bargin -- come for the delicious, fresh shrimp dumplings, which are only $2.50 for 3 pieces and a solid phad thai with spring roll, soup and salad for only $7.00.", "author": "Allison A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "Great spot for a lunch!\n\nTry a lunch special and get your choice of soup (hot/sour, wonton, miso), side salad, dumplings and your choice of entree for under $10.\n\nDinners are good too, most entrees are under $17.  They also make a mean mojito.\n\nSmall streetside patio during the summer. \n\nService is always friendly and reliable.  The music choice can sometimes be really cheesy.  (like, Mariah Carey-cheesey.) But, last time I was there, they had loungey music. Def. much better.", "author": "Saccha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-16", "description": "I have been going to Chance for several years now and I really enjoy this place.  The staff is always attentive and kind.  When I walk in the servers already know what I want.  That's important to me because it shows they actually care about their customers.  The deserts are good too.", "author": "Ms. P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-20", "description": "really?  this place is zagat and michelin rated?  really?\n\nmediocre \"fusion\" asian food for the PF chang types.  sorry if i'm offending you in any way, but their food offends me.  it bugs me when places call themselves \"fusion\" just so they can get away with serving butchered asian food.  i had the curry pan fried noodles lunch special, which came with two pork dumplings and wonton soup.  the only authentic part about the wonton soup was the overload of MSG/salt; the dumplings were okay, but there was something off about the sauce.  noodles were fine, not bad, but not great.\n\nthey do give a decent amount of food for a lunch special.  i probably wouldn't be hating on this place so much if they didn't receive all these accolades from zagat and whatever else was hanging on their walls; but i just didn't get the hype.", "author": "stefanie h."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-26", "description": "My husband and I had been meaning to try Chance since it opened years ago. The idea of French/Chinese \"fusion\" was intriguing, but for whatever reason we always skipped it. Most of our experiences with Chinese food as of late have been disastrous. Anyhow, last night we finally checked it out, and boy was that a mistake! It started off fine-- we were happy to see they had Six Point Sweet Action on tap. We got a seat outside after a brief wait and looked over the menu. The menu, like a lot of Asian places, was sprawling. I tried to figure out what exactly about it made it \"fusion\"...not much that I could see.\n\nWe ended up ordering the steamed pork buns from the dim sum menu and the summer rolls as our appetizer. \nThe pork buns were pretty good. The pork was flavorful and most, while the bun itself was warm and chewy. \n\nThe summer roll, advertised as shrimp and crab, was inedible. Why? Because there was imitation crab in it that tasted like it had been sitting in the back of a freezer for 3 years before it was defrosted and put onto our plate. I will never understand why restaurants insist on using imitation crab instead of the real thing. Restaurant owners-- if you can't afford to use quality ingredients in your food, then, DON'T BOTHER! It literally made my husband gag. Avoid it at all costs.\n\nFor entrees, my husband had the black pepper duck, and I had the chance chicken. My husband seemed to really like his meal. The duck was nicely spiced, but I thought it was dry and overly gamy, even for duck. He was happy with the side of crunchy bok choy it came with.\n\nThe chance chicken on the other hand was like a lame version of general tso's chicken. Somehow I missed the part on the menu where it said this dish was deep-fried to hell. It was literally a giant mound of deep-fried strips of chicken, enough for at least 3 people. While general tso's has that nice pungent and spicy kick to it (when done right), this had none of that and instead was a sickeningly sweet, gelatinous mass, so thoroughly deep-fried that there was hardly any actual discernible chicken meat left. I could barely eat any of it.\n\nAs for the service, our server never once asked us how our food was, even when I left almost all of mine on the plate (and didn't ask for a doggy bag), or if we wanted another drink. \n\nLike others here have said, it's incredibly disappointing that this place gets love from both Zagat and Michelin. In fact, it's insulting. Do yourself a favor and just go to the cheap takeout place down the street next time you have a craving for Chinese food.", "author": "Leslie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-20", "description": "This place is awesome! What a great deal! They have happy hour all evening Sunday-Thursday. $4 Martinis, Mojitos, Margaritas \u0026 Sangria, $3 Draft Beer. I had the Lychee Martini and it was really good. It's a cool spot with really good food. The dumplings are yummy and the pad thai is fantastic. Also, the best spring rolls we have ever had. Ed is the best bartender ever. We love this place!", "author": "Megan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "Wonderful place with great service and a wide selection of cuisines.", "author": "Aaron H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-02", "description": "Surprisingly the food was very good. I took my family to eat on a Thursday night. The place was crowded. An excellent sign. I would go back there again with my whole family.", "author": "M N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-23", "description": "Chance is one of my favorite spots. The homemade dim sum is always fresh and good. The atmosphere is very 'zen' and the service impeccable! Many items to choose from and the variety offered is more than plentiful. I particularly liked the 'chance mojito'. Very refreshing......\n\nChance is all about great food,service and price. I go to chance every time I am on Smith St. I would highly recommend this Asian fusion bistro to everyone. Their lunch and brunch menus are really spectacular!\n\nUpdate. Was there again on 01/08/10 - the place was packed to capacity. Lines for tables. Meet a lot of new people while waiting for our table. Very good things to say about this restaurant. It's way cool from the ones in Manhattan. Had great meal - try the pri fixe with appetizer,main and desserts for $18.00! It is really value for money during the economy downturn. I had the spicy mussels to start, the red snapper for entree and a chocolate souffle for dessert. I am in heaven. Great for group parties, GO!", "author": "Fork U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "So BF and I went on Saturday night.  Nice decor and attentive service.  For starters we had pork dumplings and spring rolls - both were very good.  Dumplings come only 3 to an order so that was a bit of a bummer b/c they're kind of small, but no big deal.  For entrees, I had the mango chicken and BF had orange crispy beef.  I have to say, i really liked both dishes BUT they were served in a noodle-bowl, inside a regular bowl.  Meaning, the bowl was made of noodles and cradled in a regular bowl.  The noodles were in the shape of a bowl, and were hard and crispy.  It sounds good in theory but not the best if you need to cut your meat as the entire noodle bowl starts sliding all over the place and it's not like you can really eat the noodles (i tried).  I was also hoping my mango chicken would be sweet and spicy, as advertised.  it was sweet (not overly so), but def not spicy.  Not even a hint of spice.  I even asked for chili sauce and practically had to douse my food in it to get some heat.  BF's beef was really good and had a bit of a kick to it.  I'd go back, but maybe next time i'll ask for my meal sans-noodle bowl!", "author": "Krista C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-07", "description": "Didn't eat here (but the food looked really good!) but went for drinks on a Wednesday night. Pretty sweet happy hour deal - $4 drinks until 11 p.m. Mon-Thurs! The bartender was really good at making \"exotic\" drinks. I had a coconut cosmopolitan and a mango mohito, and both were delishh. I'd definitely go back to try the food and for some more drinks!", "author": "A. A. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-27", "description": "I have gone to Chance on several occasions with my daughter and have enjoyed the food very much.  The atmosphere, the waiters and the bar tenders are quite nice.  The variety of the dishes is why I continue to go back and the prices are good.\n\nI recommend Chance highly.\n\nSheila White", "author": "Sheila W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-26", "description": "So this place is really cute, the drinks are strong and the food is good.  Its not a huge place but nice bar and trendy decor.  They also play a good mix during the nights I was there.  I always get the same thing because it is so damn good crispy jumbo shrimp but i always tasted what my boyfriend gets which is something different every time and everything is always delicious! Looking forward to going back during happy hr (mon-thur) 4-close!", "author": "L N C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "I don't like the trendy vibe, and the service rubs me the wrong way, but I think the food is excellent and reasonable. Great eggplant in garlic sauce, a unique fried duck fillet, and nice fish fillets. It's excellent American Chinese, with subtle fusion. My favorite Chinese in the neighborhood.", "author": "Jeremy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-02", "description": "I am a fan, yes I am.  Though my experience here is limited, but the mojito is awesome and the omelet fried rice is delicious.", "author": "Jonathan Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-08", "description": "My boyfriend and I stumbled upon Chance by accident last night on a late Saturday night . Needless to say we were very impressed by what we encountered. The second we entered the restaurant we were greeted by a friendly waiter :-) as a matter of fact the entire staff was friendly . I ordered what I will be my drink for the summer , a coco cosmo !! YUMMY !! My boyfriend ordered a lychee martini, and although it was a little too strong for me  it was tasty. We both ordered the Chance chicken, which is their version of orange flavored chicken. The sauce was a little thick but the flavor was great.  I highly recommend Chance !!!", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "I like Chance because there really aren't that many Chinese restaurants in Brooklyn (except in Chinatown - Brooklyn's and NYC's Chinatown) that offer the elusive dim sum. While one cannot live on dim sum alone (I know I could), Chance offers several other menu choices that are quite good, (despite what the other food snob reviewers say). I like the salmon, crispy to a 't' and the filet mignon is quite good. The duck should be prepared better, but the oyster rolls are to die for. Hey, go not for minimalist (sort of) decor but if you are in an adventurous frame of mind, take a chance on Chance.", "author": "Pas E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-27", "description": "I wasn't going to write a review, but I feel compelled to stick up for the place!  I rather liked the food, which seemed more solidly in the pan-Asian world than fusion Chinese-French.  I wasn't bowled away, but it was tasty and healthy and light, and really very reasonably priced.  And I liked the decor - minimalist but inventive.  I didn't like the stupid Trixie seated at the back of the restaurant who was lecturing the entire world about her Lean Cuisine choices and how she is white and prefers to date black men loudly enough to interrupt my conversation whilst I was seated in the middle of the restaurant.  Which isn't the fault of the restaurant but on a more crowded night, 3 or 4 loudies may make the place intolerable (fabric on the ceiling?  Please someone, start designing restaurants to absorb noise better!)  Banana egg-roll dessert was amazing!!!!", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-27", "description": "Chance Chicken is my shit. Eggplant and tofu also delivers the goods. Decent dumplings for \"dim sum\", especially the scallop and mushroom. Also, so good pork bun!", "author": "Thomas H."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}