{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "My friend and I had dinner at Chance last night. The food was delicious and the service was AMAZING!", "author": "Argelia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "Meh, I was wanting thai grid rice but they don't offer a vegetarian option so I went with the regular fried rice and left a special instruction to make it spicy as customer had recommended on a previous review. They didn't make it spicy and it was bland and the portion was smaller than most thai/chinese restaurants in the area. They included a side on chili paste and horseradish. I used all of the chili paste in the fried rice and it still wasn't spicy. I also got two orders of vegetable pot stickers (pan fried) as another customer had recommended. I could tell they used fresh ingredients but the text wasn't crispy like I saw in one of the photos. This place isn't bad but it is definitely lacking in flavor for the most part. I'm disappointed I spent $20 dollars and still feel hungry. The delivery guy was on time and friendly.", "author": "Chris D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "Food is amazing.  Service sub par. Our server offered us cocktails but when we ordered them (we were the only guests in the place) he told us there was no bartender available so they couldn't serve drinks.  None of the 3 people working could make the drinks i guess.  We ordered duck spring rolls,  they were out of them.  Ordered meals,  server didn't order my friends and when we asked he said \"oh you want them together? \" yes,  of course we do.  2 people,  two meals.  Good food though, just needs fine tuning in service", "author": "Teddie K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-15", "description": "We ordered crispy noodle, Chance chicken and snow peas. First, it took AN HOUR to arrive which is unacceptable. The food was very bad. Chance chicken which is their version of orange chicken was soggy, not crispy at all, chicken was really dry and tough. Crispy noodle was just not tasty and snow peas was totally oily and soggy. My wife and I ate about 1/3 of food bc we were so hungry, but the food made us angry and we threw out the rest. We made instantly noodles to satisfy our hunger. Will never order again. Do not take a Chance on this terrible overpriced, bad tasting place.", "author": "Ji l."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-25", "description": "Impressively Bad!!!\n\nWhere do I start?  The cocktails are cloyingly sweet.  The food is processed frozen hell.  All the dim sum sampled were the exact same things found in the freezer section of any asian food market.  The Black Pepper Duck entree was a crime against humanity:  A frozen duck breast not so much flattened as beaten into submission, crusted in a thick heavy coating of McNugget breading.  It was cooked so dry it could be used as a chemical desiccant.  It was then served on a plate with a glob of XO sauce straight from the bottle, and a boiled to death pair of baby bok choy and shitake caps that were so laden with grit as to be almost inedible.  \n\nAnd for this medley of horror, we waited almost 2 hours.\n\nWhen the bill came, there was a second round of drinks on the tab that had never made it to the table.  These were promptly removed when we complained, and the head waiter brought a complementary dessert.  A lovely gesture that should have been saved for his mortal enemies.  The plate had a lump of green tea ice cream so iced over from freezer burn it actually crumbled under the spoon, and a wedge of something described as a pistachio 7 layer cake which was soggy filaments of phyllo dough mashed together with a non-descript and utterly bland green gel.  We were also offered, as every table was, a small chocolate looking truffle for each person at the table which I think fell out the back end of an animal - bitter, chalky and utterly gross.\n\nThe service was slow, disorganized and ridiculously chaotic.\n\nThe only bright point, the head waiter, was affable and eager to please, though the entropic failure of everything around him was simply too much.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-30", "description": "The meal was very good. The price is even better! Some of the best fried ice-cream. The staff was attentive and courteous. I would definitely go back there.", "author": "Michele J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "I would eat here everyday if I could! Finally stopped in for dinner and loved everything about our experience. Our server Dio was such a sweetie and took the best care of us! The food was reasonably priced, fresh and delicious. Generous portions, too!\n\nI'll definitely be back for some more of that goodness.", "author": "Alessandra Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "This is my go-to asian bistro. My favorite menu items vary, but I like the dumplings and sushi--but the pineapple fried rice is also very good. They have a different take on the hot + sour soup, but I like it.\n\nI usually go in the late evenings and the staff is always friendly. \n\nOh, and get a dessert. All of them are good, esp. the chocolate souffle. \n\nPrices are super reasonable too.", "author": "Tanya M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "Still here after all these years, and even with \"Cobble Hill's\"  Smith St. getting more and more gentrified.  A phenomenal value, prices haven't changed much, even for Brooklyn.  Consider the 4-11pm happy \"hour\" Sunday through Thursday.\n\nNot a lot of room in here, so be prepared to rub shoulders with the locals, especially at the bar.  Not loud, not trendy, clean, solid, knowledgeable personable bartending, and good value quasi Asian tapas style and small entrees.  Prix Fixe available but doesn't represent much of a discount; not that it needs to.\n\nWorth a try for after work or a light meal.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "Drove by this place several times and put it on my \"need to try\" list. Walked in with my BFF one night for some food obviously, we were seated by a young lady. Our waiter was Dio-best service ever! We had the summer roll, chicken lettuce wrap, pan fried noodles with chickens and veggies plus a side of garlic broccoli. Everything is amazing!!!!! We both like spicy and Dio brought us his own personal bot sauce which really hit the spot! The main dish was huge and more than filling. After dinner Dio brought us ice cream! We were stuffed but had to indulge in this! Can't go wrong with this place. Love it!", "author": "Ayshia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Amazing drinks. Sake berry martini is amazing! Duck nachos are awesome for an appetizer and also salmon sesame that has a bite. Also tried pork, shrimp and chicken dim sumacs was delicious!!! I ordered a lot of small things to get a taste and was not disappointed.", "author": "Ella Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-05", "description": "My Buddy and I saw the place and it looked nice so we decided to check out the menu and it looked good, with a nice array of different foods... The waiter we got was really nice and I guess took really good care of us since the restaurant was empty... \n\nI have a very strong stomach and I can eat anything -including bugs (lol) and I hate to say this- the BBQ duck made me sick! I was throwing up all night... it was awful!!! I felt awful!! I know it wasn't anything else because I didn't really eat all day \n\nwas it really duck? Luckily I took a picture of it because I thought it tasted so good---You be the judge! \n\nI'm sure this place is great but I didn't get a chance to experience that since it left a bad taste in my mouth! (Gross! I know!) \n\nNot Good eats!", "author": "Maritza S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Great Lunch Menu Options, Quick service.\nCurry Red Snapper is great, dont know any other place around for quality food for cheap", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "Recommended to us by the front desk of our hotel so we walked the six blocks to get to it. Glad we did because it was a great little find.\nStarted off with a ginger Margarita......which was fantastic! I highly recommend one or two...:) they had a wonderful variety of cocktails so it was hard to choose just one.\nNext up was the summer rolls....they come out presliced into 5 pieces and were very tasty. My entree was the Chance Fried Noodles (basically Singapore Street Noodles) and I would fly back to Brooklyn for a huge bowl of this alone......LOVE street noodles and these were some of the best I've had...big old bowl of curry vermicelli noodles with big succulent shrimp, chicken and loaded with veggies, carrot, red peppers,onion,green onion and egg........I think I licked the bowl. It was fantastic.\nTopped it off with the ice cream sampler platter with scoop each of homemade green tea ice cream, chocolate and vanilla lemongrass........interesting favors and all were excellent. The ice cream was soft, creamy and just wonderful. Try mixing the green tea with the lemongrass....they were great together.\nI don't know what restaurant some of the other reviewers went to but I'm glad I ignored some of the overly negative reviews because it was fantastic in our opinion and we didn't experience anything that would come close to the excessively negative commentary listed here.", "author": "Debra C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-10", "description": "This place was recommended by a family friend, who said everything was good. Boy were they wrong. We started the meal with some appetizers. Though we ordered the veggie potstickers, they were out so we got the pork potstickers and spring rolls instead. Spring rolls were average (sort of tasteless), though the apricot sauce (basically fancy Asian-fusion duck sauce) was above average.  The pork potstickers were out of this world good, which is what the 2 stars in this review are for. I'd give them 5 stars on their own. I ordered the steamed sea bass with black bean sauce for my entree. It came with the sauce on the side, which I found odd (though the sauce was good). The fish was totally bare, laying on the spinach which was swimming in oil. Both were totally tasteless. I cannot understand why the dish wasn't cooked in the sauce. I left feeling not only unsatisfied but a little nauseated from all the oil. Don't bother with this place unless you're only ordering apps. Seems to fall into the all too common trap of good apps, but bland entrees. Another weird thing was that the music kept changing and all of it was weird and off-tone for an Asian fusion place.", "author": "Erica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "I love this place.  If you're looking for a really great happy hour during the week with awesome drinks and really good food, amazing service then go here.  It's great to bring a date or go in by yourself.  The crowd is laid back, talkative and really cool.  The music is usually the kind you want to bob your head to so it's a fun experience.  \n\nThe best is the servers, sooo nice and they really care about your time there.  The bartenders know what they are doing and are really nice as well.  \n\nThe food is always fresh and a great price.  \n\nI strongly recommend this place year round.  They do have outside seating during the summer months.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "Doesn't the taste of fresh seafood scream SUMMER? Or no? Anyway, my mouth watered as I read the items featured in the Ocean box. I ended up ordering take-out.The food came in a huge bag, but the food itself was...very small? The ocean box contains 4 different types of seafood dim sum, two of each. They are actually, very delectable.The sauces are pretty spicy, so if you are looking for that extra kick, go for it. The only knock for me was the price; it came up to around $14 and was more of an appetizer than meal. If the Ocean Box was half it's price, it would have been even better.", "author": "Ani T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "From the lychee martinis, to the mai tais, mussels \u0026 even the bok choy...this place has some of the most delicious dishes around. The waiters \u0026 waitresses are alway super accomodating, polite and fun. They never disappoint. The location is cozy enough for an intimate dinner for 2 yet, big enough for a larger party to come together for a good meal. My friends and I eat here together regularly.", "author": "Sherry R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "I would give this place a 5 but in all fairness, I didn't eat here so I can't give it a 5.  My friend had an engagement brunch elsewhere (it was a large party) and some of us came to Chance afterwards at the engaged couples suggestion.  The ambience was great, and the bartender Edgar is the greatest!!  I can honestly say that out of all the bars I have been to (and I can't count how many) he is the best bartender I have ever encountered.  I highly recommend this place.", "author": "Melitza R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "The place has a very nice ambience to it. I think it's a great place to bring a date. It's small and quaint, with low lighting. I went here on I guess what you could call a date, and we ordered appetizers. The shrimp fried rice was really good, and there was plenty for the 2 of us. We also had some sort of goat cheese dumpling that was pretty good as well. The drinks were tasty too. My friend had the Patron and I had the Mango Margarita. Both had a good amount of alcohol and good flavor. I would recommend.", "author": "Kristin D."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}