{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "My friend and I fell upon this place on Friday night of Memorial Day weekend and wound up returning on Sunday night because the food was so good, affordable, and there are so many choices! The service was outstanding; Ann was our server and she went above and beyond and made excellent suggestions and we asked for her on Sunday. Ann's level of customer service is rare in the city; she's the very best. The dim sum and pan fried noodles are a must, as is the lychee tart. Chance will not disappoint you!", "author": "Carolyn J. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-19", "description": "Great lunch special! Tons of delicious food comes out steaming hot and beautifully fresh.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-14", "description": "I absolutely LOVE Chance! I\"ve been going there for almost 3 years now and they never disappoint. No matter what I order, it is always delicious and I always walk away satisfied. They have such a unique menu (deep fried crab claws, a great dim sum menu and delicious desserts) Their service is top notch, very attentive and professional and their drinks are amazing (kiwi mojitos!!) I am definitely a fan", "author": "Janice P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-27", "description": "Some of the absolute worst \"Asian\" food I've ever eaten. I will never go back. The Pad Thai tasted so strangely tasteless, the tofu in the dish tasted chemical, even my draft beer tasted weird. Also, is it me or does this place smell of cat pee? Sorry to be so mean but this place was a total waste of time and $$$. Like another reviewer, I am annoyed this place is Michelin and Zagat rated. So much better food to be had on Smith Street.", "author": "Lara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-11", "description": "Very decent dim sum at very decent prices. The drinks here are pretty good too.", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-30", "description": "Chance is like PF Chang's with an urban twist: tasty and salty with something on the menu for anyone.  The dim sum was decent with my favorites being the pork pot stickers and the roast pork buns (clearly imported from Chinatown).  The entrees were average but again, ease up on the salt guys!  The best things I tasted were the mussels (soaked in a red Thai curry broth) and the chicken hot \u0026 sour soup which was completely inauthentic but tasted really good.  The food here is 2.5 stars but the service and price can't be beat.  I'll be back for sure...", "author": "Mike W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-12", "description": "I stumbled upon this place on a Saturday night with my girlfriend and the place is packed and we will told that we will be seated in about 10 minutes, we waited at least 35 minutes to be seated. and as soon as we sat down, the waitress came over and asked us if we were ready to order. so i told her we just sat down. so about 5 minutes later, she came over again and tries to take our order! (later i found out her name is ANN, and shes supposedly the manager of this place) I know this type of small restaurant get pack easily on weekends, but i am paying to dine out so i want to actually enjoy my meal, not being f*** rushed to eat and get out of the restaurant, then i might as well just order take out and eat at home. The food was also mediocre, i had the chance chicken which is like a fancier version of the orange chicken, i feel like my local Chinese take out place can make it better, and my girlfriend had the seared salmon, which is alright, i can pay 18 dollars for better salmon somewhere else. Service is horrible and that so called manager ANN should definitely not being running this place, because i will not be coming back because of her!", "author": "greg w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-31", "description": "Fusion's the word here. The Chinese and Thai-inspired cuisine isn't always something that a native of Shanghai or Bangkok would recognize, but that's just fine, because it's yummy. There are some good vegetarian options on the menu along with the more traditional noodle dishes and a hodge podge of creative main dishes -- the Chilean sea bass is a standout, and I love the sesame beef. Best value of all are the unbeatable lunch boxes, which Chancel will deliver in 20 to 30 minutes. (Evening delivery can take up to 40 minutes, so be patient.) For $8 or so, you get a smaller helping of a main dish, rice, dumplings, soup, salad, in a segmented tray. It's great for anyone who works at home -- I'd recommend the shrimp with peanuts (very spicy), which for some reason doesn't make it onto their dinner menu. And the dim sum are fabulous. If you can't make it to Chinatown for a dim sum brunch, this is a very good alternative. No, you don't  get chicken feet, but you do have excellent standards, from BBQ pork buns to shumai and perfectly done steamed shrimp dumplings. It can be crowded and noisy and the service a bit abrupt, but it's always accurate, fast and friendly in my experience. Great mixed drinks, especially the mojito. Definitely worth taking a chance!", "author": "Suzanne M."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}