{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-11", "description": "Our office ordered three lunch specials from here and were frankly disappointed. The sesame chicken and the orange chicken were hard to eat. They also had ZERO meat; it just tasted like friend chicken skin.\nOnline, it says the prices are $7.50 for the lunch special, but we ended up paying $10-$11 for an extremely unsatisfying meal. The dumplings that came with it were cold and gross. When I called the restaurant to discuss the issues with our order, they took no responsibility. The only thing I can say is that the presentation looked good. Extremely disappointed. At least it's an inside joke at our office now.", "author": "Megan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Definitely one of the best Asian bistros Iv been to. Very kind and helpful staff. The lady let me taste the beer before I ordered and jay recommended the brook trout and my god was it delicious. Must try if your in the area. Will be returning here very soon.", "author": "Sanjeevi D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-01", "description": "Considering the fact that this is an $11 lunch, it was quite enjoyable. The least interesting option was the salad....Some romaine with a paucity of dressing.  The dumplings were pork and chive and they were quite good.  The salmon was crispy on top, \"well, and served with string beans in a spicy miso sauce. I would return, although I heard some customers talk about the fact that the place had just been sold and was better before.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-03", "description": "So sad...I'm assuming they changed owners. The menu is different and not much of a selection in the lunch special menu anymore. It used to be 5 stars until they changed the menu and rules. They also automatically charge a 20% gratuity! I don't understand restaurants that have the audacity to charge more than \"18% gratuity\" automatically, especially if you don't deserve it. And they didn't! I only had a party of 5 people! The nerve! And she charged my card twice! Because she accidentally charged the bill first without the gratuity...smh...Food was okay, not like 3 years ago when it was actually delicious.", "author": "Mel P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-01", "description": "Why is it so hard to find good Chinese delivery in Brooklyn?!  I took a chance on this place based on their good reviews here on Yelp, but the food just wasn't good.  We tried a bunch of stuff:  Chance Pancake, Wok Sauteed Green Beans, Wok Ginger Chicken, Chance Chicken, and the Chicken Fried Rice.  The Pancake, Beans and the Chance Chicken were the only dishes that we ate and they were just OK.  The others were just not good at all.  They lacked flavor big time and the chicken in the Ginger Chicken tasted slime-y. Based on other's reviews I'm hoping that we just had a bad experience, but we won't be ordering from here anymore.  Back to Thai!", "author": "Jen D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Nancy seems to be th only person that works there. The service is pretty good. Very small and intimate. You definitely should try the pan fry jumbo shrimps it's very good and the lychee martini is also good.  The white peach sangria  is a must. They also had a live three piece band apparently on Fridays from 7pm to 10pm. It's also nice and family friendly.", "author": "Brommel R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-05", "description": "I used to frequent Chance a lot - really loved it. Haven't been in about a year, and decided to stop in tonight. The place is DIFFERENT, to say the least. I had terrible service , horrible lack luster food, and the tiniest shrimp I've ever seen. I ordered shrimp pineapple fried rice and my girlfriend had the Chance chicken without orange sauce. My fried rice had nearly no existent shrimp - so much so - I couldn't tell whether I was chewing a shrimp or a green pea that was also in the dish. My girlfriend had the Chance chicken - which came out lukewarm 16.5 minutes AFTER my rice came out. The chicken was chicken-less. Literally thought I was eating pork rinds. It was like fried chicken skin. The waitress forgot her rice and the. Brought out the wrong rice. Finally, to top it all of, my girlfriend's stomach has been hurting since the meal - of which she ate one spoonful of rice and maybe 2 crispy \"chicken\". Bring the Chance I love back.", "author": "Kevin E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "I absolutely love this place the drinks food and service are amazing I come here all the time and I'm never disappointed I'm going to do my birthday dinner here I highly recommended Chance.", "author": "Takima G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "The food and drinks are amazing. Great spot to hear good music and catch up with friends at.", "author": "C W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-24", "description": "Very mixed.   We really liked the appetizers.   The tuna/ avocado roll was delicious,  as was the baked eggplant.  The main dishes were all disappointing.   The kalbi beef had very little meat and hardly any seasoning.   Usually kalbi is delicious,  but not this.   The mango chicken was the worst.  Sickly sweet and swimming in jelly sauce.   The shrimpwith snow peas was bland but edible.   The peking duck was the best of the main dishes,  but not great.   The desserts were average.   Too many other great places to visit on the street.  No reason to come back.", "author": "Orna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Went with a large group. Sat us immediately and were very accommodating. Super friendly. Drinks were great and the food came super fast. Great happy hour prices as well! Very attentive and patient with our large party. Server was super kind. Decor was beautiful and the setting was very calm and relaxing. Lights behind the bar were very intriguing!", "author": "Annateresa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "Came here years ago with my girlfriend and loved this place. Decided to come back with my now fiancee and love it even more. Love the updated atmosphere, menu and there was even a band playing when we came in. Can't wait to come back again.", "author": "Jasmine O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Nice atmosphere and attentive staff.  Bass was amazing.  I definitely recommend for date night or anything else.", "author": "Royce W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "This is one of the most consistently great places to eat and have a drink and just relax. I love this place and recommend it to anyone.", "author": "Carl F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-28", "description": "I've gone by here a few times, but finally had a chance to stop in.\n\nIt's great asian-fusion option on Smith street.\n\nI had grilled eggplant with miso sauce.  Soo good.  And for a main grilled bok choi with garlic, brown rice.  My date also ordered butternut squash soup.  Although it was good, I thought it was a bit too sweet for my tongue.\n\nService was quick, and friendly.\n\nI also really liked the art on the walls.  They were sort of psychedelic inspired art, each with a black light illuminating them.  So it gives the place this otherworldly gothic asian bistro vibe.  :)", "author": "Sean S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "This is the most disgusting delivery experience I have ever had. The bag looked like there was a staple there once with remains of receipt, but it was open. A little off, maybe it fell or something, no biggie. When I went to unpack my food though I was in for a surprise. I dug in with my fork and took a bite then realized there were brown spots on the fork. Weird, my food was dry, there was no sauce. I look at the spoon and this is what I see. Hair, and more brown spots. Like it was dropped in a puddle. Completely turned off and lost all appetite for food. Never again. Stay away.", "author": "George L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "One of the best Thai places in Brooklyn. Great food, drinks and service. Happy hour specials and live music. Highly recommended for a night out with friends or a date.", "author": "Kia H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-15", "description": "This restaurant has been in my neighborhood forever and while I've never eaten in, we've ordered a few times. It had been a while and they seem to have such a huge variety so we went for it on Seamless. I ordered spring rolls for $7 and all I received was 2 very greasy spring rolls sliced in half.  Literally no taste but oil to them.  Spring rolls elsewhere? $2-3 for 4 individual rolls.  I get it's intended to be more elevated but it was not in the slightest.\n\nI also ordered Pad Thai with Shrimp for $11 and asked for chicken in addition as I would accept an uncharge-- which they did, another $3 before tax.  Fine. That would have been ok of course had they put either protein in there.  I had 3 shrimp and absolutely no chicken-- but a boatload of tofu and it literally tasted nothing like traditional American pad thai (I've been to Southeast Asia numerous times so I never compare cuisines). They didn't even provide any lime, it tasted bitter. I paid $14 for quite possibly the worst pad thai I have ever had as well as the most expensive.\n\nNever again. I'm rarely so disappointed and I have no problem paying for decent food -- but I was beyond disappointed.  I'm here to support the neighborhood, but please don't take advantage of your customers.  So much better in the neighborhood. SO MUCH BETTER.", "author": "aimee m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "Chance is definitely one of my favorite restaurants, their food is always on point \u0026 affordable!!!", "author": "Kendall L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Another wonderfully delicious meal!! I absolutely love eating here. Shrimp Pad Thai was delish as usual. Brought my best friend here for his Birthday and he loved his Sweet Crispy Sesame beef and his mojitos! Friend ice cream is super yummy!! Ask for Jay he has the best suggestions!", "author": "Dee F."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}