{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "Randomly walked by this place on a Friday night with my wife.  Place was packed so we thought we try it out.  It's a nice setting for an asian bistro in this part of BK.  We had a female waitress who was very friendly and knew the menu very well.  We told her it was our first time and asked for suggestions.  She said the mussels and sauce were on of her favs and we tried it out.  And boy was that an amazing dish! It's a must have if you like mussels and a spicy ginger thai type sauce! My wife had the mushroom salad which she enjoyed and I also tried the chicken and beef satay which I say is grilled well and very flavorful, definitely would order these dishes again.\n\nAs for the main dish, we had the vegetable udon and one of the salmon dishes, both were very delicious and fresh.\n\nAgain the service from our waitress was great and I felt as if she treated us like family.  It was very comforting.  My only complaint about this place is the small TV the bar area has, not ideal to catch a drink and watch a game.  Otherwise If that were to be upgraded to a flat screen, I go there for a drink more often just for the wonderful service I received.  Either way, I would definitely go back to Chance and try more dishes.", "author": "Adam K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-13", "description": "Went there for the lunch special, which was a really good value, for most entrees being under 10 bucks you get soup AND salad, a choice of spring roll or two fried pork dumplings, a choice of brown or jasmine rice, and of course, your choice of entree, which was a generous portion.\nUnfortunately, I chose the Orange Beef.\nThe flavors were all there, but the beef itself was both mushy and waaaay too chewy for me.\nI ended up eating the rice with the sauce and veggies and leaving the meat alone.\nLuckily, my friend ordered the Crispy Chicken (and shared it with me), which was very good.\nThe pork buns were well flavored, and steamed and the bok choi dumplings I tried were good as well.\nThe place itself was very dark and dimmed, which might be very atmospheric and romantic at night, but at lunch time there should be a bit more light and given the group of flying gnats we encountered in the back of the restaurant (and restroom), I can see why management keeps it that way.\nOverall, the food and service was good, and if some dimness (and little flying gnats) don't bother you, then you're in for a pretty good value.", "author": "Arlene A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-27", "description": "In some games of chance, such as Roulette, you can try and hit on some long-odds with a big reward, or play much safer and simply bet on red/black, with 50/50 results.\nMy adventuresome date \u0026 I were going to try sushi place nearby, with expected results, but she thought this place sounded more unique.  So we detoured.\n\nFirst of all, it's got a modern vibe and the staff are friendly.  The pan-Asian dinner menu is quite ambitious.  In general, this sometimes works and but other times it results in a lack of focus.  How would things go?\n\nFirstly, we were served an amuse bouche of their Thai mussels, which were bursting with flavor and had some nice heat.  I'd be happy to have an entire meal of these.\n\nThe next app was a crispy chicken pancake, which was somewhat lacking in chicken, but served with an incredible dipping curry.  The latter was so delish that my future potential ex wife frantically searched for a spoon to scape the the remainders.  I gave her permission to lick the bowl... and she did.  Nice! \n\nThen our entrees arrived.  I had pan fried noodles with veggies and shrimp.  She had a yellow curry \u0026 veggies.  Both were big and chock full of ingredients.  In my case, however, the spiciness level discussed was never attained, and the overall combination of ingredients was muddled.  The individual ingredients were fine, and clearly Asian, but it had no home country.\n\nSo overall, a mixed bag.  Sometimes, if randomly picking, the ball lands a tasty result and other times it was a push.  No losses here, but I think the key is finding your fave items and sticking to those.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "The food was exceptionally fresh and very well prepared without a lot of sauce so it felt lighter and healthier.  I love that they offer brown rice.  The wait staff was great and the bartender poured well!", "author": "Diane H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "So love this place been here twice the staff is great, food is excellent and service!! Cant wait to go back the Lobster claws are calling my name !! Never been on weekend, afterwork isn't overly busy in which i enjoy!", "author": "T R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "Trying someplace new with my honey. This place was really cute and date nightish/ but also a good place to go with your girls. The food came quick and it was good so we will definetly be back!", "author": "Tabitha T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "My friends and I were on our way to Faan when lo and behold it was closed and padlocked. We didn't have a clue where to go. Walking down the block we read the menu at chance and a couple said \" go u won't be disappointed\".  They were right!!!\n\nWe started with shumai, veggie spring rolls and fried dumplings.  And rock shrimp tempura. Omg. It was delish. It came on a bed of radicchio and the salad/dressing with it was to die for. I could eat this everyday. \nFor the main We had steamed chilean sea bass and lemongrass steak. Sea bass was better, it came on a bed of spinach with a black bean sauce  Yum!!\nThe serving sizes were perfect. And prices accordingly. We were 5, all had 1 drink, each had an appi and main. We had 3 deserts. Including Tax and tip it came to $40 each. \nWe will def go back. The staff was on point.  The waiter gave us a gratis dessert, b/c he knew we were celebrating our x-mas dinner.  The only bad thing was we sat in the front and the windows were drafty. \nSo glad we took a chance in chance.", "author": "Michele O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "Gotta say the bartender T makes really good drink just the right amount of alcohol thumbs up to T food was always good one of my favorite spots to have a drink never disappointed", "author": "Jerome B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-01", "description": "This place was okay.  It was everything I expected.  Trendy, hip and sleek inside.  Surprisingly smaller than what it appeared to be from outside but yet there was no wait - but the place was packed on a Wed night.  Everyone at our table ordered something different.  I started with the seafood tom yum soup - which was FAR from tom yum, more like miso soup with a few shrimps and scallops tossed in there.  Don't get me wrong it was great but not tom yum.  Others ordered the mussels and were impressed with the sauce that they came in.  \n\nOnto dinner.  I got the curry chicken which was okay.  Expecting spicier and less coconut milk.  But delicious nonetheless.  Others got the crispy orange chicken or the jumbo shrimps.  All were great but definitely super american-friendly.  Almost comparable to PF Changs.  Good eats but no where near authentic or stepping outside of the box. \n\nHad their lychee martini and whoa was it strong.  No complaints here.  Their Chance mojitos got rave reviews from others at the table as well.  So the drinks were by far the best part of the meal.  Everyone left fat dumb and happy :)  Not sure if it's anything to go nuts about but for the price, location and cleaniness of it I would definitely go back.", "author": "Christine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-01", "description": "Chance is fantastic. That's really all there is to say. I've been here for dinner but most of my experiences have been for lunch, so it's normally under $10 per person per meal. I love the mango shrimp the most with the crispy chicken coming in at a close second. For lunch, you get soup (miso, wonton or egg drop), an appetizer (pork dumplings or spring rolls), white rice and salad along with your meal. Their cocktails are very good and they really go out of their way to garnish your drinks. My sangria came with 3 different slices of fruit and it was delicious. The crème brûlée is very good as well.\n\nThe staff is very attentive, seeming to automatically know the second you need something. The owner is almost always there and he is very proactive, coming to every table to make sure that you're satisfied. The decor is simple but very trendy and the atmosphere is nice and quiet during lunch.", "author": "Alissa O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-09", "description": "Great menu. Loving dinning in or ordering out. Food is very tasty \u0026 staff is always pleasant", "author": "C N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Cozy spot with semi high prices.  Went to dinner with a friend, the food was good and so we're the libations.  Got great drink pricing due to Happy Hour which made drinking even more fun!  Come in the evening to find parking otherwise you'll be circling forever!  Be nice and maybe your server will bless you with a special treat like an alcohol infused gummy bear (YUMMY!!!)", "author": "Tamika B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-23", "description": "OK I came here because I was craving wontons with chili oil from White Bear in flushing and I was too lazy to go to china town. So I ordered the steamed pork dumplings off the dim sum menu. They were pretty good and it did the trick since I added chili oil(don't even). So after my crack craving was fulfilled I had others samplings of crack. Fire cracker lobster app, good but they overcooked the lobster(surprise), the tuna poke over a lotus chip was good with a little spicy kick. Also had the corn crab chowder but I did not try it(I did not eat all of this alone). Then on to the pre-fix dinner of fried calamari and and avocado salad which was very good. The main was dish was red snapper over string beans with a brown sauce. The sauce over powered the dish. The dessert was fried green tea ice cream which was ok. I would go back to try other things. It is decent asian fusion.", "author": "Jack Straw S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Two flavored jumbo shrimp !! Is a must , the $8 lunch special is not that bad for the potions you get !!!!", "author": "Kimoralee K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-27", "description": "I like this place... I love the setting of it, the attention they gave us \u0026 the drinks that pack a punch!!\nI celebrated my GF birthday here, a party of eleven people, it was fantastic. \nThe staff was super friendly and attentive what more can you ask for.\nDon't forget it's Asian cuisine so if your not sure what to order ask the waiter for the most popular dish... Works every time for a satisfying plate..lol\nI have been here a few times and order something different every time, it always works out for me and it should for you.\nEnjoy!", "author": "L. V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "I have been to this place twice now and I know I will be back again.  They have a big menu, reasonable prices, and a good assortment of cocktails.  Definitely order the pan fried dim sum; all the different kinds were delicious (favorite was the beef and pine nut).  Wide selection of entrees definitely has something for everyone.  They only lose a star due to slower (but not unfriendly) service.  Looked to be only one waitress for the whole place but it is a smaller place so it makes sense.  Reservations recommended for a Friday or Saturday, ask for the table in the corner by the windows.", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-27", "description": "We were drawn to this place by the seemingly updated takes on typical asian food that were on the menu... and unfortunately while they've changed the names from General Tso's or Combo #4, they haven't changed much else. \n\n\nI had the prix fixe dinner. The salad and desert were plentiful and borderline excellent, but the only thing remarkable about the flounder main course was how undesirably salty it was. \n\nMy girlfriend had the Orange Crispy Beef - cooked in a great sauce... but surprisingly... very soggy. (A word that also fits how I felt the next day after semi-begrudgingly eating the leftovers for lunch.)\n\nAnd the pork buns sucked. The frozen ones from Trader Joe's are made with more love... kind of a dealbreaker at a (sort of fancy) asian restaurant.\n\n\n\nHonestly, the food was probably about 3 out of 5, but I hated paying twice as much as chinese takeout yet leaving with the same gut feeling as if I had gone the cheaper route.", "author": "Nick F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-07", "description": "I'm not giving this place a single star rating only because I know that there is worse faux-chinese food out there and in this neighborhood but this was pretty bad. My fiancee and I were craving dim sum and made the mistake of going to Chance (even with our low expectations of what we could find on Smith street that would satisfy the craving). \n\nThe staff was extremely friendly though service was terribly slow. The restaurant seemed clean and well kept but the food was bad. No authenticity. No originality, nothing. The dumplings we ordered were OK but tasted like the frozen, overly salted kind you buy at the grocery store. The entrees were over sauced and dry. \n\nThere is really nothing about this place that makes it worth going back. It is extremely cheap but if you're thing is Chinese in a little white takeout box then have it delivered and stay home. Don't bother coming here.", "author": "Lizz H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-26", "description": "We decided to go out for an Asian Christmas dinner at Chance. The food was average, drinks below average, service above average, and ambience not good. On the positive side, the tofu and eggplant was a nice dish. The Korean-style short ribs were decent, while the Chance Rice Noodle (with shrimp and chicken) was not good. Cocktails were generally too sweet; in our case the bartender was overly aggressive with the lycee additions to the house versions of two classic drinks: sangria and mojito. The music was a strong negative, with rather loud house/trance music playing in what seemed like a place where diners came to relax and chat. Similarly, the seating for many tables was awkward, with weirdly shaped pillows and tight corners and walls. We will not go back, but would not fault someone who did.", "author": "Renard S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-11", "description": "My wife and I ordered delivery from Chance frequently for 2+ years, and we thought the food was decent enough to keep doing so.  We had recently heard from an acquaintance who lived near there never to order from them because they were unsanitary, but decided to ignore that advice.  Wish we hadn't, because we ordered delivery from Chance the other night and my wife found a GIGANTIC COCKROACH IN THE CHICKEN CURRY.  This was after she already eaten about half of it.\n\nWhen we called Chance about this, they offered to refund only the price of the cockroach curry, even though we had lost our appetite for the rest of our meal, and when we asked them for a full refund for our uneaten dinner, they had the gall to suggest that we were trying to get a free meal. They subsequently offered a $10 discount on our next order, but needless to say we will never order from them again.", "author": "Trey H."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}