{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "Chance Asian Bistro has great cocktails and sangria and all the food we ordered was yummy too! \n\nI really enjoyed my visit on a Saturday evening -- they had live Music! We saw Albert Huang play an acoustic set and it added to the enjoyment of our meal even more! He is a super talented musician and he takes song requests in advance which can lend to a romantic evening if you are going with a date! They also have a fun bartender so I think it would be fun to hang out with a group at the bar for drinks.", "author": "Emily T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-03", "description": "I dined at this restaurant about half a year ago and was not blown away by the food, but I decided to give it another shot and take advantage of Chance's free delivery on a cold, rainy night. My pictures are all from the first in-person visit, and although the review is a summary of my opinion of my two visits, I did not bother posting pictures of the delivery (food just doesn't look as sexy in plastic delivery containers, and even sadder in mismatched personal dinnerware). \n\nThe spicy salmon crunch roll was my favorite part of the meal, and at $6 it is a decent deal. The salmon was fresh, and although it is a very simple roll, I found it to be satisfying. The cucumber special roll ($8) was a bit bland. Beef pad thai was underwhelming and flavorless - no sauce or peanuts at all, and noodles were stuck into one big clump, although the $11 price tag seemed very reasonable prior to me actually tasting the dish. The seafood eggplant came with barely any seafood at all aside from a few tough little pieces of shrimp, definitely needed more salt, and $11 was way too expensive for a side dish. Duck spring rolls were small and did not taste like anything special.\n\nI do not foresee myself ordering from Chance again, there are simply much better Asian restaurants in the area.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-21", "description": "If delivery service will be provided then the menu should reflect what is available or should note when/ if an item may not be readily available at all times. Finding out that the main reason for your order is not available when you're hungry and waiting for food isn't a good way to get repeat business. Then somehow blaming the customer for not being by the phone to find out that the restaurant is unable to complete the order is just wrong. Unfortunate experience. Won't be repeated.\n\nThe food, which I was obligated to receive even though I didn't want it anymore, was also sub-par. Not to mention I ordered several dumplings and no sauce whatsoever was provided.\n\nI received a message response from someone who obviously works at the resto including the following comment reiterating that it is not the restaurant's fault that they don't keep ingredients for their menu items stocked and apparently customer satisfaction is MY problem, not the restaurant's.\n\n\"do not take it granted (that the resto will have food on the menu) it was your own problem and blame the restaurant was the only way for a person like you to get justified\".\n\nInteresting perspective Nancy M. If this is how the business views its customers I'm sure it will continue for a long time.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "Every time we are in the neighborhood, this place is a must. Yummy appetizers, such as green river and Jumbo shrimp Shumakh. Peking duck for main course.", "author": "Valerie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "This is my place to go when I'm heading for a pecking duck- the best in Brooklyn\nMake sure you also try green river, lobster fire crackers and miso eggplant. You could also get a seat, usually without a reservation and the people are super friendly. This place is very underrated - definitely give it a try if you are around. Also, there is always an easy street parking on Smith street.", "author": "Irene T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-23", "description": "Great place for drink and food, took my wife there last night, had a few drinks and dinner, the dumplings were awesome, lamb chops were one of best I've ever tasted. Will visit it again next time in Brooklyn. Thanks Jimmy the manager for pick a good soju for us!", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-12", "description": "Can i give it a No No No CHance!!!! There has been a long history of great memories of this place until the reataurant was sold to someone who has no clue about how to run the business nor customer service.  We came for mothers day dinner around 5:30 pm.  Food did not start coming out until 7:45pm.  Noone else was in the restaurant it was just 2 other tables with parties of 2.  The owner was nasty.  We asked to bring food for the kids as they were starving no remorse whatsoever.  They are busy with uber eats.  Are u serious?!?  I have never heard of anything more prothetic than her response.  Never will i ever step into this place.  Its horrible.  Food is below average.  Their yellowtail was nasty and smelly.  Please do urself a favor and do not go there!!!!", "author": "Deana G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "I had this place bookmarked for awhile and had the perfect opportunity to check it out when a friend was visiting from out of town. We came in on a Saturday night around 10pm. The bar area was pretty crowded but there were plenty of table open for dining. \n\nBased on the pictures on Yelp, I already knew what I wanted to order. I wanted the ginger margarita and shrimp prepared two different ways as my entree. Our server was very attentive and speedy since there weren't many others dining. The margarita I had was delicious but there definitely could have been a bit more of a taste of ginger. The shrimp I had was excellent!!! The Grand Marnier sauce was incredibly delicious and the sweet and sour shrimp was tasty as well. \n\nI really enjoyed the music that was played(mix of hip hop, reggae, and reggaeton) hear it created a fun, hip and welcoming vibe. The only downfall was they were out of wine glasses and they served my friend wine in a champagne glass which is obviously a different pour. Once my friend brought the to the servers attention they brought a second glass of wine in another champagne glass. \n\nOverall, I really enjoyed my experience here and will definitely return. I'd also recommend to others who are looking for an Asian Fusion restaurant in the Smith Street area.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-06", "description": "This is definitely a preliminary review. I ordered delivery and that can always lower the quality of stuff. However, overall this was not good. I went for their dim sum and ordered the potstickers, vegetable dumplings and steamed shrimp dumplings. The vegetable dumplings had zero flavor at all. Very nothingy. The shrimp dumplings were also poor. They had shrimp flavor? But I couldn't discern any actual shrimp. The pork potstickers were pretty decent! And they included proper spicy mustard which really worked with the potstickers. I love dumplings which is why this is such a low review but hopefully if I were to go in and actually have a meal it'd be different.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-25", "description": "I discovered Chance recently and I liked it. I met a friend for a drink on a Friday and decided to stay for dinner. I opted to dine at the bar so that I could watch a basketball game from one of the two monitors that they have. The bartender Edgar was terrific, and he walked me through the menu. My two apps and entree were terrific, and wines by the glass were very good also. Chance features live music on Friday\"s and Saturday\"s, and the trio performing that evening were very good. Will repeat.", "author": "Randall M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-21", "description": "I LOVE THIS asian bistro! The food is great, so is the staff, especially Edgar the artist! I Also love his art work that is usually displaced on the walls as well as a nice brooklyn mural outside. The red sangria is my fav drink! Ive been going there for years. Don't hesitate just go! Theres food for everyone. Try the snowpeas leaves if you love green leafy veggies", "author": "Classical B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "I can only give this place a 5 star rating! I've been goin to Chance since 2008. I moved to the area shortly after and it's been my \"mc Donald\" ever since. The lunch special is such a good deal for the food you get and let talk about the drinks! The happy hour drinks are like 5 or 6 dollars and it's all night. The menu has changed over the years but still so good. \nChance chicken: my favorite.... a sweet chicken lightly breaded and fried.\nGinger chicken: this is also good and not fried... has a good mix of veggies as well \nOrange beef: a good move but has a lot of breading on the beef. Also a sweet dish. \nThen banana dessert is also a must try! \nLet's get to the drinks \nThe white sangria has a different taste and it's a good drink if you don't want something strong. \nThe lychee drink is always a good move and kinda strong\nThe strongest drink I feel like is the margarita's \nEat and sip on and hope you agree", "author": "Sheneuqe A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "Great quality for your buck in a very laid back vibe. Our server, Virginia, was so accommodating and nice! Would definitely come back- wish I lived in the neighborhood! They also have Pellegrino which is a wonderful touch. Take a chance on Chance", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "So I've been to Chance twice in less than a week. Came here with a couple of friends on a Thursday night for drinks. Happy Hour is only available at the bar and since there was a child with us we sat a table. So regular priced drinks. The drinks were yummy so I was really okay with that. I only had an app, spring rolls. They were fine. We had a few rounds then you were offered mystery shots on the house. Yes, thank you. Enjoyed the time here. You don't feel rushed at all. \n\nI was back here on Monday, Columbus Day, with my bf; the restaurant was empty. I like to imagine that we are rich and famous and rented out the entire restaurant to ourselves so we wouldn't be disturbed by fans. So yeah, we ordered cocktails that we both enjoyed. Ordered wings and the special Mongolian lamb dumplings for appetizers. Both were really good. Then the entrees of the Chance chicken and sweet sesame beef. Everything was good. My chicken was really good. Sweet with a hint of spice. \n\nThe portions are good. I ate until I was full and was able to eat the leftovers today for lunch. We were having such a good time decided to spring for dessert. Why not, it's 80 degrees in October let's celebrate! We ordered the coconut banana a la mode. It's pretty much a bed of toasted coconut pastry with caramelized bananas on top with a scoop of ice cream.  Enjoyed my dinner and will return again soon.", "author": "Ayesha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-14", "description": "Calm \u0026 quiet atmosphere.  Love this place for the lychee mojitos, as for food, their Chance chicken is amazingly delicious I always get their fried shrimp wontons, \u0026steamed dumplings to compliment my meal.", "author": "Jae T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-02", "description": "I love chance .  I come here all the time with my boyfriend. They have a great happy hour drinks and food menu. My only complaint is delivery . They forget to add sauces or utensils sometimes. Fried wontons are nothing without sweet chili sauce.", "author": "Keda G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-21", "description": "Chance is probably my favorite Brooklyn little restaurant. The food was really good, the staff was very good and caring and the cherry on top the live music performance was definitely worth the stop at this lovely place. I definitely recommend this place.", "author": "Gerhard T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Best dessert I've ever had was the coconut banana - the food is great- I recommend beef steaks and dumplings. The drinks are great and staff is super nice And attentive! We love this place! \nPomegranate mimosa all day!!!!", "author": "Adair P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "The bartender here is great. He can make anything based on any flavor your craving. Really attentive and nice people working. Clean and cute place. \n\nCant say anything abut the food but drinks are deff worth it.", "author": "Vanessa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "Best happy hour menu on the street. Strong and fresh. Live music on sat. Plus the authentic lamb dishes. I will be a regular here", "author": "Joe C."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}