{"aggregateRating": {"reviewCount": 328, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-06", "description": "Chance used to be a good restaurant but has gone way downhill lately. Tonight I ordered food to be delivered and they never came to my address although they claimed they did. (My doorbell works) and I was looking out my window for them. After calling them and verifying that they wrote down the wrong phone number (address was correct) they finally arrived 85 minutes from the time I ordered. The food arrived cold and soggy and tasting much worse than the cheap Chinese takeout we get occasionally. The vegetable stir fry had canned vegetables in it (the original Chance never used canned) The Two Flavor Shrimp was soggy and for the price there were too few shrimp. I ordered this dish in the past and it comes with caramelized walnuts. What I received tonight was two tiny walnut fragments and two tiny pieces of broccoli and less shrimp than normal. Hardly worth the $17 Price tag. They were a good restaurant years ago but no more. I also went in one afternoon for lunch a while back and noticed two guys come in to see the cook. They sat at a table nearby and passed him a small brown bag in exchange for money and abruptly left.  It was creepy to say the least.", "author": "C W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-22", "description": "No table manners and poor slow service!!! My boyfriend and I frequented chance but during the past several months we've become increasingly disappointed. At our last visit we had to ask for everything! It took almost 20 minutes to get service in a empty restaurant. My boyfriend had to walk over to the manager to get her to take our order. Our water was in dirty glasses. The food isn't what it used to be. The manager is constantly MIA and should spend less time talking on her cell. Chance will not receive anymore chances from us.", "author": "Lucy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "This place is pretty authentic in term of Asian food. The pan fried dumplings are homemade and you can tell. Not the frozen stuff Spice serves. I had brunch there and I was very impressed. The price for lunch was very affordable. Good fun and great value. What else you can ask for?  Will go again soon.", "author": "Wilson L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "I have really, REALLY low expectations when it comes to bento-box-type lunch specials. But I keep ordering them, because they always sound like a good deal. I suppose I've just been hoping that one of them will turn out to be like Chance Cuisine. \n\nI'm so glad I've finally found you. \n\nThe miso soup (chosen over wonton and hot \u0026 sour) is delicious and sprinkled with mushrooms. \n\nThe salad was fresh and contained COLORFUL greens, not just white iceberg lettuce and an equally pale slice of tomato.\n\nThe pork dumplings tasted as though they were recently made, instead of plucked out of a soggy vat of yesterday's leftovers. \n\nThe rice was perfect, and my ginger chicken entree (although it looked like 1,000 other mediocre dishes at Asian restaurants across the city) was actually tender, flavorful, and full of crisp, well-cooked vegetables. And it was even slightly edged out by my counterpart's fabulous black pepper duck. \n\nBest of all, for only $7-$9, this is an incredible amount of food. We ordered dim sum to supplement the meal, and despite it being of surprisingly decent quality as well, it was completely unnecessary.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "I came here for a date with my girlfriend.\n\nWe had 8:30pm reservations., we arrived at 8 and were seated at 8:15. The decor was very modern.  The waitress were very attentive didn't hover around you. The food was AMAZINGGGGGGG. I had the Rose Chicken and She had the SeaBass. Get the SeaBass. Oh and get the Grean tea Dessert.. Oh my gosh i love this place.. I will most definitely be visiting again!  Amazing food.\n\nUPDATE: I went again with my girlfriend. I brought her sister and my sister.\nBoth of them them loved the food. Once again the service was phenomenal! I wish i lived closer to this place!", "author": "Randy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "i nominate edgar the bartender for mayor..the best..food\ndrinks and the koolest atmosphere. ..prices reasonable. ........", "author": "Sid W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-07", "description": "Top quality food and hands down THE FASTEST delivery around.  Literally got our food in 8 mins from call initiation to buzzer. Consistently very quick if not always under the magic 8 minute mark. \nTry the mango chicken and the hot \u0026 sour soup-my fave! \nService on the phone is quick and courteous while delivery guys are friendly and efficient. \nWe've been going here and (mostly) ordering for several (8+) years. \nIf you're in town at lunch get a chance box for a super inexpensive full lunch.", "author": "anthony r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "I've been coming here for about 2 years with my boyfriend and we enjoy ourselves every time. The food is always fresh and the bartenders are always friendly. The vibe is very chill-laid back with a urban flavor with a sense of sophistication, perfect for Smith Street. If you have a special someone who you want to take out for a nice evening  or just looking to pregame, this is a great place to go. \n\nUsually they have very cool music playing through the bartenders iphone with a great mix that makes for a fun night. Try their Mojito's, soooo good. They have a small selection of draft beer but the selection they do have is top notch so even your beer belly fickle friends will enjoy themselves. \n\nThis is not a late night spot, closes around 11PM. \n\nThey have a really good happy hour I think it's every day except Friday and Sat, prices are always fair.", "author": "Kim T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-02", "description": "this review is long over due. \n\nThe three stars are mainly for the drinks that were provided. I usually ask for a margarita when visiting a new restaurant - they totally failed with this. I cant even describe what I was tasting. \n\nThe service provided from staff definitely deserves 4-5 stars as they were attentive and even looked happy when engaging in conversation. \n\nThe portions are small - as expected in the Asian culture (when it comes to food...as far as anything else, those are still rumors...maybe?) I ordered the ribs - which were amazing and tender. and I ordered another dish with some kind of shrimp in it (forgot the name of it, but very good). \n\nI definitely wouldn't go out of my way to go there again, but still had a good time. just not worth a 2nd visit. Also, it was extremely empty in there - but it was lunch time in the early parts of the week.", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-15", "description": "Ordered  late night delivery from this place.  The speedy delivery was the best part, the food not so much. The food seemed to have a funny after taste to it and i couldn't figure out where it was coming from.  I ate my fried dumplings, but not the fried rice with chicken. Hard to get used to expensive NYC prices,seemed a lil high for what i ordered.", "author": "Elinor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "My friend and I dropped in just as the dinner hour was rolling around and had the loveliest Lychee Martinis, a new NY staple, those bad boy's were absolutely delectable!! Paired with their dumplings; ooh I can't even! If you want the more trendy space with booths in the front make a reservation! They tend to be booked for birthdays and special outings. Soft lighting with asian-fused decor and candles abound. It was our luck we dropped by!!", "author": "Isabella N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "Excellent!! As were leaving we asked for the check. The Waiter asked if we wanted desert we said no. The waiter was not letting us leave without having there house desert. He came out with a plate of desert on the house... Service is more than 5 stars", "author": "Irene R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-05", "description": "Dim sum = \nGinger lychee sangria = \nMango chicken = \nBeef dishes =  (chewy)\nAtmosphere/music= \nService=", "author": "Mary M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-28", "description": "I was hoping that I can write a better review but unfortunately my experience doesn't allow me to. I ordered via the Yelp app and that part of The experience was straightforward and went well. Unfortunately, the crispy beef that I ordered was soggy and had no flavor and anyone who's had good Thai food knows that flavor is everything! So that is why I am giving my experience 2 stars.", "author": "Camille D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "Love this restaurant as it is such a great place to meet your friend with amazing drinks and delicious Asian food.", "author": "Shelly W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Great seafood selection. Food always cooked fresh and tasty. Super friendly owner and attentive service.", "author": "Jay T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-18", "description": "In general, the service is a little dodgy at this place but the food is worse.\n\nwe ordered shrimp dumpling and soup dumplings. The shrimp tasted like soap and the soup dumpling had no soup in it...\n\nFor main we ordered crispy beef, which was sloppy and in massive chunks and very tough which made it almost impossible to eat.\n\nThe server greeted us by not confirming or reservation and walking off to do other things. we eventually had to follow her and ask her what the deal was for our table. Plenty of tables were open and there was no explanation about wait time or attempt to seat us until 20 mins after our reservation time.\n\nThe server also turned to a fellow server to say \"some people!\" After we politely asked if we could be seated at one of the several open tables.\n\nIn short, bad food, bad service. Would not go back.", "author": "Victoria B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "If u ever spending time in downtown Brooklyn, you need to go there to relax, such great place for drinks and dinner. I've been there a few times, every time it's a great fun experience!", "author": "Dazhi L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-02", "description": "The food is amazing however they absolutely ignored my request to wrap the spring roll separately so the salad dressing doesn't ruin it. Please see pictures of what my lunch looked like as delivered and a close up of the spring roll. I doubt I'll order from here again even though their trout is amazing.", "author": "Diane K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-09", "description": "Very disappointed. The dim sum were awful and the wonton soup had no flavor at all. It took over one hour for a delivery. The ribs were ok, but did not make up for the poor service and awful food.", "author": "Stephen D."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Chance Asian Bistro \u0026 Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "223 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nVf4oOGcz96wVfNO9V1ZTg/ls.jpg", "@type": "Restaurant", "telephone": "+17182421515"}