{"aggregateRating": {"reviewCount": 3, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-03", "description": "I love Hazelnut. I love Chocolate. I love Croissants. Guess who has all three. This place. \n\nNormally I tend to got for the classic Croissant. But today I was feeling feisty and went for the chocolate hazelnut one. Was not disappointed. There are dark chocolate notes that went well will the buttery croissant. This is the real deal. I love how flaky the croissant is. Dusted with chocolate pieces on top it really makes the perfect afternoon snack. \n\nAlso let's just appreciate Pret is finally in BK. It's taken long enough. No longer have to trek to the city for my chai latte and croissant. I'm loving it! Yum", "author": "Helen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-11", "description": "I love Pret, so i was excited that one finally opened up in Brooklyn and so close to my job. \n\nI've stopped in a few times and the customer service is great and cookies are always fresh :-) \n\nThis location doesn't have the self service coffee bar like most Pret's. It's more convenient to make my own coffee and then go. This is why I prefer Pret over Starbucks and Dunkin. It does get a little congested and time consuming to wait for the barista to make my coffee", "author": "Keisha F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "I found out Pret was finally coming to Brooklyn and I had to check it out. \nI came in around 830am and I was surprised by how empty it was, perhaps it was still too early.\nI ended up getting my usually breakfast omelette, which was delicious as always.\nThey have so many options available, I noticed the avocado toast was on gluten free bread!\nThe staff members were extremely nice and the Pret was very organized and clean.\nI will definitely be returning to grab lunch and coffee from here!", "author": "Shaima C."}], "servesCuisine": "Sandwiches", "priceRange": null, "name": "Pret A Manger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "2 MetroTech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rVc4Fg-JKVyK3mU2lq20TA/ls.jpg", "@type": "Restaurant", "telephone": "+13477253758"}