{"aggregateRating": {"reviewCount": 6, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-11", "description": "I had the best Turkey sandwich in my life here recently.  The menu clearly stated what the Turkey sandwich daily special was. My go-to Turkey sandwich is with swiss cheese,  lettuce,  tomato,  and honey mustard sauce. \n\nThey even offered to warm up my entire Turkey sandwich. During my wait,  I recall hearing back to back classic 90s r\u0026b records which made my visit better.\n\nI'm in the area often for school and errands so I'll most likely return here in the future.", "author": "Jessy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "I will say. The service here is very good, but if you do not like sweet stuff.... go elsewhere. The meat and spreads are so intense with the honey/brown sugar, I had difficulty eating the regular turkey sandwich. The quality of the ingredients are also fantastic and the sandwiches come well assembled in a box of you order a combo.  The owner is very friendly, as I have met with him during events for my employer (they cater as well).  If you like sweet meats, this is the place you.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-07", "description": "I am such a big fan of honey baked ham! I love it not only around the xmas holidays, but year round. I went into this restaurant this afternoon and was so excited to have lunch here. Well I looked at the menus hanging up and had a few questions. But the female employee would not look at me, acknowledge me or make any sort of eye contact. And she was sitting down, sort of away from the counter. She was on her cell phone and from the sound of it, it was a personal call. Okay, i'm totally understanding etc, but the fact that she did not want to help me at all and was more concerned with her personal phone call. There were no other employees in sight, and it was a weekday around 1pm? Lunchtime. SO DISAPPOINTED with this crappy service. Needless to say, I won't be going back to this store. There are other honey ham companies around.", "author": "Benjamin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "I only ordered coffee and an egg and cheese croissant but the customer service was amazing. Sometimes it shocks me when I receive great customer service in NYC. Not sure if it was because they were empty (I mean, it was 10 am lol) but they seemed very happy to see me. I'll be back tomorrow to check on those orange rolls! I need those in my life! I'm so over cinammon rolls lol.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "It's always empty which I love with all the wait time everywhere else it not easy to get lunch anymore. This place make it really easy to order. My complaints: there bread selection. Itd be nice to see them switch things up with heroes or wraps. The slice bread is far to small to hold the contents of the sandwich. The other thing is they never have any soup. The one time they did it sounded really gross so opted out. And lastly the salads do not taste too good, I don't recommend them at all. Overall this is a place for meat lovers and I definitely recommend it, if you are around for work, for sandwiches. The ham is everything.", "author": "Clari B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "I ordered a turkey sandwich and house salad which was amazing. Best fresh turkey for miles around. It took about 10 short minutes for delivery. This restaurant is 9 out 10. I will definitely be back.", "author": "Vanika M."}], "servesCuisine": "Sandwiches", "priceRange": null, "name": "Honey Baked Ham Company", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "395A Flatbush Avenue Extension", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LKiW2lkGhY4VYCh0RthMmg/ls.jpg", "@type": "Restaurant", "telephone": "+17182430964"}