{"aggregateRating": {"reviewCount": 44, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-13", "description": "This is a solid slice of pizza, when I'm coming home from work and I'm looking to grab something to take back to my apartment it's my go to.  Don't come here expecting the dining experience of a lifetime but if you want some solid food that you'll enjoy, get off your Yelp high horse and eat some damn pizza at Luv-N-Oven.", "author": "Max K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-07", "description": "This place might be called Luv-N-Oven but there is sure as hell no love here. I ordered delivery from this place on Seamless Web and it was the worst delivery experience of my life. It took an hour and thirty minutes for the delivery. When I finally got my food, my meatball hero was horrible. I have had horrible heroes before but this sets the mark. I honestly am never ordering from this place again and unless you like eating crap, I would recommend you not to.", "author": "Divya P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-18", "description": "went to visit a friend in Brooklyn Hospital \u0026 discovered this hole in the wall pizza place...chicken caesar pizza is amazing!!", "author": "Ileane S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "Ordered a pizzeta (small pizza) on seamless because it was very cheap (10\" pizza for 6 bucks). Definitely worth it: loads of cheese and the dough was thick and tasty. Only complaint is that they could've put on a bit more toppings. Would definitely recommend, great bang for your buck.", "author": "Ben B."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Luv-N-Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Dekalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ya5RpK88YzCXDKyB-MbfRw/ls.jpg", "@type": "Restaurant", "telephone": "+17188525837"}