{"aggregateRating": {"reviewCount": 44, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "Good buffalo chicken pizza (extra cheese meant extra cheese). I would recommend and order again.", "author": "Rob D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-05", "description": "Luv-N-Oven serves up a really great margherita slice - but all the other ones are kinda meh. The location is very narrow, with a grab and go counter and four tiny tables and chairs. The whole place is pretty open to the windows and doors so its drafty (or open to summer heat depending on season). Popular with the BK Tech kids, it doesn't tend to have a long line and the guys are pretty friendly. I tend to come when I need an emergency snack on the way back from the park.\n\nPizza here tends to be a bit more chewy than thin/crunchy, but the dough is well seasoned.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-15", "description": "Tried ordering delivery and bc I order a few slices with different toppings the guy over the phone tells me he can't deliver unless I order a pie bc people complain.... First of all I have ordered SLICES before for delivery from the Spanish guy and never was I told they can't deliver slices only pies. This guy was really forcing a pie on me and I wasn't having it... how are you suppose to make money if you don't want to deliver a few slices which if you put together it's like a pie but different toppings. Lost a good customer", "author": "Annn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-26", "description": "As I waited, the order for an Asian American teenager who'd ordered before me was ready. The guy behind the counter called out \"Chino\" and \"ni hao\" and laughed. That earned it one star in my book. Though plenty of other reasons:\nGrease pooling on top of slices behind the counter\nNo one wore gloves\nFreezing cold inside", "author": "Carl B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "Delivery took over an hour.  Once the food came my family was so excited until we saw a burnt deep dish pizza with hardly any cheese and the middle of the pizza was uncooked.  How can a pizzeria burn the outside of a pizza and it still taste chewy?  This was a horrible experience and I will never order from this restaurant again.  Please save your money and your time.", "author": "Tiffany D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-17", "description": "I gave this place an extra star because it's open late and they deliver fast. But, only eat here if you're hungover, drunk, or super hungry and nothing else is open. The food is mediocre at best and if you ever tried to feed this to a real Italian person, then they'd probably slap you.\n\nWhen I'm drunk (never a good sign if this is how you start a review), I like to order the pasta special which is stuffed shells with a side of \"free\" garlic knots. The stuffed shells with grilled chicken (additional $3) tastes bland and the tomato sauce is really oily. If I feel like a healthy drunk, then, in addition to the pasta special, I order a Chicken Caesar Salad which basically tastes like dried grilled chicken strips over a pitiful bed of shredded iceberg lettuce ($10). I've also walked passed this place and I wish I didn't. It's a small run-down pizzeria with sad employees staring aimlessly out the window. But, like I said before, only order from here during desperate times. They're fast.", "author": "James W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-18", "description": "My car parked next to this place right now. The worker slams his bike and scratches my car. I get out confront he laughs says no, doesn't apologize at all keeps spraying wd spray in his bike i told him to apologize i saw him and he continues to lie in my face. His other worker comes out and starts calling me degrading anti gay words in spanish starts with mari**n\nAnd then he puts his hands up not even a good boxing stance. I called him and his other worker bad liars, who can't even apologize. \n\nBelieve me i was more than nice. I was working from my laptop in my car parked and all of a sudden i hear and feel a boom, my car shook a bit. I get out this guys laughing knows what he did and doesn't have decency to apologize. I could easily called police and still can as i am here typing, but he just tries to make up things like maybe car behind me. \n\nSHAME! SHAME! on this place.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-29", "description": "Food was delivered quickly for a Friday, but was cold and in terrible condition. The delivery man didn't have a lock for his bike so he wouldn't come to the door for delivery which was a bit of a pain. Not terrible food but not worth ordering again.", "author": "Morgan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-24", "description": "Garlic knots are not good. Pizza is edible but not good. I'd rather have Ellios. I didn't even finish one of my garlic knots though.", "author": "Lo B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-07", "description": "I ordered from this restaurant on 1/3/17 and got some ziti. I got the ziti and started eating it in my room, which was pretty dark. Then I bit into something hard and felt my tooth crack. Upon further inspection, the plastic lid to the ziti had a huge hole in it--it looked like it had melted and then cracked into the food. I went to the dentist the next day and am in the lengthy and expensive process of getting my tooth fixed. \n\nI have called the restaurant several times leaving my name and phone number, explaining the situation, and telling the guy who answers the phone to have the manager call me. It is now 1/7/17 and no one has contacted me. So I guess I'm posting this in the hope that someone calls me so we can work out my dental bill. If no one gets ahold of me, I will take other action. \n\nSee pictures of the food and lid I got. Disgusting.", "author": "Rachel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "This is just one of those New York pizza joints. Bare bones interior with delicious, high quality goods. I had a slice of their buffalo chicken pizza, it's nice and fat, not too spicy, and it has that intangible quality in the dough that is easy to bite through but makes you slow down and savor anyway. Since its across the street from a hospital, I wouldn't be surprised if they were making a killing.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-08", "description": "I like Luv'n Oven a lot. It's probably my fourth most favorite pizzeria in the Fort Greene-Clinton Hill area: that's not saying anything against Luv'n, because the area has a lot of great pizza joints.\n\nWhen I used to commute to and from Manhattan, Luv'n was on my way home, so I'd stop by to pick up a couple of slices for dinner. I live just far enough away (and closer to other pizzerias) that it's not one of my go to places to pick up or have a whole pie delivered, so I tend to grade it on what I call 'novelty' slices, that is to say the smattering of slices they have ready to be reheated for take out, presumably their most popular offerings.\n\nLuv'n's Neapolitan (ie standard New York slice) isn't mind blowing (their fresh mozzarella slice is pretty exceptional, though), but what they do that no other area pizzeria does is a round pie with a thick crust. These are typically chicken pies, Buffalo chicken, chicken with broccoli and barbeque sauce, or chicken and tomato. They're unique and pretty delicious, with a deceptively soft crust and copious amounts of the toppings.\n\nThe space is small and densely packed with seating, but it's offset a bit in the summer when they open up the entire storefront.\n\nI find the people working there to be terrific- they've been perfectly nice to me, and while I don't go there often, they usually remember me enough to joke around a little.", "author": "Trey K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-10", "description": "This pizza place I gave 2 opportunities and they both were horrible , I bout a slice with chicken and the chicken was gummy and the slice had globs of cheese and the bread was rock hard , than the second time I bout a beef patty with cheese and the beef patty was mushy and the meat was gummy , also a slice with chicken and Brocolli and the Vegatable wasn't fresh , and the Chicken was also stale with once again rock hard bread . Pricey as well , not worth it and I will never Go back in there again .", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "I happen to think this place is great -- they've got a truly excellent plain slice here! Also it's really close to the hospital, which is convenient.", "author": "Julian F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "The staff is always so nice and friendly. And the pizza never disappoints. I've tried pizza from other places in the neighborhood but nothing compares. They really put luv in their oven.", "author": "Josephine P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-18", "description": "This place is just plane nasty, an it's unbelievable that this happens to be the only place for miles with an actual possible Italian maning the joint making this even a sadder state of affairs,\nI HAVE NEVER EVER seen a fresh food in the counter space, EVERYTHING looks like a dried up mess that's been laying around since the dawn of time.\nI've had the lil circular pepperoni and spinach cheese rings, for two bucks I was how can u go wrong, well it didn't go horribly wrong but it went wronge, I won't even touch anything else here so your peril if u do", "author": "Joe S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-12", "description": "Just gross.\n\nThe food is barely edible, and the service from the staff at this place is abhorrent!\n\nNot worth it in a city full of pizzeria's!", "author": "Meriah D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-21", "description": "I don't usually eat here, but when I do the food is always satisfying. Had some baked ziti today for lunch it was good. I also tried their buffalo wings which was ok. The one thing I like the most though is their caesar salad pizza. You gotta get this if you ever pass by.", "author": "Keron J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-19", "description": "I'd like to forewarn that this review does not cover the actual food at Luv-N-Oven. They failed at even allowing me to give them my money:\n\nI've given this pizza place a 1 star because of the terrible experience I had in trying to order delivery from them. Upon calling them twice, the first time they didn't pick up, I was greeted by a mumbled voice that I couldn't really understand. Whatever, it happens but it wasn't until I told them that I wanted delivery that things got ridiculous. My conversation went like this, and no I couldn't even dream to make this up:\n\nMe: I'd like to get delivery please.\nThem: Okay, where?\nMe: I'm on Clark street in Brooklyn Heights\nThem: Err, what?\nMe: Brooklyn Heights\nThem: Oh, okay. What street?\nMe: Clark street\nThem: Err... umm dark street?\nMe: (Somewhat confused and enunciating very clearly) Clark street\nThem: Err, umm, please spell that\nMe: C-l-a-\nThem: D?\nMe: No, C\nThem: D?\nMe: C (pause)\nThem: (Yelling into the phone)D?\nMe: C, C as in Cat\nThem: Ohh ohh, okay. You mean Court street?\nMe: No, I mean Clark street.\nThem: Court?\nMe: CLARK. CL-ARK\nThem: Court street?\n*I hang up the phone*\n\nLook, I understand English isn't everyone's first language; however, I've never been more frustrated in my entire life. I felt like I was being Punk'd or on Candid camera. I was literally willing to give them $20 for a single pizza, but that couldn't even come into fruition.\n\nI will not (try to) order from here again. Pizza is perhaps the staple of fast NYC food, yet this place couldn't even deliver on that. Either order online or go there in person because ordering delivery is just a joke.", "author": "Bay P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-25", "description": "I always see this place come up as one of my ordering options for Seemless, but had no idea of where it truly was. Fast forward and I find myself by Brooklyn Hospital in search of food and what do I see, but Luv-n-Oven. I quickly cross the street and order 2 pepperoni slices. It's a typical Brooklyn pizza shop designed for more takeout than dining in with a few tables if you'd like to stick around, but honestly kind of smallish. The pizza was ok, but not great. However, the service was fast, the guy taking orders was very nice and well that counts for alot.", "author": "Nyota W."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Luv-N-Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Dekalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ya5RpK88YzCXDKyB-MbfRw/ls.jpg", "@type": "Restaurant", "telephone": "+17188525837"}