{"aggregateRating": {"reviewCount": 44, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "Pizza and heros are always decent.. Whenever I work in the area , I make a point of ordering from them. And the staff is friendly.  Had a great sicilian slice last week during a snow storm..", "author": "Sharon B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "Try the pinwheels!  They will not disappoint.  Very sweet group of guys who run the place.  Fantastic Brooklyn Pizza.", "author": "Molly D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "I order from this place via Seamless one to two times per month, and am generally satisfied. The delivery times are prompt and reasonable (I live about a mile away, and my food usually arrives in 30-45 minutes). The quality of the food is fine. It's probably the best option in the area for easy, inexpensive standard takeout Italian fare.", "author": "Robert F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-06", "description": "Really good pizza.  I stop by sometimes on my way to class and the guys are so nice and quick.  They also take credit/debit.  Hallelujah!  I usually get a margherita and a spinach roll.  I think slices are $3 and rolls are $2.  It's a small shop but they have about 4 tables for eating in.", "author": "Nisa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "I tried Luv-N-Oven pizza for the first time tonight.  I've lived in the neighborhood for a few years and have gone through most pizza places nearby, eliminating many of them from circulation for being slow, rude, and having too many health code violations. \n\nI placed my order on seamless web for a large pie with ricotta and pepperoni.  They have a white pizza, which I would have opted for had it not been for the presence of feta in the cheese mixture.\n\nAbout ten minutes after placing my order I received a call. \n\nLNO: Do you want a regular pizza with ricotta and pepperoni?  Or a white pizza with pepperoni?\n\nMe:  A regular pizza with ricotta and pepperoni.\n\nLNO: Great, thanks.\n\nNow, I appreciate the thoughtfulness behind the call.  Luv-N-Oven trying to save me from paying for two toppings when I only needed to pay for one.  This is not my first time on the internet, or ordering pizza though, I knew what I was doing.\n\nLuv-N-Oven, ditch the feta in your cheese mix and I'll be luv-n you for years to come.", "author": "Erica T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-25", "description": "Ordered delivery from here for the first time. Our office is about 1 mile away and it took an hour to arrive. I was definitely not happy about that, but I actually got over it enough to not take away a star.\n\nI ordered the beef lasagna. The taste was decent and the portion size was pretty good for $7.50. I just wish I didn't have to scarf it all down, as a result of it arriving after my lunch break had just ended.\n\nThe guy on the phone mentioned that our company hadn't ordered from them in almost 4-5 months. I guess it's obvious why.", "author": "David W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-26", "description": "Surprised by all the negative reviews of this place.  The pizza is solid and the staff is friendly and very neighborhood oriented.  \n\nNot really sure why these other folks are writing reviews based on lasagna, heros, and cheese steaks.  It's like going to a burger place and writing a review based on a grilled cheese.\n\nAlso, I def prefer this place to pipitones", "author": "Michael B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-07", "description": "Small pizza shop.\n\nWalk in, tell 'em what you want and they'll make it for you. The slices are rather large and they don't skimp on the toppings. Cool in my book, especially if you're really hungry.\n\nBesides that, there's nothing to write home to mom about.", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-03", "description": "Ordered from Seamless. I ordered a Margherita pizza...be forewarned, their margherita pizza is basically bad cheese pizza. Tomato sauce, cheese...no basil and the lame cheese that was on there was no real mozzarella. \nAlso order the buffalo wing special. Came with super soggy fries. And the Pepsi I was suppose to get with the special was a no show.\n\nI normally don't care about the delivery guy. But this guy called me to tell me he was downstairs. After buzzing him in several times, he kept saying it wasn't working (I know it was) and yelled at me on the phone to just come downstairs. Basically I got yelled at because he was too lazy to walk up the stairs to my apartment.\n\nWon't be ordering from again.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-13", "description": "WE FOUND A FUCKING BAND AID IN OUR PIZZA!\n\nOh, and it took an hour and 30 mins to get delivered.\n\nWe had to explain to the dumb ass delivery guy on the phone how to get to our apartment. \n\nSTAY AWAY! Disgusting pizza, horrible service, idiot management.", "author": "Robert L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-20", "description": "My nominee for Worst Pizza In Brooklyn.\nIt should not be so much work to chew a crust, which was burnt and had the texture of cardboard.  And the pizza is too salty overall. \nI'll never order from here again.", "author": "Lee N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-07", "description": "Reallyyyy surprised to see all the negative reviews. I ordered from this place because I was really hungry and was too lazy to cook (story of my life).. Anyway, I ordered using the grub hub app on my phone. After i placed the order, I got a courtesy call to confirm my order/items. Cool. My food arrived in like no more than 10 minutes, no exaggeration! I couldn't believe it. The pizza was also really good! I don't usually eat pizza crust but all that was left in my box were the grease spots. lol. Would definitely recommend!", "author": "Marla B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-09", "description": "Meh\nthis was fine and i am being slightly biased by the simple fact that it was a dingy and dank little place across from an emeregency room, but all in all the food was ok.\n\nSorry guys - maybe i'll try a Gyro next...no wait, no i won't it's a PIZZA place", "author": "Furyk C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-18", "description": "I actually come here pretty often..If you are in the area and want a good slice of pizza..mos def check it out. I went there this evening on my walk back from MLK program at LIU-BK(sidebar: it was great, Kevin Powell spoke, he reignited my desire to be a mentor) \n\nAnyway back to the pizza....had a slice from a pie that just was coming out of the oven as I walked in..so that was great...chessey goodness!!! I would have liked more sauce..but whatever..it was good and I will mos def be going back. Like many other pizza joints in the area they have pep roll, sausage rolls, beef patties (go figure), and one that I have never had..they have an eggplant calazone! I am thinking of trying that next time.", "author": "Bev G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "During my daily commute down DeKalb Avenue, I stopped short in my tracks when I spotted a large florescent labia beaming brightly from the window of an otherwise nondescript pizza parlor. Upon closer inspection, I realized that what appeared to be the anatomical curiosity in question was actually intended to be the neon representation of a pizza.\n\n...But seriously. It really looks like a \"vag.\" Which I like. And the name of the establishment, \"Luv-N-Oven\" certainly doesn't dispel one's suspicions.\n\nRegardless, the pizza was top notch, almost as good as a Luv-N-Oven itself.", "author": "Zachary S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-18", "description": "They service a captive crowd of hospital workers...  it's what I call opportunistic pizza. Walk a block down DeKalb and you can get better... much better actually.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "This place is  great. My favorite next door spot for a quick slice. The staff are awesome and chill and the pizza's out really quick and is fresh and tasty. Highly recommend! \n\ndisclaimer: only had take out no idea what goes on with delivery.", "author": "VJ B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-23", "description": "Two thumbs down!  That little window to serve food through is really meant to whistle at and degrade women.  Don't eat their pizza.  There are five better pizza spots in a 2 block radius, where they actually respect you!", "author": "Cubannie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-16", "description": "I was sooo hungry, but meh, I've experienced better. I wouldn't order again if I'm in the mood for some really good American-Italian. I was desperate, it was late at night, and they were open.\n\nStromboli- I got two of these, one for me and one for my dining partner. I think it's unfortunate that this was his first stromboli ever; it wasn't a high quality one. It wasn't very good at all, for a stromboli. Not very filling. $11.98 for two.\n\nFor some late-night junk food, mmm, yessss it was good. Wasted? Say yes.", "author": "Monica G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-30", "description": "DO NOT ORDER FROM HERE! \nI was stupid enough not to check the reviews before I ordered, so I ordered a pizza. Over our video system, I can see the delivery guy come to our place, but he obviously hasn't read the Seamless instructions that say you have to push our buzzer #20, and he doesn't have a cell phone to call us, so he just leaves. When I call the restaurant to tell them, this is what I get from the guy:\nME: The delivery guy was just here, but...\nPIZZA GUY: No no no! You don't take the pizza from the guy in the car! You take it from the guy on the bicycle!\nME: No, that's not what I'm saying. This guy didn't even have a bicycle...\nPIZZA GUY: [Getting angry] What?!? He's supposed to take the bicycle into the apartment?\nME: No! That's not what I'm saying! He wanted to deliver the pizza but he didn't know how to work the buzzer.\nPIZZA GUY: You were probably in the shower when he pushed the buzzer!\nME: I was not in the shower! I saw the whole thing happen over the video camera!\nThis infuriating conversation continues until I hang up. When the guy finally comes, he still can't figure out how to get in, and still doesn't have a cell phone, so my husband had to go chase him down to get the pizza, which wasn't very good anyway.\nORDER FROM SOMEWHERE ELSE!", "author": "Melissa M."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Luv-N-Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Dekalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ya5RpK88YzCXDKyB-MbfRw/ls.jpg", "@type": "Restaurant", "telephone": "+17188525837"}