{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-13", "description": "Me and my friends were Fortina regulars until this place ruined it for us. This place is not like the other locations. Always looked forward to eating here because of it's closer location but they are n e v e r EVER! consistent with the taste of their food! Lemon spaghetti and ESPECIALLY THE RIBEYE STEAK! They have quality steaks in other locations, truuust me, but not here. They bs it every single time I go and it's not worth the $50 for it here, that's for sure.", "author": "Justin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "Excellent!! I love their sauce, the food is off the hook \u0026 the service was great!! We will definitely be back!", "author": "Maureen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "I've eaten at Fortina a few times and the food is pretty delicious. I have to say that my favorite dish is that truffle pasta. I break out into a happy dance every time I think about it or anticipate eating it. The truffle pizza is tasty too. \nLet me just say this, The service has been impeccable every  time I've gone. They are working and not standing around chatting, They checking in to make sure everything is good and they look like they actually enjoy what they do. But even if they don't, they are putting on one hell of a show.\n\nThumbs up to you Fortina!!!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "I discovered this place because I got a free pizza gift card. It's located in the dekalb market, inside city point. The place is really nice, big and cool. The pizza was very good and the beer too. The service was very kind, although they took a long time for every step of the process.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "The employees are very friendly and welcoming \u0026 the environment was nice. The food was okay, I just found it a little odd the chicken parm dish comes with a side salad or French fries. Who eats French fries with chicken parm?? That threw me off and there's no substitutions. They do have pasta on the menu but that's a separate order. But again, French fries shouldn't be the the carb option for a side for an Italian entree. Maybe that's just my opinion. But the French fries were steak fries and they were good", "author": "Estela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "Decor: 2018 rustic\nService: yea\nFood: got damn!\n\nSo, 'rustic' these days, in gentrified Brooklyn, includes fancy flat screens and cable... In pricey food markets. Let it be known.\n\nPleasantly surprised by very good plates: mmm lemon pasta; mmm ravioli; and a bomb clay pot oven roasted rigatoni (?). Fam. It was all gone in a matter of minutes. It was substance and starch with old world Italy flair (simplicity). In short, they doing things right. That said,\n\nIt's 2018. Quality costs. Take your Trader Joe's or Target bill for discount. If you have colon or drinking problems, sidestep their bottomless mimosa glass trap. \n\nOk, Thanx, bye.", "author": "Hadiza A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "best staff, music was bumping, drinks were great. pizza tasted really good! if ever in the area, this place is a MUST TRY!!! Just come here before going to the movies or shopping at TJs- you wont be disappointed!!!! \n\nalso had no plans and came here randomly to celebrate NYE here and it was the best NYE celebration in a while. amazing vibes, great champagne. i love this place!!! \n\nthe manager (i forgot her name) is the SWEETEST. JUST GO", "author": "Nic B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-26", "description": "My family goes here pretty frequently. When they first opened there were some issues with their service, but lately we have not had any issues. Most importantly, everyone is always very nice. We often go with our daughter (now 2) and they are very accommodating. \n\nThe only reason I took off 1 star is because while the pizza is excellent, the pasta can be inconsistent (but usually is good). The other reason is that pick up is SO slow. I would pick up from here all the time if it was quicker, but every time I order (in person) there isnt anyone at the desk to take my order and then it takes at least 25 minutes which is just too long to stand around waiting for a to-go order.", "author": "Debra L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Love this place! It is located under Target just outside of Trader Joe's in this super cool marketplace of eateries. It's a sit-down restaurant with an awesome bar. We actually sat at the bar for dinner. \"T\"took great care of us; very nice guy and an excellent bartender. They offered a ton of cool drink specials - my husband had the beer and shot special. He tried a local IPA (pictured) which he enjoyed. T modified the Bada Bing for me and it was delicious, went down too easy!\n\nWe ordered pizza which was fantastic. Very fresh, Neapolitan-style, brick oven pizza. Delicious! Although we are only here for short visit, we will make our way back to see T and sample some of the other menu items. Well done Fortina!", "author": "Elise B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-10", "description": "Not impressed. Been here several times. Never had a great experience, only ones that range from ok to disappointing.", "author": "Olivia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Honestly, the best Italian food I ever had. And as an Italian American, I've had a lot of Italian food in my days. Everything at Fortina is shockingly delicious and comes out so tasty - and I've had nearly everything on the menu. \n\nMy husband and I went here several times a week when it first opened. Then we had a baby and it got harder to sneak over there. But when we needed to host our baby's baptism party, Fortina was naturally the place we chose. We knew they had a private area in their \"wine room\" - and it seemed like the perfect spot to host 20ish adults.\n\nJen Alves made the whole party planning process a breeze, helping answer all my questions and ensuring a smooth-sailing event. Katie, the GM, was a pro - she kept everything smooth and calm the day of. Infinite was our server, and she was efficient and made sure all our guests were happy. She even gave my son a beautiful gift! So thoughtful of her! \n\nAll of our guests loved the food. They are still commenting on how delicious it was several weeks later. We offered the family share menu with several courses of apps, pizza/pasta, meat entrees, and desserts. It was a ton of food. And all prepared perfectly.\n\nI can't say enough good things about this place. I live a few blocks from DeKalb Market, and instead of trying new places, I keep coming back to Fortina. So worth it!!", "author": "Lindsay F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-22", "description": "I placed an order to go from this restaurant and the service the hostess at that time gave was horrible. I was not offered a menu all she said was what did I want . Didn't even ask if I had been there or had seen the menu to know what I'd like in the first place. Now online I looked at the menu and did see something interesting but I asked for it and apparently it wasn't being made in house it was a seasonal special. So I had to ask the rude hostess for a menu for the hopes something I'd like would be there. She offered no seat to wait at or anything I wound up meandering to a free bench and waiting.    My food was bought out after a pretty long wait. When I got home I was very dissatisfied with the dish. I ordered baked ziti and the description states fresh ricotta as a star ingredient, but I can attest that there was none to be found in my dish, in fact I ordered 2 entrees( one for a friend) they didn't get any ricotta in their dish either. And as for it being baked well, it was pretty soupy in consistency. I also  ordered bread pudding as my dessert and that was actually a very nice dish, one of the best bread puddings I've had. I hope this restaurant finds a better hostess and tweaks the menu descript to accurately describe the dishes served.", "author": "Vanity P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Fortina is located in Dekalb Market Hall, although I believe they are not actually considered a part of it, as the DMH instagram never promotes for them. \n\nGenerally, I'll eat here for lunch with a drink or two. Their lunch sandwiches are a great value and you can sub the pickled veggies for fries. The italian sausage and broccoli rabe sandwich is my favorite. \n\nTheir liqour selection could use some work - especially their rum. They should offer Wray \u0026 Nephew or Ron Zacapa. Also, they should pair their beer list down and maybe offer a few staples, like Heineken. I feel like every time I come here, the draft system is down. \n\nIt feels like they have a high turnover rate with staff too. \n\nOther than that, it's cool.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-22", "description": "I've been to this restaurant 2x and I did enjoy the service and food, but I will never go back ever again. Me and my friend split and charged our bill and signed on each of our receipts . We were both surprised that the amount we signed for wasn't billed ,but the restaurant had added additional tip and it showed on our online credit card statement . It's disheartening that it occurred and annoying that I had to call my credit card company to adjust the amount . Even though the amount wasn't a large amount... it's the principle .", "author": "Melanie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-07", "description": "I have very mixed emotions about this restaurant. The menu had a great variety but the service was terrible.  The decor was unique but the wooden chairs were very uncomfortable.  Their seating and ordering policy is unusual.   It appears you seat yourself.  Eventually someone comes over with a menu and explains the ordering policy.  There is a card and holder on the table. When you are ready to order, you put the card in the holder and when spotted, a server comes over to take your order.  In my opinion, you are counting on the servers to be attentive.  So every time you need something, you insert the card?   I think you need lots of luck for this to work properly.  Anyway, We ordered the Chicken Cutlet (hot appetizer).  It was nice and crispy with a hint lemon flavor.  We ordered the Spaghetti with a lemon butter sauce. We liked that too. We also ordered the Piatto Di Verdura. It is a variety of wood-fired vegetables with a trio of sauces.  This was delicious.  We did not order any cocktails, though they looked wonderful.  We did get the Cappuccino, the Tartufo and the Brown butter bread pudding.   Amazing!   We enjoyed the food, the variety and the atmosphere but have great concerns about the lousy service.", "author": "Barbara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "I think this place is great. The food is delicious and the service is excellent. I liked the classic Italian menu selection, and I appreciate a casual restaurant with a full bar. The pizza looked great. I had the spaghetti with meatballs, and really enjoyed them. My husband had the frittata, and he loved it. The price was fair, and the staff was friendly. I highly recommend you give it a try.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Loved the food as always, but the service is SO bad. Seriously. They use a card method where you put their happy hour card in a stand to get the wait staff's attention, but they seem to walk right past you. I've been twice and it keeps happening!!\n\nTonight was even worse...the waitress was at our table and had a faraway look in her eyes...then after placing our order disappeared. Really strange. Otherwise the food is amazing!!!", "author": "Angela C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "On my first visit to Fortina, one of the \"anchor\" restaurants of City Point, we had a great time. \nSitting deeper inside the restaurant feels like you aren't in City Point, so I recommend that. Music was great the entire time. \n\nService was attentive. Several servers are available to assist even if you main server is doing something else. \n\nWe had the Tenderoni and the \"original famous rays\" pizza. Both were very good, particularly the Tenderoni. Really loved the chili-honey. (Not too spicy and nice sweetneess). We also shared a glass of red wine. I had trouble deciding on one and was given a sample to choose. \n\nThe highlight, however, was that children are able to knead their pizza dough and make a little (complimentary) pizza. Big hit for our 2.5 year old. We will be regulars if this is a Fortina standard practice. \n\nI know there is a wood-fired pizza place in Dekalb Market, but having this full-service pizza/Italian restaurant is a great addition to the building. \n\nLots of other great looking things on the menu, including non-pizzas. Looking forward to trying them!", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "We had so much fun on our visit to Fortina! We came after seeing chef Christian on Food Network. The food was perfect, but the service as even better. Several servers took care of us and made us feel like we were their most special guests. I had fried meatballs for an appetizer and the chicken Parm for my entree, and my wife had the garlic bread appetizer and the lemon spaghetti for her entree. It was like the best Italian grandmother food. We're definitely coming back soon. Thanks for everything!", "author": "Frey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Caught a movie at Alamo DraftHouse upstairs and wanted to grab some drinks with a friend at the foodcourt at CityPoint.\nFortina caught our eye due to chill vibe, nice ambiance (darker lighting, pleasant music) and bar availability.\nGranted we did not sample the menu - just ended up with a pizza and some wine, but that was thoroughly enjoyable.\nBartenders were friendly and helpful. Had few glasses of excellent Malbec and Margherita thin crust pizza. Wine was great and Pizza tasty and fresh (their pizza ovens are quite cool and big). \n\nGreat way to spend an evening at Citypoint food courts. Will be back to try some of the menu items", "author": "Lenny Y."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Fortina - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nDekalb Market Hall", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MglAghHRvOzTHHyXJMlqVA/ls.jpg", "@type": "Restaurant", "telephone": "+19179479399"}