{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "The fortina is a great place to get dinner as I had the lemon spaghetti and it is amazing! It also has a nice roomy feeling inside and the employees there are the best I have ever had! The reason I have to get it four stars is because it does lack a little flavor in some dishes and the chairs are very uncomfortable and I have to stand up constantly to stretch myself out.", "author": "Jack J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-21", "description": "I've been to Fortina at Dekalb Market since they opened from day one and I was really impressed  The food, the staff was amazing, but a fire incident closed the restaurant for 3 plus months  and after a long wait for the grand reopening...business seem a bit slow. I also noticed the majority of the staff look like new people? I decided to bring some friends for a long over due meal at Fortina and we were not impressed  The oven was not working = NO PIZZA what da £?_*#%. My drink was weak and the fires taste like it was dunked in salt #diabetes. I truly hope things change for the better, taking a break and trying other options for now.", "author": "D. L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-17", "description": "DON'T EAT HERE!! \n\nSo the first time I went to eat here, I ordered the garlic bread to start and chicken parmesan. My husband ordered a side salad and vegetables. So my chicken parm came first and his vegetables, then after I got up about 40 minutes to 1 hour to inquire about the garlic bread and side salad they said it was coming. So we ended up getting the garlic bread to go because it took so long to come out. They ended up comping the meal due to poor service. I thought I would give this place a second chance last night because I wanted to try their pizza. Wrong choice! My sister and her boyfriend are visiting from Canada and we went here for dinner. She ordered a glass of Pinot noir and a pizza, he also ordered a glass of wine and his meal and I ordered mine. The waiter then asked my sister for ID, her boyfriend forgot his wallet at the hotel so she only had hers. Now she took out her Canadian ID and the waiter took it and said she would be right back (which was odd and took a while), she came back (about 5-10 minutes later) and told my sister that she couldn't serve her alcohol because she didn't have a NY state license. So my sister found this odd and asked to speak to the manager who confirmed it. My sister then stated that she was visiting and how would tourists have a NY state license. They wouldn't even accept a passport, WHICH IS VERY BIZARRE for a restaurant to behave in that manner. My sister also lived here for 4 years prior to moving to Canada and has never encountered this not even at a club or lounge let alone a restaurant. The manager also proceeded to say she could lose her job and she was adamant that this was the law that she couldn't accept any form of ID out of state or country and offered to print out the NY law which states this. She's 30 years old and has no reason to lie about her age to get a glass of wine with dinner. Her boyfriend is 33. Like COME ON lol. We ended up leaving the restaurant and going somewhere else right across the building that accepted her ID. Now I have lived here for 6 years and don't have a NY state license and no one has ever told me this, I think the manager was being prejudice. I looked up the laws on identification and it doesn't state this anywhere and states passport and other forms of government issue IDs out of country are acceptable. I WILL NEVER GO BACK TO THIS PLACE EVER AGAIN AND ENCOURAGE PEOPLE TO DO THE SAME!!! HORRIBLE!", "author": "Jasmin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-09", "description": "Never coming back here! Came here today with the family just to pass the time and ordered 1 pizza to share for the three of us as we were not really that hungry. Around 30 minutes had passed, still no pizza, while the other diners who came after us already got theirs. Only after I started looking around for the server did one come to approach us and asked if we did order only one dish (forgot which one she mentioned) and we said no, we ordered the prosciutto pizza. She went away, came back, didn't say what the problem was, except that the pizza is now in the oven and it's on her. Never came back to us for an update until hubby had to tell her we've been waiting for 45 minutes (and now really hungry). Finally, it came almost an hour after we ordered, with an insincere \"sorry\" and that the pizza is on the house. No comp can make up for the long wait and an attitude that thinks no sincere apology is needed as long as we don't need to pay for it.  Besides, the pizza does not even taste that good! Very poor customer service.", "author": "Maria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Great food, great space. I can't wait to try more dishes. The Polpo (octopus) appetizer was so good, and great selection of wines and cocktails.", "author": "Trey P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-31", "description": "It's okay - we had the pizza and baked ziti, neither was amazing. The system where you call the waiter with the card is okay. I'd try something else inside of dekalb market before going back here.", "author": "Ailyn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-08", "description": "Wanted to bring out of town guests to the food hall for a surprise birthday gathering and tried to make reservation at Fortina - unfortunately after SIX ATTEMPTS to make a reservation (2 in person / 2 over the phone and 2 via email) not a soul ever got back to me. Very disappointed in the unreliable service I received - even though 4 different people promised me that someone would get back to me... no one ever did. Ignoring a customer who is trying to bring you business is not a good business practice, get it together Fortina.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Unexpected location but great place - veggie plate and arugula salad were both delicious and great for sharing. Good bloody mary too!", "author": "Suzanne M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-14", "description": "Just left and this is a nice spot. Our waiter Megan was sweet, professional and did her job at the highest capacity considering they were short staffed. We ordered the pizza with bacon which was cool, it was over done with the pork. We ordered the chicken parmesan, which was eh to me, I've had better. The minor cons, they ran out of vodka by 8 pm, we asked for a specific drink that didn't come but we did eventually get it once another waiter passed by. We had orginally cancelled the chicken parmesan but it still came out which we ended up eating anyway once another friend came to meet us. The manager a nice lady asked our opinion and we explained what happened and she compt us for the drink and chicken parmesan. She was so sweet she gave us a free sample of banana pudding which was good. I would definitely come back here again to try some other stuff. Nice clean decor, the tables are cleaned off promptly once a party leaves and it's spacious.", "author": "T H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "I have to say I was very impressed with this place! I have been to the other locations but being a Yonkers native I had to check this out! Obviously the food was amazing which was expected. But I was extremely impressed by the quality of service. Each waiter had more personality than the next and even though the restaurant just opened and was packed (on a Tuesday) you did not have to worry about being waited on! We even were accidentally given a free nutella pizza free of charge! This location had a very cool, open, Brooklyn type of vibe. I'm excited that Yonkers transformed an abandoned building and made it into something new and fresh! I think this will be a great thing for my city and I'm excited!", "author": "Angela R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "My wife and I had brunch at Fortina's today.  It was fantastic. The service was impeccable and the food was excellent, reasonable wait for the food, and the price very reasonable.  Deven was our waiter, he was very professional, attentive and courteous.  We had the wood-fired green peppers, fried meatballs and bacon, egg and cheese pizza - all were very very good. We will definitely return to Fortina.", "author": "Gregg B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-02", "description": "Bartendress scoops bare-handed the ice for cocktails + manager snubbed me away for mentioning it!  Suppose he trains her also to clear dirty glasses w fingers inside - - as well as (in stride) continue to use those same soiled fingers to handle (by the top rim) clean glasses?  The good arancini and pizza + somewhat interesting short wine list aren't enough to balance the offensively bad service faux pas.", "author": "Happy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "What a fantastic place.  I am a fan of their Armonk location, live in NJ and couldn't wait to try this location in Brooklyn.  Their Truffle Pizza is the best I've had.  The service is great and the attitudes of their staff is open, warm and friendly.  Can't wait to come back and bring friends!", "author": "L M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "I will start off by saying this is my first (and probably only) Yelp review. I came here with my Fiancé and another couple on, what we found out, was there opening night. Long story short after 90 minutes of drinking wine at the bar with the great bartender and constantly being greeted by the amazing staff and management - we received a piece of receipt paper with the word \"zero\" written on it. Not only did this place treat us to an amazing time, but they thanked us for sharing in there soft opening. I can't promise a free night out like we had, but this restaurant has an amazing atmosphere, delicious flat breads, and a great wine selection. I highly recommend it, as I will be going back to spend money they very much deserved.", "author": "Christopher D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "The pizzas are incredible but the pastas are truly among the best I've ever had, including in Italy. Also, don't miss the burrata or the bread pudding.", "author": "Matt F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Fortina - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nDekalb Market Hall", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MglAghHRvOzTHHyXJMlqVA/ls.jpg", "@type": "Restaurant", "telephone": "+19179479399"}