{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "My fiancé and I tried this spot out yesterday and really enjoyed everything we had. We were impressed that on a Saturday night there was happy hour and drink specials. Definitely a nice find. To start We tried the  meatballs and mozzarella sticks and both were really good. We also split a salad and a pizza and we were impressed. The servers were all really nice as well. We will definitely be back!", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "EXCEPTIONAL SERVICE!  Not only was the pizza a smash hit of flavors, it was our waiter Darren that hit it out of the park.  I want to give him specifically 10 stars for getting my 5 year old super excited with some pizza dough to knead with and sauce and cheese to make her own pizza.  He helped bring her over to watch where the pizza was put into the oven.  It was amazing.  Thanks so much for making our night a big big big win!  We left so full and happy!   We went in newcomers but leaving feeling like regulars which we will now be!!!!", "author": "Amy H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "After waiting for our food for over an hour we asked to speak to the manager.  The manager never came to our table, as result we cancelled our order and asked for the check.  It was extremely disappointing because my friends and I were looking forward to a great Italian meal, but we were unwilling to two hours for our meal.  While I cannot comment on the food, the customer service was horrible.", "author": "Shuaib S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "DO NOT BUY ALCOHOL HERE! The organization I work for rented out the whole restaurant for our Holiday party. The food was just okay at best and the drinks were okay as well until I saw one of the bartenders refilling a bottle of Absolute vodka with a clear liquid from a plastic pitcher. This practice in not only unethical, it is also illegal! Not only does it transfer contaminants its also a big slap in the face for the poor sap that's paying for premium liquor and getting whatever rock gut well liquor they are refilling the bottle with. I was so disgusted that I started looking for the female manager or owner that I had seen giving instructions only to see that she was a few feet away from this female bartender that was refilling the Absolute vodka bottle.  SHAME ON YOU FORTINA!", "author": "Jonn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Went to the Brooklyn location for my boyfriend's birthday. I must say I really , really enjoyed dinner. We had the rice balls in mushroom mayo, so freakin good! The pizza we shared was the fungus amungus as recommended by our server. Very tasty! Sangria was freakin awesome! I would love to come back and try more dishes . The service was great, very friendly staff, the manager came over to make sure we were ok. I couldn't ask for a better dining experience. We both had an excellent time. I will be coming back !", "author": "Meike O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-22", "description": "If only there was rating lower then 1 star . . . They really need to get it together here! The bartender who served me was very rude and distant, they served me a pizza with burnt parts. I heard the costumers next to me say they got the wrong recipe for the third time in a week, apparently this happens a lot. To top it all off, they are very uppity and thus push away young, fun crowds. \nIf you're going to act like a high end restaurant, visual appeal and all, I suggest you REALLY back it up with your costumer service and items.\n\nAnd what the hell is up with those emptied tomato cans. Sure, you can put your pizza on them, still doesn't make them any less useless and unappealing. The entire place is crawling with them.", "author": "Saron Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Really good food! Even better service. Everyone was super friendly, and was always available when we needed them. Even gave us a free Nutella pizza. Definitely recommend for a hang out with your friends.", "author": "Kristina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "So on a whim, my friend and I had dinner here. It looked promising and had a cool hipster like vibe without the annoying hipsters. The restaurant had good ambiance and they did a good job isolating you from the Dekalb Market. So yeah, nice atmosphere and great service. The servers were all excellent! Very attentive and friendly! We had at least four servers attend to us that night. It reminded me of the service I received at Hillstone-NYC. If you don't know, you better ask somebody. We started off with a Burrata appetizer. Let me tell you, this starter was to die for! The Burrata wasn't serve traditionally in it's skin rather it was layered over toast and was drizzled with a brown butter vino cotto that was just in a word, superb! For the main we both had the Pork Braciole. The pork was tender and glazed with a Sunday (secret) sauce over a bed of broccoli rabe. Delectable! I mean the whole experience for a whim was very rewarding! I highly recommend!", "author": "Miguel Á."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "With my Chef partner Ashley, she is the best. For my Mother's Day, she is consoling me today.", "author": "Chef Simone R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-20", "description": "Was a fan of the Fortina in Rye Brook but not here! Not the smartest employees. Ordered appetizers and they came out after our main dishes was already served. The waitress thought we wanted all the food at once. When the main dishes did come out, they made two of the same pasta dish instead of what I really ordered. While my family was all eating I had to wait about 20 mins just start eating my pasta. Definitely not coming back.", "author": "Matthew G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "My home away from home. Bartenders and all staff are really helpful and friendly. Atmosphere is great- modern industrial and food is usually spot-on. Fantastic wrap around bar is perfect for dining alone or with a friend. I highly recommend!", "author": "Bethany J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "I had an amazing time last night at Fortina with my friends. Even thou NYC is recovering from a snow storm the place was packed. Right off the bat the gentleman that seated us was super friendly. We chatted a little about stuff and just made me felt right at home. Then our server she was amazing too. Really liked the music and set up of the place. Drinks and dessert was the highlight for me -whisky sour was delicious. The main dinner food was ok only - had spicy meatball pizza, oven pasta. The chicken parm with steak fries was not bad thou. Really had a great experience overall and  would come back for the great hospitality but maybe just for a nightcap.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "I've had almost all of the pizzas at Fortina and each is great, but the Tendoroni (no relation to Bobby Brown) takes the crown. \n\nThe staff behind the bar (i.e. T and Shevy) are great - super helpful and friendly.\n\nWhat's keeping this from being 5 stars is the price. I think back to the O.T Genesis song, \"your price is way to high you need to cut it!\" The food is expensive such that I'd only go for special occasions, which somewhat conflicts with the vibe of the place is more of a casual/chill-out spot. They use to have a promotion that made it easier on the pockets to eat here more frequently, but that no longer exists.", "author": "One L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "I loved the pepperoni pizza I got. My friend got the lemon pasta and liked it. Our waiter was so nice. Overall, a great relaxing dining experience.", "author": "Christine P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "Was pleasantly surprised. We had roasted veg platter, onion pizza,\nveal meatballs with pasta, arugala salad, and all were very good.\nService was good, I liked the idea of placing card in holder to get\nservers attention. Will definetly return. Although there are a lot\nof dessert options at Dekalb market, we had the tartufo and it didnt\ndisappoint. Tip: If you shop at Trader Joes or Target and have a receipt \nthey will take 15% off bill.", "author": "helene k."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Currently my favorite Italian spot in Brooklyn.  Been going almost once a week for the great music and amazing food.  The veggie platter is delish along with classic spaghetti \u0026 meatballs.  Just go you won't regret it!", "author": "Camille M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Hands down the best pizza/ Italian food around here. Service impeccable, delicious pizzas, great drinks, amazing services, spacious, trendy and child friendly!! They have a great happy hour, i just wish they had more food items. Nevertheless, great restaurant. I came here twice on a Friday night with 2 toddlers. They were accommodating, i cannot stress enough the service, trust me you won't be disappointed. Its a hidden gem!! Highly recommend this place to anyone who appreciate good food, great services and space ( spacious).", "author": "lucy h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "What a great addition to the neighborhood. Awesome pizza, a lot of nice healthy veggie options, beautiful decor and awesome service. Look no further when in mood for Italian around Dekalb ave", "author": "Alona V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-01", "description": "This was a really disappointing experience. This was my second time here, the first time their service was great but they had just opened and since then, things have severely declined. We came in hopeful, great happy hour but when we ordered our food, the order didn't actually get sent through. The waiter realized his mistake and rectified it but an hour later, we were still waiting. Apologies by the waiter, but still, all the tables around us got their food and we still had nothing. We asked for the manager, she's a no show even though she looked over at us multiple times knowing we were waiting. Eventually the embarrassed waiter apologized again but we had our fill of the evasive manager and the long wait so we got the check. Even 15 minutes after we eventually got our bill and made our exit, the manager never came over. She was terrible and I hope they reconsider their staffing decisions. Too bad because the food is decent, I'm just not willing to wait 2 hours for it when there are literally multiple options outside of their door in the food court. Hard pass.", "author": "Rabia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "3 of us went here for dinner last night and we all enjoyed everything; baked ziti was amazing as was the spaghetti and meatballs. Cavatelli was good but I enjoyed the other 2 dishes better. We shared the brown butter bread pudding which is a must have! Wine special was a great deal at $7 a glass compared to $12 or $13. The only thing was that we had to ask if there was happy hour specials vs. being told upfront but other than that I can't say enough good about the place. I liked the glass the wine was in so I asked if I could purchase one and they gave me one wrapped in a cloth napkin in a takeout bag which was a great surprise and totally unexpected! I'm from out of town but Fortina will see me again for sure!", "author": "Donna F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Fortina - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nDekalb Market Hall", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MglAghHRvOzTHHyXJMlqVA/ls.jpg", "@type": "Restaurant", "telephone": "+19179479399"}