{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-24", "description": "Great location in downtown Brooklyn - in Dekalb Market. Came here for lunch a couple of times and happy hour drinks. Overall, service and food were good. \n\nLunch: When ready to place your order, put the card the service gives you up. Pizzas are good - have tried the margherita, pepperoni, mushroom and sausage with onion.s  Salad and wood-fired half chicken were good. Tomato and mozzarella was also good. \n\nDessert: tried an assortment of desserts...save room if you plan to have any.. my favorite - anything with coconut\n\nHappy Hour: $5 house wine and beer and special priced pizza and bites.  Good place for happy hour by the bar - not too loud so that you can carry a conversation. \n\nRestrooms - gender neutral.", "author": "Winny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "MATT AND JOSH... Mostly Matt because he stayed with us the whole night, suggested delicious items on the menu and made sure we liked everything including his \"Matt desert special.\" Which was too good, you need to try their deserts. \n-PLATES ARE LARGE PORTIONS \u0026 we loved that. \n\nMy cousin and I stoped at this spot to meet some buddies and eat some food. The Place looks\nawesome with a cozy welcoming vibe. \nListen to me closely... THE PIZZA IS BOMB- Tenderoni has that sweet chili sauce that left me salivating for 3 days. (Not exaggerating) \nPLEASE TRY THEIR PASTA! The Fusilli and the Pastaschiutto... I'm talking saucy, spicy, well balanced flavor. \nMEATS! The chicken parm \u0026 the roasted Bronzino! To. Die. For. \nThank you! We will be back to explore more of the menu. \"Be a candle not a flame\"- This one's for Matt.", "author": "Priscylla W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-26", "description": "I wanted to like this place.  2 stars is rounding up. First of all the place was not busy. Was greeted by the host a seated quickly. Someone (she said she was the floor manager) came by and explained the menu and the card on a sign post notification system for the wait staff. Can't they just be attentive?  Ordered my spaghetti and meatballs and a glass of wine. I wanted comfort food. My pasta came but no glass of wine. I told the delivery person I ordered a glass of wine. She looked startled, and repeated my selection to her so she could get it for me. She disappeared. Minutes later I then went to the nice guy host who said ask me for anything if l need it. I told him my problem and asked to see the manager. He thought I was going to follow him to see the manager. Don't restaurant mangers come to your table? He finally came to my table. Offered excuses of missing wine based on missing staff. I told him I would of ordered more wine if the first glass came out before the entree. I also said if this is busy, you're in trouble. \n\nThe food. Over cooked pasta. Looked like it was Franco American from a can!  The pasta was so cooked it had broken up into short lengths. They should look up al dente... But not to fear, they don't offer a twirling spoon anyway. The meatballs were more like rocks. Very dense, chewy on the sides and softer in the center. Would of been slightly better if both were not over cooked. Lots of nothing special sauce. I think the prep cook wanted to hide the appearance of the meat rocks. The white powder (cheese?) topping offered no discernible flavor or aroma. If I wasn't starving, I would of eaten much less. I wonder where else the people giving 5 stars to the food have eaten? Olive Garden?  Perhaps Juniors down the street. Maybe their pizzas are better? The menu mentions all of their entrees come from the wood oven. \n\nOverall this was bad. If the manager would of comped the late glass of wine, I would of ordered another. The food is another issue. I've had better pasta from many pizza slice places. I can only imagine what Gordon Ramsey would be saying.", "author": "Peter B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-17", "description": "This place was good but it wasn't memorable. The place is nice inside and the people were friendly but the food was just past mediocre. The system to flag a waiter or waitress is stupid. They make you put a card on this holder thing so that when it's on it the waiter knows to come to your table. The only thing with this is that you have to break your finger nails to try and place the card in the holder. I really didn't like this system at all. Also when they bring you your pies to the table instead of having pizza pie holders they place the pies on top of these huge tomato cans. My friend tried to get a slice from the pie and the pie fell over cause the cans can't hold the pies properly on top. For such a nice restaurant this is an extremely cheap method.\n\nWe ordered the pancetta pie, a marinara pie and a sausage pie The crust of the pies were good but the pies didn't really have any flavor. They needed more seasoning. The pies were also extremely small for the price ($20 a pie). My honest opinion was that this place was not bad but neither great. Try it and see how you like it.", "author": "Ozzy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "One of my favorite spots in the neighborhood! This is my second time coming here and was amazed once more. Last time I came for brunch and had the brunch pasta. This was so many months ago and I still think about that pasta to this day. Last night I shared the ziti and pizza and wow!! Definitely a fun affordable restaurant.", "author": "Carly G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-12", "description": "Disappointed with the pizza. Got a margarita pie which was missing cheese on almost half the pie. Just a few pieces of basil on one slice. Pizza tasted bland. Service was friendly.", "author": "Sally M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "The arugula salad was good. The broccoli rave was even better and both were perfect on the margherita pizza. Service was okay. They worked as a team, but we weren't informed that you had to put the card in the card holder to let them know you needed service; and the card was already in, so it really didn't make a difference. They had ran out of the wine that my family wanted $9 a glass and they opted for another suggestion$15 a glass. Not a problem, but after we had left the restaurant we saw all the specials and were kind of saddened that they did make us aware of any of the specials. So my suggestion is to have your team share the specials/promotions upon being seated.\nI will come back at happy hour with my Trader Joes receipt.\nThe spirit playlist was great.", "author": "Genie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-15", "description": "Finally, Fortina! I'd been wanting to try this place for so long and it did not disappoint. I had a lovely lunch consisting of a pizza with spicy honey, luscious pistachio cream brussel sprouts, and a pineapple faux-lada (fantastic cream soda concoction).\n\nService was fast and friendly, and my only complaint is that the crust was a bit overbaked. Otherwise, a great lunch/dinner spot conveniently located in DeKalb Market Hall. I'd return!", "author": "Yasmin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-23", "description": "After dining at Dekalb Market countless times, I finally made it to Fortina. This space is cavernous. Nevertheless, there were plenty of open tables last Saturday night. The waitstaff seems to pool tips as every time you need something, you put a card up on the table. My partner and I shared an arugula salad and pepperoni pie. The arugula salad was too lemony for my liking it and didn't merit the $15.50 price tag. The tenderoni pizza on the other hand was well worth $18. And the honey chili oil topping was a nice touch. Pinot noir was a great way to start the meal. Be sure to ask about happy hour because they offer specials on Saturday. My vino was $5!", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-14", "description": "I brought my parents here while they were visiting from out of town. Our server's name was Dana and she was AMAZING! She was very helpful in helping us figure out what to order from drinks to apps to dinner. We had a great time laughing and joking with her and our meal was delicious. I highly recommend the garlic bread (like a giant sesame bun cut in half and covered in cheesy goodness with marinara sauce for dipping). You also can't go wrong with any of the pizzas. I have also been here for cocktails at their bar and they were delicious. Both times I've visited we were able to be seated right away. I guess because people are coming to Dekalb Market for the vendors they overlook this restaurant, but I would definitely recommend. I also noticed there was a semi-private area with a large group seated at a very long table, so this place would be great for an occasion or celebration with a large party.", "author": "Allison L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "Pizza and wine for $15, yes. \n\nLunchtime here is awesome with pizza and wine. I been here a few times and have gotten whatever red wine (usually Pinot Noir) and the pepperoni pizza. Loved the wine and loved the pizza. I probably shouldn't tell you about this place because I don't want there to be any mad rushes for the lunch special but, the holidays are coming up and I'm feeling generous. You're welcome. \n\nSeriously though, great pizza, great customer service keeps me coming back!", "author": "Lissett L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-22", "description": "I'm so torn about Fortina, because most of the food is pretty good to great, but it is SUCH a pain each time I get food here.\n\nFirst and only experience dinning in Fortina, we had pasta dishes that were pretty good (Baked Ziti and Spaghetti). The wood-fired baby carrots were not good at all. Our server was really sweet and asked us why we didn't finish them. We told him it was mushy/overcooked, but we didn't want to complain about them. He came back with another order from the kitchen and he said he told them our complaints and had them remake it and it was just as mushy, so that's just how they do them I guess *shrug*. We've since ordered takeout a lot and THAT has been a huge up and down experience.\n\nFirst of all, the Ray's Original Pizza and Pizzeria salad is great, and that's what we've been reliably ordering from here. I try to avoid ordering online through an \"ordering service\", because they either overcharge (like Caviar, which is what Fortina uses), or they take a huge percentage from the restaurant. Possibly both. So I only order online if it's within house, otherwise I order over the phone. And Fortina is close enough that I feel fine walking over to pick up my order.\n\nOne time when I tried to order, I called and they literally never picked up. I tried multiple times, stayed on the phone for what felt like an hour (it was probably like 7 minutes or something), listening to the stupid pre-recorded message from the founder/owner (it was nice the first time, as time wore on, it became stupid because I CAN'T GET TO YOUR DELICIOUS FOOD). Subsequent times, they have picked up in a somewhat timely manner, but MY GOD do I hate hearing even a second of that message now.\n\nEvery time I go there to pick up, it has been an ordeal. The space is pretty large, and they don't have enough servers to fill the space, ever, it seems.\n\nOne time I went to pick up, and for some reason it took one of the waiters (the same waiter who helped us when we dined in) a long time to get us sorted out and paid. I think it was a busier night, so that's fine.\n\nAnother time we stood at the host stand for around 5 minutes, while never being addressed. The guys in the kitchen noticed us standing there, the bus boy too. In all that time, no one tried to grab a  host/hostess/waiter/bartender to come figure out if what we needed. We didn't get any attention until the crank pot started yelling about \"are we ever going to be helped here\". \n\nThe most recent time, the bus boy saw me at the host stand and told me to go get paid out at the bar. Which was the first time anyone ever told me to do so. And...am I supposed to be doing that now every time I go? There never seems to be a set method. After I paid with her, the bartender left the bar and I thought she was going to get the food (which I knew was ready because at least the kitchen seems to know what's up and always puts the food out in the same spot and I CAN SEE IT behind the Employees Only sign). But nope, she left and disappeared. I caught the bus boy again and said \"hey, that's my food, can you get it for me? I paid at the bar\". And he just looked lost as he was deciding whether or not he should grab someone to check or just check my receipt against what was on the counter. Honestly, by this point, I know how the kitchen packages our food. They even write my name on the box. Why do I know what's going on but your employees don't? WHY IS THERE NO ORDER FOR YOUR FOH??\n\nI just want to order and pay and get my pizza and get out of your hair. Why is it always a thing! =(", "author": "Melody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "I needed to go Brooklyn on a wimp and I had to stay Downtown. Due to a late arrival, there weren't a lot of options left for dinner. Luckily, there's always Yelp to guide me.\n\nAfter a bit of a search, I found Fortina in the Century 21 department store, in the basement next to Trader Joe's, in the market hall. A very nice intimate interior lures you in. Per usual, I sat at the bar where Danielle P greeted me.\nUnfortunately, there house draft kicked earlier but they still have a great bottle and can selection to choose from.\n\nAs an appetizer I went for the shisito peppers, my favorite when in Spain. These puppies were HUGE though compared to the tiny ones but didn't lack flavor.\n\nI really wanted a nice wood fired pizza and Fortina didn't disappoint with their Tendorino. It takes your  average pepperoni pizza to the next level with the drizzle of honey and ricotta cheese.\n\nAmazing experience overall for a budget-friendly dinner.", "author": "Tim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "I have been to Fortina since they first opened at City Point. We were there during the soft opening week on the second day. The food was ok, but REALLY salty, not at its best potential definitely. Then, there was a fire and they were closed for a few months (felt like forever.) After they opened again for the second time, I have been there 4 times and the food has IMPROVED for good. So happy for that! \n\nThe food is not salty anymore, there is more thought put into the menu choices (which are not many) but they have seasonal items with a fusion of ingredients that really spiced up the experience.\n\nThe staff has always been great, always very attentive, friendly, passionate, and talkative. If I'm not mistaken with the names, Liza, Alissa, Rachel, Coby, Anthony and another one I can't remember...they are very nice to us and always available for questions.\n\nThe music is so well picked, and the whole experience has became almost religious. Lol\n\nThey had so many good approaches to things. I like that they used old menus as doilies for hot plates, I love the names of their virgin beverages, I love their displays of cans on the table as a stand for pizza, I love that their garlic bread not only had garlic but cheese and it's actually like an actual pizza. \n\nI'm so glad that after the storm A.K.A the small fire, things changed for good. Thanks Fortina for being in the neighborhood.", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "Saturday night, came down here for a nice dinner before heading up for the movies. Decorated for a laid back atmosphere while serving home-style food.\n\nTo start off, ordered the Spicy Olives ($5.50). A large bowl of green olives smothered in olive oil and chili flakes. Good kick and was enough to hold us over for the entree to arrive. For pizza, shared the \"Charles Fungus\" ($17) - thin crust with mushrooms, egg yolk, garlic, and a little bit of cheese. Love the soft crust and the mushrooms. Wish there was more sauce and cheese (that's the American in me). To wash it all down, got the Victory Prima Pils ($9); easy bitter to pair with the food, yet definitely expensive for a canned beer.\n\nFriendly and quick service. Ambiance is good for conversation as everything is spaced out well. Probably your best option for eating in at the Dekalb Market.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "3/27 - first visit to Fortina and was definitely not disappointed.  This little place is great. Happy hour drinks and a quick bit to eat.  Friendly staff and great bartender we had Morgan this evening and he was great.", "author": "Amette N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-15", "description": "Nice meal overall. Pizza was pretty good, the one with chili honey was good but people in our group thought there was a little too much honey. Also like the one with sweet sausage and one with speck. Service was a little bumpy, was seated at a wonky table in corner without lighting, despite half-full restaurant however we were allowed to switch tables to a nicer bench seating. They also made the wrong salad but comped us an additional free salad (both Caesar and pizzeria salad were not anything special). The server was otherwise attentive and friendly. Regardless would come back. Price were fair relative to the area.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-22", "description": "Pizza is great here, service is the best. Price point isn't too high, and the atmosphere is comfortable for almost all occasions. \n\nStrongly recommend coming here for the combination of all the positive attributes above. The dough on this pizza is especially good. The toppings and the sauce is great as well, but the dough is truly something special. The pasta was also excellent, not the absolute best I've had, but was very good regardless. We tried the pepperoni pizza and the Fusilli pasta. Pepperoni pizza was quality with good cheese to sauce balance, but also had this spicy honey that elevated the taste. The Fusilli was a tomato meat base which expertly balanced the spicy salty flavors. Also, this place is perfect for getting a drink with your friends, taking out your family, or getting food on the go. The space is well used as it strategically divides the drinking and dining areas.\n\nAdditionally though, the service was top notch. Super attentive, and after waiting too long for our pizza, we didn't even need to call the waiter, he came up and was like \"let me check on your food, it shouldn't have taken this long\" which was already admirable. Turns out there was a mix up and the floor manager gave us compensation for the wait. This type of service is what the restaurant world needs!", "author": "Raymond F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Food: 4.0/5.0\nService: 3.5/5.0\nValue: 3.0/5.0\nDecor: 3.0/5.0\nOverall: 3.5/5.0\n\nLocated in the food hall in the basement of the [still sort of new] City Point mall in downtown Brooklyn.  I liked the food here much more than I was expecting, and it's kind of cool that it's sort of part of the food hall, in that it's a restaurant that opens into the rest of the hall.  Good option if you have a group.", "author": "Damian W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-01", "description": "I just ordered from Fortina - 5pm on a weekday - so not a very busy time.  The mozzarella sticks came with no sauce the chicken parm looked thrown in the box, the pizza has slid off to one side of the box and hardly had an sauce on it and they sent no bread. It simply looked like they took no pride in the order and slopped it together. The food was fine but not worth the way it showed up - half assed. I should also mention I live half a block so it did not have to travel far. I am disappointed with my order and won't be visiting or recommending this establishment again.  There's too many good pizza spots in New York that care about what they are putting out there.", "author": "cat k."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Fortina - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nDekalb Market Hall", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MglAghHRvOzTHHyXJMlqVA/ls.jpg", "@type": "Restaurant", "telephone": "+19179479399"}