{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-27", "description": "Service could be better. Had to ask 2x to get my drink and I didn't get water like the other tables. The ziti was ok but I wish bread came with it.", "author": "Arianna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "I just had a poor service experience at a nearby bbq stand in Dekalb Hall.. which reminded me to write this overdue review of AWESOME SERVICE I got from Fortina.\n\nI forget who our server was a few nights ago (black guy with a backwards hat) but he was on point.  He went above \u0026 beyond on everything.\n\nFood here was also delicious - the spicy pizza was my fave.\n\nWe will be back very soon to spend our hard earned money here again.  Love your venue!", "author": "Forrest C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "Good happy hour--$5 cold cut sliders, chicken parm sliders, garlic knots, House wine, some beers, etc. Make sure to bring a target or Trader Joe's receipt from the current month with you for 15% off your bill", "author": "Helery R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "Is loud music is a constant at all the Fortina's?!?  Otherwise this place deserves 5-stars.  Food and service is spot on and when the menu says you can text Uncle Louie if there's a problem they mean serious business!  Chicken parms and pizzas are the highlights here but wait the fried mozz and charred octopus brings the game up a notch!\n\nThanks for being here in BK!  Will be back!", "author": "Jj L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Loved this place and it's usually hard for me to like any food place considering I'm the pickiest person ever. I tried the chicken parmesan (which was delicious) I don't like tomatoes sauce so I opted to get the sauce on the side and i decided to try it and it was great because I used as much as I wanted to instead of the cooks drowning the food in sauce lol. It was like a giant nugget with cheese. As an appetizer, my table decided on a arugula salad. I personally, am not a salad person... I mean I can't eat grass for free outside, am I right??? Lol, jk jk. Anyways the arugula salad was finger licking good. The dressing was sadly a \"fortina only\" dressing meaning I can't buy it anywhere but it tasted like a simple lemon vinager honey dressing-- it was very light which is why it appealed to me so much. The service was great, the use this card up system where if u need something, you put your card up and they come by. Anyways, my party of 4 was seated quickly, and served just as fast.\n Everyone else loved their food as well. We ended up even taking things to go as the servings were pretty large(sharable even). \n\nThis is located in the DeKalb market and if u are able to sit and be seated it seems like a perfect lunch date. In addition, it seems like a perfect hangout spot by the bar as the ambiance and lighting was cute(?) Not sure how to explain. \n\nDefinitely returning though.", "author": "Iris P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-24", "description": "I've been here a couple times and the food is definitely good. Yesterday I came here with my mom and we ordered the watermelon salad, a margarita pizza, ravioli, and paccheri. I can guarantee the food was all delicious, but my only complaint is their lack of service. My mom and I noticed that people who had been seated after us were already eating their food as well as on their way paying for their checks and out the door. After I brought it up to their attention, they approached us and told me that they had some printing issues and the food would be out ASAP. Not sure how they didn't catch it especially with our waiter who had only max 3 tables, including ours. They apologized and tried to give us free drinks, but on an empty stomach, alcohol wasn't something I wanted at the moment. Food is good, but A bit disappointed.", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "We arrived here at 7:15pm with our little one. The waitress took our order and around 7:35 still no wine, or appetizer. 7:45pm and we asked several staff and we get our two wines that went accidentally first to the people behind us. We get our appetizer 5 minutes later and now someone gives us two appetizers on the house. It's 7:55 and we get 1 entree and then 8:15 the other one after we told them the other entree never came. We had to physically ask someone to get us the bill and I just don't know why it took us over and hour and 20 minutes to get done when we were there with our little baby to be in and out within 40 mins. So many sorrys but no explanation. I liked this place but I will NOT be back. Thanks for comping the wine and appetizer but seriously an explanation would have helped for repeatedly horrible service.", "author": "Namrata A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-03", "description": "I love Fortina in Armonk, but this place is nothing alike. Service is poor and the food tastes like nothing. Pizza Luigi Bianco and Pastachuto are both soooo disappointing!!! Pasta is definitely not fresh but some cheaply bought macaroni. Not coming back!!!", "author": "Anja L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-03", "description": "i don't usually write reviews, but...\n\n\n\nfood was great really yum yum\n\nservice was v bad we wait 1.5 hours 4 fod why we wait so long???????", "author": "Sri R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Fabulous pizza. Recommend the San Gennaro and the Tortino in particular. Low key environment and relaxed vibe but the music was too loud! Solid service from the staff, we enjoyed their system of flagging waiters.", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-08", "description": "I was cheated out of a steak\n\nThe chef made a mistake, they over cooked my steak (with another 3 from our 20+ party). The replacement would be out in 5 minutes, after 5 minutes another 5 minutes, and like this it went on. After about 45 minutes the steaks would be on the house. That's great (for my boss who's paying the bill)...\n\nAfter almost one hour of wait, my 16oz rib eye steak came out looking like a 6 oz steak.... people around me made fun of me: they said it looked more like a 8oz steak... that of course comparing with the 5th steak that was ordered over done and came out on time looking 3x bigger than ours...\n\nDon't take me wrong, it was a good tiny steak (priced at $48) Not sure how much I would've enjoyed what I ordered, but I guess we'll never know... \n\nThe take away is that if your company is having an outing steer clear from this place.", "author": "F M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-18", "description": "I found the food at Fortina to be mediocre. The arugula salad was somewhat soggy and the nuts had not been fully taken out of their shells, which was a shock to the teeth. Then I had the skate as an entree and found it to be very dry, although good in flavor. I asked for sauce and when they realized why I was asking, my dish was comped and we were given an appetizer on the house (mozzarella sticks were the best thing I ate there all night). I very much so appreciated their care and professionalism. It does seem, however, that they have many kinks to still work out in the food department.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "The Brooklyn location at Fortina is my new favorite!! Just a simple dinner of the Classic Margherita pizza and the Wood-Fired Cauliflower (highly recommend!!)  has me making this my go-to fast fun a delicious spot! Robbie and Katie stole the show! Amazing service and amazing food!", "author": "Katie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "I was surprised when they closed down and renovated so early after the first open - but it seems like the new layout accommodates larger parties better.\n\nThe large open concept is beautiful and the service is super friendly. The manager stopped by a few times to ensure everything was ok.\n\nWe ordered the pickled vegetables, arugula salad, charles fungi pizza, a house draft, and the iced tea mocktail.\n\nOverall, the food is delicious - but incredibly expensive. The pickled veggies portion was tiny for 6.50, the arugula salad could use some more cheese and mix-ins for $14.50, it was pretty much just a half bag of arugula (artfully dressed) - but the pizza. The pizza was small - but immaculate. The crust was perfectly seasoned, charred - everything. \n\nThere are so many pizza choices in this area - while I think this pizza is definitely top 2-3 - it might just be too pricey (understood DeKalb rent must be crazy) to become regulars.", "author": "Jaclyn V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-21", "description": "An interesting mix of reviews here but I'm going to have to side with the poor reviews. We were hopeful because the place has a fun vibe, but the food was quite disappointing. The waiters were nice, so that helped (though service overall was a bit on the slower side). \n- definitely can get better pizza elsewhere in NY\n- our cocktail was 95% ice \n- spaghetti was over cooked (eek!) but meatballs were good\n\nOverall, it's overpriced for mediocre food. If it wasn't for the kind waiters, this would be one star.", "author": "Joy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "Some of the best pizza and meatballs I've ever had! Great atmosphere, great happy hour, and an even better service. We had two of the nicest waitresses we've ever had in New York City! I would give it 6 stars if I could! Our waitress even called the next day to make sure we had an enjoyable time and to thank us for coming in, don't know where else you'll find such genuine hospitality in such a big city!", "author": "Stu M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "I was really impressed with how well seasoned the food was. Very high  quality organic meat. Both pasta dishes were al dente. Staff was helpful and attentive. White wine perfectly chill and delicious. We will definitely be back. Great bar scene too. I have to mention  ... the bathroom was immaculate.", "author": "B C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-03", "description": "Reservations 7:30pm. Party of 14. Pre-marathon carb-loading w/ half of the party from out of town. By 9:30 we didn't even get half of our food (certainly not any pastas) until we talked to a manager. Service was stunningly poor. We didn't even get so much as water until we asked for it about 45 minutes in, and kept having to ask for refills thereafter. There were missing or forgotten drink orders. At one point we had to clear out our own dishes, place them on the table next to us, and get new plates from the cart behind the table OURSELVES. Meanwhile there were parties who came after us, had their meals, and left before we did. We were better off going to Trader Joe's next door to get frozen meals. Save yourself the trouble, explore one of the other spots at Dekalb Hall because this place is pure TRASH.", "author": "Helen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Their food is so freaking good. Highly recommend this place for any occasion or if you are craving Italian food. Even though they didn't have Alfredo sauce on the menu they made it for me. Mohammed and Katie are awesome. Great service.", "author": "Avisha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Fortina has brought the same passion, fun and loving atmosphere from its original Westchester locations to Brooklyn. The food is phenomenal - fried meatballs, pizza, all the great Italian delicacies you'd normally associate with this type of establishment and better. It doesn't hurt that Fortina invites the masses to share and partake in their vision which is so evident in how they prepare and serve their food. \n\nI hosted a private party last night and the staff at Fortina made sure nothing fell through the cracks. They understand the importance of having returning, happy customers. I wholeheartedly recommend to anyone looking to have a fun night out without the pomp and circumstance of fine NYC dining to give Fortina a try.", "author": "Eric T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Fortina - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nDekalb Market Hall", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MglAghHRvOzTHHyXJMlqVA/ls.jpg", "@type": "Restaurant", "telephone": "+19179479399"}