{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-19", "description": "With the exception of pizza, I almost never dine out when it comes to Italian food.  I guess I never really crave it, plus it's a cuisine I feel like I can competently replicate, give or take, at home.  But recently, we had a relative in town who could probably eat pasta for breakfast, lunch, and dinner for the rest of her life and be perfectly content.  So I began bookmarking interesting sound Italian restaurants.  Then life being well... life, we wound up here.  To make a very long story short, it was convenient, so I sucked it up.  But it wasn't even close to my first choice:\n\nFirst, the Good:  \n\nArugula Salad: I typically avoid ordering green salads like this in restaurants.  To me, they're boring and the mark-up is ridiculous.  But I was outnumbered, and you know what?  I liked this salad's bright, zingy dressing.  Plus the star ingredient, baby arugula, had some unusually intense mustard flavor, leading me to think it was thoughtfully sourced.  The crunch and pop of sweetness from candied pistachios didn't hurt either.\n\nBeet Salad:  Another winner for its pretty combination of golden and red beets, and the surprising crunch of tiny poppy seeds.  I also got to try creamy, whipped Robiolina Cheese for the first time and it was a nice change from the standard Goat Cheese \u0026 Beets pairing.\n\nNow, the Pretty Good, however:\n\nPizza Margherita:  There's so much great pizza in Brooklyn right now, a Margherita has to essentially get up off the table and start bustin' some moves get my attention.  This didn't come close. It wasn't bad, though.  It's a bummer the crust was a bit soggy, and as a result, overly floppy.\n\nAnd the, It coulda been a Contender: \n\nMushroom Arancini:  The menu listed only vegetarian ingredients for these Rice Balls, but to me, they had a distinctively porky taste.   I even asked our server, who reassured us, there was no meat in them.  They were really, really salty too.  But they were fried perfectly, so definitely full of potential.\n\nAnd Finally, the Downright Bad:\n\nCheese Ravioli with Marinara:  This epitomized exactly why I tend to avoid eating Italian food at restaurants.  The Ravioli tasted like the generic frozen stuff you can buy at any supermarket. And the Marinara wasn't much better.  \n\nBottom Line: There are moments in life when even the most hardcore food obsessive has to compromise their standards for the greater good.  I  had to put on my big girl pants and do just that here.  Should you find yourself in the same predicament, stick with the Salads and Pizza, and you'll probably wind up with a halfway decent meal.", "author": "Yael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "This place is one of the few separate seating restaurants in Dekalb food hall, and definitely worth a visit. Stopped in with two other people for a bite. The staff here has to be some of the friendliest I've seen yet in NYC! We started with the house specialty pizza, split between the three of us- it was SO GOOD! Mom and my friend got pasta dishes for their mains, while I opted for two veggie dishes. My only gripe was I wish they had described the veggie dishes in a bit more detail on the menu- the roasted cauliflower was served in some kind of a tomato/pepper sauce with a bit of a kick to it. I probably would have still ordered it, but it just had me a bit confused when it showed up. The card system they have is pretty brilliant- it lets them know you need something without someone interrupting your meal 5x, or, completely ignoring you. We all left very full and very happy- excited to come back again sometime for their happy hour!", "author": "April H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-21", "description": "Wait staff is the best I have seen anywhere\nJosh, the manager was extremely accommodating - over the Christmas holidays we had family visiting from ages of 7 - 77.\nTwo had hearing issues and they set up our tables in a semi-private room so we wouldn't be so affected by the loud music.\nTwo had food allergies and they helped us find the right dishes \u0026 in some cases cooked dishes to accommodate.\nDrinks:  I like the \"Spritz\" the best.\nAppetizers:  the Fried Meatballs has 4 large meatballs \u0026 can be shared, or stand alone as a whole dish.\nDesserts:  the best Tortufo was the best I have ever had, including in Italy. Others loved the Apple dish.\nThe only issue there is the music is too loud to conduct a conversation.", "author": "Local And World T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Overall:\nVery good, trendy Italian restaurant located in Dekalb Market Hall, which is in the basement of City Point. Their food is very good and their drinks are nice and refreshing. Come here after shopping at Trader Joe's and/or Target and you get 10% off your bill with your receipt. \n\nDrinks:\nI always come here and get the Teana Turner with gin. It's like a citrus-y iced tea. It's good stuff. \n\nFood:\nI mostly come here for the pizza, but I want to start trying their pastas and other things like chicken parm. They're all supposed to be very good. \nOf the pizzas, I've had the Margherita, and the Pepperoni. \nThe Margherita is a classic, and it's made very well. Everything you expect out of a classic margherita pizza. Great crust, good sauce to cheese ratio, and nice basil on top. \nThe Pepperoni is interesting. It's definitely my favorite. It's basically pepperoni with burrata on pizza. It's awesome. I always get a side of their chili honey (it tastes pretty much like Mike's Hot Honey). This pizza is incredible. \nOne thing I haven't tried yet is their dessert menu, but I've heard great things about their bread pudding so stay tuned for an update. \n\nService:\nEveryone here is super nice and attentive. The kitchen once sent out a free small plate because the pizza was taking longer than usual. They did this without us even complaining or noticing that it was taking long at all. \n\nAtmosphere/ambiance:\nI love the vibe and decor of this place. It's kind of new-age rustic in that it's hipster but home-y. The open kitchen is great. It's in a basement, which puts them at a disadvantage in terms of making the place lively, but they really figured it out. It's super welcoming, the tables and chairs aren't bolted down so they shift them around sometimes to change up the dining room I believe. They put your pizzas on top of empty tomato sauce cans which I thought was great.", "author": "Jerry W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "I didn't notice this place the first few times I went to Dekalb Market, but it is definitely a hidden gem. I had the Luigi Bianco (burrata, robiolona, parmesan, black truffle) and it was just divine. 10/10 would order again. Thankfully we arrived just minutes before happy hour to order $5 drinks! They also have mocktails for those that can't drink alcohol but enjoy the taste of cocktails. They also gave us a few appetizers on the house because they apparently made a few extra dishes accidentally, which was very nice of them!\nStaff was very accommodating and pleasant. It can be hard serving a table of 10 but our guy did it well and didn't express any frustrations while tending to our individual needs and tastes. Not to mention the number of credit cards we handed him. \nThe ambience was very nice! They played some 90's songs that led us to reminisce of the past. Music wasn't too loud so we could enjoy it while still enjoying our conversation. Our table had a very nice backdrop of the entire restaurant which was lit very beautifully!", "author": "Anthony N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I looooooovvveeeeed the food here. The menu is simple but sooooo delicious. \nWe ordered the chicken parm with steak fries-oh my lord, it was one huge chicken patty-delicoous-fresh sauce, fresh mozzarella, basil-and it's not salty.  \nWe also ordered the baked ziti-best damn ziti I have ever had in my life (tops the one I had in Florence, Italy) it was absolutely perfect. Perfect amount cheese to sauce ratio. \nIf you are in the area, just come here-hunger is optional lol, once you smell how wondeful these dishes are, you will dig in.", "author": "Joujou N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "A nice sit down option in Dekalb Market. \n\nAfter wandering through the market, I decided that it was time to sit down. There was Fortina waiting in the dimly lit corner. \n\nThe place is really spacious for a basement setting, and the servers are very attentive. \n\nI went with the arancini for an app, and the All'amatriciana pizza as a meal. SO good. Nice, thick cut bacon and the cheese - mmmm. \n\nEssentially, a really solid spot for when you get tired of perusing the food hall.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-30", "description": "I was most impressed with the quick service. It was an atmosphere that allowed a break from the crowds. The pizza and beer were superb. It was very affordable.", "author": "Shelda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "This restaurant is close to my job just become one of my favorite spot. Staff always friendly and the food always on point. I ordered Beets salad with poppy seeds, whipped robiolona  that cheese was so creamy.. the sweetness of the beets mixed with the cheese was simply delightful. Also had Garlic Bread melted mozz, warm tomato sauce ummmm good. The bread was light toasted and the cheese perfectly melted was just \" Heaven \"\nAlso had Spaghetti with lemon , black pepper, pecorino, sesame was worried it was going to be lemone but it wasn't.. Next Time i will try pizza.", "author": "Sidee F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "Fortina is on of the sit down restaurants in Dekalb Market. It has a dimly lit Brooklyn, industrial vibe inside and a card system for calling over your server (you out a card on a metal holder). I have tried their pizza here twice and it is very consistent. I don't think it rivals that of Juliana's, Roberta's, or other Brooklyn staples, however in the downtown Brooklyn area it is a great spot ! \n\nThe sides of vegetables were a little small in my opinion (I also love vegetables more than the average person) but they give a 15% off discount if you have shopped at the Trader Joe's or Target at city point that same day. \n\nThe pizza crust is light and chewy and never burnt on the bottom. It has that distinguishing yeasty flavor that is often not found in New York style pizza compared to classic Napoleon pizza crust. The cheese is not too heavy and they use a very smooth sauce. There are a number of good options on the menu and it is very easy to customize an order.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Never have I been treated BETTER! came her for my birthday. Made the reservation for the polenta table. What an incredible show. Delicious. Do it for the gram. They were late with it but they made up for it with their great hospitality, drinks, and appetizer. Best birthday dinner ever.", "author": "Dennis V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Wholesome, well portioned, homemade Italian food nestled right next to Trader Joes. This establishment deserves to do way more business, but being hidden in plain sight likely doesn't do it any favors.\n\nI went here about two weeks ago on a lonesome Friday night and was happy with every aspect of this place. The pasta was perfectly prepared, neither too hard or too soft and the service made me feel welcomed and happy to be there.", "author": "Marco L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "This restaurant surprisingly was super romantic to be inside of the DeKalb market. The lighting is dim it's not too loud. My boyfriend and I went here for a date night and it was great. The food is served family style and it's pretty good portions. We had the chicken parmigiana ( it was big!) Pasta and some delicious wine. We were seated quickly and our waitress was very attentive. We will definitely be back!!", "author": "Doris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "Fortina\nNY BK Dekalb Market\n6pm Saturday 6th January 2018\nFour Stars\n\nFirst Review of 2018. Fortina is located in the City Point next to the Trader Joe's. The place has a nice open format. We sat in a wooden booth. The Server greeted us and told us all about the menu. We decided on Bone Marrow but unfortunately, they were out of a lot of things, so we ordered a Vegetable Platter ($21) for Two. It had squash, butternut squash, shishito peppers, eggplant, and cauliflower. Everything had a nice flavor and char to it.  There were three sauces: Gremolata, Walnut Cream, and Lemon Mayo.  We also had the San Gerrano Pizza.  The crust had a smoky char taste, the texture was chewy with slight cracker crisp.  The red sauce was simple canned tomato. The sweet sausage didn't have a sear.  The red peppers and onions added a sweet and textural difference. We also tried the chili honey which was more sweet than spicy. The service was good but sometimes felt a bit frantic around the service bar and kitchen. \"Hands\"", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Yum! Yum! And more Yum!!!!\n\nSo glad we stopped into this gem for a bite to eat. By the way, any place that has happy hour is a friend to me. But when you have a GREAT happy hour; we're basically besties! \n\nI ordered the \"original Mr.Rays\" pizza with red vino off the HH menu. Boyfriend ordered the chicken parm that came with your choice of either fries or side salad. If you order this you need to have a big appetite because it's huge. Or you can get the HH version that is chicken parm sliders for $5. You get 2. \n\nLet me just harp on the pizza dough - yes it was THAT good. Soft, slightly charred, reminded me of naan actually. I let the server know and he mentioned that his stepmom actually made the recipe. Yup. \n\nIf you are in the Dekalb Marketplace you should definitely add Fortina to the \"must eat here\" list. You're welcome in advance", "author": "Courtney R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-01", "description": "We were greeted by four different servers/hostess, so you could say that service was almost over-attentive. But I'd rather that vs. no attention at all. After asking what the most popular pizza choices are, we picked the white pizza and the pepperoni/hot honey versions. While I absolutely loved the pizza dough, and found myself tearing off JUST the crust of my last two slices, I thought their pizza was just ok. \n\nAmbiance-wise, I liked the atmosphere they have created and the cute way to flag a server using the card system.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-25", "description": "The pizza was pretty good, but the appetizers and pasta left something to be desired. The pizza crust is solid, very crispy with a good chew. The Tenderoni was a bit salty though, and the Charles Fungus was on the bland side. The fusili pasta and spaghetti and meatballs were ok but both came out lukewarm. Same with the appetizers, they came out fast but lukewarm.\n\nYes, the music is loud, so don't plan on lots of conversation unless you want to scream. And for such a big space, they really pack in the tables and it's hard to find a walking path when leaving.", "author": "Diane Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "If you want to feel cozy and at home in the city and feel welcomed by servers who don't hover because you're happy and chillin and you want to add pizza to the equation.... than This is the spot you want. The service, food and drinks are great. If. You. Love. Wine. Their wine selection is well thought out so please have their Chardonnay. oh and they also play familiar movies in the background of your familiar conversations.", "author": "Keisha R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-04", "description": "Went once last year and service was poor and food took forever. When the food eventually arrived, it was overly salty but otherwise lacking in flavor. Last week, we were craving pizza and thought we'd give Fortina another try - this time by taking out. So we called, placed our order (I think with a Katie or Kendall) and were told the food would be ready for pickup in 25-30 minutes. We arrive about 30 mins later and the maitre d informs us that the food will take around 5 more minutes and to have a seat inside while we wait. 10 minutes later, another staff member who was managing the tickets asks why I'm there and tells me he doesn't have my order. He asks me where I called and said I should call this person again to check. No apology, no taking on of responsibility for their mess up, no effort to expedite my order. Not wanting to wait another 45 minutes for pizza, we walked out and are never going back.", "author": "EY T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "This is officially my new favorite restaurant in Brooklyn, maybe all of NYC! \n\nMy friend and I went to check out the whole City Point Food Market for dinner and saw that Fortina was now open. The menu looked amazing, and the space was so warm and inviting, so we gave it a shot. And it exceeded all our expectations!\n\nWe were seated at one of the awesome oversized booths near the pizza ovens, pretty much the best table in the place. We started with two glasses of chilled prosecco and an order of the Garlic Bread which is served fully topped with mozzarella and a side of tomato sauce for dipping. This absolutely blew me away...best Garlic Bread EVER! \n\nThen we opted for two pasta dishes. Though the whole menu is designed for sharing, my friend and I have very different tastes, so we opted for our own entrees. I tried the Lemon Spaghetti with an addition of Black Truffel on top. I go overboard sometimes like that. It was delicious and just way too big for one person. Leftovers tonight! My friend for the Ravioli and was so happy with her choice. \n\nFor dessert, our amazing server, Megan, brought over some cookies and cream gelato that was so smooth and delicious. \n\nI cannot wait to go back!", "author": "Krista J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Fortina - Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nDekalb Market Hall", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MglAghHRvOzTHHyXJMlqVA/ls.jpg", "@type": "Restaurant", "telephone": "+19179479399"}