{"aggregateRating": {"reviewCount": 18, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "Had a terrific egg sandwich wrap here this morning. Great coffee too. Wrap ingredients very fresh. On the side after preparing my egg wrap, guy was in the final stages of making fresh mozzarella- he says cheese curds acquires from a company in Jersey. Very clean place, a few small tables and also very importantly a great value. Try it!", "author": "Chris W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "This fast casual sandwich shop literally saved the day!  My girlfriend and I were navigating a challenging move from NYC to BK and were in desperate need of food come lunchtime.  With the help of Yelp, we managed to discover some delicious eats.  All of the ingredients are fresh and high quality (including the bread).  And you cannot beat the price... \n\nTo be honest, I was also shocked to be able to purchase a six pack of Sam Adams for under $11 at the local convenience store...but that's a story for another day.\n\nThanks Sanpanino!", "author": "Matt M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "I am so glad they were feeling adventurous and stayed open a little late tonight, because this place makes a fantastic sandwich! Making choices hungry is a terrible thing but the friendly staff welcomed my arrival with the best smiles  they patiently made my sandwich to order and I had the presses lightly to activate the goodness of the home made focaccia.  I ended up having a number 8 with mozzarella and onions   amazing. I'll be back.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "Sanpanino opened their second location! This one is a bit tiny, but they pack a punch. Tons of sandwich options, soups, breakfast specials, and a coffee bar!\n\nI went with their half sandwich and soup special. Got the #9 (Forte e Dolce with hot and sweet coppa, provolone, and peppers). It was really good. Something about fresh cold cuts gets me every time. With that, I had a side of their chicken noodle soup, which was great for the weather, but not extraordinary. Good portion size though.\n\nOwner is a super nice guy.\n\nNote that they don't have a bathroom though!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "Where has this little gem been hiding all my life!!!!!????? \n\nThis spot opened recently, I know there's one in Manhattan but this is just what downtown Brooklyn needed. A legit deliciously yummy sandwich spot. You can not compare what they have to offer and the quality of their food with anywhere else in the vicinity. \n\nThis is the holy grail of real quality sandwiches. We had the #2 and #11 and can't wait to come back to try more. You can also build your own sandwich if you want as well. \nFinally a lunch spot worth repeating. \n\nIt's new and immaculately clean. The staff is fantastic and friendly. A must try!", "author": "Chre G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "The perfect Italian meats and cheese to satisfy my appetite on a beautiful day bike-riding through Brooklyn! Just sat on the bench outside and enjoyed!", "author": "Christina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "I know Sanpanino from West Village and I was pleasantly surprised when I saw them in Brooklyn. They are tucked in the street and not very visible but if you go there the guys are great. Sandwiches are delicious. They also offer salads. I ordered the Mediterranean panini and while I was chatting with Leo he offered me a fresh squeezed lemonade. I took their menus to the office. You have to try the focaccia! Cheerio!!!", "author": "Meline V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "It's great to have a neighborhood sandwich shop, which serves all sorts of sandwiches with cured Italian meats. Moreover, the ingredients are fresh and the long list of different kinds of sandwiches leaves ample room for a picky eater. \n\nMy one complaint? It's not open in the evening, so it's not a place I can go to for dinner!", "author": "Jon E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-21", "description": "I've been enjoying Sanpanino since they've opened. I love the fresh ingredients in their sandwiches (the mozzarella specifically is a favorite), the breakfast menu is pretty good as is the soup (I've been obsessing over the split pea). The spot itself is tiny, bright, and clean, just how I like my restaurants. My few complaints are not food or service related, I'm just picky. Like I saw that there's a check-in offer for a free coffee if you check in on Yelp. Great I did it, but the guy at the register had no idea what I was talking about and it was kind of awkward having to explain it over and over so I just paid for the coffee and moved on. Another time I went to pay with my phone (I'm all about Samsung Pay these days) and again they had no idea how to process this type of payment. I've paid with my phone here multiple times before but I guess not everyone is trained so I had to pull out my wallet and search for the credit card. Not a big deal, and definitely not something that would keep me from purchasing sandwiches here in the future but something I hope they'll fix going forward.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-31", "description": "Was very excited to see Sanpanino open just down the block from me. I have been craving a fresher sandwich than what the deli could make. \n\nI made my own: roast beef, mozzarella, tomato, basil on semolina - one of my favorite breads. Most of the ingredients tasted fresh but the bread was most definitely not, which kind of ruined the sandwich as it was pretty tough the rip and chew. \n\nI still think there is potential here and would try something else but was disappointed that a shop focused on fresh ingredients was using stale bread.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "We were looking for somewhere comfortable and easy to begin our Sunday - this was certainly the place. Incredible breakfast sandwiches, freshly squeezed orange juice, good coffee and wonderful service made this a perfect find!  This spot was nice and clean and a short walk from our room at The Hilton. We will always hit this place up!", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-15", "description": "tl;dr; Off to a bad start but let's hope they pull it together because there is potential. \n\nIt's hard to give this place three stars since they just opened. I think there is a lot of potential here but overall this was subpar compared to other sandwich places in the area. Ingredients were good, sandwhich concepts were good, but the sandwich itself was just thrown haphazardly together. The dressing was not spread evenly on both sandwiches. One part of the Italian sandwhich had very thick cheese and the other side barely any. Overall poorly constructed. We ordered the sanclassico and the roast beef. Delivery was fast and the guy was really nice.", "author": "Timothy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-07", "description": "This place has amazing sandwiches, they toast them upon request. What a hidden gem. There's lots of options for veggie sandwiches as well. I added fresh mozzarella to mine- and it was delicious!", "author": "Sara A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "I accidentally ordered pick-up at the Manhattan location and they were so nice about it! They made a quick call and were able to make my sandwich super quick. I ordered the meatball sandwich with fresh mozzarella, which is only available on Wednesdays, and it was delicious. Will definitely be returning, as I work nearby :)", "author": "Brianna J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-27", "description": "So disappointed. I was excited to get a new sandwich shop in the neighborhood.\n\nThe sandwich was very bland and nothing better than a corner deli could make.\n\nAlso the chips I got were completely stale. Ick how old does a bag of chips have to be to be soggy. Grossed me out and made me think this place is not clean.", "author": "Bridget S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Stopped by for a breakfast sandwich, got the speck \u0026 eggs. Awesome sandwich, great flavor. I usually add ketchup to my egg sandwiches but this one didn't need any. Will definitely come back :)", "author": "Ryan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Oh my! I cannot believe that there is actually someone who can make such a great tuna sandwich. They managed to make the bread light and very crispy outside, and the tuna salad moist, but not overly moist with extremely light mayo! And the bread was not soaked wet by the tuna salad!", "author": "Joy Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "This place just opened and it is a welcomed addition to the neighborhood. The people are very nice and efficient. The food is delicious and obviously freshly made. We had the pressed mozzarella and it was crispy and delicious. The cheese is made in house and maintained the fresh mozzarella consistency and was not rendered rubbery by the press. Previously we had the vegetarian panini and it was also obviously very fresh and delicious. We will definitely go back.", "author": "D R."}], "servesCuisine": "Sandwiches", "priceRange": null, "name": "Sanpanino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "187 State St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/XDm5dj-tvMAucJH6cTUpfQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185763803"}