{"aggregateRating": {"reviewCount": 117, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "Nice ambiance and friendly waiter. However, at a place like this that prides on its French style, I was disappointed to see cold little butter cubes and jelly from a squeeze pack. Common....", "author": "Uday S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-16", "description": "What can I say? I just tried to buy a Cobb sandwich to go. I was told the only thing I could get to go was the few (not Cobb) wrapped sandwiches left in a basket. But I could sit down and order one. I asked if I sat and ordered, could I get it to go? No. And it was empty. One guy getting a drink.  Epic fail. Why post a \"to go\" menu if the only thing to go is what is left sitting on the shelf.", "author": "Ruth P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-25", "description": "While I applaud the ambience, the design and the baked goods, I have frequently been disappointed with the service or rather its lack.  Seems to be short staffed and there is typically no follow up once the order is served.  And, at such a high end spot I was not happy to get steam table held scrambled eggs rather than an individually made order, and they were cold!  The accompanying whole wheat \"toast\" is strips of what--cracker?  And, I had to ask for butter and jam.", "author": "Brian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Azib makes the best mocha ever and she is so nice and friendly. Generally I have had great experience with people working there, plus, they have the best croissants and baguettes.", "author": "Jasmine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "I swear I live here...awesome services I've personally visited there paris location I go to Tribeca location regularly now that I moved to Clinton hill I will be visiting the Brooklyn location more often  everything is fresh well made and delightful", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "After having enjoyed Maison Kayser in Paris last year, I was excited to find one opening just blocks from our apartment in Brooklyn Heights! And today we once again enjoyed their delicious almond croissants, which along with their chocolate croissants are all we've ever had at the Brooklyn location. But they are so good as to be worth the trip just for them! And far less expensive than a flight to Paris!", "author": "Rick E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Love everything at this place. Favorite pastries are the financiers, which have just enough chewy bite to the outside, incredibly moist on the inside.   All of the hot food is delicious and it's a quiet gem in the neighborhood.", "author": "Navin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "This place has the worst service I have ever experienced. The slow service plus nasty attitude of the servers make this place the worst place to eat in NYC.", "author": "Lee Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "Terrific baguettes, including dark grain and seeded varieties that go very well with cheese.  Had a pistachio cake that was also excellent.  Hope they bring back that pistachio cake.", "author": "Randy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Amazing. I don't think I've gotten one thing here that I was disappointed by. Chocolate mousse - decadent; pain chocolat - yes; plié au chocolate - YAS!; the elephant ear pastry, the cakes, the breads. It is funny that this bakery is surrounded by an Equinox, Soul Cycle, and Yoga Works. Talk about burning calories and then gaining them right back. ....Worth it!", "author": "Rachel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "Nice interior, very clean. I enjoyed my iced mocha, didn't try any meals or desserts, but they looked delicious. The staff was very friendly and attentive. One in particular was an absolute sweetheart! Next I am in Brooklyn, I will try their menu and update!", "author": "Angel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Great food and good service.  Yes it's a bit spendy,  but it's priced pretty much as you would expect for a high end bakery and restaurant.  Between this place and LPQ, this place is better on every count.  I'll be back for sure, though probably not every day - just every time I want something wonderful!", "author": "Eric S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-27", "description": "I usually love MK. The Parisian vibes, the amazing pastries, etc.. but the past few times I've come back to this location for a cappuccino, they have been sub par- watered down espresso, luke warm milk, etc. It's easy to see that most of the baristas, while very nice, have not been trained. That is fine if I'm going to the deli, but if I'm paying $5.17 for a cappuccino, it better be excellent.", "author": "Sally S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "So good. Literally the best almond croissant I have ever eaten. Service was pleasant and they gave free packets of jam and even Nutella if you ask! One star is off for the high price- I did not buy any of the savory items, but many seem way overpriced- $7 for a cup of potato salad?!", "author": "Nancy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "I would love to give Kayser 5 stars, but feel it would be unfair as I've only ever tried their bread. However, every baguette and loaf has been beyond exceptional and I pretty much only go to Kayser when I am in need of some. I spent a year living in Paris recently, and beyond Balthazar's bakery, No baguette could measure up to those I ate there, until I tried Kaysers.", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-23", "description": "Terrible service. Dining solo at 9:05 am. Only 11 tables occupied. (25%?). Took 15 minutes to order a coffee and a pastry. Took another 10 minutes for pastry to arrive cold and coffee to arrive spilled over into saucer.  This place is good for takeaway but a very rude dining experience.  Several other tables suffered from slow service too. Only one who got fast service just ordered from the bus boy who served her before others. Path", "author": "Ben P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-21", "description": "4 stars just on the baguettes alone. It is like eating chewing gum wrapped in a shell of corn flakes.  \n\nWhile it doesn't always have the imposing crunch of those made by its Parisian competitors, like Djibril Bodian's bakery in the Montmartre district, (baking in France is a blood sport, to be fair) ; Maison Kayser's baguettes are by far - the best I've had in New York.", "author": "crownlfc c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Best baguette in the city! Bring it on, brioche, any bread, palmier, chocolate Financier... Please give me more! It is incredible quality and we are lucky to have it in the neighborhood. Their orange juice is just amazing.", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "The baguette gets 5 star!!! And the President butter for Normady, Nutella and jam. So delicious. The brunch is also very tasty. The dinner is a bit pricey but it is BYOB!!!", "author": "Sarah O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "The bread took us back to Paris.  And the Crouque Madame was as good as any we have had.  Pastries are delicious. They just need to serve wine.", "author": "Michael L."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Maison Kayser", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNv83FtiCxojncpZ_Z_4Kg/ls.jpg", "@type": "Restaurant", "telephone": "+17182549600"}