{"aggregateRating": {"reviewCount": 117, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "The baked good are amazing. Even a plain loaf of bread is extraordinary. \nUnfortunately the people behind the counter are really badly behaved. I came in here on a nice Saturday afternoon and the counter staff were yelling across the room about who had taken too many bathroom breaks and ending every other sentence with the words \"and sh*t\". I would expect this at McDonald's but at a place where the food is this good (and pricey) maybe the staff can show a little bit of manners, especially around kids.", "author": "Ali G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "So I decided to go to the movies today. That was great. And as I am walking home I decide to stop by one of the best places for bread I've been-- first time was in the city near Central: Maison Kayser. I get my white chocolate bread, which by the way is so BOMB and as I'm leaving again make the decision to sit in for dinner. I was quickly seated and offered something to drink. The waiter, Amina, was super sweet and was really attentive. I had the Tartin de Crabe-- which is an open faced crab sandwich with sliced avocado and guacamole. So amazing. And as a drink choice, I had the Chocolat Chaud(Hot Chocolate). Let me tell you, the DECADENCE. No complaints at all-- I had an amazing experience and I WILL be coming back. OH. And the BREAD. *woot woot* You'll enjoy this place guys. As always... Happy Eating-- Marie-Madeleine.", "author": "Marie-Madeleine G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-10", "description": "The coffee and pastry here is very, very good. I continue to go here because their cold brew tastes much better than anywhere else in the neighborhood.  My main complaint (and I really hope management is reading this because I would like to continue drinking coffee here) is the service.  On weekday mornings this place is a mess, with one person taking orders and making drinks. Suggestion! Have someone at the register and another making drinks. It will make your customers AND employees much happier.\n\nUpdate that service here has reverted to disaster", "author": "Jonathan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "They have the bakery up front and the sit down cafe in the back. The lady was super nice though and let us sit at one of the tables to have out dessert as they were not busy at thetime. The mocaccina cake and raspberry tart were a good combo to have together, pricy of course. Will be back to try some of the other options !", "author": "Ron W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-24", "description": "Get it together! For a place that has hands-down the best baguette in Brooklyn the service, the condition of the space and the overall vibe has got to be the worst in the heights. I keep coming back, ever since they opened, hoping that things have changed. They seem to have zero management. There is typically one waiter working a huge room. The waiters make the drinks, cut the bread, take the orders, and bus. Everybody is waiting for a coffee, a check, or just plain attention. Today I had the french onion soup - cheese gloppy, wet and sank to the bottom and there was an oil slick on top that made my stomach turn. We also ordered a quiche lorraine - crust was soggy, not hot, and there was nary a bit of ham. Today was my last visit.", "author": "KC B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "I was never one for bread until I discoverd this place. My Croatian roots immediately drew me to the FIG bread which is divine. The tumeric bread called out to me next. Then there's the cheese bread which I can never buy again because I ate the whole thing by myself as soon as I got home. The staff sometimes puts out samples of their pastries. Let me say, I still haven't had one bad pastry there. I don't know if there's crack in their apple strudel but that is the best strudel I ever ate in my life--and I know baked goods. Bravo!", "author": "Vesna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Awesome bakery!\n\nI've tried two items there and they both were very tasty: not too sugary, not too dry, just the perfect desert", "author": "Ivan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-06", "description": "Love the selection of small rolls offered by this bakery. Their baguettes are yummy too. The coffee is overpriced for the lack of selection in flavor a but good overall.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-05", "description": "The desserts and the food are pretty good. The coffee is very good but the service is really lacking. I had to ask for water, utensils, napkins and where my food was after I asked for the egg to be slightly more cooked. I'm typically a patient person but it took more than ten minutes for it to be brought back and it was cold! And it was also a challenge to get the waitstaff's attention. Recommend for a grab and go.", "author": "Beatriz R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-10", "description": "ok, been here and to the other locations... honestly don't get the hype?\n\ni have considerably better croissants and patisserie in my neighborhood\nand definitely better coffee.\n\nit's clean, service is good, and coffee is ok, but I'm sure one can find better options if one puts in a little bit of effort", "author": "Abul R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "This is a good place in the neighborhood to have a nice sit down breakfast.  Went there on a holiday Monday. The place was quiet with 2-3 groups of people. Our server was very attentive and pleasant. She checked on us often, refilling coffee and cleared used dishes. I had Oeuf Poché Piperade which was really delicious. And their coffee was pretty good.", "author": "Nean S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "Chose the most famous Croissant Aux Amandes and Eclair Pistachio. Both were a little bit too sweet for me but I am not that into sweetness. The look of croissant was a bit surprising and the chestnut inside was good. The filling of Eclair was cream I guess so it didn't taste much pistachio for me. Staff was friendly as he filled water a couple of times.", "author": "Yikai L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-06", "description": "If zero stars was an option that is exactly what they would get! I was on the phone with my sister during her entire visit this afternoon. First, the waiter was very rude, she asked if she could change her seat (it was not busy) and was told abruptly no. Then while eating her salad she found a hair that was 2 inches long in it!!! She was given a weak apology. There was no offer of another meal, pastry or even to comp her coffee!!! She was so upset that she left. Such poor customer service from the manager and disgusting filthy food! No telling what else is in their food! I told my sister to never go there again. They do not deserve her business! I will be contacting the NY health department as well.", "author": "Yvette H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-09", "description": "Rating is for the in-dine service otherwise rating for the bakery is 5 stars!  As a fan of the bakery in the front of the store, we decided on Mother's day to try out the dine-in service and oh my were we terribly disappointed with the poor poor service we received that day  The business has been opened for only 5 months now and I do hope they survive because certainly we will not be back for the dine-in nightmare.  \n\nFirst let's start with the hostess, she sits us all the way back of the restaurant - next to the bathroom and kitchen area!  I kindly requested we sit away from that cozy area and sit somewhere in the middle which the hostess obliged.  Strike 1.  \n\nOur waiter who to his own defense was serving 1/2 the restaurant by himself on Mother's Day brunch could have made easily a lot of coin that day decided to...not work.  He didn't know the soup du jour when asked are you serious?!?  I ordered iced coffee and he didn't offer me milk ?!?  come on, man! When the food came out, he didn't once stop over to see if everything was okay Come on, brother!  Strike 2!\n\nBus boys you are not excluded either.  I asked for cracked pepper for my salad and the answer is not check with your server?!?  Bus boy, my water glass should always be refilled not when you feel like it!  Strike 3!\n\nIt gets better I saved the best for last, store manager you 20-something twerp who snapped at my wife when clearly we weren't talking you but trying to get the attention our nice waiter.  Shouldn't be hanging with her free-loading friends in the next table not far from our view! Strike 4!\n\nWe were not alone throughout our whole meal, we saw a family father struggling with our waiter to get his check and when he finally did he put out his credit card straight away.  In the other table, a meal had to be returned to the kitchen with a very long hair strand...disgusting!   \n\nPerfect candidate for the Mystery Diner!  To the owners:  There is definitely something wrong here and its totally deeper than you think.", "author": "Jj L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "Adorable little spot. \n\nGreat spot for overpriced pastries :) They have loads of options and they are all delicious. The place is impeccably clean and beautiful. Great for a spot by with a friend or two.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "Skip it. The service is horrible. Many other places in the neighborhood to get a decent breakfast.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-19", "description": "I thought the pastries had a weird after taste.\n Not a fan. \nNothing purchased gave me a wow factor.\n 2 Stars because its spacious", "author": "Ray-Ray M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-29", "description": "My review is mixed. I love the pastry and bread takeout counter, and while it seems that the staff is still getting used to their jobs, they are indeed apologetic and friendly when things take longer than expected. The selection, albeit expensive (pastries generally start at $4), is beautiful and delicious, including multiple flavors of financiers! \n\nThe takeout coffee counter is a completely different story as far as service is concerned. As others have noted, the coffee is also expensive (almost $4 for a large drip) and the staff who work there on weekday mornings is at best apathetic. I stopped by for my fourth time today to pick up a take out coffee and for the fourth time, the woman who was at the coffee counter was definitely more interested in checking her phone than she was in helping me. She also doesn't listen well, and if you ask questions, immediately seems irritated. That aside, the takeout coffee while expensive, is good.\n\nI also have tried the sit down service for weekend brunch. I was willing to overlook the roughness of the service based on the fact that it is a pretty new business, but more difficult to ignore was the mediocre food. I paid around $15 for a ham and egg dish that had lukewarm scrambled eggs served with a too large serving of cold and somewhat greasy ham. For our coffees, my brunch companion and I had to keep asking the waitress to bring milk -- we had to ask again when she refilled our cups. The bread that accompanied our brunch dishes was so so and tasted a little stale because it was sliced, which is disappointing considering how excellent their bread can be.\n\nOverall I am happy that this place has come to my neighborhood as it increases the options for excellent bread and pastries-but even though I live literally around the corner, I will be selective about when I want to visit based on the high prices, and inconsistent service.", "author": "Jen Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Just when you think the area is completely saturated with bakeries and artisinal coffee shops, Maison Kayser rolls in and shows us what French pastries are really supposed to taste like. It's a chain and therefore formulaic but hey it works. The croissants are amazing. Watching the bakers bake behind a glass wall is mesmerizing. And there's a huge sit down area with lovely staff who don't seem to mind the weekend early morning rush of parents with their toddlers.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Maison Kayser serves and presents excellent desserts and baked goods which is what it is designed to do. The salads and other savory items are so-so, but with desserts such as the Adagio and the Raspberry Tart, this chain is easily one of the best bakeries in my neighborhood.", "author": "Lula B."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Maison Kayser", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNv83FtiCxojncpZ_Z_4Kg/ls.jpg", "@type": "Restaurant", "telephone": "+17182549600"}