{"aggregateRating": {"reviewCount": 117, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-25", "description": "Seriously the slowest service ever. Had to ask for water from the guy who wasn't our waiter who brought our food. AFTER food arrived, our drinks came - coffee. Not that difficult I don't think. Just plain black coffee, no macchiato with soy blah blah blah. Had to then ask for check. Not a good place if you are trying to grab a quick bite.", "author": "Joy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-06", "description": "-- Bakery is magnifique ! \n\nThis is the  best french bakery in the area, which says a lot, when see how many there are in on Atlantic ave, Court St and Smith St... hands down the best Plié au Chocolat !\n\n-- The Service is comme ci comme ça . :(\n\nFor the first few weeks after the Brooklyn grand opening it was great, especially at the bakery counter. Really nice folks.\n\nBut recently it has become difficult to get anyone's attention when you walk in, especially at the coffee station. Today I had to say \"hello\" three times just to interrupt the baristas who were talking to each other with their backs to customers. No \"excuse me\" or even a \"thank you\" when I received my high priced coffee.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "The staff here were either still getting used to their jobs or getting used to what the braed of the month was, because it took a while of back \u0026 forth to get the Dark Chocolate \u0026 Ginger loaf I was looking for, but they were apologetic and friendly. Wish it was studded with more of both, or at least either, but satisfying nonetheless, albeit for $4.95. Bit of a confusing line situation for every customer there, but a nice addition to the neighborhood.", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "I've only tried the almond croissants and they're Delish. Always fresh and always tasty. I could hardly be in the neighborhood without stopping by. Try the chocolate almond croissant. Its my fav.", "author": "Nathline C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "Stopped in for breakfast mid week at 7am. Not a sole inside the restaurant except me in the seated section. Ordered an americano and a chocolate croissant. Both were very good but not excellent. Service was very quick and pleasant. The rest of the breakfast menus had egg dishes and other more hearty items if you're looking for something more than a croissant like I opted for.", "author": "Alicia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-29", "description": "Dropped in for a quick afternoon pick-me-up. Lovely place with generous seating area. Prices are okay. The prepped foods has an average selection of sandwiches, salads, fruit cups etc. I didn't see anything that I wanted to try.  \n\nThe bakery is chock full of goodies, starting from baguettes to mini desserts. Problem is everything is labelled in French. I was wondering if mgmt knew they opened the store in New York instead of Paris. Parisians can insist that fellow Parisians speak French but please don't impose that insufferable attitude in Downtown Brooklyn. So yes, a chocolate croissant is pan du chocolat. Like seriously, I don't have time for this. \n\nCrowd control is a concept the store mgmt will learn fast. Customers of bakery and prepped foods are directed to two registers from one line. So, inevitably a person with a sandwich will be stuck behind a person trying to decide between a brownie or a croissant. Again, wondering if mgmt knows how fast New Yorkers move. \n\nAlso, didn't see a coffee station. :-/ Perhaps I missed it.\n\nNonetheless, lovely place. Give it a try. The bakery goods look delicious.", "author": "Shar R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-28", "description": "Came here with a friend for lunch. Knowing the  flatiron location, I knew we couldn't go wrong... well we did. We both ordered salads. One was the summer salad and the other one grain salad. The grain salad's portioning was ridiculous compared to the summer salad even tho the price difference is $1. We did call our server to tell him. He agreed with us. He then told the manager in front of us who did't seem to think it was important, he left without saying a word. I have to add that the summer salad's portion was also very off ( to the other extreme, with a ton of cheese and some sort of weird cubes of chicken, the flatiron location brings your extra added chicken (+$3) in one piece and nicely grilled). We did get the full amount on our bill which was also disappointing. Overall bad experience even tho people were polite. Wont be returning to this location any time soon.", "author": "Alice S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Great food, decent price, friendly staff. Got a smoked salcom with sunny side up egg. Very satisfied!", "author": "Hieu D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "Fell in love with this place when I was in Paris and was happy to see that Monsieur Kayser has many locations in the city.  This location in particular is the newest.  The pastries are not only elegant and beautiful but also DELICIOUS!  The almond croissant (~$3-4) is my go-to fave, and yes insulin pen required post-consumption. Brioche bun (~$3) and petite fromage (~$3) are other solid carbs you should try if you come here\n\nThis location sucks only because there's no place to sit/stand if you're just doing take-out.  The tables are only for \"full-service\" (even though all seats were empty on a Sunday, still gotta pay for that full service).  Where am I supposed to eat my overpriced pastries now ?\n\nRegardless, it's refreshing to have a legitimate Parisian bakery in the middle of Brooklyn!", "author": "Chelsea M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Ok this place is first of all beautifully designed with an open kitchen kind of vibe. Came here for brunch and loved how everything was presented. Food for the eyes! Can't remember the name of what I ordered but it was in a cast iron and filled with cream and cheese. I also had a croissant, the only one thing I wish was that it came hot.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "I absolutely love their chocolate desserts. Completely amazing. Worth the price. They run out of certain things sooner than others, so I normally find myself calling ahead to confirm that what I want is still there. The staff is very nice and accommodating.", "author": "Shayna D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Stopped for a simple breakfast - yogurt with berries and granola, assorted breads with butter and jams and coffee. My husband had scrambled eggs and a lovely avocado mixture on bread. Very good. Service was a bit slow, server did not refill coffee until we asked near the end of the meal.", "author": "Mary Ann U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "Went here with friends for a Saturday brunch bite. Pretty good. The staff was great, and so too was the food and service. We were seated quickly, got our drinks and food order right; and the food was good. I had the eggs and sausage on toast, and it was good. Unlike some of the other reviews I have nothing to complain about. I'd recommend this place to friends and when in the area and looking for a good bite, would go here again.", "author": "Damon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "I'm a super fan.\nPROS:\n-amazing selection, and so fresh and pretty.\n-their breads use organic flour and there are so many multigrain choices\n-never had a single thing that I wouldn't purchase again\n-very nice open dining space\n-service is always very friendly\n-their bread is so crisp and good. They even slice it for you!\n-they give you little jams with your croissants if you ask\n-they're open early and late!! Yay!\n-i cannot stress enough how addicting their food is. All of it. Such quality\n\nCONS:\n-I'm going broke (it's a little pricey, but it's matched by the quality)\n-I can't go if I'm in a hurry, either they always hire new people or just in general it may take 5 mins or so even if there's only one person in front of me\n-their sit down menu doesn't offer the variety of other locations, but perhaps they will one day.", "author": "Ilaria T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-25", "description": "I came here for breakfast and was kind of underwhelmed. First off, I ordered the almond croissant which was soggy and not flaky whatsoever. The almond flavor from the almond paste did not come through at all, and all I could taste was the icing sugar on top. Even when I tried to dust the icing sugar off, the croissant was still insanely too sweet. We also tried the croque madame, and it was also fairly mediocre too. Overall, would not recommend going to this place, although it is a nice place to go and chat, the quality of the food is not good in my opinion", "author": "Tiffany A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-06", "description": "The pastry shop: 4.5 stars\nThe sit-down restaurant: 2 stars\n\nThe pastry shop is fantastic, with the best croissants and bread ever, and the coffee pretty good too, although nothing special.\n\nI had a pretty bad experience with their sit-down restaurant, though. When I went there was only 1 waitress for approximately 10 tables of people, so we had to wait a LONG time to get seated and to order. Not her fault, but really poor planning on the restaurant's part. Also, I ordered a side of avocado, which is not listed on the menu, and got a sad half (not even) of a tiny avocado and was charged $4 for that! Are you kidding?? I know NYC has crazy prices but that was beyond the pale. When I asked her about it she just took my card and sped off because she did not have time to speak to anyone. \n\nIn conclusion... go for the pastries and bread, skip the restaurant.", "author": "Sharon T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-19", "description": "My wife and wanted to enjoy brunch Sunday at Maison Kayser.  We waited for 10-15 minutes to be seated while watching the staff scurry around resetting up the several empty tables.  There appeared to be no one to seat their guests?  Maybe a wave of diners came before us, the servers were rushing around, we had the impression they were under staffed.\n\nOur order was taken, a raisin danish arrived, it was so dry I could not cut it with my knife!  I sent it back, out came another danish dry and maybe over baker, it was not worth eating.\n\nThe salad nicoise arrived, looked great, as I went to cut a tomato, I noticed two large bad spots like maybe mold? on the skin of the tomato slice.\n\nWe were waited on by several people and did not know our main wait person.  we waited for someone to come by and ask how our food was.  It never happened!\n\nI met with the hostess, she was very nice, apologized and did not charge us for the salad.\n\nI would not suggest this location for a meal.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-16", "description": "Good solid pastries and nice cakes/sweet rolls to bring along if you're invited somewhere- they come in beautiful and very presentable packaging. I don't like the huge lines but that's part of the deal when you'r located on busy Court street. As far as franchises/outposts go this location is clean, well kept, and efficient.", "author": "nina s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-07", "description": "This place is dangerous...dangerously good.  When Maison Kayser opened on Court Street last winter, I went to the grand opening party and I was hooked. After that, I was consuming Kayser's rich pistachio and cranberry cookies, almond croissants and other goodies weekly. By spring, I didn't even notice that I had gained 10 pounds as a result. That is, until I went to the doctor and stepped on the scale. So since May, I haven't stepped foot inside this tempting bakery and cafe. And I've lost 15 pounds! So enjoy, but in moderation : )", "author": "Tracy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "I typically hate eclairs with a passion, but Maison Kayser's pistachio eclair is heavenly.", "author": "Ilona K."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Maison Kayser", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNv83FtiCxojncpZ_Z_4Kg/ls.jpg", "@type": "Restaurant", "telephone": "+17182549600"}