{"aggregateRating": {"reviewCount": 117, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "I came here on May 18, 2017 with a friend from out of town for breakfast before we went to work. The place is super clean and very nice. Although, it is a bit tight spacing wise. The food we had there was delicious. I had the Parisienne Le Cocottes. It was so good!! I am drooling thinking about it right now. My friend had the Avocat \u0026  Deux Oeufs Au Choix (Avocado toast with eggs). It was good as well. Our waiter was amazing and very patient with us since we were being so indecisive. The manager was really great and gave us free chocolate croissants to try since we could not make a decision as to getting chocolate almond or basic chocolate. We got to try both for free! I have not been back but I will return soon. Especially now that I am thinking about that cocottes.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-17", "description": "Pristine marble white counters to reflect the buttery croissants, baguettes, mini cakes, pan de chocolate and plethora of patisserie offerings I cannot pronounce. Everything looks stunning at the top of the morning- I opted for my safety- the almond croissant that came out just in time before I ordered the flat top sugary cream confection, which I'm certain would've been delectable as well. \n\nAlmond croissant- yum. I think I'm learning, if it looks heavy, and soft and deliciously powered- get it. Almost perfect, if I had one complaint- it would be that I'd like the filling to be a bit looser and sweeter, but that is so personal. \n\nTheir latte is superbly crafted with a thick foam- no syrup- they don't offer it. Topped with honey, it was just the thing I needed.  And you can enjoy it at a great counter space that opens up to a nice dining room, early as I am sure this location will fill up quick.", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-07", "description": "I really like that you have the option of a quick order to go, order and seat in the self service table and the seat down area with service in the back. Croissants and baked good are freshly made. Food looks good too. I love that i can stare at the bakers making fresh bread.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "Service was less than desirable from the wait staff but busboys were awesome.\n\nWe ordered the \"Deux Oeufs Au Choix\" with smoked salmon.  I asked for the toast to be more toasted.  My plate taken away and returned with cooked lox, overcooked eggs.  Seems like they cooked the whole plate in the oven instead of just giving me new toast - which would have resolved my request.  Oy..\n\nThey did take the plate off the check which was honorable but I left starving cuz I refused to eat the food once I complained.", "author": "Darla C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Very clean and airy, an excellent place to just have some coffee with friends or to hear yourself think classily. The place is virtually spotless.\n\nEverything seems to be compartmentalized. There is a bakery/pastry section that faces the grab and go. Next to the grab and go there is the coffee bar that has a few seats. After 4pm, there is no table service. But the staff mentioned that one could purchase the items separately and sit at the table afterwards.\n\nA black coffee goes for $2.75. Other items are slightly more expensive, on the order of a few quarters. For those not into coffee, there's also a wide range of teas. If you're sitting in, you should request the barista to serve it in a mug.", "author": "Henry M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "My daughter and her friend just arrived in NY for the BeautyCon event and we agreed to meet for breakfast before they went to the event. We met here and it was a first for all three of us. My daughter ordered their French toast and her friend ordered a scrambled egg thing over toast. They ordered before I arrived so I just had a bowl of fresh fruit. Both my daughter and her friend aren't use to European style restaurants and the portion sizes that come with it. My daughter was upset by the portion size and didn't feel it was worth the $17 cost. We called the manager over and he was incredibly nice about it. He offered an alternative but my daughter wanted to have it removed to which he did with humor and a smile. Her friend enjoyed her eggs and my fruit was very fresh. I'll come back, next time without my big appetite daughter. Lol", "author": "Christian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Greeting- hello\nVibe- high class\nService- professional\nBR- No\nPrice- high\nParking- good luck\nSome of the best pastries and bread this side of France. Expensive but prob the best of the best. Try the croissants.\nWIGB? Yes", "author": "Hungry K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-27", "description": "How does one expect to eat a sandwich when the bread is hard as a rock?! I got the iberico ham sandwich and it was too hard to eat. I felt like my teeth were being pulled out of my gums. Other than that, the pastries looked pretty appetizing and the atmosphere looked nice and clean. Would I come back? Yeah, maybe if they decide to make their sandwiches with softer bread.", "author": "Mimee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "The pastries are amazing I came here to get pastries for my boyfriend's birthday. The girl was very careful with all the items I choose and she placed them in the box perfectly she even took the time to tape them to the bottom of the box so they did not move around. The service was amazing and everything I had was extremely tasty and decadent. Cannot wait for the next birthday so I can indulge again!", "author": "Lucy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "Stopped by for lunch and had the croque mossier with mix greens that was very tasty and iced mocha was good too. :) It was busy lunch scene and the staff being attentive with food coming timely. They do have Wifi which was nice to be able to get on my tablet \u0026 do some work while eating. :)", "author": "DW W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "The desserts here are out of this world. Cute little French patisserie with the best chocolate and passion fruit tarte I've ever tried! They serve mini madelines with the cappuccino if you eat at a table, too! The takeout dessert counter is fast and efficient. Packed up everything nicely to take home. Great experience. Will be coming back!", "author": "B G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "I came in solo at 10:45 on a Wednesday morning and chose to dine in. There is also a beautiful to-go bakery section to the left, with pastries, breads, and viennoiseries that look amazing. \n\nIt was about 1/4 filled by 11 and service was fine, not inattentive as reviews have suggested. My coffee order arrived within 3 minutes of placing it and was served with a tiny brownie bite - so sweet! I waited about 15 min for my Croque Madame. \n\nThe Croque Madame was perfect! Crunchy sourdough, a good amount of smoky ham, robust Gruyere cheese, and the perfect amount of Mornay sauce - all topped with a runny egg. This is my idea of umami heaven!!\n\nMy recommendation is to know upfront if you've got time for a relaxed beautiful sit-down or you're in more of a to-go kinda situation. Give yourself an hour to sit and eat and you'll be pleased by the pacing. This isn't an everyday kind of thing but for a special treat it is perfection! Loved it all.", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-09", "description": "A-OK is a great way to describe my dining experience here. Judging by the reviews on Yelp, this must be a pretty new location with still a few kinks to work out.\n\nOn the plus side, the food is really good. I heartily enjoyed the tartine with crab and avocado, which was very fresh and perfect for an appetizer. The complementary sliced baguette to accompany the meal was also delicious, and I would definitely order bread from here just on its own. I also had a nicoise salad which was a little disappointing; it was a huge portion, but the tuna looked and tasted as if it had just been dumped out of a can onto the lettuce.\n\nAs most of the reviews have mentioned, they do have a bit of an inconsistency with service. Granted we did have a fairly demanding table, but it was hard to call anyone over or get water refilled, and it took a long time for sides we requested and drinks to come out. A few of our orders were also missing pieces, but it was fairly easy to get things fixed.\n\nFor the high menu prices, you'll definitely get quality food but may have a lacking dine-in experience. I hope they fix this soon, but in the meantime, I'm definitely trying their coffee and dessert counter next!", "author": "Marina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "I came here to try their coffee. Ive heard great things and Starbucks does not impress me. I got their espresso macchiato and it was AMAZING. I usually don't do anything so strong as the flavor but it came highly recommended. They only have two sizes small and large. I got the small and it was $5.10. \n\nWAY TO EXPENSIVE to indulge in on a daily basis in my opinion. I am not likely to go back often. \n\nThey also have a large bakery on the left hand side and plenty of seating if you are ordering food [which I have yet to do].", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-01", "description": "Regularly visit this location for pastries and coffee on the weekend. Good every time.", "author": "Oliver S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "We went for Mother's Day breakfast, which seemed to be a popular destination for young families. We had a pain au chocolat, saumon Fume (I think they forgot the capers, but still great), and two cappuccinos. Everything was very tasty. Great, relaxing environment. The server was also great with our toddler. We are big fans.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Looking for an $18 salad? A $7 pastry smaller than your palm? Attentive, sweet service?\n\nThis is your spot. In exchange for the high price tag for mostly quality goods, you pay for the full minimalist French cafe experience (vs Le Pain Quotidien's rustic feel).\n\nFor dessert and a coffee, this is not such a bad investment. Especially when you're in the middle of Brooklyn outside of your comfort zone (I'm still more of a downtown Manhattan girl). And when the familiar name of \"Maison Kayser\" pops up on your Yelp nearby search (yes it's chain), you can't help but bring and impress your wide-eyed friends from Jersey here.\n\nNotes:\n- They have a sit-in area in the back for table service. OR you can buy goods from a counter on the left to take away.\n- They have windows next to the seating area so you can watch the pastry chefs making the baked goods. Fun!", "author": "Jess C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "My favorite place, I could eat there everyday \nI just love everything about Maison Kayser \nThe staff is very professional and knowledgeable . The last time I went there late like 25 minutes before closing and they let me and my friend seat down and eat and even pulled extra stuff for us . The costumer service there is impeccable", "author": "Myrisse D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "Brand new, just opened. It's a very organized and clean. We had a variety of croissants and the Taste So good!\n I have to go back and try the desserts. \nThere is a dining area with about 15 tables, a cafe and a \"to go\" line. Everything is beautifully presented and very colorful. Plenty of flavors to choose from. Enjoy!", "author": "Focci L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "With a dozen of bakery retail shops and cafes spread all over NYC and more than 100 shops located in over 20 different countries, Maison Kayser has been known for its artisanal French bakery... some may even say the best baguette in NYC. I had the pleasure to experience one of Maison Kayser's breakfast menu located in Brooklyn. The menu selections are simple with basic fresh ingredients... but the flavors are far from simple. They are true to its essence in every sense... whether it's their creativity with choice of ingredients, or ancestral techniques in preparation... each dish or baked goody is enjoyable from start to gone. For all the avocado toast fans out there, the Avocat \u0026 Deux Oeufs Au Choix is a must-try. It has all the best stuffs like avocado (of course), feta cheese, sauce verte, red onions on quinoa bread with two organic eggs (preferably sunny side-up)... tastiest fresh organic eggs I had in years!", "author": "Jack K."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Maison Kayser", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNv83FtiCxojncpZ_Z_4Kg/ls.jpg", "@type": "Restaurant", "telephone": "+17182549600"}