{"aggregateRating": {"reviewCount": 117, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-28", "description": "This place was across the street from an awesome pizza joint, and we were dragging pretty bad after stuffing our faces with delicious pizza, so we headed into Maison Kayser for some caffeine. While we didn't have the pastry's they still appeared quite delectable as well as super pricy (the reason we didn't eat them and the reason for four stars). \n\nI highly recommend their hot americano as well as their lattes- masterfully brewed, and they have tons of things to doctor it up to your liking including stevia, cinnamon, agave nectar, etc. \n\nIf you're in need of a pick me up I definitely recommend stopping by this wonderful dealer of caffeine!", "author": "Nash N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-10", "description": "I would have been ashamed to sell un-fresh pastries if I were you. Especially to a French girl like me, definitely telling my friends to avoid such overpriced low quality in the future. It's one thing to charm people  with cool marketing, it's another to meet the quality it should be associated with. I will give you the fact you have your staff wear quality original \"mariniere\"...that detail isn't unnoticed by me!\n\nBut I gave you one last chance here, my conclusion is that I will stop giving them from now on.\n\nI know good addresses for chocolate croissants people, skip Maison Kayser and hit me up for the real deal here in NYC. It's been my obsession and this place isn't it! Or follow my reviews ;)", "author": "Eleonora B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-15", "description": "Great service the staff was so friendly.\ngreat food, loved their dessert \nnice ambient", "author": "Muhannad A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-06-01", "description": "After encountering this place two times in two days (in Manhattan and then Brooklyn), I felt obligated to go in and try something. I had the tuna croissant with avocado and tomato and the white chocolate and pecan viennoise. Both were delicious. The croissant was soft and the sandwich was not messy. The viennoise was not too sweet and was sprinkled with sugar. I bought the mini one and wished I had gotten the large one. I guess I have a reason to go back!", "author": "Candra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "Such a goodilicious place to satiate your sweet tooth. They have great, strong coffee too. Great variety of unique pastries. Only thing is they are a bit pricey but they are still worth it since you cannot get these in a Starbucks or your local pastry store. Staff was attentive and nice. They also have sandwiches, soups and other foods, not just pastries and baked goods. I like the interior, makes me feel welcome.", "author": "Liz A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-04", "description": "So I came here this afternoon to get out of the rain and I had a craving for French Onion Soup.\n\n Let's just say I still have a craving for French Onion Soup. The soup was edible and flavorless. The best part if the soup for me was  the guyrere cheese that was nicely melted on top. The broth which is supposed to be beef had no flavor. It lacked salt and color. I am very disappointed that they could not get this right. \n\nAs for my service I was forced to sit at a waited table and not at the other tables they have if you buy a cookie or pre made sandwich. For one person to just order soup it was very upsetting to me. As I am waiting for the check the waiter disappeared into the back of the restaurant for a 5-7 minutes. \n\nThe friendliest and most helpful person I encountered was the African American male barista. \n\nI guess I will stick to my cookies, croissants and premade sandwiches at this establishment .", "author": "Desrin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-11", "description": "Croque monsieur was delicious, and pastries are quite good. Not a bad choice to grab breakfast and/or a morning drink on the go.  But table service was poor.  Later we simply wanted to get some afternoon tea.  The place was more empty than full.  After we were seated, we waited 10-15 minutes with no attention or visit at all from the waiter.  He was there, and saw us, but simply focused on other stuff.  We finally just got up and ordered tea at the counter to go, got it and then left.  Sad.", "author": "Doug M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "Maison Kayser is TOOO expensive to have burnt croissant or plié au chocolat. They should never look like this. I've often bought these at the discretion of the employee who is picking it for me and this is what I'm left with. This is honestly horrendous and I've never had a location so often burn French pastries to the point that they are hard. Of course I only discover this when I am home or in class. \nThis is unacceptable for a French pastry shop. This should have been disposed of and never sold to the public", "author": "Sacha-Avi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "The bakery is nice and has good pastries. I recently sat for lunch. The waiter paid us no mind, but was nice enough to come by here and there to ask how we were. \n\nMy pasta was ok. Looked pretty. Tasted ok. Noting wrong per see, I just didn't taste the almost $20 in my little bowl. I am sure it was in there though.", "author": "Jamel O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "In Brooklyn today.  Saw Maison Kayser while strolling along.\n\nYou order at the counter and bring your goodies to a comfortable space with marble tables where you can enjoy your meal or dessert snack.\n\nWe had a Mocachino - looks and tastes like a flourless Mocha Chocolate Cake - well made, looks beautiful and absolutely delicious.\n\nThe cold brew coffee and the generous air conditioning was very welcome on this hot humid NYC day.", "author": "Kelvin Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "I live in the Washington, DC area and I am a fan of the Maison Kayser near K Street and the Convention Center. This is a Brooklyn version of the franchise that Éric Kayser started in Paris. All the pâtisserie are sublime. For lunch try one of the salads, or onion soup. Even the iced tea is fantastic.", "author": "Mario N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-30", "description": "the inside of this store is good, but there's nothing else good i can say about this place. the waiter was extremely rude and flippant, and the food was beyond mediocre and overpriced. it didn't help that the food was also extremely meh and the salad was absolutely over-salted and i could barely eat it without wanting to spit it out/chug a glass of water. \n\ni will never return.", "author": "Sharon X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-09", "description": "Love this place! Absolutely love their chocolate croissants, a piece of heaven. Great green tea too. Only thing is that it's a little pricey, but worth it.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-01", "description": "I was at this location yesterday morning (9-30-18) I said I was going to come by before I left a class I am taking which is across the street from Maison Kayser, but I did not get the chance. I have been coming the past few Sundays and the same employee has been helping me and she has been rude to me every single time, but yesterday she was cursing as if she were working on the street; and she told me the manager was \"too busy at the moment\" which is why I did not bother looking for the manager. \n\nI was holding a cup of chia seed pudding and when I came up to the register she charged me for what I thought was my pudding, but after I paid she handed me a bag. I told her no this is not for me (it was a croissant and it was for the man behind me) \n\nShe then looked at me with confusion and anger, I told her it was a mistake and it's ok...she then went on to charge me for the pudding BUT I just paid for the croissant??!!! I told her no I am not paying for this I just paid for that croissant. \n\nAnyways she kept talking to herself and then she said that she's having a bad morning and she is \"fucking everything up\" she did not apologize to me, she was just rude the entire time. And I was standing there not knowing what to do, I asked her to call the manager but she looked over to the left where the restaurant side was and said \"my manager is busy\" I gave her the difference which was like .75 cents between the croissant and the pudding. But even after SHE IS THE ONE WHO MADE THE MISTAKE, I just got huffing and puffing and rudeness the entire 10 minutes that I was standing there. \n\nEvery Sunday I come in and if I ask a question about a pastry she gets mad or gives me a very unpleasant attitude. \n\nShe is a young black woman with very short hair. She also has a little bit of an accent but not sure what kind of accent. \n\nI have been going to many Maison Kayser locations for years, Its always been a pleasant experience except for Court Street. It saddens me that I will not be going to this location anymore; the location that is in my very own neighborhood.", "author": "Gabey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "My anytime food spot always good ! Coffee is always fresh , staff is friendly ! Good for business \nMeetings only  on weekdays ! Lunch time gets busy , they have the best Pastries !!! \nHope they stick around for a very long time !!", "author": "Bella B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-31", "description": "The good - both the bread and coffee are excellent.\nThe bad - my $15 croque madame must have been pre-made, as the melted gruyere and mornay sauce had congealed into a hard, dry crust on top of the ham.  The price would be ok if it were freshly made but this was not.", "author": "Matt J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-23", "description": "Decent brunch, a bit overpriced for such straightforward fare.  Everything is just alright, painfully average.  Good brunch atmosphere, but I'd rather have delicious food, than just enjoy the ambiance. I didn't have any issues with the service, but again, nothing that stands out.  A forgettable experience, but not a bad one.", "author": "Ira S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Great place for breakfast or to grab a sandwich. Prices are typical of NYC, perhaps rather higher since this is a chain from France. I ate there when I was in Paris, and I'd say the food was pretty similar. Tried a sandwich to go and also a full breakfast. \n\nThe pastries are just as tasty as they were in Paris. However, I will remind you that this is equivalent to a fast food/cafe restaurant in Paris and it looks a little more high class in NYC with in door seating. In Paris, they considered this quick cheap eats. So, with that in mind I would say the food here is comparable to a quick, cheap market restaurant in Paris. I would say the food is up a notch from a Whole Foods Market or something to that aspect. I came here more to reminisnce about my trip to Paris more than anything.", "author": "Hoa L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-21", "description": "Food is ok but not great if considering the price.   There's a couple places that I would goto instead of this place.  The thing that annoys me is how dirty it is in front of the restaurant.  The smell linger right in the front.  Greasy, sticky stains that sticks to the bottom of the shoe.  Slippery when wet and sticky when it's dry out.  Its a nice place to hang and catch up with friends in the area.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "I've avoided this place since it opened because whenever my wife suggested that we come by, I kept confusing it with the Paris Baguette down the street (and I dismiss all of my wife's suggestions out of hand*). You probably don't need me to tell you this because you're not an idiot, but:\n\nPeople, this is not Paris Baguette.\n\nThis is a gorgeous bakery with stunning croissant, baguettes, and anything else you'd want from an oven. Additionally, it's a damn good spot for a fancy-ish lunch in the fast-casual wasteland that is Downtown Brooklyn. This is what that sad, disappointing chain Le Pain Quotidien probably was once upon a time, and now what they wish they could be.\n\nIf you have time for lunch, and aren't just swinging by for carby deliciousness, do not sleep on the dope tartines. \n\nIf you're a fatty like me, rock the Champignons \u0026 Oignons option. I'm biased because I love all 'ignons, but the onion soubise with the gruyere...it's richer than anything you should be eating, but it tastes so good once it hits your lips.\n\nIf you just like good, seasonal food, they have a lovely autumnal chevre tartine on the menu right now. With squash, dates, pecans, pumpkin seeds, brussels sprouts and a bit of honey, it's perfectly balanced and it would take you too much time and money to assemble all those delicious things at home. I'd eat it every day. \n\nAnd if you don't want to reward yourself with delicious pastry and hearty tartines, you can just masochistically watch them bake behind the glass.\n____________\n\n*Not because she's a woman (I marched this past weekend), but because she's my wife.", "author": "Peter D."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Maison Kayser", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNv83FtiCxojncpZ_Z_4Kg/ls.jpg", "@type": "Restaurant", "telephone": "+17182549600"}