{"aggregateRating": {"reviewCount": 117, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "New location is beautiful and clean. The variety of breads are delicious, especially the white chocolate bread and croissants. Down side is that there is no place to sit or apparent coffee station?", "author": "Pearl S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "The only bakery around that comes anywhere close to a real Parisian bakery!  The croissants and baguettes are the real deal!  The Pain aux Raisins are also made properly and not Americanized with icing. \n\nIt is not cheap, but totally worth the price considering the quality.  Also excellent coffee.  Highly recommended!", "author": "Peter C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-07", "description": "I just left this place hungry!  The service was very slow.  It took 40 minutes just to place an order and then another 20 min for them to bring out what I didn't order.  The staff was confused and continuously brought the wrong food to the wrong tables and the place was not that crowded.  I left eating only the bread and a small salad because I didn't have the extra time to wait for what I actually ordered.   It's a shame because I am sure the food is very good but they need to work in their staff.", "author": "Tara E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "One of the very few places in NYC with good croissants, at least the plain ones. The chocolate and almond ones are better at Bien Cuit. This place is pricey but it's got some good, difficult to find things. Besides the croissants, the chocolate-creme croissant thing is good. I forget what it's called. Also, the baguettes are very good. Very pricey, but real Parisian style baguettes.(I mean this baguette would be just ok in Paris, but we ain't in Paris. Most things that get called baguette on this side of the ocean are sad things.)", "author": "Aliz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-04", "description": "The chocolate pecan bread is delicious. Everything looks wonderful. I also tasted a sample of the cheese bread which was divine. Will be back.", "author": "Coco V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "when i was working in the downtown brooklyn area court st we did not have fancy artisan joints like this . we had burger king, mcdonalds, blimpes, etc but once i left brooklyn the area change from donuts - pizza too crossiants , tartines and other fancy eats. this maison kayser will fit in nicely with the local cobble hill hipsters and other artsy fartsy types .the kayser chain is famous for teasing folks by displaying the yummy pastries front and center via the window displays and it's good enough to grab folks inside . besides the pastries you can grab some assorted breads , crossiants , soups , salads and prepacked sandwiches and more. good amount of seating inside with servers who are friendly and attentive for the most part. you will pay more and it's not your typical american breakfast and lunch so expand your horizons and go the french artisan way with quiche , tartines and other eats that you will experience for the first time . i usually grab a few crossiants and eclairs for the road and one special days like a birthday or holiday event i suggest the cakes or pies which will run 30 bucks and above but will satisfy your sweet tooth as it makes your wallet thinner . enjoy and try it you won't regret it.    pros /quality of sweets and bread, french decor, friendly staff,  cons/prices a bit high, some pastries a bit to rich, and french lunch offerings may not be your cup of tea.  overall 4 stars on my yelp meter.", "author": "Sadri B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "The coffee is very delicious and the place looks very luxurious. I came here with my friend and ordered a latte and espresso and we both loved it highly recommend it", "author": "Jules B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-25", "description": "Went there on xmas for Buche cake. Worst customer service, especially for prices they charge. 2 ppl working behind the counter and one was just standing there refusing to work because her manager left while she had to stay. The other complaining she had to work. Sucks to be there on xmas but if you're paid to do it, then at least do your job. There was only 1 person in line in front of me but the wait was over 10 minutes. People behind me started complaining and huffing and puffing.", "author": "K C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-29", "description": "The food was very good! We had an almond croissant that was delicious and ordered the ham and eggs which was very good but we didn't realize the ham was served chilled. We asked the manager about it and he said that was the way it was supposed to be. The food deserved 5 stars but I'm giving it 3 because of the service. When we came in, the server tried to seat us in a tiny table really close to two other tables when the whole back half of the restaurant was empty (this is after we waited and had to ask if we should seat ourselves). He gave us an uncomfortable look so we said fine we would sit where he was putting us. Mind you as we sat there, several tables started to be seated in the back area. Also there was one server to 13 tables (I counted). It was not fair to the guy who was trying and it impacted our experience. There was another guy that was doing water, food running, and busing and when he brought our food out, because the table was so tiny, he started putting condiments and plates for us on the table adjacent to us which had not been cleared and was dirty. Apparently this is like a health violation. The manager was there and helping so I can only hope that it was because someone called out sick or something that made the service so bad. I would still go back because the food was good.", "author": "Leah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "Very finest baguette and truly deserve 5 stars. It's a wonderful way to start your day with Maison Kayser.", "author": "Priscilla S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Delicious, authentic French baguettes and croissants, and full brunch, lunch, and dinner menus. Very friendly staff.", "author": "Jane D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Had a wonderful breakfast experience today!  Our server, Ameenah did a great job of being attentive to our needs more coffee etc but not being intrusive. The food was perfectly prepared and up to Parisienne standards for the Almond Croissant and the apple cinnamon brioche.  Everyone greeted us and made us feel welcome!  We will be back to this excellent addition to Brooklyn Heights gastronomy .", "author": "Sandra S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-23", "description": "I have been here several times now. The food is consistently delicious and the service is consistently terrible. It often takes a long time before anyone comes over to initially take your order and it is very difficult to flag down a waiter. Im always torn about eating here because of this.", "author": "Ariel Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-21", "description": "I went in for sit down breakfast this am, cappuccinos great, apple brioche good. When we requested one more cappuccino to go after we ate in they charged us $9 for one cap-WHAT? I questioned it and the waitress said, \"I told you the 2go cap has 2shots of espresso!\" Still WHAT?? She dismissed me and walked away... Makes no sense as a cap to go at the counter is $5.25... Left a bad taste in my mouth so won't be going back for awhile..", "author": "Susan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "We had a light dinner there tonight and it  was pretty awful. I had the chicken quinoa salad and he had French  onion soup and a crab sandwich. The chicken was overcooked. The presentation was lovely but that was all. The onion soup was very sweet and the crab tasted less than fresh. The baguette was delicious! That very light dinner with a cup of tea was $54.00. Not cheap for a lousy meal.", "author": "judith f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "Best baguettes in New York. Baked three times a day. A little bit of Paris in Brooklyn. Formidable!", "author": "Alison B."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Maison Kayser", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNv83FtiCxojncpZ_Z_4Kg/ls.jpg", "@type": "Restaurant", "telephone": "+17182549600"}