{"aggregateRating": {"reviewCount": 6, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Have you ever seen Ben-Hur? Well, IF you have, remember the scene where Jesus brings water to the parched Ben-Hur as he is moments from death? Champion Deli is my \"Jesus.\" \n(cue lightning striking me down).....ok, I survived THIS time. Whenever I've over-indulged in the fruits of wine and beverage, and trudge home after waiting an hour for that 3am train, guess who's there?...Jesus, whoops, I mean Champion Deli. And the sandwich is not only fresh made, it is inexpensive and meaty delicious! Like, loaded to the MAX MEAT(copyright pending). My favorites to recommend are the roast beef and cheddar with spicy mustard hero. Second favorite option is honey turkey and swiss with honey mustard hero. ALWAYS hero because just a roll won't be enough glorious glorious MAX MEAT(copyright pending). \n\nDo yourself a favor if you need a quick bite, whether it is middle of the day or the dark pits of middle Earth aka 4am, trust your all time Champion Deli.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-06", "description": "SUPER cheap sandwiches. I don't know how they do it, but you can get an entire hero for less than $6. They also take credit cards ($7 minimum) and they're open 24/7, so basically perfect after a night of drinking. They didn't have a bunch of the deli meats on their menu, so I got my third choice - the chipotle chicken. The bread wasn't the best, but they definitely loaded it up with meat. Ask for it with everything and you'll get cheese, mayo, lettuce, and tomato.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Excellent cup of coffee.  Good price and good flavor.   Why pay $3.50 when you can pay $1.50.  Importantly, the family who runs it and the people who work there are fun, warm, and colorful.    Good people. Real Champions.", "author": "Radiot R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-06", "description": "Honestly, just not super clean. Also, it's really loud and this is coming from a shop that's right next to Atlantic ave. Head across Henry St to Brooklyn Heights deli. Frank is the man.", "author": "Jim L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-05", "description": "Never, ever use the ATM here. They skim cards. My account was hacked within minutes of using their ATM not once but three times.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "A 24-hour deli with $4 made-to-order Boar's Head sandwiches?  Yes please!\n\nOur volleyball crew frequents the nearby Montero's Bar \u0026 Grill, although the \"Grill\" part at Montero's is no longer.  After a night of volleyball and a few rounds of beers, my inevitable hunger leads me towards Champion Deli for a food nightcap.  Having only ordered the sandwiches there, I can say they're piled high with your choice cold cuts, accompanied with plenty of toppings (cheese, lettuce, tomato, onion) all for the reasonable $4 price tag.", "author": "Ryan F."}], "servesCuisine": "Delis", "priceRange": "Under $10", "name": "Champion Deli-Grocery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "121 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/PjHjNrOavnOPHnbqbc263Q/ls.jpg", "@type": "Restaurant", "telephone": "+17182564444"}