{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Calamari salad is excellent, comes with an incredible home made bread. This was my first visit, I definitely plan on coming back with the Mrs. For a special night.", "author": "Chris F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-15", "description": "I have Seamless-ordered from here a handful of times, and while the food is tasty, there's a few consistent problems with this place. We can't give them a try any longer :/@\n\nThe prices are too high for a \"non organic menu\" - also the biggest issue is with the delivery crew. Every time we have ordered, they don't even try the buzzer and they call us, then speak in 100% Spanish and we can't understand anything that they are saying (I wish I spoke fluent Spanish but I don't). We then have to call the restaurant and explain that they need to buzz in, then meanwhile the food is getting cold etc..\n\nI have no problem with the fact that English is not their first language, it's more that they don't even try to use the buzzer. We live in a very secure building and they simply MUST buzz in for us to open the door. There's no other way to let them in and we shouldn't have to take the elevator down because they aren't trained properly. The directions are clearly written on the directory. Their delivery crew either doesn't even try to use the buzzer OR has no idea how to. It's not their fault, but it is the responsibility of the restaurant manager to hire the right staff, or properly train people, this is a fundamental requirement of any NY restaurant.  \n\n4/4 times we have ordered from here this has happened. We are done.", "author": "S L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "I have no idea how I should start this review. This place was incredible!! I am a sucker for good Mediterranean food and this place made my taste buds tingle. I was more focused on the food rather than layout but I did look around and like the placement of the tables, wall decorations, and I like the bathrooms. The bread was probably the thing that impressed me the most surprisingly, I was  stocking up soo much carbs before my penne vodka was ready. The spinach/cheese rolls, falafel calamari were all spot on. *Keep in mind I came with a group for a birthday dinner*  I did regret getting pasta when I could've had the kabob or the stew two of my friends had which did taste better than my pasta. I definitely will come back to this place, my friends and I already agreed on it. Can't wait to come back :)", "author": "Shahin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Delicious dips! Get the mixed appetizer people! It includes nice spreads like humus and babaganoush. Really great way to start the meal. The picture is of the special Beyti kebab: I got the one with chicken and it is wrapped in a delicious lavash bread and topped with a garlic yogurt sauce. Also it is served with tasty rice. It is fantastic and goes great with their homemade hot sauce! It is affordable and delicious food. If you are in the area of fort Greene/Barclays center, give it a try!", "author": "Ira H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "What do you like more falafel or pilaf rice? Here you don't have to choose, they're both excellent. The same goes for the chicken. I'm not crazy about their baba ganoush, but you can't have a Mediterranean buffet without it either. I don't want to make it sound like it's bad though, it was alright.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "One of the most delicious Turkish food place in Brooklyn! I constantly placed an order from here for delivery and got my food super fast every single time. Their food is always fresh and tasty. Definitely give this place a try and you will become a regular!", "author": "Mehmet K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-26", "description": "Ordered two chicken schwarma platters and they came deep fried to a crisp. What reason would you have to fry chicken supposedly roasted on a spit? Because it was leftovers, dumped into the deep fryer and fried to the point of being inedible. The whole thing smelled and tasted like fry oil. For $15 a pop. You should be ashamed.", "author": "Paul R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "Excellent service! You drop the napkin, and they bring you a new in a second. \nDelicious food, great special lunch. Their kebabs are absolutely addictive.\nHighly recommended.", "author": "Anara B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-26", "description": "More than decent Turkish-Mediterranean place not far from BAM. The dorado I tried was good, though not exceptional. But you can get a healthy and pretty tasty meal for what in New York passes for a cheap fair. Try their Cankaya white wine (Turkish).", "author": "Massimo P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Deniz is a mediterranean restaurant located in the heart of Fort Greene. It's a pretty large restaurant well suited for big groups with a number of sidewalk tables during the warmer months. They also have a large bar for drinks or if you're waiting for a take out order! The menu offers many Mediterranean appetizers (hummus, babaganoush, stuffed grape leaves), salads, and entrees (chicken and lamb gyros and kabobs, falafel, seafood). Favorite picks: chicken and lamb gyro, hummus appetizer, and chocolate soufflé! The service is prompt and friendly and the prices are commensurate with the neighborhood. They also provide catering options and host private parties (up to 100 people).", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "I have an unstoppable love affair with the mixed appetizer plate. I order it regularly, either to split with a friend or demolish myself over a couple of meals. Not a fan of their falafel, but the reliable, efficient delivery keeps me coming back.", "author": "Emily M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "Hands down the best! \n\nFood is always cooked perfectly. I've used this place for several catered event and it's incredible. Everyone loves it and that's about 150 critics so far! \n\nGo here. Support this business!", "author": "Ally S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-07", "description": "I have eaten here quite a few times since i live nearby. The ambiance is great and the food is pretty good overall. My favorite is the Lamb Shank entree, definitely a good choice. \n\nI have had their chicken soup which was ok, a bit too creamy for my taste.\n\nthe wraps are a good grab and go bite but they arent very tasty. \n\nI do think that they can do better with their bread, it always tastes a bit old and stale\n\nAll in all, a decent choice for turkish in the area.", "author": "Mohammad A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-02", "description": "This was my second time coming to Deniz and I knew there was a reason why it had been about five years since I first ate dinner there, I just couldn't remember why. The food is meh and overpriced, though I'm guessing that the rent is expensive in this sought after pocket of Fort Greene and the owners have to recoup profits somehow.\n\nI had the mixed meat grill which is $20. It comes with chicken gyro, chicken shish kebab, lamb shish and adana (kafta) kebab served with rice and salad. The chicken kebab was well marinated and moist and the rice was very good--it had kind of an almondy taste to it. The yogurt sauce was liquidy and had no flavor. All of the other meats were just okay. I didn't even bother taking my leftovers home.\n\nService here is fine and this is a nice place to sit outside and people watch. The food, though? Meh.", "author": "Sierra B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "I've been to Deniz before but my most recent trip has won a good review from me. Needing to sober up from a day of drinking which started at noon I came to Deniz in the middle of the Crossing Brooklyn Ferry festival at BAM. Figured it was a good option to fill up but I needed more that just that. I also needed a iPhone 5 charger. \n\nI come barreling in, screaming about an iPhone 5 charger and if they accept credit card. They assured me, they could help me with both issues and sat me away from anywhere I could scare anyone. I stare at the menu for awhile and contemplate what I should have. Something filling, which can get me through the night. Stuffed cabbage it is! Now I know what you want to ask me, \"Mitch you we're pretty bombed. Can I trust your opinion of the food?\" Well I have only one thing to say. How dare you question me! I may have been drunk, but I've been drunk and not enjoyed my meal before. The stuffed cabbage was excellent and I'll stand by that. \n\nAfter devouring my meal, I paid, got my charged iPhone and was ready to rage some more. Thank you Deniz, you saved me. Except my soul, there is no saving that mess.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Great food! Loved the atmosphere and the rakı! Large menu with many options. Ezme was delicious, as was the ekmek.", "author": "Anna F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "Great food, the lamb was delicious in a sauce with peppers and onions, kind of like lamb stew. Seasoned delicious. Served with rice.  The hummus appetizer was ok, a bit bland.  Sangria refreshing for a hot day, Dessert was rice pudding which was ok.  The entree was great  so  I would return, price was very reasonable.", "author": "Patricia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Very fast delivery on FREEzing cold night.... The food came hot and packaged very well. The Deniz Salad is huge, all of the veggies were very fresh and the dressing was simple and yummy. The \"feta cheese\" though was actually just a very finely shredded cheese that tasted more like cojita. \n\nThe lentil soup was good, but tasted a little heavy. The ingredients on the menu just say \"puréed red lentils topped with crushed red pepper and mint.\" I couldn't taste the red pepper or mint.... Just really lentils and some kind of cream. I wound up calling and asking what was in it... They told me it was vegetarian but had dairy, and when I asked what kind of dairy he said \"butter.\" Umm gross. \n\nI won't be ordering the soup again. But that won't stop me from trying some more salads. And the best part, it came with two huge pieces of warm Turkish bread. Yum!", "author": "Liz B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-25", "description": "I sat at the bar for dinner and had an odd experience. I found the staff a bit unwelcoming. Even after sitting down and ordering a glass of wine with my meal, my food arrived packed up and ready for take out even though I clearly was planning on dining in. \nAside from that the food was good. I ordered the Adana kebab and a side of hummus. Both were good although I felt the kebab was a bit overpriced for the portion. The hummus was great and definitely tasted homemade. \n\nI can see myself coming back in the future because the food is definitely solid, but I don't think 4-5 stars is deserved", "author": "Emily F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "Great food , very friendly  staff can't  go wrong by stopping  by and having a taste  for turkish  cuisine", "author": "Manny S."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}