{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "Amazing food!! Great service...delivery is really quick and the ezme and Adana are perfect. They also give a ton if\nPita bread to munch on with the soup", "author": "Jason M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "I have lunch dine in and the price is fair for this area. Food is good and service is  awesome. We had a big party and the waiter is quite organized and serve each one of us well.", "author": "Vienna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "Not sure what the negative reviews are about here... I went here with the hubby for lunch. We ordered from the lunch special menu- I started with this tasty eggplant salad (I heart eggplant). Snacking on that with some bread and a nice crisp white wine... I knew this would be a good meal from the start. \n\nHubby got the the lamb shish, me the chicken shish. Both were yummy!  My chicken juicy and perfectly grilled... but the surprise was the lamb. I don't usually like lamb, but this was really tasty!\n\nI finished with some baklava and Turkish tea... HMMMM baklava was excellent! At that point I was reminded of our trip to Istanbul... And the waiters were just as friendly. \n\nAll around excellent meal and relaxing lunch. I would go back.", "author": "CA B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-17", "description": "i had the lamb kebab and the meat was very smoky and flavorful. it came with a well-dressed salad that wasn't overpowered by onions, and a generous side of babaganoush that was also very smoky. i couldn't finish my food. with tip the bill came out to be $15 which was alright because i was able to split my meal into a meal and a snack.", "author": "Jenny J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Good food, good atmosphere.  If you like Turkish food you will like this place.", "author": "Don W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-29", "description": "I have to admit that I don't understand the great reviews of this place. I've tried the food here two times, and found it greasy and under-seasoned. I usually like Mediterranean food for its fresh and clean flavors and ingredients, but I certainly didn't feel like I had eaten a healthy meal afterwards. Maybe I'm just ordering the wrong things, but unfortunately, I won't be trying again.", "author": "Emily J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "I liked the food, service, customer profile and atmosphere... don't hesitate to give it a try...", "author": "Taylan Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-11", "description": "i was so disappointed!\ni did not like the food such as meat and chicken and rice it tasted really bad.\nthe only thing i likeed was the appetizer which was the Hummus and bread. abosulety ! a must TRY!\n\noverall the restruant was clean, waiters were fast and nice and well dressed.\nthe soda tastes like its homemade so just stick with water.", "author": "Nora A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-05", "description": "I recently went by and they have an 'A' rating. I guess they cleaned up their act, after the Health Department went in for an investigation.  Yelp really does work! I had been interviewed over the phone while still living in California after a group went in for lunch and 10 went to the emergency room.", "author": "Colette T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "I've Seamlessed this place twice this week and am SO happy. I just had to get on here and thank you guys. My order was 40 minutes earlier than anticipated both times. I was walking my dog tonight thinking I had a while til my food came and my delivery guy was waiting for ME! Delicious and super generous with bread. Food makes me happy. You guys made me happy this week. Xoxo", "author": "Eileen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-31", "description": "Randomly stopped by here after an event in the neighborhood.  I had the Grilled Calamari Salad (YUM at $9) and tried the Spinach Tarator (jizz in my pants good) and the Seafood Stuffed Mushroom (double jizz in my pants great). The calamari was grilled to perfection and tasted as fresh as can be.\n\nWe were seated outdoors on a beautiful Saturday evening, dined with the noises of a street fair by nearby. The wait staff were friendly, humorous, and extremely attentive. The crowd ranged from families with toddlers to elderly couples to small groups of twenty-somethings.", "author": "Eve G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-18", "description": "The food was not bad, but I have tasted better elsewhere.  I can only award the restaurant two stars because the service was awful.  As soon as one of us were done eating, a server rushed over to take the plate away.  It seemed a bit disruptive considering she had just put her fork down.  Various servers also seemed eager for us to pay the bill, rather than just allowing us to sit awhile and digest our food.  Mind you, the last of us had only finished eating when the bill was placed on the table.  We were a party of four.  I could understand the rush if there were people waiting to be seated, but the restaurant was practically empty on a Saturday evening.  I could also understand the rush if our party was obnoxious, but we certainly were not.  Upon leaving the restaurant, the host couldn't be bothered to say goodbye nor thank us for dining at his establishment.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "I've had the pleasure to eat at Deniz twice.   Both times the servers were very generous, professional and elegant.  The first time I had the lentil soup and a salad and it was quite good.  The second time I split a falafel plate entree and mediterranean salad with my date.   The greens were fresh, the falafel tasty and the hot sauce was great for me because it wasn't TOO hot (if you love mouth blowing spicy it might not be your thing.)\n\nThe only things I would improve are :\n\n1) The music selection -- which kept on switching between beautiful, atmospheric music to space-filling, obnoxious pop songs throughout the night.\n\n2) The coffee!  A little disappointed that the Turkish coffee tasted a little burnt and acidic.  Maybe it was a bad brew, but wasn't psyched about it.\n\nOverall, a great experience, this place is highly recommended.", "author": "Patrick G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-14", "description": "Went for dinner with my boyfriend this Tuesday because a vegan friend recommended it. Also wanted to refresh my fond memory of my Turkish trip as I had a great culinary experience while traveling the country, every ting I ate there was so fresh, full of flavor and delightful. \n\nI would have to say its a very disappointing dinning experience, rather. I ordered the lamb shank and my boyfriend had the grilled Branzino, both dishes are sub-par, though the fish was slightly more edible. \n\nThe lamb shank not just lacked flavor and seasonings, with no source on the plate, the meat was very dry and gamy. At the end, it started to upset my stomach as I was trying to eat more since I was quite hungry. The mash potato side was very dense as well, felt like fake engineered starch. \n\nThe fish was not very fresh either. The meat was a bit dense, there were no herbs to compliment the fish and just charred grilled, not the normal light, sweet texture of a Branzino fish. \n\nThe eggplant salad was the only salvation of such disastrous dinning experience, but the plate was rather small anyway. \n\nSo I was not a happy camper with this place. Seriously speaking, I have not eaten such bad food for a long time.", "author": "Mei D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "Disgusting meal. Found two hairs in my meal-- in two different dishes. And they allowed an obviously inebriated man to sit at the bar and order a drink at 12:30 in the afternoon, and he then proceeded to talk loudly in our direction, mutter to himself, and generally make our meal incredibly unpleasant. Do not recommend at all.", "author": "Samantha A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-26", "description": "Terrible wait staff! Food isn't all that great. Powder mash potatoes eghhh! What turned me off the most was being given a service charge on my bill. In other words they decided for me how much I had to tip them. While the people at the next table near us did not get a service charge. I cannot think of any reason what the thinking behind the decision was to put in the service charge to our bill. Other than maybe financial discrimination perhaps. Because when I asked the waiter Ahmed why it was added he explained it is added to everyone's bill when it obviously is not.", "author": "Yuri E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-23", "description": "Placed an office delivery order for over $350. Estimated delivery time was 30 to 45 mins. 9 out of the 19 orders were Lamb Gyros. They called back 25 minutes later to tell us they no longer have Lamb Gyros. They said they only have Lamb Shish Kebabs for an additional $2 per order. In the essence of saving time we agreed. \n\nPerson on the phone was extremely rude in handling all of this. \n\nOrder was placed at 11:45. Food arrived at 2:00. Food was cold and over priced for what it is. There are many eating options in this area. Will not be ordering from here again. \n\nWay to lose business.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-25", "description": "The first time eating here and it was my first time eating Turkish Mediterranean food. The food was oka y, the lamb was overcooked.", "author": "Jasmine R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "Excellent customer service and food presentation. Great ambiance, delicious falafel. Prices are moderate. Friend had chicken said was moist and tasty. Nice spot. Go check it out.", "author": "Vanessa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-31", "description": "The thing I will remember the most about Deniz is unfortunately the overbearing, slightly condescending service. I recently ate here with a friend during lunch, and we both chose the well-priced ($9.95, definitely a good value) lunch special, which gives you one appetizer and main course. The waiters feigned courtesy when asking us multiple times if we wanted something else to drink or another look at the alcohol list. \"No dessert?\" How uncivilized we must have looked to them, but when it was clear our bill would not top $20, it seemed that we were dirt to them.\n\nThe place has only been open a few weeks, and we were one of two dining pairs on this weekday. They had no reason to serve us with such attitude... but insisted on carrying through with it all night. When our total bill of $21.50 or so came, we waited for 5 minutes to receive change from our $30. Finally a girl asked us if we needed change and we said yes. 5 more minutes passed before the head waiter asked us the same question. They had obviously had the time to look at the money and were trying to shame us into a significant tip, of which they were not even deserving.\n\nNow that I have that off my chest, I can say that I did enjoy the food. Decent Turkish in north Brooklyn is not easy to come by, and Deniz could really be an asset if they toned down on the faux-fancy snob routine. As stated before, we both fed ourselves from the lunch special menu. Our appetizers were delicious, the tunçilik (eggplant salad) was almost perfect with all the roasted eggplant, red peppers, and garlic. The hummus was also very good, although I would have prefered a homemade pita to the soft doughy bread they served to accompany both appetizers.\n\nMy main course, the adana kebab (spiced lamb) was terrific, infused with plenty of pepper inside and grilled to tender delight. The corners were slightly charred, which I also enjoyed, while the center would still be medium rare if we were talking steaks or burgers. The accompanying salads and rice were nothing much to speak of, but the meat as a centerpiece was enough to satisfy.\n\nI am really not sure if we just picked a bad time, or if budget eaters like us just are not welcome here, but it is a shame that a decent meal gets so sullied by poor treatment. I hope Deniz realizes that it exists in a very laid back neighborhood, and diners are not looking for posh.", "author": "Jared C."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}