{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-07", "description": "Have only ordered takeout/delivery and it's been good (and quick) every time. Try the manti and the various dips - delicious.", "author": "Maithili P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "I have gone to this place several times and I have also ordered take out on few occasions. I have never been disappointed with it.\nThe warm bread with babaganoush, lentil soup, adana kebab, chicken kebab, Shepherd salad have been always really good. Their giros are not that great but any of the kebabs will make up for them.\nTheir lunch special at $9.95 on weekdays are really hard to beat.\nI also like the layout of the place, with lots of windows and natural light.", "author": "Oscar D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-01", "description": "I eat at Deniz more than once a week.  \n\nI have lived in Turkey, and every time I come here I feel like I'm back in Istanbul.\n\nThe staff is warm and welcoming, and the service friendly and fast.\n\nThe food is always fresh.\n\nFor a light meal try the salads (add shrimp or chicken)\n\nThe kebabs are great.\n\nThere are awesome Turkish items as well like Iskandar, Mujver (Zuccini Pancake, Fried Liver,  Sutlac (pudding). The manti (mini ravioli) are delicious as well\n\nI saw a customer below ordered Iskandar Kebab, and clearly didn't understand what real Turkish food was, because she complained about not getting sides. \n\nIskandar is the Turkish equivalent of \"comfort food\". It's gooey tomatoe sauce and yogurt with gyro lamb and bread pieces. \n\nAs a Canadian I think of it as \"turkish poutine\". \n\nAnyhow, the point is..\n\nthis is the real Turkish deal, \n\nand for the neighborhood the freshest most affordable option.", "author": "Davyde W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "Great service and delicious food. I'm Turkish and I don't understand what other bad reviews are all about. I can say the food quality was extremely good and the service was wonderful. It's very authentic and this is as good as it gets without being in Turkey.", "author": "Umut K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-25", "description": "So by now I think I've established a pretty good hold on Turkish/Mediterranean cuisine.\n\nThe restaurant interior looked like a large modern diner, and was sparsely populated. There was an elaborate cocktail menu - Red Flag\n\nThe lentil soup was watery and the ambitious and delicate attempt of adding tomato sauce made it taste like tomato soup with milly grains. It wasn't rich, it was watery. It looked like baby vomit - Yellow Card\n\nThe Sigara Boregi, phyllo filled with spinach and feta cheese, was not fresh. They looked like slim eggrolls and the phyllo was old - Red Card\n\nThe falafel were just okay - deep fried, symmetrically arranged around some hummus. Pregnant pause.\n\nAfter we were done, the waiter came by, and kind of accosted us with this round platter of individually saran-wrapped Turkish desserts. Why is saran-wrapping things a theme here?\n\nWhile the waiters were somewhat attentive, we waited and waited for them to come back to pick up the check so we could pay. I went up, and they said they'd come over and take care of it soon - Blue card.", "author": "Kendra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-05", "description": "I like the place. Came here for lunch..it was a quiet afternoon, the service was mediocre along with the food. I had the falafel plate special which comes with an appetizer. I ordered the Babaganush- which was good for my first time trying the dish. It was only 9.95, which is pretty good for a lunch special, especially with the portion they give. I forgot what my friend ordered, but he ate the whole thing, so I'm assuming he enjoyed it. We had tea and that was good too..\nOverall, nothing special about the decor, menu, or service, but if you are looking for some Turkish and Mediterranean cuisine check it out, just to check it out...", "author": "Maria T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "I have gone to this restaurant several times and even introduced a few friends to them. The food is authentic. The people are nice. The decor makes you feel like you are in Turkey (although I've never been) but I do like a lot. I especially love the dessert...chocolate cake with warmed fudge chocolate inside the pours out when you make your first cut. Delish!!!", "author": "Debbie W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-07", "description": "Came here this weekend for dinner and what we thought included a happy hour (on the website from 7-9pm) before going to a friends party in the neighborhood. We got there at around 7:30 on a very rainy Fri night and the restaurant was less than half full. When the waiter came over we asked about the happy hour special that was (and at the time of writing this review still is) posted on the Deniz website. The waiter said that it's a mistake and there's no such happy hour... he was also incredibly dismissive. Now, let me preface this by saying that it's true the $2/ drink difference from the advertised happy hour prices and the regular menu are not make it or break it but I feel like it is the principle. We told the waiter that we were still looking over the menus and watched him walk over to talk to the bartender about the happy hour deal. In the meantime, I checked the website and the happy hour deal was still up so I showed it to the waiter when he came back over and told him that since it's still on the website he should honor it. He was extremely rude and said no no then I asked him if I could speak to the manager and he said he was the manager (call me crazy but I have never seen a manager of a restaurant also posing as a young waiter). Needless to say dinner got off on a bad foot and probably had it not been pouring outside we would have left and gone to any of the other great restaurants in the neighborhood. \n\nBut, we stayed and truth be told the food was pretty good. We had the labni, ezme, sigara boregi, chicken satay and lamb yogurtlu. The food was good and the lamb was tender and tasty. I really have no complaints and had it not been for the customer service aspect would consider going back if I was in the neighborhood. But really, this is NYC and there are so many great restaurants on every corner, I wouldn't go back to an average Turkish restaurant with terrible customer service. Who knows, maybe next time they will charge triple what it says on the menu because apparently once you're at Deniz anything goes.", "author": "Julia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-04", "description": "Disgustingly oily. You'd be better off going to a food cart. It would taste better, be cheaper, and probably healthier. Also, their Turkish coffee was sludge. I don't mean it tasted bad (it did), but I mean it literally was thick and coagulated at the bottom. Like coffee pudding of some sort. Or icing. Except nasty.", "author": "Nathaniel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-06", "description": "Went here for lunch today with my bf. Only 2 other people were eating at the time, though I'm guessing it's more popular during dinner. Tried sitting inside but it was kind of stuffy despite having open window/doors. We ended up sitting right outside. It was kinda cloudy though the wind didn't bother us because it didn't go ape shit until an hour later. Since it was Saturday the lunch special wasn't available. Grrr. I had the Mediterranean salad (yummy) while he had  the lamb adana kebab. I had a taste - quite delicious. I'd complain about the bread not coming earlier but our food pretty much arrived almost as good as we ordered it. Decent prices as well.", "author": "Annie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-13", "description": "I really wanted to like this place, I really did, that being said, the place really underwhelmed me.\n\nMy friend the night before got some shish kebabs, and he liked them, so I figured why not try the place, and I got the baked lamb shank.  \n\nThe first couple bites were delicious, extremely tender, but the deeper I got into the shank, the more I realized this thing needed more time baking/braising.  It got extremely chewy, and really unpleasant.  Furthermore, the marrow inside the shank was all dried out!  The sides were pretty good, though, garlicky mash potatoes and an extremely succulent grilled tomato.  If I do order from this place again, I'll try something else next time.", "author": "Minh L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "Had dinner with family last night and the food was amazing! The service was excellent. We are HUGE fans of this place now. Best mashed potatoes and chicken piccata I ever had.", "author": "Kimmi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "I've been there a few times, and I also ordered delivery today. Their food is great. I always try something new, and I always find it delicious.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "They have a green salad with grilled shrimp on top. Very delicious ,big shrimp drizzled with garlic and olive oil.", "author": "Marsha D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-16", "description": "I really wanted to like this place since I used to live right across the street from it and watched it being built for months, waiting for it to finally open. In the end, though, it's unspectacular and overpriced. I enjoy the complimentary bread, and while most of the food is actually pretty good, it's not so good that it seems terribly much better than something I could cook at home. Excepting lunch and bar food specials, it's pretty expensive for what it is, too. I've only had the lunch once, a chicken gyro and fries, and the gyro was greasy and fell apart with a touch, and small parts of the fries were frozen. I know you get what you paid for, but for $10 I still expect fully-cooked food.\n\nAs a side note, the first time I went, the tablecloth left TONS of white particles all over my dark pants, but that was the very first night it was open so I'm sure they've since lost their shedding sheen. Oh, and the baklava was super-tasty, but not enough to save this place.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-02", "description": "Food is great, but the service is slooooooooooow.  Sat there for about 30 minutes waiting for the check while waiters just walked right past us like we didn't exist.", "author": "D A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "I went here with my sisters for dinner one night and didn't really know what to expect. I passed this place SO many times and never went in. SO glad I did :) My sister got a feta salad that was more like 3 stars. But at the end of your salad you have this flavored oil that is just left on your plate. With some of their AMAZING bread, it was perfect. For main course I shared a mixed grill which comes with beef kebab, chicken kebab, chicken shwarma and rice. Its alot of food and it cost be 18 bux but for the amount i guess it was worth it. The flavors with not over powering. Just very satisfying. I'm craving their food right now actually lol. But it didn't end there. They have a molten lava cake served with a single scoop of icecream. The cake is served and when you break into it the fudge just oozes out and mixes with your icecream. Really good. I def. recommend this restaurant.", "author": "Jasmine k."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-12", "description": "An expensive way to get FOOD POISONING. Beware of the Lamb Gyro, unless you really like hanging out in the bathroom.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-09", "description": "I love this place! I have not ever had a bad experience here (maybe it's because my fiancé and I were some of their first customers). Anyway, we do not eat meat but love seafood so we usually order their Akdeniz Levregi or Cipura. It's a deliciously seasoned fish (Sea Bass, I believe) served with salad and bread. IT IS DELICIOUS! I have been to more expensive restaurants and have yet to taste fish that's so foodgasmic. I work not too far from Deniz and when I'm craving a good meal, I place an order and walk over to pick it up... Their food is reasonably priced and their waiters have always been polite and aim to please. \n\nThe only not so great thing is that I ordered their chocolate cake which was suppose contain a WARM, THICK MOLTEN chocolate on the inside... I ordered something similar from another restaurant and enjoyed it so I thought Deniz's would be similar... to my surprise it was not. The \"THICK MOLTEN CHOCOLATE\" was more like watery hot chocolate. As soon as I stuck my fork into the cake the liquid flooded my plate. It did not slowly ooze out with grace but instead quickly poured out with a vengeance... I did NOT enjoy it. My fiancé on the other hand ordered something else from the desert menu and it was DELICIOUS. I cannot recall what it was but I ended up sharing his desert plate.\n\nOverall Deniz is a great place with great food but you might occasionally have an item you might not enjoy. (Hey, like people, not every restaurant will be perfect.)", "author": "Tremaine R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Pretty good Turkish food, takes sometime to deliver so i would recommend ordering ahead of time. I pretty much always order the chicken adana kebab. Don't order extra pita because every meal comes with 1 huge huge pita bread. Hummus could be better but I still order it every time lol.", "author": "Anum A."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}