{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-19", "description": "Just gave them another chance and its was a big mistake. As usual, service is a word unknown to this restaurant. Ordered lebni received three soups instead. Had this been once I would not be this annoyed, but this is consistent - you never get what you order whether online or when dining in. I feel sorry for their chefs - they do a good job, but it's completely wasted because managers and servers don't know how to put orders through.", "author": "Christy I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Unfortunately, I was feeling pretty sick the day we came here for dinner so I had to play it safe with my food choices. I went for the chicken soup and the ceasar salad even though I would have loved to have tried some salmon kebabs.\n\nI'm a firm believer that you can tell a lot about a restaurant from the quality of their more basic options and this was proved true with Deniz. The soup and salad were both great. The soup was thick in texture (but somehow had a lighter watery appearance) and the red bell peppers added extra flavour to the chicken, which was plentiful. The salad was a huge portion and the lettuce was crispy and fresh. There was a bit too much ceasar sauce for my liking but it wasn't too much of an issue as the sauce was light and not super-strong to taste.\n\nMy boyfriend had the chicken sautee and loved it. I sampled a small bit and it was truly delicious with an amazing combination of flavours. The chicken was of very good quality.\n\nPrices were great and I'd recommend the general area of non-touristy downtown Brooklyn for anyone wanting to experience a true New York community. There are lots of excellent restaurants here that are literally half the price of their Manhattan competitors.\n\nService was good. Would return.", "author": "Izzy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-09", "description": "FOR DELIVERY ONLY:\n\nI love this place. It's probably the easiest access I have to a healthy, whole meal. The order is always fast, and delivery guy is friendly.\n\nI often order the mixed grill (a lot of food!) and the chicken kebab -- I recommend both! The meat is delicious. Tender, fresh, flavorful. Rice has great texture and flavor; salad is fresh with tasty dressing.  \n\nI've also tried their falafels \u0026 lentil soup, which are both good.", "author": "Cameron M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-23", "description": "I visited Deniz with my good girl friend because she had been raving about it! I am so very glad that I went! The food was great! I had the Anad Kebab and the lamb was seasoned and cooked to perfection! The side salad was shining on the plate as well...it was pretty awesome! \n\nThe service was extraordinary! Our waiter was very nice and attentive.", "author": "Vivian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "such a great delivery spot in south brooklyn! healthy, delish and flavorful, i will definitely be ordering again.\n\ni got the mixed appetizer plate ($14) + a wonderful dessert called kanafe ($8 ricotta/sweet goodness - hard to explain, but lifechanging) that reminded me of my birthright trip to israel. \n\ni can't wait to try their kebabs one night! i ordered on yelp's newly acquired food delivery site, eat24.com. LOVE the cross over + discount codes + pay with paypal + chat w/ customer service on phone like texting + real time see your delivery updates.\n\ngreat variety of the menu! good for vegetarians AND carnivores!", "author": "jaclyn g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-09", "description": "NOT AUTHENTIC ! First we had to ask for bread ! Shepherd salad tasted good but NO CHEESE! I got lamb for my main the lamb was good but barely any rice ! Come on people rice is so cheap ,, So I ordered hummus worst hummus I ever had no flavor at all ... I never add salt or pepper to anything , it needed something ....the place looks nice but if u gonna have huge plates with barely nothing on it get bigger tables ! Service was also bad we asked for everything ! I would not recommend or try again !", "author": "G C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "Customer service is the best! I lived in Turkey for a year (proof by my Turkey badge) and this place was as close to authentic I found in the USA. Granted, I am coming from San Francisco to Brooklyn, but the food reminded me of my second home, Turkey. The wait staff is from Turkey and all over central Asia and they were as friendly and helpful as they come! I highly highly recommend this place, plus, compared to SF, the drinks are super reasonable! $10 dollars each! Whoo-hooo!!!\nAnyway, you must come and eat here! This was a great end to my first night in NYC, and since we are moving to Brooklyn, this will become my new fav place.\nP.S- if you have a dog, they have outdoor seating. Super-nice for you and fido!", "author": "Jasmine N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-07", "description": "It's really hard finding a place to get a late lunch/early dinner around here on a Saturday, with someone who's on a no gluten, no corn, dairy, soy diet. The places on Fulton were packed, with lines, the \"gluten-free pizza\" place didn't sound right. I was a little skeptical about Deniz, there were only a few diners there. \n\nOverall I think the food did the job and they didn't rush us out, we got to relax and recoup after the flea. I had the chicken adana kebab which was flavorful, with bits of red pepper mixed in. It came with a rice pilaf (tasty and fluffy- now I'm wondering if it IS out of a box, like other reviewers mentioned- we like it because it's the taste that we're all expecting rice pilaf's supposed to be). The dish came with a large mixed greens salad, I enjoyed the interesting flecked purple spice it was tossed with. Our waiter told us it was sumac. \nFriend got the chicken piccatta (is this turkish? no), she said it was good but \"light.\" She'll be hungry again in a few hours. The chicken breast came with a white sauce on top (menu said a white wine sauce?), a large portion of steamed fresh broccoli \u0026 carrots, and a large piped line of mashed potatoes (boxed?). I def feel this dish is there for the older crowds or people who are skeptical of ethnic food. The \"hamburger\" on the menu. \n\nFriend said her lemondrop was Strong! And my little Minute Maid can of lemonade was refreshing, but too bad they don't have fresh lemonade or maybe sour cherry if possible? \n\nOur waiter was nice and clearly new, a  lot of the staff seems to be young and new. The 2 owners? youngish guys in white t-shirts and jeans, that look like they can beat you up, were hovering around. Am glad that they seem very involved, restocking wines, but feel bad for the seemingly unexperienced staff.\n\nThe view is geat, at a great corner in the neighborhood and the restaurant is really open and relaxed, with outdoor. I just wished that they did \"Turkish \" all the way.", "author": "Joyce C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Hands down the best Turkish restaurant I've ever been to in the US, and abroad in fact. We've been there upon hearing about it from friends. We ordered a mixed appetizer plate which was remarkably delicious. Then I had a lentil soup (good) followed with the sea bass. Everything was very very delicious. I go there whenever I'm in NYC and feel like Turkish food.", "author": "Ekin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "I got takeout here while cleaning my old apartment in preparation to move out of the neighborhood, otherwise this place would probably be in the regular rotation!\n\nI got the fried liver cubes - had never tried liver before and this was really good. It came with a green salad on the side. The cubes are breaded with herbed bread crumbs and then fried but they're not too greasy or anything. I also got pureed lentil soup which was tasty but a little bland - came with a couple of lemon wedges and some bread which helps things a bit. I just like my lentil soup a little spicier I guess.\n\nI also saw that this place has kunefe which is so hard to find for some reason - it's a really great Turkish dessert. I didn't get it this time but if I'm ever back in the neighborhood I will probably make it a point to try theirs.", "author": "Christina L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-09", "description": "Horrible service\nOrder dinner and they forgot part of my meal. I called to have it redelivered and they hanged up several times; had to drive to the restaurant to settle the issue. I wasn't too pleased, who would be.", "author": "Omar L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-04", "description": "We got Deniz delivered to work. I had an oily chicken thing that wasn't bad.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-18", "description": "We ate here before a event at the Barclay's. The plus side is it in walking distance  (1 block) to the Barclay's. The food was nothing special. My chicken gyro was pretty dry. We have had better. The waiter was not very attentive, he kept forgetting things.", "author": "Sa K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-17", "description": "Biking through Fort Greene on a Sunday, it was a little hard to find a place that wasn't crowded. Since I had Turkish food before,  I was super excited when I came across Deniz. Hubby and I went inside and ordered drinks and food. The waitstaff were very nice and we ordered the yogurt chicken dish. I'm not sure if yogurt chicken with croutons is a part of Turkish cuisine, but we ordered it anyway since we've had yogurt meat dishes at other Middle Eastern restaurants and its always been really good.\n\n\nWe were a bit surprised when the dish arrived. For $16 and some change, you get some salt and pepper chicken in a tomato/yogurt sauce with soggy croutons and a side of white bread. No rice and no vegetables. The dish was supposed to have garlic too but I didn't taste it, only salt and pepper. It wasn't bad, but it wasn't anything spectacular either. My husband thought that the sauce tasted like they poured it from a can of Chef Boyardee. I have to agree.\n\nI can't speak for the rest of the dishes because we only ordered that one, but I must say I am not compelled to come back again for such a mediocre dish at a high price. It would have been nice to get some rice with it, then it would have felt more like a complete meal.", "author": "Cali D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "Deniz is one of my favorite delivery places around Downtown Brooklyn/ DUMBO/Brooklyn Heights area. Very friendly staff, fresh ingredients, delicious food. Being myself from Middle East, I know what good Turkish food has to taste like. Adana Kebab full of flavors, freshly baked bread and my favorite part - Turkish rice that they execute just the way it supposed to be! Keep it up and we will keep ordering!", "author": "Kamila S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "I really like this place. The food is very good, and it's cozy. The staff was nice too.", "author": "Maria N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-14", "description": "Tip: I do not want to smell your Drakkar Noir or whatever strong cologne you are wearing when you serve food. That is restaurant 101-type stuff. It messes with your ability to taste the food.\n\nBut the food didn't have much taste anyway. Everything except the hummus needed a dash of salt. I love a good falafel, but this just didn't do it for me. I've had better lentil soup from a can.\n\nI really wanted to like this place.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-17", "description": "Rhea, below gave already the exact right description, but, I wanted to share mine and it's not real good. The nicest thing I can say is that the staff is very friendly. \nI came in with a friend who apparently loves the food here. \nWe each ordered 2 starters. They found that pretty confusing and couldn't figure out, even though we asked to have first one, then the other dish.\nI got both dishes at the same time, the falafel was burned and it came with a white sauce that had a vinegar taste . My zucchini pancakes were soggy with again that white blob sauce. I apologized and told the waiter that in general I don't send food back, back but this was real terrible\nThey agreed on the falafel but not on the zucchini  pancakes? Really? You see I didn't like it, why argue? \nI left hungry and will definitely not be back.", "author": "Adina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-25", "description": "Fun!\n\nThe lady and I dropped on a whim for a late-night snack and drink.  Unsure if they were trying to close down, our apprehension must have been obvious.  The bartender came outside and urged us \"Come in!\"\n\nSitting at the bar, we were greeted by friendly staff.  Burak the bartender made us laugh the entire time we were there.  They were obviously winding down for the evening, yet made us feel welcome.  We bantered with the staff, enjoyed a lamb kebab and some hummus, and wandered back out into the night.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-05", "description": "Gyro omg it's freshest gyro I have had \nWait stuff so friendly I definitely recommend it if you around Barclay center you have to try it", "author": "Aleaf S."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}