{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "Awesome Food, Awesome service.   Try the Babaganoush or any of the entrees, I am a big fan.", "author": "Erich B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "My girlfriend and I came here tonight, because we happened to walk by the place earlier and we both like Turkish cuisine.  We had an amazing time! We had the Sigara Boregi as an appetizer, and I had the Chicken Adana Kebap as entree, whereas my girlfriend had the Manti. All the food was amazing! I hadn't tried the dishes when I was visiting Turkey, but my girlfriend  assures me that they are all authentic. They were definitely delicious.\n\nThey also had great cocktails (try the blackberry cosmo), and the desserts were awesome, particularly the bread pudding! The Kunefe and the rice pudding were great too.\n\nAll the staff was really friendly too, authentically Turkish or from central Asia :)\n\nWe had a great time, will definitely come back soon.", "author": "Christian B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-02", "description": "My husband and I went to this place after hearing good reviews about this place. We found the food to be just about ok. The food was kind of hard and not very rich when it comes to flavors.  the grilled salmon was kind of hard and tasteless, even the mashed potato seemed too firm. The falafels were ok, not the best we have eaten. We also thought the food was not as great as it was priced on the menu.", "author": "Chinmayi V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "Great food, though it can get a little pricey. They are amenable to making changes for allergies and are pretty quick with delivery. My office loves the food and we order quite regularly.", "author": "Dan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "The food was very good and fresh. The lamb adena was excellent and so was the salmon kabob. A little on the pricy side, but a good place if you are in the neighborhood.", "author": "Jonathan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "This is the best Turkish place in Brooklyn. Their food is delicious and always fresh, whether you're dining in or taking out. The service is great. The best item on the menu for me is the Branzini (sea bass). This NEVER disappoints. The seafood pasta is also good.", "author": "Candice F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-20", "description": "Food is very fresh but not much of it. I love the fact that they included a big break with every lunch order and not be cheap and cut half of it. Food was delivered within fourty min and was still warn when I got it.", "author": "Aleksandr S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "I loved this place.  Nothing fancy.  Very friendly.  Nice for a quiet lunch or early dinner.  Feels like a neighborhood spot.  Service was great.  Falafel is delicious.  My boyfriend had gyro and enjoyed it.  I had chicken shish kabob and salad and enjoyed it.", "author": "Megan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "Our family of five ate here while visiting Brooklyn on a Tuesday night. The staff was friendly and efficient. The food was amazing. I had the chicken shish kabob and the chicken was well cooked but tender. The salad that came with it was great, as well. My daughters, who eat at our local Mediterranean restaurant often, were amazed at how tender their lamb kabobs were. My husband raved about the beef kabobs, which were cut into bite sized, tender pieces. We had ample portions, more than enough to have left-overs for two people. I just wish our Meditarranean restaurant at home tasted this good!", "author": "Claudia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "Recently I played a game called The Awesome Game where you submit some of the most awesome things in the word, and your submissions are pitted against others and you argue them mock-trial style.  I'm a nerd.\n\nThe reason I mention this is because one of my submissions was bread.  Yes, bread.  Bread was up against such amazing things as Nelson Mandela, Beaches, and Photosynthesis, etc.  Well I learned something as I passionately argued about how bread is both basic and decadent, simple and refined.  As I argued that bread was one of my most favorite things ever, I learned that others, apparently, don't feel the same way.\n\nWell, for those of you who feel like I do about bread -- and come on, yelpers, I know you're out there -- you should know that Deniz has very yummy bread.  When you order delivery, each dish gets its own appetizer plate-size round of golden crispy foccacia dusted with white and black sesame seeds.  And it is so, so yummy.  You'll never want pita again.\n\nI've never eaten at Deniz, but I order take out from there.  Their salmon scallopini is great, so is the char grilled shrimp salad as well as the octopus salad.  The hummus is also fantastically creamy and delicious. The zucchini pancakes, lightened with mint, are also tremendous.\n\nI highly recommend it.  But leave room for bread.", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "I've been to Deniz a few times. Once was with a large group of Manhattan friends who got their passports together and came to see a show at BAM. Another time was with two close friends and a third time was with just one person. Each time, I was pleased. The staff seems to know how to handle their duties of hosts quite well. They were not annoyed by me and my friend having a long and leisurely dinner, and they were nonplussed by the big group as well. There was one mistake with an order and they were gracious about it and even managed to get a laugh out of the whole thing. \n\nThe ambiance of the restaurant is a little odd. It is a big, open and ugly  corner space. The tables and chairs are arranged in such a way that must maximize the seating but does not really create a pleasant feeling. It gives the feeling of an unfortunate cafeteria, which is shame because it's much more than that. The menu too is a little hard to read. All in all, it seems like a diner has been upgraded to a restaurant. \n\nAlthough the ambiance is still the quality of a diner, the food is really quite good. I'll second the comments on the bread, and it is really great with the ezme and other cold appetizers. I've tried the sigara boregi and the zuccini pancakes from the hot appetizers. All were fresh and prepared well. For entrees, there is a wide selection of grilled meat and fish. All are prepared well, although the presentation was more like a diner style then a fine restaurant. \n\nThis is not to say that they should try to upgrade to a more restaurant feel; to the contrary, they should stay the way they are. Just don't go there thinking you are going to a fancy restaurant. But with that in mind, I think the prices are a little bit high. I appreciate that everything seems to be made fresh and there are plenty of staff working to make sure you are being taken care of, but entrees that are $15-$20 imply a different caliber of experience. \n\nSince I like the food, I have also been ordering takeout. It comes fast and it's still hot. I've gotten in the habit of ordering an extra yogurt type appetizer with the meal. That way I get an extra piece of the great bread. I save these for breakfast the next morning! Great way to start the day.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-27", "description": "I have been to Deniz on a couple occasions for happy hour.  It's nice to sit outside and enjoy a glass of wine or two with friends. But then they changed their happy hour to 11AM to 5:00 PM. WTF?  Clearly, the owners don't understand the concept of Happy Hour.  The current hours may be okay for the weekend, but it would be great if they could offer something during the week from 5:00-8:00 like most establishments do.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "Started with delicious yogurt-topped zucchini pancakes and average ricotta/spinach eggrolls. The bread they brought to accompany appetizers \u0026 meal was a superb sesame foccacia. We ended up going through 3 baskets of bread during the meal, and even still I was craving more!\n\nMy lamb sautee was phenomenal! It's served in a bowl as a mushroom-based stew with onions, red bell peppers, and more shrooms to top of the hearty sauce. Very good, will be returning for sure.", "author": "Thomas B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-07", "description": "What can I say? Excellent food and superb Service. I went here 3x in the past week. The food is so tasty! Tried the Lamb Adama, my sis tried the fish entrees and loved, and friend tried the chicken piccata.  It was so delicious as I couldn't help but stare at her plate until she offered. I will be sure to order that the next time. They have a 15% off coupon that they honor on Mon \u0026 Tues. The rice pudding is to die for!!", "author": "Raquel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-29", "description": "I found this restaurant while walking in the Fort Greene neighborhood. I went in for a drink and appetizers but ended up eating everything on my plate and wanting more. Then I returned Christmas eve with my son and his fiancée for one of the most delicious meals ever! We went back again a week later and took  a friend from Boston who also loved the food. The service was great and everyone was very nice and friendly. But the food was the star of the show!:) Try Raki! Oh and the grilled branzino was the best!!", "author": "ZaZa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-06", "description": "Well the food is pretty standard ! Decent hummus tray, nothing to write home to mom for, but decent none the less.. I like the chicken piccata, but this past experience with dish felt rushed, with a skimpy amount of meat and boxed mash potatoes ... Liquor was way to strong, I actually had to send it back for some flavor... Baklava was out of this world delicious ... I would go back, but i am in no rush !", "author": "Ricky J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-22", "description": "awesome food, terrible delievery service.", "author": "Oluwakemi O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "Deniz was recommended to me by a client and it is now on my list of favorite places in this area of Brooklyn.  The lunch special portions are generous and the prices are reasonable.  Excellent service.", "author": "Karen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Great food. Great decor and ambiance. Love the chicken Kabob special. It's pretty cheap for 2 people as well, and for lunch they are very fast.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-07", "description": "Only so-so. It's big advantage was the price and its proximity to BAM on a cold, rainy night. My branzino was good, the salad overdressed and inedible. An absolutely ordinary Turkish restaurant. Service was lovely, though.", "author": "Carolina D."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}