{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-20", "description": "Fast service my arse.  Have been waiting 55 minutes and haven't received my order.  Not sure what the other reviews are talking about.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-02", "description": "What a mistake! they will never see me again. We went for dinner last night, ordered two appitizers and two entrees. We waited and waited, finally, BAM! ALL the food on the table at once served by at least 20 waiters who never came by again to clear our table...And the food, just SAD...", "author": "MoMo D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-27", "description": "I honestly dont know where any negative reviews came from, this place is great in my book. its down the street and makes an amazing lamb kebab that they serve with housemade hot sauce that is amazing. All the entrees come with salad and rice and are very filling. I have ordered to dine in as well as delivery, and it has always met my expectations and been delicious. We also love the hummus from here. My wife gets the chicken kebab and always loves it as well. I havent ordered anything else for food, but the lamb and chicken are great. Mixed drinks arent really that good, but they have a full bar as well as beers. Check it out, I think you will enjoy it!", "author": "AJ K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-21", "description": "I used this place to cater food to a doctors office in Brooklyn. The food tasted great. 3am I wake up and rush to the toilet.  FOOD POISONING.  I was sick for 7 days. When I mean sick I was ready for the emergency room.  Thank goodness I'm better now.   My coworkers and everyone who ate was sick as well.   Stay away PLEASE!", "author": "N T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-14", "description": "Oh why didn't I check yelp before I went here?  I went there because I wanted to try someplace new in the neighborhood and my date was craving Turkish food.  We ordered an appetizer of eggplant salad which was fresh with some bread that was warm.  We were happy with appetizer.  However, the 2 entrees we ordered we severly dissappointing.  We ordered the 2 dishes that you must make well if you want to call yourself a Turkish restaurant.  The lamb shank was  dry, overcooked, came with very little sauce.  The mashed potatoes that came on the side with the lamb were dense and not tasty at all.  I ordered the Brazini, which is a whole fish that is grilled. It was lacking that typical robust Turkish flavor I was looking for.  Actually it was rather plain with some sprinkling of lemon juice.  So 2 bad entrees = 2 stars.  There are much better Mediterranean restaurants to try in Fort Greene.", "author": "Kevin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-31", "description": "I *love* this restaurant. I've been here 3 times! The fresh baked bread is delicious, especially with hummus. I love the lamb kabab. It comes with rice and salad.\n\nThe service is great! It's not far from BAM and Atlantic Mall. Can't wait to go back next week.", "author": "Sheryl M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-19", "description": "This is a review of the delivery service. The flavors here are really, really good. The portions, however, are laughable. We spent $50 on a delivery order for 2 people, and remained hungry. There's a reason they give you a big piece of bread with your meal - it's the only possible way you could find what they call an entree filling. I don't eat carbs, and for $16, got a very small amount of lamb over a small mound of eggplant puree, 1 hot pepper and 1 tomato. Seriously, that's it. The taste was really good, and had it been billed as a $7 appetizer it would have been reasonable. At $16, it's outright theft. We also ordered the Deniz salad. Again, good but for $8, tiny. I felt cheated, and would never order from here again.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "A lot of these reviews are kind of unfair, because you guys simply are not ordering the right dishes. Seriously. \n\nThe place is called \"Deniz\" and has a fish as its logo for a REASON. That reason is, GET THE DAMN BRANZINI. It is probably the best bit of whole fish goodness you'll find in the area. And I'm serious about my fish. Give me a whole one, and 20 minutes later it's ready for display at the Museum of Natural History. \n\nAlso, as an appetizer, get the Shepherd Salad. It's a very simple Mediterranean salad that they do perfectly, with mint, parsley, feta and SUMAC! Yay! I'm not really a tomato person but really, these guys must get theirs shipped from some holy tomato oasis. They are PERFECT.\n\nNo, their lamb gyro is NOT spectacular. But their kebabs are. And the marinated steak is to die for.\n\nAll in all a very good place. The service is very nice and attentive. And they love my mama! A+!!\n\nYes, I agree they can be a little on the pricey side. Which is why I only make stops there while riding on the parental gravy train.", "author": "Gabrielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "My first time at this location, I had the lunch special. The service was very good, the prices were very fair, and the food was terrific! I can tell quality and this place was all about it...I have to go back for dinner, but so far so good..", "author": "Sean P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-18", "description": "Is is possible to give this place a zero? The WORST service ever. We ordered a few things and we've been to a lot of authentic turkish places but this one was just plain disappointing. Meat was cold and not cooked properly. instead of bringing out another dish they just microwaved it and brought it back to us. I would really recommend nobody go here. Worst experience.", "author": "Momina A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-19", "description": "Menu item #1 \"French Onion Soup\"\n*warning bells are ringing* \"Turkish Mediterranean Cuisine\" does not usually feature a French Influence...\n\nThis place was not terrible it was just nothing special. The portions were small and the cost was HIGH (seriously? $12 for Chicken GYRO - they're $3 on the street and better) \n\nAlso the delivery guy did not have a credit card sheet for us to sign so we just tipped in cash and then got an angry call asking us when we did not pay more than $5...when we informed them that we had indeed given them a CC they seemed confused, said they lost the piece of paper it was written on....!!!??  asked for the info again and then made the poor guy come out again to have us sign...\n\nI'm totally having my identity stolen because of these guys...thanks a lot Peniz", "author": "Furyk C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "i love turkish food. you can imagine how happy i was to find this place right next to barclays center. after the nets game my friends and i went straight there. it was 7 of us, we were seated fast and really comfortably. the waiters were running around non stop making sure our table was clean and we received everything we needed. i ordered branzino fish, my friends had lamp chops, chicken and lamb kabobs. we shared our food with one another and everything tasted  great. very cute place with good food walking distance from barclays center.", "author": "Gary P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "Ordered delivery on seamless and it was fantastic! Quick service to an area I wouldn't expect them to deliver to... Great tasting and quality eats! Would order again or eat in in a jiffy!", "author": "agata t."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-25", "description": "Got some 11:00pm delivery from Deniz, and it couldn't have been better. \n\nWell...I guess the falafel could've been seasoned a little less harshly. But that could just be my tastes.\n\nThe chicken kebab was standout, and the bread came warm, soft, and delicious.\n\nI'll definitely be checking out more of their menu in the weeks to come.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-26", "description": "My boyfriend is Turkish and hes always trying to find god Turkish food around NYC. He loves this place and so do I! Its pretty authentic, the waiters are very friendly and all speak Turkish. I've been there many times, my favorite thing to get is the Iskander (they only have it on weekends). Its something that is hard to find in the U.S. but this place has it and its done well! I would recommend this restaurant to anyone who loves Mediterranean food, its a hidden gem in Brooklyn.", "author": "Yara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "My partner and I ate here for lunch on the day it opened. We were both pretty happy with our lunches. I have since returned for dinner, and it was also very tasty. No complaints here.\n\nFor dinner I started with the Ezme salad (spicy tomato salad/relish served with grilled or barbecued meats). A generous portion of warm, fresh pita bread was served along side the ezme. For the entree, I decided on the Adana kebab, a kebab of ground, spiced lamb. All the entrees are apparently served with two salads; a simple Mediterranean salad and a pickled shredded cabbage salad. Both are fresh, crunchy and flavorful. The lamb was perfectly cooked. It was hot, tender (no knife necessary), and juicy. I had Ezme salad leftover, so I mixed that with the lamb. This combination actually made my mouth water - it was a very good mix of flavors!\n\nSo far so good. I look forward to trying Deniz again sometime. I like what I've tasted so far.", "author": "Alex G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "What a lovely secret jewel of a restaurant! I don't know the names of what we ate but all the appetizers were great. The chicken shish kabob with salad \u0026 rice was excellent. The service was attentive bordering on the obsequious but hey what's wrong with obsequious after a long day of work?", "author": "Ileane S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "I was skeptical when this place opened based on aesthetics alone, but after numerous visits, I can say this is one of my favorite places to get food in the neighborhood.  I've probably tried about 50% of their menu and have not yet been disappointed.  My recommendations are the zucchini pancakes, all of the cold appetizer dips, chicken yogurtlu, lamb shank, and salmon kebabs.  Prices here are reasonable, and the staff is always courteous.   While the ambiance may leave more to be desired, this is an overall excellent restaurant.", "author": "Ann J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-23", "description": "This is the best Turkish cuisine I've ever been in nyc. They have such a flavorful menu. You should try their appetizers. I also enjoy their sea food selections besides their delicious, moist kebabs... The staff was very friendly and helpful.", "author": "Matthew K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-31", "description": "No one does lamb better.  We had three people eating and every one of our meals was perfect.  Very attentive service. Wine was terrific as well.  Came back a second time while staying in the Prospect Heights neighborhood of Brooklyn.  Want some great Mediterranean food, this is the place.", "author": "Craig H."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}