{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Looking for a place to eat before a performance at BAM.  This hit the spot.  Not crowded.  Good service.  Had the 'Lamb Chop with rice and salad  - $21.95' special and it was very good.  Had a glass of the house Turkish red wine.  Just what I was looking for in a sit down dinner.", "author": "Phyllis S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "This place doesn't look like much from the outside but don't judge a book by its cover. The good is delicious and their service is great. Hidden gem", "author": "Juliana O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-30", "description": "Delicious babaganush, fresh salad with light lemony dressing and shredded feta making it nice and light....and incredibly accommodating service...needed help with elderly relative transferring from a wheelchair and they couldn't have been more helpful!", "author": "Abi H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-31", "description": "My wife asked the waiter at Deniz if the salad was big enough to be an entree. His response was to shrug. That pretty much sums this place up. The wait staff is disinterested and the food is thoroughly mediocre.\n\nWe ordered the sigara boregi for an appetizer. It tasted a lot like frozen spanakopita that had been microwaved. For an entree my wife got the falafel plate, and they screwed up and gave her the falafel appetizer.  I got the special beyti kebab, which was pretty bland.\n\nThe fact that a Turkish restaurant has penne alla vodka and buffalo wings on the menu should have been a warning. This place must just cater to the pre-BAM and stadium crowd.", "author": "Tony D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-28", "description": "It was my first time with this place. Food and ambiance was average but service was bad(they were so slow and actually they don't know how to serve.) although if you wanna go some different places you can choose this place. I can't assure that you're gonna be satisfied but you should give them a chance...", "author": "Semi F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "The food was great. I would come back anything. Good authentic Turkish food. Make sure to have some raki. The rice pudding was a great way to finish the meal!  Oh! Don't f forget to order some Turkish coffee.", "author": "Arif K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-05", "description": "This place is just mediocre/average. The prices are affordable and the ambiance of the restaurant is pretty chill and a good lunch restaurant to try. I wouldn't recommend this place for Mediterranean. Tristan and I got a yogurt dill appetizer (served with pita), chicken adana kebab platter, and a chicken \u0026 mozzarella cheese w/ asparagus platter. The dip and pita was solid, but wasn't anything astounding. My chicken platter, I wasn't even sure was chicken. It smelled and tasted more like lamb, but the salad that comes with it is amazing. Tristan enjoyed his chicken dish, but liked the potatoes a lot more. Service was timely and they were very patient with us.", "author": "Natalie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Some friends/family we all got together and came here tonight for the first time; the food is delicious and the service was great.  The staff of the establishment and the waitresses are very warm and friendly; the atmosphere is smooth and relaxing.  We will be coming back.", "author": "Sharon W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-18", "description": "Good and casual Turkish restaurant near BAM. We ordered a bunch of food to share. Started the mixed appetizer which was delicious, which is taste of various other apps like hummus, eggplant salad, babaganush, and tabule. I wished it came w/ pita bread instead of some focaccia type of bread. Also ordered the shepherd salad, which decent but it was drenched w/ dressing. The grilled calamari salad was tasty but wanted more of the calamari. And then we ordered the lamb shish kebab. It was really delicious. The lamb was juicy and perfectly cooked. We went b/c menu looked decent, price was reasonable and close to BAM.", "author": "J L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-18", "description": "Food was decent. Good salad, bread and salmon. Mediocre chicken. Delivery was a little slower than expected (but only off by ~15 minutes).", "author": "Alex R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "The best and freshest I have tasted in Brooklyn! Food fresh off the grill with smoking flavour. I would leave Queens any day for a taste of Deniz.", "author": "Aly N N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-02", "description": "I am turkish myself. have been living in the area for 7 years. finally gave a try to this place. Huge disappointment!!!\nFood = I can do better at home. dry, far away from great taste and weirdly small portions for the money you pay.. I wish the food was not so dry and well seasoned then I would be happy to be their random customer. \nit is great to have turkish place around but food deosnt want you to come back here again.\n\nAnother thing annoyed me is the tea and dessert. yes we are out to spend money but you want to get good service and good food to make you happy.\n\n$2.50 tea was full half of the cup and it was cold. chocolate souffle was burned.\n\n\nSadly, thsi was a huge disappointment. No way I would go  nor bring some friends.", "author": "Umut B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-26", "description": "You order chicken they send you lamb. And when you ask for a refund they ask to pick the food up!!! Never seen this before! And I wonder what they do with the food after that?! \n\nDo NOT order from this place! Terrible experience!", "author": "Sus B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Mixed grill is awesome. So delicious and worth every dollar. I find on Fridays it's more fresh than say Saturday or Sunday. Nonetheless they have great staff who are attentive and wonderful food. Located near great desert spots.", "author": "Hamzar A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "The food was good and not expensive. The only reason that it is not 5 star was the speed of service. Also the table staff seemed like they were disengaged. Other than that a decent place to eat", "author": "Alex R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "One word: AMAZING\n\nIf I could give more than 5 stars, I would. I work close to Deniz and I go here consistently for lunch. They have a very reasonably priced lunch menu that allows you to have an entree and an appetizer. I love their tabuli and their shish kabob and their adana kabob. Actually, I love everything. I've gone here a million times and they have ALWAYS been great. Consistently fresh, clean, and delicious. \n\nWhile the food is definitely the star, the staff is what really makes this place somewhere I constantly want to go back to. They are the nicest and friendliest people. They are very attentive, they provide great food recommendations, they always bring everything out in a timely manner. I absolutely love this place.\n\nIf you're looking for a great lunch spot, I recommend this place. If you're looking to take someone on a date, I recommend this place. If you're looking to have some amazing Turkish food, then I DEFINITELY recommend this place.", "author": "Mariam R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "I've been going to BAM for years but never happened into Deniz until last night, and I'm so glad I did. The sauteed chicken entree was delicious; small and savory chunks of chicken that were piping hot. Accompanied by a great glass of $8 shiraz wine, Sooo good!", "author": "H F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-29", "description": "I ordered a falafel plate, which was small ,overcooked , dry  like it sat out all day  and it came which 1/8 cup of shriveled lettuce, ketchup container size of hummus and no - no tahini sauce or pita. How is that a plate . Reasonable delivery time , and polite , friendly delivery person. Otherwise waste of money", "author": "Pam W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "I find the whole Fort Greene area lacking in good, affordable food. And it's no surprise: the rent is expensive. I've been to Deniz many times over the years. It is a decent restaurant with food that tastes good. Nothing mind blowing, but nothing else in the 'hood is mind blowing either. This is a Turkish restaurant, so I would not necessarily get the hummus (not Turkish; I taught my mom how to make hummus, now it is a thing all Turkish restaurants serve, because they are trying to fulfill expectations, and most people don't know the difference between Turkey and the Middle East) and falafel (not Turkish). The manti is decent, well seasoned lamb in yogurt drizzled with butter. The kebaps are also well seasoned. The yogurtlu Adana (Adana kebap with yogurt is all that means... Adana is a proper noun, as it is the name of a city) is similar to an Iskender kebap, and always a tourist favorite in Turkey. Here, it is usually well done, the fried bread at the bottom is crispy in parts and soaked in the tomato/yogurt sauce in others, just as it should be, the meat is thin and well done, just as it should be, served with a grilled tomato and (usually) hot green pepper and some rice (a classic way to serve kebap in kebap houses in Turkey.) Rice is what I call \"kebap house rice\" meaning it is NOT the most delicious, fluffy kind of rice we would make at home, but it is standard for kebap houses at home. \n\nMy friend's mother once has the grilled salmon, which was fresh and perfectly made. The bread can be hit or miss. This is the one gripe I have in Turkish restaurants in the US, they all serve pide (flat-ish bread, which is usually ONLY made in the month of Ramadan in Turkey... otherwise, Turks are addicted to their white, fluffy French loaves). The pide can be fresh or not so fresh, depending on the day. If it is not warm, send it back and get a warm batch, which will taste better. The meze (small plates) are good. I have never had non-crispy sigara boregi (deep fried phyllo dough filled with feta cheese), here, so not sure how unlucky some reviewers are (or what their definition of crispy is?) The mucver (zucchini pancakes, more like patties) is always dependable, though the cook in Deniz likes it very well done (so can be crispy on the outside, a little charred even, which is totally acceptable; and is how some people prefer it). There are two kinds of eggplant salad: the smoked mushed eggplant (what most people know as baba ganoush) and the fried eggplant with tomatoes, etc. The former is good here, and healthier. The latter is meant to be oily to dip your bread in (in fact, dip your bread in everything, as this is how things are supposed to be eaten!) The latter is my favorite (also because you can easily make a delicious baba ganoush at home, while deep frying the eggplant to make the latter salad is more difficult and messy). Leeks in olive oil are always a good choice (this will be served cold or room temp, a bit on the sweet side sometimes (my mom would put a pinch of salt and a few pinches of sugar in this dish, which is typical of most olive oil dishes that are served cold; again dip the bread in the olive oil...)\n\nDessert: hands down, if you have the time and if they have it, kunefe. The mozaik cake (mosaic cake, some sort of semi-soft chocolate thing with crackers throughout) is a fave in Turkish coffee spots and bakeries (like Kahve Dunyasi, kind of like the Turkish Starbucks...) It is NOT necessarily for Americans who associate chocolate with very sweet. So the crackers bring down the sweetness (a typical way Turks eat sweets is to bring down the sweetness with bread or pastry; for example, back in the day, you could go to a bread oven and get a whole fresh French loaf cut in half with a slab of halva in the middle... yummm! Otherwise that much halva is way too sweet! killer breakfast, literally :P ) The kazandibi (bouncy milk custard) and rice pudding (baked on top in the oven) are decent. The Turkish coffee will take time, but is well worth the wait. Sugar is not added later on; you have to indicate how much sugar you want (none, a little, medium, lots).\n\nThey also carry Efes, the Turkish pilsner beer. Sometimes they have the dark one, as well. The Cankaya is good for wine. I don't know if they have it, but if they do Okuzgozu (bull's eye!!! It's the name of a place, and the grapes resemble the dark eyes of the bull, apparently) is supposed to be very good (Turkey does have some of the oldest wineries in the world, archeologically speaking!)\n\nOne thing I wish Deniz had was lahmacun and pide (which would require a special oven...)\n\nAll in all, Deniz is a good, dependable choice in the area that won't break the bank. It's perfect for anyone who does not care to have a bland, unseasoned burger. Together with Olea, it is one of our favorites.", "author": "C. G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "I've never been a fan of Turkish or Mediterranean food, so I don't eat it that often, but my friend suggested this place while we strolling through Fort Green. And I have to say, it wasn't bad! I was a little taken aback by the fact that there was definitely Italian and American foods on the menu, as well as a specialty dessert martini menu, but hey, if the food is good, then the food is good.\n\nMy friend got a salad with chicken, fresh mozzarella, and other assorted Italian dressings for a salad. The chicken was described as a \"BBQ chicken\", which I thought was odd, but my friend really liked it. I got a penne alla vodka (because I don't know anything about Turkish food, so I thought it would be a safe bet), and it was delicious.\n\nOur waiter was nice enough - not friendly, but not rude either. The place was basically empty when we came in at around 3, but maybe it was because we came in at the in-between time for lunch and dinner. I would say my only problem with Deniz is that it had more than just Turkish/Mediterranean food, which just seems so odd to me. Also that my waiter could have definitely been a little bit better. But my experience with this place is more positive than negative, and I didn't get food poisoning like so many of the other reviewers unfortunately got, so that's a plus.", "author": "Rachel L."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}