{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "Pretty solid, if not especially remarkable, mediterranean food place.", "author": "Daniel V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-25", "description": "I have ordered delivery from this location a few times and I haven't been too disappointed with what they had to offer.\n\nMy most recent delivery order was the Chicken Shish Kebab as a lunch deal. Costed about $10-15, I don't really remember. Pretty much consisted of 5 pieces of chicken, white rice, a choice of a side which I choose house soup and a giant bread. There is another side, I think it was salad, but I can't remember. The meal doesn't really exceed my expectations, just good enough to make me full.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "On our way to a show at the Barclay Center. Wanted to grab a pre drink and small bite to split among 3 people. Got the babaganoush and mixed grill plate that came with different skewers. Perfect amount and very tasty. I could taste all of the spices. Would come back.", "author": "Quynh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "Until recently, my experience with Turkish food has been somewhat limited (falafel, gyro, hummus and other items that aren't merely Turkish, but native to the Mediterranean/Middle Eastern region generally). But then I made a Turkish friend, and he has coerced me deep inside a wild world of lamb and spices.\n\nSince you make my world just a little bit brighter every day (yes, you), I'm going to share the most important piece of newfound knowledge with you (and because I know you're pressed for time, I'm going to leave out all the things that he's educated me on that have nothing to do with Deniz*):\n\nYou want the Yogurtlu Adana. \n\nI've seen it called other things at other Turkish joints, but essentially it's a lamb adana kebab topped with a garlicky yogurt sauce. The kebab has been cooked in butter and tomato sauce, and it's then laid over bread that soaks up all the delicious lamb juices and any stray sauce. This is what's good.**\n\nIf your lady friend is as skeptical of lamb as mine, hide hers in the Manti. Manti is sort of like gnocchi, but stuffed with seasoned lamb and onions, steamed, and served in more garlic yogurt (Turks like garlic yogurt). \n\nAre you really hungry? Add in a mixed appetizer plate. It's all sorts of mouthwatering dips, and they are the perfect reason to devour every bit of the thick, crisp, golden focaccia-esque bread served with every order. \n\nDeniz will deliver all this to your door quite promptly. Enjoy.\n_______________\n\n*Such as hookah, projecting video games on the side of a building, and a deep, burning hatred for Greeks. \n**But beware the green pepper in this dish. I tried a small bite, and my mouth went numb instantly. If you must prove your manhood, keep some yogurt handy.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-01", "description": "Came here for a rush meal. Its 5pm and I haven't eaten since my morning oats at 7.30am. So yes I am seriously hungry and on a food hunt.   I had some vague memory of eating at Deniz some years ago [before becoming a Yelpper] so I thought I would go for it.   Service was immediate, quick no messing about.   I ordered a Gyro plate which came in 5 minutes so maybe the chicken was already cut or they have some magic slicer that whips up food in record time. In any event the chicken was good, the salad great and the bread ok.  No complaints [I didnt bother with the rice] Tasty fast and unceremonious. OK I am going to start taking food photos for this Yelp thing from now.\n\nDeniz is ok food. Not brilliant ambiance, actually its quite dull though I had a window view onto Fulton so I could watch at my leisure the cops pick on a skate border and cyclist for who know what. Pathetic these people are truly sad. \n\nThree stars because 4 seems too much but I would eat here again if I was around and hungry. I wouldn't wake up and say, hmm I think I'll go to Deniz today.....", "author": "Sokari E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "The fried calf livers with red onions..OMG I'm addicted!! Had them delivered,  came sooner then expected", "author": "LaWanda G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-03", "description": "We were hungry but as I never eat my entrée after having starters (appetizers), we went straight for it. \n\nWe had the marinated Ribeye medium rare (14 oz.)...$24: served with steamed vegetables and French fries and a heineken. Hehehe. Wanted to replace fries with mashed potato but we had to pay for the mash as a separate side. \n\nWe also got a mixed Grill... $20: combination of chicken, gyro, chicken shish kebab, lamb shish kebab and adana kebab serve with rice and mixed green salad. \n\nOur food was tasty but as usual I had to get a doggie bag. Americans serve really large portions boy!\n\nMustapha our server was good. Their credit/debit card machine was down but fortunately we were told this at the beginning and had to leave to make a quick ATM stop. \n\nOverall this is a nice spot that I'll recommend. \n\nThe End.", "author": "Freeyah-Knycky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "This place is amazing!!  I was born in Bulgaria, and the eggplant salad is EXACTLY like my grandmother and my mom make at home. Just roasted eggplant with some garlic and red pepper, not too much vinegar like a lot of other places. \n\nI have a very sensitive stomach and I get heartburn or stomach pains from eating at restaurants where the food is too processed or greasy, but I have NEVER had a problem here (granted I order pretty conservatively getting a chicken kebab, a soup or another appetizer). But everything I've had has tasted great and showed my stomach nothing but love.", "author": "Anna R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "After having an incredible dinner here, I am going to raise my rating.\n\nWe began with the baba ghanoush, which is delicious and creamy and smoky.\n\nThen...my friend ordered the Ali Nazik kebab (lamb served over hot baba ghanoush), which was quite good, and I had the Yogurtlu kebab. WOW!!!! The Yogurtlu was amazing. Lots of large chunks of lamb over some croutons, a flavorful tomato sauce, yogurt, a large spicy green pepper (which I placed to the side), and a roasted tomato. The croutons soaked up all of the sauces. Very flavorful dish with a big variety of textures. I have a very large appetite and could only finish around 3/4 of the plate.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "I've lived in the neighborhood for years, and Deniz is a staple for us. We've taken many guests there to eat and they have all been very happy if not impressed by the food.\n\nThe restaurant itself, it's nicely decorated. It's not fine dining, but it's a great value for the price. Outdoor seating in the warmer months. Also, close to BAM. I think it is a family owned and operated restaurant, because they've had the same staff since I started coming. I always appreciate when it's apparent there is not a lot of staff turn-over. They all work as a team, and the waiters have consistently been very warm and attentive.\n\nThe menu is vast, and there are enough choices for every palate and dietary need (vegetarian, pescatarian, even some random Italian dishes). They also have a FULL bar and great desserts. The Baklava is some of the best I've had here in NYC. The dishes I usually get (once I like something I usually stick with it) are the lamb gyro (only weekends), actually any of the lamb dishes, the lentil soup is amazing, the cold appetizers and the rice pudding or baklava. \n\nThey also deliver, quite quickly most times. I really am happy I have this place in my hood.", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-21", "description": "Ordered on Seamless and was seriously disappointed. The falafel was tasteless and dry. The tzatziki was watery and also quite tasteless. Salad was not traditional and the portion was so small. Even the rice pilaf was sub-par...overcooked and then drenched in oil.", "author": "Jackie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Lentil soup heaven, that comes with a GIANT loaf of delicious bread. Lamb shish kebab is sheer heaven. Sure, it's pricey for delivery, but man, it's kind of worth the splurge....", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-26", "description": "I wouldn't say it's totally awful, but also not impressed. Most offensive was the eggplant salad, which tasted like it was from a jar. The dessert also--my favorite dessert might I add--Kunafa, tasted like it had been sitting around. Also FYI my grandma was Turkish. I've had this type of food all my life and I know when it's good!", "author": "Marissa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-22", "description": "I have no clue how this restaurant is still in business. \n\nI am no Turkish food expert, BUT Istanbul is one of my favorite places ever, I like to visit when I can and I am pretty familiar with Turkish food (often homemade via friends and family). \n\nI think that en masse every item is sub-par at Deniz, shockingly (This includes the bread, hummus, salads, lentil soup, grape leaves, ezme, falafel...). I have truly been upset each time that I have dined here. I mean, the bread (?!), seriously? \n\nThere are other pretty good Turkish restaurants in NYC - but they are all in Manhattan. \n\nIt would be a dream to have a yummy, authentic Turkish restaurant in my neighborhood. I hope that dream comes true in the near future.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "This place was amazing!!!!! The flavor in the lamb/salad/and their house sauce was so delicious. Must dine here!!!", "author": "Tamara L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "This place is amazing. I've been here once and once was all I needed to fall in love. It's conveniently located next to the BAM which is lovely btw. I went after a movie and shared the appetizer sampler and the domas. All of it was delicious. They have an extensive menu that I cannot wait to devour. I wish they delivered to Park Slope in Brooklyn. Oh well definitely can't wait to go back again!", "author": "Heather S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "Deniz is one of my favorite Turkish places in Brooklyn ... And by favorite, I mean the only Turkish place I know in Brooklyn, but don't let that stop you from reading! My friend and I- I'll call her Scooby Doo- came here after a crazy indian color fest on a boat, after a fun long shower washing all the color off (alone of course), after friend-zoning a lovably annoying zombie who I never imagined would actually join us in this wonderful meal, and it was certainly everything I dreamed it would be- loud, obnoxious, banging on the table (now now...), Scooby singing sonnets about her star crossed lover after half a drink, me wondering why I couldn't think of any flamboyant love stories AND wondering why the Kadayif had mozzarella (?) cheese in it... Silly BV, Kunefeh is for cultured people! \n\nMy manti was yummy as always but I couldn't quite finish it- so I decided donate a piece to the center of the table... by accident... Hehe. Then Scooby Doo kept telling us to \"try these fries, they're amazing!\" Which made all of us suspicious, so I suspect pieces of her dish were secretly dismantled around her... The zombie's lamb dish seemed like a bad choice but he kept chewing and chewing with a big dumb smile and saying \"it was great\" just to impress me. He is never getting out of the friend zone. The other guy who pretended to be a wine connoisseur, so astute that he could SMELL that they brought him the wrong wine- was so secretive about his dish and what he ordered, that I never could understand his Deniz experience that day. He was eating like that smart kid in math class who always covers his exam so kids like me wouldn't copy him. Fine then, he probably ordered a whole plate of \"amazing fries\" and was too embarrassed to admit it. He then proceeded to \"help me take a picture\" of his yummy looking chocolate lava cake and instead started hacking into my phone and looking at all of my sexy pictures. Maybe this was NYC style BFF behavior. Or maybe he was just a douche. Who knows.\n\nAll in all, I enjoyed watching my cognitive skills skills go downhill just by watching Scooby and co. getting drunkish, which is always entertaining. The waiters were all so friendly and good spirited to put up with our mildly obnoxious behavior, and one was even patient enough to explain each and every item (like 10) on the dessert tray when I decided to test his quick recall. He was even so helpful to alleviate the horrified look on my face when I saw cheese coming out of the kunefe and reminded my redneck self that it was Kadayif that I had been thinking of. \"All y'all look alike!\" I said ...to the dessert tray. (Hey! I'm brown, a globe jamun if you will.. I have immunity). \n\nThank you for reading. Try this place, it's amazing.", "author": "Bhavi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "I've only ordered takeout from them through Seamless. The Chicken Shish Kebab was good. The Ali Nazik Kebab Chicken was my favorite. I love the eggplant purée, the hot sauce and yogurt they put on the side as well. Can't wait to try the rest of the menu. Also loved the fresh bread! Thanks for the fast delivery too!", "author": "Sara D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "Delicious Mediterranean cuisine, fresh salad, nicely baked bread, prime location. \nLunch special is comparatively cheaper with a choice of appetizer and main entree.", "author": "Ahmed S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Walked in hungry after the Brooklyn College Graduation on Barclays Center. The place was packed and they were understaffed but the waiter accommodated us with grace. We had Lamb Chop, Chicken Gyro, Lamb Tikka, Falafel, fried Calamari and Babaganush and loved every single items. Most of the items tested as they were made in the restaurant and was not outsourced. The staffs were busy but tried their best to attend. Happy hour drinks were great. Tried the Brooklyn Lager since visiting Brooklyn. It was an absolute pleasure!", "author": "Proshun B."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}