{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "Originally I thought this restaurant was just average. Would go here occasionally with friends before or after seeing something at BAM. Atmosphere is a bit neutral-- not very intimate. However, I recently tried the lamb shish kebab and I am hooked.  I'm not really a lamb person-- more of a steak person, but this was one of the best lamb dishes I have ever tasted. Tender chunks of meat, done perfectly. Not gamey in any way. At 9.95 for a lunch meal which includes an appetizer, the deal is exceptional. So, although I've tried many of their other dishes, it is the lamb shish kebob that I think one should try at least once for dinner or lunch. I also had the lamb shank which was more like a stewed or baked meat but the lamb kebob was the winner hands down. Oh and their chocolate soufflé was very good.", "author": "Rowan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-07", "description": "Another good place close to BAM. The food was really tasty - like some of the meals we have had in Turkey- and is quite spicy, which we like. The service was friendly and capable. Quite reasonable, you can eat here for $50 for two.", "author": "james h."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-31", "description": "When this place first opened, the food was actually really good. Unfortunately, it's not anymore. Some of the food is way oversalted- for instance the Zuchini Pancakes, none of the food tastes fresh, and the proteins are usually ridiculously overcooked. I've gone back here a few times over the past year, hoping that maybe things had improved. The last time was about two weeks ago. I ordered the chicken saute, which was so dry and sawdust-like. I had a terrible stomach ache that night. I wont be going back here again.", "author": "C W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-25", "description": "Amazing food and service.  I keep wanting to try new things, but I love what I first ordered here, so I keep coming back and ordering it all over again.  The Deniz salad is perfect.  And their red lentil soup is wonderful, especially with the sesame crusted bread.  Very authentic and freshly prepared food.  It is a great place for kids.  But lots of large groups seem to come here at lunch or dinner and it is not too kid-centric at all.  And of course great place for take out.  Enjoy!", "author": "L S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-10", "description": "If you've ever been to the urban areas of the coast of Turkey, or even to Istanbul, you'll find Deniz is surprising authentic Turkish compared to many Turkish restaurants in NYC. It's a wonderful addition to the neighborhood. The staff is extremely friendly, and the quality of the food is excellent. This is no typical kebab house.\n\nThe salads are excellent. Definitely start with the eggplant salad or shepherd salad. I had the yogurtlu adana entree, and it was quite tasty. Then for dessert we tried the baklava, and it was light, airy and delicious. Best of all, they serve Efes beer, which is so prevalent in Turkey that it immediately took us back to Istanbul.\n\nAll in all, a pleasant restaurant in a great location. It will also be nice in summer, since they have a big airy corner location that opens up.", "author": "sarah s."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-19", "description": "We ordered two lamb wraps to go. The menu said it comes with fries and soda.\n\nWe asked to substitute something for the fries. They said no substitutions. So we had them leave off the fries altogether.\n\nAs we were waiting, we asked what kind of soda we could get. They said there was a misprint in the menu and the sandwiches actually don't come with soda.\n\nSo we ended up paying almost $18 for two mediocre take-out lamb sandwiches. The decor is awful.", "author": "alan h."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-13", "description": "So, my 4 roommates and I order from here often.  It's expensive.  Before tonight, we were kinda okay with that.  We've ordered the baklava (excellent, but $5?!), lamb kebab platter (good), chicken kebab wrap (fine, a little bland), yogurtlu (overly yogurt-y...in fact, everything with yogurt is too yogurt-y), and....tonight!....the \"Grilled Shrimp.\"  \n\nWhat is the grilled shrimp, you ask?  Oh, I shall tell you.  For $17, you get 4 (count 'em) shrimp atop a giant pile of lettuce.  There're some sliced tomatoes, yup! And a shred or two of carrot.  Ooh!\n\nThere's an entire salad section on Deniz's menu.  There're even seafood-related salads.  But, for $17, and from the seafood section of the menu, you can eat a bucketful of romaine.  YUM.\n\nI won't be ordering from here anymore.  (Okay, maybe for the baklava, but only when I'm drunk and willing to pay for three measly pieces of the best baklava I've ever had.)", "author": "A C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "My go to mediterranean take out place. Tasty and affordable shish kabab wraps.", "author": "Helen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-09", "description": "Tasty food, great service. If you're strolling by on an empty stomach, do it. If you're staying in but don't like what you're seeing in the fridge, do it. Matter of fact, guess where I'm eating tonight...", "author": "Kurt L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "Love, love, love! deniz is fabulous, jominjoy and me had a fab dinner in my old fort green stomping grounds. Middle Eastern/Turkish yummy yummy yummy. joy had some delicious seafood stuffed mushrooms, while jomi was all about the mixed appetizer plate and i was in love with the puree lentil soup with the perfect amount of spice. i would definitely recommend this place for a relaxed dinner. tempted by the many deniz cocktails, we opted on a bottle of prosecco followed by turkish coffee, and desert. we shared a rice pudding and the most amazing bread pudding served warm infused with lemon zest, and topped with vanilla ice cream, mint and chopped pistachios...OMG! learned about some specialties to turkey and were treated beautifully by no less than three handsome turks who were very friendly, helpful and efficient. and we weren't laughed at when asked about for our turkish coffee grounds to be read!", "author": "Vanessa L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-27", "description": "based on delivery: in the neighborhood nestled between good company, movie night, and christmas evening, it was a natural decision not to cook. our gut reaction was a festive attempt at christmas delivery, what is more city living than that? to appease the cravings of meat eaters and veggie-minded, we sung an agreement: mediterranean and turkish food! obvious choice. had to be good, right? right. so we ordered the falafel platter, calamari,  lamb shish kabob wrap, and chicken gyro wrap.  after we ordered online, they called 20 minutes later to let us know they no longer had chicken gyros. peculiar, but we moved on, my partner chose something else. when the food arrived we were excited. had the movie ready, drinks ready, oh and in case you were curious we were about to watch 'bourne identity' (matt damon. what!). as each of us began eating our food we all had shrugged, the unsaid of the anti-climactic food was annoying. my falafel was already soggy and a platter means it comes with browned lettuce and tzatziki already dryly crusted atop. no hummus or babaganoush, not even a small tabouli salad or veggies. the calamari was over-seasoned and over-battered. deniz had unimpressively executed the textbook mistakes of making squid.  the chicken replacement dish was dry with only condiments and sparse vegetables half-heartedly clumped together. the lamb tasted tough and as delicious as a friend had hoped. portions were good. the food did arrive in a timely manner, and weird enough, the big loaf of bread came with our food unwrapped and a bizarre gesture. we ate that bread in olive oil and some pepper. it was redeeming but not enough to claim a star. don't think i will eat here or try out other options. the food barely hit the standard mark on flavor and freshness. thank goodness for matt damon's wise acting and good fight choreography, though you cannot eat any of those things.... well. no, not really.", "author": "kay b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "I had a perfectly lovely experience at this restaurant.  I've traveled in Turkey and I adore Turkish food.  I've eaten here a couple of times, most recently last night, and everything was delicious and well-prepared, and the service was attentive without being annoying.  I went with my mom and husband before a show at Roulette and we had the adana kebab, the chicken shish kebab, the mixed appetizer, and the sigara borekas.   Both meat dishes were excellent, the rice that came with them was tasty, and they both came with fresh, well-dressed salads.  The mixed appetizer was also very good.  We really enjoyed the spinach taratar dip, which had whole walnuts in it.  The eggplant dip had a delicious smoky flavor.  The ezme salad may have been the best of the dips - it wasn't spicy but it was fantastic nonetheless.  The servers were very nice about bringing us two more baskets of bread so we could eat all the dips (generous portions).  My mom's chicken shish kebab was well seasoned and cooked perfectly, and I'm super picky about chicken.  My husband's adana (ground lamb) with red peppers was delicious, our only complaint was that we wished there was more of it.   None of us had to salt any of our food, but nothing was too salty.  My mom and I had tea and my husband had a turkish coffee and the bill came to about $55 for three people (not including tip) who were full enough to turn down dessert.  I cannot fathom the reviewers who complain that this restaurant is overpriced.  Deniz is solid.  It's not a vibey place, the atmosphere is generic laid-back, and the menu is probably a bit americanized (my husband was initially hoping for a pide) but the food is really very good, the price is right, and the service is spot on.  Two thumbs up.", "author": "Ralph W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-07", "description": "Have used for delivery, and had lunch there. Good good, pleasant people, timely delivery. Yes, it is a little expensive.", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-31", "description": "WOW!!!! Great food, Great Service! Everyone was very friendly and the service was five star. You can tell the food is FRESH and everything I have had there has been wonderful. My favorite was the mixed appetizer plate and the Chicken Kebab. Don't forget the dessert either, the one that looks like shredded wheat...WOW!!!!", "author": "Suni F."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}