{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-11", "description": "Great  food. I had a the lunch special ( $10 - great deal), then brought three co-workers and they loved it too. \n\nI'm hooked on the Lentil soup($4), it has a bit of tomato and spice that makes it just right.", "author": "John C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-24", "description": "The staff is attentive and their menu has a lot of choices, but I found something lacking in all the dishes my friend and I ordered. The food was either undercooked, dry, or could have used more spices. It just seemed like the kitchen staff didn't care and with so many good food options in Fort Greene, I won't be back.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-20", "description": "To be fair, we tried this place during its first month of opening.  However, even with that said, the food was at best hit or miss.  We started off with the calamari as an appetizer, which was bad - oily and chewy.  One of us had a good dish (the lamb sautee), which had a very tasty sauce.  But please stay away from the stuffed chicken - it was tasteless.  (Also, the bread tasted like it was nuked). \n\nWe will try this place again after it has been opened for a few months and hopefully by then the quality of the food will have improved.", "author": "M and M R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "I've never been to their location, but this is one of my favorite places for delivery.  Their babganoush is some of the best I've ever had and comes with delicious freshly baked bread.  Their hummus is also tasty, and I love their shepherd's salad and lamb kebabs.  Large portions and quick delivery.", "author": "Jennifer J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-14", "description": "Beware the bus boy\n\nA few friends and I were looking forward to a nice relaxed end to the evening after a show at BAM. The restaurant was half full.  We ordered the couscous salad with asparagus (about a cup of relatively plain couscous and 6 stalks of asparagus for $8), mediterranean salad (more reasonable portion and better choice), and wings. While we were still eating the bus boy came over and absolutely insisted he take our plates \"let me take that\",  \"but we are not finished\" \"I have to take them. They are dirty\".  He took our tea cups as well that still had some tea in them, asked if we wanted more tea to which we said \"yes we want more tea\".  After waiting 20 minutes for the replacement tea, we just decided to leave.  The restaurant was not crowded at that time, so there was no good explanation for this treatment.  The location is great, our waiter was pleasant, but the food and the busboy leave something to be desired.", "author": "Sherrel F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "I'm a fan.  I do take out from here all the time.  Tasty food and it's somewhat healthy as well.  I recommend their chicken kebab or their falafals. Their humuus and babaganoush are really good too.  (I know I messed up on those spellings...) They also give you free bread when you order from them.", "author": "D L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "A \"Must Stop There\" when I'm in Brooklyn!!! What not to love about this place?!?! The food is great, the service very friendly and efficient, the restaurant is spacious and the atmosphere very casual and friendly. Even the wine selection deserve a A+. Add to that a full bar and you got the perfect spot for a friendly gathering any day of the week... I recommend greatly!!!", "author": "Alain D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-28", "description": "Don't agree with the negative reviews here, but also was not blown away by my experience at Deniz.  We came for lunch on a Sunday afternoon and thought the service was good - waiter was attentive and food came out quickly.  The food (tried the hummus and lamb) was decent at a reasonable price.  Overall, I would say that Deniz fills a need if you are in the need for mediterranean cuisine, but don't come expecting to write home about it.  That said, I'd go back for seconds - with the big portions you may not need to!", "author": "Christina Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-14", "description": "Great Place for Kids! I went to Deniz with my 2 year old daughter recently. We ended up there because our usual spot was too crowded. I didn't think it would be a good place to take a toddler, but was so pleased with the incredible service and generosity extended to us. They were so accommodating to us and even gave us some complimentary treats :) The owner (who apparently has little children of his own) repeatedly checked on us. The food was magnificent- actually had a cabbage roll dish that was better than my mother's Ukrainian family recipe (don't tell). And my daughter gobbled up a very healthy meal.", "author": "Melinda S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-22", "description": "I'm big on Deniz for a few reasons. First of all, I love the actual layout of the place - it's big and spacious. Lots of windows, lots of seating. The food is almost always great and it's consistent and reliable. It's reasonably priced (I think of it as being a bit of a classy diner) and the wait staff is friendly and attentive. They have Kronenbourg on tap! Lastly, it's quite near where I live and my wife and I both think of it as a good neighborhood hangout on weekends.", "author": "Zane B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-04", "description": "Great place to go after BAM.  \nGreat food.  The wait staff is attentive, nice.  prices are not bad.  Good atmosphere.  The wine selection is good; try their Turkish wine, Yakut.\n\nThe food is pretty authentic and they have a good variety of it.  My parents gave them their stamp of approval which sealed the deal for me.  We're Turkish and my mom is a great cook.\n\nAlso, amazing deserts!", "author": "hazy l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-16", "description": "I go here at least once every two weeks. Despite it's dining room feeling a little strangely laid out, this place is great. Very reasonably priced, the food is always very fresh and where else can you find manti around here? The servers are very friendly and informative. They actually provide you with fresh flatware with every course.  I totally love it. Totally dude\n-Lamb Shish\n-Lentil soup\n-Fish is bangin\n-Manti is bangin, bangin, bangin\n-All salads, especially the ezme", "author": "Nathaniel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "My partner and I stumbled onto this place on their grand opening day, 23 Feb 2009.\n\nThe lunch specials were a steal at $10: choice of 6 appetizers, 8 entrees and a soda. Also included were a wonderful toasted sesame bread, rice, shredded pickled cabbage, and a small, adroitly dressed salad.\n\nI had the Spinach Tarator and the Chicken Adana Kebab. He had the Humus and the Chicken Kebab. As usual, he chose better. \n\nThe Humus was nutty, smoky and thankfully not over-blended. I'm so tired of chick pea blends that masquerade as some sort of off-color mayo... at Deniz texture remains a part of the experience.\n\nThe Chicken Kebab was cooked and spiced well with just enough lemon to enhance the flavor, not to overpower it.\n\nThe Tarator and Chicken Adana Kebab were less impressive to me, but not necessary delinquent or defective. \n\nWe also shared a small side of Falafel. The patties were a bit undercooked, but we both appreciated the novel presentation (draped with a thin layer of tahini) and the welcome hint of dill in the mix. \n\nService was standard, if a bit stiff. But as we were among their first tables ever, they surpassed our expectations. It was clear that they were ready on day one, which I don't think can be said of every new \nestablishment.\n\nWe both recommend, and look forward to trying their dinner in the coming weeks.\n\n(And for what it's worth, the latent Midwesterner inside me loved the over-large soda glasses.)", "author": "Tim W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-15", "description": "It is just across from 67 Burger and Scorpello restaurants.  I tried a calamari salad..it seems allright.  I have not tried other food yet though unfortunately.", "author": "Kim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "I was very impressed with the service at this restaurant. I went with a friend for an early dinner and we were seated promptly at a great table by the window. Water was refilled very regularly, a waiter came to check with us at good intervals, and they were very polite without being fakey cheerful/friendly. \n\nWe started off with the falafel plate appetizer--they were very good with a crunchy exterior and soft moist interior. The hummus and yogurt sauce on the plate were also excellent as well as the bread. For the main course I ordered the lamb gyro (a special of the day) and it was very flavorful and tender. Portion sizes were generous--I have enough for dinner tomorrow too! Overall, I highly recommend this restaurant.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-20", "description": "Came here for dinner because it was the only place around that wasn't packed on a Saturday night. I was definitely skeptical, because most places had long waits even for parties of 2, and here they were able to immediately seat our party of 5. While certainly not spectacular, it was better than I was expecting. The highlight of the meal was the platter of dips, shared by the table. The dips were all really good, as was the bread that came with it. Cigar borek was also pretty good, and I tried some of my friend's beef hearts, which were quite good. The only major disappointment was my main course; My husband and I split the mixed, and we found most of the meats to be really dry and kind of underseasoned. One of my friends had the same thought about her chicken kabob. Based on our experiences, I'd say the appetizers are the way to go, because they seemed significantly better than the entrees ordered.", "author": "Allyson P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "Been here a few times now, the  food is consistently good and the staff are all really friendly. Also good place to bring kids, plenty of room!", "author": "mitch m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-02", "description": "Two stars means, \"this food was 90% bullshit, 10% food, and I paid $13.50 for it. Thanks a heap, ya poorly-skilled, cheapskate, shortcut-cutting cooks, for serving way-below-standard fare for just-above-standard prices. Did you make that hummus? I know Sabra didn't make that hummus, because I'd eat Sabra hummus by the handful before I'd touch your hospital-cafeteria hummus-from-a-can again. I liked that yogurt stuff ok, though, so you avoided one-star Yelp shame. Your pureed eggplant, though, I hope I can forget that taste someday. It tasted like singed clothing; you know how sometimes you just 'know' what something would taste like without ever having tried it? And your tabouleh: you should be ASHAMED. Your cheap-o olive oil was Stank, and your microwave Minute Couscous was an embarrassment. In the end though, I got a quick meal and I didn't get food poisoning. So let's just pretend this all didn't happen and try not to run into each other again, eh?\"", "author": "Kara N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-21", "description": "I would HIGHLY recommend avoiding this restaurant.  About a dozen of my co-workers and I ordered take-out - the next day 10 of the 12 of us had food poisoning that lasted days.  One of my co-workers called the health department and apparently this restaurant has and instances of bacteria found in the restaurant.   The health department also requested fecal samples from several of us as well.  Unless you want to spend a miserable few days hanging out in your bathroom avoid this place.", "author": "H. A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-10", "description": "Alright Yelpers, this is my first review.  I saw that this place has so few that I had to add to it to make sure people know.   This food is AMAZING!  I actually lived in Turkey for a while and this place is easily comparable to any place in Istanbul and exceeds quite a few of them there.  I had the Mixed Appetizer as an entree but I substituted taboule for babaganoush.  The eggplant salad was garlicky and divine, the ezme salad was the perfect texture, not too pasty you can actually taste the chunks of walnut.  The Spinach Tarator is made with real yogurt, the thick kind not that runny crap that is so common in Mediterranean food here in the US.  The taboule was the perfect blend of fresh parsley, couscous, lemon, olive oil but also added the pleasant surprise of thinly sliced scallion.   The hummus is lovely as well.  My favorite thing is that all of the food here is perfectly seasoned.  For some reason, so many restaurants seem to be afraid of salt when it comes to vegetarian fare.\nBonus points for the fact that they deliver to Prospect Heights!", "author": "Solomon D."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}