{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "The food here is so good, I couldn't even wait to finish my dinner to write this review. I have ordered from Deniz since the first day I moved to Brooklyn, and they haven't failed me to this point. Every meal and delivery has been phenomenal, satisfying all the key criteria I value in ordering takeout for dinner. \n\n- they ALWAYS have prompt delivery\n\n- the packaging is crisp and always intact \n\n- five star delivery employees\n\n- food CONSISTENTLY insatiable\n \n- flavors are always mind blowing\n\n- they remember to pay attention to accommodating for special comments. \n\nI am a restaurateur and I have very high standards for Mediterranean, it's a hit! Hardly ever leave reviews. \n\n#NotAnAdd", "author": "Aylin L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-24", "description": "May 24, 2019: we were down the street so we figured we would give them a shot by doing actual pick up since all our experiences have been through seamless online delivery. When I called the woman said the food would be ready in 15 minutes. We arrived 16 minutes later and she said she was going to get our food so we ordered an Uber to take us home. Had to wait another 10 minutes for the actual food. She was very confrontational and said next time she would exaggerate on a longer wait time to appease us. How do you call this customer service? We gave Deniz a chance to redeem themselves, but clearly this was a loss. Shame on us for trying. When we got home the food was decent. All three dishes were chicken but most dry. Only the the eggplant chicken dish was good. \n\n2018: delivery not as good as it used to be. Food will arrive cold or messed up. Food quality also has gone down hill. \n\n2017 review: I've only ordered takeout from them through Seamless. The Chicken Shish Kebab was good. The Ali Nazik Kebab Chicken was my favorite. I love the eggplant purée, the hot sauce and yogurt they put on the side as well. Can't wait to try the rest of the menu. Also loved the fresh bread! Thanks for the fast delivery too!", "author": "Sara D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-03", "description": "Deniz is easily one of my top three go-to Mediterranean spots in New York, and not just in Brooklyn. And for a vegetarian who craves these flavors very often, that's saying a lot.  I've never had a disappointing meal here. \n\nFrom the tabouli and babaganoush, to the grape leaves and varied salads, and of course the falafel, everything I've had has been from good to great. Their wines are pretty good too.  And whether its been 10 of us to 2 of us, or just me solo, the manager or wait staff has always been very accommodating.  \n\nI enjoy the atmosphere too.  Outside of some obnoxious patrons, I've always felt comfortable in here.  Never rushed, always chill.  As a customer for many years, I appreciate their presence in the ever-changing Fort Greene area and hope they can continue for years to come.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "This is a superb restaurant serving some of the best Mediterranean fare in all of Brooklyn. I came here after seeing Batsheva Dance Company at BAM and this late night dining excursion did not disappoint. I knew I wanted to start with the fried calamari and it did not disappoint. The warm marinara sauce was a welcome alternative to the usually cold sauce that accompanies this delicacy. I had not had a sidecar in quite some time and it looked like the bartender was mixing up his concoctions with deft skill and attention. So I started off with one and wound up having another one. These drinks were five star in all categories: presentation, taste, alcohol content and quantity. I felt like I got my $12.00 worth for each drink. The bread is addictive and you can easily get full off of it before the meal comes. I asked for some olive oil to dip my bread in and they obliged. The seafood options were all amazing but I decided to go with the grilled shrimp. I was expecting one average sized skewer with medium shrimp, but this dish was served with about eight large succulent shrimp on two skewers char-grilled to perfection. Each skewer also contained a red/green charred pepper. The rice was cooked to a delicate fluffiness and it was amazing. The special sauce that came with this dish was similar to a remoulade and the lemon to spritz over the entire dish was fresh and aromatic. For my to go dish I had the salmon shish kebab and it came with a side salad and rice.  I thoroughly enjoyed my dining experience here and the staff were all accommodating and attentive. Zina was my main server so I want to give a big shout out to her. I will definitely be back next time I go to BAM during the summer.", "author": "Hillenbrand H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-06", "description": "Our go-to for takeout. Food is always hot and fresh. The Chicken Shish Kebab platter with rice and salad for $20 can't be beat. It's a generous portion and can easily be shared. The hummus and baba ghanoush, for $8 each, are highly recommended sides. Love that they give you bread with these too. So good!", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "My friend who lives near by ordered this food once when we visited her place . It was SO GOOD !! So the next time we walked over . The food is absolutely delicious . And I decided I needed review it after visiting the third time .\n\nIt's a pretty big space , nothing fancy or special but it's nice not to have to worry about reservations or a big party ! \n\nTo start they give you complimentary Turkish bread . For appetizers - we always get the shepherds salad with feta - SO delicious !!! Well flavoured , crunchy, fresh , cold . I always order the shepherds salad at other Turkish places and it's just not as good somehow ! We also get the mixed appetizer platter which comes with - humus, ezme, tabule, babaganush a few stuffed grape leaves . I don't care for the platter much it's a little too pricey for me but it's a nice way to try a few things and share for the table . The babaganoush is absolutely delicious and almost better to get an order of this on its own . And the fried calamari is SO GOOD!!! I don't know why a Turkish restaurant would have amazing calamari , or why you would get it here - but it's absolutely delicious . \n\nFor the main course we usually get the mixed grilled platter - which comes with Gyro, Chicken Shish Kebab, Beef and Adana Kebab served with rice and mixed green salad. I also LOVE getting the Manti - which is steamed little mini dumplings with lamb and onion and a garlic yogurt sauce . I also LOVE their yogurtlu dishes - Lamb Adana Kebab layered on homemade bread croutons, topped with garlic yogurt sauce served with a special butter and tomato sauce. I LOVE the bread croutons . The only thing I don't love is the tomato sauce . I know it's a little pricey but it works out for sharing . \n\nSo go here ! Although it's a little pricey , the food is great and the atmosphere is so unpretentious and chilled out !", "author": "Sabah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-12", "description": "This is one of the best Turkish restaurants I have been to. I was so amazed with the quality of food and the speedy service. I tried the Sigara borek starter with manti (Turkish dumpling) and Kunefe (desert)! Everything was amazing! I wish I lived in NY and I could come to this place all the time. They have foods here that are even difficult to find in Turkey (e.g. manti) I plan on visiting here at least once more before I leave. Definitely worth a visit or 100. Really! Try it and you won't be disappointed.", "author": "Pinar G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "This was my first time having Turkish Cuisine. Always curious m. Deniz Turkish Mediterranean Restaurant did not disappoint. The hospitality was awesome, the food was incredible! Most definitely, I will recommend Deniz Turkish Restaurant for a great Turkish atmosphere and cuisine.", "author": "Joshua H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-29", "description": "Deniz restaurant had great food and service. Our waiter Bekzhan was very friendly. Our food came very quick. The calamari was so good. I got the Salmon which was  juicy and my girl friend got the beef shish. The beef shish was well cooked and the best part was the dessert. Deniz has amazing chocolate soufflés! We will be back", "author": "Yusuf K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-17", "description": "I came with my mother and we both ordered the lunch special. She started with the sheppards salad and I had the chicken soup. Both were deliious - really amazing. The soup was light AND creamy - no idea how they did that. The vegetables in the salad were very fresh and crunchy. We both chose the hummus as the appetizer and it was very average. We also both ordered thew chicken for our main course. It was very moist and well seasoned. It came with a little salad that had great dressing. For desert we ordered the milk pudding and were blown away. It seemed to be flan without the caramel. We went on a very hot summer day and the AC was an added bonus. I would come back here for another lunch special. It was good but it wasn't life changing food. I feel like I could get/have gotten better Turkish food elsewhere at the same price point. \n\nWe didn't have any drinks but they had a full bar.", "author": "Gabrielle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "The food was delicious -- I'd highly recommend the lamb kofta. The staff was also very friendly and welcoming.", "author": "Winston H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Had a great experience​ here! Came for lunch and ordered off the lunch menu. Worth it. For $13 you get an appetizer, entree​ with rice and salad, as well as bread. It definitely felt like a decent amount of food for the money. Plus there is lunch \"Happy Hour​\". Need I say more? Food was fresh and good. I recommend the spinach dip for the appetizer, it's amazing! Service was fast and polite, which is a plus.", "author": "misque b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "I was there with my family last week for a Saturday brunch. I can tell this place was just so great with a large brunch menu options. Their Warm hummus and Deniz pie(with spinach)  was delicious as well as chicken breast sandwich. Staff was very kind and attentive.will be back soon", "author": "Fatih Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "I've dined in and had deliveries from Deniz.  This is one of my favorites.  I love the Mediterranean salad and the chicken shish kabob meal.", "author": "Venita W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "Went here tonight with a few friends. We ordered a bunch of different dishes and we all enjoyed everything down to the last bite.  The food was fresh and delicious. I will definitely come here again.", "author": "Tal D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "I came today first time here, it was nice dinner, come to try their wonderful dessert, and they have great service ( make you feel as a king) especially their asian waiter( korean or mongolian guy),", "author": "Ajo S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-19", "description": "Great catering option... delivery is quick and easy. The prices also arent bad so i would definitely recommend. \n\nThe food wasnt bad but wasnt great. The chicken was a little dry and lacked much flavor. The hummus was pretty good. The falafel were browned a little too much which made a hard exterior and dry inside.\n\nOverall, this is a serviceable option if you are looking for some turkish food but you wont be wow-ed.", "author": "Nicholas G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-15", "description": "The food was great!!! I loved it. It's not a fancy restaurant but a nice neighborhood restaurant to go on a weekday. It took awhile for main dishes to be prepared but worth waiting. I had lamb sautée. Rich and tender meet.", "author": "Miku T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-13", "description": "The food here was ok. I was really looking forward to some really delicious Turkish food but the appetizers seemed a bit too Americanized. We ordered fried shrimp and Tatar sauce which tasted like they bought it from BJs and kept ready on hand to put in a toaster oven. The chicken fingers were just eh and the  spinach and cheese rolls were extremely salty. For my main course I got the Adana platter. I felt like I was eating a very bland hamburger with no seasoning what's so ever. The staff was very friendly so that was a plus but I really didn't care for the food. Maybe I just got it on an off day.", "author": "Racquel N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "Great portions, DELICIOUS food, friendly staff \u0026 reasonably priced. I only wish the lamb gyro wasn't restricted to just Friday-Sunday, but that's not to say other lamb dishes aren't offered daily! The food was so good, I look forward to coming on a weekend to try their lamb gyro", "author": "Estela S."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}