{"aggregateRating": {"reviewCount": 234, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "I've ordered take out from Deniz several times and have not been disappointed, today is the first time I dined in.\n\nWe were a party of 12, we called ahead and made a reservation. The place was relatively empty, it being a Thursday afternoon. \n\nThey have a lunch menu with an appetizer and enter for 11.95. A few of us ordered off the lunch menu and others off the main menu. \n\nThe service was good, they brought the food out relatively quickly. I had the Lamb Adana Kabab with sale and rice and it was very good. The meat was succulent and the rice pilaf was excellent. Others ordered the lentil soup and were quite happy with it.\n\nThe ambience is quite nice with some Turkish decor and pictures. The only thing I didn't like is that there were flies around a couple of small flies got in the food.", "author": "Subodh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "This is our go-to delivery joint. I can't seem to get tired of the chicken gyro platter, which has shredded chicken thigh, buttery rice, and a refreshing lil salad. High quality stuff, prepared well. It also always comes with copious fresh bread, which they might make there? Try dipping it in olive oil with zataar- it makes the meal. \n\nThe mixed appetizer is also a favorite- all the dips/salad also taste fresh. \n\nAlso LENTIL SOUP with lots of lemon has saved me when I've felt under the weather.\n\n\nWe love you Deniz!!", "author": "Nina M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-12", "description": "Finally tried this place after seeing it for years.  We came very hungry and left full.  \n\nWhat we had:\n\nSigara boregi -this was too salty.  I took one bite and couldn't eat the rest. Disappointing.\n\nSpecial Betyi kebab with lamb - unremarkable\n\nLamb  kebab with eggplant - the lamb was good and the eggplant was good but the lamb on top of the eggplant did not go well together.", "author": "Rene B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Simply the best. You can't go wrong I really recommend it. You should come and feel the love.", "author": "Alize 3."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-02", "description": "I was pretty inspired by this place after eating here. I recreated the same thing at home weeks later. The flavors were delicious! I just wish the potions were a bit larger. We got Sigara boregi to share ($7 for 4 fried phyllo dough rolls with feta and herbs inside) and it was so good. Fried, crunchy, salty, cheesy. Come on!!! We split an Adana kebab ($17) lamb with a side of rice (Turkish rice with orzo mixed in), seared tomato slices and a house salad. I distinctly remember the seasoning for the meat.. garlic, red pepper....secret ingredient? Don't know but it was wonderful. I wish we would have tried more things on the menu. Next time!", "author": "Nathalie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-21", "description": "I've been to Deniz twice and enjoyed the food, especially the smoky eggplant salad, a char-grilled eggplant purée, and the adana kebab, whether ground chicken or ground lamb. The seasoning in all offerings is wonderful. The staff is friendly and attentive, but they do not seem to know the meaning of leisurely dining. We were several times asked for our order, by different waiters, where they might have asked us first if we would like a cocktail or glass of wine before selecting an appetizer and main course. When we succumbed to the overtures of yet another waiter, we finally did order, only to have the main course set before us before had had made much progress with the appetizer. And after we had finished the main course, we were subjected once again to multiple visits by staff asking if we wanted to dessert. My companion had ordered a second glass of wine toward the end of dinner and I was still working on my second, so it was fairly clear we were not yet ready for dessert. We wished only to finish our wine first. The intrusions were clearly conscientious, as the various waiters wanted to make sure we had what we wanted. But management should consider that dining out is also a social occasion, and that people like to take their time with their meal and to engage in conversation. There is no need, especially when the restaurant is not crowded, to turn dinner into a race. Had it not been for this issue, I would have given Deniz a higher rating.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-22", "description": "Never been to this place but I order in from here sometimes.\nI get the deniz salad-which is always really fresh and delicious but I've tried others' orders and generally wasn't overly impressed.  They do make decent hummus here though.  Menu options are a bit limited in general, hence why I always just get the salad, but overall this is a decent delivery option.\nEverything comes with this huge piece of bread. I'm not sure if it's Turkish naan (they call it naan) but it's good so who cares!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-14", "description": "We had no plan for a Friday evening dinner and therefor the choice ended up being a walk by decision and the group saying \"this will work\".  \n\nDeniz offers mainly Turkish cuisine however some out of place American and Italian dishes are also on the menu for some reason (weird).  They have a full bar and a ginormous list of specialty cocktails that trend on the sweet side.  I wisely stayed away from the overly sweet cocktail list and ordered my own drink.\n\nFor food we ordered the Mixed Appetizer, the Sigara Boregi and the Yogurtlu Adana.  All the food left something to be desired.  The Mixed Appetizer was good and a nice way to start the meal especially if you're with a group.  The Sigara Boregi were just fried eggrolls that lacked crispiness, they were soft and oily however the filling was flavorful.  The Yogurtlu Adana was subpar, the bread salad was bland and made no sense as an accompaniment to the lamb which was overcooked.  \n\nDeniz was a last minute choice for dinner and I think we all paid the price.  The next time I'm in the area I'm coming prepared with dining ideas.  If you happen to come across this place while in the neighborhood I would keep on walking.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-09", "description": "I ordered dinner from Deniz this evening through Seamless. The delivery was quick: 20 minutes after I placed the order, my food was in my hands!\n\nI got the falafel appetizer and the lentil soup. The falafel was good and came with three different dipping sauces (one was hummus). I didn't like the lentil soup much because there weren't any lentils in the soup and it was more of a broth. My order also came with two different types of bread which I didn't expect but it was a nice touch.", "author": "Karissa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "I've been in a love affair with Turkish and Mediterranean food ever since I discovered what hummus was, so it's hard for me not to LOVE a Turkish place. And boy do I love this place. My boyfriend and I often frequent here when attending a movie or show at BAM. It's in a great location with lots of hustle and bustle going on outside that makes for great people watching as well. \n\nI love to start meal off with the hummus plate (always) and/or the grape leaves both are very good! The only thing I wished they had was olives! Strange they don't offer those as a side. I have tried the Yogurtlu Chicken platter, stuffed cabbage, chicken gyro and chicken adana kebab. All of which are delicious! I'm always too stuffed to try their desserts but have seen the  Baklava come out and it looks amazing!\n\nDeniz is a romantic cozy spot for your next date night out before you catch a show or in the neighborhood! Worth stopping by!", "author": "Brittanny K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-10", "description": "Its our usual place ,we come atleast 3-4 times in a mounth and never dissapointed . They have full bar and wonderfull cocktails. Highly recommend for casual date nights!!!", "author": "Nariye M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "After a long hard days work and a lot of chauffeuring, I was rewarded by being treated to dinner. What man in his right mind would say no? My boss recommended I take our esteemed guest to a nice Turkish dinner. I learned to never argue with the boss. So we head off to the \"Deniz Turkish Restaurant.\" A quick walk from the job, we were their in a flash. When entering the restaurant you see the true beauty of the place. It had a charm about it that made you feel comfortable. We were offered a seat by the window (in Brooklyn that's prime real-estate) and we took it. It was a nice view of the restaurant and a outside view onto Brooklyn's developing landscape. The waiter was very nice and on point. We never asked for anything. He put bread on the table and served us cold water. The people I was with complimented the place and told the waiter this place came highly recommended. He was flattered and definitely gave us more attention after. Once we ordered our meals it was a short wait. But nothing, I mean nothing could have prepared me for what happened next. I tried something new! That's right, I got the pasta stuffed with lamb and I am not lying when I say I almost walked to the back to kiss the Chef. That was delicious. How delicious you ask? Look how many stars I gave the blasted place! It was that good. I never tried this item before and I feel like I can't continue life without it. It was a masterpiece. Even better, the portions are huge. One of my guests couldn't finish so she offered me some of her chicken (it would be rude to say no to a lady.) and I took it. I didn't realize they had awesome on the menu! That's how good the chicken was. It was juicy and tender with a nice flavor to it. I will definitely be returning. This is the place to be in Brooklyn. If you go, just don't touch the seat by the window, that seat is reserved for me and my appetite.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Me \u0026 my girl been going here for the past 4 weeks every Friday, \u0026 I can't get enough of the food. I try to come here as much as possible but my girl hates going to the same restaurants more than once. Overall I love the food here \u0026 the staffs here are amazing \u0026 very friendly. Especially the lady waiter. Can't wait till my next visit.", "author": "Nur H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "Good food and nice service!!! Definitely come back place!Close to Barclay center and excellent place to have nice dinner before the game!", "author": "Jer A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "I ordered for delivery and based on my experience this was the best Turkish food in my neighborhood. \nGreat salad too!", "author": "Damoun S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "Food is good but nothing special \u0026 a little more expensive than other Turkish restaurants. Nice variety including drinks. If you want to try amazing Turkish food there are better spots (@coney island avenue \u0026 avenue p). Staff is friendly, service is okay.", "author": "E A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "I love the falafel here and the kofte lamb! We order delivery a lot and plates are big, the rice is super good too. It is one of the most decent Mediterranean restaurants around!", "author": "Pilar A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "I'm really trying to remember how I wound up here in the first place tbh. Oh...yea...it wasn't my choice. \n\nI'm not a big fan of Mediterranean food but since I oh so adore lamb I agreed to try this place out. \n\nList of items:\nCalamari- ummm okay nothing too fancy but it was quite edible\nEggplant salad- so terrible I had to take it back (I almost never do that)\nHummus- good hummus nice substitute for the eggplant\nLamb- seasoned well and very juicy\nRice- I've had better\nMy date had some mashed potatoes that were tasty and he stated he liked his chicken. Our drinks were very good too! I don't complain much when I MYSELF don't pay for the meal and this food still did it's job. No rush to come back I can do without...", "author": "Jana P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "If you're going to a performance at BAM, and especially if you're with a group of more than 3 friends, this is your go-to. Other spots close by are small or so trendy it's hard to get in \u0026 served in time for a show but for some bizarre reason this is never so crowded. I say bizarre because the food is consistently delicious. \n\nAmong the top three falafel plates I've had in the city (I still mourn your loss Olive Vine). Fab tahini, great tzaziki. The chicken kebab is addictive -- tender, not overlooked, and just enough herb / spice to be distinctive. Tastes like you grilled it yourself on a sunny summer day. I kept stealing bites from my friends on our most recent visit. Fries are excellent! \n\nMostly stuck to kebabs, Greek salad (fresh!), hummus (outstanding!) and falafel so far so can't report on lamb and other dishes.\n\nPleasant, noncommittal but attentive service. And just fast enough so you don't feel rushed but can sit, take a few minutes to discuss options, eat at a good pace and STILL make it back to the BAM movie theater in under an hour. A lifesaver because we're always trying to squeeze in a meal before a movie. \n\nIt's just 3 short blocks north of BAM, on the corner. Outside seating in summer added another big plus for us.", "author": "Betsy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-24", "description": "Was super hungry so went to grubhub to order delivery. Came upon this restaurant and decided to try it (been walking by it for years, but never went in. I wish I took that as a sign). Anyway. I went through the menu and came across the salmon shish kebab. I read the description and noticed it didn't mention anything about what it comes with. So I went to google. I found their phone number and contacted them to ask what does the salmon shish kebab come with. I was told that \"ALL kebabs come with rice and salad\". Ok great! So I went and ordered it on grubhub. I get my meal and guess what...no rice (also didn't get any utensils to eat with). Mind you. This meal is $19. I would never in my life pay $19 for some cubes of salmon. Wtf. So obviously I called them back pissed as hell trying to find out what happened. The man is all like oh I thought you said chicken. The salmon does not come with rice because it's salmon. I told him that he told me ALL, and if ALL of the kebabs don't come with rice he shouldn't say all. We go back and forth and he says that he will send the rice. I give him my address. He talks Turkish to his coworkers and leaves me on hold. After a few minutes I decided to hang up and write this review. I have no clue if he's coming with the rice and at this point idc. Will never order from this place again.", "author": "Roslyn F."}], "servesCuisine": "Turkish", "priceRange": "$11-30", "name": "Deniz Turkish Mediterranean Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "662 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/VNTKc8-a_pkcljVawElPJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188526503"}