{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-27", "description": "For Yale's inaugural Fall Break, I took advantage of the heavily subsidized NYC trip. \nI take my meals out very seriously, so before I venture into a new food locale, I research area restaurants. Since I had been craving some good Chinese food, I decided on the promising Golden Fried Dumplings in Brooklyn. \n\nTwo blocks from the Metrotech subway station, this literal hole-in-the-wall was easy to access. I went with two friends, and our jaws dropped when we saw the ever-growing line forming inside the tiny restaurant. However, one glance at the menu and the prices (as well as the mostly Asian clientele) convinced us to get in line. We ordered four items each, and after staking out one of the scarce tables, our numbers were quickly called out and we dove into our food.\n\nBear in mind that we entered this knowing we wouldn't finish everything, and we would have a food coma. I ordered boiled chive and pork dumplings (10 for $3!), roast pork pan fried buns (3 for $1), sesame pancake with vegetables ($1.50) and noodles with meat and bean sauce ($3). All foods from my tasty childhood. Everything boasted a heavenly addition of oil, except for the boiled dumplings--however; even they don't get the healthy food label because of the fatty pork filling. But I wasn't looking for something healthy, I was looking for something that would soothe my tummy, which had been craving Chinese food, no matter how greasy. \n\nMy friends ordered a variation of what I ordered, but with fried chive and pork dumplings, sesame pancake with egg, noodles with spicy sauce and shredded chicken chow mein instead. What can I say, they're American.\n\nNext time you're in NYC, this place is worth the trek out to Brooklyn. Skip the sesame pancake sandwiches, which were too thick for the filling of cilantro, carrot and cucumber. The noodles, while good, also weren't up to par with the handmade dumplings and buns. A definite \"Don't Miss\", stick to what Golden Fried Dumplings are good at, and neither your wallet nor your taste buds will be disappointed. You can always exercise tomorrow.", "author": "Djenab C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "I may not be an expert on dumplings, but I do eat a LOT of dumplings. These are by far are the best in the area. While the Golden Fried Dumpling is a small enclosed space (some would call it a \"hole in the wall\") their quality more than makes up for it.", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-10", "description": "i just had to pay for a half inch deep ramekin of soy sauce/vinegar. never been to a joint that didn't just leave bottles of it out for dumpling dipping enjoyment...\n\nregardless \u0026 sadly, for anyone who's a fan of prosperity or vanessas, these don't live up.", "author": "Liz A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "First off this place is awesome. The atmosphere is really cool and the dumplings are home made. The fried dumplings 5 for 1.25$ is an amazing buy and the dumplings are incredible. The sesame pancakes are also wonderful with Sriracha on them. The little juicy buns are very traditional and moist. The atmosphere is in no way fancy but that makes it better in a way. The atmosphere and aromas the place is so cozy it almost feels like home. They also have a canned white gourd drink that I didn't try but looked very good. I would  eat here again.", "author": "Atticus K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "Aww, I love little hole in the wall ethnic restaurants! Interesting, I don't usually like Chinese food - with the exception of dim sum. My coworkers have been ordering steamed dumplings lately and even though I am not (usually) eating meat, I made an exception today and got both a pork bun and pork steamed dumplings. Both were excellent and of a quality of the better places in Chinatown. \n\nI did feel a little bad - I took my friend with me, and she ordered the fried dumplings, which were actually fried to a hardened crisp. Fortunately, as I wasn't sure if the buns we ordered were large or small, I ordered ten dumplings and she and I shared (the buns were huge, btw - they were sold out of the 3-in-one-order, which I assume would be smaller, and we got the 1 for $1.25, which is the large size). The steamed pork and chive dumplings were delicious, as was the huge roasted pork bun. \n\nOh and did I mention that everything here is CHEAP? We ate lunch for less than $5 each here - and if the fried dumplings hadn't been so hard, my friend would have come out of it under three dollars. Of course, I have the usual questions about quality, sourcing, etc of such cheap food, and I am met with the usual \"I'm going to selectively ignore this for a second\" attitude I get when it comes to small ethnic restaurants. Sigh. My morals are so often questionable. \n\nGreat spot for cheap lunch! Though I'm waiting for my stomach to hate me... it hasn't happened yet...\n\nps: Please start to make vegetarian dumplings and buns, k?", "author": "Elishevah G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-03", "description": "Pretty dang cheap. Not prosperity dumpling cheap (then again, they aren't making the food in a rat infested alleyway) but still pretty decent. 5 chicken or pork dumplings with cabbage or chive for about $2.50, 10 for about $4.50, not bad. Its cheap, fast, but the dumplings taste meh at best. Just a side tip: their pork and chicken look and taste exactly the same so I wouldnt really be surprised if it was the same meat being sold under a different name. Just be aware if you cant eat pork or something. Dont bother with their soups, its basically hot water with light flavoring. Their noodles are half decent i guess.", "author": "River P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "I have to say this is one of the best Chinese food in this neighborhood. We ordered the sha cha beef noodle soup and chicken dumpling noodle soup, and steamed pork buns. The beef noodle is great, but the buns are better. Even though the skin is a little bit dry, the fillings are very authentic. It is tasty and the pork ground is tight and bouncy. Also it is vey cheap. I believe that we will come back and have more of its dumplings and buns.", "author": "Yuan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-13", "description": "The roast pork buns are good.. But I've been to much better dumpling spots.. In regards to  (Decor and taste) .. Not planning on going back any time soon..", "author": "Kiesha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-16", "description": "The fried Pork and Cabbage dumplings are to die for! and super cheap I might add; 4 for a $1.  I didn't think that the roasted pork buns were that great compared to the amazingness that are the dumplings ... Noodle soup is ok for the price, the noodles reminded me of spaghetti noodles. I had the Vegetable noodle soup and my boyfriend had the Sha Cha Beef Noodle Soup (name?). Mine had no flavor but was full of veggies, broth, and noodles.  His was really good and spicy. \n\nI wouldn't eat in, when we were there (on a cold day) ,they had the front door open and it was freezing inside. The little lady at the counter was even taking orders in a winter coat! \n\nBut seriously guys ... I had dreams about those dumplings last night...", "author": "Carley S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-12", "description": "Om, just enjoyed some leftover for lunch. Thick skinned, greasy delicious dumplings. This isn't a place to eat healthy, but its a great place for yummy, fast and CHEAP foods. Check, check and check! Ordered 18 dumplings and a fried rice, shared with two, $5 per person :) (Their fried rice is pretty delicious).", "author": "Vincent D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "Super dumplings for dirt cheap prices! This is a quintessential hole-in-the-wall, greasy Chinese place. The woman who runs the counter is friendly, but speaks very little English, so stick to the numbering system when ordering.\n\nThe pork and chive fried dumplings are the best when hot, but their quality drops if they've been sitting out. The fried dumplings are superior when they're fresh, but the steamed dumplings are a little more consistent and a little cheaper.\n\nTheir stuffed buns are an equally tasty and cheap option, but their Little Juicy Buns (#9) can be a bit tough on the bottom where they are cooked... No innuendo intended in that sentence.\n\nTheir sesame pancakes are tasty, but greasy and a little dry. Their noodles and fried rice come in large portions for their cheap price.\n\nThis is my favorite dumpling/Chinese place in Downtown Brooklyn/Polytech area, hands down.", "author": "Piper M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "Okay so I give 4 stars...but let's start with the bad and end with the good.\n\nI'm always downtown BK and decided to look for this place because I've had it bookmarked for a while. I go in and immediately order 12 pork dumplings and then switch it to 8 pork and 5 chicken. BAD MOVE!\n\nI made it through 1.5 chicken dumplings and I'm like \"wtf is this\". I then began tearing them apart b/c it didn't feel or taste anything like chicken. It was so mushy and flavorless...a waste of calories: if you're gonna eat really greasy unhealthy food it must at least taste good. IDK if it is canned chicken or mystery meat perhaps?? but I chucked those in the trash. (NOTE: I may have accidentally ordered chicken mushroom dumplings thinking that it was only chicken, but either way it shouldn't have been so bland and yucky)\n\nNow the good stuff: the pork dumplings were soooo delish! Sprinkle some hot chili sauce on them and enjoy. These dumplings definitely made up for the slack of the chicken dumplings. I'd def go back for more even though the man cooking was awkwardly staring at me the whole entire time...whatevs!", "author": "Djinou J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "The hot and sour noodle soup is awesome\n\nAh I just found out why...  the subtle briny ocean taste comes from seaweed. Apparently what we Americans consider hot and sour is the Southern style (no seaweed) and this is Northern style w/seaweed most delicious but if you have allergies be forewarned.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-19", "description": "Delicious. Prosperity Dumpling on Eldridge held the title for best dumpling in NY for me (Yes, I did a study) until this guy showed up around the corner. I've only ever bought the dumplings, and my faves are the boiled. They have them prefrozen but you'd never know the difference. They boil them when you order so be prepared to wait. Love the classic pork and chive and the chicken and cabbage is good too. Highly recommend. \n\n-1 star because the sesame pancake isn't usually fresh and the wait can be substantial.", "author": "Alis H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-20", "description": "I was in Brooklyn for 4 days. I ate here all 4 days. I found them on Yelp. My wife saw the outside and price and said she would not eat there.\n\nBut I got the dumplings, brought them back to the room. After I told her how good they were she tried them. She then send me back to get some for her.\n\nI cannot image that you could ever find a better place for the price.", "author": "Keith H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-04", "description": "I stumbled upon this place after browsing on yelp for a bit. How lucky! I've been craving pork chive dumplings around downtown Brooklyn considering the trip to Chinatown is too far and back during lunch hour. The place is really inconspicuous, but once you enter.. you'll see that there is much hustle and bustle. The lines were not overly long and the cashier works in a hastily but friendly manner (albeit after today's ROTD I'm sure the lines will only grow longer.. DAMMNNN YOU!!!).\n\nThe menu is overly simplistic but don't let that fool you. In life, simple things are good. I ordered the #1, pork and chive fried dumplings that you get at an almost impossible to beat price of 4 for $1. These were quite good, maybe not as good as the places in Chinatown but I have very little room to complain considering this joint is unique to downtown Brooklyn. I'm not sure how people like to eat there dumplings.. but I like mine with a dollop of sriracha and the soy sauce vinegar mixture which they provide. \n\nI also got their little juicy buns which I was very much underwhelmed. It was not nearly as good as I would have hoped, considering I am somewhat of a self-proclaimed soup dumpling snob.\n\nI will definitely be a regular here.", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "Although it's not traditional Chinese food, but it taste good! Especially their noodles", "author": "Alex T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "Great dumplings and super cheap! 10 for $3. They're a little smaller than Prosperity Dumplings in Chinatown -Manhattan. But they're still a great meal for pocket change. The sesame pancake with veg was pretty average though. It was dry and the carrot was floppy and dried out. Try have great space for dining in though!", "author": "Luke L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-19", "description": "A great fine for Dumplings and very cheap and they are pretty good ! Also  had the fired rice, sesame sandwich, roast pork bun.  Everything was good, but the sesame sandwich. Go and get some dumplings- they are good!", "author": "Oswaldo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "Stopped by today for the first time.\n\n5 tasty pork and chive dumplings for $1.25. \n\nThey had em ready and waiting because of the lunch rush, they were still hot and I was out the door in 2 minutes. \n\nNot the biggest or fullest dumpling ever. Not the tastiest either, but still very good for $0.25 dumplings. Can't beat that, at least not in this area. \n\nI'll definitely be back to this little hole in the wall.", "author": "Andrew D."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}