{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-02", "description": "Golden Fried Dumpling is solid.  As in a solid chuck-of-dumplings-stuck-together-in-a-ready-to-go styrofoam-box solid.  But at 4 for $1 it's hard to complain.  Also, they somehow manage to keep the bottoms of the dumplings crispy-ish.  Their chicken and corn soup was a dud -- goopy and gelatinous, so disappointing even though the flavor was good.  Still, it's a decent lunch on the cheap, and judging by the long line winding through the hole in the wall, plenty of other people think so too.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-08", "description": "Mixed review: Clearly a great \"hole-in-the-wall\" with good food at low prices. My soup was redolent with porkiness but the broth was slightly oily. The steamed pork and cabbage dumplings were not cooked through and required an additional nuke in the microwave when I got home with my take out order. Tsk. Tasty once cooked, but a potentially deadly flaw for a restaurant to serve undercooked pork.", "author": "Def M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "Great place, foods are clean and inexpensive. I like the fried dumplings and noodles. 5 bucks for a person is enough.", "author": "Guanpeng G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "The dumplings and delicious and cheap (and fried rice).  I'll definitely be returning.", "author": "anna m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-01", "description": "They serve really fast and everything is really inexpensive. It's good to have a place like this in Downtown Brooklyn where we need more decent takeout place without breaking our wallets! Fried rice and lo mien was pretty good!", "author": "Minty N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "Never would have found this place if it weren't for my roomie. She was having a noodle fix so I tagged along. While I didn't get anything for myself, I did decide to be a good fiance and get hubby some dumplings. Get brownie points while only spending a measly dollar?? Me thinks yes! He couldn't stop smiling for the rest of the evening, and actually went out that same night to get 4 more!!!", "author": "Marla B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-16", "description": "Give your business to this cute mom and pop shop! They serve delicious and DIRT CHEAP food. 10 dumplings for $3, sesame pancakes for $0.75, chow mein for $4? Sold! The perfect hangover cure is the spicy beef noodle for $4.50. Love that I'm able to get Chinese comfort food so close to my home. For anybody on a budget, you can get 3 meals for less than $10.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Sorry, dumpling place, but I gotta dock you a star for my latest visit. The cold sesame noodles were bland and I barely had two bites before I pushed it aside. The steamed roast pork bun and the boiled and fried dumplings were both amazing though and I will stick to those two items from now on when I come back! Just order those items and you will be happy!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-06", "description": "The collective high praise for this spot is baffling. \n\nThe dumplings are good and cheap. 3 stars.\n\nBut everything else is bad. All their soups are terrible. If you thought you've had bad soup from ghetto take out joints, wait until you try soup from Golden Fried Dumpling. If you like your soup nice and starchy (corn, hot and sour) and light on ingredients, you're set. Their wonton soup is pathetic. It's actually a VERY potentially good soup, if the wontons weren't the size of your fingernail. It's like eating wonton skin soup. \n\nThe sa cha beef noodle soup is ridiculously spicy. I guess depending on your taste, this could be awesome or not. I love spicy foods, but not to the point where it's a struggle to eat. Every time I ask them to put VERY little spice in it, they never get the order right. \n\nThe pancakes and pancake sandwiches are delightfully bland. \n\nThe shanghainese buns are not what you would normally expect either. Don't waste your time if you expected real Shanghainese buns.\n\nOverall, if you just get the dumplings, this place is okay. If you get anything else, it's ridiculously subpar. Even then, I wouldn't travel to downtown Brooklyn if I had a craving for dumplings. \n\nThat said, I will be coming back to this spot because I work right here and honestly, the area sucks when it comes to food options. \n\nI promise you I'm not typically this negative about food (I dole out 4 and 5 star reviews left and right) but this place does not warrant such a high rating.", "author": "Alvin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-22", "description": "Apparently they just opened. This is a small place and it is super cheap. They only have 3 tables inside but we were able to get one. For $5 you can get more food than you'll be able to eat. They serve dumplings, steamed buns, and sesame pancakes, as well as some noodle and soup dishes. This place is similar to Prosperity Dumpling in Chinatown, but it's even better and it is in Brooklyn! You should definitely check it out if you are craving some fried dumplings. The cashier lady is super nice and she'll make sure you're putting all the right condiments on your dumplings. :)", "author": "Ivan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-10", "description": "Eh they are ok they are not good but not bad either. The hot sauce was not bad but the dumplings tasted a bit thick not even any crunch on it.", "author": "Theo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "Great lunch spot in downtown Brooklyn. Couldn't believe how cheap the dumplings were, and I was stuffed. They're not as good as Prosperity, but, well - I'm biased, since those were my first NYC dumplings. That said, flavorful, hot, \u0026 cheap - so no complaints. The sesame vegetable pancake was more like a sandwich, but for a $1.50, I was happy to try it.", "author": "Claire M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-05", "description": "Super cheap, super delicious home-made dumplings. Had lunch and was full for $3.50.", "author": "PJ A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-24", "description": "What is the big deal here?  I got some mushy yet greasy dumplings, I watched the chef touch them with his hands when he out them in the carton, and I felt ill after I ate them.  I won't be going back.", "author": "Rebecca E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-26", "description": "the foods was good，but，my friend and me，after ate this dumpling，we got stomachache few days", "author": "Edie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "The dumplings are out of this world! The food is super cheap and the staff is friendly. What more can you ask for?", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-03", "description": "Cheap greasy dumplings, just like you can get in Chinatown. I don't have high standards for this area, so this is kind of average when compared with nearby establishments. However, this place feels filthier than most-- the air is sticky with grease and I'm pretty sure I saw the woman behind the counter use scissors to cut her nails.. and then touch my food.", "author": "Alice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-09", "description": "The other reviews have said it all, 4 golden fried dumplings for $1?!  Eat them while they are hot and enjoy this little sinful delight.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-19", "description": "Super cheap Chinese food that is worth a try or two if you're wondering about it. Not an amazing selection, but hey, what do you want for incredibly cheap? Dumplings and chow mien were both delicious and a good value. Did I mention cheap? Have eaten mere on multiple occasions when I'm feeling like a full meal without spending an arm and a leg, which happens more often than not in Downtown Brooklyn.", "author": "Brett A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-18", "description": "Bad dumpling house ever try. Sour \u0026 Spicy Soup tasted just like soy with spicy, also too salted. Dumpling over cooked. Services bad, they just want you to make purchase. Unhappy experience to this place.", "author": "BingQ C."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}