{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Extremely tasty cheap dumplings. Staff is always happy. Great for take-out.", "author": "David J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Simple, apparently Northern Chinese, ridiculously inexpensive takeout restaurant crouching mouselike amid the gentrifying new towers and the middle-age Metrotech ones. Enjoy it before it becomes another bubble-tea joint.\n\nMany other users find it lacking compared to Prosperity Dumpling and Vanessa's Dumpling House. But this is real street food, not a trendy imitation. You'll find this kind of place in Manhattan's Chinatown east of the Bowery, serving low-budget yet authentic comfort snacks, paying little for labor or ingredients or promotion. Yelpers' word of mouth brought me here, not a feature in Time Out New York.\n\nMy boiled cabbage-and-pork dumplings were tender and tasty (10 for $3). If the sesame-pancake sandwich had little sesame or scallion, and its roast pork was cold and fatty, and its carrot and cucumber slivers were more like salad than bahn mi, well, it was still worth its 1970s price of $2.25. I'll be back for other dishes (and more dumplings).", "author": "Josh K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-16", "description": "So this is more like a 3.5 - the extra half point is for how damned cheap it is and for how much I like unpretentious small businesses. But for the quality of the dumplings themselves and the offerings, it's not worth the 4+ star reviews that everyone seems to giving them. This is NOT Prosperity Dumpling. However, they do make all the dumplings completely from scratch, and deserve hard-earned credit for that. \n\nMy favorite order is the boiled chive and pork dumplings and juicy little buns. IMO most of the soups (except the sha cha beef soup) are flavorless. I wouldn't bother with the hot and sour soup, but the wonton soup is pretty nice. Note that the wonton soup is  fuzhou-style - meaning it's many pieces of seasoned pork wrapped in thin noodle wrappers. \n\nService is very fast and perfunctory in a heart-warmingly aggressive Chinese way - in other words not for the n00b. The cashier will expect you to remember your order # because that's what s/he'll be shouting loud enough to hear from 30ft outside the shop doors when your order is ready. Be prepared. \n\nIt's also crowded during lunch hours - on some days the line snakes around the shop. Cash only.", "author": "Linda S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-20", "description": "I popped in here for a cheap lunch - ended up spending just as much money, but getting enough to feed 3 people. I ordered the chow-mein noodles with chicken and 10 steamed dumplings (10 was WAY too many, but it was an option of 3 fried or 10 steamed.... not sure why but I just went with it).\n\nThe order was completed quickly- I paid under $10 and booked it back to my office to bask in its glory. The dumpling skins were a bit thick and I ended up peeling most of them off and just eating the pork-cabbage-mushroom filling, which was bound together nicely. The noodles were a bit greasy for my taste, but that's chow mein, and although they lacked flavor, it wasnt anything that a little sirracha couldnt fix.\n\nI'd definitely recommend this as a normal lunch spot for the rotation, specifically if your strapped for cash before pay day!\n\n\nUPDATE: I ordered the spicy noodles and it comes in a kimchii-broth..at first, i was disappointed in the spice, because it was pretty mild. Then.. about halfway through my consumption, it turned to a pleasing burn that made my nose run (perfect for this stormy day) and was the perfect portion to allow a glutinous noodle lover to bask in glory as digestion settled in. Dont be afraid to order \"not dumpllngs\" when you come here.", "author": "Heather H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-11", "description": "It really pains me to write this review.\n\nI bookmarked GFD and was super excited after reading everyone's stellar reviews. I envisioned myself walking in there and throwing singles everywhere like a baller while I waited for some badass dumplings. What actually happened was that they ran out of a few items that I wanted to try like the juicy hot buns oww oww. I ordered a roast pork bun and the pork dumplings instead. The pork bun was definitely worth the $1.25. The dumplings however really were swimming in oil. I know that they're only 4 for $1 and I don't want to sound like I'm expecting gourmet quality at that price, but I only ate 1 1/2 dumplings before feeling sick. (Thank you weak stomach) I had read reviews about people poking holes in them in order to drain the pools of oil, but there was just no way of salvaging these massive dumplings of hope.\n\nSitting here now looking at my half eaten meal, I feel like I'm missing out on all the fun. Why does everyone love this place so much? In any case I'm determined to find out. Next time I think I'll try the steamed dumplings.", "author": "Dinah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "5 stars for the price\n4 stars for the dumplings \n5 stars for the awesomeness of the people running it\n\n\n5 pork dumplings for $1.25?!? Yup. Good lunch for under $4. I'll come back...and back. Can't wait to try the buns.", "author": "Danny R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-28", "description": "Extra star for being super close to my apartment.\n\nI only order the steamed pork dumplings and I think they're pretty great.  You can sit outside and they'll flag you when your order is complete.  \n\nSuper cheap and easy.", "author": "Monique H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-10", "description": "I tried the dumplings a few times and now the juicey little buns.  I think they are barely even decent and I've never even finished all of them which is unprecedented for me. Won't be back and I don't recommend. Even the roast pork buns that you can find at any Chinese bakery are terrible. Wow", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-17", "description": "I've tried the Vanessa and Prosperity dumplings, so when I know this is around my office, I had to try it. The dumplings are pretty good considering it's not a typical Asian-concentrated area. for $3.50, you get ten dumplings which is slightly more expensive than, say, Vanessa. I also tried the black bean sauce noodles. It was meh. It's edible, but not something I'd order again. This is definitely a cheap place to get some lunch especially for some dumpling fix. Will be trying their sesame pancakes next time! So glad to have this place around me while I'm around for a while!", "author": "Nilsa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "Its super tiny inside but the pork buns are HUGE! They were super tasty and the size of a burger. I will definitely be back since it such a quick walk and great price!", "author": "Erica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-05", "description": "Extremely good value from the price..1/2 block down from the aloft, Sheraton, and indigo so bookmark it if you stay in the area.  Be forewarned though.... a pretty large sign says $5 for 8 shrimp or vegetarian fried dumplings. I was thrown the first time walking in and just said yes to those. After I opened the menu I realized they have different kinds (pork, chicken,) that were a better value.  I feel a little ridiculous complaining about spending $5 on takeout food (but I want to be able to say I got 10 dumplings for $1.25, darn it!:)  Anywho, they were friendly, fast (waited like 4 min tops.) I also HATE soy sauce but could not get enough of theirs.\n\nTakeout only-no delivery.  Open til 9 pm 7 days a week. \n\nThe roast pork buns also were super cheap and looked really good.", "author": "Lisa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "This is truly a five star worthy eatery. Small restaurant with a few really great items on the menu. The woman behind the counter is really sweet. Reminds me of my years working as a soup cook in a Chinese restaurant.\n\nI come here at least once a week sometimes even twice a week. One day while I was working in the lab at NYU Polytechnic, I came here for breakfast, lunch, and dinner!\n\nThe best items on the menu are NUMBER 3 (steamed pork dumplings 10 count) and NUMBER 12 (steamed pork bun). I get them with a can of diet coke or a green tea.\n\nDid I mention it is cheap cheap cheap! At first I was upset when their price went up by a quarter, then I realized I was getting a lunch for the price of a metro swipe!\n\nLimited seating and can be cold during the winter time. Some total wad must have messed up the bathroom because now it is locked. Gets crowded around lunch time.\n\nMy only advice, go there now! Right near a Citi Bike rack as well!", "author": "Joseph N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-06", "description": "Great off the beaten track lunch spot in Downtown Brooklyn. Dumplings are cheap and tasty. They come in orders of 5 or 10, and you can get them boiled or fried. There's a small seating area inside, and they always hit the spot.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-11", "description": "Came here for my jury duty lunch break, the pork dumplings I got looked undercooked inside and of course hours later my stomach was killing me. Avoid this place.", "author": "Kristen K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-12", "description": "The food here is frighteningly inexpensive.  As a result we ordered too much food - two dishes is plenty per person.  The food is pretty tasty and very popular, as evidenced by the line outside.  I'm not sure I'd be running back due to the limited choices, but it was a great spot to get some quick food during a Fulton Mall shopping extravaganza.\n\n#1 Chive and Pork Fried Dumplings - Yum! 5 for $1.25!!\n#10 Roast Pork Pan Fried Buns - Tasty! 3 for $1.25\n#11 Little Juicy Buns - same as #10 without the delicious crispy crust on the bottom. (May have given me the wrong item) 6 for $2.50\n#13 Sesame Pancake - not that interesting but a huge carb hit for only $1.\n#22 Noodles with Peanut Sauce - needed salt, seemed like a dish for toddlers - very plain.  For $2.50 I'm not sure what I was expecting.", "author": "Kari T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "Great little spot tucked away on a side street.  Dumplings are good.  I figured the pork bun also.  Not huge servings but for the low price it is well worth it.", "author": "Jim M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Unassuming storefront inside and outside; delicious dumplings for cheap! I recommend the boiled pork and chive dumplings; the meat was marinated so well and they were so tasty. You really can't beat 10 dumplings for $3.50 in the neighborhood. The workers are courteous and super hard-working. Will definitely be back!", "author": "Samantha M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-10", "description": "I think the main reason this place averages 4 stars is because of how cheap the dumplings are (and really everything else). If you've had your fair share of truly delicious dumplings, this definitely won't satisfy your palate. On the other hand, if you wanted something cheap, fast, and easy, this is definitely the place to go to. It's very very close to where I work so when I'm broke and hungry, this is where I go. \n\nThis place is tiny and during the lunch hour rush it gets pretty packed inside.", "author": "Yna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "Did someone catapult them out of their hood? Are they aware this is not Chinatown?  Well, bless their ignorance, for you'll be hard pressed getting a better deal in Downtown Brooklyn.\n\nTheir dumplings have an ample amount of flavorful filling - I usually order steamed pork and chive variety,  since they are relatively healthier than the fried alternatives, and to minimize the waiting time.  \n\nThe steamed large bun with pork innards is a guilty fatty pleasure.\n\nThe sesame pancakes are too oily and greasy for my liking and lack the flavor of the ones I have had in Chinatown.\n\nThey can understandably get pretty crowded, especially during lunch time.  The cute little grandma at  the register is not very proficient in English which adds authentic charm to the place but can make the ordering process a tad frustrating.  She is adept however at counting and all you need to do is communicate via the menu's numerical system. My regular order speech happens to be this : \" Number 1,  Number 12.............Bye bye!!!\"", "author": "Dmitry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "There are not that many good dumpling shops in Brooklyn and seem like I've found that made its way across the river from Chinatown to downtown Brooklyn/Fort Greene. It is a tiny, low décor shop as expected for this type of establishment.  The Chinese lady at the register knew about 3 English words and had a cheat sheet in Chinese when you ordered off the English menu.\n\nThe dumplings which looks like it is made fresh daily as with some of the other dishes come in the usual assorted choices...chive \u0026 pork, Cabbage \u0026 pork, soups, pancake(which was out that day when I came), and noodle dishes all made from the same dough.  The prices are cheap. I guess I'll have to part the $3 dollars for 12.", "author": "David N."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}