{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-06", "description": "This review is solely for the fried dumplings. Given that there are no similar options in the area, this place is a great spot for super cheap eats - you can spend $5 or less for a filling lunch (or dinner). That's something that's rare ANYWHERE you go. That being said, their fried dumplings pale in comparison to other dumpling places, such as Vanessa's or Tasty Dumplings in the city. It seems that because they're so busy during lunch hours, the dumplings are already pre-fried and packaged in styrofoam boxes. While this makes for a less-than-a-minute wait for your food, the dumplings have lost their crispiness, and the juices have slightly congealed, meaning that you miss out on that drippy satisfaction from biting into a freshly fried dumpling. If you've got a craving for dumplings, I've been told that their steamed dumplings are better, so I would stick with those.", "author": "SukMon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "..subtracting a star because they need to switch the hinges on the front door, which opens in, instead of out. Now, I'm adding a star because they have a bathroom.", "author": "Pipe A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "This place is in a very secluded block so you may have trouble finding it. First timer who really had the craving to try some dumplings. For a Chinese restaurant, this place was clean! I was amazed how well kept it was even though there were only three tables. Ordered fried dumplings and beef lo mein. The dumplings could've been cooked better if they weren't stuck to each other but for $.25 each, can't complain! Beef lo mein filled me up really good. Was pretty oily and I suspect they probably use the residual oil from the fried dumplings. Overall, it was great. My stomach was very happy :D\n\n\nCame here again today. The cashier was very rude to another customer and had a horrible attitude towards me for no apparent reason. Demanded that the customer pay for the dumplings beforehand and then slammed the cash drawer. When my order was done, I saw her face and she had a horrific expression on her face. Probably coming back here just for the sesame pancake! Try the egg or beef. Pork wasn't that good.", "author": "Francisco S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-14", "description": "Great dumplings and more! The chicken mushroom boiled dumplings are my favorite, but the steamed pork buns are actually a bit too doughy. The store itself is nothing to look at. Lots of Formica. It gets really crowded in here, but they crank out the orders really quickly. Bear with them, as their English isn't great. The gals at the counter aren't the warmest bunch you'll ever meet, but they're not selling smiles, so just take your food back to your office and enjoy.", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-27", "description": "MSG laden super affordable not very authentic flavors... its close to work and thats the reason for a star...", "author": "Krits R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-24", "description": "I ordered wonton soup and the dumplings. They food is not special and the dumplings are pretty alright. However I don't see any meat in the wontons, so it's pretty wise to just grab some cheap dumplings and chill for a while. The soda is only one dollar each!!!!", "author": "Trista L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-27", "description": "Agree with most... good overall, but on the greasy side.  #24 had excellent flavor but beef was dry and fatty.  Veg dumplings were good.  Cheap eats for sure.", "author": "T V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-26", "description": "The dumpling is definitely authentic but I feel it is a little too greasy. I have other dumplings that taste as good but with less grease.  Beside that, it is definitely flavored to taste. I prefer the steam over the fried version.  Hear it can get crowded at times. Seating is limited. We normally buy and eat at our cafeteria. I do not recall seeing a restroom there. I could have missed it.", "author": "Kon T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-18", "description": "a month ago if you would have told me that there was a cheap dumpling house two blocks from my stomping grounds, i would have told you to shut your lies.\n\nthat said, a few weeks ago i was informed that yes there is a dollar dumpling house in downton brooklyn (i started dropping that second \"w\"... it adds class). I also figured out that i had never run into said dumpling house because its located on a narnia'esque street named duffield. despite passing this street everyday, i dint know it existed. turns out duffield street contains trendy bars, thrift stores, mom n' pops, and all sorts of other things i'm interested in. after i deja-vu'd the decor in one of the hotels, it hit me; i had been here before. this was where drunk me and a friend snuck our way into that fancy hotels complimentary b... long story short, golden fried dumpling does indeed exist*, and it is hidden in plain sight.\n\nok so maybe golden fried dumpling's dumplings are only average by nyc standards, and so what if everything else i've tried at goden fried dumpling isnt that great. the only thing that matters is that it's right there! and they have dumplings! and its in narnia! thats what i call a win-win-win.\n\n...........\n\nedit: *did exist. naturally as soon as i find out about this dreamboat, the health department shuts it down. ...this is why we can't have nice things.\n\nedit #2: they are open again!", "author": "Ricky R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-19", "description": "Boiled chive and pork dumplings are amazing!  10 dumplings - tender and tasty.  Huge bargain.  Highly recommend. I didn't care for the spicy noodles (dan dan noodles), but I was full from the dumplings anyway. Very happy.", "author": "Lori S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "Acceptable quality food for dirt cheap. I don't much trust the \"A\" health inspection rating, but the girl at the register is pretty cute.", "author": "Noah F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "Excellent dumplings! Tasty and so cheap. Definitely an awesome deal. Ordering on the phone was a little bit complicated but they ended up fixing the order in the store. People are very nice. I definitely recommend it", "author": "Mathieu C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "This place is the holiest of hole in the wall places for lunch, but the steamed cabbage and mushroom dumplings are worth the walk of shame in and the wait on the cramped and sometimes confused line. I would definitely suggest reviewing the menu on the way in to avoid having to continuously move out of other waiting patrons' way inside. And also, order by number, not by dish (no one speaks English), and remember to ask and listen for your pickup number. All this aside, the food is good and CHEAP!! You can full for under $5 :)", "author": "Gianna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "Amazingly delicious and light dumplings. Haven't tried cooking their frozen dumplings at home, but the freshly made ones are to die for!", "author": "Edwina L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-29", "description": "Too much grease and overwhelming taste of cheap pork in all their dumpling. Honestly, don't know what the high reviews are about.", "author": "Wesley H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "Definitely five stars.  My favorite was the wanton soup and the noodles with peanut sauce.  Prices are cheap for good quality food.  The service was great!  The lady at the counter was so sweet and nice :)", "author": "Jorge E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Great dumplings! My favorite are the steamed pork and chive dumplings. The pork fried rice on their expanded menu is delicious and not greasy like most Chinese take out fried rice tends to be.  Highly recommended. Take it to go, because the place is tiny.", "author": "Hanssy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "I originally rated a 4 but I had to edit my review after eating a few more times here, it's an easy 5.  I had to take into account the quality of food and the price, not to mention the consistency.  Golden fried dumping is great for take out.  The dumplings and soup here are excellent and the prices are even better.  This is our new local soup and dumpling spot.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "This little place is crazy good, a tiny little store front with a few tables, a dozen or so chairs, and a standing room counter. Lots of what sounds like swearing and yelling from the Chinese cooks in the kitchen. If it's a school day afternoon the place is packed with kids, but it's worth the crowd because they make some great Chinese food, very fast. Noodles and soups, dim sum like pork balls, fried won ton like dumplings. This is a regular favorite for good cheap Chinese food - even at twice the price....", "author": "Dennis F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "I love going to this place for lunch. I think word is starting to spread because I went from not having to wait to now waiting 10-15 minutes just to order. This place is a little cash only hole in the wall of homemade dumpling deliciousness. You can't beat the 4 pork dumpling for a $1.\n\nThe rice and noodle dishes are really good, and they make their shrimp dumplings to order, which means they are fresh, but you'll have to wait a little bit. The only negative items I've had here are the hot and sour soup and roast pork buns. Both were of the typical takeout quality.", "author": "William H."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}