{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "Super cheap dumplings! Get the steamed ones; they make take longer to be prepared but it's worth the wait. The skin is too thick on the fried dumplings... Overall, it's a great place for fast, cheap eats...\n\nOnly problem is that it's somewhat hidden in downtown Brooklyn, away from the hustle and bustle of Fulton St or any of the main throughfares... Keep a sharp eye out for this place!! And cash only!!", "author": "Wayne C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-01", "description": "Just no. Prices were good but everything was oily and the meat did not taste fresh even the wonton soup was disappointing, but the steamed dumplings were alright.", "author": "Caitlin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-26", "description": "ALL THE GREAT REVIEWS ARE SPOT ON!\nI am a lover of all things yummy, fast, fresh and cheap.\nGolden Fried Dumpling is the place that tackles all of the above in my book.\nThe only negative is that I walk past this place 4-5 days a week on my way back home to Ft. Greene from the gym. I may also add that on a few of those nights I have opted to go to Golden Fried instead of the Shake Shack that I walk past on that same walk home!\n\nThe staff is so sweet and attentive. While you wait on most evenings, you can see the sweetest couple stuffing each and every dumpling by hand. It is amazing. I am so glad I have found you, GFD~\n\nAnyhoo, I have had their dumplings fried, steamed and in soup. All yummy. I have had their noodles and buns, all yummy.\n\nOk, I have to stop typing now because I am getting hungry.\n\nEnjoy!!!", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "Okay, let's get something straight - when you're Yelping about an almost-shady-looking dumpling house that sells FOUR DUMPLINGS for ONE DOLLAR, you're really not checking for the ambiance, or quality of service .. what you really want to know is whether or not those dumplings will resurface, not too long after, in a manner most uncomfortable and inconvenient to yourself.\n\nWell, you can rest assured - my friends and I have had all manner of food from here (the fried dumplings, the steamed dumplings, the sheng jian bao, the noodles, the sesame pancakes), and have never had a problem.\n\nThat should not be confused, however, with food that is good for you - this little shop revels in the Asian tradition of DROWNING their food in oil, so mentally prepare yourself for the puddles of oil that will spill out of your dumplings when you take a bite and then turn them over. (For your sake, I'd actually advise you to do it - no need to thank me for returning a few hours of your life, really.)\n\nBut hey, for under $5 (cash only, mind you), I really can't complain about the mountain of food you get. It almost makes me feel like I'm robbing the poor lady ... (even the average restaurant in Chinatown is more expensive!)", "author": "Miranda L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Probably the most delicious dumplings you'll find in downtown Brooklyn. Not only are the dumplings very filling and tasty but their extremely cheap. Dumplings start at 5 for $2 and 10 for $3.50. If you get the 10 dumplings you'll definitely either be full or content for a few hours. The line can sometimes be kind of long depending on what time of the day you go.", "author": "Joseph B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-26", "description": "The price is good, the food is okay. The only thing that I am not comfortable is when I came here and rush for the bathroom, the boss of the restaurant asked me to buy a stuff before using the bathroom. He said in America, everything you must pay for it, even the bathroom! As I am an old customer who often come to this restaurant, this is the only thing that I am not satisfied. Besides, the golden dumpling here is really disgusting, but everything else other than dumpling is okay.", "author": "Yikun H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-05", "description": "Decent dumplings and pork buns. What will bring me back is how quick they are how CHEAP they are. I got 5 fried dumplings, 3 pork buns, and peanut noodles all for $6. And I couldn't even finish it all for lunch so the noodles wound up being leftover for the next day. So $6 for lunch for 2 days is absolutely fab. Although the noodles were sub par and I wouldn't get them again. Basically didn't have much going on. The flavors weren't there.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-30", "description": "I am pretty crazy for 1 dollar dumplings. places  In fact during high school and most of college I lived off these.  Ya ya I know my death is near.\n\nWhen I saw this place I had to try it even with the warning about how they precook and prepackage all the dumplings.  I am used to places precooking their dumplings.  However this places leaves the dumplings in a steamer meant for steam buns.  I disapprove of this you can tell that the styrofoam is leaching chemicals into the dumplings.\n\nThe dumplings here are also smaller most places.  However the steamer makes the dumpling lose all the benefit of them being fried.  However I do like the filing.  The meat taste more like meat for steam buns than dumplings.\n\nThis is really a Chinese take out places that just happen to sell 4 dumplings for 1 dollar.", "author": "Charlie Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-16", "description": "I guess it might be a 4 or 5 star place if we were comparing to dumpling places.  But in the grand scheme of things this is a hole in the wall fried dumpling joint.  I had the pork dumplings and pork buns. Everything was great.  And my dinner cost $4.50.  Yes $4.50.  I will return too.  But they are dumplings.  And this place is a tiny crap hole.  But go here because it's cheap and quite good!", "author": "Jack S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "This place is definitely a hidden gem.  A rather small place with 3 tables but the food definitely makes up for it.\n\nFood is delicious.  Get the juicy buns or the boiled pork and chive dumplings. They are my favorite.\n\nThe service is a bit snappy and rushed but the food is cheap.  My main concern is how hot it is in there.  So hot they don't even need the flame to cook the food.  So you decide if your going to take your food to go.\n\nI definitely recommend trying at least once.", "author": "Laura C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-13", "description": "I ordered way more food than I could reasonably eat, but I wanted to try as many of the things as possible. I was shocked when it was still under $10, even with a drink. \n\nThe fun part was when I stood there while 10 people (all employees I think) screamed at each other in not English.", "author": "Franklin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-16", "description": "Warning: You will most likely over-order your first time here because everything is so cheap that you'll assume you're getting small portions. WRONG!\n\nI spent $4 here and got about four days worth of food. I ordered the pork and chive and the pork and cabbage dumplings, thinking I'd get a few shrimpy (size-wise) dumplings and be left hungry. Still thinking even this wasn't enough (and wanting to try a few different things from the menu), I ordered the sesame pancake with roast pork.\n\nThe dumplings were handed to me immediately and were PIPING hot, so much so that I had to leave them to cool for a couple of moments. They were also massive and I quickly realized I probably could've spent a dollar on one order of dumplings and been good to go. But being that I'd ordered so much, I set out to eat as much as possible so nothing would go to waste. I got through five of my eight dumplings and decided to save the rest for home. They were greasy, but very tasty and filling.\n\nAs for the sesame pancake, it came out after about five minutes, and wasn't quite what I expected, but was still good. It's more of a sandwich, with roast pork, cucumber and carrots, and though I enjoyed it, I also felt that it would have been better if the pancake was toasted. Also, the roast pork wasn't quite how I'd envisioned it would be in my mind, and was a bit fatty. Still, it certainly wasn't bad and I saved it to eat later. \n\nAs I left this place, I was chuckling to myself at the thought that I had just managed to buy an entire meal (with plenty of leftovers) for less than $5. I can't remember the last time (if ever) that that had happened to me in NYC. As a matter of fact, I can't remember the last time that happened IN MY LIFE. It instantly brought back memories of seventh grade when 20 ounce Coke bottles were two for a dollar. It was like I'd traveled back to a bygone era.\n\nI'm glad I found this place and intend to return. I will have to space things out about though, as the food is greasy. Plus, for this price, I'm afraid to know where they procure the ingredients that allow the food to come so cheap.", "author": "Clayton A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "cheap and quick\n\nI was looking for something quick and cheap to put in my stomach and low and behold this place was right next to my hotel. \n\nyou can get 4 fried dumplings for a $1 and 10 steamed for $3.. i don't get it either but i didn't care. I loved the fried a bit more because it was fried obviously.. frying makes everything better. But the steamed were very good too. I don't think the dumplings are fresh, saw them pull a huge bag of frozen ones but, still tasted good to me. menu isn't huge, but enough to please most palates. \n\nThe service is fast place is kind of small so may be better to just get it to go. unless there is no one there. the sauce they come with is good to, usually i find it really salty at most places but there's very good.", "author": "Rogaa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-02", "description": "I wasn't impressed. Maybe my expectations were too high, like that time Meet the Parents came out, and everyone raved about it, and when I saw it, I expected more than Ben Stiller could ever dream of delivering.\n\nThe price is right. The dumplings weren't bad, they just weren't great. The buns really did nothing for me. If you're in the area, it's worth a lunch, just don't come expecting it to be like Victoria's or something!", "author": "Patrick F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-21", "description": "I'm hooked. \n\nCame here with my girlfriend after she woke up with a violent craving for dumplings. Being a huge dumpling fan myself, I obliged to come with her. This little hole in the wall dumpling house that seems to be run by an older man and his daughter (most likely a family business), pump out some really delectable dumplings! \n\nWhat we ate: 1) steamed pork buns (small, Southern style), 2) fried shrimp dumplings, 3) thick noodles in sesame sauce, and 4) boiled chive and pork dumplings. \n\nEvery thing we ordered was made fresh, had a lot of flavor, not oily, and was very filling for food on a miniscule budget. There are many places in the city where I'd spend my money for some really tasty dumplings, but I believe I've found one of the better hidden gems of New York's Chinese cuisine. \n\nThe place is very small, mind you, so it probably is best to keep the foodie pals to a group of 3 or 4. No more. They also serve rice and other noodle dishes along with sesame pancake sandwiches. In addition, the restaurant also sells frozen dumplings -- 50 pieces for $13. THIRTEEN DOLLARS! Perhaps the establishment can do better to maintain some of the condiments on their tables but with dumplings this good, you don't need to add anything else. \n\nI highly recommend their boiled chive and pork dumplings and their little juicy buns. Next time, I'd like to try their sandwiches and maybe some of their rice dishes. \n\nBIG FAN!", "author": "Takeru M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "Great fried rice! Like so good always get an order for later! Sesame pancake is okay not great and dumplings are pretty bomb, go back regularly! Would recommend!", "author": "Abbey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "I was very thrilled when I first came here and even more so when I finally got around to reviewing this place. In fact I was blinded by my enthusiasm that I was going to give it a full five stars, but I realized that even Golden Fried has room for improvement.\n\nTo start with the good, cheap chicken dumplings! I cannot express my joy. I know just across the manhattan bridge where prosperity thrives, dumplings are made and sold faster than the mind can imagine. However they only sell pork dumplings, a huge problem for me, a non-pork consumer.\n\nSo Golden Fried does the job and fills a very specific niche I can't really get elsewhere.\n\nThat being said, Golden Fried doesn't have the consistent traffic of its counterpart in Chinatown, so if you come on an off hour, you might end up with colder dumplings. Which certainly isn't ideal, but you're paying a very agreeable price to begin with ($1~1.25 for dumplings). Days like these can be disappointing, and can make a very big difference on how much you enjoy your food. Otherwise the dumplings will just seem bland. \n\nThe obvious solution? PLEASE GO HERE AT ALL HOURS OF THE DAY SO I CAN ALWAYS GET FRESH DUMPLINGS.", "author": "Mohammad H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "Is the food going to win any awards?  No.\nBut when you can get a full meal for under $5 in less than ten minutes, do you really care?\nEat your dumplings and be happy.\n\nTips:\n- I find the boiled dumplings a lot more flavorful than the fried dumplings. Make liberal use of the sriracha.  Get the Chicken Dumplings in Noodle Soup for $4.25, it's my favorite thing on the menu so far.", "author": "Matilda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "I've seen some complaints which I don't get. Big selection and good food for extremely cheap. It has been one of my staple places theoughout my broke college career. You can get a good meal for $5, or get stuffed for $7 which is more than I can say about most places.", "author": "Khalin V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "I love a place where you can empty the change from your pockets, throw in a couple of singles and get a ton of awesome food. I don't eat pork, so in terms if dumplings all I can comment on is the Chicken \u0026 Mushroom dumplings (friend and steamed). Both the fried and streamed types have a great texture to them - just the right amount of dough to meat, not overdone, and most importantly, not flimsy or paper thin.\n\nSesame pancakes are also really solid, and so cheap ($1.50 for a veggie).", "author": "Roy K."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}