{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "Fast and very good, both dumplings and noodles.\nFor a very low price you get a good dinner or lunch at this place. The interior is not the most inviting but don't let that stop you.", "author": "Magnus L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "we came and we conquered...\n\nKids, I am not making this up, the list below is what were consumed by two adults (my boyfriend rocks!): \n\n1) #1 Chive and pork fried dumplings ($1 for 4) - 3.5 stars\n2) #3 Chive and pork dumplings ($3 for 10) - 4 stars\n3) #8 Roast pork pan fried buns ($1 for 3) - 4 stars\n4) #14 Sesame pancake with roasted beef ($2) - 2 stars, because it was cold!\n5) #18 Noodles with mashed sesame sauce ($3) - 2 stars, because it lacks a little flavor\n6) #25 Vegetable chow mein ($3) - 3 stars\n7) #26 fried rice ($3) - 3.5 stars\n\nI can't believe there is this little gem in downtown Brooklyn!  I would definitely come back again and again....Well, next time I shall not order the entire menu...\n\nRestaurant is operated by 4 people who all seemed to be over the age of 50...Gotta support these mom and pop shops!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "$3 for 10 BOILED dumplings.  WHAT A STEAL!  If you're on a tight budget this is def the place to come for a quick and tasty luncheon.  They don't speak very good English but as long as you go in and point to what you want on the menu, you're good to go!  \n\nYour order is ready in less than 10 minutes and they have a small eating area for you to gobble down your dumplings.  For a little more you can get the dumplings FRIED...aka crunchy on one side and they are equally as delicious!\n\nI also tried their sesame pancake with veggies and an egg.  Definitely unique and have never tried something like that before.  I'm not sure if I would order again just because it was a bit on the healthy side, but if you're in the mood for healthy, this is something to order!!\n\nOverall, very good experience and plan to go back again.", "author": "Sandy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "no frills, good food, good price. feels like asia. just what I want!", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "I ended up here by accident, but the hole-in-the-wall exterior spoke to me and the \"dumpling\" in the name was enough to suck me in. This place is heavenly! What is it doing here? Why is it here? Why isn't it a block from my house or work?\n\nThey have fried and boiled dumplings, either chives/pork or cabbage/pork. I had the fried chive and pork (4/$1) and got four ridiculously big, succulent dumplings in their thick and chewy shells lightly fried. I never thought I'd enjoy fried dumplings this much!\n\nOf course, I'd have gone for an order of 10 but of course I had to try the shacha beef noodle soup. All I can say is, I'm writing this review very reluctantly despite my egalitarian approach to Yelp. This is the best beef noodle I recall having outside Taiwan. I just know something will happen to ruin this place, like long lines or write-ups, and I'm contributing to it.", "author": "Yan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "Almost came here, til I saw the roach pictures. 3 stars for the promising price point and the nice looking pictures. (Other than the roach ones) maybe one day I will have the guts to try it for real", "author": "Amelia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "I LOVE dumpling so I had to try this spot while staying in Brooklyn, the food is ridiculously cheap (SHWING) the dumpling were good  had fried dumplings and steamed buns...some of the dumplings were as like other yelpers described  (greasy/had been cooked a day or two ago) they weren't terrible but they could've been fresher, the steamed buns were definitely fresh...all in all the food was good, you simply can't beat the prices. It's a little run down mom/pop spot but don't let that scare you away from trying something new!", "author": "Suomi H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Affordable and small place. But good taste in the vegetarian stuff. \nNo one speaks much English, but I don't care. I just want good food and I get it here. Go have fun and take a friend.", "author": "Yuvaraaj J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-10", "description": "Definitely a treat to have a dumpling spot on this side of the BK bridge.\n\nTried the steamed pork bun and vegetable sesame pancake.  The sesame pancake was five star delicious, especially for 1.50.  The steamed pork bun left much to be desired.  Will come back for the sesame pancake and to try some dumplings - and will update my review when I do!", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-28", "description": "An unassuming-hole-in the wall, this family run restaurant cranks out delicious dumplings and related food.  For just a few bucks we enjoyed an order of 8 steamed shrimp dumplings.  My daughter's favorite is their sesame bun/sandwich - delicious!  \n\nIts  a busy little place, with just a few tables for sitting.  It looked common for people to place large orders for pick up.\n\nGreat prices, wonderful dumplings!", "author": "Shannon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "If people only knew how long and how hard it takes to make dumplings, then they would appreciate 10 for $3.50.  With a pork bun, and hot and sour soup, the total was $7.  Cash only.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "I love their pork and chive fried dumplings. I prefer the fried but I also loved their steamed pork and chive dumplings. They are affordable and plentiful. I order the dumplings a lot, but I did order #23 (vegetable noodle soup) which was $3.25. It was not really filling, but for $3.25, what do you expect? The broth in the soup was not that good so I think I will just stick to the fried pork and chive dumplings next time.", "author": "Michele L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "Very good dumplings and amazingly affordable prices. Staff is willing to accommodate requests if they are not busy!", "author": "Austin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "I visit almost every week. Inexpensive Chinese food. Nice people behind the counter gravitated to just some plain good food.", "author": "Donna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-22", "description": "If you're looking for something quick and cheap, this is a good spot. Paid $7 and got 10 dumplings and a pretty good portion of vegetable fried rice which in my opinion was the best part of my order. \n\nOverall, good small hole in the wall spot.", "author": "Shawn A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "I would have never thought about going to dumpling house if my head didn't feel like 50 pounds full of congestion. I didn't need dumplings, I needed soup. Spicy soup, hot and soup to be specific. \n\nI was at a client in downtown Brooklyn and had come down with an awful sinus problem. Thank you, NYC buildings that control the heat for you. Since my apartment is a sauna, my sinuses have to be exposed to the harsh weather that is wintertime in New York.\n\nSo anyway, back on track. I was sitting at my client's coughing, sneezing, and sniffling all morning. I knew I needed soup, but I didn't know if I needed tortilla soup or hot and sour soup. I got on Yelp and defaulted to hot and sour (the only place that came up with tortilla soup in the area was Panera). That is when I stumbled upon Golden Fried Dumpling. Now, like I said, I would have never even thought about going to a dumpling house. Even though I see most of the high rated restaurants in NYC are dumpling houses, I have a think against Chinese food. After reading the reviews and searching the rest of downtown Brooklyn for an alternative, I decided to give it a try. I even had to go to Bank of America to get cash (no credit cards here, CASH ONLY). \n\nWhen I arrived, I decided to try out the dumplings; after all they are dirt cheap. Browsing the menu, I decided I would try a few of them: the chicken and mushroom and the pork and chive. The pork and chive pan fried come 4 for $1 (I ordered 2 orders) and the chicken and mushroom come 5 for $1.50. My large hot and sour soup which is a whole quart was $3. I had no idea how big any of these would be when I ordered. The dumplings are HUGE! Probably the biggest I have seen. And they are loaded with meat and veggies. They give you a spicy sauce which is delicious with just the right amount of spice. \n\nAfter eating the dumplings I didn't even have room for my soup. I tried it later and it was loaded with tofu, seaweed, and cabbage. Again, the spice level was perfect for my sinuses. I wish I knew about this place when I first started working down in BK. I would have saved so much time and money. Definitely a must go if you are in the area!", "author": "Christina F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-17", "description": "It is a hole in the wall in not the best neighborhood. But the food is outstanding, although the portions are small. The proprietor is very courteous.", "author": "Somo B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "Amazingly cheap and dirty and fast Chinese food.\n\nWas it good... no not really.  But the food was plentiful and for only a few dollars you can eat like a king!   so yes.. yes it was good. in fact it was great!\n\nI ordered so much stuff for so little money and my food was ready right when i sat down at the table!  how the hell did they do that so fast!\n\nAvoid:  The sesame noodles... they have almost no taste AT ALL!  \n\nGet:  besides dumplings.  PORK BUNS!  and the sesame pancakes make great filler.", "author": "Chris D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "First time visiting this wonderful hole in the wall. Two of us ate for $12.25. The boiled pork dumplings were scrumptious.  The fried pork dumplings were crisp and delicious. The chicken lo mein was a delight!  We will definitely be going back. Would love to try their soup when it gets colder!", "author": "Justin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-14", "description": "I had to give them a star to write a review but I never actually got to try their food.I was visiting town and wanted to order food to bring home, I typically leave the city with a trunk load of chinese food and they were close and highly rated on Yelp. I called to place an order, I asked for Chicken and Broccoli, the man said \"Cashew\", I replied \"Chicken and Broccoli\" and he started yelling into the phone \"DUMPLINGS! DUMPLINGS\" and then hung up on me. I decided to go to the restaurant to order in person and the metal gate was down. I called back and asked if they were open, the woman said they were. I tried to confirm the address and told her the metal gate was still down. She yelled something I couldn't understand and hung up on me. I left Brooklyn confused and sans dumplings.", "author": "Kim R."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}