{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-06", "description": "There are many mixed reviews on this place, but I personally like it. I'm a dumpling fanatic. I would rate their dumpling a decent 7.5/10 for the taste and a 9/10 for the price. Overall, it was a good experience and I've visited multiple times. The reason why I didn't give a perfect score is because of parking situation, hygiene can be better and attitude of people. Overall, I would recommend it for a to-go bite.", "author": "Delilahs .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "This place has decent dumplings in which it is not top quality but it is good for its price. After reading many reviews I was extremely scared of finding any bugs or cockroaches in my food but luckily there wasn't any. The place itself looks dirty which made me extremely skeptical about ordering here. The cashier took the dumplings out of what seemed to be a cooler box covered by a cloth and warmed it up within seconds. Overall this place is good for its price.", "author": "Sophie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "I got the pork and chives fried dumplings 10 for 3.50 which is a great deal. But the dumplings are premade and  packaged so they are sitting in a styrofoam box staying warm. Despite this, it was really good fried dumplings you can't go wrong", "author": "Annie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-23", "description": "Came here for lunch during my break from school. I grew up in Chinatown so I didn't have high expectations for the dumplings. \n\nThe dumplings were okay. The skin was extremely thick and the pork was too salty. It is 2 dollars for 5 pieces, which is a tad expensive for subpar quality. The noodles with meat sauce was a lot tastier. The noodles had a nice texture and the sauce wasn't too overwhelming.\n\nLastly, I ordered a corn and chicken soup. This was the most disgusting soup I've ever seen. I don't even know why and how I convinced myself to even try a sip. The color looked like it was cloudy water, and when I took a spoonful of it, I thought I was picking up jello. I might as well eat a spoonful of starch. I bought it to the staffs attention and they simply told me that's how it's supposed to be. Again, I grew up in Chinatown and I even make this soup at home myself, this is NOT how SOUP is supposed to be. I took a sip and as expected, it tasted like I was eating salty gel. I asked if they could water it down and they ignored me.  \n\nI will not be returning, I suggest people to stay away. Two train stops away can get you better quality, and authentic dumplings, and better service!", "author": "Amey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "I came here around 1pm on a Monday; I had 5 fried pork \u0026 chive dumplings and a beef scallion pancake.\n\nOVERALL: It's cheap, it's fast, it's easy. Perfect way to get done with lunch ASAP, just don't expect the world's best dumplings. [4/5]\n\nSERVICE: The woman taking orders was very patient and calm with all the customers I saw. The accent may make it harder for some people to understand what number was called. Despite the fact that the place was packed, my order was still ready in under 10 minutes. [5/5]\n\nROOM: Very small, jam packed room. Almost everyone took their order to go. That said, everything looked clean and then did get an A for sanitation inspection just earlier this year. Seating is cheap and rickety, but it comes with the territory of being a quick and dirty dumpling shop. [4/5]\n\nFOOD: First off, the dumplings were definitely freshly made. After I ordered, I looked over and I saw a young woman folding dumplings with fresh dumpling wrappers and a mounded bowl of pork filling. This is more of a northern style dumpling, with fresh, thicker skins. Therefore, in my opinion, these dumplings are better boiled than fried because the fried, thick skins can feel a bit tough, requiring a drink to help wash them down.\n\nThe scallion pancake is not worth getting unless you're a carb fiend. There's two thin slices of beef in a thick, bready pancake. It wasn't particularly hot and the beef wasn't particularly flavorful. That said, there were some nice, crisp quick pickled daikon and carrot in there to liven things up.\n\nBy the way, the condiments above the trash are soy sauce, rice vinegar, and hot sauce. If you really like the dumpling sauce they give you (and you can pay extra for), realize it's just soy + vinegar + sugar.\n\nOverall, the dumplings were decent, the pancake was a miss. [3.5/5]\n\n\nVALUE: It was really damn cheap. Even though I wasn't blown away by the food, it's still a steal. [5/5]", "author": "Nick H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "A def fav spot to stop for 10 dumplings for $3.50. Today green onion and pork. Came out super hot and yummy.", "author": "Adam X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Recommend the boiled pork and chive dumplings! Meat was well marinated and nicely cooked! You can't really beat the price and value here! It's cheap it's easy and it's fast!", "author": "Ye T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-07", "description": "I believe this is the only low-cost dumpling shop in downtown BK. Fast service. The dumpling skin is too thick, the texture tastes like a bun. Not enough meat in dumplings and their buns, and their mini wontons! Not enough chicken and corns in the Chicken corn soup! The owner is polite and always smiling at the clients. The young girl in the weekends doesn't seem too happy working there. Ok. TMI. \nIn sum, tasty food, small quantity. Please add more ingredients! But I guess we need to be reasonable. For their menu price, the size is somewhat making sense. They are busy during the wkdays.", "author": "Amelia Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-02", "description": "Real Chinese work here. Real Chinese eat here. But the majority of clientele must demand more mellow muted flavors, because everything I've had was pretty bland and what you'd expect at a typical New York Americanized Chinese take-out (rather than an authentic Chinese spot for noodles and dumplings) which is a good thing for some, sure, and in that category their portions are pretty big while their prices are pretty low, but I was hoping for a bit more flavor. Pork Buns were okay. Pork Lo Mein was okay. Pork dumplings were okay. I'll be back when I'm visiting friends in the area again, but it's not a destination...", "author": "David L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-10", "description": "Golden Fried Dumpling is a true hole in the wall. Hidden on Duffield behind a hotel and some construction, you walk in and place your order. Sadly, they ran out of a lot of things I wanted (it was only 7pm on a Thursday). So I wasn't able to try their sesame pancake sandwiches or their hot and sour soup. I did, however, try two of their fried dumplings (chicken and cabbage, and pork and chive). They came out pretty quickly. I honestly had a hard time telling the difference between the chicken and the pork, which isn't a good sign. They didn't separate the dumplings, so they were only about half fried. Not terrible, but not great. Definitely worth the $2 or $2.50 for 5 dumplings each.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "This is a quintessential casual dumpling restaurant, in a smaller version, that you would typically find somewhere in Asia. Yes the dough is thick, but the vegetable dumplings are delicious. Hot \u0026 sour soup is good too. Will definitely be going back for more \u0026 frozen dumplings to take home.", "author": "Judy Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-20", "description": "One of my favorite dumpling shops. I tend to order the boiled dumplings since they're juicer in my opinion. Great value.  Friendly service. If you're in the area, it's worth a short detour. Support this small shop!", "author": "Jimmy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-22", "description": "Let me begin by saying that you should come here if you are in need of a cheap meal. See my photograph to fully grasp how much food I was able to buy with 11 dollars. That aspect was quite remarkable. However, the rest.....\n\nI went to order some take-out on a Wednesday night around 6:30 pm. A few people were also waiting for take-out but there was no line. I waited for about 7 minutes for my food.\n\nThe pork bun was my least favorite of the three dishes I tried. Compared to others I have had in Chinatown, this bun was dry and the meat inside was mostly fat and gristle. Quite terrible and unappetizing! They actually ended up not being eaten and thrown away.\n\nI also tried the sa cha beef noodle soup because so many people recommended it on yelp. It was okay. I was surprised by what a large portion it was for ~$5. A big bowl of broth with noodles, veggies and three pieces of meat. However, the meat had a lot of fat on it and the broth was spicy but otherwise flavorless - if that makes any sense. Somehow it was so bland. I added quote a bit of soy sauce and hoisin sauce once I got it home.\n\nHowever, I also had the boiled pork dumplings and thought these were pretty tasty. I would possibly return but just for the dumplings. I would definitely not order the bun or noodles ever again.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "Man, talking about a hole in the wall!\n\nI would have passed this place up for something else if we weren't so hungry and gladly we didn't because the food is great with even better prices. \n\nThe food is not PF Chang but for two people to leave a NYC area restaurant after a 4-course meal, soft-drinks and pay less than 35 bucks, is worth your while!", "author": "Etzer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "Greasy and cheap dumplings! This is literally a hole in the wall. It's a tight squeeze in the place during lunch. I'm pescatarian so 8 fried dumplings are $5.25. When I got to the office, my dumplings were huge, fluffy and glistened in grease. And when I took a nibble there was definitely a fare amount of shrimp. It has been hours and I am still stuffed. My friend ordered two orders of pork dumplings, chicken noodles and a side of rice...all for 8 bucks! A lot cheaper if you eat meat. She definitely got two meals out of this one purchase. I will be coming back to try the noodles. Asian comfort food but not an every day treat. \n\nThere are tables, if you don't mind people's butts in you face while you eat. \n\nAnd definitely bring cash. Fast service. Cheap eats!", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "It's surprisingly good for its price!! I go there all the time for dumplings, hot buns And pancakes!", "author": "Cecia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "I think this place is the definition of a hole in the wall. Located next to a church(?) on a random empty street, it could be hard to see. Look for a red awning!\n\nDefinitely order:\nroast pork bun (the single, big one)\nusually, buns are meant to be dipped in soy sauce of some sort. This one contains wonderfully flavorful marinated roast pork and can be eaten alone. I was happily surprised.\n\nSa Cha Beef Noodle Soup\nThe beef is so tender, spicy and melt in your mouth thin.\nI wish there were 10 more pieces!\nThe vegetables add a nice crunch to the chewy noodles. It's honestly not that spicy, but I have a high spice tolerance..\n\nPork and chive boiled dumplings (10 pieces)\nI don't know what the dumpling wrappers are made of.. But they are scrumptious and addicting. It's chewy but melt in your mouth.\n\nSuper quick service! Everything came out in 3 minutes, packed perfectly to-go.\nYeah, the employees are kind of intimidating, but they're not rude. (Not going to lie... I decided what to order outside so they wouldn't stare me down).", "author": "Gina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-23", "description": "I'd really say 3.5 Stars\n\nThese are pretty decent dumplings. I'd recommend boiled over fried, as the fried tend to be a little too greasy. The noodles are a really good choice here as well. \n\nThe interior is a little small and not laid out well, so i'd recommend takeout. \n\nThey also sell frozen dumplings at great prices, so if you are in the area it is really convenient", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-21", "description": "They screamed at me for getting hot sauce a second time. It was terrifying and embarrassing. The dumplings were dough-y and alright. Do not go if you're looking for decent customer service.", "author": "H K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-03", "description": "Quite a nice find here in downtown Brooklyn. Pretty much identical to the famous Prosperity Dumplings in LES if you know that place. Although I have to admit the wait seems to be less here but the place is smaller as well. But during your first visit best to just get the dumplings to go to avoid having to fight for a spot to sit down. They do seem to offer more noodle selections though but this being my first visit of course I went for dumplings and sesame pancakes.\n\nThe dumplings were definitely well worth the price and tasted very freshly made. I had more expectation out of the sesame pancakes however I felt it was pretty dry and lacked sauce that Prosperity would add in their version. But for the price you pay $3.5 for 10 boiled dumplings they're still worth it despite they raised the price it seems sometime earlier this year.\n\nIf you have a chance definitely give this place a try. I do think it gets pretty crowded though so definitely be ready for some wait especially during lunch time.", "author": "Michael C."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}