{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "I always used to swear by Vanessa's dumpling house on elderidge, but this place is just as good. I do like that they offer chicken dumplings instead of just pork, but Vanessa's offers a Peking duck sesame pancake that is to die for. \nThe lo mein and pork buns are also pretty good here\nOverall, I'm going to keep coming back. Good food at a cheap price. What else does a NYer need?", "author": "Dina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-11", "description": "A friend of ours recommended the Golden Fried Dumpling so we decided to try it.  We had Chive \u0026 Pork Boiled Dumplings ($3), Sha Cha Beef Noodle Soup ($4.75), and Shredded Chicken Chow Mein ($4).  Everything that we had was delicious, flavorful and juicy.  It is definitely the best Chinese food in this neighborhood.", "author": "sky b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-10", "description": "I love dumplings, love.  My ideal dumpling is a pork and chive in a thin, very silky, wrapper.  Golden Fried Dumpling managed to hit 1 of 2 on this one.  The pork and chive was bursting with flavor and juicy.  Unfortunately these dumplings follow the same formula of having a thick wrapper.  But hey, if you're in the metrotech area you get these bad boys at $1.00 for for.  Order three of  those and you've got a pretty decent meal for $3.00.  Their scallion pancake sandwiches at $2.00 are fairly large, a perfect accompaniment to your dumplings.  Sadly, their pork was not up to my standards, it was pretty blah and I think it would have been much better if they used the regular Chinese roast pork.  However, as far as cheap eats goes in downtown Brooklyn, this is IT!", "author": "Phil L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-16", "description": "Tasty, fast, and very inexpensive but my god I was punished the next day. The greasy dumplings are the White Castle belly bombers of Asian food, delicious but deadly. Be warned, you better cancel everything you planned tomorrow.", "author": "Mike L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-01", "description": "Very small, quaint mom and pop restaurant.  It's not the best looking place but the food is great, and inexpensive.  I love the pork chive dumplings (4 for $1).  The chicken chow mein is great as well.  You get a pretty big portion for only $4.  It usually take me two days to finish.  Everyone is always pleasant and the service is quick.  I'm always in and out.  I love that it is so close to home and so cheap (I'm there all the time).  I would definitely recommend this place to anyone looking for some good, movie nite, don't feel like cooking, long day at work, Chinese comfort food.", "author": "Alicia D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-30", "description": "I had the boiled vegetarian dumplings, which were bland and much too doughy. There were a few other vegetarian options, including the vegetable pancake and peanut noodles, that I didn't try.", "author": "Jean C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "Very cheap and yummy dumplings - most of the time ...  \n\nUsually get the boiled dumplings but ordered the fried dumplings last time .. was not impressed.  Bit into one dumpling and got a mouthful of oil -- yuck.  Looked in my container and found that the dumplings were swimming in oil -- double yuck.  But! My friend who got the same thing offered me her dumpling and it was not as oily -- so we think it was just that one batch.  So beware!\n\nCan't go wrong with the 10 boiled dumplings for $3.  Stick with that and hot and sour soup and for less that $5 you've got an awesome lunch that will keep you full for hours and hours\n\nEnjoy!", "author": "Helen H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-02", "description": "Yelp you've let me down! I just don't get it! I got the pork and chive, and was greatly disappointed. They were greasy and tasteless even with the soy sauce. Cheap but not worth it. Would definitely recommend skipping golden fried for a quick trip into Chinatown for some real dumplings.", "author": "Emma L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "Omg this place was amazing. I came here with my family after reading their Yelp reviews. When we arrived a women walking out of the restaurant told us that the dumplings were great. Seriously, after the first bite we decided to order more to take home. I even ate them for lunch the next day! My favorite was the pork and chive boiled dumpling. If you're thinking about going here don't hesitate you won't regret it.", "author": "Sade S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "Thank you yelpers!! Without your previous reviews, I couldn't have discovered this place! I got boiled dumplings, fried rice, chow mein, fried dumplings and they were all good. All under $10.00! Will be back soon.", "author": "Yumi I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-31", "description": "A nondescript, shabby little dumpling house in downtown Brooklyn that serves amazing food. A couple of tables are available if you want to eat-in. The dumplings are fresh and served rapidly. (Never had to wait for more than a couple of minutes).  The prices are very affordable--$3.00 for ten dumplings. Check this place out if you're in the area.", "author": "R M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-19", "description": "Had to write a review for my fellow vegetarians out there... They do have both steamed and fried vegetarian dumplings. I tried the fried and thought they were pretty good. Huge portion for a very cheap price. Maybe not the best ever, a little greasy/salty, but what do you want in a dumpling? Sesame pancake is huge and super cheap, less than $2 for basically half of a sandwich. Don't be sketched out by the inside or intimidated by the lady screaming numbers in your face behind the cash register. Place is a solid option for the area, but don't seek it out from far away...", "author": "hannah s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "Insane, absolutely deliciously insane!  The food is incredible and the price can not be beat.  If you are around DUMBO, especially if you're staying at Indigo, or ALoft, or Sheraton, this place is 20 seconds away and so worth the walk.  The pork and chive dumplings are amazing; the hot and sour soup is the best in town, the shrimp fried rice makes other restaurants jealous.  Just go!  And, please, give them a big thank you, high five, huge tip 20% of a $12 dollar meal . . . seriously?  Do it!).  You will not regret your visit.", "author": "Rocko M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "Fantastic little place. When you can get an entire bag of food for 10 bucks, you really can't go wrong. The pork buns are pretty good, as are the pork and chive dumplings.", "author": "Steve W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "This place is truly a hidden gem in the neighborhood - the prices are incredible (we can feed two people with $5), the dumplings are fresh and home-made, and the staff is so sweet. The large pork bun is pretty gross - but everything else is fantastic. I highly recommend the boiled pork and chive dumplings.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-28", "description": "This place is great, and close by to school at NYU-Poly.  The food is good and super cheap.  You can't really beat it.  Even the Chinese students at school think that it's good Chinese food compared to other Americanized Chinese restaurants.  I'll certainly be going back.", "author": "George M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-27", "description": "Delicious \u0026 authentic, family-owned, hole-in-the-wall type dumpling place. \nPerfect! The staff is super nice, but don't speak much english, so just order by number.\nI hope they deliver soon!", "author": "M L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-09", "description": "You guys are nuts. I was there the other day at 1:30pm which should be prime busy time for them.  The fried pork chive dumplings and fried pork buns had both been sitting for quite a while and were tough and dried out. At $2.25 for all that I hate to complain. But it was not good in any way.", "author": "suzanne a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "Random location. Pretty awesome Chinese food. There is a little old lady in the back who is cutting apart the dumpling dough, it feels very authentic! The dumplings were very greasy but SO GREAT! This place is cheap, like cheaper than McDonalds. I got 8 dumplings and 1 sesame pancake bread thing for $2.75!!! Thats insane. I cant wait to go back and try the hot and sour soup which looked great! The place is kind of run down but for the price I don't mind. A hidden gem that has the potential to make me very fat.", "author": "Yara C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-01", "description": "Stopped in on a whim one day after walking by on the way to Macy's.  Honestly, I wasn't expecting much given the prices, but I was unexpectedly blown away.  10 of the best and freshest boiled dumplings I have ever had for 3 bucks.  Such a good find in the neighborhood.", "author": "James I."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}