{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-02", "description": "My vegetable sandwich had kind of a soggy bread, limp shredded carrots, and like two little piece of cucumber.  It was cheap, but I felt like I got what I paid for.  Pan fried buns were tasty, but not very fresh.  I came in at the end of the day though, so maybe the experience would be better earlier in the day.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-25", "description": "Horrible. The food was salty and tasted as if the meat was there for a long period of time. The sesame pancake was hard as a rock since they microwaved it.  Although it didn't cost much I still regret the money I spent. NEVER AGAIN!!!!!!", "author": "Rubby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "The reviews made this place seem amazing. It's not amazing , it's just good. The prices are good, and the food is good if you get a fresh batch, sometimes you get a batch that was sitting in a storage box that's heated and those batches don't taste as good as te fresh ones. \n\nNevertheless for the price is a great bite. Check it out.", "author": "Aleksey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "The order was made extremely fast...it was very delicious and very affordable...I just wish that they delivered.", "author": "Mary L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-03", "description": "Great for cheap eats if your on a budget but they are cheap with their. Napkins and utensils. How do you give your customers 2 Napkins each time they eat dumplings there knowing dumplings are greasy. Been numerous occasions when they have been cheap with forks,plates, Napkins.", "author": "Hazel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "the best food ever I love it I always go here to eat  the people is so nice  very respectful have good manners", "author": "Felicia B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-19", "description": "The only redeeming part about coming to this place were the dumplings. They were very well prepared and tasted great.  I also ordered the supposed spicy soup (the guy warned us about the heat), but it was flavorless and barely had any heat.  The meat in the soup was also very bland and the noodles meh. Don't order the soup.\n\nThe service was also not great.  We ate inside, and the young guy at the counter gave us what looked like two or three toilet paper square sized sheets for napkins. When we asked for a bowl so my buddy and I could share the soup, the guy asked for 25 cents for the crappy container.  It was extremely weird.\n\nThis place is cash only, so bring some money with.", "author": "Miguel S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "Poor quality dumplings. The boiled dumplings were clearly made with pre-made wrappers, not house made dough. There was too little chive in the chive-pork dumplings. Consequently, they were rather flavorless.\nThe pan-fried (guotieh) were basically the same dumplings as the boiled. Guo tieh should have thinner skins than standard boiled dumplings because the pan cooking process requires less constant contact with water. The dumplings themselves were not cooked properly, lacking the crisp delicate underside and not lightly stuck to each other as they would be if the proper cooking method were used. They appeared to have been thrown into the pan after they were pre-cooked just to brown up the bottoms. Properly made guo-tieh are at least twice as long as boiled dumplings and cannot be eaten in one bite.\nThe pan-fried buns had the same problem as the pan-fried dumplings. Filling was under-chived. Buns were made ahead of time and then heated up. As with guo-tieh, there should be a delicate crisp underside with a soft and tender upper. These had neither.\nNext time, I'm taking the subway trek to Nan Xiang or Wah Fung for my good eats.", "author": "John H T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-16", "description": "The dumplings are great! Very well-done, and affordable. Everything else on the menu is also affordable-- I have tried the vegetable fried rice and peanut noodles, however, and both were overly greasy and with no other substantial ingredients other than the grains. You have to speak to her in Chinese to ask for hot sauce, otherwise she won't give it to you and will charge you when you ask after placing your order. Cash only. I can't imagine eating in the restaurant as it's cramped, hot, and not that clean -order and take to go to fully enjoy your experience.", "author": "Grace L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-08", "description": "Scrumptious rice and the dumplings were delicious! I asked for pork and confirmed it was pork, but it wasn't pork.", "author": "Amanda N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-09", "description": "The place is obviously a huge neighborhood, dare I say borough-wide asset for those who either out of broke-being or cheapness are in need of dollar-ish Chinese dumplings but are unwilling or unable to make the trek into Manhattan for whatever reason.  What keeps the place planted firmly in 3 star territory is the fact the, unlike many of the legendary Chinatown spots, the quality here is somewhat inconsistent.  I have sampled some dumplings here that are of perfectly acceptable condition, but on occasion, particularly with the boiled variety, which is the one I am most apt to order, have received dumplings which have been overcooked to the point that the skins basically fall apart when they are pierced with the plastic utensils, leaving the innards exposed with the wrappings strewn around them as if they were Italian Gnudi, albeit the opposite of al dente.  Still, with prices this low can you really complain too much without feeling pretty ridiculous?", "author": "Brendan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-21", "description": "Before I even get to how the food was I have to start by stating that everything I ordered here was lukewarm or cold. At first glance my eyes popped out of my head because the prices are DIRT cheap. \n\n4 fried dumplings for $1\nSesame Pankcake sandwiches for $2 and UNDER\nSoups for $3 and UNDER\n\nPoint is this place is CHEAPPPP. I tried the fried chive \u0026 pork dumplings (4 for $1) and they were cold. On top of that when you bit into them oil came flying out and got everywhere. All over my face, eating surface, hands, etc. I couldn't even finish all four because of how oily they were. Inside of each dumpling the pork is sitting in a pool of oil. It just left me grossed out and with a stomachache considering all the oil I just ingested.   \n\nAlso tried both the beef and pork sesame pancakes. I enjoyed the beef. The pancake itself is a lot more doughy than i'm use to getting in Chinatown. As for the pork pancake it was okay but a little to fatty for me personally. (but I tend to find pork fatty in general....I usually just stick to BACON)\n\nThe service here is nice and it's quick. They can get a crowd during lunch hours during the weekday with all the business people and colleges in the area. \n\nSomeone told me I should try the boiled dumplings because they are made on the spot as oppose to the fried ones which take longer so they have to fry them in advance (hence why they were cold) so next time I'll try that. \n\nAll in all you can fill yourself here for UNDER $5 and still leave with change....how many places can you really say that about these days?", "author": "Rojé G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "These dumplings are incredible, i've had all their varieties... fried, steamed, pork and chive, pork and cabbage and you absolutely cannot go wrong. You will also be amazed at how much food you can get for $5..... or better yet $10 is a full meal for 2 people- and i'm no bird.\n\nSimply amazing and delicious", "author": "Bethany W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-03", "description": "Good, cheap \u0026 filling. You're not going to find a filling lunch in the area for so little!  My food of choice are the pork and cabbage fried dumplings. 8 for $2. I can never finish all 8. A bit greasy.  You can eat in the restaurant, but it's tiny. I usually just pick it up and bring it back to my desk.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "Straight-forward, cheap, and tasty food here. Grab a menu when you walk in and know what you're ordering when you get to the front of the line. I recommend the boiled shrimp dumplings, pork and chive dumplings, and Sha Cha beef noodles. \n\nSure, you can get better quality dumplings and noodles if you head to Chinatown or Flushing, but if you work in the area it's a great spot for a quick fix.", "author": "Justice T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-31", "description": "UPDATE: You may not want to go here for anyone with shellfish allergy sensitivity. The last 3 times I had an allergic reaction even though what I ordered suppose to contain no shellfish. I believe they mix cooking tools with food with shellfish.\n\nTried this place the first time after yelp reviews and proximity to work. Ordered the chicken, mushroom \u0026 cabbage fried dumplings (#5) and mixed veggie noodle soup (#23). Dumplings were good. Not too salty or mushy. Veggie soup was also good. Fresh ingredients and was not overwhelming. \n\nA very local place. Customers knows the routine and I tried to follow the crowd and blend in. I like the simple menu. Straightforward and no frills. Prefect for lunches. It is always great finding these places with simple but great core competencies.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-05", "description": "Can someone please tell me, what is so special about this place?\n\nWas in the mood for Chinese on Friday night and came across this place after filtering my search to \"Most Reviewed\". \n\nI got there and was handed a little menu by the gentleman behind the counter. I realized this place wasn't for me after every item I read ended or started with \"Pork\" ( I don't eat pork).\n\nLong story short, I ordered the shrimp and vegetable dumplings. Ten minutes later, I was handed a greasy Styrofoam container with the most unappetizing and unsavory thing I've ever had! Bland and greasy would be the best way to describe what I was served. I mean, they should've just handed me a bottle of oil when I walked in and said \"here you go, here is a sample of what you're about to order, drink it\".\n\nNever again.", "author": "Karim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "Yes!!!  Awesome 'hole-in-the-wall' with very low prices.\n\nNo decor or mood in this joint. It's a kitchen with an area by the door for you to stand and order while somehow a couple people are squeezed into table.\n\nWhy would I want to come here you ask?\n\nGREAT VALUE\nDELICIOUS DUMPLINGS\n\nTip: go all out and try the $5 shrimp dumplings, they're awesome", "author": "Jeffrey T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Went there for their pork and cabbage dumplings!!! So fresh and delicious. the price is very affordable and they have outdoor seating cuz inside seating is a very small area.. I also enjoy their beef noodle soup, dumpling noodle soup, fried pork buns, sesame pancake with beef and fried rice.. the only downfall is CASH ONLY so be prepared when they decline to take cards. Awesome lil hole in the wall that reminds me of my grandma's home made dumplings...:-)", "author": "Elizabeth W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-03", "description": "On a budget, here's where you go. Tasty Pull pork fried rice for sure.", "author": "Chris P."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}