{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-21", "description": "My first time here was on a cold night. It was very close to their closing time so the place was practically empty. We placed our orders, paid and in 2 minutes we were out. The fried pork and chive dumplings were not bad, just okay. Nothing to really write about. If your are in the area and want some cheap eats, it's the perfect place.", "author": "Y. D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-18", "description": "Ah this place has gone a bit downhill. The pan fried dumplings were almost inedible from sitting out too long and the sha cha noodles had one piece of meat. It's not the worst place for a dumpling stop but barely average at best unfortunately. I'll try the shrimp boiled dumplings if I ever come back.", "author": "Amir K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-11", "description": "Cheap eats! $1 for 4 dumplings.\n\nIf you are in the area, and want fast, good, cheap food. Come eat here!! Don't pay the exorbitant city hall food prices around the neighborhood.\n\nThis will definitely fill you up for ~$5 (depending how much you can eat, of course)\n\nThe place is small, but the line goes by quickly!", "author": "Jennie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "No frills, hole-in-the-wall, really cheap and delicious dumplings. I recommend the pork and chive boiled dumplings. You can get 20 dumplings for just $7!", "author": "Chris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "Golden-Fried-Dumpling is forging ahead lately. Not resting on its laurels. Not content to lie fallow! Its got an expanded menu now with more seafood and vegetable offerings. Slight --very slight price changes, but totally acceptable. The whopping big bowl of 'Sha Cha Beef Noodle Soup' is now $5.00 instead of $4.50. I'm fine with that.\n\nAnyway it appears to me as if the place is either under new management or else, the quaint little Chinese family who runs the joint has brought in some more family members or maybe hired some new staff. Cute waifish elfin little Chinese girls now at the front counter; and they have better bi-lingual ability for English-Chinese conversations. Maybe students working part time. \n\nBut GFD in general just seems to have new energy and ooomph. Hurrah!", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-27", "description": "Mediocre at best. Food was ready fast, and was cheap.\n\nThe pork + chive dumplings were super rubbery and tasted like they were made hours earlier and left to warm - gas station style. \n\nThe cabbage + pork dumplings were better, but still underwhelming. \n\nOverall regretful experience. Silver lining was the orange soda was up to par and I only spent $5 total.", "author": "Tennessee P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "Truly one of those small hole in the walls you would miss, Golden Fried Dumpling brings a bit of Chinatown to you. I've had all their dumplings and I've had the 22(Sha Cha Beef Noodle Soup). \n\nIn terms of value, this place can't be beat. 4 dumplings for a buck...what a steal haha. 10 boiled dumplings for 3 bucks... \n\nAnyhow, in terms of taste, be prepared for a very specific taste. The dumplings are great in small batches, though I've found that if you have more than 10+, you'll realize how peculiar and slightly greasy they may be. This still takes nothing away from the fact that I do like this place.(the dumpling skins are perfect...not too thick, but still a bit chewy). The beef noodle soup was solid and was a ton of food for under 5 bucks. Definitely a steal(though I wouldn't recommend drinking the oily/spicy soup base)\n\nThe staff here are almost all old grandpas and grandmas. It's definitely family run and you can tell they've been doing this for a long time. I felt incredibly welcome here(though it is beat down) and I'll definitely be back.", "author": "Dawei L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-29", "description": "I rarely review and even more rarely give a bad one, but this place sucked. The pan fried pork dumplings were cold and the skin was thick. The sesame pancake was tough and tasted like it was sitting out and  the roast pork buns just nothing. They tasted like nothing. Even the Coke I got want cold! Go to Chinatown and try China North Dumpling. So much better than this crap meal I just ate. Literally typing after I finished my last bite. That's how disappointed I was.", "author": "Ryan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "This was the little place down a side street we were looking for. The $1.50 large pork buns were great and we enjoyed the dumplings. If you are after a cheap meal, this is a great spot and good food!", "author": "Bryce J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Long wait, but worth it for the ridiculously good dumplings. Really. I'll go back, but will skip the buns and explore other things in the menu (plus a healthy serving of dumplings) next time.", "author": "Patrick W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "Dont come here for the atmosphere or service (they dont understand English very well) but the food only!  \n\nAuthentic Chinese for a fraction of the price.  #4 and #22 for $7.75  I try to stay away from their fried dumplings.  They tend to get a lil greasy but non fried ones you cant beat!  The soup is great, full of flavor, and portion is big!\n\nTheir grade is currently pending but dont worry they are open.  You will not get sick from the food so dont worry, you will survive.  :)", "author": "Philip T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-15", "description": "Been coming here for lunch the last three years. The food if fresh and well made. I love the steamed shrimp dumplings. The fried rice and noodles are also excellent. I would give it a fifth star if there weren't communication issues from time to time. It can also get crowded with the MetroTech office folks and nearby students.", "author": "Rick J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "This little hole in the wall is a gem.  We were walking around Brooklyn, looking for a place to sit and get a snack and found this place on Yelp.  If it weren't for Yelp, I would have never come here so THANK YOU YELP!\n\nWe got the pork and chive dumplings, boiled, and they were the best dumplings that I've ever had.  They were AMAZING and for $3, you get 10 of them.  Can't beat the price.  We also got the chicken dumplings, fried, and they were good but not as good as the pork and chive dumplings.  Next time I'm back, I'm going to make a meal out of  the dumplings. Note, the dumplings are pretty salty and have a lot of juice in them, which is fairly unusual for boiled dumplings.\n\nSome other people showed up and ordered noodles to go, and those smelled amazing.  I wish that they had a shop in Seattle, as they sell frozen dumplings that you can cook at home.", "author": "Angela C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-01", "description": "Food was just okay. Place was extremely hot and the customer service wasn't too good. Sorry Don't think I would come back here. At all.", "author": "Ericaaa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "Bomb dumplings. Quick service. CHEAP. Classic example of a good \"hole in the wall\" establishment.", "author": "Trevor B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-13", "description": "The pork and chive dumplings are still really good, but the \"sweet and juicy pork bun\" is neither of those things. Very doughy, and it was cold and seemed like it sat at the counter for a couple days. Didn't taste fresh at all.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-01", "description": "We love this place. Sure it's a hole in the wall and they barely speak any english... but they make a mean dumpling. I highly recommend the boiled dumplings which are likely much healthier and come out steaming and tasty. The pro move is to by a frozen 50 pack of the dumplings (I like the pork and chive) to keep in your freezer AT ALL TIMES. Whenever to hunger pangs start, these guys make a really quick and task snack or meal complement.", "author": "James A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "Great food n great prices not much more to say lol", "author": "Nick C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "Good service, cheap and delicious dumplings in Downtown Brooklyn.  Is a small place, but comfortable. I'll\nCome back next time I'm in the area.", "author": "LynneMarie N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-12", "description": "Cabbage and pork dumplings were greasy and cold. Had to use imagination to believe there was any pork in the greasy pork wonton soup. The chicken, mushroom and cabbage dumplings were pretty good but not good enough to make me want to come back.", "author": "Karl B."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}