{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "I'm an L.A. native, and I know that L.A. Chinese can't hold a candle to NYC-food, so I always try to go out of my way to eat at  dumpling or chinese hole in the wall when I visit the City. That said, we stayed in Brooklyn for a wedding this past weekend and during our nocturnal feed hours, we stumbled upon Golden Fried Dumpling. \n\nReminiscent of some of the smaller spaces in San Francisco - this, to me, was not the quintessential NYC chinese setup - there are four two-two tables replete with wooden chopsticks, watered-down Sriracha, homemade, gummy chili paste, thin cheap napkins and a plastic tray. You order from the husband/wife duo that runs the spot, and they make the food as requested. Obviously most of the food is pre-made, but it is that unique combination of gratuitous oil usage and heavy MSG flavor that makes this some of the most authentic Chinese food I've tried outside of Suzhou. \n\nI want to isolate this point: authentic, in-China Chinese food is VERY heavy on oil and MSG. It's just how it is, and if you're not accustomed to that, you may be offput. It's that simple. This food mimicked real Chinese food, and it is quite good - specifically the Spicy Noodles and the Beef Sesame Pancake.\n\nNow that above does not constitute anything special, or worthy of me reviewing. It's not so delicious that I'd go come from Manhattan or anything. What sold me - what wowed me, more aptly - were the prices. When I saw these prices I literally thought they either handed me a menu from 1989 or were going to serve Amuse-bouche-sized portions:\n\n*$1 for four dumplings\n*$1.50 for hot \u0026 sour soup\n*$1 for three roast pork buns\n*$0.75 for the sesame pancake\n*$2 for the beef sesame pancake\n*$4 for the spicy noodles, which was an insanely large portion size\n*$3 for TEN pork dumplings\n\nWe ate like royalty - or simply typical Americans - for less than $15 (including tip for the nice lady) and we had enough leftovers for a second meal. While I am questioning the quality of the ingredients, the oil usage more than hid any imperfections. Do we always like to eat cheap quality food for cheap? Not really. But being that we happened to adjacent to Golden Fried Dumpling and had a hankering for Chinese, GFD really did hit the spot.", "author": "Evan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Great, quality dumpling. Everything I thought I knew about $3 food was a lie. This little hole-in-the-wall has stolen a piece of my heart. Actually, it wouldn't be fair to call it a theft, as I practically handed my heart to this temple of doom. I will visit often, and I am certain that I will turn a blind eye to my expanding waistline. Boiled pork \u0026 chive dumplings invade my thoughts at work. I can taste them now. Lunch time is so close, yet so far. Until we meet again, all I have are my fond memories to get me through this day.", "author": "Cassie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "Unless you go to chinatown, you can't really beat the price and quality of this. This ranks close to Prosperity's or Vanessa's. Has a great assortment of other menu items too. I would avoid their triangle sesame sandwich though. Falls a bit flat compared to Vanessa's as the bread is a bit chewy and not as 'doughy'. Cheap, fast and easy fix for lunch, snacks, or dinner.", "author": "J L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "SERIOUSLY CHEAP\n\n$3 for 10 dumplings? Are you serious? If only this establishment was in Manhattan, there'd be lines for lunch and dinner. Here in Brooklyn, it was just us enjoying the cheap goodness. Later, a couple locals stopped by with looks of confusion over what to order. Who cares?! It's that cheap. Order everything!", "author": "Dennis L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-16", "description": "I have lived in the neighborhood for six years and I am sorry I did not know about this place sooner!\n\nAn employee at the Brooklyn Blood Donation center nearby told me about the place, and I love chinese dumplings so I knew I had to try. They are very prettily shaped and more importantly, taste delicious. I got 4 pork and chive friend dumplings for $1 and the sesame bread and pork sandwich for $2.25.  The sandwich had some pickled carrot which was a nice touch. They had other dumpling varieties and I will certainly be coming back to try!\n\nTasty food and very good value in the Downtown Brooklyn area.", "author": "Serena B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-29", "description": "First off: Make sure you poke a hole or bite off a tiny end of each dumpling and drain out the oil.  I suppose it adds flavor for some, but eating a teaspoon to a tablespoon of oil per dumpling is a bit too much for me.\n\nI ordered eight dumplings, vegetable noodles and a soda for a total of $6.00!  I could not even eat everything and was stuffed when I left.  The flavor of everything was very good, just very greasy / oily.\n\nThe service was good too.  Friendly and fast.", "author": "John H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "I was really looking for some cheap chinese food and I found just that. The food is ok but it's really hot in there so I wouldnt suggest staying in to eat. There is a nice area outside where you can eat", "author": "Medwin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-26", "description": "First impressions are almost always misleading in terms of places to eat. This tiny little place has the best dumplings I've had anywhere. Super cheap, though I wouldn't even mind paying more. \n\nThe menu is basically just some rice and lo mein selections and dumplings either steamed, fried, or pan seared. Not a lot of variety but the food they do have is delicious. \n\nThe customer service isn't worth commenting on nothing special. Just regular people who don't want to make combination fried rice for some strange reason. \n\nI'm just waiting to be unstuffed so I can go back and have some more.", "author": "Gabriela A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-23", "description": "Probably the cheapest Chinese food place u will ever find in Brooklyn. Food quality is not great but for the money u pay, definitely worth it for take out.", "author": "Jae W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-13", "description": "A Brooklyn jewel, seriously. I am so glad to have found it and tried Golden Fried Dumpling.\n\nDon't get stuck by the appearance (the place is very clean and displays an \"A\" in the storefront). Get inside and see the owners rolling fresh dumplings by hand.\n\nThe fried dumplings are great. Next time I will try the noodles.\nEverything is so convenient. We had a meal for two people and we spent $9.", "author": "David B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-04", "description": "I feel dirty.\n\nI've never had anything as greasy as the $1 for 4 chive \u0026 pork fried dumplings.  There is a huge splatter of grease at mouth level on my cubicle wall from the squirt that came out on my first bite and I had a big puddle of grease on my skirt.  There was also a puddle of oil in the container that was absolutely disgusting.  Well, I guess that is also because after the first bite, i learned to poke a hole in the dumpling and drain the grease before biting.\n\nI also ordered the noodles with mashed sesame sauce for $3 - cold.  People said that this dish was dry???  I have grease stains on my shirt to prove otherwise.  It was pretty big....I couldn't finish it.\n\nSo why did I give this place 3 stars?  \n\nAfter I go home and shower, I need to come back here and try some of the non-fried dishes.  The prices are the best prices I've ever seen around one of my work establishments.  And looking at the other people's orders while I was there, I know that there are some hiddn gems in this place.  I didn't mention that the flavors (although masked a bit by the grease) were really nice.", "author": "Katie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-17", "description": "woot! cheapie dumpling place only 15 min walk away from my apt? SWEET! we got an insane amount of food and it was ...$13.50...say what!?\n\nnot as good as prosperity dumpling imho but better than vanessa's. oddly enjoyed the boiled cabbage + pork dumplings better than the pan fried leek + pork dumplings. i'm usually a huge sucker for leek + pork. sheng jian bao (steamed bun) and soups (hot \u0026 sour and corn soup) were only all right. the dan dan noodles are good but pretty darn spicy, so beware!\n\nP.S. Oh yeah, the owner lady totally does say sexy instead of 6!!!!", "author": "Ellen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "I've only visited on the weekends and it's pretty quiet in MetroTech on non-work days so I can't attest to the \"waiting\" many people comment on ....\n\n\nI absolutely love this place.  With a $5.00 bill you and a friend can have a feast.  I feel like that is how a dumpling house is supposed to be.  The soups are pretty big which is why they have a higher price tag (around $5.00 each) but ordering a batch of dumpling for $1-$3 and having enough for leftovers is what makes this place great.\n\nThere has always been the same older woman that really doesn't speak much English at all that has taken my order every time and she is SUPER SWEET.  She dropped some type of sweet bread in my bag one day and smiled at me (^__^)\n\n**WARNING:  The fried dumplings are sort of hit or miss.  They can be really, REALLY fried.  I usually always order the boiled dumplings to avoid this problem.  They taste better anyways.\n\nIf you're in the MetroTech area or hanging at Dekalb market make sure to stop by.\n\nFAV: Boiled pork \u0026 cabbage.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-27", "description": "eek, dont go out of your way for this one.\n\nThe menu is very similar to the cheap dumpling spots in chinatown that I love, and often survive off of.\n\nBut the quality, cleanliness, service and overall execution is disturbingly awry.", "author": "Ryan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-26", "description": "Great for a cheap quick lunch. Had dumplings, spicy beef noodle soup, sesame pancake for $6.50. Tastes like an undiscovered hole in the wall Chinese restaurant. My only complaint is that the dumpling skins are too thick.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "Four stars is an average. \n\n5 stars for 'value for the money,'. Less than seven bucks for 5 fried dumplings, chicken lo mein, and a Diet Coke. \n\n3 stars for the food. It's fine, but not better. \n\nOverall, I call it 4.", "author": "J Scott C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-27", "description": "Yes, it's tiny, and yes, the people here don't speak English, but so what, I still love it! Those dumplings are delish!! And super cheap!! The sesame pancakes are good and the dumplings are awesome. I even loved the hot/sour soup. Mmmm mmmm mmmm. \n\n\nThat is all!", "author": "Ana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-02", "description": "Just brought a pork avoidant friend here and shared some boiled chicken and mushroom dumplings.  They were so good we also ordered fried ones, which were, as another reviewer describes, very oily but very good.  Like the pork dumplings, the filling is really meaty and flavorful.  Hot \u0026 sour soup broth was great again.\n\nThe sesame pancake with veg had disappointing fillings though.  Mostly shredded carrots, a bit of cucumber, just about no cilantro.  They don't drench the inside of the bread with sauce like the pancake at Vanessa's.  The pancake itself was good still.  Thicker dough and less greasy than I expected.", "author": "A Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "I'm staying at a nearby hotel and I have been to the Dumpling about 5 times in 7 days. The steamed dumplings are excellent. Handmade dumplings prepared  right in front of you. This is one busy place being close to Poly, but the service is quick. The city has placed cute little tables and chairs outside. Love this place; the dumplings and the price. You get eight steaming hot dumplings for about $5", "author": "Elaine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "The dumplings were pretty tasty. The fried ones we got were a tad oily but had a really crispy skin. Saw some reviews noting the bad ventilation and seating, but we were looking for quick take-out and this place hit the spot.", "author": "EY T."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}