{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-26", "description": "Tasty, greasy and they charged for stuff that was then left out of my order. Might repeat.", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "The dumplings are fresh and the won-ton soup authentic, made with spoon size won-tons in a fresh broth (if you are looking for that overly salty canned broth, go elsewhere). I eat here about once a week and have tried most things on the menu. I would give it 5 stars if the quality and speed were a bit more consistent. Sometimes the dumplings are over fried but most of the time they are just right. Eitherway, for $1-$1.50, you cannot beat them!", "author": "Kay Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "There is a limiteed choice but the food is tasty and you can't beat the price. It's good simple chinese food and I loooovvve the pork buns.", "author": "Mirnova C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "Hands down the best chinese food in the downtown brooklyn, brooklyn heights, carroll gardens, cobble hills, boerum hill, dumbo area.  I had the boiled dumplings and thought they were great.  Tastes like chinatown... and it's cheap like chinatown too!", "author": "sejin k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "Discovered this place (only blocks from the bf's office) thanks to Yelp. The food is consistently good, the experience is completely no fuss, and the price is as cheap as it gets. We've never spent over $10 to feed 2 people and always leave with leftovers. If I worked nearby I would eat the fried egg sesame pancake sandwich everyday for lunch. Seriously the best $1.50 you can spend.", "author": "Amy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "I love this dumpling place so much. Downtown Brooklyn is so lacking in authentic Chinese food, so imagine my surprise when I stumbled upon this little gem on a quiet side street. The menu consists mainly of comfort Chinese food items like different varieties of dumplings and pork buns and noodles. I feel like I'm in a Flushing hole-in-the-wall dumpling spot!", "author": "Esther M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-05", "description": "I went there twice and both times were disappointing. First time, I ordered the signature item which is the fried dumplings (2 orders). When I brought it back to the office, I opened one of the containers...it was all burnt...black and I had to toss it away. Second order was better but it was still not good b/c it was hard and doughy. I went back to the restaurant today, to get a small chicken corn soup...it was just as nasty!!! The soup was lumpy b/c its was soooo starchy!!! Not sure if I will go back and try their food again!!!!", "author": "Sunshine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-17", "description": "I've eaten at a lot of dumpling places and trust me, this place is THE best place for dumplings.  Their skin is not too thick like other places and their meat is flavorful and juicy. You can see them hand making their own dumplings over the counter which is nice.  The price is extremely affordable, especially for the neighborhood. You can be sure to be full for less than $4. I recommend the boiled dumplings over the fried ones since they tend to premake the fried dumplings which, overtime, can lead to a tougher skin.  I've also had their pork buns which are equally delicious. This place NEEDS to be on the map since their dumplings are so good and so affordable.", "author": "Carson D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-18", "description": "It has good spicy noodles which is vegetarian...their veggie sesame pancakes are a little odd - fried/baked bread with julienned carrot and cucumber slices and cilantro sandwiched in between two slices. The reason why I didn't give four stars is that the menu is quite limited for vegetarians...no veggie dumplings available. But I thought the service was friendly and my lunch cost $5. Though it is so cheap I don't know if that is good or bad. It is not a dirty establishment at all and those who have written so before prob have a different view on what is clean. It is just a basic dumpling shop.", "author": "Yu Ming L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "Almost suspiciously inexpensive.  I always over-order when I go here and end up with about 3 meals worth of food for $12.   The atmosphere is beyond bare-bones, but the dumplings and sesame pancakes are on par with what you can find in Manhattan.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-10", "description": "Super cheap but not very good.  Had high hopes after reading all the good reviews, but was sorely disappointed.   First they messed up my order and failed to give me two items out of 6, but then randomly included other things that I did not order.   The pork and chive dumplings were mediocre and tasted oddly of fish.  The Sha Cha soup was plain bad.  Strange off taste that I assume was some sort of dried fish.  The beef that came on the soup looked, tasted and felt like low quality jerky.  The two best things by far were the pork bun and sesame pancake sandwich.  The pork bun was huge and contained a lot or roast pork, however the pork had a lot of fat and was a bit chewy.  The sesame pancake sandwich with roast pork had potential to be great.  It reminds me of a bhan mi, with different bread.  That said the vegetables needed more vinegar, and the whole sandwich needed some sort of sauce or condiment to take it to the next level.  A good shot of siracha helped alot.  \"ultimately but for the sesame pancake sandwich I would give one star.", "author": "Thomas N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-29", "description": "great dumplings way better than duckys and dumplings in nj", "author": "Eric L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-12", "description": "this place is unreal. looks weird, but the dumps are incredible. not to mention you can get 6 of them for about $2. definitely worth a visit. just point at the glass box on the counter and take whatever is ready", "author": "Matthew M."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}