{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-27", "description": "Unassuming hole in the wall place. No Air conditioning, not clean with dirty and some what stickey tables and lack of a wash room on the premises an, only seats 8 people, main focus is to sell uncooked dumplings, and cash only. Only reason for dropping by was yelp reviews and a friend's mention of the place.\n\nI ordered Chicken Dumplings with Noodle soup (4.75$) and requested the dumplings not to be added to the soup instead served on the side.\n\nFood served hot. the resturant used egg noodles and the soup was mild in flavouring and was low on seasoning. The soup had two florets of bokchoy a few slivers of carrots and lots of Napa cabbage cabbage.\n\nThe dumplings however seemed full of flavour due to excess of MSG. The filling was ginger cabbage, shreaded napa cabbage and chicken.\n\n\nAlso  part of the napa cabage was dirty and was not washed properly.\n\nLeft the place after a few bites. This place can be a health Hazard. \n\nSCORE\n\nFlavour: 1\nPresentation: 2\nAuthenticity: 1\nPortions: 4\nCleanliness: 0\nSpeed of Service: 2\nValue for Money: 0", "author": "Umer A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-16", "description": "Probably the worst dumplings I've ever had in my lifetime. I've been eating dumplings since forever and I know what authentic dumplings taste like. This place resembles a poor version  of how dumplings are made and the taste is gross. Sure they charge $2.50 for 5 pieces, but at least make it taste good! I regret coming here and now my stomach will pay for it. Do yourself a favor and keep walking. Skip this place. You have been warned.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "Went here for lunch one afternoon at the recommendation of a friend. Ordered the chicken dumplings (boiled), a hot and sour soup, and a cup of tea, all for about $8. The dumplings were quite tasty, although the soup was a bit too sour for me. (What can I say? I'm a wimp.) I would definitely go back!", "author": "Laura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "Soooooo good for the price! This place may appear to be a little while in the whole but the food is great for the price. I'm a student and this area can be a little pricey to buy good lunch at a fare price. This place offers exactly what I need. Low cost with good quality. No $1 slice of pizza or Micky dees for me. I will come here instead. I bought lunch for two and it only came up to $9.75...wow!! I couldn't believe it. The line is always long here so give yourself a good amount of time so you can enjoy it", "author": "Jasmin O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-17", "description": "Straight to the points, tasty, hot, and inexpensive meal. You can request a larger order (100 dumplings for $35) with two days notice.\n\nGood:\n-Fried Pork Dumplings\n-An order of 10 cost $3.50 (very filling)\n-Orders come out within a few minutes of ordering\n-Great for the lunch time rush\n\nBad:\n-Cash only\n-Language barrier can be frustrating if you are doing more than just ordering from the menu", "author": "Daniel J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-24", "description": "We came back here to remove one star as they refuse to serve free NYC water with a meal.\n\nThey want you to BUY water.\nThere were three of us.\nOne bought a soda.\nOne wanted water.\nOne did not want a beverage.", "author": "Raymond N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "ok people this is not the best chinese food but it's called golden fried DUMPLING for a reason. Just order the dumplings!!!! they are sooo cheap and so good. you can even buy them frozen and cook them yourself. stop complaining about the other food. their specialty is obviously just dumplings! let's not get carried away here.\n\nand yes, it's a small storefront so get it to go!!! jeez", "author": "Emily A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "Fantastic hole in the wall and relatively authentic Chinese food in Downtown Brooklyn.  It is a much better alternative to the bulletproof Chinese spots that litter the landscape. For the uninitiated, bulletproof Chinese spots are fast food Chinese takeout restaurants with bulletproof glass in between the customer and the restaurant staff.  The menus are always very Americanized and greasy.\n\nThis is no such place.  The fried dumplings can get a bit crunchy if they have been left out too long.  They cook them, then place them in plastic containers under a heat source to stay warm.  I recommend the steamed dumplings, especially the chicken or the shrimp.  They also have lo mein and a fantastic spicy beef and vegetable soup which will give life to all eaters during the winter.  The inside of the restaurant is cramped and old looking.  Its not dirty, but its not an ideal sit down spot.  However outside the city recently constructed a wooden patio next to the curb with benches and small picnic tables.  Its a perfect spot to grub on your dumplings or noodles.  GFD is worth a try for cheap, quick and delicious eats in downtown BK.", "author": "Drex H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "Very affordable place for good and cheap Chinese food. Dumplings here are the best and sesame pancake with fillings are also good. Fried rice and noodles are a bit mediocre. Good for a quick meal and snacks. They also sell cheap frozen dumplings for very low price. I live next to it and come very often during the weekend. Attention though, at night times, they often run out of options so come early. Very nice folks!", "author": "Shen Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "So I came here on a Friday for a quick lunch and I wanted to check it out since I've never been here. First, the place is pretty small and tight. It's also really hot inside. However, there is a seating area right outside the joint. \n\nI ordered a small order of fried dumplings, that comes with 5, for $2.00 and noodles with peanut sauce for $3.75.\n\nI thought that the fried dumplings would be the fried dumplings that you find at other dumpling places, but to my disappointment they were very different and the filling came right out after taking a bite. I did not enjoy the fried dumplings at all. So, maybe I should try the boiled ones instead next time. \n\nThe peanut sauce noodles would have been enjoyable if only the peanut sauce was  not so diluted and watered down. I am paying for noodles with peanut sauce, so I would think that the sauce would actually be there. But, there was very little sauce, if anything it was a spoonful of watered down peanut sauce that almost had no flavor.\n\nMaybe I had a bad experience the day I went, but I would not come back again unless I want to get a quick and cheap lunch.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-02", "description": "This is a quick spot for a cheap lunch. \n\nIt's a hole in the wall if you sneeze you will walk right by it.\n\nSeriously.\n\nI had the boiled shrimp dumplings, they were tender and  seasoned a definite must have if you visit. I wanted more, but the soup was bland and lacked content and character..meat, tofu, noodles.. wth...\n\nThe setting is totally dull, dingy, dimly lit, and generic.....a true dive. My food was served on Styrofoam plates, which maybe nostalgic for a quick bite, but seriously I'd rather eat at my cubicle back at the office.\n\nThis place is not the second coming , it's not great, it's  just okay, but nothing spectacular. The food is cheap and in this city where almost everything is extremely over priced...cheap has its appeal... I get that.\n\nOh and there's wonderful seating provided by the city located right outside the restaurant.\n\nGo two blocks over to J Street take the F train to the Lower East Side of Manhattan and buy into to some ambience....no seriously get some chopsticks, sit down and relax, but if you only have an hour and you have to get back to the office to answer emails then this is the spot.", "author": "Letty C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "I've been to Golden Fried Dumpling quite a few  times since my last review. The owners/chefs of Golden Fried Dumpling have been slowly adding a few more items to their menu. On my most recent visit, I saw they had vegetarian dumplings (comes in pan-fried, steamed, and frozen) which I found interest in so I ordered it.\n\nThe dumplings took a little longer than usual since they were pan-frying it after I ordered it.  I ordered the fried vegetarian dumplings which were 8  for $2.75-$4.00 (I don't remember the exact amount), but they were definitely and slightly more expensive than their other dumplings.\n\nThe dumplings looked amazing. Beautiful, golden brown crust on the bottom. The dumpling tasted great even though it was a vegetarian dumpling. The filling consisted of: cabbage, carrot, vermicelli, and I believe there was celery. I felt the skin of the dumpling was a little too thick and wished it was a little thinner. I really enjoyed the dumplings -- they were a truly savory bundle of vegetable goodness! It was definitely one of the best vegetarian dumplings I've ever had.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "So cheap and so delicious. \n\nI wish it was opened near where I lived. \n\nI can eat this everyday.", "author": "Ji P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-13", "description": "I dig any place with large portions for cheap. We ordered a bevy of delicious things which we split between us at a table outside (there's no AC indoors!). There's also a nice sitting area across the sidewalk if the tables are occupied. All in all, I had a good experience here. The food was cheap and exactly what I needed. (This is also a great spot for dogspotting.)", "author": "D B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-13", "description": "Quality of the dumplings depends on the day and time. Ok place for the price.", "author": "Steve L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-29", "description": "We came here after donating blood nearby,  Yelp reviews made us think this was like East Broadway, Chinatown dumplings quality!  Sadly, it was nothing like it.  The service is minimal, and the food came quick.  The \"restaurant\" is small and dingy and very hot.  Luckily, there are city benches right in front that anyone can use to sit and eat.  \n\nWe ordered dumpling, both steamed and fried, and the sa cha beef noodles.  The fried dumplings were mostly skin and not enough filling.  The steamed dumplings had more fillings but not enough taste.  The noodles were bland and beef minimal.  Overall, this is a cheap spot for a quick eat in this area, but if this area wasn't so expensive, this type of dumpling quality would never survive.", "author": "Leila L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-12", "description": "The lady who takes the orders scares me. They shout a lot. They all mean business. And don't you dare forget your order number. But boy, do I respect them and their dumpling-making skills. \n\nThis little spot right on Duffield can easily be missed. It's way too small for the amount of customers that come during lunchtime. But the food is always worth it. I've seen various prices from older reviews (costs obv change with time). But to-date, the dumplings are as follows:\n-Chive \u0026 Pork = $1.25 for (5)\n-Sesame Pancake (plain) = $1.00\n-Pork Wonton Soup small/large = $2.00/$3.50\n\nI've never been disappointed. The food here is cheapppp and really delicious. My dumplings are always fried/steamed (depending on my mood) to perfection. It's piping hot and even withstands the 10 minute walk back to work. I wish they delivered but you can't have everything in life, right?", "author": "Katie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "Cheap\nGood selection \nCall ahead \n\nThis spot is known for its dumplings but try out there sesame pancakes, fried rice (they are definitely not your corner store Chinese fried rice), lo mein, and soup. Mix it up, you can get 2 to 3 items for less than $10", "author": "Syed B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-18", "description": "Super cheap dumplings.. nowhere in NYC could beat the price. The quality was just average. It was oily- that's fine. But the flour skin was too thick and meat portion was small.", "author": "You Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-06", "description": "Legit mom and pop dumpling spot smack in the middle of nowhere. Chinatown prices. In addition to fried and steamed regular dumplings, they also have big roast pork buns and little juicy buns. Everything you can buy fully cooked to consume immediately or stock-up frozen styles for easy dinners at home. \n\nFlavor and texture are not groundbreaking but considering the price, it's pretty good.\n\nThere are maybe 5 tables you can eat at but the decor is nothing to write home about.", "author": "Michelle Y."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}