{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-29", "description": "A hidden gem in downtown Brooklyn. I discovered this while going to college . It really hidden !! This has to be the fastest take away spot ever. Dumplings are ready as soon as you order , they are always hot as well .  As a college student it didn't hurt my pocket either . Dumplings are like max $3.50 for large order which contains 10 dumplings!! It's a any other corner Chinese food spot . Nothing fancy or special about it but the food is good . Also looks  clean and hygienic .\n\nAmbience 5/10\nWiFi- Not Sure \nParking - Good Luck \nSeating - Indoor and Outdoor \nService - 10/10", "author": "Sajal B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "Coming off a long flight from Europe, I was at my rope's end, barely made the transfer at Reykjavik.  Had the most harrowing day in Paris right before and barely made that flight from CDG.  If you've flown WOW Air before you know that it's not so WOW when it comes to their food.  I decided to not eat and haven't eaten a peanut in almost 24 hours.  I get into Newark in the dark, hailing an uber and collapsed at my friend's house.  She took pity on me and boiled me some dumplings that her brother gave her.  \n\nFrom that moment on, I was never quite the same.  \n\nJuicy.  Tasty.  Succulent.  Little pockets of pork deliciousness wrapped in bundles of flour delight.  I ate like 20 and passed out.  Just to awaken the next morning and eat 20 more.  \n\nAfter leaving I would sometimes think of those dumplings.  I couldn't bear to tell my parents about them in case they get jealous that I like these more than their homemade ones.  So I kept it to myself and bid my time until I was reunited with these once again at that fateful house in NJ, warm dumplings, good friend.  What could be better?\n\nFriendsgiving evening, the mysterious brother appears and tells me that these dumplings are from close his building in Brooklyn.  Where?  As it turns out, they are even closer to where I usually stay!  Just a 4 minute walk.  We are all neighbors.  WHAT?  If that's not fate, I don't know what is.  Now, there's a whole bag of these frozen babies hanging out in a freezer in Brooklyn.  In this cold city, it's a little less cold when you can boil a bowl and enjoy these at home because after all, home is where the heart and dumplings are at.", "author": "Lin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "From the outside, Golden Fried Dumpling has the look and feel of a place that sells more crab rangoon than it does for actual dumplings. Rest assured though, this place is the real deal. They serve an array of traditional dumplings, both steamed / fried / and even frozen, and with various fillings. Even the name in Chinese (黃金鍋貼) is a pretty accurate translation for the English version, which is rather uncommon in these parts.\n\nThe fried dumplings (鍋貼) are as crispy as they are porky. The skin is a bit thicker than what I tend to prefer, but I know many folks who would appreciate the heartier skin. At $2 for five, they're not exactly an awesome deal, but know many Chinese American spots serve up the same for 3x that amount at far worse quality.\n\nThey also serve a few other items not on the beef lo mein section of the menu: peanut noodles (花生拌面), sesame pancake (芝麻大餅), steamed buns (包子), and various fried noodles / fried rice (炒麵炒飯). They all practically have their own sections. What's not on the menu: General Tso's, sesame chicken, or poo poo platter. That's saying a lot.\n\nLet's not get it twisted though: I'm not saying these are the greatest dumplings in the world. They'd be average in Chinatown or any other Chinese enclave, but they're a god send for this part of the borough. If I lived near the mega buildings of downtown BK, I'd love an option like this to keep my stomach and wallet full. \n\nThe ladies who work here are friendly and make the dumplings in house every day. I appreciate that kind of homemade mentality and for that, I give it a solid 4 stars.", "author": "Jando S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-31", "description": "This is a hole-in-the-wall in the Jay Street Metrotech Center area that specializes in cheap dumplings. A lot of people mention how cheap this place is. It is 5 dumplings for $2.50 or 10 for $3.75. Yes, that is fairly cheap for food in this area, especially for the office workers. However, I am used to the cheap Chinatown dumpling spots where you can get 5 for $1.25 or $1.50. \n\nFurthermore, you can easily find better dumplings at the Chinatown places. The ones here were relatively fresh and juicy and good quality overall. However, they are noticeably smaller both in overall size and meat amount when compared to similar places. \n\nI also had a sesame pancake as well. Unfortunately, it was old, hard, bland and rubbery. They microwaved it, which makes me wonder how old it actually was.", "author": "Tyler L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-27", "description": "Their star item on the menu is their steam dumplings.\n\nDon't get the noodle dishes, don't get their rice dishes, don't get any soup. Dumplings only.\n\nThe establish looks really run down, I had seen several reviews of cockroaches in their food. Thankfully, none in my meal!!!\n\nTried their chicken fried rice, hot and soup soup, chive pork dumplings and cabbage pork dumpling.\n\nFried rice was... meh. A little wet than I would have liked, and really minimal ingredients. Hot and sour soup was very dark and very salty. Packed full of tofu and eggs, though.\n\nCabbage dumplings were good. Thin skins, lots of meat. The best was really the chive dumplings. Super flavorful with the chive and very aromatic.", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "This dumpling spot is a go to spot when you want a nice cheap tasty lunch. I'm so happy that it still is here in this area because everything that is affordable in this area has closed its doors and become luxury real estate or an overpriced restaurant. \nNote: This is a no frills spot for lunch. If you want pomp and circumstance go elsewhere and pay way more! \nI went here on a Wednesday for lunch and even though the prices have gone up on the pork and chive dumplings significantly since my last visit, it's still a steal! I got the small order (5) of pork and chive dumplings and a small order (3) of fried pork buns. I paid less than $5! I was full in a healthy way after eating not in a bloated stomach or can barely breath way. Both were so good and it made me think why the heck don't I come here more often?! Then I remembered it's because I don't want to look like a pork bun so I need to visit sparingly! They also have typical Chinese restaurant options like fried rice and options like soup dumplings or scallion pancake. You can also get dumplings frozen for an event your having at home. If you get there at the right time you can watch them make the dumplings which is amazing to me! It inspires you to want to do it yourself...but then laziness sets in and you decide your life will be better off leaving it to the experts. Also, if we all start making our own dumplings this place will close down!! \nOverall, I'll definitely be back and I'm so happy I was told about this gem of a place!", "author": "Kia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "Quick and cheap bite if you're around Downtown Brooklyn. The dumplings taste so good. It has that \"homemade\" taste to it. Whether they're fried, boiled, pork, or chicken, I'll always have a craving for these. Pair it with soy sauce, sriracha, and vinegar, then you have heaven in your mouth. There's a fair amount of seating inside and when the weather gets warmer, the city usually puts a seating area right in front of the store.", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-23", "description": "Real good food for the price. Friendly staff and quick service. It's cash only but the prices are low so you can scrounge up some change and get a tasty meal. I recommend the chicken and cabbage fried dumplings and fried pork buns.", "author": "Rita W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-01", "description": "I've tried Lee's Villa, Hang Seng, Yummy Tacos, Yaso Tangbao and this place! After living here for 2 years, I've never stopped by when I walked towards City Point.\n\nBut this place is great.  Hard working locals providing great service and food. I ordered shrimp fried rice and spicy beef noodles $5.50 each.  The shrimp size was twice as big as Yaso.  And the beef portions was twice as much as Yaso. \n\nOn the outside and inside, it doesn't look fancy relative to Yaso with trendy music and wooden furnishings. But don't let that fool you! \n\nGreat food is great food nevertheless. All that fancy furnishing from nearby establishments is passed on to the customer. However, this place is low key and minimal aesthetics. \n\nCome here for great food and prices.", "author": "Jolly H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-10", "description": "Pretty cheap for the area, but really variable quality. At its best, it's not as good as a good dumpling place in Chinatown, but it's passable. At its worst, the fried dumplings are so chewy it's as if they're trying to produce the texture of a bagel.\n\nThe boiled dumplings are less variable and aren't inedible when they're bad, so I'd recommend those if you're going to eat here, but what I'd really recommend if you live in the area is to pick up frozen dumplings from a place in Chinatown (or Flushing) and just boil 'em yourself.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-18", "description": "Gross, ordered fried pork dumplings and an order of pork soup buns. They were taken out of a pile and not even hot or fresh, dumplings were old and stale.", "author": "Mary O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-09", "description": "Well priced but the dumpling bottom isn't crispy like the ones in the pictures.  Also the dumpling isn't very fresh and the filling isn't very meaty either.\n\nAlso the owner was fighting with the cook who's probably her husband.  I think they were yelling obscenities at each other.   A bit embarrassing since I'm also Chinese and we definitely don't talk each other in that manner.\n\nThe sesame pancake is also disgusting unfortunately.  These things are hard to screw up but they manage to do that also.\n\n2 stars for the good price", "author": "John C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "I was very unimpressed by this place. I got an order of 10 fried chive and pork dumplings, 10 steamed cabbage and pork dumplings, 3 deep-fried pork buns, and a beef pancake. All this came out to be $11 including tax ($3.50 for the dumplings, $1.50 for the buns, and $2.50 for the pancake) which is super cheap, but the quality was just not good. The skin for the fried dumplings was way too thick and hard, and it didn't taste fresh. The steamed dumplings were a lot better, but neither had much flavor. The deep-fried pork buns had a really hard skin too, and the meat didn't have much flavor either. The food wasn't fresh. The beef pancake was the redeeming quality, but they skimped on the meat. I also didn't really like the pickled vegetables in the pancake. The pancake itself was chewy though a bit hard as well. I would definitely go to either Manhattan or Brooklyn's Chinatown for dumplings instead!", "author": "Andrea W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-16", "description": "I don't know how I feel about reviewing this place. First time there, I don't even know why I'm giving them 3 stars... I'll make it like storytelling.\n\nIt was a windy and unexpected rainy night in NYC. I was coming home from work and I was desperately hungry without knowing what I was in the mood for. I got off the train and started walking towards Flatbush ave ext... As I was walking thru the heart of Downtown Brooklyn, I looked to my right and saw their sign. I entered and everything looked gross, dirty and creepy, but I had to admit that they were the cheapest and most mouthwatering dumplings I ever had. I went for the vegetable dumplings. And I got the pork ones for my husband.\n\nI felt sad as I was waiting for my order to go, the cashier/waiter/manager/cook she was all in one... wasn't friendly and hardly spoke. The time was running so slow and my order seemed to never be ready. I kept looking around and taking pics of all the bad things around. Finally, a kitchen guy appeared and started cooking and I got my bag. I couldn't wait to get home, I was hungry, but I am a picky eater and since I already saw so much I thought I wasn't going to eat anything at all...\n\nWhen I opened the bag I found I was in front of the BEST veggie dumplings ever. I knew I took so many pictures of the bad conditions and nastiness of the place, but then I realized everyone needs parasites in their lives.\n\nI would have this dumplings again, but probably I will order a delivery... What you don't see doesn't bother you.", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-28", "description": "They pre package their fried dumplings so they aren't even fresh or crispy, it's just extremely soggy!! They are extremely cheap on the dumpling and hot sauces when u order to go. I had come here to buy 2 party size dumpling which consisted of 10 total orders and the lady gave me 3 of the small dumpling sauces!! Only 3!! And when I asked the lady for more she wanted to charge me for them. Her reason was because she has to pay for the 2 foil pans... but then again I saved her 10 take out boxes!! I didn't understand her reasoning but it was a terrible experience!", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-14", "description": "*******WARNING********** WARNING ******WARNING*******\n!!ZERO RATINGS SHOULD EXIST!!\n\nToday on August 14, 2017 at 2:20 pm I walk into this \"establishment\" and purchased 10 of their fried PORK AND CHIVE dumplings. I arrive at my desk as i only work across the street. My third dumpling in, i bit half and something hard drops out from my mouth on my desk. I found it extremely odd but hoped it was a caper or some sort of seasoning but that was my indenial speaking for what it actually was.............THE HEAD OF AN INSECT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! ANTENNAS STILL IN  TACT BOTH EYES I NEARLY FELL OUT MY CHAIR.\nI flew over back to the \"restaurant\" as calmly as my emotions allowed me i showed the two woman and the man working there i said what is this!!!!!! without much hesitation one of the lady pick it up shows the other man working there and without hesitation walks over to the register and gives me my money back (AS IF THIS IS NORMAL OR HAPPENS ALL THE TIME?????)\n\n\nIDK HOW THEY HAVE A SANITARY RATING OF AN \"A\" IN THE WINDOW ITS BOGUS \nTHIS IS AN UNFORTUNATE STORY OF HOW EVEN WITH AN \"A\" RATING YOU GET BUGS IN YOUR DUMPLINGS.\n\nEAT HERE AT YOUR OWN RISK", "author": "Janay M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-27", "description": "Great dumpling place if you do not want to venture outside of Brooklyn, pricing cannot be beat. You can get ten friend pork dumplings and be full for $3.50! The place is really small, only a couple of tables, so take out is always an option.", "author": "Rafaella A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "The Steamed Pork Buns are okay but the Lo Mein and Fried Rice are awesome. I would recommend if you order to wait outside because the place and get greasy and the smell can stay with you for a while after you leave. But don't worry they is a nice seating area outside.", "author": "Erlton M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "Solid cheapo dumpling spot. It's not super fancy but really satisfying. Yeah the place is a little dirty but I would hope you are not walking around immuno suppressed so much so that you couldn't be a little adventurous in where you eat.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-05", "description": "This is what Yelp is for. That hole in the wall, cash only, cheap, but still not fast food and yet decently delicious and SMACK in the middle of Dumbo. Whoa, this seriously survived all the high rises popping up around it and hasn't changed ONE iota. \n\nCheap dumplings, I mean cheap and still great tasting food. Really the ambiance is crap and seriously just grab the food and go, but really who cares if you have to eat there. They provide a seat and utensils and really in the end you just saved time from cooking and a whole boat load of money.\n\nThat $30 entree you had for dinner the other night? Well consider that you could have gotten about 100 dumplings instead that would have lasted you a week. Oh dang.", "author": "Joseph L."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}