{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-13", "description": "The service was quick and easy, but the dumpling skin has the texture of rubber but the filling was alright. Definitely not as flavorful as Vanessa Dumpling or Prosperity Dumpling. I also got the spicy beef noodles which was seasoned perfectly. Another downfall was the sesame beef pancakes which were too chewy (the pancake is supposed to be crisp on the outside and soft on the inside) and not seasoned properly. Given where I live in Brooklyn, dumplings are hard to find so if I have no standards that day, I might come back.", "author": "Kaori S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-18", "description": "The dumplings here were barely edible. When I ordered then, they were already packaged in a container. They were fried, and then steaming for who knows how long.\n\nWhen served to me, they were rubbery and the filling was spilling out. The filling also was bland.", "author": "Darwin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-28", "description": "Delicious!  This is a hidden gem, but well worth the trek or quest to get to it.  I rode my bike here before running some errands downtown, and I thoroughly enjoyed my lunch spread.\n\nI was the only customer in the shop, and the older woman there was extremely sweet and welcoming.  I had the dumplings, a pancake and some wonton soup.  The dumplings were especially delicious!  \n\nThe prices are excellent as well.  I just wish this place was closer to either my home or my work.  For now, I'll trek out from time to time.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "I picked this up to eat in my hotel room (just up the block) while on wprk travel. I was a bit hesitant with some of the other reviews but thought overall it was really the food \"experience\" I was looking for. I am SO GLAD I took the leap! The dumpling (which do have a thicker wrapper than I'm used to) were phenomenal. With those I had some of the best fried rice I've had quite sometime. Their hot \u0026 Sour soup was my final purchase. The soup is good and tasty, but obviously not the strong suit of their menu. If you're in the area, I highly recommend. During lunch they have bistro tables and such out front which make an enjoyable al fresco experience.", "author": "Jason B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-27", "description": "Golden Fried Dumpling sits on quiet Duffield - I've walked by it a million times but was never hungry enough to stop and order. But after several recommendations from friends, I had to go and try it out. \n\nTL;DR - The prices are cheap, the flavors are good. The boiled dumplings are the way to go and they tend to be small. \n\nGolden Fried Dumpling really specializes in shui jiao - thinner skinned, *boiled* dumplings. These dumplings tend to \"shrink,\"  pulling the skins closer to their meaty centers. They aren't as juicy. Golden Dumpling also chooses not to fill the dumplings to capacity, leaving lots of air pockets of wasted umami potential. Each dumpling can be eaten in a single bite. They are served with a small container of soy based dipping sauce, which amps up the flavor. Golden Fried Dumpling uses the same shui jiao dumplings to pan fry, but as described below, aren't as satisfying and tend to be greasy.\n\nProsperity focuses on guo tie/wo tiep, pan fried, thick skin dumplings that fill with the meaty juices of the fillings as they cook. Some people call them potstickers. The dough is more toothsome, and can be crispy on one side. They usually take me two bites per dumpling and I feel that they have more meat. Wo tiep is what I make at home and I personally find them more satisfying.\n\nSo while you still get a lot of food for $5, if you're a Chinatown regular this place may not be worth it. Get the boiled instead of the fried and save yourself the oily mess that will come your way. I have yet to try the noodle soups, but based on the quality of the dumplings, they're probably solid and cheap. \n\nThe location is a bit dingy, with sticky floors and awkward table layout. But food is served quick and its perfect for a quick 20 minute lunch run.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-11", "description": "Fool me once, shame on you. Fool me twice, shame on me. I gave them a try, twice. I'll say if you care about how much you spend and not what the food tastes like in your mouth, then they're the inexpensive place to go.\n\n1. They had a tub of meat ready to be used for the dumplings and buns. I went on a 90 degree, chance of thunderstorm weather day, with heavy humidity. The meat was sitting there for a good 10 minutes, at least for the time that I was there. I went in to order, went out to get something else, came back and was still sitting there untouched. Who knows how long it's been sitting there before and after I left. Remind you that when they do start to use it, they might be doing it for 30 minutes minimum, but at least an hour to even get to the whole tub. 1 hour in 90 degree with humidity is definite grounds for bacteria growth unless they wrap everything inside the walk in fridge.\n\n2. Everything fried is pre-fired and stored - fried anything there is soggy because they pre-fried it then left in a steamer/heater/container (fried buns right by the entrance/counter - you see all the steam water in the containers and in the steamer/heater). They're supposed to be crispy bottom. Buns are supposed to be dry, not eating wet bread. Fried pork \u0026 chives dumplings - left in the plastic see through containers, again, filled with steam water. They were all soggy. Also, each dumpling had like 1 slither of chive, it was all pork.\n\n3. Chicken corn soup - omgosh, this was a joke, it had nibbles and scraps of chicken in there, like the size of a sesame or corn. Biggest piece was corn size.  I brought it back to show them there's no chicken in there and they said there is. I pointed it out to them, scooped it around to show them, they laughed and said a lot in Fujianese. They came back out with the same container, they put in 6 bits of chicken meat (not slices, pieces, nor chunks, but size of a nickel).\n\n4. Noodles with meat sauce - sigh, it had 1 table spoon of meat sauce. I'll give them that the meat sauce was tasty. However, this authentic dish would normally be covered with meat sauce on top like the size of a fried egg or two, maybe even the size of an omelette. At the bottom of the container, was filled with water. I had a noodle with meat sauce soup instead. I poured out 4 oz of water, yes I measured it, it was that bad.\n\n5. I ordered the hot \u0026 sour soup and this was the only normal item.\n\nThat day 1 of trying their food, I did have upset stomach with a lot of gas for the whole day until night time. This is from lunch time, however, to be fair I did have a snack of something else before them, so I can't say 100% it was their food I had a problem with.", "author": "Pui C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-31", "description": "The inside is pretty old but I don't really care since its considerably cheap Chinese food.\n\nWell priced items and they obviously specialize in Chinese dumplings. Was disappointed with the fried ones cos the skin was too hard. That's because the ones we had were pre fried awhile back and left to cool and we ordered it was warmed up that's why the skins hard, if done fresh in sure it would've been better.\n\nThe cooked/broiled dumplings were good that's why I think they still deserve the 3 stars.\n\nHad the sesame paste noodle and that was pretty good too with crunchy fresh bean sprout.", "author": "Jive O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Cheap and good. Not like the greatest place in the entire world but for the price I have no complaints. Got the pan fried veggie dumplings and veggie lo mein. Dumplings were great but really doughy. Lo mein was good but paler than your typical lo mein. The flavors were great in both. I'll return because my schools near by and you can't beat the price.", "author": "Saya A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-10", "description": "Darn this place! This is what \"they\" call a \"hole-in-the-wall\" when it comes to hole-in-the-wall restaurants. Seriously, this place is about the size of my living room/dining room, but serving food, with about five tables and literally NO place to wait for your order if you don't like standing outside. Still, their dumplings are bloody cheap, and you get them bloody fast. With the boiled/steamed version, however, just make sure they're actually steamed and cooked through: they aren't always. But if you're hungry and hell, just paid $5 for a filling lunch, do you really care?\n\nI'm giving this place 3 stars because should they make a mistake with your order, it's your fault. Or, let's say, short you on your change. Not very nice. I know - times is tough and they probably hear too many times that they didn't give you proper change. But having worked retail, I learned to (a) not put the money received into the slot until I made the change; and (b) actually look at it and hold up the money received so a mutha wouldn't say they gave me [Amount] when it was actually [not even close]. My friend had to threaten to call the poh-poh just to get them to admit they shorted her double-digit change. One shouldn't have to call the cops just to get one's food, but if it works (it did) then, hey.... \n\nAnyway, cheap lunch choice in the overpriced MetroTech area. J", "author": "Hopala C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "This place is awesome.  We stopped here for lunch and got Vegetable Lo Mein, Boiled Pork and Chive Dumplings and Juicy Buns.  It cost $8! For all 3 dishes!  Besides the amazing prices, it was a whole lot of food to the point of we couldn't eat it all between the 2 of us and had to bring leftovers home.  So here I sit eating leftover Juicy Buns writing this Yelp review.   The Vegetable Lo Mein is a big plateful and it's delicious.  The Boiled Pork and Chive Dumplings were the star of the show and I would totally recommend ordering them.  The Juicy Buns were so-so. I probably wouldn't order them again but that's probably because we got them alongside 2 of the most delicious items on the menu.  \n\nGo to this place!  There's a few small tables to eat in. Or take out, alongside the other 10 people waiting on the sidewalk for their dumplings to be done. You can also buy 50 frozen dumplings for $13 to enjoy Golden Fried Dumpling at home.\n\nI love this place.", "author": "Pamela R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Really tasty, astonishingly cheap, hot food. I got the chive and pork fried dumplings and the chicken mushroom and cabbage fried dumplings. I expected a long line on a Friday at noon-thirty, but there was no line at all, and I was in and out of the place in about three or four minutes. Service was with a smile without any problems with the language barrier. \n\nThere are a few tables inside, but they are kind of unstable, so you're better off just taking it to go. Highly recommended if you're craving dumplings in downtown Brooklyn!", "author": "Christina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-21", "description": "Super fast prepared food for a really cheap price.\nI ordered the black bean paste with meat in noodles and pork dumplings.\nThe noodles were mediocre at best. The amount of paste sauce and meat was too little with an overdose of excess veggie toppings.\nThe dumplings were alright but the pork size was small yet again. \nThis is the type of restaurant where they care more about quantity than quality.", "author": "Patty C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-13", "description": "If you're looking for semi-tasty dumplings sans decent service, seating, etc. this place will suffice. Anything more, go elsewhere.\n\nMy partner and I came here for lunch and were quite disappointed. We ordered 10 dumplings, a sesame pancake, \u0026 the corn soup but the only thing with flavor was the dumplings. The pancake tasted like plain white bread with a few veggies thrown on it and the corn soup had a few kernels with small chunks of tofu floating around it as if it were left over from a previous order. \n\nThe cashier refused to give me more than 1 packet of sauce, claiming that I had to pay for more although she gave the guy in front of me a bunch. I asked for 2 pairs of chopsticks and she abruptly handed me 1 pair. I repeated that there were 2 of us at which point she rolled her eyes and reluctantly gave me another pair. Attitude much? \n\nI didn't expect 5-star service but the basics would've been nice. There are many other dumpling places with good service so needless to say, this was our first and last visit.", "author": "Janai S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-03", "description": "If you enjoy roaches(YES I SAID ROACHES) in your food. Then PLEASE order and eat from here. I'm writing this review about two minutes after spitting out te noodle soup and dumplings I bought less than half an hour ago.  Three bites in I notice there is full adult roach corpse swimming between the noodles in my soup. Absolutely DISGUSTING AND UNACCEPTABLE. I will be going back tomorrow for my refund.", "author": "Keon M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "$3 for 10 handmade transparently-thin pork \u0026 chive steamed dumplings. Man, nostalgic! Plus an order of chicken fried rice with just enough of that take-out greasiness without the queasiness. Modest hole in the wall eatery, pleasantly clean with friendly folk. Cash only - the type of cheap good eat that's dying as Brooklyn gentrifies.", "author": "Yelper N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "Cheap, delicious, and \"sexy\" orders. \n\nGreat steamed dumplings! Their noodles are pretty decent too. \n\nThe owner is friendly and fast. You can't get a better deal elsewhere.", "author": "Daniel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Came here 3 days in a row.  Stayed at a nearby hotel and found a diamond in a rough! They serve pretty amazing dumplings!  Their noodle is pretty good as well.  \nA true hole in a wall of great food with a bargain!", "author": "Chris L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-19", "description": "Maybe I came here on a down day but still you serve me some nasty dumpling. Compare with those in the city, you guys are way way behind. The noodle soup is a disappointment as well. You can't call that chinese food. Seriously I have issue with you guys. You are lucky I was hungry and cold. The soup warm me up and the dumpling kept me going for a few hours.\n\nNothing really special here unless you are some tourist or hungry soul.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "Thank you. Yes, you. \n\nSince it's tucked onto an unassuming block of Duffield I've simply never had any cause to walk down, I never would have discovered Golden Fried Dumpling without your diligence, you gorgeous yelper you.\n\nYou've given me the gift of 4/$1,* delicious dumplings with the platonic ideal of a dumpling dipping sauce. You've given me the gift of absurdly cheap, lightning-quick lunches that I will eat entirely too often. You've given me the gift of a non-relationship with the woman who takes orders, to whom I am literally just a number (\"Thank you, #5!\"). You've given my girlfriend the gift of a fat(ter) boyfriend as a result of between-meal dumpling snacks. And you've given everyone I know the gift of wildly stinky burps that inevitably result from the magical combination of pork and chives.\n\nWe are now best friends; I'll be over later. It'd be nice if you picked up some dumplings before I get there.\n__________\n\n*That's only $.25 a dumpling, for those of you who aren't math majors. I don't even care if you don't like dumplings, everything is worth trying at $.25 apiece.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "I really wanted to like this place. Right across from my apartment, it held the promise of freshly made dumplings from a small, family-run restaurant. I came here twice. First time, I ordered a variety of boiled dumplings. To my surprise, they came in plastic containers fished out of a styrofoam cooler where they were wrapped in towels. The taste was indistinct. A few days later, I came here the second time, thinking that they deserve another chance. There was just another pair of customers sitting at a table. I asked for fried dumplings this time, thinking that they would be pan fried for me while I wait. To my surprise, they were handed to me immediately after I paid. They were inedible, with the skins hard and dry as cardboard, covered in grease. I realize that the food is really cheap here, but that's not an excuse for not giving a damn about the quality.", "author": "Maciej C."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}