{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-25", "description": "Perfect hole in the wall Chinese place!\n\nThey do wonders with their boiled and fried dumplings. The vegetable scallion pancakes were also so delish!!! \n\nLove that everything is served hot, and it doesn't break your wallet by any means. \n\nIt was the perfect bite before the Afropunk concert!!!!", "author": "Maria L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "The seating area is terrible but the price is just extremely cheap, you get what you pay for. I love the steam cooked shrimp dumplings the best but it's probably the most expensive thing on the menu. The chive pork dumplings is great value however I'm not a big fan of chive.", "author": "Micco W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "Great food and.prices.....nvr had anything bad here.....a little hole in the wall place with great food!", "author": "Chris C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-01", "description": "Cold, overly doughy, and just all around disappointing. Glad the prices were reasonable so I didn't waste my money on this place. I will, however, never get that $4 back.", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "Yelp, you NEVER lead me wrong.\n\nThis is exactly what everyone says: an unassuming hole in the wall that serves up super tasty dumplings, cheap and fast. $3, 45 seconds, and you are out the door with potstickers that make you happy.\n\nThe only reason there isn't a line out the door is because they have this down to a science. They pre-pack their buns and 10-packs of dumplings, so when you order, you're holding a bag of hot foody goodness within 20 seconds. I ordered noodles, which took a minute, and as I stood there waiting, 15 people came in, queued up, were served, and left.\n\nThe pork bun was ok, but the filling was kinda rough... a ton of gristle and fat, very little meat, and the meat there was looked disconcerting. Not a lot of flavor, but ok.\n\nThe spicy noodles gave me hiccups! So spicy. Tasty, but holy sodium batman, the saltiness is intense.\n\nBut the potstickers? Glorious and devoured. I didn't need that other stuff anyway.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "GFD is a popular spot for lunch at work. They have a  variety of steamed and fried dumplings, and fried noodles and soup. I prefer the steamed dumplings over the fried ones because the skin is thinner and there is more flavor. \n\nWord of advice - the lady working the front counter has terrible english but is always friendly. She pronounces \"six\" as \"sexy\" when she calls out order numbers. I saw a lot of people looking confused and waiting longer than they needed to for their food because they didn't realize their orders were ready.\n\nI would give this place 4 stars even at double the price. I just wish they took credit cards but I guess being cash only is what keeps their prices low.", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-20", "description": "Super cheap, super quick, super salty.  Dramatically salty.  Absurdly salty.  Profoundly salty.", "author": "Alec G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "Great food. Little place lots of traffic. Be prepared for the girl to yell out the numbers in your order. Lol. Come for the food not the ambiance.", "author": "William T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-30", "description": "This place is downstairs from my office. I eat lunch here about once a week. I always get the same thing, which is the #25 Beef Lo Mein and #1 - 4 Fried Dumplings $5 total. Very clean and inexpensive.\n\nThere is a very nice and very sweet older Chinese lady behind the counter that does not speak too much English. You mess with her you mess with me. Understand! :)\n\nI would also recommend you try the pork buns. Not bad not bad.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "This place is obnoxiously cheap but the food is pretty decent. For ~$4 you can get 10 dumplings and a soda which will even satisfy most dudes. I've tried some of the other stuff and it is definitely not the best quality but it tastes pretty good and fills you up which is all you can really ask for in a place like this. I went to school around the corner and was pretty broke in my final semester but between this and $1 slices at Papa Johns I never went hungry.", "author": "Justin V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "This is one of my favorite dumpling spots. It's located around Metrotech and they can get pretty busy during lunch. It's something like four fried dumplings for $1 or ten boiled ones for $3. They also sell frozen ones, fifty for $13 I believe that you can cook at home. They are a lot better than many that I have had around New York. The skins are fairly skin, but are rarely broken, the mean is good. Personally I like the pork and cabbage dumplings better, but if you are in a hurry you should get the pork and chive dumplings because these are the ones they are cooking in batches constantly. The other options on the menu are just okay and the space is somewhat small and cramped. I guess those things would dock off some stars... but I really like the dumplings. Stick to the dumplings if you know what is good for you.", "author": "Willis H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "Went here tonight since it was the closest restaurant to the hotel, I heard the dumplings were good and cheap so that convinced me to give it a shot.  \n\nAs the other reviews say, the basic pork and chive dumplings were about a quarter each, and the pork buns were 3 for $1.25.  The dumplings were great, the buns were ok but a bit greasy.  A $2 small won ton soup had more small and amazingly light won tons than I could count, but the broth was a bit bland and oily.\n\nI'll probably head back for more of the dumplings, and I'll have to try some of the other items that people are mentioning as well.", "author": "Tom S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-01", "description": "strange to me that if you search for dumpling..one gets nada- wakeup yelp search :)\n\nfor a classic dumpling takeaway house with yummy sesame pancake (only have had the veggie one) Golden Fried Dumpling is it...kind establishment - much like Prosperity Dumpling sans the strange \"outdoor\" kitchen annex they seem to have.. a place to go for lunch/ snack to go.. (not a sit down style dumpling house)", "author": "Sara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-17", "description": "Cheap quick food. 4 Dumplings for one dollar, fried or boiled. Fried ones are a bit greasy. Not sure what quality the meat is but for a dollar you cant ask to many questions. Try the lo mien also. Their sesame pancakes are different and filling.", "author": "Gabriel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-24", "description": "Great place for a quick meal. The pork and Chive dumplings are my favorite. The Sesame pancake is mediocre. Quick service and never packed. Recommended for any dumpling fans out there.", "author": "Travis L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "I just came back from GFD and I am full! Man this place is good! They specialize in dumplings and buns (as well as sesame pancakes and noodles...but they aren't too special). \n\nWhat I like about this joint is that it has fantastic prices for some really good pork buns and dumplings. This is especially a boon for a poor college schmuck like me. I  had the chive and pork fried dumplings, chicken, muschroom and cabbage fried dumplings, roast pork pan fried buns, little juicy buns, roast pork buns, sesame pancake with pork and ginger ale. Total cost  = 8 bucks. It can't get any better than this. Damn, that roast pork bun is huge! Three of those are more than enough to fill you up!! \n\nThe reason I gave it 4 stars (I really want to give it 4.5 starts) is because nothing is perfect in life; the place is small and typical of a chinese fast food joint. It does have a bathroom though (which I wasn't keen to explore). The old lady cashier is a sweet woman who is very polite and her husband (I'm assuming) works hard to make some great chow. \n\nAll in all , it's a great place for some good fast food. I'm definately going back there again.", "author": "Lars Lars P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "This is a \"hole in the wall\" type of place with really cheap dumplings that taste very good when you consider the price. I still think dumplings from a good Chinese restaurant are a better quality and flavor. It's just that the price comparison is borderline unbelievable which is why the majority of these reviews are so high in praise. \n\nTry to avoid the lunch time rush in the summer because the place is very hot and the line can be long. Their soy sauce is good, but I love to heat these up with Sriracha or Tabasco sauce.", "author": "M R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-27", "description": "I've been here a few times, ordering dumplings to go. Usually the dumplings are fine - I wouldn't say great. But the last time I visited, the dumplings I received must have been sitting out for at least a half hour. The box wasn't even warm. I opened the box and saw rubbery, room-temperature dumplings. I asked the cashier when they were cooked and then asked if I could have freshly made dumplings but she didn't understand and only said $1. I haven't been back since.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "This place is a hidden gem.  Amazing hot and sour soup.  Incredible dumplings.  Homemade.  Super fast.  What else can you ask for!", "author": "Jesse C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-14", "description": "The price is right, but the food is wrong. I just struggled through the pork and chive fried dumplings (5 for $1.25). What a mistake. I feel gross. They tasted awful, and they had the texture of wet cardboard. They were also sitting out on the counter in styrofoam containers. I'm pretty sure they were made hours before I ate them. I might be back, but I'll have to be wasted.", "author": "Nolan S."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}