{"aggregateRating": {"reviewCount": 335, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-09", "description": "My coworker brought me here to pick up lunch one day.. Im used to gettin my fried dumplings from 8th ave, the 40 something st one that everybody goes to. So i was kind of excited to hear theres one near here.\n\nI ordered the fried dumplings and took it out to eat. I was disappointed because their fried dumpling was fried and then left there so it pretty much tasted like hard sogged up dumplings. The skin was so thick so there was barely any meat inside. Their hot sauce also did not taste like the regular hot sauce they serve w dumplings. Although it was cheap.. It wasnt good. The other dumpling house i goto on 8th ave usually fries the dumpling right when u order and steams the dumpling right when u order so its fresh. I wont be coming back again.", "author": "Linh L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "This is probably my 5th time here but my 1st review...very small restaurant but huge in flavor. The dumplings are freshly homemade..you can order them fried or boiled. I  prefer fried..the beef noodle soup is really hearty..my favorite is the spicy beef noodle soup..they make pancake sandwiches as well..5 fried dumplings and a large beef noodle soup for a total of $6.25. Wow!.you have to try this place.", "author": "Carolyn C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-06", "description": "Cheap food! $1 for 4 dumplings. Soup for $1.50. Our lunch for 3 people was less than $10!\n\nNot sure if the high rating is due to the prices, but food is ok. It would be a nice place to stop by for a quick bite to eat. \n\nWe ordered at the counter. There are stacks of paper menus that you can grab. Order what you want. Pay. Then find a seat. They'll shout out when your order is ready.\n\nNo thrills kinda place. There wasn't even water or tea. But they do have a fridge stocked with drinks.", "author": "Anne T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "Everything fried that I've ordered from there seems to come with a slick coating of uncooked oil on it, kind of gross. If you get beyond that the mini pork fried buns and the pork and chive dumplings are actually pretty good and at a great value. This is the kind of place you can fill up for under $6 easily. I've also ordered the roast pork sesame pancake and was turned off that the pork was very cold and mostly just the fat. Overall the food is decent and dirt cheap, I'd just much rather go to Chinatown for something a little better.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-01", "description": "The location is a no man land at the moment. And the food does not worth the trip. The dumplings are just like any of those you can find in a corner takeouts. The pan fired buns have funny taste in the meat. I could not even finish what I ordered. Not because I was full. I just could not. The only good thing there are the outdoor tables and chairs. But they look like they are installed by the city not the shop. A big disappointment. :(", "author": "Jimmy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-02", "description": "When you find a spot with 190+ positive reviews you are expecting a good meal.  Imagine my disappointment when I was served THE WORST dumplings Ive ever eaten.  My dumplings came stuck together in a lump. The wrappers were too thick and the filling a tasteless mash.  The hot and sour soup was all corn starch and hot pepper no sour.  There was nothing on the soup bit big lumps of tofu and scrambled egg.  The scallion pancake was an inch thick wedge of flour w/o taste.  Yuck.  Also I had to notice that l the other customers (who were Asian) were served plates where the dumplings were not stuck together, and they were given napkins and chopsticks where as I just got a plate with all my food thrown on top. \nWho gave all these stars tp this joint?  It makes me really suspicious of Yelp", "author": "Lori S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "Walked into this little store to see 2 women making dumplings and a guy sweeping the small eating area... \nOrdered and waited about 10 minutes..... \nWalked 'em 15 minutes home. (still hot!) They were visibly without any tough edges or mushiness to indicate they've sitting around too long... \nDunked one in the soy sauce given me and gingerly took a steaming bite... \nPleasantly surprised! Not too salty... flavor of the meat came out- bits of cabbage visible ... Wrapper dough not overwhelmingly starchy/chewy.\nOne of the Best I've had- outside of the city's Chinatown!\n\nFood - Very Good\nPrice - Dumplings-Awesomely Economical       --------Other stuff-Very good value\nLocation/Decor - Out of the way and Definitely No Frills\n\nKeep in mind; you're going for extremely economical tasty munchies!", "author": "Violet L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-18", "description": "Not the best, but it's close to my school and it's fast. Their wontons are not wontons but fuzhounese wontons ( better than wontons ). The price they have on yelp now is not current , they have up the price but the food is still worth their price.", "author": "Angela J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "Absolutely hidden gem in Brooklyn. It's a simple Chinese place but clean. I really loved their friendly but not too friendly vibe with smiles. \n\nFirst time I went there, I ordered 2 fried dumpling menu and mini buns. Unbelievable price on this quality. Their taste is not over-seasoned but still memorable.\n\nAfter several visits, I found boiled dumplings are much much better than fried ones. Dumpling dough is so moist, lightly \u0026 nicely chewy. The meat inside is perfectly made and cooked. The stickiness between them makes perfect harmony on your tongue. Whatever you order, they will make your culinary mind happy. Buns and noodles and soups are also very recommended.", "author": "KwangHoon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-13", "description": "Good Day Lads!\n\nMy apologies for interrupting your bleak and meaningless lives!!! Do I offend? I am not sorry. Especially if you have never feasted on the doughy chickeny morsels that are made at Golden Fried Dumplinggggggggggggg!\n\nDo not pay any mind that the old kind lady at the cashier just smiles and nods and points to a number. She will take great care of you and will make sure that your belly is full!!! Like a KING! 10 dumplings and a bottle of water for $4. GFD, you will be my secret I will take to the grave.\n\nBEHOLD!!\n\n5 fried chicken dumplings. 10 fingers. 5 minutes. I reigned supreme!", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-22", "description": "If the food wasn't so greasy, we were really seriously going to give this place 5 stars! \n\n16 fried chive \u0026 pork fried dumplings + 3 roast pork buns + 1 small wonton soup + 1 noodles with mashed sesame sauce  = $9.75\n\nThe fried dumplings were seriously tasty but they're too greasy. The skin is brown \u0026 crispy, exactly like the way we like it. The roast pork bun, the wonton soup, \u0026 the noodles with mashed sesame sauce were flavorful. \n\nThe service was good \u0026 friendly. Food came pretty quickly. We came here for a late dinner, around 9pm, \u0026 there were a lot of people came buying a take out. The place is small, with just about 2-3 tables. The place looks pretty clean. \n\nDefinitely worth stopping by especially if you're around the area...", "author": "Mr F G And Mrs M S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "What a find while on a Christmas vacation last year.  Thought I had reviewed it but obviously didn't.  I can't say anything that hasn't been said before.  Go there.  Cheap.  Good.  Filling.  If I lived there I would certainly have them in the freezer like was suggested by another Yelper.", "author": "Bill L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "This place absolutely ROCKS. Their dumplings are a little oily (but pat them down and you're totally fine). It's a little hole in the wall place, but honestly their prices canNOT be beat, their food is delicious (we got the Sesame pancake, which wasn't really worth it, though it was only a dollar, but it was just not to my taste...it was good for a solid piece of dough with sesame seeds on it. We also got the pork fried dumplings which were amazing and I think the last thing was the boiled pork and chive dumpling, which was fantastic as well). If it wasn't the boiled pork dumplings, it was whatever was on the bottom on the menu 3 for $1 or something.\n\nAll in all, 11/10 would ABSOLUTELY travel out of my way if I was craving dumplings. I have yet to find a better place. :)", "author": "Samantha E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-07", "description": "Nothing spectacular but for less than 4 dollars you can get 10 fried dumplings that will easily fill you up. As others mentioned, the dumplings are not particularly authentic, and they are certainly not the best dumplings you will ever have, but the value is clear. FYI this restaurant only accepts cash.", "author": "Dave T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "I found this place when i was craving for dumplings and since it was near my school it was a great spot. Although the place was small, there was enough room for everyone. I ordered the boiled dumplings, the fried dumplings and the sha cha beef noodle soup. I didn't expect the boiled dumplings to taste that good but it was amazing. It even tasted better than the fried ones and ironically the fried ones were really golden. The sha cha beef noodle soup was smaller than i expected but it kept me full. It was pretty good and the beef was fresh however it is pretty spicy so if you can't handle spice don't try it. Overall, a great find.", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-19", "description": "Disgusting - took one bite and couldn't identify the Chicken as chicken inside of the soppy fried dumpling. The sesame pancake was thick and not flavorful -", "author": "Venus W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-25", "description": "Maybe during my college days I would have liked this place, but now that I am older and wiser, I would recommend anyone without a very strong stomach to stay away.  The amount of grease in the food from this place is way too much.\n\nI will say that the steamed pork buns are pretty good, but other than that...you've been forewarned.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "Finally got here! I read reviews months ago about how amazing and cheap their food is. So many people say this place is small, but it really isn't? lol Anyway, I got the steamed shrimp dumplings. Let me first say, the customer service is nice. The time it took the steam dumplings tho??It took a helluva long time. I was the ONLY customer there, and the guy making it took his jolly old time. One guy walked in and out with his food(I guess he got something already made). They taste pretty good though; I don't know many good dumpling places around Brooklyn. I'll come back in the future, but I hope the service isn't as slow as it was that night!", "author": "Ani T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-29", "description": "I'm a huge fan of dumplings so I was excited to try this place. But I'm disappointed with the food that I just ate. \n\nThe dough was hard to bite into and extremely chewy. The outer layer for the fried dumplings had lots of grease on it. The Pork \u0026 Chive filling lacked flavor, as did the Chicken with Cabbage filling. The Boiled Shrimp Dumpling was the best of the 4 dishes that I tried (Boiled Shrimp, Fried Chicken With Cabbage, Boiled Pork \u0026 Chive, Roast Pork Buns).", "author": "Herman G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-21", "description": "Tried the fried and boiled dumplings here. I would avoid the fried ones because they make them in advance and have them pre-packaged already, so by the time you order it, it's probably cold. The boiled dumplings are amazing! They're filled with soup inside. I haven't tried the noodles, but I hope to come back again to try them.", "author": "Tina W."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Golden Fried Dumpling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "192 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rTmcDrFa9v2J7Fqi9i8bcg/ls.jpg", "@type": "Restaurant", "telephone": "+17185222836"}