{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "I remember when this spot was on Christopher St. in the West Village; it was my favorite Thai restaurant in the area and was so sad they closed. Welcome, their move to BK Heights. This atmosphere is so soothing and inviting, and I love their chicken crystal pad Thai and basil chicken dish. Wasn't such a fan of the five-seed chicken dish, which had much less flavor than the delicious basil and chicken crystal. The mushroom-coconut soup is great - totally worth getting on a cold winter day.", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "The first time I ate here I thought it was the worst Thai food I'd ever eaten. Had the mushroom crunch with its vomit inducing sauce and the most oily pad see ew I've ever encountered. I avoided it for years. HOWEVER! In the last month I've eaten there three times and it has been EXCELLENT! The service is always wonderful. I'd highly recommend the stuff tofu, the Thai fried rice and the Thai iced tea. Damn. Best Thai iced tea I've ever had. And they bring it to you in a little wooden box and you can mix everything up yourself. So good. Get that and be happy.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-12", "description": "Worst management ever, lunch service sucks. Delivery person was rude and didn't even wait for me to come down to pick up my food. Won't be calling them again.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "This was probably the best Thai place I have been to. It does not have cliche Thai restaurant vibe. It has a modern decor with French music playing in the background haha. The food was very good and during happy hour buy one drink get the other free. They only get minus point because we weren't told the menu the paper that was used to fold the towel. We were just waiting around till we realized. I would definitely go back!", "author": "Fenn N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "Delightful!\nWas in the mood for Thai food and Pinto came up on my searches. It had just the right amount of stars a girl could ask for, so we headed there to check it out. \n\nWe arrived and decided to look at the outside menu. Initially we were a bit hesitant. Nothing really stood out. Then a patron passed by and said \"phenomenal food. Fresh and one of the best in the area\". \nI said ok then, let's check it out!\n\nLovely, simple decor! It's really the little things that stand out I tell you. We were seated right away and peruse the menu. \n\nApp- crispy veg roll. -- Enjoyed!\nEntree- the fried rice. I had it w/o meat and did all veggies. --- very good and light! I didn't feel stuffed and I enjoyed the veg that came with it(bok choy, mushroom, squad, \u0026 cauliflower). It didn't taste greasy and I was able to take some home for lunch. I added a bit of hot sauce and that gave it the right amount kick. \n\nWaitress and host was inviting and pleasant. will be back!", "author": "Lyn D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-06", "description": "I am not sure why this place has four stars...there was no AC and it was super hot in there. My boyfriend and I ordered a Thai iced tea (it was really good-I like that you can make it to your liking), fried mushrooms (also good) and pad Thai noodles. The noodles were okay. The reason why this place gets two stars is because the service is super slow. The couple next to us complained about their meal and got charged extra for something they didn't order. If you want good Thai food for a decent price, go to Joya.", "author": "Andrea S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "Ordered mushroom crunch and Panang curry. Both were good! Service was a bit off. We waited for our checks for a long time and the waiters didn't come in between to check how we were doing. Nice ambiance. Cozy spot", "author": "Mira R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-31", "description": "Website is way out of date. Last time I ordered takeout, the food was barely edible. Stay away. Expensive dishes, rude folks answer phone, website with misinformation. No thank you.", "author": "Green S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Went here for the first time today and I am so excited about my dining experience that I had to write about it right away! Loved, loved, loved the food! I used to come to this spot when it was a Chinese restaurant called Andy's a couple of years back, and boy, is this an upgrade and a half! The decor is lovely, very calming colors and well spaced out. There was a good amount of seating available, but when I was there on a Saturday afternoon, there weren't many people around (which I liked, personally). \n\nThe service was awesome! Our waitress was so nice and attentive, just very pleasant. We had drinks to start and my mother could not stop raving about how delicious her Rose Sangria Popsicle was! She insisted she would come back for even just that alone. I had the lychee bellini and found it to be very tasty and refreshing. I would definitely come back for the $20 endless drinks brunch specials for that bellini! I think both drinks were around $12, which is pretty standard pricing for New York. \n\nThe food arrived quickly. We ordered calamari ($8) as an appetizer and it was some of the best calamari I've had! Nice and well battered without being too crispy or dry. The sweet chili sauce it came with complimented it perfectly. My mother ordered the crab fried rice in young coconut ($21), which was positively delicious and was a good portion size for the price. I only had a few bites of hers myself, but I would recommend it. I really loved the egg in the fried rice, and thought it was the best execution I've tasted so far. I ordered the pumpkin curry with tofu ($15) and that was the perfect seasonal meal. It was warm and hearty, and I loved every bite. The tenderness of the vegetables was perfect!\n\nThe bill put a bit of a dent in my wallet since I was the one treating, but I wouldn't let that stop me from coming back again after the next paycheck rolls through! Awesome service, amazing food, definitely a spot to check out.", "author": "Shazi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "Such an intimate classy little restaurant, with beautiful tables and seats + cute plants! The servers were so sweet and friendly! If you're getting curry, I recommend getting the wild mushroom \u0026 coconut soup to mix with it cause it's so delicious! \n\nA La Panang ($14)- 3.5/5 I got the medium spicy and it was quite spicy.. had to start taking off my jacket and put my hair up! The spiciness starts to build up after each bite. It's really delicious mixed with coconut soup and less spicy. I wasn't too crazy about the veggies in it, I think it was zucchini and some random vegetables that I don't even know. The shrimp were good though. The brown rice came on the side and was okay, nothing special.\n\nCrab Fried Rice in Young Coconut ($21)- 5/5 This was yummy! So much crab meat and the portion was quite big! They gave a little extra on the side too so my sister shared it with me. A little bit on the pricey side though for this dish. \n\nPinto Iced Tea ($6)- 5/5 This comes with ice cubes, cream, syrup and the tea itself. You pour the tea first, then add the cream! I didn't use any cream because it was seriously delicious the way it was and even before the milk! It was super fun and really good. Although it's very easy to finish and the portion is a bit small and also pricey iced tea. You can smash up the ice and make a slushie, which my server recommended me to do. \n\nCreamy Tom Yum Soup ($8)- 3.5/5 This was sorta of the same Tom Yum soup I had in Thailand but a tad bit more sour. I loved the shrimp though! Portions are quite decent for the soup and they pour it at the table. \n\nWild Mushroom and Coconut Soup ($8) - 4/5 This was good, although still not the flavor I had when I went to Thailand. Really good coconut taste though.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "We came in on a weekday a little before 4pm before seeing a movie at the nearby Court Street movie theater. Since it was before the dinner rush the restaurant had a very quiet and romantic atmosphere. We were seated immediately and told that happy hour would be starting at 4 o'clock. \n\nI ordered a glass of sangria with the popsicle in it. The sangria was delicious but the melting popsicle inside made it ten times better. We glanced over the menu and settled on the Pad Thai. There are several combinations for the Pad Thai including beef, shrimp, and calamari. We both settled on the beef and shrimp which was phenomenal. It was by far the best pad Thai I've ever had! For an appetizer we had the truffle dumplings which were also awesome; however, it seemed to be more of a ravioli than a dumpling but nonetheless it was incredibly delicious. If you're looking for stellar Thai food on Montague Street I highly highly recommend Pinto. \n\nNot only was the food all the way on point but the service was also seamless. We were constantly checked on, water glasses were consistently refilled, and we were always approached with a smile. We left Pinto with no doubt in our minds that we will definitely return.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "My friends and I are die hard Lantern fans but decided to give this place a try in light of Lanterns recent up-charge in the lunch special cost. This place is very cute and spacious. Looks nicer now than it did when it was Andys (former name of restaurant). The servers are super attentive and accommodating. The lunch special here is 9- for an appetizer and a main. Everything I tried was really good! I had the potatoes appetizer it was good but it pales in comparison to the mushrooms or the crispy roll.( See food photos I'm attaching.) The Pad Thai was delicious as were the Hanger steak and the PCU. (I tried some of everything )\n They do not have a full bar. It's mostly wine and I think they have beer.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-22", "description": "The good: veggies seemed fresh, flavor was good\nThe bad: Lunch \"special\" was expensive. I got the shrimp basil and only 3 shrimps were included, and it was ***extremely*** spicy. I normally love spicy food but this seemed on the level of harmful to my stomach lining! I couldn't really enjoy the food with so much spice, either, and now I feel a headache coming on :-/", "author": "Deema A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Green curry is really good here. I ordered take out AND dined in a few days after. The staff are all really attentive and friendly. They took care of my 15 people party for a work celebration. The wait for the food was a bit slow, and we got really hungry, but food was not disappointing. I got the green curry both times for lunch special.  For just $10 I get an app and delicious curry with rice? Yum. The restaurant has a serene decor and reminds me of a modern sleek bar.", "author": "Pinky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Great delivery through caviar experience!\nWe enjoyed a few dinners we got from this guys. It was a lot tastier than the Thai food in our neighborhood. \nI loved my pumpkin curry with organic tofu, basil with chicken, mushrooms appetizer and a tom yum soup. Everything was fresh, timely and delicious. \nUnfortunately caviar stopped delivering to LIC and now we can get Pento :(\nPlease come back to us!", "author": "Kate N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "There is lots on the menu to choose from: Big dishes to small dishes. The prices are reasonable and there was enough seating for a dinner rush. I just wanted to check out the place so I tried the Garlic BokChoy. I found it a bit chewy and wasn't a fan of the vinegar oil used. However the stir-panned garlic was crunchy. The place had higher prices than other area Thai restaurants.\n\nDim lighting  which made it hard to read the menu which wraps around the napkin. The place   was quaint with flowers and wood.  There is a side entrance for wheelchairs where as the front has steps.", "author": "Correy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "I don't have a photo because I started eating while walking towards my desk. It was gone before I knew it!\n\nLong story short, the food was delicious! Very fresh and tasty Thai food. I ordered the panang curry lunch special with the fries (w. special sauce) as my appetizer. The sauce had a spicy aioli vibe, but it wasn't spicy at all. It was the perfect sweet v. savory ratio that I was looking for today! The panang curry was exceptional! I could smell the coconut milk before I opened the container, which made me super happy!\n\nNot sure if it's because I was starving that I enjoyed the food so much, but it doesn't really matter because hungry or not, it was damn good! Can't wait to be back.", "author": "Kenya W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-21", "description": "How upsetting that I ordered my dinner and was charged on my credit card via Pinto's website to then at 10:30PM call and learn that my family's order had never been filled although we were never notified.  We spend $70-$80 a week ordering dinner once a week. Never again. The manager on shift Feb 21 had nothing to say. Can you tell I'm hungry and annoyed?! You lost a customer today.", "author": "Jack J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Very nice Thai spot to come for food. I ordered two things: Pineapple Crabmeat Fried Rice which was literally served in a coconut bowl and Thai Iced Tea.\n\nThe one thing that was very unexpected is that you make your own Thai Iced Tea. Well, with that experience, I now know all the ingredients to making one as they give you the ingredients and you get to pour and stir your own iced tea.\n\nThe fried rice is also really good and filling. It might not be something I'll order again as I'd rather have it served on a plate instead of a coconut. Otherwise, great food, great experience, looking forward to coming back here again.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-20", "description": "Ordered from here via UberEATS while staying in a hotel in downtown BK. I wrote in the notes to be sure to send utensils and napkins. My delivery arrived and guess what NO NAPKINS \u0026 NO UTENSILS . I called and was told that they don't send utensils for take out orders as they don't have such a thing (insert HUH face). How do you offer takeout and not offer plastic ware for the consumer to consume their order?\n\nI ordered the LoMein and seafood spring rolls. I tried to eat with my fingers as I enjoy doing so at Ethiopian restaurants as it's part of the culture and the food is made for such consumption. Well this was Thai and NOT made for finger eating so it was a FAIL. I had to leave my hotel and go on a hunt to a local bodega for plastic utensils. Lesson Learned: Travel with plastic utensils \u0026 try to NOT order from places that don't have any to share.", "author": "Bianka M."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Pinto Restaurant", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "128 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IL20_GuuKAcXfIPattJKog/ls.jpg", "@type": "Restaurant", "telephone": "+19293377732"}