{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "This is now my best Thai Restaurant.   Crab Rangoon is so tasty and well done (CRISPY).  \nThai Basil Lo Mein, spring rolls are also very tasty.  Oh yeah the Lychee Bellini is deliciously bubbly.", "author": "C J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Great spot for lunch with coworkers, specifically because they have a lunch special (appetizer + meal) for $9, not including tax or tips. I got the papaya salad and a tofu pad thai. Both were pretty standard. \n\nThe papaya salad was not the greatest option just because it had an overwhelming fish sauce smell that lingered (and you know that isn't a pretty look for work). Nonetheless, it was refreshing. It had a crisp taste and texture. It came in a small plate portion. \n\nThe pad thai was normal. The noodles weren't too mushy/overcooked and it wasn't overly sweet. The lunch special pad thai was a smaller portion than the regular one (I'm pretty sure I overheard the waitress say that). If I had to describe the portions in handfuls, it would be roughly 2.5 handfuls (I have avg hand-sizes, ones that the media wouldn't make fun of). 2.5 handfuls isn't a lot but enough for lunch.\n\nService was great though. The waitresses were always smiling and were actively nice. \n\n4 stars because I probably wouldn't go here other than for the lunch special. It's easy enough to plan to go to with coworkers but the food was standard.", "author": "Alice Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "Lovely little place for a date night. The service is extremely fast, almost too fast to be true. The food isn't disappointing. The portions are perfect for 1. Although the food could be a little more warm. They also have a limited selection of wines which goes well with the food.  The dessert options are limited. We tried the berry panacotta and it was alright. I sent mine back coz I didn't want it with honey which wasn't mentioned on the menu, so you can decide accordingly. Romantic ambience and very friendly staff.", "author": "Nitiggya P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "came here for lunch + had their lunch special. \ntheir lunch special comes with an app + a main course. i chose mushroom crunch for my app + pcu as my main course. the mushroom crunch was steaming hot + juicy on the inside as the outside was crunchy, lacked some flavor for me but still good. The pcu was yummy + good on flavor. service was really good as they were very attentive filling up my water each time it was running low. would definitely be a place I'd return to.", "author": "Cassie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Excellent Thai food! The restaurant is really charming with natural light and a nice view of the street and potted plants. The service was exceptional. Everyone was very friendly and attentive. My fiancé and I started with the shrimp dumplings and got the Pad Thai with a side of Bok Choy. Everything was delicious, generously portioned, and very reasonably priced.", "author": "Kara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Seriously best thai Ive had in some time! And trust me as a native New Yorker I've tried my fair share. Their lunch special is perfect in price and options. We loved our waitress, she was extremely sweet and attentive! Coming back for sure!", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Was here for opening night with a few friends. This place was great and I definitely plan on coming back.\n\nEverything was fantastic; from the friendly staff to the wonderful food (loved the khao soi and jao bong especially).", "author": "Steven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Came here with a party of 9 people for a small celebration. I'll keep it brief but in summary, we've discovered a hidden gem in the middle of Brooklyn Heights! The food was 5/5, service was 6/5. Prices were also standard thai restaurant pricing (~$11 for pad thai) so that was a pleasant surprise given the expensive neighborhood its in.\n\nDecor - Very modern/refreshed with a spacious atmosphere.\n\nFood - 5*'s here. I'm a big fan of thai food and have had the good and the worst. What separates this restaurant from your traditional thai place is the presentation (order the thai ice tea, or a soup, and you'll see what i mean)\n\nService - 5*'s as well! We had 2 waiters assisting our party, constantly refilling water/drinks and quickly brought out the appetizers and entrees. Very polite and accommodating as well.\n\nPro Tip - Saving the best for last... but this place is BYOB without any bottle fees!", "author": "Hugh J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "I finally got a chance to checked this restaurant out and it was so good. Prices are even better too. I can't believe how reasonable Pinto is.\n\nI liked the ambiance of the restaurant. Great music with a fun and casual feel. \n\nFOOD \u0026 DRINKS:\nFor food, to start we got an order of fried Calamari(who can go wrong with fried food),their calamari was fresh and more that enough for two. In addition we order the Crispy Chicken with Five Seeds and the Hanger Steak.Everything was delicious! The Crispy Chicken were cut into small pieces and it was very tasty. I also had a piece of the Hanger Steak and it was cook to perfection.\n\nThey don't have alcohol, so we have to settle for soft drinks and your regular Thai Ice Tea. So I thought! To my surprise their Thai Ice Tea presentation was amazing(every ingredient came separately), which allow me to mix it to perfection, just a simple great idea. Highly recommended.\n\nThe service here is really efficient and the servers are all friendly. Can't wait to come back!", "author": "George I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "Spicy Basil Lo Mein is so good it's unfair -- 5 Stars for that alone. Noodle texture just perfectly al dente and delicious savory sauce is on point. \n\nHad the chopped chicken / lettuce wrap which was ok, but wasn't blown away. Same for the Chicken with 5 seeds. Can't wait to explore the rest of the menu, as", "author": "Flam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "I've dined at Pinto 4-5 times now and they consistently prepare really delicious Thai food, always served by smiling extremely efficient waitstaff in a very clean, modern and attractive dining room. Highly recommend!!", "author": "Gregory I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "Great gem of a restaurant, conveniently tucked away amidst the bustle of Brooklyn Heights.  The modern decor gets lots of light from large street-facing windows and easily accommodated our party of 12. I could see it being a good place for date nights too.\n\nThe menu has traditional favorites like crab rangoon and pad thai, with an interesting assortment of yummy unexpected dishes like tilapia and hangar steak. There's plenty to choose from, all of which is reasonably priced. Bring your own bottle of wine and enjoy!", "author": "Vincent M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Everything here is on point! Came here Monday morning for their lunch special. I had the mushroom crunch for appetizer \u0026 pcu vegetable for entree. Everything just for $9! The thai iced tea is one of the best i've ever had. If you're in the area, you should definitely dine in here. The manager Hart was very friendly and amazing! Food was so good, and staff was quick \u0026 helpful. Would definitely come back to try the other dishes.", "author": "Adeline T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Had the pumpkin curry. Food was great, wine was decent, service was friendly. I would recommend this place and if the weather is nice walk down to the promenade afterwards!", "author": "LORI F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "Beautiful restaurant with the best vibe. So cute! Really great service. And the food was so fresh and definitely some of the best Thai I've ever had. Loved!", "author": "Buena O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "I've had this delivered a few occasions now, and it's def some of the better elevated Thai food, most probably the best you'll get as far as delivery (on caviar) is concerned. 5 stars.", "author": "Wattle K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Friendly staff and tasty Thai food. Love the decor and style of the restaurant!!! Crispy 5 seed chicken is very good!", "author": "Daniel N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "This spot is amazing! I always passed by here but I decided to finally stop by (after seeing it featured on Eyewitness News Neighborhood Eats). Lemme tell you, probably the best pad thai I've had in the longest. And the shrimp dumplings soo good! I'll definitely be coming back here. The food is soo good, and the staff is so pleasant. The atmosphere is chill (I was the only customer there so just before the dinner rush so I got some peace and quiet). Really delicious food and a food vibe. Would totally recommend!", "author": "Siobhan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Banging amazing flavors!    Wow.    I'm not Thai but I have been to Thailand and have eaten at 100 different Thai restaurants.    This one is amazing.    Very cool decor and atmosphere.    Excellent courteous service.   But it's the food my friend - amazing.    Such flavors!    The papaya salad was spicy but not too spicy and a lot.    The pad Thai which can be boring and sticky or stale was vibrant and fun and fresh - super fresh.    \nCan't find a better lunch deal in brooklyn - only 9 bucks!    What a meal!", "author": "Hugh G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "Great modern take on thai dishes.\nThe deconstructed thai iced milk tea was as cute as it was tasty, although I felt they should leave the base unsweetened as it was definitely sweet enough without the extra syrup on the side. Crab meat fried rice served in a roasted coconut husk was amazing, possible the best dish of the meal, the smoky aroma takes me back to the streets of Bangkok. The crispy chicken and black pepper beef are definitely taking liberal interpretations and I felt they were only ok. They have The Prisoner on their wine list so that's automatically another star!", "author": "Sam D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Pinto Restaurant", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "128 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IL20_GuuKAcXfIPattJKog/ls.jpg", "@type": "Restaurant", "telephone": "+19293377732"}