{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "The Pinto Restaurant is a new fusion Thai restaurant located in Brooklyn Heights and fits perfectly with the atmosphere on Montague Street. Once you walk into the establishment, you will fall in love with the ambience, it is very modern but also quaint and cozy. From their decorations adorned on their walls highlighting locally grown ingredients to the minimalist place setting and dark leather booths and upscale bar, Pinto really embodies a modern, hip, fusion sense of style that I think is very progressive.\n\nThe food is very elegantly displayed and you can really tell that Pinto puts a lot of thought into their presentation. I was very impressed with their use of locally grown produce and their ability to put a new spin on familiar dishes. I am from California and have had a lot of quality Thai food, so I was pleasantly surprised with their technique and combinations. I had a pot pie dish which had Thai green curry with chicken and vegetables inside which was delicious and very surprising. I know they only make a limited amount per day, so make sure to ask for it, as it was a very different style of Thai food than I've ever had.\n\nAnyhow, I was really impressed with Pinto and thought the service was superb as well. The staff was very friendly and attentive and even came by to introduce themselves as the restaurant is quite new. Their was also a very beautiful and charming hostess that helped us by giving us her opinions about the menu and explaining their use of local produce. Overall, I definitely recommend Pinto Restaurant, you should give it a try!", "author": "Wilson C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-27", "description": "Came here for lunch. To their credit they have a great lunch special offering - an appetizer and main course for $9 - but the two things I ordered were not great. As my appetizer, I chose the green papaya salad - not much flavor here. For my main dish I got the pad thai with tofu and the flavor was lacking. Had to ask for hot sauce. They have a lot of other things on the menu so maybe other choices would've been tastier.", "author": "Rachel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "We loved this place!! The food, service and atmosphere is great. They were very friendly and everyone had a smile on their face when they served us.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "We were pleasantly surprised by the fresh take on Thai food. We ordered the crispy chicken pad Thai and it was a dish I will not forget. Very good. Cute place. Great food. Nice ambiance.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-13", "description": "Pros: The food is delicious. Best we've had in a long time and definitely best in the neighborhood.  \n\nCons: Service was painfully slow and awkward. The first entree arrived 10 minutes before the rest of the food arrived.  \n\nThere's also a weird vibe.  It's as if they're trying to be a fancy French restaurant as opposed to a Thai place. The staff, of which there were many, seemed more concerned with putting on appearances than making us feel welcome and taken care of. \n\nAt the time of this writing - they don't have a liquor license and don't take Amex. \n\nFinally, despite the food being amazing, it's way too expensive.", "author": "J L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-29", "description": "Pad Thai tastes like bbq sauce with granulated sugar not fully dissolved. I could eat it. That's about all I can say.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-07", "description": "The restaurant was beautiful and the service was attentive, but the food had some issues.  The pumpkin tofu curry was terribly rancid, as I believe that rotten pumpkin was used.  I ate a bit before fully realizing, so was terribly sick all day as a result.  Overall it seems to be a bit too Americanized, or should I say Brooklynized.  The lo main dish just didn't seem like Thai food at all though I should have seen that coming.  Sickness aside, it didn't seem worth it for the price.  With improved food this place would have a lot of potential.", "author": "Jane A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Awesome lunch specials, great value for such high quality Thai cuisine! I am looking forward to trying the Khao Soi as well, having had fond memories from a past trip to Northern Thailand and given it is very rare to find it in an American Thai place - so it definitely seems authentic although dinner prices are a bit $$$", "author": "A H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "Great decor with veggie options. They have an excellent vegetable sautee with tofu that was amazing. The seaweed soup is also excellent. My lunch buddy had the mushroom crunches which looked really good!", "author": "Junior T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "was there for the opening night last Wednesday and boy were we glad!  this place is a gem and i am a picky foodie.  The starters were excellent and my spicy basil noodles were so yummy! great ambiance and service to boot. Will definitely be coming back.", "author": "Jit T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-29", "description": "Who is writing these reviews? I hope they were getting paid a lot of money. Worst thai I can remember (I grew up with Thai and eating in Thailand). It was a generic menu with the standard \"Americanized\" pad thai, etc. but with a ton of sugar! All of the dishes were sweet, so gross! And disgusting meat, no veggies, nothing fresh. We kept asking for chili, as would be on the table at any Thai restaurant and they brought us a tiny spoon of ketchup(?) that they said was hot sauce. Also they were really rude and it is very over-priced. And they don't serve or allow any alcohol! RUDE!!!", "author": "lil m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "I don't know why some of the reviewers are extremely critical of Pinto! I am a frequent here and every dining experience at Pinto has never disappointed me. They have some really good lunch special options--you pay $9+ for an appetizer and a main course. YOU DONT WANT TO MISS THIS DEAL, trust me.\nI'd recommend get the beef pad Thai and crab fried rice in young coconut.\nThe restaurant manager is always so friendly and energetic, so is the rest of the staff.", "author": "Chloe M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "Amazing food, amazing service and great ambiance.  New date spot!  The Thai Iced Tea presentation was so adorable - partially DIY.  The Crab and Coconut Fried Rice that is baked in the coconut...probably one of the best things I've ever had.  And the PCU was so delicious.  Everything was very fresh and very well presented.  So excited to go back soon!", "author": "Nicole F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Awesome spring rolls. I give 5 for BYOB status, even if it's temp. My pad Thai was solid too. BYOB and spring rolls though, that's a party", "author": "Danny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Great service and great food! The restaurant looks great as well -- definitely worth the trip to Brooklyn for.", "author": "Ronald C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "I got the pumpkin curry and it was so good! I also love their cocktails. The waiter was nice and helpful. I'd definitely go back!", "author": "Evander E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "Temporary BYOB place! We loved their rolls and the pad Thai. It is different, has a more thick texture and a taste of paprika on it, definitely different but great. Service is amazing and decor is great. We'll be back for your crab Rangoon.", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "This is the best Thai I've had since my visit to Thailand. They make creative variations on some traditional dishes like larb gai (they call it something different) and pad see ew and they're delicious. Decor is modern, warm and inviting. This is not your average Montague St restaurant.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Best Thai restaurant in Brooklyn Heights!!! So happy they just opened up here. The food is amazing and the place is beautiful!", "author": "Nantada M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "Tasty food and friendly staff. Slightly overpriced, but very nice ambience. Waitress keen to up sell on dishes, but hey... That is her job", "author": "Faran C."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Pinto Restaurant", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "128 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IL20_GuuKAcXfIPattJKog/ls.jpg", "@type": "Restaurant", "telephone": "+19293377732"}