{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Found this spot on a business trip when I needed a quick meal. This is one of the few spots that has both vegan and gluten free options in the whole area.\n\nI had the A La Panang and it was excellent. Great presentation, flavor and portions.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "My friend and I went during lunch and it was good. The place was cute and not small or insanely huge but there was quick service and good attention. The food was flavorful and not bland. The only bad thing I have to complain about is how it was far from where we had to be.", "author": "Eva P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-23", "description": "I came here for the first time with my friends, expecting some bomb Thai food, but it wasn't really that great. We got the pad thai with shrimp, pumpkin curry with beef, and crispy chicken with five seeds. The pumpkin curry was very sweet and unappetizing, pad thai was okay, and crispy chicken was okay too but I don't understand why it's crispy (it's not deep fried, it is stir fried). It wasn't a totally bad experience, but I've definitely had better Thai food than this. However, the servers were very nice which made the whole experience better.", "author": "Alicia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Some seriously amazing Thai! What sticks with me the most is the Thai iced tea, the presentation alone!!! A must try! The food is also delicious - exactly what you'd expect from an upscale Thai restaurant. Great for dates and celebrations (we went to celebrate a friend's 30th), the staff is incredibly attentive and accommodating. I want to eat here every time I'm in Brooklyn Heights!", "author": "Shannon M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "This thai restaurant has the best thai iced tea. The use that iced cubes so your ice tea doesn't get watered down. All the the food is tasty, the salads are especially tasty. One block away from the R train and 2 blocks away from 2,3,4,5 trains.", "author": "Marsha D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "Just received my order through Caviar. The Mushroom Crunch was tasty, but my green curry with mixed vegetables is in the top 3 worst things I have ever ordered.  The dish had ZERO salt, minimal flavor, and was slightly astringent...I'm hungry and pissed off. I am questioning the Taste of those who have left positive reviews.  This pretty much seals the deal, BK Heights is a no go for food.", "author": "Terrance K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "Pinto is perfect! And I'm not just saying that because the original Christopher Street location is one of my favorite old friends aka long lunch escapes from gloomy days. But because as much as I love everything old, this Brooklyn sequel surpasses said Christopher Street location in food with added menu options, decor with a much bigger and bluer space and dare I say, service because our super-sweet server gave me a customized Pinto ice tea. \n\nAnd after literally running for my life to find a place to potty and have a nice \"snack\" which turned into a full and happy meal at Pinto, a unique non-alcoholic--Pinto is BYOB until they get their liquor license--beverage was just what I needed. \n\nThe magic of a Pinto ice tea is based on the drinker's preference. Pinto provides the tea ice cubes, normally the same shade of light or dark tea, cream, simple syrup and a glass of tea on the side. So you choose if you want it sweeter, with cream or cream-less, but I was served dark, light and lighter ice cubes. And now that I think of it, it may have been a mistake but my server pointed it out in such a positive way, and I loved the idea of having a Pinto ice tea that was made especially for moi. \n\nWe shared appetizers, my favorite vegan option mushroom crunch--delicious, deep fried mushrooms sprinkled with sesame seeds were just as rich as I remembered--and oddly-shaped (flat and round) popcorn shrimp were very tasty.  \n\nFor entrees, we had the chicken kao soi (mine), the five seeds chicken (his), and the egg fried rice (baby's). The egg fried rice was no-salt bland. In fact, even too bland for a child who \"hates\" spicy (but loves my wasabi flavored fried wontons from the supermarket). \n\nThe chicken Kao soi was incredible in execution and presentation. The breast meat was perfectly cooked, moist inside and crispy outside. And I felt like royalty when they poured the sultry, flavorful coconut curry sauce over the entire dish (fried noodles and chicken) at our table. \n\nThe five seeds chicken was also yum. Kinda like a Thai General Tso's chicken but tastier and super fresh. Fried first then coated with a sauce and cooked with veggies. Lots of onions. So much flavor.\n\nWith food this delectable the decor is not important, but thank God it is important to the owner/manager of this restaurant. Talk about cozy even with the noisiest patrons on Montague Street. My LO fell asleep on my lap. I suspect he was full of ice tea and tired from the day's events but there's also a warm sense of comfort and calm at Pinto that we won't soon forget.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "The pumpkin curry is a must have if you venture to Brooklyn Heights for this spot! I am never disappointed by whatever I order here, they do the best tofu- as a vegetarian it stands out! \n\nHighly recommend any of the curries they have to offer. The restaurant has a great atmosphere and it has some of my favorite thai food with quick and sweet service.", "author": "Rose D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "I love this place! It's the right mix of fancy and adorable. I was invited by a friend who always wanted to try this place but never got the chance to. I tried The Fried Rice and the spring rolls, must-haves!! Their Thai iced tea is the best  Hart and the staff are courteous and warm, giving the place a very inviting feel.", "author": "Jazzy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Unexpected stop for lunch and wasn't disappointed. Staff was attentive...lunch arrived quick!", "author": "Cerene C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "I have eaten here twice now, and have not been disappointed. Many a \"drunken noodle\" has graced my place, and none better than their version. Their spice and fresh taste can't be beat! \n\nI've also enjoyed their rangoon and pad thai. Serive is fantastic! Location is great. I hope this is a long-term part of the Montague eating scene. They are also very catering to children.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Awesome little place with good food and nice staff. This is my go to for lunch. I get the shrimp pad thai and spring roll. Food is fresh and enough for up to two lunches. I've had dinner here before as well. Place is cute and casual. One of the best places on Montague St.", "author": "lena p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Don't let this place fool you - the name and the downplayed location do not do it service.\n\nWe came here for dinner with one of our Thai friends and she was impressed with the authenticity. \n\nI normally do not order papaya salad but I ended up getting a second plate because the first was incredible. We also started with chicken lettuce cups, spring rolls, and chicken skewers, all of which were phenomenal. \n\nWe ordered a pad Thai, PCU with steak, and curry. Everything was delicious and we will be back, I highly recommend the papaya salad and the PCU.", "author": "Drew H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "Lovely atmosphere. Gracious and attentive service and very good creative Thai food. Had the shrimp dumpling, the Thai steak sal and and the crispy mushrooms. All very good   Especial liked the Thai beef. salad.  Had the basil chicken which was also excellent. And to top it all of had the rose sangria. What a treat!", "author": "Jay G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Really enjoyed this place! It always looks a little empty but do not be fooled. Their food is good. \n\nHad the pad Thai and personally loved it. Also, the Thai iced tea is one of the best I've tried and that says a lot since I'm from south east Asia and have had a fair share of Thai iced tea. \n\nThe tea is frozen as ice cubes, you get a side of chilled tea, sugar syrup and sweet cream. The trick is to pour the chilled tea first, to the level of the ice, then pour in half of the sweet cream without pouring it on the ice. Mix it together, taste, if it's not sweet enough, add more sweet cream or sugar syrup! I love that I get to customise the sweetness level. \n\nThis is a great place and I highly recommend it!", "author": "Shuwen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "Typical American--but really good--Thai food.\n\nWe've been doing the Thai food circuit at work and Pinto opened up a few blocks away. $9 for a lunch special included an appetizer and an entree.\n\nPapaya salad was good, nothing to write home about. I enjoyed it, though. The pad ka prow/Thai basil dish, always my standard go-to, was excellent! I could tell it was carefully prepared and it wasn't coated in oil, as a lot of the other places around here are.\n\nDefinitely the best Thai in the area. For a buck more than Lemongrass, you get less but much higher quality food. I'll definitely be back.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Dinner is coming soon! Mass amen Lamb. The killer desserts. \n\nMore after dinner. I just expect it to be as good as the original Christopher Street joint. \n\nLast night was so exquisite, I decided more is better! So here I am for different dishes.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-06", "description": "We were around the area and decided to try this place due to Yelps rave reviews. The ambiance very quiet, almost library like, and the decor very bland. I would say it had an upscale feel to it? but not really. I can't say the place was bad because it wasn't. It was just not my style. The server was... somewhat attentive... they left us waiting about 10 minutes to take our order after being seated. \n\nWe had their steamed dumplings, which were.....different, not the typical steamed dumplings you get at a Thai restaurant. These were flat and wrapped in homemade pasta. I have to say I enjoyed them. I have had better but, the taste was definitely unique. We also had the Seafood Pad Thai and  the Tom Yum Fried Rice. I enjoyed the Seafood Pad Thai. The presentation was nice and the Seafood was cooked perfectly! Nothing I hate more than anything overcooked and dry. The noodles taste like any other typical Pad Thai a little bland compared to some I 've had but the seafood was a great addition. \n\nThe Tom Yum Fried rice had the right amount of spice and you can actually differentiate the different seasonings that were on it with every bite but I found it more on the dry side, doesn't make you feel like you want to go for seconds.\n\nThe fact they cooked their seafood so perfectly makes me want to go back and try other sea food dishes.", "author": "Maci C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-22", "description": "Had such a bad experience here. First of all there was no AC on one of the hottest days. Just fans blowing around hot air. Then we waited an hour for our food just for it to be wrapped up to go because we had to go. The people in front of us also left without eating because when they did get their food after the long wait it was cold. When I got back to the office to eat my food, it was hot but also did not taste good at all. I judge a thai restaurant by their pad thai, be the it's one of the simplest things to make. I've literally had pad thai in Thailand and this was just not it. The taste was all wrong like it had WAY too much tamarind. I threw it out after a couple bites. I will say their thai iced tea is really good and I love how it's served.", "author": "Makeda N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-25", "description": "Found a plastic string in my Pad Tai. The portion is relatively small. No vegetables in the Pad Tai. Won't order again.", "author": "Lily L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Pinto Restaurant", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "128 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IL20_GuuKAcXfIPattJKog/ls.jpg", "@type": "Restaurant", "telephone": "+19293377732"}