{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Stylish, modern décor. Impeccable service. Delicious food. I've come here twice and everything was perfect. Highly recommend the Pinto iced tea.", "author": "Bismah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "Delicious chicken pad Thai, though portion is on the small side. Good atmosphere, but nothing outstanding. Just some good, reasonably priced pad Thai and very tasty appetizers.", "author": "Angel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "Ohhhh my goshhh!! Personally I am not a Thai tea person because I feel like it is way to sweet but the Thai tea here is amazing!! Been here twice, the first time was definitely better than the second time. I had the young coconut crab fried rice the first time I was here and it was delicious. I crave for the fried rice all the time. It was like $20 for it but the portion you get is a lot. I felt like it was enough for two people. The second time I came I just had a few apps. The dumpling they had wasn't that great. It had a weird taste to it but the satay chicken was really good. My boyfriend ordered the salmon, it was really fishy like fresh out of the water fishy. But overall I love this place, it is amazing. The restaurant was really clean and felt classy. The service was excellent.", "author": "Irene Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-01", "description": "This is not a trustworthy business. I tried to book this restaurant for my rehearsal dinner and things were going seemingly well in the beginning. We spoke with the manager several times in person to iron out the details throughout the month prior to dinner. By the week before, we had locked down the # of people, menu, time, etc. We were very excited and then were told at this point that we would need to put down several hundred dollars extra in order to have the restaurant to ourselves. It was important to us to have the entire place for our party (and it is not a large space), a fact that we repeatedly mentioned.\n\nThis switcheroo was very frustrating, but we tried to work things out with the restaurant, even though you would think we were done with negotiations. The restaurant got more and more unresponsive, until we finally wrote them off and had to find another location less than a week before our party. This was very stressful, as you can imagine.\n\nWith so many other great Thai places in the area, you should take your business elsewhere. We will.", "author": "Annie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "I'm a big fan from the one in village...wanted to try their new baby.... Superb!!!!   \nLove the new dish called khao soi-- pan roasted chicken with crispy noodles, AMAZING!!!!!   The only down side is it takes a while to prepare this dish...But it's totally worth waiting!  \nI also got the vegetables with Thai dipping.  The vegetable is really fresh that goes really well with good spiced dipping.  \n\nI envy the people here in Brooklyn heights to get a chance to eat their food more often than I do!!  I will definitely come back to this location. Keep up this great job guys!", "author": "Marina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "Ordered the chicken pad Thai for lunch. It was delicious. If you like spicy, make sure you can handle it. I would definitely come back here. The only thing I didn't like was the sauce that accompanied the spring rolls, it was sweet and fluffy. The service was great. It's a cute neighborhood place.", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Food is always fresh and well prepared.  Their crunchy mushrooms are excellent and a crowd pleaser.  I order a double portion when I have guests at home and the mushrooms serve as an excellent hors d'oeuvre. I haven't had anything from this restaurant that wasn't delicious.", "author": "Lydia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Great food, service, and ambiance. A few good vegan options as well. Came here three times. Looking forward to returning", "author": "Ernst C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-02", "description": "Return? Yes, better than the other Thai restaurants I've tried in the area. I would normally rate this a 3 but relative to the other Thai options its a 4\nAtmosphere (3) Clean, simple. It located below street level. I did takeout \nFood (4) - basil chicken (4) w/ brown rice. Only complaint is the rice container is about 1/2 the size of a normal rice takeout. The basil chicken portion was good for 2 moderate size portions\nDrinks: n/a\nService (3) Friendly \nCost = Total tab before tax/tip was $14 on the menu but $14.65 when I paid (suspect brown rice costs more)", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Pinto, I have missed you since you've moved from Christopher Street in the city. I shall see you soon for some delicious Mushroom Crunchers, Pad Thai and Thai Iced Tea...yummmm", "author": "Cherrelle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "New-ish spot in Brooklyn Heights, we came here for an early dinner on a Saturday we were 2/4 people there. Our server was so sweet and came over at the perfect times. The restaurant was super clean, and great lighting. I had the stuffed tofu and absolutely loved it, it was cooked perfectly and great for a light app. i HIGHLY recommend the pumpkin curry, but if you love spicy I would really emphasize to the wait staff to do so or bring extra seasoning/spice on the side.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-07", "description": "Boring, boring Thai delivery. Decided to try this place out since I always order from SkyIce. I guess I'll stick with that. I need flavor in my curry. This place was not horrendous or anything, definitely edible, but so forgettable too. I may give it one chance in the restaurant, since delivery is not always a great assessment of a restaurant, but I am rarely in the area so I don't know when. Also, the amount of sauce brought for the curry immediately soaked up into the veggies, so I could barely taste the sauce. The portion needs to be about double if not more for a proper dish.", "author": "Bea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "This place was incredible. It's on a great street with tons of shopping and things to do. Super lovely. I had the chicken curry and it was wonderful. My birthday was the next day so the waitress was extra nice and was very sweet. The food came very quickly and everything was presented very well. The Thai iced tea was presented beautifully, they have you make it yourself by giving you the tea and milk so you can make it to your taste. It was quite beautiful and made the experience all the more fun. Loved this place, can't wait to go back again!", "author": "Farah T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Outstanding lunch spot!  We were visiting from out of town and came to Pinto for lunch.  They have a weekday lunch special with a starter and a main entree for $9, and the food was outstanding!  I started with the green papaya salad (crunchy and delicious), and then had the Panang curry with the calamari for a small up charge.  It was wonderful food.  I also had the fresh coconut water, which was maybe one of the best things I've ever had in a glass.  \n\nThe service was lovely. Will definitely go back the next time I'm in the are!", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "I have dined at the West Village location a few times so I was really happy when this opened in BK Heights. Pinto offers a unique take on the usual Thai menu, for example the Crispy Pad Thai. There's a nice $9 lunch menu that includes an appetizer and entrée. The seaweed/tofu soup is definitely worth a taste. There's a sleek and trendy vibe inside and the staff are always friendly. Pinto is worth a visit.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "This resturant is lovely. The ambiance is great and customer service is great. They great you at the door and are very plesant. I had the papaya salad and the basil fried rice...great !!! The lychee Bellini was delightful. I will definitely be back. It's a little bit on the higher side on the prices compared to other Thai restaurants but I think the ambiance is well worth it.", "author": "Chaundel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "I definitely love the beef pad Thai the service was amazing friendly staff and fast derive , decor very modern wine and beer only, lunch special", "author": "ruthy o."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Gf and I don't visit Brooklyn often but we ended up here Saturday night on our weekend food tour. We received a big happy welcome when entering and the service continued to be great all night. Check.\n\nFood was delicious like most Thai places in New York. We had grilled beef salad and green curry which was spicy, creamy and delicious.\n\nThe standouts were the delicious crab fried rice which came in a coconut, I didn't read the menu right and was surprised by the presentation! And Thai iced tea which was made a little different and present by adding the cream at our table. Little additions like this always make the experience more enjoyable!\n\nWe'll be back to try more of the menu and write another review nom nom nom", "author": "Weston W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "This place is delicious! I would highly recommend the Thai tea and the crispy rolls! Staff is really nice and the place itself is very pretty and clean.", "author": "Daniel E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "Been coming here for a while now but will not come back. Ordered the chicken PCU and halfway through I noticed some of the chicken bits were raw. Server did not apologize and said I should have brought it to her attention earlier so she could replace it. Too late, lost my appetite.", "author": "J D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Pinto Restaurant", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "128 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IL20_GuuKAcXfIPattJKog/ls.jpg", "@type": "Restaurant", "telephone": "+19293377732"}