{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "I went to Pinto for opening night and had zero complaints. Good location, good atmosphere, great service, and great food. The Crab Fried Rice in Young Coconut was one of the best I've had to date, and the Green Curry Chicken and Crispy Chicken w/ Five Seeds were delicious. I will definitely be coming back.", "author": "Renan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "The food is just divine! I've been looking for a good Pad Thai for a while now and finally found one that outshines all the Pad Thais I've ever tried before. The Thai Iced Tea is genius and delicious. The service was outstanding and the decor is so refreshing! This is definitely gonna be my go-to Thai restaurant!", "author": "Delphine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "Good food, not crowded, fair prices.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-08", "description": "The restaurant itself looks cute and clean and I was excited to go there. While I would have preferred to go in person, I ordered take out once because this seemed like the best option on Seamless. I found the food to be good. Definitely a step above the other Thai offerings in the neighborhood. But the b/f really didn't like his pad Thai. I would suggest this place BUT even though the food is good I find it to be really overpriced for the portion sizes. I had an appetizer and entree and was still pretty hungry. I'd rather just stick with the other local Thai places that offer slightly less refined food for much bigger portions and better prices.", "author": "Daniela L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-02", "description": "Overhyped simply because it's new. We dined here based on the many positive reviews but left disappointed. The 'crispy' chicken was soggy. The highly touted crab fried rice in baby coconut was underwhelming. Beware the kitchen's liberal use of msg! Four hours after our meal my heart was racing so fast I couldn't fall asleep. Unpleasant experience. Stick with Lantern.", "author": "Robert D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "This is the best Thai restaurant in the neighborhood hands down. I've been searching forever for one that is a cut above and this is absolutely it. Hot tip: highly recommend the Basil entree with Salmon.", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Diverse menu for a neighborhood Thai restaurant but some of the dishes take 30 min to cook. Being too hungry to wait, we had the calamari appetizer (light and tasty), beef in garlic sauce (good with a lot of fresh veggies but should have ordered with some more spice) and my favorite, the lamb massaman (delicious massaman curry which was sweet and savory!) Staff is friendly and the restaurant has a sophisticated and fresh design. Worth trying out!", "author": "Jenny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "What a fantastic place! We stopped by for an early dinner and could not have wished for better food or service. The staff is fabulous and super attentive and the food is authentic Thai but with a modern twist. I had the creamy Tom Yom soup and it was delicious and just the right amount of spicy. Fried shrimp and salads were excellent as well. The Thai ice tea and the way it is served is very creative. Overall, fantastic addition to Montague's food scene.", "author": "Alyssa P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-13", "description": "The food is good...but beware of ordering lunch specials for delivery. I mean, for $10 it is one of the smallest servings I have ever seen. I got the Spicy Basil Chicken. The flavor is great, but I will not order from here again. It probably had 4 pieces of chicken in the dish. A joke that myself and my co-workers all had a laugh at. Won't spend that kind of money for the portion. Neither will my co-workers.", "author": "Bob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "Amazing food - the S.K Vegetables are amazing, as is the mushroom app. Been here many times - the service is always great, and the prices are reasonable.", "author": "Caroline G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "First time I've actually eaten in this space after 10 years in the neighborhood. I no longer walk on by. It's great.", "author": "PM M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-17", "description": "Came here based on the reviews. Very disappointed. The service is good and staff is friendly, but the food is SO average....actually, less than average. Lack of seasoning makes for a bland dish. We ordered quite an array of plates and each dish was missing a flavor element.", "author": "S. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "We live in the area and had been meaning to try this place for awhile.  It really exceeded our expectations! They did a great job renovating the space.  The interior was intimate and fresh.  The service was impeccable; our waitress was both attentive and accommodating. The food was delicious - especially the Chicken Mint Salad with Lettuce Wraps and the Prik-King Tilapia. We will definitely be returning.  Welcome to the neighborhood!", "author": "Sydney S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-18", "description": "As soon as me and my cousins food arrived to our table, I smelled a weird smell. We both got the pad Thai. It smelled bad. Totally lost my appetite. The food didn't taste good. The chicken it it was hard and tasted old. Lantern food taste much better. My cousin felt and took out of her mouth pieces of egg shells from her food. The service there is great. They give us water often and are friendly. But I do not recommend coming here for Thai. They did not even have extra spices on the side, they only had hot sauce. All Thai places I've gone to have hot spices for the customers. Also there was a box of medicine for Cold and flu behind the bar, they shouldn't be working there serving food and drinks if someone has the flu!", "author": "Kristle N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Beautiful space.  The staff is friendly and attentive.  Food is delicious .  Especially loved the green curry.", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-30", "description": "Presentation of the Thai iced tea was cool, everything separate and then you mix it to your liking so you can control the sweetness. Crab Rangoon was cold in the middle, not sure if that was intentional but was certainly off putting. The main dish was a mildly spicy rice dish, but it had a very strange taste, didn't want to finish it. Love Thai food and I hope to find a better place in the neighborhood.", "author": "Richard W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "This place is awesome. I went with a small group so we ordered a couple of dishes to share. The crab rangoon and chicken lettuce wraps are a must to start. The lettuce wraps are really flavorful as well as refreshing. For entrees, we shared the Crispy Pad Thai with chicken, crab fried rice in young coconut and the lamb massaman. All were amazing but I have to say that my favorite was the lamb. It was so moist and tender. It melted in your mouth. Everything was so fresh and very tasty. The service was great and the staff was really friendly. The bathrooms had fresh lavender which was a really nice touch. Pinto has a great ambiance - I think it would be good for a group (which we were) or a date. The music was great and it seems like there could be a really fun bar scene. I can't wait to go back!", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "This place is by far the best and most authentic Thai restaurant in the area. I highly recommend the Kao Soy and green curry as those are what I tasted, but I'm sure they have many great dishes. The wait staff is incredibly nice and the food comes quite quickly!", "author": "Lucy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-18", "description": "I feel like I just ate at a different place than the other reviewers. The decor is fresh and new and comfortable, but the food was \"meh\" at best. The fried calamari was a small portion (we were 4 sharing apps), all batter (bland) and very little calamari. The chicken satay was better... well seasoned, well cooked, decent peanut sauce. The Pad Thai was mediocre and had egg shells in it - not appealing. The lamb massaman wasn't terrible. The lamb was cooked well, very tender. But the curry was very salty. The Bok Choy was bland. The egg fried rice was bland and seemed like it was boiled and barely touched a wok. All of the above was forgivable for a new place still finding its stride - but the service was nonexistent. We waited 15 minutes for someone to finally take our order, were ignored throughout the meal and had to grab a busboy to get our check after being ignored with empty plates on our table for 10 minutes after we finished. We had considered desert, but they never asked if we wanted any. Even getting my credit card back after we handed it over with the check took another 10 minutes. I'd give this place another chance in 6mos if they're still around, but I'm not optimistic that'll be the case.", "author": "Laurie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "Very good and inventive Thai cuisine.  Not too inventive, meaning you can find many of your favorite Thai staples on the menu, but often with a twist (crispy Pad Thai?  Yes please).  I ordered the green curry with the seafood trio (shrimp, squid and salmon).  The salmon was absolutely spectacular, the shrimp was very good, the squid was just alright.  It was $6 extra dollars to add the seafood to the dish, but the portion was extremely generous. My husband had the Khao Soi which is typically made with fatter softer noodles with small pieces of chicken.  Their rendition of the dish included a generous portion of pan roasted chicken with skinny crispy noodles, and it was fantastic.  I agree with some of the other reviewers that the service was not bad but a bit awkward (seemed a bit random with how the dishes came out and took a while to get the check).  Also, as a small business owner myself, it always perplexes (and annoys) me when an establishment doesn't accept Amex.  But overall I really enjoyed my meal and experience here and will definitely be back.", "author": "KB S."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Pinto Restaurant", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "128 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IL20_GuuKAcXfIPattJKog/ls.jpg", "@type": "Restaurant", "telephone": "+19293377732"}