{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "I came here awhile ago and had the kindest and sweetest/loveliest person ever! Her name was Csai/Tsai. Excellent service! Such a beautiful person!\nFood was on point! everything was delicious. I had the spicy chicken wings and Bul Go Gi. Everything was flavorful! the chicken wings were perfectly crispy on the outside, just like they should be. I have been to some chicken joints(looking at you wings over Albany) their chicken looked RAW and dunked into sauce. It feels like youre chewing on raw chciken meat! the outside is white because its soo raw. If you wipe the sauce off the chicken, you can see the white raw chicken meat with its pockmarks!! yuck\nthis place knows how to make good chicken! they can sell their spicy chicken as an entree its so good!\nThe place was neat and clean! the ambiance is comforting and serene.\nI would definetly recommend this place to anyone!", "author": "Jackie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-27", "description": "Ordered delivery from here through caviar (#PSA: always remember 2 tip your courier!!!!). Also reviews that mark down the score when a delivery was slow are a big smh -- not always the restaurant or courier's fault...\n\nANYWAYS -- Satay was a bit tough, they also didn't separate out the cucumber salad and croutons so it was a weird mushy mess. The PCU was so sweet, it made no sense. Tried adding lime and vinegar to balance it out but it didn't help so I Basically ate just the meat and bok Choy. Chicken Pad Thai was OK as it's usually already a sweeter dish. Maybe visiting the restaurant is better ambiance and food? I dunno", "author": "Hana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-17", "description": "I came here because of their famous Thai iced tea and how you can construct the whole thing  yourself !! It's such a great idea that I'm surprised other places haven't caught up with it yet. The drink was delicious ! But I kind of got annoyed when the ice wasn't melting ! I wanted more ice tea hah \n\nWe ordered the calamari basket, the spicy basil lo mein and the pad Thai. The calamari was pretty good nice and tender and crispy. But it was completely not seasoned! The only thing that added flavor was the overly sweet sauce on the side. At least add some salt and pepper guys ! \n\nThe spicy nail lo mein was pretty good. Nice and flavorful, the spice creeps up on you the more you eat. And the pad Thai was mediocre. I felt my pad Thai was TOO sour. We think they added a little too much lime but it was overly sour and I had to continuously look for something to drink after each bite. \n\nInside the establishment was clean and pretty simple in their design. Hints of Thai culture was scattered around and it was super nice sitting near the windows because of the amazing lighting.", "author": "Sally C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "We came here for a Sunday brunch. We were super hungry and didn't know which place to go to. This place looked cozy so we decided to try it out. And bou was it good. My friend is vegetarian so we had vegetarian food here and it was tasty. They separated out the thai iced tea which gave me the option to mix which was super fun.. The thai iced tea was good but too much ice and less quantity of actual tea. I had the tofu lo mein, it was spicy and delicious. Overall the ambience was nice and the waiter was very accommodating. It's a nice place to stop by for brunch.", "author": "Aishwarya S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-15", "description": "I've ordered from Pinto many times and today the pad Thai was inedible. No flavor, mushy noodles and very uninspiring. Tossed it in the trash. \nFast delivery but would prefer food that's good, not great, but good.", "author": "Catherine C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-18", "description": "Pretty good Thai restaurant, but not a huge fan of the prices. I guess it comes with the neighborhood, but it wasn't the best Thai I've had.\n\nThe pumpkin curry was pretty good, but overpriced at $16. The chicken wings weren't fried well and the soggy skin just kind of fell off.\n\nThe papaya salad wasn't great.\n\nThe space is pretty, but the tables are a bit too close together. You end up hearing everything people on either side of you are talking about.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-16", "description": "I had a quick, midweek lunch here with a friend and it was quite tasty. We had a great experience and the staff couldn't have been more kind and efficient. Bonus: the restaurant itself is designed with a light and airy hand, with lots of plants, botanical prints, elegant lighting and table settings. \n\nThe lunch is prix fix at $12.00 includes an appetizer and a main. There's a choice of several appetizers (we got green papaya salad and crispy spring rolls) as well as several mains (we got tofu basil and tofu green curry). The main dishes can be made with pastured chicken, beef, extra veggies, or organic tofu. And for an additional surcharge of $2.00 one can order a salmon or a steak main. Our food was was delicious although I might have liked by tofu basil to be a bit more fiery. The green curry was truly excellent. Heads up plant-forward Brooklynites craving healthy, savory meals: Pinto is calling you! \n\nWe noticed that a few tables had ordered the DIY Thai iced tea that is served on a little wooden tray with cream, simple syrup, a glass of Thai tea ice cubes and a flacon of Thai tea. This is not only really cute but also considerate because not everyone likes their tea the same way. We also noticed several single diners, tucking into their food while reading. This is a peaceful, pretty spot for those looking for something out of the fray that is downtown Brooklyn and the commercial parts of Brooklyn Heights. I'm happy to have found it and I will return!", "author": "Pritha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-03", "description": "Pinto! Pinto! \nCute Little Thai Restaurant On The Corner Of Montague Street! \nVery Light and Airy Decor, something I am not used to when walking into a Thai Restaurant. \nI take away a star because when I walked in with my cousin there were about 4 people sitting and eating. The host was on the phone not paying attention to the door and we were acknowledged by another staff. \nHe seated us and gave us menus. The host came over and the first thing she said was we are no longer doing lunch... it was 3:32PM.... LUNCH ENDED at 3:30PM. Ummmmm ok lady.... nice for you to finally acknowledge us... \nWe were very hungry so we stayed.\nThe menu options are nice, pricey for Thai, but it made the lunch special look that much more appealing! Lol\nSo we ordered 2 Pad Thais and a side of Bok Choy! \nEverything was tasty, we really wanted to explore more but was so put off by the first thing the host said to us after we were seated by another waitstaff member because we weren't acknowledged....", "author": "Ashley W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-25", "description": "Really cozy and comfortable Thai restaurant in Brooklyn Heights. I have been here before but this was the first time I came for the lunch special. Staff is very friendly and knowledgeable about the menu. I had the potato appetizer with spicy mayonnaise and basil chicken. Both were delicious. Chicken tasted fresh and very flavorful. This place is very popular ant lunchtime and for good reason. I'll definitely be coming back.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "Lunch special $10 with appetizer and entree. I ordered the a la panang, which is red curry. It was delicious with the right amount of sweetness. Dumplings were good too. Small portion (only 2). My friend ordered the papaya salad, which looks amazing and the green curry. It was sweeter than the red one and a bit spicier but tasty as well. Will come back", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-06", "description": "Their creamy tom yum soup gets a solid A. The best of its kind I've had. The papaya salad is also very delicious! I'll be back for these two items alone, and to try out other highly reviewed items. Another good item was the crunchy mushroom appetizer, a solid B. Their pad thai wasn't the best I had, however. I like mine with garnish and it didn't have any: no sprouts, crushed peanuts, lime, etc. It was a simple pad thai, and I've had better.", "author": "Leina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "This place is hidden gems in NYC Pinto Thai restaurant. My sister and I went to this place after we finished shopping in 5th avenue Manhattan. I hear so many friends talk about this place so we decided to come here today . Since walked close to Pinto then we were stun with mini rose garden in front of house that very beautiful and made me excited .My first step in restaurant  we got warmly greeting from manager and waitress feel like I come to friend 's house staffs very professional in my standard.  We were seat by them in front of dinning room next to the bar with mini rose garden view.  I love decoration in dinning room area they are so cute.  While waitress gave us menu we got recommendation to order Thai ice tea so  I was not hesitate to order because we able to choose sweetness by ourself not like another restaurant that they provide us super sweet anyway I like Thai ice tea this place.  For appetizer we ordered couple thing  they were tasty for  the meal we ordered Kho soi  it is curry noodle in Thai northern style  that was amazing test   Chicken very tender.   Highly recommend  Crab meat fried rice in coconut. Anyway I love this place and I will come back again for sure I wanna give them more than 5 start in review.", "author": "Chatchawan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-06", "description": "4.5- We ate here on a Friday night. We got there around 7:30 and there were a few other groups there but nothing crazy. We were seated immediately. It was a little warm in the restaurant and had a smell I couldn't place but nothing awful. We ordered crab Rangoon and it was so good we ordered a second one. They were the perfect size and weren't overly packed. They were warm and delicious. \n\nMy husband got the pad Thai and I got the PCU. The PCU was made with different noodles than I'm used to seeing but that didn't change the flavor at all. It was so good! I can't believe we waited this long to eat here. The food was delicious and was a good portion- not too much but not too little. I saw they have pretty good lunch specials too so we will have to come back for that.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-01", "description": "I really enjoyed this place. I stumbled across it while I was in the area for an event but didn't have a lot of time to spend on dinner. Was able to get in and out within an hour and I loved every minute of it. The crispy chicken with five seeds was a huge surprise and the flavor/texture  combination was out of this world. A definite must try.", "author": "Christina M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-12", "description": "not the best pad thai I have had. It had a funny taste to it. It was also vegetarian and had a plethora of different stuff. Half of the veggies I have never seen which was interesting. \n\nDelivery was also about 45 min late. Not the biggest fan of that since we gave them ample time to deliver. \n\nNot a great experience and hoping for better next time.", "author": "Nicholas G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Delicious, cute little Thai restaurant on the corner. Friendly service and relaxing atmosphere.\n\nWe walked in on a Friday night without a reservation and all food was wonderful and times to come out perfectly.\n\nThe wings were incredible and crispy all around with the meat and crunch flaming off the bone. I feel some may think it was too crispy but i thought it was perfect. The crispy Thai rolls were also so good, they come with 4 and the sauce is delicious.\n\nMy friend got the SK Sautee vegetable with chicken and she raced about it. She added chicken and it came with rice. I got the pad Thai with chicken which was soooo good and definitely one of my favorite pad thais ordered. The only miss or knock if you will is it came with tofu in it, which i was bummed, however i picked it out like a champ and finished the whole dish. I also added chicken to mine.\n\nWould strongly recommend, we left feeling happy and full but not uncomfortable from eating too much :)", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "This place never ever disappoints. The staff, the food, the ambiance are top notch. My forth time here and it's fantabulous like the very first time!!!! Do yourself a favor....EAT HERE.", "author": "Adrienne B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "I came here with my coworkers. The setting was very nice and relaxing. In terms of food, I recommend the crab fried rice (comes with a coconut). Great presentation of food!", "author": "Michael N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "Soooo good!! Went with a bestie and it came out so good! I loved the pad Thai there and I suggest it to anyone who wants a good pad Thai!", "author": "Michelle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "Love all of the food this place  ! Friendly recommend And I love thai tea. I would recommend", "author": "Yizhou L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Pinto Restaurant", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "128 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IL20_GuuKAcXfIPattJKog/ls.jpg", "@type": "Restaurant", "telephone": "+19293377732"}