{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-17", "description": "The food is very good and the service is outstanding. The only problem with this restaurant is that they have a lack of customer satisfaction due to the heat inside the restaurant. I would recommend that they get their air conditioning fixed", "author": "Christian B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "The service here is AMAZING! But more importantly the food was delicious!\nWe came for lunch - an extremely well priced fixed menu with appetizer and main all for $9. The food was fresh, well portioned and extremely flavorsome. I well and truly recommend this place for lunch - and look forward to sampling their dinner menu!", "author": "Matt D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-16", "description": "Although the food was good the service was not. Tbh this isn't amazing food you can't find anywhere else it's really basic Thai or Chinese however the service shocked me. So me and my two friends had two separate bills idk why they didn't charge us together but whatever so my meal and my friend was charged a full $27 and then my other friend charged separate was $10 so later on I paid the $27 full and my friend for the other bill put down a $20 and we did pay together at the end so that $10 was the tip which I think is reasonable. Mind you I'm a broke college student so yeah my one meal was $10 I think a $10 tip is more than enough. I walked out of the restaurant and 3-5 minutes later this lady is running after me blocks down I'm thinking I forgot something but she started yelling why I didn't tip. I told her my friends $10 was her tip for everyone and she's like no I need a separate tip from you. She wouldn't leave until I tipped her so obviously now everyone on the streets is starring at me so I tipped her $5 and I'm like is that good and she rolled her eyes and said whatever whatever and walked away rudely as if I did something wrong. I didn't even have to extra tip her but I was trying to be nice and she was just being beyond rude. Funny cause I was actually gonna bring my friends here but after this horrible service I will never be coming back and telling everyone I know not to also.", "author": "Arooj M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-30", "description": "Super small portions and very high prices for sub par food. \n\nI live down the street and I dined in once--my pad thai had a strange not very fresh taste. \nI've had take out twice--one time I got a extremely small $10 Tom Ka Gai soup which was in a not properly closed container that spilled all over the bag it was in. Just last night we ordered Lo Mein and Panang Curry. My Lo Mein was probably 8 bites, not enough for $13 and really not that tasty! \n\nThere are many other great Thai options in the neighborhood, I predict this place won't last!", "author": "Gabriela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "This restaurant is absolutely amazing. It's a little more expensive than the Thai restaurants in this neighborhood, but it's worth it. Ingredients are so fresh and in season, and the restaurant decor is absolutely beautiful. I got the calamari for the table, my friend got the PCU noodles (rice noodles, so delish) and I got the Spicy Lo Mein (American style Lo Mein, also delicious). This is not my first time here, but it certainly won't be my last! Highly suggest!", "author": "Georgia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Best Pad Thai I've had- very fresh! And delivery was so quick  will definitely be ordering from here again.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "First time here, the service was good...friendly and helpful. Make the food even better. I love this place. Jeo Bong is my favorite the best ever and to die for.", "author": "Kitty S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "Solid neighborhood spot. Good for date nights. Affordable, accommodating, yummy curry and BYOB.", "author": "Mary L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "The food was great. I absolutely LOVED the wild mushroom and coconut soup. I love anything coconut, but I never thought of ever sampling coconut in soup. Oh boy what I have been missing. This was the best of what I ordered.\n\nThe fried calamari was crunchy and not over fried with a hint of salt.\n\nThe crispy roll plate was just that, crispy AND flavorful.\n\nI had the braised bok choy. It was not salted which was good because I like to control the amount of salt I used. \n\nThere were dipping g sauces, but I barely used them because the flavors were strong.\n\nTo top it off, the price was very reaaonable. This is definitely going to be one of my go to places in the area. Many restaurants have come and gone. I hope this one stays a long time.", "author": "Jude R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Five stars for some of the best and most authentic Thai in the area, and just because it's one of the few really good restaurants in Brooklyn Heights. Give Pinto a shot!", "author": "Ori B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-24", "description": "It's OK. Like other reviews stated, they don't keep the AC on. It was 86 outside and the inside of the restaurant was still hot. Another diner asked them to turn the AC up and they pretended to, but didn't. \n\nThe food was OK, not the worst and not the best Thai food I've eaten. The servers and service is good, staff are attentive.", "author": "April Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "They are so NICE here! I've come by twice to get the chicken pad Thai to go and both times I'm SHOCKED at how friendly and wonderful they are here. Also, the pad Thai is amazing.", "author": "Isabelle M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-09", "description": "My experience here was very unpleasant- I came in the first week when they opened and maybe they didn't have it together yet but it was just bad- sloooow service and for lunch you really need speed. Both the appetizer and the main I ordered were super bland and not satisfying. I really wanted it to work out but for me, it just won't be the spot. And by the way, every time I pass by this place it's completely empty.", "author": "nina s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "For a grand opening it was amazing.  The best part of my night is when the food I thought I was supposed to get came out wrong the Waiter and Owner both redid the meal without making me feel as if i did something wrong.  AMAZING food.  \n\nThe Ragu with veggies were great, the Basil Chicken with Rice GREAT!!! Location is wonderful right near the Promenade and in a very nice neighborhood.  Have definitely told other friends and co-workers about the place and will definitely be back.. WAY TO GO PINTO!!!!", "author": "Sidney B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "I would say it's slightly overpriced, but it is a good-quality Thai place. I got the shrimp popcorn and creamy tom yum to start. Both were well done. The shrimps were really small but the fried batter part was really big so it was a bit overwhelming. I had an awkward moment because I went to this restaurant solely for the crab fried rice in young coconut and when I ordered it, they thought I said another dish, which usually takes 30 minutes to prepare. They prepared that wrong dish for thirty minutes and I had to be that awful person to turn it down! If you're reading this Pinto Restaurant, I'm sorry again!!! I didn't mean to cause so much inconvenience. Anyways, the crab fried rice was good. It was a bit too salty and the crab was a bit too soggy, but overall it tasted good. I would return but for slightly fancier occasions because of the price.", "author": "Lynn M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-26", "description": "I would never come back here again. I order the veggie spring rolls for appetizer and it was average, green curry is also average. Worst part is they can't even cook the rice right. The rice is mushy!! What Asian restaurant doesn't know how to make rice?!. Our table was wet when we were seated. There was soapy water when I lifted up the placemat, so gross! AND their AC isn't even on when it's 93 degrees outside. What a waste of money and uncomfortable experience overall.", "author": "Vicky J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "A great test of Thai food in Brooklyn Heights ,Just a few block walk from subway ( borough hall 4 train, court st R train ) . Mushroom crush is my favorite , crispy and pop inside. Fusion good but rich of authentic thai food. So yummy ....", "author": "October N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "Can't give this place a more positive rating! Phenomenal food and great decor/atmosphere. Perfect for a friend date or relaxed/trendy date. Loved the pumpin curry - highly recommend!", "author": "Nereyda E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Always my lunch time go to.  The best Pad Thai in town.  Oh my gosh, I crave it. It is lovely with the Thai ice tea.  Great service and a sweet staff.", "author": "Elle S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-18", "description": "Food: 4 star\n\nOrdered lunch special today.  $11: 2 shrimp.\nconfirmed normal by server", "author": "Evan B."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Pinto Restaurant", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "128 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IL20_GuuKAcXfIPattJKog/ls.jpg", "@type": "Restaurant", "telephone": "+19293377732"}