{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-31", "description": "Honestly, I'm puzzled to see that people have left 5 stars for this restaurant. I have been wanting to try this place since it opened, went last week and didn't even get to try to food because we waited for over 20 minutes to even get someone's attention. \n\nJust bad service and the worst shrimp appetizer I've ever seen...yes seen as I couldn't eat it.  Frozen food served with a ketchup mustard sauce?! I thought it was Thai.. Chili sauce, people? \n\nAnd the last thing.. They don't have alcohol so it's really unbearable to even sit through the terrible service. Good luck y'all.", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-24", "description": "I hate that I have to write this. I have been getting food from them often since I work close by, however, today they sent me rancid rice! Yes, rancid!! I did not think rice could get rancid, but I smelled it and it was sour. Now I don't trust their food. DONE.\n\n\nAnother update - They just called and issued me a full refund after this review. While I appreciate it, I am not sure about going back. Time will tell.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "WOW! We hosted a party at our home and had Pinto catered it. The food was SO GOOD they delivered hot and promptly.", "author": "william p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "Amazing!!! Finally a great thai restaurant in Brooklyn Heights with good service and ambience! Sure I have ordered ok cheap thai from places around my neighborhood but those restaurants are not the places you would go to hang out with friends on Friday night. This place is!!! Such a nice ambience, classy decor, great service, and amazing food! Farm to table concept locally sourced modern thai cuisine without being too pretentious or expensive. I loved their restaurant in west village and this is definitely a Brooklyn Heights interpretation of their west village location. Go here! Their crab fried rice is to die for. Yum Yum Yum!!", "author": "June K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-03", "description": "The food in this location does not meet the standard. The crab salad is way too sour, the crab fried rice in young coconut is so watery.... Will not recommend anyone or return to this location again!!!!  only gave two stars because of its service by the waiter. Stay away!!!!~", "author": "Michael L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-15", "description": "Ambiance is nice, but food was a little bland. Crab fried rice is worth a try-- wasn't a big fan of the fried calamari and tilapia dish though as it wasn't very flavorful.", "author": "Ron W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Love this place for good, not oily Thai food. They have the best Thai ice tea. I go 2x a week. My go to is the spicy lo mein but the curries are really good too. Service is fantastic.", "author": "Tazmun N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-13", "description": "Ordered from here via Seamless. Requested that one of the dishes be not spicy at all. When the food arrived, that container had been written on with a marker saying \"cannot do not spicy at all.\" I don't understand why nobody from the restaurant called me to tell me they couldn't honor my request. I would have chosen a different dish. Seamless tried to get a refund for me for that dish but the restaurant refused. Bad customer service.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "I went there a few times for dinner with different friends.   \nDelicious crab fried rice was always on our menu (note: do ask for extra fish sauce and chilli on a side; you might want to add some to fit your palate).  Personally, I love their Thai pate un jar (Nam Prik Ong) with those refreshing veggies as a starter and Lamb Massaman as a main dish.   Nothing was too spicy to the point you couldn't enjoy.\nSince I have a sweet tooth, I always look for dessert after the meal.   They always had something when I was there, even not on the regular menu.   I'd think something light and summerly like mango, watermelon, or raspberry sorbet would be a perfect addition to their modern Thai cuisine.  :)\nLocation is great, cute space.   Staff may be a bit shy but attentive.   I'm also a fan of BYOB!", "author": "Tim J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-16", "description": "Here for my birthday  with my sisters. The waitress promoted a \"power lunch\" with my lunch special. Wine or beer with the lunch special for 5 dollars rather than full price. I asked for a glass of rose. She said rose is not included. Just Chardonnay or Pinot Grigio. So I said I'd get the rose and my sister said she'd have my Pinot Grigio with my lunch special.  She didn't get the special.  When it came and we traded wines, the hostess or ? owner came over and said it would be full price, no matter what. There was no reasoning with her. Finally I said that she could do what she thought was right, but we wouldn't be happy or leave a good review.  She was extremely aggressive about it and said \"we set the rules\".  She's been glaring at us since and we are all scared to eat our food.", "author": "Minda P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Cute little gem in BK heights. The service is awesome and the food tastes really good. Very inexpensive.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "Lovely service \u0026 pretty decor but obviously I went for the food which was bland. I ordered the coconut rice which according to the waitress was a popular order. The display of it was great but lacked flavor.", "author": "Maya N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-13", "description": "Below is the online menu for your restaurant at YELP\n\nI was at your place on Montague St. for lunch today...the 8 dollar fixed price lunch suddenly became 9 dollars...where there was an offer of a green salad with lime dressing as part of the prix fixe online..there was none offered in the restaurant..the option of beef or shrimp went from 1 dollar to 2 dollars in house..and the final coup de grace....we ordered 2 Jasmine teas and they were 4 dollars each!! That's insane!\n\nWould you care to explain how in one week ...your online menu changed so radically...was it a trick to get people in...or some other reason. Besides this ...my friend's chicken pad Thai had quite a few pieces of chicken with unchewable gristle..something you would not expect from a \"high end\" eatery. I was hoping to be a frequent diner in your establishment...but I don't like chicanery. \n\nYou guys are smart...change that online menu so that others are not duped. To be honest...if you had given the higher prices online and clearly marked on the restaurant menu..I would not have had a problem with that .", "author": "Allan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "Had dinner here for the first time this weekend and was really impressed!  The calamari appetizer was lightly fried and very tasty with a great dipping sauce.  My green curry chicken was the best I've had outside Thailand and my friend's massaman lamb dish was excellent!!  \n\nFor dessert, they served a delicious coconut pudding which wasn't too sweet and tasted exactly like what I've had in Bangkok.  Can't wait to go back to this place!!", "author": "Jeff S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Service was great, Food was perfect! It only loses a star for me because we were sat next to a VERY LOUD part of 8-10 immature college kids. I dont really fault the restaurant for that, but if you hear a group making a ruckus and messing up everyone's dining experience you should ask them to lower the noise level. \n\nIts a great little Thai spot though, but if you see a large group in there stay away.", "author": "Richard S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "Fresh ingredients served beautifully and delicious.  Extremely friendly staff.  Enjoyed very much and look forward to returning my next time in Brooklyn a Heights.", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "I've eaten here a couple of times and it's been solid both times. Everyone is always happy with their food when we go. I wasn't too hungry last time I went and ordered the minced chicken salad. It was light and citrusy. The decor is cute and service is good. Will return again.", "author": "V M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Wow!!  This food was super tasty. The service was professional and they even adjusted for my food allergy.  A gem in the neighborhood!", "author": "Allyn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "One of the best Thai restaurants in NYC. I always go to Pinto @ Christopher. But this new one at Brooklyn Height is spectacular: creative design foods, spacious/beautiful restaurant with a lot of sunlight, and great services as usual.\n\nMy favorite dish here is Khao Soi - Chicken Yellow Curry on Crispy Egg Noodle. It is a must to try  ^__^", "author": "Bank C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "Good food, cheap lunch special. For $9 you get an appetizer and entree. I loved my basil chicken with vegetables and a side of brown rice. They do seem to have a heating issue. The restaurant is underground and not heated enough. The bathrooms are not heated at all. This is my only complaint since it is in the 30s.", "author": "Lynnette V."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Pinto Restaurant", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "128 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IL20_GuuKAcXfIPattJKog/ls.jpg", "@type": "Restaurant", "telephone": "+19293377732"}