{"aggregateRating": {"reviewCount": 204, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Food if really delicious.\nI had a crab Rangoon and creamy Tom Yum soup- it was amazing!!!!\nPlace is also neat and clean!\nHigh recommend guys!!!", "author": "Anna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "Pinto serves locally sourced Thai food in a bright French modern dining room. It's as if a California grown chef educated at L'Cordon Bleu moves to Thailand and came back to New York to open this gem on Montague Street. The attention to ingredient quality, colors, textures, and immaculate service make this a really wonderful add to the neighborhood. It's perfect for an affordable date, introducing people to Thai for the first time, and taking the parents out. \n\nWe ordered: \ncrispy mushrooms - served with a lemon aioli\ncrispy chicken with five seeds - excellent\nthe lamb massaman curry - very good\nside of brussel sprouts - a little sad, were these boiled? Should have done bok choy. \nblueberry panna cotta - oh so French, light and lovely\nfor next time - the Thai iced tea is deconstructed and fun and I was so envious of the other table, but it was too close to bed time to try it...\n\nThe service is friendly from the start, welcoming you in and seating promptly. At 7:30 pm on a Saturday, we were lucky to not wait for a table, but the place was 90% full the whole evening as tables turned around us. The staff I think is actually all Thai, this isn't a Chinese place faking it as a Thai place, which we thought was awesome. The staff were quick to answer questions, recommend dishes, remove plates, and fill glasses. They also are super aware that English is their second language and try especially hard to ensure they understand you correctly and that you're having a good time. They were all really cheerful - I hope they like working there as much as it seems!\n\nThe food is very approachable Thai. I want to say its Americanized, but in a farm friendly way, not in an over-sweetened version of Thai that is common in lunch special joints. Pinto is big on adding kale and brussel sprouts to the menu, button mushrooms over wood ear, and green bell peppers vs long chilies. I didn't find a whiff of fish sauce in my dishes, and while flavors were high on curry, lime, lemon, peanut, and bitter greens, none of my dishes were spicy. Next time I'll ask them to amp it up (I can take it!) but all of these points are perfect for novice Thai food eaters. Their rice is also perfectly fluffy and sticky. We actually had to ask for chopsticks - all tables are set with forks and spoons, but the staff were happy to accommodate. I love how clean their food tastes and it appears to be low on cornstarch/flour thickeners. \n\nPrices are fair for the neighborhood, portion sizes, and quality. I think you get the best bang by eating family style and sharing plates, and we were definitely full at the end.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "Finally a new Thai place! This is a much needed addition to the neighborhood as decent Thai food has been hard to come by lately. \n\nThe space is beautiful, clean and welcoming and the staff was very attentive to our party of 4 adults and 2 kids.\n\nFood is delicious, though I'd probably call it more Asian fusion than pure Thai. When was the last time brussel sprouts or kale were seen on a Thai menu? If you're going to fuse with something though, I don't mind a fusion with the trendy health foods of the moment. \n\nThere's a lot of emphasis on presentation here. It might be gimmicky but it works. Check out the picture of my fancy Thai iced tea!\n\nThe tofu appetizer we had was amazing. My noodle dish could probably use a little less sauce but I'll definitely be back to try more of their dishes.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-12", "description": "I'm always up for trying new places, especially Thai food, I like Thai food.  The restaurant is modern and has plenty of seating including at the bar.  \n\nFirst up is the Thai ice tea, this is where it gets interesting, the Thai ice team came in a box with 3 glass containers - shot glass of sugar water, glass of Thai ice cubes, and condensed milk.  This felt like chemistry class all over again, I have to do the concoction myself, I poured everything together and it kind of looked funny - like its missing something.  Being all confused, I inquired the waiter.  The waiter said \"oops forgot to give you another glass container - the actual Thai ice team liquid.\"  It tasted pretty good, not too sweet.  But I fell off the chair when I saw the check, if I remember correctly, it was at least $6, the most expensive Thai ice tea I ever had.\n\nI had the tofu pad thai and it was okay, portions are decent and tasted pretty regular.  Also had the green curry, which was amazing and good.  \n\nPrices are a bit on the high end.  Not paying that much for Thai ice tea again.", "author": "Bakchun K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "Came here on a random Sunday lunch. They offer a pre-fixed menu for $19 which includes a drink, an appetizer, and an entree. There is also an a la carte menu. We ordered a Pinto Iced Tea (thai iced tea), crispy roll, and a chicken pad thai; and the crab fried rice in a young coconut off the regular menu. Everything was delicious and really liked their presentations! I want to go back to try their creamy mushroom soup.", "author": "Peggy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Pinto is located below ground so don't walk too fast or you might miss it! The overall atmosphere there was intimate so being there with friends or a significant other is great. Just don't have more than four people because that intimacy is lost. Anyway, the menu is tucked with your napkin which is cute. The service was quick and even if you have hearing problems (me omg. So sad), they'll repeat themselves so it's not a big deal. My friends and I ordered the satay to share and I absolutely loved the sauce that went along with it. And my order of crispy chicken pad thai was a good choice. The sauce and rice was absolutely perfect. And it's better with their version of a deconstructed / DIY Thai milk tea. The ice cubes were frozen tea with a bottle of tea, cream and a sugar solution. Absolutely perfect since I can make it with my taste buds in mind. It was a great place to just eat, chill and hang out with close friends. Highly recommended!", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Came here on a Saturday afternoon and the restaurant was pretty much empty except for two other parties, so you probably don't have to worry about waiting too long. I ordered the green curry ($14) and my friend ordered the PCU ($12) and we shared an iced tea ($6). I was a little bit hesitant about ordering the curry because I normally always get PCU, but it was pretty good! I drenched my rice with the sauce BC it was just that darn good. Only thing I have to say is that I wish there was more chicken - the proportion of veggies to meat could use some work. The iced tea was just ok for the price, but we pretty much ordered it BC it was deconstructed and wanted to try that out. Our server was super nice - checked in on us to see how we were doing and was always smiling whenever she approached us. \n\nOverall, cute place, friendly staff and good food. I probably wouldn't go out of my way to eat here, but if I was in the area, I'd stop by.", "author": "Elaine Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-07", "description": "I went here this afternoon for some lunch and they lost my card until I found it on the floor. While the woman was rude to me telling me the other waiter was busy meanwhile he lost my card. I am not impressed with my unwelcoming welcome.", "author": "Celeste K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-12", "description": "Hate to do this. Because, I am a restaurateur. Stars effect businesses. Place is beautiful, clean and at a very good location. Only reason I am giving 3 stars because staff was very attentive and friendly. So...whats the problem. This is not authentic Thai food. Thai food is something you cant fool me with. I have dine at more than 30 Thai restaurants in NYC area. My favorite is been Spicy Shallot, Jaya, Sripraphai. And I have travel to Thailand few times. I am not Thai origin. If you dont know much about Thai food this might work for you. If you read my other reviews, I give lots of 5 stars. I am not one of those yelpers who complains about everything. If the food is good , I let everything else go. And I am not a fan of when they add 20% tip automatically to the bill.\n\nOwners- Go check out above mentioned restaurants. You might learn a thing or two.", "author": "Food D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Great place. Food looks very fancy. Could use a little more seasoning but overall delicious.", "author": "Kaitlyn B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-19", "description": "Living on the block, I visit here monthly and after the last few times, it's time for a break. The food is still good, but not great. The service has been poor. Really disappointing.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-31", "description": "Why oh why can't I give zero stars instead of one?!?!\n\nNever put foot into this restaurant - called for delivery - and as a lifelong NY'er this place takes first place for inept service. Placed the order 1 hour ago -  and 1 1/2 hour later I've spent 20 minutes with a delivery man on his cell phone who had clearly delivered to the wrong address  ( trying to explain downtown Brooklyn to him - and it sounded like he was in the Bronx ) I decided to call the restaurant to cancel the order, and spent another 20 minutes speaking to one employee after another who had no idea where the delivery man was nor how to cancel an order! Amazing that they offer \"delivery\" and I don't want to imagine what the restaurant is like.", "author": "John W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "TomYum soup is delicious!!!!! We also tried the pumpkin curry and pad thai, both great choices.", "author": "Besa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "I came here over the weekend.  These guys also own a similar restaurant in the West Village.  The decor reminds me more of a cozy French bistro than a Thai place, but that does not matter.  \n\nI am a fan of their West Village location so I was happy to see this place in BK.  I had the chicken panang, which comes with rice.  The wife had chicken pad thai.  I think their panang is the best I have had although I am no expert on the subject.  The sauce is flavorful and the veggies are not mushy. The portions are a good size as well.  \n\nI like the fried potatoes with spicy mayo.  I am not sure how \"Thai\" it is but it is really tasty.  Also, definitely get the Thai iced tea.  It is $6, but it comes with condensed milk and syrup on the side and the ice cubes are also made from tea.  It is excellent.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Amazing service, staffs are very attentive and friendly, authentic Thai food! Remember to try the Pinto Thai iced tea that you can mix the cream and syrup according to your own taste!", "author": "Vilson F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-01", "description": "I was thoroughly unimpressed by this places food. I had their lunch special- ordered mushroom caps with an aioli and their vegetarian pad thai. The mushroom caps were alright, but the aioli sauce with it provided some necessary acid to an otherwise bland flavor. I really liked the texture of the mushrooms, they were cooked well, but even as a major mushroom lover, it was my favorite appetizer. However, the pad thai I think was supremely disappointing to me. The plate first of all was way too small for the food, it was kind of uncomfortable maneuvering my fork without food spilling out all over the table. But the pad thai was just so flavorless, it lacked in salt, spices, acid....I mean it was the blandest pad thai I've ever had. Everyone knows the best part of pad thai is the sauce and the kick of flavor that's imbued in the noodles and vegetables and this just fell so flat of that. \n\nI will say though that this place has A++ service. Everyone was so attentive and nice and really provided. Would normally give this place 2 stars, but the service bumped them up one.", "author": "A Sofia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "On a regular Wednesday night I was in the Dumbo with a party of 5 visiting from Italy.  It was already past 9:30pm so most places were not seating.  I called Pinto and I asked them if they were able to seat us if we got there in 5 mins.  Even though their kitchen was closing in about 15 mins, she still said yes!  We were warmly welcomed, ordered quickly, got a few beers on the spot.  We got about 6 dishes to share. and every single one of them was delicious! The Crispy Pad Thai with chicken and the Fried Rice were standouts! Service was pretty amazing considering they had to wait for us to leave before closing, never rushed us and were always super nice.  Will definitely come back!", "author": "Christian K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Excellent restaurant! Thai tea is highly highly recommended. Quiet and clean! Also lunch has excellent price!", "author": "WonYong H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "HOLY COW!!!!!! Some of the best, lightest, most divine Thai cuisine I've ever had. Typical American-Thai gets to be too heavy and bogged down with salt and extra flavors and fats, but this place is a hidden gem. My boyfriend and I went to see my brother and his wife's new apartment, Sunday dinner at Pinto, and a glass of cab afterward back at their place. We will accept any invite they provide us with to return to this yummy spot!! The service was great, presentation was nice, timely and delicious meals.... \n\nI got the basil with chicken (the most amazing thing...) Christina got the pad thai with chicken (best pad thai we've ever had), Brooks got the garlic with chicken (yummy and a little creamy, but so light!), and Steven got a curry with beef (I don't eat beef, but everyone else said it was delish) \n\nDEFINITELY RETURNING!!!!", "author": "Paige H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "I will never eat here again. I ordered the chicken wings- there was a tiny sliver of meat on each piece. It was super, heavily over fried. The pad Thai was cooked with a spice that I've never had in pad Thai and it had a horrible aftertaste- not good at all.\n\nDon't wast your money here.", "author": "Amanda S."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Pinto Restaurant", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "128 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IL20_GuuKAcXfIPattJKog/ls.jpg", "@type": "Restaurant", "telephone": "+19293377732"}