{"aggregateRating": {"reviewCount": 123, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-19", "description": "The other two reviews are highly questionable. \n\nFood: much too expensive for low quality. The pad thai was 95% flavorless noodles with a small selection of boiled wet chicken. Spice, even though it was listed as spicy, was nonexistent. Really poor. The other dishes I saw coming out had the same problem: no \"vegetables\" and only the cheep stuff. I even got home and had to make myself more food as the servings were too light. \n\nDrinks: both glasses of wine reminded me of church wine: too sweet without any other flavor of characteristics.  \n\nService: friendly. I did hear them ask for cash above credit card to the other table... which always bothers me a bit. \n\nI'm not a big Lantern fan (mostly due to the customer service issues), but will be going there next time for Thai, and to Iron Chef House for sushi.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "I use to really enjoy this place few years back guess it's now becoming redundant and the portion is getting smaller and smaller especially the rice they give you with your order , service is pretty good setting is ok nice area aww they have few better place I will only go back if I'm in the area", "author": "Jermaine I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-27", "description": "Well this is just the old Tenda Bistro but by a different name. Makes me wonder what they are hiding by renaming the place. Even the check shows the old Tenda name. \n\nService is a bit awkward, they tried to seat me at a table for 6ppl by myself. There were a bunch of four tops still available so I don't know what the rationale was for that. \n\nPoints for offering the lunch special with rolls without rice. They were actually prepared quite nicely though something was off about the flavor. The salad was on the bitter side and the soup was flavorless though. \n\nWouldn't come back with so many better sushi options in the neighborhood, but had to give it a try at least once (well twice I guess, since they tricked me into believing it was a different place than Tenda!)", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "5 stars..........We enjoyed the Malaysian curry seafood hot pot.the crispy duck is immensely.", "author": "Karson P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "Solid lunch menu, good sized rolls and efficient, friendly service. Excellent choice for Japanese/Asian food in this neighborhood.", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-25", "description": "I love sushi. A lot. If sushi was cheap I would eat it at least several times a week, but as it is, it's a treat. So when I say that I got sushi from this place and it was not delicious, but just meh, that means a lot. I am not a sushi snob either, but the fish just wasn't fresh or wasn't high quality in some way, to a significant enough extent that it didn't feel special at all to eat. I am not saying it was spoiled. Definitely not. But it tasted like prepackaged sushi from a mediocre supermarket, even though there was a nice variety of fish. Even the radish was somehow not that fresh. Nearby Sushi Gallery and Iron Chef House are a much better experience and I don't think they are more expensive. (Just to give a full picture, I'll mention that I got the lunch special so maybe they use their worst fish in that since it's cheaper.)", "author": "Aliz C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-13", "description": "Ordered thru seamless. Fast delivery. Ordered Oyako chicken don and pork katsu don. Meat is slathered in sweet sauce with frozen peas and corn over rice.  No ginger or even balance in flavors.  Pretty bad.", "author": "Tommy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "Sushi was unexpectedly fresh and tasty with very nice presentation. Service was excellent.", "author": "Jason N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-05", "description": "This place was the worst. Preventing people with groupons from sitting together. Then the hostess argued loudly when questioned with the customers. We all left. Every table. Horrible experience.", "author": "Nathan W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-03", "description": "I ate there with 2 friends on a Friday afternoon.  The food is simply bad.  We all ordered dishes with chicken.  It was so chewy and we could all swear that protein could not have been chicken.  The 3 of us did not finish our meals and had to go somewhere else to eat.\nThe service was good, thus the 2 stars rating.  \nIn a nutshell, the food taste and quality is sub-par to cheap takeout Chinese food!", "author": "Joe K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "Went for sushi: simple rolls: salmon and eel, simple prices.  Also had hot saki \u0026 plum wine.  Waitress very outgoing and well-spoken.  Sat on back patio, catching cool breeze after long walk down Promenade, then back up Piers 1 - 3.  Wonderful end to wonderful weekend!", "author": "Maisha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "Sashimi was fresh. Servers were very friendly. Sushi was good too.\nOverall was a nice place", "author": "Cyrus D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "My favorite place for sushi! The staff is extremely friendly and the service is always fast! :-)", "author": "Amy A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "Terrible sushi. Terrible service. Terrible soup. Just terrible. We walked in on a Sunday afternoon after seeing a huge sign they put outside about lunch specials and the garden dining. It was around 12:30p and we were the first customers. We asked for a seat outside and the server replied \"No it's dirty outside, it's too dirty, you can't sit there!\" She explained that maybe she could clean it but that it would take some time. We had a hungry 3 year old with us so we opted instead to sit at a booth inside. Our menus were brought over to us and then the server disappeared. After about 15 minutes I got up to find her and she was cleaning the bathroom. I waited for her to take off her gloves and I started to order the lunch specials. She stopped me stated with major attitude that the specials are for monday - saturday only. I took her outside to show her the huge sign advertising the lunch specials and she said no no no that's a mistake and blamed the delivery guy for putting up the wrong sign. Again, with an impatient 3 year old I just ordered a few sushi rolls and called it a day. No time for arguing at that point. The sushi tasted fishy and my husbands udon seafood soup was tasteless. My son seemed to enjoy his avocado peanut rolls, but everything else tasted off. Our soy sauce container was empty and again no server in sight to fill it. So I walked to another table and grabbed a different one. Overall a terrible experience. There are a ton of restaurants in the area, do yourself a favor and try anything else!", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "I love this place! It has become a regular spot for my girlfriend and I to go to. The staff is so friendly and accommodating. The Brooklyn Roll and Pineapple Fried Rice are delicious and the fried cheesecake and ice cream? Fantastic! If you're in the area, you have to go here!", "author": "Patrick L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Terrific restaurant. All the food is wonderful. The service is very friendly, especially Jenny, the manager. Try the rock shrimp tempura appetizer and the duck main course. Best duck I've ever had. The soups are great. Outdoor patio. Very moderate prices for the  excellent quality.", "author": "Stephen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-04", "description": "The sushi is fresh, the Malaysian noodle soup is spicy and flavorful (and a great remedy for a cold). The music can be a little odd - Country \u0026Western, bubble gum rock, Perry Como, new age moosh....But the main reason I choose this place regularly rather than the other sushi joints in the nabe is that they are so gracious and nice. Can't put my finger on exactly what's different, but I always feel super welcome here - and relaxed. Wandered in one tired day and Was so pleasantly surprised. It's my main lunch destination now.", "author": "Emily D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-28", "description": "It was an okay place over all. I had sushi and it was okay but my friend had the pad thai and it tasted like Chinese food instead of Thai food. On a brighter note, the service was satisfactory.", "author": "Franchesca G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "I went here for lunch. The prices are decent and so was the food.   Fast friendly service.  I had a coconut soup, which was satisfying,  pheonix roll which was made fresh and elegantly prepared.", "author": "Tariq C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-16", "description": "Staff is very sweet but the sushi rolls were mediocre. Even the spicy tuna roll was flavorless. Would not go back again.", "author": "Mare J."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Saketumi Asian Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "118 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/CoHUWHgBTlas-BrfkcKkDw/ls.jpg", "@type": "Restaurant", "telephone": "+17188558688"}