{"aggregateRating": {"reviewCount": 123, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "Nice Asian fusion restaurant in the Brooklyn Heights area. I came here to try the duck pad thai which I've never seen on a menu before. There was plenty of duck and the portion was large and very reasonably priced  ($11 for dinner).  It was on the spicier side as opposed to a sweet pad thai. The noodles were quite thin. The staff was extremely friendly and there is plenty seating. The neighborhood is fun and makes a great date night place because you can walk around afterwards.", "author": "Tony T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "As an update to my recent previous review, they CAN make the curries with soft tofu (instead of fried), and I love it! Makes me feel so much better about what I'm putting into my body.\n\nI have also had the shiitake roll, and shiitakes are one of my favorite mushrooms, so it makes my taste buds and tummy very happy to have this as well.\n\nI doubt there's much else on the menu that I can safely eat (aside from a couple of the other vegetable-only rolls), but I love both the red and yellow curries so much that I'm totally content on ordering one of those each time I go.\n\nAlso, they provide some complimentary fresh fruit at the end of the meal. It has usually been cut up oranges, but they gave us watermelon slices on the most recent visit, which was nice!", "author": "Barbara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-04", "description": "I'll preface this review with a note that I USED TO go here many times as it's close to work. That's before I lost trust in the restaurant that I wasn't being cheated. \n\nHowever, I recently went here with two others, and while the food was decent, the reason for the one-star review was the completely unacceptable way we were treated by the staff. Having chosen this restaurant for the evening as we had gotten a Groupon deal, we had fully intended to use it. Unfortunately, we found out that the staff were completely unwilling to accept it, citing reasons not included in the fine print to invalidate it (that the third person got an item not covered, even though the Groupon was for a dollar amount for two, and the other two people did get valid items OVER the dollar amount). \n\nIn short, the food is fine, but don't count on this restaurant to honor any agreements with an outside partner. As a note to management, if you're going to work with Groupon, make sure your staff knows what's in the fine print and get a manager to help if they don't. That way you won't lose customer trust.", "author": "David Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "Good fresh Sashimi for the East coast. \n\nWhite wine was served Luke warm. I like the idea of the patio in back, but was too warm to try. Only problem with this place is the lack of commitment to Sushi. They serve so many other options it is hard to understand why... Thai food and Sashimi? \n\nEither way, the Sushi is good (fresh).", "author": "Zarbrook S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "I've been enjoying eating at this restaurant for some while now, and without wanting to be too effusive, just ate a sublime meal.\n It was Thai Basil Tofu, which featured onions, peppers ('hot' and green bell), and (I think) green onion, in a super-tasty sauce. \nThe vegetables had a slightly 'flame-y' taste which I liked a lot. \nThis dish could be slightly spicy for some palettes but was just right for me. \nThe other day I had vegetables in a garlic sauce which were fresh, crunchy and yummy, and to keep it interesting, last week I had sushi for dinner, (really good salmon) and a Black Dragon roll which (almost) looked too good to eat. \nI took pictures of the roll and tonight's meal, which I'll add if I can. \nSaketumi continues to be my go-to choice whenever  I'm  even remotely near to Brooklyn.", "author": "Anne T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "I love the transformation of this restaurant from a \"Pan Asian fusion\" to a straight forward Japanese sushi bar restaurant.\n\nWe came here on a weekday for the lunch special. It was advertised that the back patio is open for diners.\n\nWe went straight to the back patio which was well put together with summer flowers and plants that compliment the restaurant's motif.\n\nThe tuna don that I selected tasted good and the fish was fresh. It was adorned with wooden boat and sake jar. It was also served with miso soup and vegetables salad with ginger dressing which is standard in any Japanese restaurant.\n\nThe staff are attentive yet unobtrusive. I was given a nibble and cold bottle of Kirin light as soon I got seated. I will definitely comeback here in the future. My only qualm is the unnecessary over adornment on my sushi plate.", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Great first experience ordering delivery from this place. I've walked by their spot on Montague St hundreds of times but never bothered to go in or order from them for some reason. \n\nRecognized the name on yelp, and decided to give them a try. Food was delivered quickly, efficiently, and most importantly, with a smile! The food all seemed prepared with care and everything tasted perfect, which is sadly a rare feat for delivery. We prolly got lucky timing-wise but so far A+++ from Jørs Trüli.", "author": "Erik P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-27", "description": "4 stars for the sushi!  I ordered a few rolls for delivery and they were really delicious.  Very interesting rolls and for a great price.  The White Snow Roll and Brooklyn Roll were my favorite. \n\nThe reason I'm giving this place 3 stars is for the chicken pad thai.  The dish didn't taste anything like the traditional pad thai that I am used to.  There were slices of somewhat slimey chicken, a few slices on green onion, minimal egg, and a little pile of peanuts.  The flavor was just off, very off!  If you are looking for great sushi (which you probably are if you are here) then go for it!", "author": "Jen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "I've gone here many times, and I have never been disappointed. I felt odd not having a review for this place. The service is incredible; the servers are very attentive and polite. The food is great too. I love the sushi, especially the salmon and sweet potato rolls. They're chicken dishes are also really tasty and reasonably priced (~$13). I will be back again.", "author": "Albert A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-09", "description": "I got a groupon for 2 but went with a group of 5, there's limitations to what you can order with the groupon, you can't use it for lunch, specialty dinner, sushi entree, bento box and anything with the word sizzling in front, ok we're fine with it but now the other 3 paying full price cannot order those neither. Does that make any sense to you? So if you have a groupon, don't go with more than 2 people.", "author": "Chon Gee C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Great little neighborhood place for Asian food. The food is very good. The staff is super attentive in a very pleasant non-intrusive way. We had the crispy duck salad- very fresh and crispy. The pad Thai with shrimp had a bit of a kick to it. It was yummy but a bit spicy which some people may not be prepared for.  We have been here a couple of times with the Groupon deal (including this time) and plan to come back again. \n\nThey also give you some refreshing slices of orange after dinner. It is such a nice touch and shows they care.", "author": "Marjorie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Great service, prices are very reasonable, food was very good (had the Thai basil dish, which is pretty spicy but was very nice) and the atmosphere was great! Would recommend!", "author": "Idan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "Okay my second review, here I go.... So you need to order or go into Saketumi for a couple of different  reasons. 1. Delivery service and or dining service is super quick (like always) 2. Delivery person or waiter/waitress is always super friendly! 3. (For delivery) They package everything up really securely and nicely. 4. The food is always super hot a fresh and delicious!!! I can honestly go on and on about this place and it is my neighborhood go to spot for the main reasons listed above.", "author": "Madison N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "I must say that this place was phenomenal. I'm always down for a \"Thai Food Outing\", and this place definitely satisfied my taste for Thai. Upon sitting, they offer a moist toilette and a glass of water. The waitress allowed us time to review the menu and then returned to ask about our beverage choices. She gave a great suggestion for Sake, and brought our drinks promptly. As shown in the pictures, the food presentation was excellent and matched the taste. We had sushi appetizer platter and also the sashimi appetizer platter, which was fresh and taste. The main courses came out in a timely fashion and the server checked on us throughout our stay. There was nothing negative about this restaurant, service, or the food. 5 stars all around!", "author": "Richard A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Don't write reviews often but had to for this place.   Excellent service.  We sat outside at first,  beautiful,  but my son got cold so the waitress happily moved us indoors.  She was very friendly.   They overheard that it was my mom's birthday and brought her out some fried cheesecake.  Oh and the food was good too! I had the Malaysian satay.  We will definitely come back next time we are in the area.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Really decilious janpanese food！Friendly staff, excellent service and super clean environment！I will definitely come back again with my friends.", "author": "Robert L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Great customer service \u0026 the food is great. The lunch specials are a good deal considering the portion provided for the bento boxes. Love the miso soup because it's not too salty yet tasteful.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "A nice place for sushi in Brooklyn Heights. Very attentive service (they even give you warm hand wipes when you walk in) and the presentation of the food is impressive. I ordered the Monkey Roll special which was definitely picture worthy. It's also nice that they bring out a plate of fruit at the end of the meal.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "When I need a great lunch this is where I order from. Their lunch specials are amazing, especially the bento box-it's a great deal! Their prices are right and it's a filling meal. You would think that because they serve a variety of asian foods that they might not taste good, but everything I've had here has been good.\n\nI would highly recommend the teriyaki bento box for lunch, comes with shumai, two pieces of california roll, a salad and a soup. The teriyaki itself comes with great portion of vegetables too. Also, I can never finish the rice. Where else can you get all this for 8.50?!", "author": "Diane L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "I took my family here for dinner one night and everyone liked it so much that we came back again just yesterday for my sister's birthday, who is a big fun of their sushi. I like their stir-friend udon and soba with beef and shrimp a lot as well. We will be coming back since it's not too far away and we are always able to get seats for the 7 of us.", "author": "Brietta Y."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Saketumi Asian Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "118 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/CoHUWHgBTlas-BrfkcKkDw/ls.jpg", "@type": "Restaurant", "telephone": "+17188558688"}