{"aggregateRating": {"reviewCount": 123, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "Absolutely loved their Malaysian curry noodle soup! It was on the spicy side but very rich in flavor and had plenty of meat.\nThe staff is always friendly, attentive and non obtrusive. I went during the happy hour(4-7) and the beer was very inexpensive and great. Will definitely come back to the peaceful backyard and delicious meal at Saketumi!", "author": "Vladimir R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Went to Saketumi for lunch with my family. I'm not a big Sushi fan but my kids love Sushi. This is the place to go in Brooklyn Heights. The food is good, the service is great. A plus restaurant. The place is clean and food is priced right.", "author": "Jim M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Nice and cozy place, service is excellent!!\nSushi was great and udon dish as well.\nVery nice stuff and good atmosphere.\nPlace worth visiting.", "author": "Oren T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "First of all the service was outstanding. We been sitting outside in the backyard on a hot day and they came by several times to ensure that we are feeling good. They brought is cold tissues and iced water was there in no time. The food was even better. I hade the dinner bento box for just 18$. Big portion and you get as well a miso soup and a salad. My friend had the sesame sea wheat salad and the miso tuna. Everything was just delicious.", "author": "Christoph D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "Wow some of the BEST sushi I have ever had! The service was quick, the food delicious and the price VERY REASONABLE!!!!", "author": "Amy V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-05", "description": "Somehow, I'm the odd man out here.  I ordered a humble container of chicken pad thai and took just a very few fork-fills, feeling famished and hopeful, and put my fork down.  It did the job!  It killed my appetite such that I was no longer hungry. Out it went into the \"wet\" garbage.  Just simply inedible.", "author": "perry w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "It's all about the sashimi. Again, Brooklyn did not disappoint. So far, this area has pretty good Japanese restaurants. I've been to three of them and they are all excellent. The highlight of the meal was the sashimi. It was all fresh and delicious. The seafood salad was pretty good. It was made with a perfect hint of mayonnaise.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Good quality fish, fresh free tea while I wait, very reasonable prices- excellent. My go-to sushi spot in the area.", "author": "Henry I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "I tried to order a Bento box as I did before on Seamless. They do not indicate a time for when the lunch special is over on Seamless and on their website. I don't know who I spoke with but I told her I was online at 3:25 trying to purchase the Bento box as I have purchased the Bento box from them before. \n\nShe explained to me there is nothing she can do \"If it won't let you order online then it's over\" are her exact words. I explained to her that their own website does not give a time for when the  lunch special is over, it could have been 3pm or 3:30pm. There is no indication. All she said was that \"there is nothing I can do\". I'm sure she could have done something. This would have been my second time ordering from them. Hopefully, she actually speaks to her manager to possibly put a start-end time for the lunch special. Smh. food is good, but in terms of the professional service, it wasn't pleasant. Some lunch specials go until 3, 3:30 or 4pm. There were no indications of the lunch special time. But she tries to get me to purchase a Bento for $18. No, thanks Ms.", "author": "Shanice T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "Its a casual place with blue lighting but it has great food and great service. The two waitresses seem to know most of the neighborhood customers already and even have a respectful yet friendly tone when taking down phone orders.\nIts more of a Pan-Asian place than it is for sushi but they make great dishes and they come out fast but still with quality. You never feel ignored and you don't have to break the bank to get full. Definitely a place I keep in my back pocket.", "author": "Jeff B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-28", "description": "Ordered lunch for delivery, food came quick but my sushi was a bit warm. I had to put it in the fridge for a while but it did taste very good. I also got charged for extra crunch but there wasn't any crunch in my roll. Might not be so eager to order from here again....", "author": "zeina h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "Will try again, the food was decent the service OK nothing really great or memorable but nothing that made me not want to come back and give another shot not even the mouse that was in the back patio...apparently that's just NY for you lol", "author": "Miss D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "Excellent service but the food lacks a lot of flavor", "author": "Danielle J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "So happy to have found this place on our walk around Brooklyn heights. Food was good priced and SO FRESH. The summer roll was particularly good and the sushi was great. I heard that there's a wonderful back patio looking forward to sitting there next time!", "author": "Abby M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-02", "description": "I came here Saturday for lunch. Found this place on yelp due to my normal sushi spot not being open yet. A group of classmates/friends and I decided to order take out. The person who took our order recommended we sit in their back patio and wait. We were glad we did, it was nice and calm in the back. A few of us even ordered wine while we talked and waited.", "author": "Lola O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Place is amazing. Great food great environment. Awesome back yard are. Come here all the time!", "author": "Rony C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-09", "description": "I put in an order from Seamless, and while the delivery was fast and the food was decent, the delivery person was very rude. He assumed I'm Chinese and told me in Chinese that they were close to closing time and that he was doing me a huge favor by delivering my order. But they were open when I put in my order, and I tipped him. I don't understand the need for this level of unprovoked aggression when he should just be doing his job.", "author": "Julia Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "I just want to say, this restaurant is my absolute favorite takeout restaurant ever!!! I've ordered from them on seamless 6 times so far and they've never failed to impress me with their fresh tasty foods, quantity of food, fair price, and the lightening fast delivery!!! I highly recommend this restaurant!! :)", "author": "L. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Went with family visiting from out of town.  It was a great, food was good especially the Indian pancake with curry sauce.  I plan on coming back for more.", "author": "Tanisha L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-26", "description": "OK, so Saketumi is just OK. You've had better, you've had worse. My negative experience was all about a Groupon deal that I purchased. $15 for $30. Very basic, right? That was until I tried to pay, and was informed that I couldn't use it to pay because I guess I'd ordered some sashimi or something. Now, I've been around the Groupon rodeo, and generally if something isn't included they'd just say so, or even she could've put that individual item on another check (because we still ended up spending $70), but she proceeded to argue with me for 10 minutes about why she wouldn't take it. I wouldn't stand for being hustled, and when I asked to speak with a manager, she went ahead and took it. These places really, REALLY shouldn't do Groupons if they're going to try to hustle or shame people out of using them. It was a very negative experience, and for that I won't be returning.", "author": "Robert S."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Saketumi Asian Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "118 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/CoHUWHgBTlas-BrfkcKkDw/ls.jpg", "@type": "Restaurant", "telephone": "+17188558688"}