{"aggregateRating": {"reviewCount": 123, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "Not bad at all! In the past I frequented iron chef- it was so wonderful in the beginning (2010) but something happened.. I dunno... then I switched to KI sushi, which is delish if you eat there- but just ok for delivery \u0026 kinda pricey for just lunch... enter Saketumi- I think this is my new \"sushi lunch\" spot. Good \u0026 reasonable", "author": "E B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Yum yum yum yum yum come for their lunch specials (they have it even on a Saturday!). I always get the Chirashi and it makes me happy every time. I've both eaten at the store itself and ordered delivery from them numerous times. The Chirashi is extremely affordable and always comes out delicious (I could probably eat it every week and not get tired of it) , but the stir-frys are average (still not bad). The curry is yummy but I wished the meat/veggies in it had more of the curry flavor!\n\nThe staff is always very friendly too and once I ordered pick-up and they called to confirm that I had meant to order pick-up instead of delivery in case I had accidentally clicked it wrongly, and I definitely appreciated the gesture!", "author": "Andrea N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "I pray this place stays open forever. It's in a beautiful neighborhood (Montague street is walkable to best views of Brooklyn bridge and park and has worlds first haagendasz). Its lunch specials are the best of any sushi place (3 specialty rolls like dragon roll for less than 15). All of their food over the course of a year that I've had has always been very fresh (number one priority with raw seafood). Service is stellar and they will treat you like a regular and rememebr your likes after only a few visits. Outside is a courtyard area and you can even plug your phone/laptop. You should definitely go. Especially between June and August since the students are on vacation, the place becomes extra zen - perfect for business lunch or catch up with friends or lunch by yourself when no one will bother you.", "author": "Evelyn D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "This is like another fusion bistro. The lunch special is pretty good. But the food is ok it's not great or bad.", "author": "Ferdous A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-23", "description": "I've ordered takeout from them a few times and their summer rolls are great and their sushi is good. The staff is friendly. I also placed delivery orders and they were punctual.", "author": "Jules W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "This is the best tasting sushi rice I've had in a while.  The fish was fresh and the price was perfect.  Not to mention it comes with soup and salad.  Prepared quickly, staff was extremely kind.  An awesome meal!!", "author": "Ali W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "My favorite lunch spot. You get the best of both worlds here. Sushi or Thai they are all great. Love the shrimp gyoza, duck roll, and the calamari. The sauce is so good. My lunch order Thai style spicy sauce shrimp with broccoli. The pepper is so flavorful. There is never a long wait time. Friendly and fast wait staff. They also do not use peanut oil for those who are allergic.", "author": "C C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "This was my first visit here.  The sushi was perfect with just the right amount of rice.  They have lots of unique rolls and the fish is very fresh.", "author": "Alyssa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-15", "description": "Really good value for the money. I've come in for their lunch special a few times, and was pleasantly surprised by the quality each time.", "author": "Nastassia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Nice selection of Asian food and sushi. I like the sushi here in general and the miso tuna with steamed vegetables - it's a very tasty light option", "author": "Joerg D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Great for a quick weekday lunch if you work in the area! They have great weekday lunches. I highly recommend the bento box or sushi specials. Don't forget to check-in for 10% off your first visit!", "author": "Mikaela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "I've been here a couple times and honestly amazed at how amazing this place is. Their sushi/sashimi is fresh and their chicken teriyaki is on point. Chicken teriyaki is one of those generic items that every place has and it's hard to mess up but it's also hard to be memorable- think of the best chicken teriyaki you've ever had, does anything come to mind? This is the best chicken teriyaki I've had. I've also tried their fried green tea ice cream and it's delicious! On the outside this place looks like a hole in the wall, but it's actually pretty spacious and has a lovely outside area that's perfect for when the weather is nice. Prices are reasonable for the quality of food and the area. I will most definitely be back!", "author": "Antonia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Sushi was delivered in 10 min and it was super fresh and delicious. I've generally made the opposite experience in New York, so I really appreciate it. Thank you!", "author": "Leon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "This is by far one of the best Thai food restaurants that I have been to in the Brooklyn Heights area! On the two occasions that I have been there, I used a groupon deal ($30 worth of food).\n\nThe first time I went, I ate the pad thai dish. Very tasty! The second time that I went, I ordered the Thai Basil dish with shrimp and white rice. It had amazing flavor. The only complaint that I have about this dish is that it was quite spicy. However, if you enjoy spicy food, this is the dish for you.\n\nAnother great thing about this place is the service. They greet you at the table with warm hand towels to clean your hands, and they ended the meal with a serving of fruit. I would definitely be returning to try other dishes on the menu.\n\n*SN: Keep in mind that if you decide to use their groupon, there are certain selections that are not included with the deal. Also I managed to get the groupon deal for only $.75!!!", "author": "Jessica J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-09", "description": "3.5 Stars\n\nAte here Sept 2016 for dinner. Nice cozy place by Montague St. Decent size and seating. They also have a backyard but not very scenic unless you consider NYC apartments scenic.\n\nTL;DR\nOverall (3.5 stars): A nice quiet spot in a crowded Montague St. where restaurants can get lost. Although it may not be unique or eye catching, the food is good enough to warrant a second visit. \n\nService (1 star): The waitress greeted us immediately upon entrance and asked us if we'd like to sit indoors or outdoors. She was attentive and prompt with our orders.\n\nMenu (1 star): The menu is extensive, it was your typical sushi menu plus your Thai and Chinese entrees. Nothing really special. They had variety of alcoholic drinks (beer and wine but no cocktails). \n\nPricing (0.5 stars): The prices were a bit high but I'm guessing that's because of the location. Your speciality rolls were around $10-20. While your basic roles were $4-10.\n\nPresentation/Atmosphere (0.5 star): The place is not too big but not small either. They have a backyard, which could be refreshing during the warmer seasons. The plating was surprisingly pretty. Seemed like they wanted you to visually enjoy the food as much as gastronomically. \n\nTaste (0.5 star): I wasn't blown away although the Black Dragon roll was amazing! The rest of our food was good. We had some special rolls and appetizers all of which were ordinarily good. \n\n\nBill:\nAppetizer: Fried calamari - $10\nEntree: 3 Special rolls - $45\nDrinks: wine, Resiling - $28\nGratuity: $15\nGroupon: -30$\nTaxes: $$$\n\nTotal amount spent $75.\n\nWe used a groupon for our meal so not all the items were available however only few were excluded off the menus like the sizzlers and dinner specials so you didn't miss out much.\n\nEnjoy!", "author": "Rey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Was roaming around Downtown Brooklyn and I stumbled upon this little gem. I immediately loved their lunch specials menu and decided to give it a try! So glad I did because I have never had such fresh and perfectly cooked General Tso's Chicken until I entered this place. The portion size was suitable for my hungry belly and the broccoli was not too soft, not too hard, just right! Moreover, the staff is kind and attends to your needs, not only just your server.The aura of the place was quite relaxing and casual, something I did not feel at another nearby sushi place. I would definitely come back to taste the sushi!", "author": "Steffi J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "The restaurant worked with our 7-person party and sat us outside on the terrace in the back - we were lucky to have a great spring evening.  The service was great and we really enjoyed the pan Asian meal.  We did the full thing with apps, entrees, and sake.  Just a great experience overall - thanks!", "author": "Jim T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "OMG.....this Asian bistro restaurant is pretty good.the brooklyn roll and basil chicken is my favorite .the staff are so friendly and polite.........highly recommend this place..........", "author": "Jay L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-20", "description": "Saketumi was exactly a-ok in my book.  I was staying in FiDi on a work trip and wanted to find a decent Japanese place nearby that wouldn't cost a ridiculous amount.  Saketumi is in the adorable neighborhood of Brooklyn Heights that is a 4 minute train ride from downtown and transports you from the hustle and bustle (and dirt and crowds) of the Wall Street area into a lovely little homey area where people know each other on the street while walking their dogs and children.\n\nThe restaurant was empty on a Monday night when I ventured in but I was seated quickly and had the place to myself.  The atmosphere is exactly what you would expect from a reasonably priced, regular Japanese/Asian restaurant - calm, dim, and casual.  The prices are extremely reasonable and the $18.95 dinner bento is a steal considering how much food you get.  But nothing really blew me away as exceptional or memorable.\n\nI ordered the spicy salmon roll as well as the dinner bento with tempura and nigiri (you get to pick 2 from a list of entree items).  The spicy salmon was chopped salmon mixed with spicy mayo and did not taste the freshest.  There was a slightly fishy aftertaste that was a bit of a turnoff.  The miso soup and ginger salad were pretty standard.  The bento came with a side of rice, a very healthy serving of shrimp and vegetable tempura, 4 pieces of nigiri (appeared to be tuna, salmon, yellowtail, and I think seabass or hirame), a full California roll, pieces of shumai, and an ika (squid) item that I didn't try (not an ika fan).  The tempura was huge but way too much batter for me.  It was painful to try and get through one long shrimp piece as the thickness of the tempura batter hid the actual shrimp and I was full before I made it halfway through.  Everything else was pretty much on point but again, not exceptional.  The nigiri was fresh enough and tasty.  Service was friendly and prompt and the waitress was kind enough to tell me I was ordering too much food when I originally thought 2 rolls plus a bento box would be good (I was starving!).\n\nOverall, I'd say the food is pretty good considering the very reasonable price point.  If you want sushi that is fresh enough and edible and relatively inexpensive, Saketumi will serve that function just fine.  I think the backyard seating is probably an added atmosphere bonus on warmer days.  I'll definitely be back to Brooklyn Heights, but may try a few of the other nearby sushi stops as well to compare.", "author": "Amoli P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "I liked their Malaysian curry noodle soup with chicken and Malaysian flat rice noodles with duck. The service was very attentive and the complimentary cantaloupe at the end of the meal was a nice treat. Next time I want to see if they'll leave out the straw in the water glass if I ask.", "author": "Sandra K."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Saketumi Asian Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "118 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/CoHUWHgBTlas-BrfkcKkDw/ls.jpg", "@type": "Restaurant", "telephone": "+17188558688"}