{"aggregateRating": {"reviewCount": 123, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Excellent sushi place in Montague Street! They have a beautiful and quiet little courtyard at the back, which is the ideal spot to relax in the summer. The service is very friendly and attentive, and the food is delicious. The waitress went out and beyond to ensure that my special requests were taken up appropriately in the kitchen. And the owner came out multiple times to check that we were happy. I particularly liked the nice gesture of bringing us some sweet oranges as little treats before giving us the check.", "author": "Julia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-13", "description": "I came here twice. The first time I got the mango chicken lunch which came with soup or salad. I got the miso soup which was okay. The entree itself I didn't really like because it didn't mention it would have bell peppers and onions and I'm not really a fan of that plus the mango was kind of hard. I like it better when the fruit in the entrees such as mango and pineapple to be a little softer and more \"cooked\". \n\nI also ordered the thai iced tea which I didn't order the second time because it wasn't sweet and tasted watery so I didn't wanna spend $3.50 on something I didn't like very much again. \n\nI decided to give this place another chance and ordered the pad thai chicken which i ended up loving. It was perfectly flavored and the chicken was very nice. I also got a side of the sweet and sour sauce which they charge $1 for. I honestly think they shouldn't charge for sauce because I feel like the dishes need the extra sauce anyway. But overall I would probably return again because some of their entrees are very delicious.", "author": "Shabnam D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-14", "description": "Presentation - I got Hawaiian pineapple friend rice with chicken for $12, the presentation looks amazing and the smell is making me hungry.\n\nTaste test -Hmm now the rice is very light and fluffy I have no idea what type of oil they used but the rice isn't oily at all. The chicken is gently sauteed and the cashews and raising are gently cooked as well. Super soft and very tasty. \n\nOverall thoughts - NYC itself is full of hidden gems and this place is no exception, the location is easy to get to and from is awesome\nI give this place a solid 9/10 for price, taste and presentation. The sushi is also very good and they give full portions here.", "author": "Da Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Asian fusion restaurant with some really delicious and flavorful food. \nGreat servers, reasonable prices and fast service.", "author": "Niv P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Yummy is all I can say! We came across this restaurant while staying at a friends in Brooklyn. It is delicious. Excellent lunch specials. The kids had spicy tuna roll and a side of rice. We shared the shrimp dumplings.  They are to die for!  The spicy tuna roll was excellent. \n\nAll the servers are extremely friendly.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "Last night we celebrated here my daughter turning 2.5 years old. This is our favorite neighborhood place. The food is terrific!!! My favorites are naruto roll, rainbow roll, and their sashimi (but the menu is extensive and while I have been here many times I'm yet to try even half of it!) Now, what makes this place special to my family? The staff!!! Every single person who works there is kind and attentive. You feel right at home. My complements to the owner!", "author": "Blue S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-21", "description": "Great lunch special deals and wide selection of Asian options from American Chinese and sushi classics to Malaysian curry. The lunch bento is definitely a good deal though - for less than $10 you can get a choice of main (ex. Teriyaki, tempura or katsu) with California roll, salad, miso soup, and fried shumai. Definitely a good place for quantity and value, just not the best in terms of quality and authenticity.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-23", "description": "ANYTHING ELSE IS GOOD EXCEPT FOR THE KATSUDON. I came here because I've gotten their food delivered a few times and it was good. Sushi is excellent for the price point. I had an op to visit and tried their sushi and katsudon. The sushi was great but the katsu-don was probably the most mystifying thing I've ever tasted. The egg was separate from the fried pork and not even scrambled. The fried pork tasted mushy and was very thin. And the sauce was too sweet to a point it felt like syrup. This is really not the katsudon I know and love. I would be okay with this level of fusion if it tasted good, but it really didn't work. However, I would recommend this place for its other menu items. The katsudon just wasn't working for me.", "author": "Ruby C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Saketumi is an Asian generalist restaurant, with dishes hailing from China, Thailand and Japan. They're pretty nifty with all three!\n\nI ordered the Thai Basil Filet Mignon, and it was truly something else! Although, technically, that's because it wasn't Filet Mignon. The flavoring was wonderful, and the beef was so tender. The portion was hefty, all around recommend.", "author": "Ke W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "Really good food, with strong customer service.\n\nI go here so much, I am on a first name basis with the staff. \n\nGreat price, speedy service, outdoor seating when the weather is nice out, and cleanly. \n\nWhenever I can spare the hour to be out of the office for lunch, I make it my business to come here. \n\nTry the salmon teriyaki, it's great!", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "New to the area, today myself and my husband thought we would give this place a try. All of the food was lovely and the staff were really nice. Will become one of our regular places I reckon. Nice little outdoor area out the back.", "author": "Nik W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-19", "description": "Do you like your Thai food topped with a cherry? If yes, then this is the place for you. I frequent the area but only stumbled upon this place recently late on a Friday night. We opted to sit outside in the open area in the back.\n\nThe staff was really nice. They explained everything to those in the party who was familiar even though they were minutes away from closing. I only had calamari which I was thick ring style and cooked to my liking. Those who ordered the sushi were not too pleased but the fried rice was received much better. \n\nThis is cool place but didn't quite stand out among the tons of Thai places in the Brooklyn Heights area.", "author": "Cassie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "This is my favorite sushi restaurant EVER! I love coming here with friends. The fish is always fresh and delicious. I usually get the lunch special with two rolls and side salad. The staff here is fantastic, very kind and attentive. There are many sushi restaurants in the area, but Saketumi is my go to! (They also have outdoor seating on the back patio)", "author": "Christina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Came here for dinner last night with a friend. I used to live in Brooklyn Heights so it was nice to dine in my old neighborhood.\nSaketumi is nestled between old standbys; Lassen and Henning and Kiehls. My friend also used to live in this neighborhood and often took takeout from Saketumi.\nIt's a small restaurant with a big menu. They do have a happy hour from 4-7pm with sake and assorted beers on the menu.\nWe both were in the mood for sushi and sharing some apps. They have a nice selection of popular rolls and specialty ones. There is a bento box dinner for $18.95 that comes with soup, salad and entree with nice selections to choose from like chicken teriyaki or Katsu.( lunch bento is $9.95)\nI love rock shrimp tempura and have had it prepared different ways, my fave is at Fushimi. There they prepare it popcorn size with sesame coated on top. Saketumi prepares it with whole shrimp lightly coated with uzu sauce on top and spring mix type greens on the bottom. It was nicely prepared but I like the sauce to be similar to sesame shrimp style: carmelized.\nOur next dishes were sushi. We both ordered the lobster sushi which was tasty but hard to eat with chopsticks. My friend practically used her hands as utensils. My California Roll was fresh and delicious.\nWe still were a bit hungry and wanted to share another app. I wanted the Hawaiian fried rice with pineapple and raisins, carrots etc. My friend was not enthused so we ordered the Chicken Katsu which is lightly fried and served with either white or brown rice. We both couldn't agree on which rice so our server brought both. The chicken was fried lightly and served with a nice plum sauce.\nThe ambience is nice and I could tell the local Brooklyn Heights customers dining.\nThe hot tea served complimentary was great for a cold night.\nThe only hiccup was showing my 10% off Yelp coupon for checking in: the waitress questioned it and finally her colleague said something in Chinese to her( its legit?) and she honored it.", "author": "Fawn G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-27", "description": "The food was okay. The service was good, the place was nice, and I had good company. But in the end, the food was just okay. I got vegetable green curry, and it was not great.", "author": "Forhad C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-03", "description": "I had a volcano appetizer that was amazing! Definitely recommend It. Loved the little cleansing towels before you eat, nice little touch. There main entree was ok. Really wasn't pleased with the flavor. It tasted like overly processed meat. Not a fan.", "author": "Jacie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-19", "description": "Seems like a typically quiet neighborhood sushi place. The whole experience was great because the staff is awesome! Super friendly and accommodating for our large group. Overall, food is great. Just note it's beer and wine only. They were running weekday happy hour with beer and sake.", "author": "Genisa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "The food comes hot and it comes fast! The service is amazing! I definitely plan on coming back and trying a different meal. I had the thai eggplant w/ chicken/white rice. My wife had the Hawaiian pineapple fried rice and it was exceptional! The service is so good I'm actually still eating at this moment, I just had to stop and give this place its props! 5 stars!", "author": "Quwon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Excellent service. Everyone here is so hospitable. The outdoor seating has a great vibe. The food is equisite and with so much variety. The malaysian noodle soup is a must try!", "author": "Anthony J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "I was actually pleasantly surprised by my lunch options at this restaurant. I could opt for Thai, sushi, etc. The patio in the back with umbrellas is the best because inside it's dark.\n\nI opted for the sushi lunch and learned they have a special roll lunch and a regular roll lunch. It's the first time I had the special rolls for the regular price. This is not usually an option for most places.\n\nBonus: this place does Yelp cash back.", "author": "Urszula P."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Saketumi Asian Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "118 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/CoHUWHgBTlas-BrfkcKkDw/ls.jpg", "@type": "Restaurant", "telephone": "+17188558688"}