{"aggregateRating": {"reviewCount": 123, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "Cute atmosphere. Had the bento box and chocolate tempura ice cream. Bento box was great. Beef and chicken teriyaki were awesome. Chocolate tempura ice cream was great as well. Would definitely recommend this place for others for some quiet time and great food.", "author": "Pinny M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "I think you should take some business ethic courses as you and your staff are clueless on how to mind your own business. REMEMBER CUSTOMER IS ALWAYS RIGHT . ALSO WHY DONT U ASK YOUR STAFF WHY ARE THEY TALKING ABOUT OTHER PEOPLES AFFAIRS AS THEY have no right . ALSO your food's flavor  is wanting . The pad Thai has a burnt after taste that is really revolting.  Start with that as your place is will never prosper due to poor cooking techniques.", "author": "Hans Albert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Great food, very fast delivery.\nTheir lunch special is awesome and there are a lot of choices of specials.\nHighly recommend!", "author": "Lauren J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "This is my girlfriend and I favorite sushi spot. We live in willamsburg but often make the trip to this place because there's no other sushi restaurant like this one. The staff here are amazing, super kind and great service skills. The food is always amazing there has not been anything I had and did not like , scratch that DID NOT LOVE! I highly recommend this place to anyone reading this I promise they will not disappoint.", "author": "Julian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "Great service and good food. The sushi is quality and the Thai food is great. Good spot for lunch.", "author": "Jay C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "Really enjoyed my first time here last weekend. Food was tasty with bold flavors. The service was even better!! It's hard to come by restaurants that treat customers so warmly and appreciatively. Would highly recommend.", "author": "Joseph P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I adore this cute place. The food is wonderful and the waitresses are darlings! My favorite item is the Naruto roll which I only recently discovered. It's refreshing, and yummy but everything I have ordered here is delicious. My husband raves about the shumai (I don't like shrimp so I wouldn't know). Two enthusiastic thumbs up!!!", "author": "Suzanne R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "This place was amazing!! I absolutely love Montague street and all the ambiance of it all. The restaurant is small and cozy. The service was great. I ordered the volcano and some roll. Both very delicious, fresh and filling. I would absolutely come here again. They have a really extensive menu to choose from of not just sushi. I personally would just come back here for the sushi. I thought it was great!", "author": "Heather S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Been here so many times. Always deliver the freshest rolls . I should've Taken pictures but I didn't use yelp only units recently.", "author": "Bryant W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "The salmon skin salad did not disappoint, the unctuous salmon skin was plentiful and delightful. The desert, tempura fried cheesecake was scintillating! The rainbow roll was also quite delicious!", "author": "Tonia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "The first time I visited Saketumi Asian Bistro, I had a Groupon voucher in hand (50% off 30$ worth of food ^-^) ! \n\n~ What we ordered ~\nManhattan Roll : 4/5\nShrimp Tempura Roll : 5/5\nCalifornia Roll : 4.5/5\nEel Roll : 5/5\nIndian Pancake Appetizer w/ Curry Chicken Dip : 5/5 (It's so gooddd, could use a bigger portion of the pancake though)\n\nThe staff were also very friendly and helpful ! I forgot to bring extra cash on me and only had a debit card to pay after taxes which was around 2$ and there was a minimum but the lovely cashier let me pay anyway :) \n\nOverall, definitely give Saketumi a go if you're craving Asian cuisine and are in the Brooklyn Heights and Court Street area :)", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "Great place to go to right by the piers. Good food, quiet, and there's outside seating. It's a relaxed thai/sushi place. I'm a fan!", "author": "Yeimy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-18", "description": "If there were no other sushi places around the area and this was the only option, only then would i order from here. I was charged for ordering online meanwhile at the restaurant, prices were much much lower. The eel and avocado roll was unacceptable. Countless bones were still in the fish, which was more sauce than actual eel that i paid for. I couldnt take more than a bite. Disappointed. \n\n--JASONJASONJASON", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "Been there only once, it was a special day because I haven't been to the neighborhood for over last 10 years, where I once lived. I tried to go back to my old places but most were closed or changed so I picked this one up. \n\nWeekday early dinner time, it was almost empty but the hostess was quite friendly and the food a O.K. (some noodle with shrimp, I guess). I would come back here.", "author": "Noa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "I've been here twice and both meals have been good. I would characterize this restaurant as a solid go-to neighborhood spot. For those of you trying to save some money, take advantage of the great deal they offer on Groupon.\n\nWhat I like about Saketumi is that the food is good, the service is excellent and the place feels comfortable. On our second time there, we had the crispy duck salad, the rainbow roll and pad thai. All three dishes were good. Our waitress was super attentive and, as an example, she refilled our hot tea four or five times during the meal. The food was served pretty quickly.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Great! Quick! Reliable! Been coming here for lunch for years and have never ever been disappointed. Is it a high end joint? By no means. But does it deliver fresh quick and delicious sushi? Absolutely. The word I use over and over here is \"reliability\" and honestly what more do you need from your fave lunch spot? Saketumi is not one of those hit-or-miss places- it always delivers consistently good food. The service is very friendly and efficient- the people working here are so hard working and nice! Great place!", "author": "nina s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "This review is for dine in.\n$30 groupon bought us a tasty and crispy (AND BEAUTIFUL) rock shrimp tempura, 2 warm bowls of Malaysian beef noodle soups and sweet little oranges . Awesome find in brooklyn heights for solid Asian fusion !", "author": "Amy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Service is excellent. I love Jenny. She makes me feel so welcomed when I come to eat here alone. I love their curry, yaki soba, and appetizers. You can always grab a seat during their business hours. They always present their food very well. Love the orange for desert.", "author": "Carolyn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "This is the only restaurant I will go. There have a good service and the food is delicious. And they have back yard open，I was there at night time，sitting on the back yard. It was amazing！ Highly recommend！", "author": "Tingxin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "I've ordered up from here a couple times now, and every time has been a great experience. I usually get a bunch of special rolls and Thai food, and they are ready for pickup within just 10 minutes. They are also very pleasant and polite over the phone, which is unheard of for these places. They actually spoke English, and I didn't need to repeat my order over and over, AND the order was completely correct.\n\nHere are some of the great special rolls and Thai food I've tried:\n\n\n- Play boy roll.                            - duck pai Thai \n- VCR Roll                                  - Thai red snapper\n- Dragon Roll                              -  curry noodle soup\n- spice scallop roll.                     - crispy duck\n- spicy girl roll\n- lobster tempura roll\n- Brooklyn Roll \n\nThey also actually put in the extra effort of giving you a package of fruit for dessert with your order, including pineapple, oranges and cantaloupe.\n\nGood quality food at decent prices with fast, friendly service. I will definitely be ordering up from here again in the future .", "author": "jayden l."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Saketumi Asian Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "118 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/CoHUWHgBTlas-BrfkcKkDw/ls.jpg", "@type": "Restaurant", "telephone": "+17188558688"}