{"aggregateRating": {"reviewCount": 71, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Their food is excellent, I've been eating here for years. Hands down best Latin food in the area! Viva Los Papis.", "author": "Jeneen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-30", "description": "Solid spot to pick up lunch in DUMBO! It's located a block from Jay St so it's easy to miss but very close to everything. \n\nThere's a range of platter options - choose a meat, rice/beans, and add avocado or plantains if you'd like. You can also get sandwiches and burgers - the Cuban looks great. \n\nI tried the roast pork platter. It was flavorful and juicy. On top of yellow rice and black beans - very moist and delicious together. It's topped with onions, cilantro, and hot sauce if you want. The plantains were perfectly browned and yummy. \n\nIt's cash only but not expensive!", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-30", "description": "Crisp, substantial, differing parts of pig meat to fat ratio is generous, distinct slather is yellow mustard and butter pickles. What you read is true. Raffy (isodoro) has made a solid cubano for 34 years now. Nom nom.", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "I must say that this is one of the best Spanish places I've ever had food at. The people are nice, the food is delicious and you get SO much food for such a great price! I ordered beef stew over yellow rice and black beans. The nice man gave me a buttered roll on the side too! The food was packed to the brim and I was only charged $8. For dumbo, that is an amazing price! They have quesadillas, American sandwiches, breakfast and soup options. This has become my go-to spot for lunch now since I work 5 minutes away. Definitely recommend!", "author": "Alice X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "A Rough Timeline of Lunch at Los Papi's.\n\n1:17 pm: \"Un cubano, por favor. Gracias.\" \n\nThis sentence pretty much exhausts your Spanish (if it's like mine), and luckily it's all you need at Los Papi's. Because the cubano is (1) SERIOUS, and (2) definitely enough. For whatever it is you want it for. Lunch, dinner, feeding a family of four, etc. \n\n1:20 pm: The guy behind the counter carefully selects pernil (think pulled pork, Dominican style; if you don't know, now you know) from the tray, as he (and you) wants a nice mixture of slow roasted meat, unctuous fat, and crispy skin. \n\n1:21 pm: The pork is chopped up and stuffed it into your Cuban bread that's layered with ham, cheese, mustard and pickles. This sandwich then goes on the plancha, which brings it all together, even if it doesn't do much to flatten the thing. \n\n1:27 pm: You are handed your cubano, you snap a photo for your Yelp friends, and contemplate the existential question of whether or not there can be too much pork on a Cuban sandwich. You stop contemplating to rejoice at your first bite. And the second, and all subsequent bites.\n\n1:30 pm: You decide the only thing wrong with the sandwich is that it needs more pickles to cut through the fatty meat. When asked, the counter guy gives you a mountain of pickles. You want to explain that's too many, but your Spanish is poor so you just shut up and eat all the pickles. \n\n1:39 pm: Halfway through, you briefly consider stopping, and realize that's ridiculous. You also spy the huge plates of all the things people are getting as lunch specials, and realize you might have to become a regular here.\n\n1:47 pm: 3/4 of the way through, you seriously regret not having stopped halfway through, but you've gone too far to turn back now. You finish the sandwich, which was definitely ill-advised.\n\n2:25 pm: Unable to keep your eyes open, you nap. There is no hope of resistance.\n\n3:47 pm: You wake up to phone calls and e-mails about the meeting you missed. \n\n3:48 pm: You want to regret the cubano, but it's impossible. Even if you lose your job. \n\n11:47 pm: You go to bed. For the first time in your life, you missed dinner, and didn't even think about it once. \n\nFin.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "I found Los Papi's after Yelping for \"cheap lunch nearby.\" The reviews of the Cuban sandwich were unanimously exceptional, but I had some hesitation due to the location of the restaurant. If you're not familiar with the area, the restaurant is basically sandwiched (no pun intended) between Dumbo and Downtown Brooklyn. If you're walking down Gold Street, be aware that you will encounter a street littered with trash, baby diapers, dog shit, and syringes. Never mind how sketchy this walk can be, I still pursued my quest for the alleged best Cuban sandwich in this neck of the woods. \n\nAfter a somewhat grueling walk through the armpit of Brooklyn, I found myself in a homey diner-like restaurant with warm basins of beef steak, baked chicken, pernil, rice, salad, shrimp, and beans. With so many options that laid upon me, I had to stay focused and order the highly-acclaimed Cuban sandwich. The baked chicken and potato salad also looked really good, so I thought I'd order that too and save it for dinner. And, because I'm a fat ass, I also tried ordering a side of onion rings. But, the guy behind the counter told me that they no longer make onion rings- indefinitely- only french fries. This was a disappointment; despite having onion rings displayed on their menu board. Another thing that bothered me was that they didn't have any of the prices displayed! How do I know how much this is going to cost?\n\nSo, as I was paying for the food, a man tells me the food is $16 for both the Cuban sandwich and the Baked Chicken platter, which I think is a little pricey. So, I give the guy a $20 bill and he gave me back $6. Did I not hear the guy correctly, or did he give me the wrong change? I don't really know because there aren't prices listed anywhere! Oh yeah, they also don't accept credit card, of course. \n\nThe Cuban sandwich was good. I would say more there's a lot more fat in the sandwich- which is probably why everyone is raving about how delicious it tastes. It's not amazing where I'd make that walk again just to eat this sandwich. As for the baked chicken and rice, the chicken was a little dry and the gravy was really oily. I'd probably skip this next time. I would recommend coming here for the Cuban sandwich only if you're already in the area and looking for a quick bite. Otherwise, I don't think it's worth going out of your way for. \n\nDoes anyone actually know how much a Cubano costs?", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-13", "description": "By the eastern fringes of DUMBO, or about 2 blocks from the F train's York Street Station, is an unassuming breakfast and lunch joint that serves up some pretty good American / Spanish food, at inexpensive prices. Place your order at the counter, pay at the register, and take your food to cafeteria-style seating. Service was polite and friendly. As others have mentioned, Los Papi's is also a good pit stop on the way to the Brooklyn Navy Yard -- get there early as the restaurant closes early on Saturdays.\n\nWhat We've Had:\n- Cuban Sandwich ($9): Just wow. Tasty, crammed full of meat and different textures. Large enough to feed two people.\n- Baked Chicken and Ox Tail with Rice and Beans ($12): Baked chicken was good but the ox tail pieces were drier and fattier than I would have liked.\n\nConsider complementing your meal with a Jarritos Tamarind soda ($2).\n\nService: Very Good (4 of 5). No waiter service, but the counter is very friendly.\nAtmosphere: Fair (2.5 of 5). Utilitarian. Ask for extra napkins and utensils at the counter. Acceptably clean unisex bathroom.\nFood: Very Good (3.5 of 5). \nValue: Good (3.5 of 5).", "author": "Harris L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "Great pernil and rice. Tasted very homemade. Each platter is about 9 dollars and a pretty good amount of food.", "author": "Jenn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Ridiculous portions for what you pay - doesn't get better than this when you're hungry. Our company went here for team lunch and I think for 9 people, we scrapped by under $100 - full entrees and drinks. I got the pernil with yellow rice and beans. Pretty tasty and was enough to last week for 2 big lunches. Would love to come back and try the ox tail which I think is served Wednesdays and Fridays!", "author": "Angela H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "THE BEST CUBAN SANDWICH. Period.\n\nI was hesitant to write a review, because I don't want anyone else to know about this place. The price is very reasonable, $8 for the cuban sandwich. It was stuffed with tender and juicy pork, complimented with the perfect crispy pork skin and pork fat, topped with slice of ham and swiss cheese, and smeared with just the right amount of mayo and mustard. It was simple but soooo damn good!  I wish I worked in Dumbo so I could have this for lunch everyday. Unreal. \n\nThey have other lunch options, all looked delicious. I will definitely be back.", "author": "Lu H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "One of the most consistent, delicious Dominican spots around! Highly recommend their steak, rice, beans, plantain -- ask for avocado, the green spicy sauce, and if you're really in the mood for a feast, a plate of tostones (ask for garlic sauce) -- also opens eaaarly for breakfast", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "Awesome, authentic food joint in DUMBO. Came here for lunch the other day and received tons of food for less than $9 a plate. Everything my group ordered was DELICIOUS! The workers were also helpful and friendly.\n\nHighly Recommend:\n- Roast Pork Plate\n- Plantains\n- Cuban Sandwich\n- Baked Chicken (recommended by restaurant)\n\nThe plates come with your choice of yellow or white rice and black or pinto beans.\n\nCASH ONLY establishment!", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-23", "description": "I think of the movie Chef every time I take a bite of their Cubano.\nI used to get their rice and beans with either delicious roasted pork, beef tendons or those pig feet (I am not slimed by that texture). But now my go to is the amazing Cuban. That sandwich is hearty and so juicy. The bread is nicely flattened and crusted on the outside (not burnt!) and soft on the inside, although flattened. The layer of mustard and mayo on opposite sides are very complimentary to the slice of ham offered. I don't care for pickles but in this sandwich, it is minimal enough to just break up the rich savory taste. I wish the pickle was thinner. But it does offer my palette something tarty to appreciate the main show - the roasted pork! The toasted pork is juicy and meaty. \nThe no frills to the interior and the not overly friendly employees are what's real. Keep it real!", "author": "Retta C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Came in here to grab a quick bite because it was close, wasn't expecting it to be so good. I had the yellow rice, black beans, and chicken. The portion was very large and the chicken was so tender it was falling off the bone. I forgot they had a piece of buttered bread they included until when I was almost finished, but even that tasted fantastic. This giant mound of food, a 20 oz soda and a 1 liter bottle of water was only $10. I'll definitely stop back by if I'm in the area again.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-14", "description": "lunch special was $10 and the \"grilled chicken\" was old and dry and only gave me two pieces, platanos had some sand in it.", "author": "Jessica W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "Lituation station!!\n\nGood here is authentic as delicious as it comes. \nTrue Spanish flavor. The pernil on my cubano was cooked to perfection\nThe plantains are amazing \nThe buffalo spicy shrimp were very good\nOnly reason I didn't give 5 stars was because the place need a lot of interior work  \nGood alone it's perfect tho, I would def return here for sure.", "author": "Ezac T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "Delicious cubanos at a great price. The platters are good too, but a little bit bland. A ton of food, though. One of the only places for a cheap bite in the area.", "author": "Nick A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "Not much to eat around Brooklyn Navy Yard and it's a good thing Los Papi's is within five minutes of driving distance. I must admit, I was a little skeptical about the place...it's in the middle of nowhere and next to a vacant industrial driveway. But once inside the restaurant, I knew Los Papi's is where locals go to for good and affordable Latin food. I was there around noon on a Wednesday, and the place filled up with people in no time. The Cuban sandwich and roast pork over rice and beans are the stars of this local joint. Of course, dare to be different and adventurous, and try the oxtails, beef stews, baked chicken and cod fish...", "author": "Jack K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "The best the best the best in the neighborhood. The food is good, the people are friendly, the portions are huge, the prices are cheap. This is the spot in Dumbo. They've been here for 33 years. Hopefully they'll be here for 33 more.", "author": "Hawkson M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Great place to grab a good, cheap breakfast in Dumbo. I get the 2 egg breakfast sandwich with Ham, Cheese and Jalapeño for less than $5. Good eats!", "author": "Zarbrook S."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "Los Papi’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "77 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/U8GVHFewQYF-Rt4Y-tNHuA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966965"}