{"aggregateRating": {"reviewCount": 71, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "Very friendly staff make you feel right at home, sandwiches are the best in the nieghborhood, lunch time spanish food taste amazing just like homemade food. I always stop by at least 3 times a week love this place", "author": "Jonathan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "this place be da bomb. . . \n\ni am here at least 3 days a week \u0026 for $7 you can't eat all they give you. . .  they have a menu but think HS cafeteria style. You walk in \u0026 look over all the deliciousness they have behind the glass \u0026 then you start to pile it on the plate.\n\nrice, beans, chicken, beef, pork, salad, veggies \u0026 if you dont see it they can make it.\n\nDUMBO is full of \"i just discovered Brooklyn\" transplants who love to pay way too much for stuff the locals know where to get for half what they trustifarians are paying.\n\ngo here \u0026 eat.", "author": "Nick E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-03", "description": "Do you have a kitchen full of Dominican guys read to prepare you a meal at your whim? If not, and you're in the Vinegar Hill/ DUMBO area for lunch, stop by here. It's got that kind of hole-in-the-wall vibe too. You're offered a selection of meats, rice and beans, as well as some sandwich options. I found their menu hard to grasp, and some things I heard ordered weren't even listed. \n\nI ordered a custom sandwich - pork and plantains. The plantains were good, but I wasn't given very many. The pork is cut from what appears to be a whole, cooked pig. So the parts were chopped for my sandwich. I was left wanting a cut of pork a bit more refined when I was chewing through impossibly tough and hard skin. It was all a bit underwhelming.", "author": "Ian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-23", "description": "Food is delicious, comes in very generous portions, and is cheap (6 bucks total for beef stew with rice, beans, and veggies) which for me as an intern in the city is huge. But while the food may not look gourmet, it is absolutely delicious. Everything from the pork to the chicken, to even the rice tasted fantastic and was filling.\n\nGreat place to eat for lunch, and really nice people who work there. Clearly deserves a 5 star in my book.", "author": "Andrew G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "Great spot for pernil. Very tasty. Seems like my order was always messed up though. So I stopped ordering.  Its a far walk for me so I don't go often.", "author": "Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-07", "description": "Same story as most of these dominican steam tray places. Tasty food and tons of it for less than $10. Nothing stand-out about this one, but nothing to complain about either.", "author": "Christopher R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "Came here once,asked for Pollo Guisado and they said they don't make that (down one star). :OOO I was shocked so I ordered the next best thing-- the oxtail stew. It was AMAZINGG :) wish it had a tad bit more salt other than that, it was great.", "author": "Colette L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "I Eat here about 3 times a week lol. The food is awesome, the people are friendly, and the prices are the best.", "author": "Jorge V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-22", "description": "I've had experience this place twice. First time it ordered the pepper beef and that actually was delicious with the rice and beans they have. Unfortunately I'm not very impressed with the fish filet. It seems like just a small piece of fish with tons of breading and deep fried. It was hard to cut through even with a knife. This gives me the impression that the quality of this restaurant isn't fantastic, I can be wrong.", "author": "Alexander Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-03", "description": "I like the atmosphere of this place. It's a hole in the wall place that feels homey and staff is friendly. There is no similar joint with this type of food anywhere nearby so I really wanted to like it. However, in my opinion, the food was only ok. There are other neighborhoods in the city where there are lots of restaurants similar to this one and serving better food. However, I will also say that I came with a friend and she loved the place. I am planning to come back to try it again. One good thing is that the price is fair. For $9, you get a big plate of food containing plantain, rice, and meat. I wouldn't call that cheap, but definitely fair, especially for this expensive area. The most disappointing thing for me was the plantain. I  love well cooked plantain. Badly cooked once, however, are a big disappointment and that was the case here. I thought they had a slightly off flavor and were not well cooked. Once again, I note that my friend disagreed and thought there were great. The rice and meat (her pepper steak and my oxtails) were both good but nothing special. A nice touch was some fresh cilantro and some hot sauce that got put on your plate. If you are craving Latin food and you can't go far, you should definitely come here. But I would say that if you want this kind of food specifically, you should go to a different neighborhood and explore other food options when you're here.", "author": "Aliz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "Lots of good food; $7 for a heaping plate. \n\nI ordered the yucca, black beans, and roast pork today, and am suffering from a delightful food coma 20 minutes later.", "author": "Mickey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-20", "description": "This place is CRAZY delicious. I first went there a few weeks ago and had the chicken platter (the rice and beans are off the hook!) and today I went and got the Cuban sandwich. This restaurant is the truth. Good food, nice people, great prices. Not the best looking place, but who cares? The food is bananas!", "author": "Camille A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "Just plain good food. Good prices and breakfast any time. Self serve, pleasant staff. Always willing to accommodate any request", "author": "Ted N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-29", "description": "First of all let me say this is a working man's type Diner, I suspect it is a holdover from when the Dumbo area was Industrially oriented. Thank God for that! Amid all the new ChiChi restaurants in the area here is a good Dominican Style Diner. I had Beef Stew with Peas and Rice and fried Plantains. Great great food ample portions (even on the plantains) and the price OMG. When I was being rung up he said \"$16 Papi\" I explained i was paying for both of us he said \"Yeah I know\". The staff was great and the green hot sauce mucho caliente. If you want some great food for lunch go if you are looking for any type of ambiance this is not the place for you.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "Food is sometimes good, sometimes great! Haven't been disappointed yet. Friendly service. Like most Spanish places, lots of food for a decent price.", "author": "Taina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-16", "description": "This place is awesome. The cuban sandwich is delicious but more recently I've settled on yellow rice, pinto beans, spicy chicken, and hot sauce.  Delicious.", "author": "Tom L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-16", "description": "So far everyone is on point about this place. Although I haven't been there personally yet, I have ordered out. The breakfast is really good and they give decent size portions for a great price and the same goes for their lunch.", "author": "Al G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-02", "description": "Los Papi's is the jam.\n\nYou want cilantro with that? Yes.\nYou want hot sauce with that? Yes.\nYou want some fried sweet plantains? Yes.\n\nRice. Chicken. Avocados. Huge portion. Next door to my house? Yes.", "author": "Sara L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-16", "description": "One of my favorite (relatively cheap) lunch spots in the DUMBO/Vinegar Hill area. All the other places where I can pick up lunch around here just aren't that good, but Los Papis has some really tasty things.\n\nTry the Cuban sandwich for $5.50. Apparently, it used to be bigger, but even so it's almost too big and filling right now. The steak platter ($7) is on the pricier side of things, but the meat is tender and delicious.\n\nAlso, word on the street is that it was closed for a few days for failing a health inspection, so you know it's legit!", "author": "Chris W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "When I thought I finally ran out of good places to eat within walking distance of DUMBO, I stumbled across this place on Yelp.\n\nThey have great people working behind the counter, great prices, and a FANTASTIC cuban sandwich.\n\nI'm not a huge pork guy, but this sandwich rocks. Additionally, it's set up like a deli. Put in an order, and eat it there, or take it out. Their drink selection is aight. They also have a sort of make-your-own-meal hot foods thing going on too, which seems pretty popular.\n\nIf you decide to stop by, try the cuban!", "author": "Kenny K."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "Los Papi’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "77 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/U8GVHFewQYF-Rt4Y-tNHuA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966965"}