{"aggregateRating": {"reviewCount": 71, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "The Cuban sandwich is hella good. Sometimes they run out of the roast pork, though. This happened to me at 3pm on a Thursday. I got a Cuban with pork chop instead.", "author": "Elliott D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "My daily to go place for authentic Latin food at a great price. Ask for the side of tostones, they are made right in front of you.", "author": "Juan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Really Good.\n\nI work close by and occasionally stop in during lunch time to get some pork, rice and beans with some hot sauce. The price is very reasonable - $6 for lunch special. This has become one of my go-to-spots for a quick, delicious, and affordable lunch. Would recommend.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "Okay, let me tell you something before I start. I am Dominican and one of the pickiest people in the world and to me this is the best home-cooking-style Dominican food that I have tasted in New York!.. Starting from their beans to their brisket special they are both great!!!!!! \n\nThe portions are huge for the price that you pay. $7 dollars straight for baked chicken, rice and beans lunch special. Brisket, Fish or any other choice will be $8 or $9 max $10 no more than than. \n\nGo to Los Papi's for lunch or breakfast, which is also delicious! They have sandwiches and Egg Any Style, but who is going to order that we you can have Mangu with los tres golpes (fried eggs, salami, and fried cheese) come on!\n\nKeep it up papis!!!\nYou are the best!!!", "author": "Jose J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-19", "description": "This was close by to where we were staying during our visit. On the last day prior to our departure we decided to have lunch here based on the reviews on Yelp. \n\nThis is a local hole in the wall with a B rating posted outside of their shop. Sometimes the better foods come from places that aren't rated A for cleanliness. We ordered the Cuban sandwich and their baked chicken meal with rice and mashed potatoes, and a side order of fried plantains. \n\nThe Cuban sandwich is the real winner. They really load the sandwich up with pork. Portion size is enough to share between two. The bakes chicken was good as well but the breast piece was on the dry side. The rice was decent, had some flavors. The mashed potato was disappointing as it lacked any flavor or seasoning and was only served on its own. The fired plantains was also kind of disappointing as it didn't taste fresh from the fryer. \n\nThis place is kind of off ways for most people as there's not much around the neighborhood. I told my friend to check it out but he said they don't open on weekends. If you're around for lunch I'd recommend giving their Cuban sandwich a try. It's cheap, service is friendly and the Cuban is worth getting.", "author": "David Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "I'm only reviewing the Cuban sandwich which deserves 5 stars on its own (I haven't ordered anything else from this place). The ratios in the sandwich is just perfect and you must get the green sauce as well. The employees are all pleasant and the place is always tidy.", "author": "Kaori S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "Omg the cubano was great. The man of men type cubano. I ate it and was afraid of it to end. The pork was great. Each bite had a mix of the crispy skin, lean pork, fatty moist pork, light creamy mayo, cheese and pickle . I was in heaven. I would definetly come back. Ambiance is like an old cafeteria but who cares. I'm there for good food. I also ordered the pork plate with plantains and avacado. I ate that as well!!!! I'm glad they didn't salt the meat so you can taste the meats natural flavor. I get to choose with salt or not. Got home and sprinkled some himalayan pink salt on it and bam!!! Perfect.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "The Cuban sandwich ($7) was delicious, even though it did kick my ass!", "author": "Darren H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Came here for the Cuban sandwich, and it was absolutely delicious!  The bread was perfectly crispy- the entire thing was incredible.  And the service was really friendly too", "author": "Fallon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-13", "description": "Wow, I'm surprised that I could find such great Dominican food in Brooklyn. This place serves up great breakfast/lunch at a low cost.  The guys behind the counter are awesome.\n\nRice - amazing\nPlatanos - yes, please\nRoast chicken - :)\nIced coffee - so I don't fall asleep\n\nNew favorite spot in the area...", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "Best Cuban sandwich ever! Everybody who works here is super nice and friendly! Can't wait to go back and try the other dishes! They seem to have a very loyal clientele so come early or you might have to wait!", "author": "Alice L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-08", "description": "Well I ordered breakfast  from them this morning 7am it is now 11:45am and I still haven't received it when I called they said they forgot this is a place I order breakfast  everyday I know people make mistakes but just the way they went about it was like o well I forgot  it is what it is smh so now I will no longer order from this place", "author": "Jason P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "Absolutely delicious! I get my lunch there 2-4 times a week. The portions are huge and the guys who work there are super nice. This place serves better food than high end restaurants. It tastes like home-made.\nI'm in love with this place.", "author": "U A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-07", "description": "You MUST come and try this place. True authentic food. Looks like real old but good food is good food.\n\nHow it works:\n1) You choose white or yellow rice\n2) Black or Pinto Beans\n3) Chicken, Beef stew, Pork mix, or other meats.\n\nGET THE PORK! The flavor in that dish is unreal and out of this world. \nChicken is a little dry but still delicious.\n\n4) if you like spicy, get the spicy dish.\n5) Say yes to plantains\n\n\nGet it to-go and head to Brooklyn Bridge Park - Main St. Sit down on the steps facing the amazing view and enjoy!", "author": "Brad P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "I have been ordering from \" Los Papi's\" for quite some time. They even offer catering services and the prices are reasonable and the food is always fresh. Great customer service too that's a + :)", "author": "Adria R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-05", "description": "excellent home cooked meals. you cannot miss the roast pork. crisp skin and juicy tender meats. excellent soft beans and fluffy rice. a choice pinch of cilantro. a meal fit for a king!\n\nenjoy.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-02", "description": "This place is the BOMB! Best deal going anywhere in the 5 Boroughs. It's basically the sistership of OASIS on Bedford in Williamsburgh, except way better.\n\nIf you go, make sure you get the Cuban. It's an epic delicious sandwich that you can even make 2 meals out of if you're not starving.\n\nPortions are huge no amtter what you get.\n\n$5.50 for a massive Sandiwch.\n\nAlso, be sure to get the Lentil soup. $2 for a massive bowl.\n\nI don't care if you're not even trying to save money and usually blow $15 on lunch. Hit this place up!", "author": "James C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "This place itself is kind of a hole in the wall but the old guy server (Los papi?) is super friendly and the food is delicious. I don't know if he spoke any english, but I got what I needed anyway. He probably has had plenty experience since the place has been around since 1985... \n\nI didn't get anything off the menu-- they have rotating specials, so I definitely recommend that. I got the oxtail with rice and beans.. Amazing! The meat was so tender that I fell right off the bone. It was very flavorful and it doesn't hurt that it was only $8 for such a large portion of food! I ended up taking half of it home.", "author": "Jane Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "\"Welcome friend, come in and find a seat! It is so good to see you!\"\n\nHard to feel unwelcomed here at Papi's. Everyone we encountered was super friendly and seemed to enjoy what they did. The restaurant is very clean with a buffet type bar up front where an employee will scoop up there food for you. \n\nThe wife and I had an enchilada and a vegetarian wrap. Both were good and Mexican-American tasting (not autentico). You won't leave here wanting more food that is for sure but you also won't say that was the best meal of your life. \n\nOverall, food was 3 stars and customer service and restaurant cleanliness were a five. Gotta give them a four and will probably be back.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Excellent Cuban Sandwich. All good except some of the pork skin was hard to chew.", "author": "Anthony W."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "Los Papi’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "77 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/U8GVHFewQYF-Rt4Y-tNHuA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966965"}