{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-09", "description": "I saw Pedro's for the first time when I biked pass during my first 5 Boro Bike Tour.  It instantaneously got some cool points for the funky graffiti and slightly dilapidated look of the building.  More so, many riders were stopping the Tour just to stop and have beers and margaritas!  Well I finally got the chance to go to this place which has long since been on my list and to be truthful I was disappointed.\n\nWe shared a picture of Pedro's margaritas which are supposed to be different because they have a hint of sangria in them. They were nothing to talk about, a little diluted and i didn't taste any sangria. \n\nMy friend and I shared everything - we got a beef stuffed plaintain which as other reviewers have mentioned is quite large and good for sharing.  It was however also saturated in greasy oil.\n\nWe also got a bowl of nachos and guac.  The nachos were good but there were no refills and the gual came in a tiny paper bowl..  Not nearly enough for the $7 menu price.  Plus there wasnt many large pieces of avacado.\n\nFinally we shared a tapas dish which came with standard mexican fare such as an empanada, 2 tacos, 2 flautas and 1 chimichanga. We opted for a mixed pot so each had either chicken, pork, veggie, or beef.  Everything was greasy and not so great.  It made my stomach feel sick the rest of the night.\n\nHowever, unlike most commenters our waitress was very nice.  I still like the atmosphere and the energy in the place.  If anything I would go back just for drinks.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Small restaurant with great drink deals. It's not good for a party over 6 but definitely come here. Cheap STRONG drinks with large food portions. I had the mofongo which was heavy on the garlic - loved it!  I recommend this place for a casual date with your partner or meeting up with a few friends.", "author": "Amara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "I went in the early April. I can't believe such a small restaurant serves such big and good Burritos. I couldn't finish it all so here comes my late night snack! Other dishes kinda look ok. This is more of a neighborhood diner, not a good hang out place coz it's really cramped. Come eat and go. We, a party of 9, pretty much occupied a third of the restaurant.", "author": "Joyce T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "I really like the funky ambience here. It's haimish. The drinks are reasonably priced and potent. The food is not exactly haute cuisine but that's not why you'd come here. We've been here several times and the service was always friendly.", "author": "Laura R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-02", "description": "Service was so slow it verged on incompetent. The carnitas burrito was fine if underwhelming, and certainly not cravable. The menu is pricey given the venue, and, unlike most downmarket Mexican restaurants, there are no free chips and salsa. The interior is low-ceilinged and uncomfortably cramped.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-20", "description": "DO NOT EAT HERE. THIS PLACE HAS HORRIBLE CUSTOMER SERVICE!\nI placed an order thru Seamless and after a mishap because of the seamless account, which I had to be the one to call the restaurant and find out about, I decided I would pay cash instead of credit card. The food was to be delivered less than 5 minutes away. It took the delivery man over a half hour to even leave the restaurant even though the food was said to be ready. The manager called and said the food was on its way. At that time I sent my 16 year old cousin downstairs to go get the food at 8:20 p.m. she waited for over 30 minutes by herself and the delivery man never came. After physically going to the restaurant (over 90 minutes since I've ordered my food) the manager lied and said the delivery man came. NO DELIVERY MAN EVER CAME TO MY APARTMENT. 90 minutes later when the food is sure to be cold and my growling stomach sure to be turning on itself the manager still refused to compensate me for her LIES and inconvenience. This is a HORRIBLE and disrespectful establishment that does not deserve a dime.", "author": "Dana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-27", "description": "Had the beef nachos super and the empanada combo. They were delicious. The nachos were quite pricey and  the happy hour prices aren't anything to rave about. It's only 1$ off their beers. I live around the corner and the place is always packed. All in all I'll be back.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-24", "description": "Pedro's is not good Spanish food. Four things keep this place open. 1 is location. 2. The people who eat there might not know  what good  Spanish food tastes like. 3.ice cold drinks. 4. Lack of real Spanish food in area. los papis and bridge are great but close early. Real Spanish food blows Pedro's away.  I bought a Cuban sandwich and liquid spilled out the bag. I thought a soup spilled. The people who work and owners are really nice though.", "author": "Daniel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "Cool spot came here with my boyfriend.  The Quesadillas were okay and the empanadas was great also not too oily. Place is kind of small. But still looks cool. Plan of going here again, next time I'll order a margarita or sangria.", "author": "Youtrish-sha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "I don't know why this place has such low\nReviews. It's such a cute place. I had a spinach burrito which was really good. My bf had a stake sandwich which he also enjoyed. Over all the food was very well. They also have outdoor seating", "author": "Sayma N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-17", "description": "I have to say this. Came with 6 friends and were craving tacos. We had to flag down a server to be acknowledged after 10 minutes. We ordered, and it took a while to even receive water. The drink order was wrong. Water was never refilled again. When the food was delivered, there were orders missing. The server never acknowledged it until we asked him where the food was. Then we were charged for everything. Not coming back.", "author": "Misha Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-08", "description": "Was here late on a Sunday night and it seemed like most of the neighborhood shutdown, but this place had it's lights on and some outdoor seating so I was sold.  \n\nWe started off with the fried plantains stuffed with beef which was even better than I expected.  The plantain was also huge, this really isn't a one person appetizer.  Next up was a couple of sandwiches, a Cuban and a chicken sandwich.  Again, both were  really good and it turned out to be way too much food when combined with the fried plantain.  \n\nThe only downside is service was pretty slow, but I'm guessing the waitress wasn't too motivated since it was late Sunday night.  Overall a solid 3.5 star spot.", "author": "David W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-19", "description": "Mold on the menu!  No idea what atrocities  happening in the kitchen. The staff either don't care or don't want to help. Fine for a drink but don't eat here", "author": "Diana S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-17", "description": "Pedro's is a non-threatening and super friendly environment full of an eclectic and just as friendly crowd of people.  Bridge workers, yuppies, hippies, stock brokers, artists, tourists, hipsters, and just about anyone can be found in here, all having a great time, and all in a super relaxed and super-chilled out mode. \n\nWe walked in because it was so fun and easy-going looking.  The shrimp tacos were decent, the chorizo flauta was delicious, and the drinks were plentiful.  We had a few shots, a few round of drinks, ate, were merry, and then took off.  Decent pricing, decent service, and a decent time. \n\nA solid 3 stars for getting what we expected to get based on the judgement of it's cover.", "author": "Cyrus P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "Walked in and couldn't even get anyone to seat us or acknowledge us. Ordered nachos with sour cream on the side and they brought them out with the sour cream included. Absolutely don't order the nachos... what a joke! Smallest portion and barely any cheese. Don't expect any complimentary salsa and chips unless your paying for it. They didn't even bring us a a cup of water. The food was mediocre at best. I wish I had gone to Taco Bell instead the food would have been more enjoyable. Our waitress took our order and never saw her again. When they brought the check they didn't even bring a pen for us to sign and then another waiter took the check without us signing even after the fact that we informed him we had no pen to sign. Then another waitress came back with the check and accused us of not signing the check after we were there patiently waiting for us to bring a pen.  Will not be coming back EVER.", "author": "Sara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-12", "description": "This place is horrible, poor excuse for Spanish food I'm actually offended. Came here one night just randomly and I regret it to this day. The place is tiny and smells, everyone there was wasted and appeared to be underage. The tables were so close together you can feel the person next to you breathing. We only stayed because we were hungry and there is really nothing else in walking distance on a cold night. I ordered grilled chicken, rice and beans and when the food came the chicken was actually slimey. I was so turned off I took two bites of my food and could not eat the rest. I will never be back nor recommend anyone to eat here. Beware if you do.", "author": "Lucia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-30", "description": "Poor service and food was all I received from Pedro's. It has to be the worst Mexican Restaurant I've ever been to. They even played the Mexican world cup game in english.", "author": "Josh W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-12", "description": "I'd always been leery of this place. I wouldn't expect Mexican food in Dumbo to be very good in the first place, and reviews have always driven me away. But I ended up here last night with some friends because it seemed like the cheapest option to grab some quick food for dinner without leaving the neighborhood.\n\nWhat a waste of time and money.\n\nWe ordered a basket of chips and guac to start. At a normal Mexican restaurant, chips and salsa are free and guac is a few bucks extra. With guacamole I think it cost $7 for the basket. Now, I could accept this if at least one of these two items were decent. The chips--which we barely had enough of for the three of us--were stale, and had clearly been warmed up to be presented as fresh-cooked. The tiny, tiny serving of guac (enough for maybe a dozen chips) was an unpleasant shade of brown and had no flavor. Great start, Pedro's.\n\nFollowing, I ordered a pork burrito. I figured this would be the most bang for my buck, and really how can you screw up a pork burrito? Unfortunately this $10 restaurant burrito was without a doubt the worst burrito I've ever had. I'd take Taco Bell over this--I'd honestly prefer the pureed cow anus that they'd sell me over this sorry excuse for Mexican food. The burrito was basic: just rice, pork, and beans. But there was absolutely no discernible flavor. It might as well have been a burrito full of wet, unseasoned rice. I could make a better burrito if I dumped a can of beans in a bag of pork rinds. I'll say this: it didn't taste BAD. I ate it. I was very hungry and I finished the whole thing. But it was far from good, and probably the most bland thing I've eaten anywhere in New York. Absolutely inexcusable given the price point.\n\nI give this place 2 stars only because the server was friendly and seemed apologetic about the terrible terrible food. However I seriously question how Pedro's can afford prime real estate in Dumbo while selling such awful fare. If you want Mexican food, you're better off getting a burrito from the Korilla truck--and that's Korean!", "author": "Corbin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-11", "description": "Place looked pretty cool from the outside but the inside is very dirty. Walked by the kitchen to get to the bathroom and noticed how poorly the food is being prepared. Lots of microwave usage and all the meat are sitting out uncovered. Which is even worse because the place is full of little flies that disturbed our dining experience. We couldn't wait to get out but sadly the server was so slow it took a while to finally be able to leave", "author": "Phil B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-11", "description": "The first time I came in here I ordered the chicken tacos. When they came out they were double wrapped in corn tortillas and all three were ripped open 1st and 2nd layer. I asked to get new tortillas and by the time I got them my food was cold. The tacos were bland the chicken was dry with no flavor. \nSecond time I came (wanting to give this place a second chance since its so close to my office) I had the Steak Sandwich. That actually wasn't horrible but the service was still very slow. So slow in fact after waiting 10 minutes I walked up to the bar to pay my bill. \nThe decor is cute and I want to like it here but the service makes the less than mediocre \"Mexican\" food not worth the trip.", "author": "L. M."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}