{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "I randomly discovered this place last year during the summer while wandering Dumbo and it was pretty good; however, when I returned this summer it definitely was not the same. The food was very subpar and made my stomach hurt afterward. I do NOT recommend coming here if you're looking for Mexican food in dumbo. Please save your money!! Trust and believe it is not worth it.", "author": "Mia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-04", "description": "Ugh.. this restaurant was very average. We sat outside so the service was pretty slow, and the waitress seemed overwhelmed. The food was okay, but could have been much better. Kind of left you with that \"I just ate cheap Mexican food\" feeling that many know all too well. The house margaritas weren't strong at all, and the cups that came with the pitcher were TINY. What stood out most though was the rice- it seemed severely undercooked, so that it was actually crunchy. Honestly, it reminded me of play-doh. Wouldn't recommend this place to anyone.", "author": "Sandra B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "This was such a great place! The food was delicious and John, the bartender was fun and exceptional. We had delicious shrimp, guacamole and steak fajita. Sooo good:)", "author": "Alex B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-08", "description": "This place is just gross. Ordered the taco combo to go and she grabs the tortillas with her bare hands after shoving chips in her mouth. Then I received these nasty sloppy tacos that were just thrown together.", "author": "Gabrielle L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-29", "description": "This was so horrible taste 0 service -0 decor meh just a place for white people to drink", "author": "Lujan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-24", "description": "To write a review about how nasty this food is and other reviews were right would be reiteration but I'm absolutely compelled to tell my experience I haven't had food this bad in sooo long I can't believe it.The decor is cute it's really nice on the outside of the restaurant but don't be fooled this place does not serve Mexican food or even Tex Mexican food. As an appetizer, I ordered chicken empanadas and a chicken quesadilla idk if it was cause I was starving or if it was really good but I enjoyed that however, everything went downhill from there. I ordered what should've been a chicken fajita and what I got was chicken sautéed in Sazon ,salt no cheese and no grilled peppers. I'm not Wolfgang puck or Martha Stewart but I think most Tex-Mexican restaurants have the same aesthetics that everyone loves for a reason. Cheese more cheese jalapeños chiles tomatillo salsa sauce sour cream lettuce and more cheese. Last time I checked,no Mexican restaurant cooks with that sazon shit. Idc if one place uses a white onion over a purple one just make the food taste good. In addition to this nasty ass expensive food they serve Pedro's automatically add gratuity to your bill (their service wasn't even all that tbh) I guess they have to pay that high ass dumbo rent so they trickle that down to customers. Clearly, this is an establishment that doesn't care about the food they serve. Long story short DONT EAT HERE!", "author": "Shamorra B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "My friend and I popped in here because we were in the area. It took a really long time to even get noticed for service and we had to flag down three different waiters to get assistance, and then repeat our order a few times.\n\nThe chips and guac were ok but nothing special. Actually, this entire venue has nothing special about it. The air circulation was also awful as the fajitas coming by kept smoking up the restaurant.\n\nWe ordered the chorizo quesadilla and it was ok, but nothing I couldn't whip up at home.\n\nThankfully, the meal was incredibly cheap.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-23", "description": "Name of the restaurant is actually a bit misleading.  It's more Mexican/Puerto Rican/Dominican food.  I had Mexican food and it was pretty good, albeit, not authentic Mexican food but still good.  This is the type of place you come to after work to just have some beers, good food and laugh.  \n\nThe decor makes you feel like you're walking into a cozy, casual, modest bar.  I'd definitely would go back again, perhaps for brunch.", "author": "Prieta S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-26", "description": "First time I've walked out of a place in a while. Rude staff.  Sat down , tried to order and just got so much attitude from the Barman.", "author": "Dirk S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-06", "description": "Those were the worst  tacos I ever ate in my life not that they tasted horrible there was no taste at all... how this place stays for  business I don't know????  exclamation exclamation exclamation\nAvoid this place at all costs !!! The reviews are totally  right! total poo poo.. A couple of shrimp some lettuce and I like two pieces of tomato totally bland crap!!!if  if I could give a negative star I definitely would!! Bad bad bad..The bartender  with all the tats seemed like a nice guy tho...", "author": "Mathieu L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-23", "description": "Great location in dumbo.   Food was terrible.   Salty to the point of being inedible.   Cooks should taste components or food before they send it out.", "author": "Joshua W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "Of all my years living here, I have never experienced such poor service anywhere in NYC. Food was somewhat good, but the staff definitely destroyed any potential of it being enjoyable. From the bartender/waiter having a complete attitude and arguing when I was clearly stating that there was something wrong with the drink instead of simply fixing it like any normal bartender would (I would know as I bartended for many years), the amount of time that it took for him to even come over to us when it wasn't even that busy, to the time it took to bring anything out and waiting 30 minutes just to get the check was awful. Best part was him charging extra to fix the drink that he made improperly in the first place. Sad because I used to really like this place years ago and decided to come back and show it to my friend; obviously won't be returning thanks to the lack of professionalism from the staff. I've never felt bad about paying a check until today. The reason for my review is so that management/owners do something about this as it would be a shame for such a beautiful and unique restaurant to lose customers because of unprofessional staff.", "author": "Taya D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-19", "description": "Holy crap, this place is horrendous! My friend and I came here for lunch today and I'd been here once for drinks a few years ago. We were seated right away and that was the speediest part of the service. They were extremely slow and the place was pretty quiet. They didn't come over once during our meal to see if we wanted or needed anything. They didn't even give us water when we sat down. Additionally the staff was pretty rude. The woman brought the check to us before we were even finished, not bothering to ask us if we wanted anything more, which brings me to what was supposed to be the food. \n\nWe both ordered a burrito and it was pretty expensive but I figured it would be a decent sized one. The joke was on us. It was tiny! The toppings that were supposed to come with it were laughable and the flavor didn't exist. Even the michelada was disappointing. For $10 and $12 respectively it was ridiculous. There wasn't even a side of beans or anything. We got chips and salsa. The chips were stale and the salsa was so salty that it was inedible. I wish I could give this awful place zero stars. Save your money and time and avoid this place like the plague.", "author": "D. C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "Food was delicious! Atmosphere was amazing. Went there with a friend. Was seated immediately. I ate the vegetarian spinach burrito it was amazing we also got guacamole and chips.", "author": "Amber A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "On my first visit to Pedro's I wasn't to fond of their chicken tacos. I didn't it would be fair to judge Pedro's solely on their chicken taco. I decided to ask the waiter what was the most popular dish on the menu. He referred me to the shrimp flautas and it was amazing. The shrimps were so and tasty. Can't wait to go back! \nSteak tacos are pretty awesome too.", "author": "Angie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-23", "description": "Mediocre New York style Mexican food. It would've been a fine experience had it come out 10 minutes after ordering, or if it had cost a more fair price. As it was, it took 45 minutes from ordering our food to getting it, which, for an order of fish tacos, nachos, and flautas, seems a bit extreme. When the food arrived it was fine, but nothing to rave about. \n\nI will not be returning, and I'd advise avoiding, as the food wasn't worth the wait, nor was it worth the cost.", "author": "Jack M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "Great atmosphere, great food. Been here a few times and enjoyed this low key, laid back feel. I've tried the steak, quesadilla, burritos and of course the peach margaritas lol!! No complaints!", "author": "Ericaaa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-07", "description": "Was very excited to try this restaurant as it looked authentic and my girlfriend had previously had a good experience with their drinks. \n\nWe waited 2 hours and still hadn't gotten our food. We were then lied to that they were out of black beans, when the couple next to us got an order with black beans in it. \n\nThe waitress was rude and the drinks were overpriced.  I didn't know how to leave a yelp review, but I downloaded the app and left this because I was so angry and how bad it was. \n\nDO. NOT. GO.", "author": "Donald D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-06", "description": "Terrible service waited over an hour. It wasn't busy which was quite puzzling. The customer service has a lot to be desired. Beware!", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-27", "description": "Super loud cramped and uncomfortable, also no happy hour on Friday nights. Only had chips and guacamole which were fine but I agree with other yelpers that this place has the feel of a cheap dive where you should be able to get a good deal but prices def don't reflect the ambiance.", "author": "Tyler J."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}