{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-27", "description": "Strolled in on a Saturday afternoon after discovering that Hecho in Dumbo is no more.  Pedro's came up when i did a search for \"Best Margarita in Brooklyn\" and I felt seriously mislead.  Everything was more or less edible but just not good - The Elote is just strewn with Mayo and Pepper - the tacos (3 small) were a decent price at $8 but just MEH.  thankfully i doused everything in Salsa Verde (You get charged $1 for a small serving) No chips! No salsa!  Crap Food!  No thanks.", "author": "Sandy V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-05", "description": "My boyfriend and were looking for a place to eat in Dumbo that was outside in this beautiful July evening. We found parking near Pedro's and decided to eat dinner here.  We are not experts in Mexican food but found the food good. The fajitas were  plentiful and flavored very well even though they were hampered by my request for very very mild!  The regular Sangria packed a punch that I can only wonder how strong  b Pedro's special sangria would be. Overall a fun evening. We appreciated the mixed crowd  in the sidewalk area. Lots of fun.", "author": "Lucille S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-20", "description": "I moved to the block a few months ago and thought this would become my after work go to place.  After three attempts at eating here, it is safe to say that I will never eat here again.  The place is a dive, but usually those are the kinds of places the best Mexican food comes from... not this place.  The food is not fresh here.  Portions are small and tasteless.  Even the chips and salsa are bad.  I figured they would at least have good margaritas.... not at all.  The servers, while nice, seem inexperienced and not to know anything about the food when you ask questions.  And indeed they do serve their food on styrofoam dishes.  I walk by everday and the place is always full which just makes me wonder how so many people could have such bad taste.  This place was such a gigantic let down.  I don't know how it has accumulated such a high yelp rating.  Like other reviewers, I'd rather eat at Taco Bell.\n\nIt is an abomination against Mexican food!", "author": "Amanda K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-21", "description": "Negative a million stars.   My fiancee has been in bed for two days with food poisoning after eating here.  If you've ever had food poisoning, you know that death is often the preferable option.  I wouldn't even drink the water here.  Find someplace else!  ANY PLACE!", "author": "Erik W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-15", "description": "Soggy wings, stale chips, rubbery enchiladas and watered-down margaritas. Just about sums it up. Never need to come here again.", "author": "K G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "I work in the area and it's a bit limited when it comes to nightlife, but I love the hole-in-the-wall feeling of Pedro's (yes, that's a compliment!).\n\nFamily-owned and they are really friendly, good people. Food is great, and if you aren't feeling authentic Mexican that night, then definitely try the Cuban sandwich!\n\nDrinks are decently priced but can be a tad limited if you like a variety of flavors.\n\nOverall, love this place, and hear they are opening another location in Williamsburg!", "author": "Christina O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-18", "description": "Don't go. Ever. Food wasn't great, especially not at the prices they were charging. And to add insult to injury, the food wasn't even made fresh. While waiting for the restroom, I saw kitchen staff microwaving orders of burritos, tamales, plantains, pretty much everything on the menu. One after another dish kept going into the microwave before being served to customers. Ridiculous. I will never return to this place.", "author": "Jessica O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-18", "description": "I go to Pedros when I'm tipsy and roaming the cobble hilled streets of Dumbo. I understand that food options are limited in this area of Brooklyn, so if you must, you must.  The service was slow, the menu a bit unclear, and the fish tacos were a bit too \"fishy.\" The upside was the cokes were in bottles, and a graffiti outside it pretty bangin'.\n\nAll in all, don't go out of your way for a visit. You're in New York City for god sakes, where you can get some killer Mexican food. Find it.\n\nBe ready, they have random hours, and are occasionally closed during regular business hours.", "author": "Zara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "My best friend and I came across this little hole in the wall restaurant after doing a photo shot of the New York City Skyline from the Brooklyn side of the state. We walked in and I felt like I was in Mexico, haha. The ambiance here was energetic to say the least. It was Rosa who made it a special visit for us to enjoy. We started off with the Platano Frito fried plantains maduros, sweet, tostones, and salty with the sour cream on the side, next we ordered Chimichangas and Flautas (yes folks we were hungry haha!) than for dessert Rosa recommended the sweet carmel nachos! Now here was a treat! After a few margaritas I had to ask Rosa how the latin sour cream was made. At first she wouldn't tell me but after telling her that I was visiting from California she gave the secret to it....\nAll and all I had a great time at this little hole in the wall place! Cheers Rosa!", "author": "Marco R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-22", "description": "My girlfriend and I were attracted to this little Mexican hole-in-the-wall late one recent evening. We had passed it many times while visiting DUMBO, so the location is pretty great. Service was friendly, and the vibe once seated was quite nice. I would like to have a couple of drinks here if I ever find myself back.\n\nI had a Chicken Milanese Torta, which was pretty tasty \u0026 crunchy, however the bread/wrap left something to be desired. It comes in an aluminum foil wrapper, which is evidently required as the contents otherwise spill out all over the place. I think that I've been spoiled by the tortas at my local spot, Yolas.\n\nThe other entrée that arrived was a set of chicken soft tacos. We ordered pork tamales, not sure how that simple order was crossed, but we sucked it up and just kept what was served. The place was not too busy, but we also wanted to be on our way. . . the chicken tacos were \"all right\", nothing of note to comment on.\n\nWe shared a glass of red wine sangria, it was quite nice. Overall, we spent $26 (including tip) - I think that was a little too much for decent \"fast\" food, incorrectly delivered, and not particularly flavorful. 3 stars for the location, vibe, and potential for drinking.", "author": "David B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-01", "description": "5 Stars for Tecate in a bottle, -2 Star for bad fish tacos.\n\nThe tacos are okay, not great, although I did really like the Chorizo taco. Fish taco tasted really really really fishy, I couldn't even eat it. Chicken taco was so-so. Empenada sort of sucked. Pedro's also smelled a little foul, not really into eating in a place that smells like what you might do after you digest their food. The only thing that saves this place is the bottled Tecate, which was great, really great.\n\nThe ladies are nice behind the counter, but fact remains, this is just a mediocre taco joint, I would travel further for better.", "author": "Gabe W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-15", "description": "The food is scary. I'm not a germophobe but this place is no bueno. \n\nIve lived in the neighborhood for years and even when there were no other restaurants I wouldnt go anywhere near that stuff. \n\nSomehow it became a hipster hangout and i guess its in business because of this and cheap beers... but  if you actually want to eat something you know has not made contact with rodents you might want to skip this joint.", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "If you are looking for a NYC 5-star experience you are not going to find Pedro's to be your spot!\n\nHowever, if you are looking for a menu that boast many types of Latin options for you to choose from you are going to be HAPPY HAPPY HAPPY!   \n\nThe food is very tasty and Pedro's is always willing to make it to order (if possible). The drinks are made well; and, the service is always great! \n\nThis Resto is a neighbor gem!  It is owned and managed by a solid set of people that make you feel like you are eating at their home.  \n\nI feel a little bad about the poor reviews as of late. It's all subjective, I know, but it seems like some had a expectations that simply isn't the mission of this restaurant. \n\nHere it is!  Hole in the wall, with two TVs, music on (sometimes loud), tables on sidewalk during the summer months, nice sized menu (not just Mexican) that taste really good, good drinks, great service!  Nothing more nothin less.", "author": "Tye S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-18", "description": "You know when you wander into a little hole in the wall, and, sure, they've got the same stuff everybody else has (enchiladas, tacos, etc), but they take pride in their food, and it's a good notch above the usual -- or maybe a hidden gem?\n\nYeah, well forget about it. This ain't that.\n\nThey have all the usuals, and they're ok -- not awful, but just bland and nothing special and no place you'd ever go back to. I was there maybe 5-7 yrs ago, had a similar experience, but thought I'd give another try.\n\nNope, not worth it.\n\nMargarita: B\nEnchiladas: B\nQuesadillas: B\nElote: B\nGrilled Fish: B\nService: C\n\nThat's arguably a little generous. Could be C's, with a D for service. If it were cheap and generous, that'd be something else, but, again, you could probably do just as well, if not better, at (god forbid . . . and just a guess) Chili's. Pedro's actually heats things up with a microwave (which they don't hide), something they might well have in common with Chili's.\n\nOh, and they don't even give you free chips. What's up with that? About 90% or more of places like this give you free chips. Sheez.\n\nLast thing: the place screams, \"Fire Trap.\" I'm no nervous nelly, but I wouldn't be the least bit surprised to open the paper some morning and hear about a dozen people perishing in a blaze in there. Lord knows how the fire dept and DOB let them operate.", "author": "FRED M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-15", "description": "Been here only once, The food came out fast... I enjoyed it... Drinks were pretty good.. I had no complaints.... HOLD UP!!!! This waitress kinda most def.. absolutely kept rushing us.. NOT COOL..  Talking about, her shift is over soon would we like the check? (Say What!!!!!!!!) But the food and drinks are not bad. They can spruce up the joint a little more the inside is kind of dull.... but that's minor the spot is decent. I'm a fan.", "author": "Dre D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "Tequila, triple sec, lime juice. So simple, but apparently so complex.\n\nThose 4 stars are for the margaritas. I'm a New Yorker, but having lived in LA for a couple years and becoming hooked on great margaritas from random bars, NYC has left me very disappointed. I've pretty much tried at least one margarita from every Latin inspired restaurant I have been to in the last year, and Pedro's is the probably the best, and certainly the best for the money. I think they were $7, but I don't exactly remember as I had about 8 of them.\n\nI don't want your sour mix, I don't want some other 'margarita' mix. Tequila, triple sec, lime.", "author": "Jabari H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "It's a Friendly neighborhood place.  The Spanish food is as authentic as it is delicious!  \n\nEverything here is very affordable.  Try the Empanadas, or the rice and beans.  try everything, you will not be disappointed!   Good music always plays, and the Staff is very accommodating and friendly.  I really love this place.  Great for after work, or weekend hang out spot.  \n\nThey added sitting outside for the summer, the place is always packed, so you know its good.   And the owner and manager are often here, and they are very gracious :)", "author": "Elle J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-22", "description": "Brooklyn Tex-Mex was in for a tough review no matter what, given that I am coming from Austin, TX. That said, I was a big fan of San Loco in the salad days of my Williamsburg tenure. So when I found myself living in the bedroom suburb of Dumbo, I had to give the place a shot.\n\nIt's not terrible, but it's terribly overpriced for what it is. If it weren't so close to my house, I'd never set foot in the place. It's hard to screw up quesadillas and nachos, although you should request they not overdo it with the onions or black beans (which they have a tendency to do). The tacos are passable, and the service is friendly when it arrives. The beer is generally cold and they have a pretty decent selection given the single cooler. \n\nI've never had the burgers. But then, why would I? It's a Mexican restaurant.\n\nNote: keep track of your beers, because they tend not to and you'll pay the difference. And if you're long in the leg, you'd better watch your head in here.", "author": "Nash G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-28", "description": "Eat fast traditional mexican cuisine.\n\nMama is cooking, therefore it's not amazing cuisine, but it feels like she wants you to enjoy your meal.\nBeer is cold, food is good and cheap. Cocktails are loaded", "author": "Alex H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-06", "description": "atmosphere and the environment was cute, however, i do think it was a bit over priced considering the quality. service was slow", "author": "Melissa S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}