{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-08", "description": "The only reason why they got two stars was because the empanadas were good. Place is very small and majority of the platters are overpriced for the quality. What is their staple??? I'm not sure, anyways the server. And the waitress were good the bartender sucked...I ask for a long island ice tea, and I could of sworn it tasted like rum and coke. I asked for them to add triple sec and he added more coke??????? Wouldn't recommend.", "author": "Julia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "I go to Pedro's a lot as it's down the street from school. I have to say the owners and staff are some of the nicest people ever. The best mofongo I've ever had (has to be made by the nice lady who cooks there): creamy and very garlicky, and great enchiladas. I introduced my fellow college friends to the $6 rice, beans and meat combo plate (choice of chicken, pernil, beef or fish); they're mostly Latino and loved it. It's in a neighborhood with a few colleges nearby, so the good quality homestyle food at low prices is appreciated, and more in the neighborhood should take note. I don't always need fancy food and it hits the spot. There's been times when one of the owners let me try some food the kitchen had cooked special for them. Really sweet people.", "author": "Silvana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "My wife my brother and I visited this location. Very nice place with a friendly staff. We stopped by for some drinks and they were down very well. The next time we visit Dumbo we will stop by again and try the food.", "author": "Elvin M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-18", "description": "I was wandering around in Brooklyn looking for a place to eat that was still open as I was there later at night I didn't want to go to a larger bar and I stumbled upon this place. There is seating outside, however the seating inside does not give much room for movement. I chose to sit at a smaller table instead of the bar the waiter was fine and the food didn't take to long, but the food wasn't what I was expecting. I ordered frilled chicken with white rice and black beans. To my surprised the blacks beans were my favorite part of my meal. The grilled chicken lacked in flavor and was very bland, something I was expecting to be better from a Mexican restaurant/bar. It's also uncomfortable having to wait for the bathroom because the walk way is extremely small and separates the kitchen and the entrance to the bar. The bathroom itself is also very tiny almost as if I was using the bathroom in a small closet. Lastly overall disappointed with the food most likely will never be back.", "author": "Hector F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-02", "description": "The food and drinks are just really disappointing.  The taco was barely edible.  I had actually forgotten food can just taste wrong.  The margarita was so sweet I winced every time I drank it.  The salsa was more like a mild hot sauce, no fresh tomatoes, cilantro or onions in it.  Maybe I've been spoiled by the taco truck near Sunset Park: Tacos El Bronco 43rd St \u0026 5th ave, Sunset Park, Brooklyn and have grown accustomed to well balanced drinks.  I can handle mediocre food but this was really bad.  The only thing edible was the empanadas which I'm sure are straight from a freezer bag into a deep fryer.  \nThe outdoor host was nice though, I forget his name.", "author": "Jenna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "came here with my boyfriend during DAF.\n\nplace was packed in the middle of the day, although i'm sure the festival had something to do with that.  the space is tiny, so if you are claustrophobic this may not be the spot for you. i had cheese empanadas with guava and my boyfriend had a burrito.  the food was delicious!\n\nthe staff was working hard to accommodate all of its patrons and our waitress apologized to us multiple times for the wait.  both of us have had prior experience in the service industry and assured her it was no problem, although her concern for us was genuinely appreciated.\n\ni would come back.", "author": "Nicole P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-28", "description": "Sat for drinks, did not enjoy vibe, food passable", "author": "Chloe C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-24", "description": "Sat at a table for 20+ minutes, didn't get served then they told us the kitchen closed. What a joke.", "author": "Luis G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-15", "description": "This place was decent. The empanadas were more like tacos and the tacos were like a taco salad with pieces of tortilla. Very messy. But if you can look past all of that and simply enjoy the taste. It's worth it's price. Fills you up.", "author": "Malia V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-18", "description": "Yes, this place is totally great to sit outside and have a beer and a snack. No, this place is not a great place to order takeout. We ordered cuban sandwiches and guacamole. The guacamole was too oniony for most of the group. The cuban sandwiches were incredibly salty-so salty I had to take out the pulled pork in order to eat it.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-29", "description": "Garbage!\n\nEnded up here because we couldn't get a table at Vinegar Hill House, and we were pressed for time. From the look of the place, I knew we weren't exactly going to be in for a culinary adventure, but I thought we could expect some decent Mexican food and drinks.\n\nI had a house margarita which I believe was 100% pre-mixed and tasted like sugar and lime flavored water in a plastic glass. I had to order a shot of premium tequila to add to it which helped slightly.\n\nI also went for the beef fajitas which were also complete garbage. Wiggly pieces of overcooked unidentifiable scrap meat.\n\nSo the food and drinks were both a total fail. Save yourself the trip.", "author": "Bob B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-14", "description": "Came here after the Essence Fashion Block party in Dumbo. It was packed like crazy from all the people coming from the street festival. The wait was ridiculous. We decided to order our food and take it out. The place is very small and dark. it looks like it's the illustration for the term \"fire hazard.\" First we ordered our food and then our drinks. I got regular wings with chipotle sauce to share with a friend, my cousin got empanadas, her friend got a burrito. My friend went to the bar and ordered us a margarita with sangria and a strawberry margarita which both tasted the same to me. somehow got someone else's order which was two orders of chicken wings with bleu chesse, because nobody knew what was going on. Worked for me. Everyone shared food. It was good, but we were drunk so...might want to try it for yourselves.", "author": "Dominique B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-28", "description": "Someone recommended Pedro's as a place to eat the next time I was in Dumbo. I had a friend with me when we visited, and we were both looking forward to the meal. I ordered the Torts di Milanesa sandwich which was absolutely delicious. The chicken cutlet was cooked nicely and paired very well with the avocado. Based off that sandwich alone, I would give the place a four, but my friend was severely disappointed with their Cuban sandwich. She is not 21 yet, and couldn't buy a beer to go with it, so she got a water, but it didn't help with how dry she thought her meal was. It is because of that that I give Pedro's a 3", "author": "Maxwell B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-29", "description": "This is a cute restaurant. Really really tiny, came here two nights in a row during the New York festival of light in dumbo, a Thursday and Friday. We waited a long time both nights, no where to really stand/sit to wait which is a bumber. On Friday the short lady the owner locked the door and wasn't letting anyone in because they were too packed, but she let me in once I told her I had my name on the list. She says she called my name a long long time ago yet i had returned exactly 30 minutes. We were expected to be next but she says there's someone in front of us which I couldn't understand if she had called us a long time ago, I peeked at her notepad and the next party was someone before my name not anyone after me. She told us WE had to watch the table because people will run and try to grab it and also I had a party of 5 and they sat us at a table for 4, me and my friend were sitting on one chair and then I, the customer, had to ask a table who had an extra chair if I could use is. Missing the two stars just because the unorganized dining room and the tight space. Sat at the bar on Thursday and someone was always right on top of my back, guy ordered two shots and a drink and it spilled on me and the bar Infront of me where I was sitting. Overall great place , delicious empanadas and chimichangas .. Cheap drinks that are GOOD, can't go wrong with a $10 piña colada. I would recommend to go during the week to try and miss the crazy rush.", "author": "Leecy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-09", "description": "Come on guys. Seriously?\n\nMy mixed vegetable burrito looks like somebody dumped a bag of frozen vegetables in with some rice and wrapped it up. String beans? carrots and peas?  Plus no cheese, and little to no sour cream for $9.\nMy dates enchiladas were cold, and no happy hour to speak of. A mediocre at best meal and 2 beers for $40.\n\nEff this place.", "author": "Fred D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-28", "description": "Only reason I'm giving two stars is the waiter was a doll.  Guacamole appetizer was pre-made and served in a small styrofoam bowl.  Had a chicken tamale and it was so dry and there couldn't have been an ounce of chicken in it. My friend had the chimichangas and I'd give them a two out of ten rating. Drinks were strong but boring. Love the kitchy decor but not enough to go back.", "author": "Susie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-15", "description": "Service was terrible. One waitress for all the tables outside on a nice, busy evening.\n\nThe torta was one of the saddest things I've ever gotten at a restaurant. Chicken cooked, then overcooked without the benefit of any sauce.\n\nWe ordered chips and salsa but they never arrived. Based on other reviews, I'm glad they didn't.\n\nThe restaurant's one redeeming quality was the chorizo. It was surprisingly good, but I wouldn't call it Mexican. Something middle eastern flavoring it... cloves maybe?", "author": "Alexis S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-13", "description": "Maybe a better place to drink rather than eat. \nSaw it last time I was in this section of Brooklyn and wanted to check it out. The outside is alluring. \n\nInside Smelled kind of like feet. I got a mixed bag of tacos that were suppose to be hard shell...they arrived soft. Tacos tasted pretty generic nothing great, but eatable. Service was slow and it took a while to pay up in the end (place was half full). \n\nA one time stop.", "author": "John B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-10", "description": "Very disappointed by the service here. Was in the mood for some authentic Mexican, saw this place \u0026 thought I would give it a go. What  I saw was a bunch of people who worked there and should have been waiting on customers, just standing around doing nothing. Maybe it was a family affair. \n\nThe waitress came to me once and when she decided to throw on some ghettho music, I realized I couldn't stay listening to that miserable mindset, which unfortunately, I am exposed to in Brooklyn more often then I would like to admit. But in a Mexican restaurant??? Way to kill the vibe. \n\nI said that I was looking to get take out \u0026 then she disappeared for another ten minutes. A group of customers came in, sat behind me and they sounded like an obnoxious loud bunch. After realizing that I hadn't even ordered anything and had been there much longer then I would have liked at that point, I realized, it was just not working out and walked out with my service and all. \n\nIt was mid afternoon, so not sure why the service wasn't better. Wonder if the food would have been any good at all. Luckily, I hopped on my bike and by the time I got near Prospect Heights, I stopped into Pequena and was very happy with the great deal I got there. The music was amazing as well!\n\nOne more gripe, Pedro's did not have horchata. How can you call yourself a Mexican restaurant and not even have horchata. Seriously??", "author": "Jenee R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "I was walking by and saw this place.  It was just what I  was looking for.  I had a freshly made margarita with 1800 and a Mexican sandwich.   it was very fresh tasting but I needed to add a little salt to bring out the taste.   I also liked their homemade chips and their salsa. The staff was very delightful, attentive and informative.  This is also a great place to people watch while you chill out.", "author": "David N."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}