{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-02", "description": "Terrible service. Food was terrible. Beans straight out of a can. Rice right out of a box. Margherita taste like syrup. Would NOT reccomend.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "FUCK THAT PLACE!!!   They add gratuity to a to go order.... \nExpensive\nPortions are really small\nBad service", "author": "Katherine O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "Stopped there one night, on the way to the Ballet..   Not many restaurants were open, so this was the only viable choice.\n\nIt's like a little hole in the wall, very colorful and busy, but not upscale at all...\n\nI got the pork quesadilla and it was not good at all.   The dough was thick and bland...not toasty nor crispy at all.   The pork was tasteless and the cheese had no taste.\n\nNot coming back....", "author": "Robert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "I don't know why this spot has bad reviews... AMAZING FOOD \u0026 DRINKS! Nobody there presented themselves to be a \"criminal.\" if anything, The host/servers/waiters were friendly, amazing and checked up on us often. I was super comfortable, enjoyed the music \u0026 enjoyed my food. - Post review made by a satisfied happy Puerto Rican who will be coming back to this spot (:!", "author": "Destiny R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "I ordered two veggie burritos after work and I cannot believe the vegetables that were used were canned vegetables. The burritos were absolutely disgusting and the cook should be ashamed.", "author": "Ky P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-05", "description": "Tacos were okay, guacamole was okay, the service was ok, they asked me what I wanted to eat even before they gave me a menu. But the margaritas.... it would have you crawling out of the restaurant.", "author": "Alice K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "This place is priced reasonably and their drinks are amazing. The only place I go out to drink nowadays; and their strawberry margaritas are well done. It is a very relaxed feel and I was worried the food wouldn't be good but it was. Their fish tacos are flavorful and filling. Definitely one of my go to spots for a night out.", "author": "Hannah D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "In my two times here, they've both been pretty good. Once while it was super packed on a Cinco de Mayo in 2015 and another on a random September 2017 Wednesday when it was quiet. Good service and the food is amazing. Mexican style steak for the win y'all. For real! You know what I think? I think... What I think is this... I think that you should give this place a chance, and your money by extension. Lord knows they've earned it.", "author": "Tony B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "DONT BELIEVE BAD REVIEWS!!!!!! Ducked in here to get out of the rain and wind before a show at St. Anne's. Low key, dimly lit Mexican dive with simple Mexican food and tasty margaritas. Tamales and enchiladas were particularly yummy. Rose, our waitress and possibly the owner, was friendly and helpful. Love Pedro's! Can't get enough of it.", "author": "Noah R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "I visited this business for the first time with friends and acquaintances. It is a nice place. I did not order any food so I cannot comment on it. The two Margaritas I had were good but I have had better. The music was good. Overall, it was a good evening.", "author": "B. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-25", "description": "I didn't have my best meal here and I didn't have my worst. Will I go back on my own? Probably not unless I just want a drink. Will I go back if a group of friends invite me to meet them there, sure why not.\nThe place is decorated in a divey mexican joint sort of way.\nI ordered the steak taco bowl. The steak wasn't the best quality steak but it was edible. I wish there were more greens in the bowl.\nI ordered the skinny margarita and it was perfect. Just the right amount of sweetness for me. It wasn't cheap but I would probably get that again. \nThe service was decent.\nCould they do better? Yes, but they also could do much worse.", "author": "Leala V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "The only reason why I gave one star is because the prices are decent. But from the time I get there until the time I left the service was absolutely terrible ! Staff was so unorganized, wait time was ridiculous . Staff couldn't even keep up with the wait list ... i repeatedly had to track the waiter down to remind her of my order . My appetizer came out the same  time as my entree , the margarita had absolutely no alcohol in it , and most importantly my chicken had a bad smell , as if it was not properly cleaned . I will NEVER be attending this place again, it Definitely gives dumbo a bad name . .", "author": "L J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-18", "description": "Lived in DUMBO since 2000. Been to Pedro's once. Once in 17, almost 18 years. And i LOVE Mexican food. \n\nIt's painfully obvious this place isn't doing a very good job, based on all of the 1 \u0026 2 star reviews. This place is a dive bar, that sells dive bar quality bar food. Don't expect farm sourced ingredients... or really anything for that matter. \n\nGo there for a margarita.", "author": "Bubbles McTroubles S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "Food was tasty and fresh. I had the fish tacos and a beer and she had the spinach Quesada and a glass of wine that wasn't as bad as I anticipated. Both dishes were good. The portions weren't huge which was fine for us as we weren't looking for a filling meal. The service was HORRENDOUS. We waited 20 minutes for our drinks. Not being  familiar with Dumbo, we decided to wait it out. I even went in to get the drinks at one point and was told that they would be brought out. The drinks had not been set up by the bartender so it's unclear if the server put them in. The restaurant was busy and understaffed. The inefficiencies in service were numerous and glaring.", "author": "Cynthia K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-22", "description": "Keep your expectations low. Was here for a Monday lunch.\n\n1. Very sub-par waitstaff -- waitress made eye contact with me three times and continued to walk by me repeatedly. I had to proactively stop her to eventually get my order in. 15 minutes later I was told they -- during prime lunch hour with a half-empty venue -- were out of chicken and it would be at least an hour. Weirdly, despite the table next to me having ordered well before me, I noticed she didn't tell them about the chicken for another 10 minutes while they waited for their food. The place wasn't even busy, and yet she still appeared stretched way too thin. Perhaps it was her first day, but not a great experience.  Over 20 minutes, I watched almost every table have to nag her more than once for their requests.\n\n2. Don't expect much from the food either. Burrito was bare bones, 90% rice \u0026 beans, 10% meat.\n\nI'd say this can all be offset by cheap prices, but it's not even cheap. I'd imagine this place is more fun for drinks on the weekend, but if you are looking for a legit meal, perhaps go elsewhere.", "author": "David L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-13", "description": "Small place. Bad micheladas. Smallest guacamole I've ever had. I told the waitress the guacamole was so small and she said \"that's the restaurant standard\". The good thing here is they have cheap lunch meals that seem to be convenient if you're very hungry and on a low budget, kind of like a food truck, just indoors.", "author": "Monica H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-04", "description": "I used to come here religiously when I worked down in DUMBO. However, I recently came back because I was in the neighborhood, and I wanted to get my margarita and burrito fix. My fiancé and I were seated immediately, but the wait was longer than usual. As we finally got our order in, we asked to sit at the bar, because the sun was in our eyes. Sitting at the bar was a better idea, because we got more customer service, since the bartender was always present. \n\nI ordered their chicken burrito, and somehow it tasted different than when I came here a year ago. The portions were smaller and the prices went up. Although quality trumps quantity, I would've been satisfied if their burrito had more flavor.", "author": "Florann E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "Although the decor and the server was very friendly we must say that we would not recommend the mofongo and tacos are not the best we have tried .. also the white sangria tasteless.. no good . BUT on the positive side my chicken burritos and rice and beans were good .. Hopefully the Chef will read this review and will try to improve those dishes . Price wise a bit pricey .. maybe because is in Bklyn Hgts . We will try come back in the future and hopefully give then a better review ..", "author": "Mo E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-11", "description": "Seriously lacking Spanish flavors in their food. Ordered the chimichanga and ewk, 0 tortilla, 0 flavor on the beef (ground beef), rice was dry and hard and the beans were not Mexican flavored or cooked.  The food was not bad but don't try to pass it for what is not. Look at the picture i uploaded and you will notice the blah food and extra coloring added to the rice to make it \"Mexican\". Seriously lacking..\n\nseems like people don't care as long as is \"spanish\" of sorts. Someone please make a better restaurant in the area. Skip this place at all cost.", "author": "Juan T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-25", "description": "I used to love this place when they first opened the food was good, now it is just okay. \n\nThey have been a constant in the Dumbo neighborhood for many years and I really wish I could give them more than two stars.\n\nThe service is extremely slow. Never visit thinking you can grab a quick bite if you have plans. We had to leave before our food was ready, waited a full hour and half.", "author": "Anna H."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}