{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "We love Pedro's! Great casual place for a margarita and amazing burritos. Annie is always a great server!", "author": "Meredith D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "I don't normally write good reviews but Pedro's saved me one Saturday. Came here after being turned away from posh gran electrica (they were closed for a wedding)...was very disappointed and hungry until I stumbled upon Pedro's...Very cool hole in the wall dive bar kinda vibe. They make you fresh margaritas (tequila, lime, grand marnier)  if you ask. Also had tofu burrito option. Cool ambiance great service.", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-20", "description": "Terrible service, terrible service. My gf ordered a Sauza with Seltzer and they brought her just Selzter. By the time we got their attention 20 minutes later the ice was melted and they just put the Sauza in with more Seltzer and it was all watered down. When the food eventually came the veggie burrito I ordered had chicken in it. They swapped it out after a long wait. We had to ask for water 6 times before we got any. They did apologize though. The vibe in there is awesome, the food was OK but for the money not great. We were really disappointed with the service.", "author": "Dima K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "I have come here about 4 or 5 times and I have never been disappointed.\n\nI usually get the tacos dorado (3) all in chicken with everything on it. So delicious, I devour every taco. Keeps me full and satisfied for the rest of the day (no need to snack). \n\nHowever, this place is really small. I normally do take out, but I have sat at the table and bar, not so bad.", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-09", "description": "This is a great post party/club spot, but unfortunately due to the really cramped dining area and their extremely loud music, this isn't a great area to do much else than cool out after a night of partying. Full bar, great margaritas-which they serve in Mason jars (How cute is that?)! I came here and had a tofu burrito with rice and beans-good overall, with my favorite part being the well seasoned tofu and some delicious guacamole. Again, if you're just out with friends and want to chill over some good drinks and tacos, this is your place.", "author": "Niomi M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-22", "description": "This place was ok. We had beers and a few tacos. It was good. The place is really tight inside though so it looked like it was packed but really, it's just a small space. Service was ok.", "author": "Jamie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-16", "description": "This place is unbelievably cheap, and the food is very good.  The building looks like the last relic standing from DUMBO past.\n\nI chuckled when I walked in and saw Christmas lights sloppily strewn around the interior, and heard the campy music playing.  The management and staff are so inviting, and something about just being there makes you feel good.  Whenever I'm back in the area, I'll have to stop back in.", "author": "Koku K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-25", "description": "We stopped here after the AfroPunk festival looking to rest our aching feet and sip something a little boozy.  The place is small so expect a wait, ours was only 5 mins to get a seat at the bar.  We decided on a pitcher of sangria since it made a lot of sense economically.  I was disappointed to see that the sangria wasn't something homemade but instead was just something he poured out of a jug of Carlo Rossi, they didn't even throw in some fruit to pretend it was homemade, no bueno.  We didn't have any food, just the sangria, oh and I had a margarita after seeing him pour the tequila for someone else's, it just spoke to me.  Yea my eyes didn't fool me, that was a strong margarita, 2 of those and I would've been set but it wasn't that kinda night", "author": "Samantha U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-10", "description": "Being the only Mexican restaurant in DUMBO, Pedro's can afford to serve overpriced, mediocre Mexican food, with terrible service, and still have people come through the doors each day.  I'm eagerly awaiting the next entrepreneur who will open a competing Mexican restaurant in this neighborhood.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "Fun place for some casual Mexican and margaritas in a very relaxed atmosphere. We stopped in for a very late lunch / early dinner and ended up chatting from across the (mostly empty) room with the few patrons at the bar over items on the five o'clock news. The crew was friendly and accommodating. The other reviews here seem overly critical; we had no significant complaints.", "author": "Kate O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-09", "description": "This place is the absolute worst ! Run in the other direction !", "author": "Jason H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-11", "description": "Staff is friendly but overall this place is disappointing an leaves you with a hole burnt through your wallet. \n\nOrdered Pedro's nachos and there were probably about 15 chips on my plate. \n\nJameson is $9 a shot!!!! I have only paid those prices in the city.\n\n$4 beer which is nice.", "author": "Lightening C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-27", "description": "Horrible, horrible, horrible......to say the least. Went there today with a friend who\nis allergic to really hot food. She asked for a quesadilla on the  mild side-well that's not what she got. She took two bites and realized that the server totally forgot what she told her two seconds after she took the order. She had informed the server that she gets really sick from hot food and the server replied \"we wouldn't want that to happen.\"\n  When my friend realized she couldn't finish her food we switched dishes. She informed the server that she gave her hot food and reminded her that it was not what she wanted. The server didn't even apologize and walked away mumbling to herself.  I encouraged my friend to speak with the manager who offered a piece of flan for our \"inconvenience\".\nWe turned this down and paid the check-needless to say the server was left with  no tip.  My friend ended up a bad allergic reaction eyes got puffy and swollen and\nhad to take benedryl.  \n I tried to get my friend to go back to Pedros to show the manager her swollen eyes, however, she felt that withholding a tip was suffice. I didn't and that's why I wrote this review. If I could give this dump a   minus 5 stars I would, I can only give it a \nwarning label-\"EAT HERE WITH CAUTION\".", "author": "Tina R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-05", "description": "I went here with my b/f and two other friends of ours last night, partly because it was one of the few places open (It was July 4th, so a lot of places had closed up for the day). We all enjoy Mexican food, so we decided it was worth a shot to try.\n\nWe got seated in a table in the back, next to the A/C unit and a very loud fan. After several minutes, we finally got a waitress that took our drink orders. The drinks were decent enough, but nothing to write home about.\n\nAfter several more minutes, we order our food. The first thing to come is the Super Nachos ($13). They were decent enough, but a very small portion for the price. I mean we are talking about chips, beans, cheese, and peppers people.\n\nNow onto the main courses. I ordered the fish tacos, and it took her three tries to actually deliver the correct meal to me. First I got veggie tacos, then I got chicken ones, and finally got (lukewarm) fish tacos. \n\nThe fact that the A/C was directly above us made it so that the food almost instantly got cold. It just made for an unpleasant dining experience. Our one friend who did order veggie tacos didn't get his meal until almost 10 min after everyone else, and then they shorted him one taco.\n\nAt the end, I went up to talk to the manager / owner. She made it like she really didn't care that we had a bad experience, and basically had the attitude that if we never came back it would not matter to her. That sealed it for me. I let my b/f deal with the check and we left, having given the waitress a 5% tip (I wanted to leave her nothing).\n\nSo the moral of this review, STAY AWAY. There are much better Mexican restaurants, and if this is your only choice while in DUMBO, I'd say going hungry is a better option.", "author": "George S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-13", "description": "Vegetarian burrito is pretty boring. Consisted of beans and rice, maybe a few pieces of corn, and a little sprinkling of cotija cheese on top.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "Decided to go here on a weekend night. The location is great and my wife and I had to wait no time for a table. You can sit inside or outside. We ordered couple of drinks that promptly arrived. Out waiter was really nice and made recommendations which we were glad to order. The food arrive in a timely manner and was delicious. Based on the location, service and food this place deserves only a 5 rating. \n\nA must for all.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "I love margarita's so that's what I got. I came here with my boss and we had a few. I most definitely will be back sooner than later.", "author": "Sare L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-17", "description": "Stumbled upon Pedro's after wondering around Brooklyn Bridge Park. There seemed to be more people eating here than anywhere else, so we gave it a try. \n\nI agree with others that inside is small and cramped with a low ceiling, so sit outside if possible. I had no problem with the waitstaff, all the ladies were friendly, accommodating, and attentive. \n\nThe margaritas were good nothing to write home about. I thought the nachos were good. I would not get the plantains again. My quesadilla was also solid. The food is filling and I wouldn't plan on doing much after eating here. \n\nSolid place if you are in the neighborhood and looking for good, cheap food. Would not go out of my way to come here.", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-20", "description": "Tried this place for the first time last night. Let's just say I expected more for that money. I had a chicken burrito, good size, and a little side of guacamole. My boyfriend had Tacos Combo, if i remember correctly, and ended up ordering Tamale because he wasn't even close to full. This cost us 25.5 $, which is way overpriced for this food. I found hard pieces in my burrito, not sure what that was. The guacamole tasted fine, but it sure wasn't fresh, like some puree that came out of a jar. And my boyfriend's tamale seemed microwaved and some insides were still cold. Come on, 25.5$? It all tasted OK, nothing special. For 25 bucks, not really.", "author": "Cristal G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-24", "description": "Went there this past Saturday and sat at a table outside.  The service was terrible as our waitress was too busy entertaining her friends at another table rather than tending to her other patrons.  After waiting 45 minutes for a pitcher of sangria and some empanadas, we get one of most bland concoctions ever with no fruit in sight so we immediately complain.  We were told that the sangria is straight from the store bought bottle and not freshly made so there should be nothing wrong with it. Hello?  If you pay $25 for a picture of sangria, you don't expect to get the best ingredients but you do expect it to be freshly made like most restaurants in NYC. \n\nBesides the watered down drink, we also purchased the aforementioned empanadas in chicken, pork, and beef.  After waiting an extra 10 minutes for silverware and plates, which never came, we decided to dig in hands first.  Truthfully I couldn't tell one meat from another.  Everything was ground to a pulp and overcooked so it had that mystery meat feel.  I got flashbacks to school lunches in the 80s.  Yuck. \n\nFinally we skipped the sangria, paid for the mystery meat empanadas - with no tip, and walked to a real restaurant down the street.  I don't see how this restaurant can survive the change in the area without improving.  I guess every neighborhood needs cheap options but this place sucks.", "author": "Maurice W."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}