{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-14", "description": "Pedros is a down and dirty hole in the wall Spanish fusion place. Service was a bit slow, but our waitress was very sweet.  The food was great.  For appetizers, we ordered Pedro Fries (fries with mayo, chipotle sauce and cheese), and elote (corn on the cob with mayo and Mexican cheese).  I was not a fan of the fries (way to much sauce on it), but the corn was amazing.  My husband had the chicken, fish and chorizo taco.  The chorizo taco was the best.  Fish taco was a bit fishy.  I had the mofungo with pork.  This dish was the highlight.  Pork was so tender and moist.  We will be coming back to Pedros to try out other items on the menu.", "author": "Cindy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-27", "description": "Pedro's is cool. I'm not sure what people are expecting from there, but clearly you've missed the point if you were looking for Dos Caminos style Mexican...if you want no frills, cheap, decent Mexican/Spanish style food, then Pedro's is it..where else can you go to where they set up DJ equipment on the sidewalk, and rock out to old school hip hop, r\u0026b, and house music on Memorial Day..", "author": "Joe T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-31", "description": "The perfect place to sip on a sloe gin, eat some rice \u0026 beans and enjoy some live music or al fresco dining when in DUMBO.  This place has surely been around since long before that neighborhood got its new acronymic name.  Enjoy this kind of place while you still can.", "author": "Paula H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-03", "description": "Pedro's gets the job done for a post-workout meal but I really wish we had a better Mexican place in the area. I'm not picky when it comes to burritos but they could work on making theirs a bit less dry. And the salsa less watery. And the service a bit faster. And the restaurant a bit brighter.\n\nOn the other hand, the chips at Pedro's are well salted.", "author": "Drew R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-10", "description": "the food is a little pricy for what it  is, simple spanish american food. its great food and authentic, its just more than i want to pay for a couple of tacos, or rice and beans.... the reason to come here is the margaritas. they're wonderful, if the older woman (i think she's the owners mother) makes them they're just right, but be careful, you'll start throwing them back without realizing the hangover you'll have the next day... on the other hand if you want a stiff drink, ask the guy (the owner?) to make them and i'd be impressed if you made it through the second drink still standing.\nthe best time to come here is when the outdoor seating is open (summer/fall) as its a little dark and small inside", "author": "JJ G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-10", "description": "awesome, took an adventure bike ride from manhattan to dumbo and it was just awesome, from marguerita to food it was just great, AND i had left my glasses on the table, called them up they had them they made sure the next day that their staff knew where they were and with no problem picked them up! my 4th time there with no change in my review! just have fun and go with the flow!", "author": "Suzy B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-18", "description": "Went here with a friend Saturday evening for a supposedly cheap meal. I got the Quesadilla with Chorizo and we shared nachos with guacamole.\n\nThe chorizo tasted like burned bits of beef jerky.. with a very weird taste. Nothing like any chorizo I've hand... yuck.. also, the cheese on the inside was cold so there was nothing holding the chorizo inside the quesadilla!\n\nThe nachos.. not salted. Guacamole, cheap.. no taste, no salt, no lime, and they added cabbage in the guac dip. \n\nWe were utterly disappointed and confused.. especially with soo many people that night.", "author": "jane t."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-29", "description": "Only gave it one star because no stars wasn't an option. Went there last night to try a new place -- ordered the \"Pedros tapas plate\"  (supposedly a chimichanga, empanada, taco, and flautas - $16) and a tamale.   We were delivered this sad, colorless plate of what looked like Pizza Pockets or other frozen junk food.  Everything looked and tasted exactly the same - like greasy garbage.  No flavor, no discernible spices, etc.    I think this is probably the most disgusting food I've ever had in restaurant. I don't even know what this was -- it wasn't Mexican, it was barely even food.  I wanted to stick my finger down my throat after I ate it, just to get it out of my body.  Yuck.", "author": "Mary F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-25", "description": "Stopped in for one shot of tequila during a Dumbo art festival.  Excellent tequila selection.  The food looked and smelled great.  We emant to come back later that day to eat but never made it.", "author": "Eric B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-21", "description": "I have never found food to be inedible, but that was the case at Pedros.  My husband and I wandered in thinking to have a quick lunch.  I ordered the fish tacos, which instead of being fried where some fish stew.  One bite and I put my fork down.  Absolutely disgusting.  My husband had eggs, chorizo, rice, and beans.  The chorizo was swimming in oil ans tasted old.  My husband ate the rice and beans.  The only reason I am giving them 1 star is because the beer was cold and washed the foul taste out of my mouth.  It is hard to believe they actually get paid for serving food like that.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "The second you walk into Pedro's you feel like you are in Mexico, literally.  It's is our local hole in the wall favorite.  The pork shoulder is slow cooked and to die for, well worth decor and sluggish family run service. The margaritas rock.", "author": "Liz F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-22", "description": "Ok. Here's the deal. Decent food. Grimy interior. Cheap prices. Happy hour is 4pm - 7pm. $3 beers. They have other deals but i didn't get a chance to check those out. food is pretty good. the thing that sells this place is its outdoor seating (we had to sit inside for a few minutes while a table opened up. You're basically sitting on the sidewalk. the eye candy can get interesting. on a nice day... this place is hard to beat. if it's raining - go down the street to hecho.", "author": "ivan j."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-07", "description": "I wish this place were better. The tamales are mediocre. I do always see someone I know there. I remember people who work there being nice but maybe that was when I was still rooting for this place to be worth it.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-10", "description": "I don't know where to start with this place.  It looked very hip and very trendy from the outside and it seemed to be where the party was at.  We asked for outdoor seating on a nice day but since it was peak dinner time, the waitresses were all a little haggard.  None of the waitresses took down any names for the wait for outside seating and just told us to wait inside by the bar.  Another waitress we spoke with just told us to go find a seat even though other ppl were waiting.  Very disorganized!!!  We ordered a pitcher of sangria which was really watery.  Very disappointing.  It did look like a lot of people were enjoying the mojitos a lot more.  When we finally got a seat outside, the waitress didn't clean our table until 15 minutes later and didn't bring us a menu until we kept reminding her we needed one.  We ordered the empanada combo, fajita skirt steak and a quesadilla with chicken as well as some chips with guac and salsa.  Everything was pretty standard.  I think if we went with the more traditional dishes it probably would have been better.  I do have to say the faijita with steak was superb.  The steak was seasoned excellently and wasn't too salty or overpowering.", "author": "Kim W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-28", "description": "wonderful place, small quaint, friendly staff. went by here after walking across the bk bridge... very friendly and polite. the food is fun and exciting. i will def come here next time i walk across the bridge again... cool bk vibe!", "author": "Stash K."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}