{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "This place was perfect! We wanted some Mexican food and had a large group with 4 kids under the ages of 12. This was my first visit to PEDRO's. The waiter greeted us outside, took care of our stroller to help us go down the stairs since the entrance was down a set of stairs. They had the outside area to sit as well but we wanted to sit inside. They were able to get a table and some chairs set up for us and this place was busy. \n\nIt is not a big place inside but we loved the decor and how cozy it was inside. If your taller than 6 foot you maybe hitting your head on the ceiling since it is not a high ceiling. \n\nThe food was fantastic, the kids were able to choose items that they liked on the menu. This place is ok to bring the kids. The service was great, the waitress was on point and checked on us to make sure we had everything we needed. After eating all the food we needed a nap. I would definitely recommend coming here for lunch, dinner and some late night drinks. We will be back :)", "author": "Miguel S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-04", "description": "Not worth the money or time. If you're a Mexican food fan, then this place will be underwhelming for you.\n\nService was not great. But I will give that a pass since there was only one server for the whole restaurant (on a Monday night). \n\nI ordered a chimichanga and it was overly greasy. The tortilla was not crispy at all, as you would expect with a good chimichanga. I got carnitas (recommended by sever) and they were over salted. Overall not good. Additionally, a side of sour cream, pico and guacamole was $5, which would be free in any other restaurant. Overall not a great experience here. Wouldn't come back for food here unless there was a major change with the quality of the food and service. \n\n2 stars because it could be so much better considering it's prime corner location, but they fall short in quality food and service.", "author": "Evan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-14", "description": "I thought this place was super cute for what it was. It's a small Mexican style bar on the corner with decor that is captivating to someone like myself who loves places that have somewhat of a theme. The colors are what caught my attention. Inside is very small and personal but it offers a nice vibe. Our waitress was very nice and it seemed they had a lot of regulars which is a great sign.\n\nI did t eat because I was just there to grab a quick drink which is why I'm giving them a 3star review. They had lots of options for drinks as food. I only had a glass of wine but my boss was with me and she had a coconut mojito. The mojito was ok but with mojitos being my favorite drink and having experience as a bartender I can't help but be a little judgmental. To me it was a lazy mojito because it didn't have muddled lime and it was only made with Malibu (which I love). There's so much more you can do with flavored mojitos and I think if you're going to offer them on your menu there should be some more effort. \n\nThe food selection was large and I love Mexican food however I did not get the chance to try it. I'll definitely go back and give the food a try. Our server was really sweet and friendly that's always a reason to give a place another visit.", "author": "Chastity M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-16", "description": "Would I eat here- no, would I come for a tequila \u0026 beer - definitely if I am around. \nThe place outside looks very interesting when you come in, be prepared for low ceilings even if you are quite short or average hight.  The place inside looks like a puzzle that somebody still trying to figure out, the atmosphere was ok, I liked the bartender, she was very attentive.", "author": "Aleksandra E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-31", "description": "Don't like this place at all. The quality of the food is terrible for the price. I got a shrimp burrito. I know it's something basic but it was so plain. The shrimp and the yuca fries tastes like they were frozen before making them. The michelada was gross tasted like cheap hot sauce and salt. I'm running straight to the bathroom as I write this.", "author": "Erick A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "I love this place. It's a small mom and pop style restaurant  with great food and nice service walking distance from Brooklyn bridge park. The wings and chimichangas are to die for.", "author": "Monique B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-25", "description": "Came here as I was in the neighborhood and really wanted a margarita. Ordered a pitcher for the table and was completely underwhelmed. The margarita had a strange flavor to it. My friends and I were unable to finish the pitcher. Food was meh, shared a shrimp, chicken, steak fajita. The seasoning was a little on the saltier side, and it only comes with two small tacos on the side. For such a large portion of food I would have like a few more, at least 4. For two more tacos its an additional charge. \nOverall, I do not think I will come back here again.", "author": "Diana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-31", "description": "Pedro's is definitely a dive bar first, restaurant second. Despite having a pretty big seating area, and even some nice outdoor sidewalk seating in warmer weather, this is a place you should go to to drink-and-then-eat rather than eat-and-then-drink.\n\nI am a relative newcomer to the Dumbo/Vinegar Hill neighborhood and have heard stories of how this used to be a great place to grab a super-cheap $3 beer and watch a game over some nachos. While most of this still may be true, the super-cheap part is not. The prices have caught up to the neighborhood and now you will pay avg. prices for the drinks and pay slightly too much for the avg. quality dive-bar food.\n\nAll that being said, nothing quite beats some fried Mexican food while chugging beers, so that is why I still come here. You can enjoy it too, you just need to lower your expectations first. You're not going to come to Pedros for a fine dining experience, just some dive-bar drinks, dive-bar food and good company in a unique holdout from before fancy Dumbo moved in.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-30", "description": "Perfectly okay bar for overpriced beers ($6-7 for decidedly non-craft cans/bottles/draft), frozen drinks, and some of the rail-iest rail liquors around.\n\nMultiple coworkers have complained about getting sick from the food here, so I would avoid eating here.\n\nBartender seemed to consistently mess up drink orders, so we got some free drinks while we sat at the bar, so there's at least that.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "Meh. I've been to Pedro's around 3 years ago and remember it being satisfactory for food and drinks. In fact, my friend and I thought it would be a charming experience for her friend who was visiting from England. Today, I brought another friend to Pedro's for brunch,  and felt  less than enthusiastic overall. \n\nLocated on the corner of Jay Street, in DUMBO, Pedro's is a colorful attraction (with street art) as one approaches it. \nThe space inside is quite cramped and small. This is apparent with the very low ceilings that are decorated with Christmas lights and tight tables. Yet, we felt it was the flavor of the restaurant.\nMy friend and I seated ourselves since nobody appeared to be around.\n\nUnlike other Mexican restaurants, this one does not offer the complimentary chips and salsa. Unusual.\nAs we perused the menu, I was undecided  whether to select an egg entrée or one without. We both chose the tofu burrito.\nIt was a bit unclear at first when the entrée described it with \"rice and beans\". My friend and i thought that it was a side accompaniment. Since I don't like rice/beans much, I asked for a substitution. The offer was salad and I was fine with that. Again, I thought I would be getting a side salad.\n\nOnce our burrito arrived, it took a few minutes to realize that the rice and beans \u0026 salad (for me) was included Inside the burrito---not on the side.\nAlso, the burrito was supposed to be topped with sour cream but we asked for it on the side. Guess what? My burrito was served with a generous drizzle of sour cream on TOP. Exactly what I didn't ask for. Overall, the service was pretty bad.  We were given a bottle of water but once it was finished and we wanted more, it was nearly impossible to flag down the waitress. Surprisingly, (despite the poor reviews), the place was really crowded.\n\nMy friend and I were satisfied with our selection even though it wasn't spectacular. But I'm just not sure if i would pay Pedro's another visit in the future.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "The food is excellent! Portion size is big and worth! The atmosphere is terrific! There's outdoor and indoor seating! No long wait for your food. It almost feels as if your home eating! I will be visiting again!", "author": "Nick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-20", "description": "OMG. This has got to be one of the BEST Mexican restaurant that I have ever been to. Their food and drinks are delicious!!!!! The atmosphere, the service, and the speed of food delivery. \nEverything was soooo good.", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-16", "description": "I came in for a margarita. I should have listened to the reviews instead of taking a gamble. \n1) I asked if they could make a flavored margarita on the rocks I was told 'yes'-the bartender gave me a pre-mixed ($8) REGULAR margarita instead of the \"on the rocks\" drink (which is labeled as $14 on the menu.) Fine, I asked if I could switch, once I found out it was pre-mixed and she said no. \n2) It left me with the worst headache. HOURS Later\nBottom Line:\n-cheap liquor \n- poor service", "author": "Relli A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-25", "description": "Awesome hole in the wall Mexican place that we found while exploring Brooklyn. The food was amazing great portion sizes, very flavorful, not too spicy however not too mild either. There is an excellent selection of tequila available, the House margaritas were good; however it's definitely worth trying some of the custom drinks as well. The ambience and vibe is amazing for a small hole in the wall place it makes you feel very cozy. Seating is limited so we sat at the bar however the service was fantastic.", "author": "Rafiki P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-02", "description": "Great environment just too small and margarita as were a little too weak!\n\nThey took too long to attend us and it wasn't that packed !", "author": "Molly A. H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Rose is the best!  I was there today during the TD Five Boro Bike Tour today, and left my helmet there. Maybe I shouldn't have had a shot of tequila, huh?  Anyway, I called a few times till she located and head it for me.  The food is good too. Thank you again.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-21", "description": "Small spot. Food is good. Drinks are good. Especially the mango margarita. The bathroom needs work. Too tight and needs remodeling. I will come back. The menu had a few options I was interested in trying.", "author": "Laura R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "Very great whole in the wall spot. The only thing I would complain about is that the bar seats have your knees run against the hard wood while you're trying to eat. The food tastes very great and original.\n\nThe environment is dimly lit, but the staff pays attention to you. I've had the steak burrito \u0026 the steak and they are both amazing. They keep their culture in the setup up of the place, the environment, and the music.\n\nI would take a date here or even grab drinks here because the Margaritas are GREAT and strong. Looking forward to going back !", "author": "Eva T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Went here for Cinco De Mayo the drinks are really good and strong. It's a really nice atmosphere. The service is great as well. Only thing I would recommend is that they double the soft-shell  tacos because they were really thin. I just asked for another set of shells to double them, but they were fine. Cups  for our drinks we didn't like that it was all doubled with the lime felt unsanitary in a way like I was wondering if they were sat out on the table and the lines were put in then stacked. I would stay away from their guacamole it wasn't seasoned at all. It was just there. I wouldn't even recommend anyone order it. The drinks for sure are really good! My girls and I ordered a pitcher of the frozen margarita worth the $50  two drinks each from that for each of us.", "author": "Sha'velle D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-22", "description": "I think the owner/staff were blinded by our recent eclipse. Service was definitely not provided and there was super shade thrown from staff. Super relevant to eclipse, I swear. \n\nYo, wtttfff. (in the most New York accent I could muster without sounding ratchet) the most disgusting guac ever. It's refrigerated and came put super cold. It was served on a STYROFOAM....yes, styrofoam, mini bowl. Also a HUGEEEE load of onions. I took one bite and returned it. They still had the nerve to try and charge me for it. I waited forever for the correct bill. They didn't bring it so I went inside (they have outdoor seating) and had to get bill. The owner was sitting at bar and seemed to not be concerned with the issues. Only throwing around ingenuine apologies. I didn't receive any water (and it was literally over 90 degree outside. Seriously) and not even one napkin. \n\nI'm writing this currently while waiting on bill. That's how awful my experience was. Had to vent to the world. \n\nPedro's has DEFINITELY changed over the years. Will never return", "author": "Wesleyan T."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}