{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "Best priced, best tasting Spanish food \u0026 we had an awesome waitress named Margarita. I asked her for her name and told her I would write a great review because she made us feel right at home.\n   My sister \u0026 I eat there all the time. This is the first time that we ordered Margaritas and we actually experienced a wonderful waitress who's name was Margarita and she sort of had her own Margarita dance. She was the cutest thing. \n   The food \u0026 drinks were awesome. My best experience at Pedros by far with my waitress. I look forward to going back \u0026 asking for her to wait on us again. Kudos to Margarita \u0026 Pedros!!!!!", "author": "lisa r."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-06", "description": "I liked it. Big menu lots to try. Yucatan fries. Frozen. Oh my.", "author": "Larry K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-28", "description": "This place totally bummed me out.  Just went for margaritas and guac.  It's gotta be harder to make guacamole that bad than it is to make it any good.  All you have to do is mash the damn thing and put some salt on it, bare minimum.  I guess if your sole focus is margins and you're more concerned with turning a profit on guac that is 50% sour cream, then perhaps it's easier to turn a delicious avocado into something so bad.  I had lunch the day before around the corner at Gran Electrica- similar prices and FAR superior food.  Sorry Pedro's but you left me feeling like a tourist (which I'm not) who just got ripped off.", "author": "Sarah R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-09", "description": "The food here is VERY VERY bad.  And yes it does matter if the margaritas come from a mix. Obviously.", "author": "Casey P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-29", "description": "Service was fine.  Food was merely ok.  There are definitely better places to eat.  At least it was cheap.", "author": "J B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-29", "description": "Disgusting. Ive passed by this place numerous times in dumbo and have always wanted to eat there. It looks soo cool. The place is decorated vibrantly from the outside and they have outdoor seating which is always fun. When i finally got a chance to eat there i was nothing but disapointed. The waitresses were aimiable enough, however the margaritas were cheap and gross. The food, was a whole other issue. Taco bell has better quality food than this place. Which is a total shock considering their make-up and their prices ! Their vegetables, salads, salsa, guacamole, was soo cheap it was like mcdonalds vegetable stock. And this meat was dangerous. Me and my friend both ate chicken, i had a burrito and she had a quesidia, and we pulling out cartlige pieces out of every bite we took. The chicken was so cheap im glad i didnt try the beef ! talk about mad cow disease. This place even had the nerve to serve their overpriced food in styrafoam plates ? a carboard box would have been more apealing. In a very appropriate conclusion, me and my friend were sick for 3 days after eating here. Clearly they put all their money into their decor and not a cent into the food that they serve here. Eat at your own risk !", "author": "Maria R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-07", "description": "4 stars for the food.\n\nAmbiance was okay. you can watch them make your food, which is cool just knowing that your food hasnt been spit in or picked up off the floor. \nBecause the decor is authentic mexican. so it kinda looks a little grimey. \nNothing fancy here, plastic dentist cups for water, old liquor bottles serve as water pitcher. \n\nThe grilled chicken rice and beans plate was awesome. I really enjoyed every bite. \n\nThe waitress seemed overwhelmed. She acted as the hostess/waitress/bar tender. So the service was  very slow. for a saturday afternoon. she also forgot our empanadas. And she was not the sweetest girl. I let that slide since she was the only one working on the floor. \n\nIf your in the area I would check it out.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-19", "description": "Tiny bar in a building that looks like it's about to fall down. Fortunately, they have outdoor seating. This place has a great friendly, dive bar vibe. They used to have live music, (quite a feat given the size of the place) usually salsa or latin jazz, but I'm not sure if they still do. A warning: I don't recommend the food unless you've been drinking all night and really need something to absorb the booze, it's pretty greazy.", "author": "Neilson A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-19", "description": "Went photohunting with my friend and we spotted this really colorful place at the corner and decided to drop in for lunch. The interior decoration is minimal with mismatching chairs, but it's a sort of cute place with a lit candle on each table. The walls are pretty unique with drawings that looks like it was drawn with a sharpie. I like the bar they have there. Okay, so the food was cheap and it is relatively pretty good. I like their chicken with black beans over yellow rice. Oh yea the fried plaintains were very good that I can probably eat it all day. The chicken quesadilla was okay. The service was pretty good too. When the weather gets warmer I would love to sit outside the next time I drop by for lunch.", "author": "Sandy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-08", "description": "Pedro's is that awesome neighborhood place that you're a little scared to go into but once you do you're hooked. $3 margaritas and a $4 HUGE cuban sandwich? Umm...yeah! And you can watch the ridiculously overpriced apartment highrise being thrown up as you indulge.  Ahh DUMBO...what will ye become?", "author": "Maryanne N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-27", "description": "I LOVE IT HERE.  Awesome margaritas and a tasty menu, with an awesome wait staff.  Especially Mary.  Eat outside if you can.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-26", "description": "$35 today for two 16oz cups of bad margaritas.  Yes, $35 for a SMALL PITCHER OF WATERY MARGARITAS.  We got the bill with no information or clarity or anything about what we got, just horrible.  The food was marginal at best, but being blatantly ripped off pisses me off.", "author": "Steve B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-08", "description": "Pedro's now sits across from a humungous building that looks like something out of the movie Brazil. Oh well - change was inevitable, I guess. Hard to imagine the owners of Pedro's holding out for much longer, though. Still good for a bottle of Tecate outside with some friends before heading down to the water to watch the lights of the Manhattan Bridge.", "author": "alex w."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-11", "description": "I just ate lunch here and, as much as I wanted to like it, it was simply fair. The service was friendly and the food seemed fresh but was still seriously lacking. My burritio had peas in it. Has anyone ever had a burritio with peas and carrots thrown in? I think they might have been the packaged frozen kind. And I don't believe there was any salsa on it. This may have been my fault, because I ran to the restroom during its creation. I must have missed any inquiries into my fondness for all things spicy. With a heavy sigh, I did my best to enjoy my Brooklyn burrito. Can we finally just admit  that NY doesn't know how to make one? I'm really tired of trying to prove otherwise.", "author": "Tina E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-23", "description": "ah pedro's - I have a feeling I'll be eating here a lot since it's the divey-est place near my new apt that's open during the weekends. I ate dinner here the other day, and overall I enjoyed it. it's pretty cheap, the owners are friendly, nice beer selection and the food is pretty good. I had the pork, rice \u0026 beans, which was very yummy but the rice was kinda crunchy and undercooked. SIGH! I'm asian so messed up rice is a big no no. that said, I'm sure I'll be back anyway, hopefully it'll be better the next time. the beans and pork were really good though!", "author": "Yee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "consistent great Mexican with an A grade - try the Pedros Tapas.   I have lunch takeout once a week. I like that the shells and chips are made in house and everything is fresh.  If you want a fancy restaurant then go elsewhere but if you want honest Mexican Pedros rocks.", "author": "Joe F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-25", "description": "FOOD POISONING.  My wife and I typically avoid this place because the food is terrible: it's bad even by NYC's low Mexican restaurant standards.  But we were both craving Mexican food last night and this was the only place around, so we caved in and ordered from Pedro's.  Big mistake.  We spent the night alternating sitting on the toilet with a bowl resting on our legs.  Really bad food poisoning.  Being a totally crappy Mexican restaurant is one thing, but now I'm staying home from work with bad stomach pain and dealing with my body attempting to get Pedro's tainted food out of my system by any means necessary.  There's absolutely no reason to come here.", "author": "Tristram S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-25", "description": "Pedro's has taken a nosedive since the departure from the neighborhood of stalwarts like Between the Bridges.  I cannot fathom what the new exterior decorations are meant to add.  But it's always kind of funny to see the cool crowd get gulled by mediocrity.  Back in the old days, this was a fine spot to eat cheap, mediocre food and talk to the owner, and perhaps buy her a beer and vice versa.  Now, the food is past the point of unacceptability and the restaurant seems to have consciously traded in on its neighborhood appeal, opting instead for cheap shtick that thousands of postgrad hipster doodlebugs have already rendered obsolete and passe.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "This is my favorite Cuban Sandwich in the city- and maybe I accidentally got it on a good night, but it was amazing. I've been back, and the quality varies, but I love this place, and their Cubano is usually strong. That and great sloppy ambiance. Hope this place can survive in that neighborhood- I love going there.", "author": "Matt T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-23", "description": "This just set the record for the worst service I ever received in my entire life. We were with people who specifically wanted to eat at this place so we grinned and bared it, but you could not pay me to return. We waited for 20 minutes before I went in and grabbed us menus. Then 15 minutes later another member of my party went in to ask if we could put our order in (the waitress had walked by us about 3 times without asking us). I asked for a dos equis, she said what? After asking me what the beer was an astounding 3 more times (literally) they brought it out and sat it 2 tables down. Then the food, bland, no salsa on anything: tacos, nachos, the table. I think our waitress was \"touched\" as they say. She forgot a drink and an entree to boot. Never again.", "author": "Ryan G."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}