{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "Had a very nice experience, food came right away, drinks are good and cheap. Service was nice too, Leo constantly asked me if I needed something. Deeply appreciated it.", "author": "Oytun T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-02", "description": "This happened a few months ago, but still burns me up!\nI cannot frequent a place that tries to take advantage of foreigners.  If you ask people if they would like fresh lime juice in their Margarita, you should disclose that  you are going to charge them $15 a pitcher more and not wait til they are hit with the bill and tell them rudely tough luck. \nOh and the food is so-so.\nNo need to set foot in here ever again...", "author": "Karen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-04", "description": "Worst meal and experience we've had in a long time. They have a great location, but other than that nothing is even decent here.\n\nWe thought \"Oh, they serve late -- even if it's not that great, it's rice and beans and tacos...it will still be OK at least. And the drinks will be good.\"\n\nThe food was barely edible. Chewy \"cod\" in the fish tacos that seemed like something else. My friend said the \"chicken\" was also suspect. The black beans seemed canned, but they were at least fine.\n\nThe drinks (of which we each had one only) made us sick into the following day. Or maybe that was the food.\n\nThey also started cleaning the place with what smelled like toxic chemicals while we were still eating. So joy while eating was sort of out of the question.\n\nDon't risk a bad experience or your health by eating here. Simple as that.", "author": "Brooklyn -."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-03", "description": "Listen to Grace! Tourist trap!  The ratings of this place say it all.  Don't mind the long paid for reviews, they are obviously fake.\n\nPlaced order at 7:18pm.  Had to call at 8:45pm.  Only to get a rude hipster who seemed mad that they were working on a Monday night and took it out on the customer.  They decided to play dumb and tell us the order just got \"faxed\" in.  What a joke.  What happened was this person just found the order 1 1/2 hours later and just realized it.  They did not even say they wee sorry , their response was \"oh no this is NOT out fault\".  Not even an apology after that.  It's another reason DUMBO is not a place to go eat.  This place only survives because there is nothing else around.  Do not waste your time with stuck up staff and Chinese food quality mex.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-12", "description": "As Charlie Barnett said: \"If God didn't want man to eat pu$$y, why did he make it look like a taco?\"\n\nOkay, that's irrelevant--and irreverent. Pedro's is the grungy little pre-rehearsal dive my band meets at; they serve Mexi-Rican food and I always get the tostones. (And never anything else; I can't expect anything to be vegan, although--psst, Pedro: you could make a killing serving vegan food in DUMBO--just sayin.') They appear to be a family-owned business and are very friendly. There's a sign outside specifying that the outside tables are for waiter service only--this means you!\n\nThey have a second location opening up in Williamsburg, I believe; they apparently took over Don Pedro's restaurant (correct me if I'm wrong.)", "author": "Fallopia T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-05", "description": "Happy Cinco! I had a great time! The place is small as heck, so it gets packed to capacity pretty fast. Annie was our waitress she was great! Very personable and attentive. The food was pretty good. Being from Texas, I know good Mexican food, so this place was decent. I'm still searching though. Everybody at the table had something different so we could taste as much as possible. I had the steak fajitas (the steak was tasty!) and I tasted Mexican rice and steak quesadillas. We also had enchiladas which I heard were great and some bowl that my cousin had. All of the food was good, the margaritas were great, and the service was amazing. I had one frozen margarita and everybody else had on the rocks. Everything was great!", "author": "Narvina F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-08", "description": "Slow inattentive service.  Microwave food. Water down cocktails.  Do yourself a favor and keep walking right past this place!  The exterior looks inviting, but everything else disappoints!", "author": "Stacy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "Pricey food, well priced beers($5). Nice atmosphere. Had the super nachos with guacamole ($14) and the taste was good. Warm spot to have lunch in the winter. Food came out quickly.", "author": "Chicken H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "Don't listen to the haters, this place is fantastic! \n\nMy fiancé and I walked in on a packed Tuesday night and sat outside with no wait. Service was prompt and friendly and our beverages and food arrived very quickly. \n\nLet's start with the margaritas: who cares if they are from a mix, they are STRONG. And not like ewww tequila, like total ladykiller. Thank goodness we didn't split a pitcher because I was tipsy off of one. \n\nThe vegetarian options were more interesting than most Mexican restaurants, and we both decided on burritos. They were huge and delicious, every bite seasoned perfectly. \n\nOutdoor seating, strong drinks, prompt service, spicy food, and reasonable prices all add up to a 5 star review in my book. But maybe some people just aren't into that kind of stuff.", "author": "Laura B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-14", "description": "Lower end mexican. I guess you get what you pay for. It's another average place. They could really ramp up the quality of the food, charge a little bit more and the place would be booming. Margaritas are strong, but taste like they are from a mix. \n\nFood is decent for the price, just pretty low brow, americanized mexican food. If you're in a bind and want to sit outside, I'd go back. I live a block away. Not rushing to try it again though. There are better places in the area, although not too many with outdoor seating.", "author": "Arun J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "Friendly wait staff made my steak tacos exactly to my specifications and poured my Pacifico into a beautifully salted and lined glass. Great service, even though they were packed on Labor Day, and the food was fantastic.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "A real Brooklyn neighborhood spot. It is what it is: cozy, friendly and unpretentious.\nTwo experiences warrant the five stars: \n\nFirst, on a cold night I noticed a homeless guy at the doorway, the bartender gestured to the man to stay where he was. The bartender then called into the kitchen, a couple of minutes later a dinner in Styrofoam container was delivered to the man at the door. I asked the bartender what the story was? he said he tries to help out the homeless in the neighborhood.\n\nSecond, after a couple of Coronitas, I forgot my credit card at the bar. I called a few days later and the bartender said he had the card and that he was sorry he couldn't catch up with me that night. When I left the bar he ran out after me but I had gotten in cab so he couldn't return it.\n\nThis is the kind of place I like to support", "author": "Steve G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-30", "description": "Crispy, cheap chicken wings. Decent tacos. Atmosphere is fun and our waiter really elevated the experience.", "author": "James S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-10", "description": "TERRIBLE! don't waste your money. I have traveled a lot and eat out quite frequently and have had some pretty good Mexican food and this restaurant isn't it. upon entering we were seated immediately, in the back in a small corner. the waiter didn't come over for probably 30 minutes. a couple sat next to us and he instantly came to them. the restaurant is probably the size of a cubicle so it wasn't like he didn't see us get seated. it took my friend asking the guy for drinks and food. I asked for a water, never got it. and she had to ask 4 times for a margarita. I ordered the chicken quesadilla and it was probably the worst quesadilla I have ever had. I think Taco Bell might be better. the cheese wasn't even melted all the way and the chicken was super watery. service was terrible, the waiters attitude was terrible \u0026 food was sub par. definitely think there are better restaurants in New York than this place. save your money and don't risk losing your patience like I did.", "author": "Morgan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-12", "description": "I might be biased because I'm from California, but this isn't Mexican food. It looks like Mexican food. But it sure doesn't taste like it.", "author": "Dennis C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-25", "description": "Really not much good going on here at all. \n\nThe food is so so so mediocre for Mexican food in NYC. The guac is terrible and brown! The pico is just roughly chopped tomatoes and onions with tons of cilantro. The salsa is runny.\n\nWe ate a veggie rice bowl and a black bean and cheese quesadilla. They were both fine and edible. And definitely nothing more. The rice is neon orange and has peas, corn, and carrots in it and actually isn't bad.\n\nPretty overpriced, too, for the quality of food you get. And the service is really nothing to rave about. One waiter who forgets things all the time and does not know the answer to any question.\n\nThere is outdoor seating, but it's in a completely deserted area, so no ambiance whatsoever. The inside is dark and dingy. The bathrooms are oddly located.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-06", "description": "-WAY over-priced\n-Microwaved vegetables (not fresh)\n-Tostadas don't have refried beans....craziness!\n\nRecently moved to Downtown Brooklyn and ordered in from Pedros for the first time....and last time.", "author": "David G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-20", "description": "I stopped by Pedro's after schmoozing in DUMBO. I've passed it several times, often tempted by the cantina look, and so today I popped in for an afternoon nosh. \n\nI tried enchiladas and ordered a side of guacamole and salsa. \n\nThe enchiladas were good, and definitely authentic in taste. The guac and salsa were great, too, but they did not merit $7. The total bill was like $18, and I was a bit shocked by the steep price.\n\nI'd definitely come back. Very good service.", "author": "Alexandra K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-22", "description": "Nasty food in a pseudo dive. Can't understand how it stays in business. \n\nWant to echo another reviewer who said the tacos tasted like cat food. \n\nThe guacamole tasted like it came out of a giant plastic tub. \n\nWaitress was friendly but never bothered to clear away our plates even as she did so for tables next to us that were empty. \n\nYou get used to this in NYC but still disappointing.", "author": "Pete H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "Dumbo Brooklyn, meet Nicole. Nicole, meet your new home. holy fluff nuts, I mean, I've heard of Dumbo's awesomeness but honestly couldn't figure out how to get to the other side of the water. I mean...who's ever heard of the F train to York avenue? (crickets)\n\nDear Pedro,\n\nYou had me at, wtf is that vibrantly colored mexican bar looking thingy? Enough with the chatter, I had the monfongo (mashed green plantain molded into a ball) with the fried chicken chunks. It's not often that I find this dish on a menu in NY and I have to say yours is the best I've had this side of Puerto Rico. My husband had the fish  (cod) tacos and plantains. The cod was a little salty and not what we are used to in a taco, but we loved the presentation and how easy they were to swallow without chewing. (um, yeah, he's working on that..)\n\nWe both tried the mojitos. the first one was pretty tasty, but the 2nd one explained why you have it's name tattooed on the side of your building. what can I say? We love your food, your servers were on point and obviously aiming to please. Your the coolest, most colorful piece of real estate in that badass part of town, and  i love you and because of you we are now looking for deluxe apartment in the sky down under the manhattan bridge overpass.\n\nlove your new \"Norm\"", "author": "Nicole O."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}