{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-21", "description": "I didn't know whether Yelp would accept  zero stars so one star was the lowest I could go.  What a dump!  Loud and wrong !! One of the worst dining-- no, that wasn't dining, that was feeding and some animals have had it better.It tasted like a bad frozen dinner. The rubber chicken wasn't even hot; we had to send it back because it was served lukewarm; the plates were returned to us one degree hotter..  The bathroom hasn't been cleaned in years.  We left before we became completely deaf.  They use little plastic cups for water, which the waitress stuck her finger in to separate.  \nDON'T EAT HERE IF YOU HAVE ANY RESPECT FOR YOUR TASTE BUDS OR DIGESTIVE SYSTEM.", "author": "Valerie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "I was in the area. Starving after this long monotonous meeting and I saw they had a dope lunch special. Plus I could look no further for food. I loved this family business. The staff had great genuine energy, service was fast and with a smile and the food I had was awesome. I had the steak burrito and had them add veggies. Mm hmm good!", "author": "Dannielle C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-29", "description": "This place is more (or less?) than a dive. It's kind of a s***- hole. The margs were way too syrupy and the atmosphere is gross. It feels dirty in there (they served the margs in plastic cups and it's in a basement.) The bartenders were nice. The salsa is super spicy (as in the traditional salsa that comes with all the chips). The bartender did search tirelessly for the Red Sox game for me, which I thought was nice.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-21", "description": "Relatively recent transplant from CA, and we went understanding the general admonition that NYC doesn't do Mexican well.  Pedro's is not helping NYC's cause.\n\nFood is flavorless and overly greasy (and overpriced for what it is - which is sad considering it's not exactly pricey to begin with).  As others have said, Taco Bell is better.  And the only patrons enjoying themselves are those at the bar drinking, a lot (which may or may not add to your dining pleasure).\n\nDo yourself a favor and try something else.  Anything else.", "author": "William S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-03", "description": "Pedros is a fine option in Dumbo to get a drink in an intimate atmosphere.  Its been around forever and its run by pretty nice folks, despite some of the negative experience by fellow Yelpers.  Drinks are pretty standardly priced for the area, 6 bux for beer, 9 for margaritas.  You can sit at a table or the bar.  If you eat, its going to be salty and service will take a while, but it will be cheap.", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-28", "description": "Not coming back here again.  One and done.  We came in to try as we live close and we knew with 2.5 star avg this was \"average Mexican\".  It underperformed even those unlofty expectations.  \n\nFair review of my experience:\n\nPros: Supposedly great margaritas.  Bar that has 2 tvs, can watch the game.  Burrito was serviceable, but meh overall.  Tacos were serviceable but meh.\n\nCons: I went with a party of 3 and sat at the bar, we ordered guacamole to start and got tacos, a burrito, and a sandwich as entrees.  Got beers in bottles.\n\nGuacamole was weak.  Store bought, watery but at least had tomatoes.  Chips were stale tortillas, hard.  Salsa was... some canned taco sauce... no chance home made.  \n\nBeers were stale, like they were in the fridge for 4 months.\n\nFlavor wasn't there, not a lot of mexican spice.  Just didn't seem like kitchen or help was really trying to do anything authentic or special.  A hole in the wall with store-bought and quickly prepared \"mexican\" themed food choices.  Disappointing.", "author": "Alexander S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "I had the best time here.  Okay, maybe I was smitten with the food after the long stroll across the Brooklyn Bridge, but the server was super sweet and kept us happy.  I got taco combo and a margarita.  Both def hit the spot.", "author": "Bryn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "Great diamond in the rough. Such a great escape from the newer places opening up in dumbo. Get a margarita and some mofongo or enchaladas and you're set.", "author": "Justin R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-07", "description": "I felt dirty and not in a good way.  Part of that feeling may have been due to the fact that the toilet, which is right next to the kitchen, flooded and the guy who mopped up the mess came out sprinkling pee juice all over the place.  Nice.\n\nYada, yada, yada...I ate a pork tamale, beef taco, rice/beans, plantains and a Brahma beer.  It was all pretty fair.", "author": "Mariposa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-15", "description": "Stopped in for a quick sip and chat and here is what my score card reveals:\nCoconut mojito: 10\nHomemade nachos with guac: 10\nLook of the food as I snuck a few looks at the tables from the bar: 10\nSmells coming from the kitchen.....definitely worth coming back for!", "author": "Ava H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-16", "description": "Solid neighborhood joint. Decent food -- great people and service. Walk in expecting divey bar atmosphere and looking for a place to chill and grab a bite you will be pleasantly surprised. Fancy it is not...", "author": "Matthew D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-03", "description": "PED-NOs\n\nMy boss is going to kill me if he sees this (he loves this place) but um metal sharp thing in my mouth is kind of a deal breaker for me. And I'm the kind of gal who barely bats an eyelash if there's a hair in my food, or if I drop something on the ground. I'll (disgusting as it may sound) still probably eat it. But metal? ehh.. have to draw the line somewhere. \n\nPrior to the metal incident, the burrito was meh. Tasted like canned rice \u0026 beans and microwaved chicken.", "author": "Daniela A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-24", "description": "Should have gone to chipotle. Didn't like the burrito.  $7 little guacamole thing unappealing.  Will not return again.", "author": "James W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-08", "description": "Literally the WORST Mexican food I've ever eaten. \n\nFish tacos tasted like they were made with cat food. Guacamole was smashed up avocado served in styrofoam bowl. Didn't think you could mess up chips, but they were super bland and tasted like cardboard. \n\nFor a place that looks so cool on the outside, the food is seriously god awful. Do NOT recommend.", "author": "Carolyn G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-15", "description": "Never coming back here again. Food is horrible. Probably the worst burrito I've ever had. Service is awful- our waitress spilled water on me and had no clue about anything on the menu. Food took ages to arrive. I'm pretty sure my piña colada had little or no alcohol in it. It's a shame that this place is lousy because the location is great.", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "Dirty place dirty bathrooms glib rude staff bad lemonade (margaritas = mixer without tequila) metallic objects in the 'food'. Extra charges for chips with the thimble sized serving of ' guacamole' (also watered down).  Two thumbs down and don't ask for ten more chips extra it's extra. don't come here?", "author": "Sean O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-03", "description": "Went here today for lunch - to go. The service was relatively quick and the wait staff is nice. I really want to like this place but the food is terrible.\n\nFirstly, the burrito I ordered was barely wrapped together. There was no salt on anything. It was completely unseasoned.\n\nThe sweet plantains were microwaved to oblivion. They were dry and also unseasoned (which, if prepared properly do not need to be seasoned).\n\nFor $16 for a burrito and a side which took 15 minutes; both microwaved - I'd rather buy an Amy's burrito for $2.50 and microwave it myself.", "author": "Melissa B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-22", "description": "Pass it by and head to any one of the better spots just a block or so away in DUMBO.\n\nI'm currently lying on the couch now waiting for my stomach to settle after my meal of Mexican the cheap and microwave way...  Every one of the dishes tasted the same, bland.  Even the chips and salsa, for which you pay, were stale.\n\nYou walk in and its packed so you think \"oh hey looks promising\" but you fail to realize the people having a good time are simply having drinks.  If you're not too tall you can stand around inside and wait for a table to open up.  Service will eventually come and you order your drinks, the longest wait, put in your food order and with in five mins the food will arrive.\n\nSo, yeah... If you haven't gone yet, there is no need, just keep on walking and head to something down the street.", "author": "T S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-12", "description": "Nice spot!  Loved the feel, loved the energy, and the food was good.  Only had the empanadas but they're top notch.  THE ONLY ISSUE I had was a certain waiter.\n\nHe wasn't very attentive for a place so small AND I witnessed him do a wet \u0026 sloppy sneeze into his hands.  After which we wiped his hands together and kept serving customers.  He event kept looking at his hands and rubbing them as if there was remaining slobber on them!\n\nThankfully I already finished my meal but it still made my stomach turn.  I watched him for a good minute to see if he would eventually wash his hands but it didn't even phase him.\n\nThey need to be stricter on employee cleanliness for me to go back.  Call me a germaphobe, I don't care.  I don't want somebody's mucus touching any plate that's served to me...\n\nBTW, two stars b/c the empanadas were really good.", "author": "Byron W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-09", "description": "This place has gone downhill.  The only highlight is that the beer is cheap and a cute waitress.\n\nThe nachos are very disappointing and you get a dinky side of guacamole that maybe takes care of 1/3 of the chips to dip in.  Both are bland.\n\nThe corn with cheese and spice is just ok.  \n\nQuick and easy.", "author": "Peter K."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}