{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "This restaurant is always my all time favorite. They food is good. Definitely a good place for people who want to try out some real Mexican food and super strong drinks! Yes, make sure you try their home made margarita and mojito! The staff are always friendly and nice. Don't forget to look for the best waiter/bartender Dillinger there. He'll take a good care of you. Oh, don't forget to order the cheese quesadilla!", "author": "Amy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "This place is one of my favorite Mexican joints. It has all the options you could want with authentic taste. It's not \"Tex-mex\" bs.\nThe drinks are alright-ish (the margarita pitcher is supper sweet) Definitely one of my favorite Mexican spots hiddden away in dumbo. It's no secret to the local but they've managaed to Keene it that original flavor", "author": "James B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-29", "description": "I can't believe I didn't check yelp before I went in.\n\n\nFood was not authentic at all, you can't even call it Spanish. Or edible...\n\n\n\nAll of these dishes are catered for white people and also service as well.\n\nMy party of 4 ordered Cuban sandwich, Mexican sandwich, beef enchiladas, and quesadillas.\n\nAll of these dishes lacked in the authenticity and flavor but I was around this area and everything else is so expensive. There is literally nothing to eat in dumbo... (the coffee scene is quite bad as well)\nEverything is overpriced and we sat waiting for food for maybe 50 minutes and that is way too long to make 2 sandwiches, enchiladas and quesadillas. I didn't mind the long wait too much.\n\n\nIt wasn't until I saw a white couple who got their food within 10 minutes.\n\nWe also ordered wings and guac and chips and those were OKAY. Guac was good but it needs to be a bigger portion because I've seen way bigger than this for 10 dollars. The person who ordered enchiladas vomitted and the reviews were right. The food is not fresh other than the avocados. \n\nPlease check your yelp and avoid places like these.\n\nBad service and bad food.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-17", "description": "Loved the decor and atmosphere, but was super disappointed in the food and the prices for that matter. My tacos were bland and the chips were soggy- way too overpriced. If they stepped up their game with the food this place would've been amazing.", "author": "Matthewww S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-23", "description": "Food was mediocre - chips were stale, guac was okay, entrees were somewhat decent but not very flavorful. Service was extremely slow and I even had to get up and go to our waiter to ask for our check after waiting for such a long time. At one point we needed a fork and after waiting almost 10 minutes for one, the waiter brought us two knives and it was impossible to track him down afterwards. Would NOT recommend.", "author": "Chiara M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-29", "description": "Pedro's is bad. Don't go here/order from here expecting anything more than sullen service, crappy drinks made with cheap sugary mix, greasy cheap food, and an overpriced bill. I'm not sure how its survived this long in Dumbo but hopefully it'll be gone soon! Ordered last night after two year hiatus (I am pregnant and wanted enchiladas, fast) and was reminded why we don't eat there. Hard greasy food- the beef in the burrito and tacos was rock hard and tasteless, unseasoned salsas, sloppy delivery with food totally falling apart in its container, and employees then arguing with us on the phone about replacing damaged items and pricing for things that were supposed to be included (rice and beans, as described on Seamless). Skip it.", "author": "Katherine B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-13", "description": "Not a bad option for Mexican food in the area.\n My friends and I needed some serious fuel and this place definitely satisfied our needs.  The waitress was really sweet, the decor was fun and grungy and the food was pretty good-definitely not the freshest or most exciting Mexican food but totally did the job.  If you're in need of a good, warm meal then this is a great place.  My friends told me they have outdoor space in the summer and decent margaritas too.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-13", "description": "I would give ZERO STARS if possible.  Here's why:\n\n1.). The staff are a bunch of borderline criminals (I'm quite sure some indeed are actual criminals--not panhandlers or jaywalkers but legitimate murderers and serial killers). \n\n2.). The food is blatantly atrocious.  I ordered the mofongo (which is actually a Dominican \"acronym\" for Mother Fu*cker Good).  Anybody that puts a dish on their menu with the MF word in it is well.....a criminal.\n\n3.). Regarding the mofongo.  I ate it.  And then I literally proceeded to fart it out of my anal cavity for the next 3 days.  Hot hole galore. \n\n4.). Back to the staff.  As I was waiting for my mofongo, some loud mouthed waitress/criminal came storming into the bar and advised the bartender/mafia boss that some \"puta c-word\" is sayin' \"her mother effin\" food is cold.  Juan Gotti took it in stride and said to this lovely gem of a person \"you tell her it's supposed to be cold\".  \n\nIn short, this place is a mofongo.  It smells, it's gross, and it will leave you upset for days.  Don't go here and support this placeZ. Just because you like \"dive bars\" doesn't mean you like shi*.holes.", "author": "Ryan X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-22", "description": "Quick bite before dashing out of DUMBO for stuff in midtown. Thought we'd get an affordable bite before we waded into the sea of tourist priced nonsense. Boy did we get more than we bargained for! First they had a sandwich board out front that said $6.50 for some lunch special with various meat options. Easy enough. I ordered the $6.50 special from out front - beef. Waitress: \"the special is 7\". I wasn't quibbling over .50 I merely wanted to insure I was ordering the special. So I say the one on the board for 6.50. She walks away, looks out the window at the sign only to return and share with me the sign's wrong: it's $7. Gotcha. I'll have the False Advertising Special of the Day then. Food was about as authentic Mexican as Taco Bell. No less. I've had red beans in Central America. Those, those are chili beans. Flavorless doesn't describe it. Sorry it's a miss on a couple fronts. Hard pass.", "author": "Rob O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-28", "description": "The soft shell tacos were flavorful with the abundance of cilantro. They were out of frozen margarita  but had them on the rocks. Had one and left buzzed. Took a hot minute to get served upon seating ourselves. I like the ambience of the place and it was not too noisy. I liked my overall experience, but the wait to get served was REALLY annoying and not what I am used too.", "author": "Natalie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "Came here strictly for the drinks. The drinks and staff are amazing. The margaritas are made from scratch with fresh ingredients and the bartender is very sweet and involved with the customers. My friends did not complain about their food. So I am guessing it was great. Just heads up the salsa is very spicy. I gave a star off because the prices were off on a few things and didn't make sense such as the difference in margarita pitchers with ice is $15 more and the single drinks were pretty pricey. The setting  is very cool downstairs with lights and low ceilings, u feel the tropical vibe in Mexico. Will return again.", "author": "Monica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "Best margaritas I've ever had.... it's kinda small but it's perfect for happy hr, lunch hour with co workers or alone... I am definitely coming back for some more watermelon margaritas. Their appetizers were pretty good as well. love love their decor. From mariachi sombreros in the ceiling to Xmas lights and license plates from different countries. This place is a must...", "author": "Karen R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-19", "description": "Pedro's \nNY BK Dumbo\n5pm Wednesday 18th January 2017\nTwo Stars\n\n\nIt's awful and wonderful at the same time. It's a I-don't-give-a-flip kind of bar. It's tiny with low ceilings, plastic cups, and bartender talking on his phone for his entire shift. Happy Hour Beers were $4. The food was horrendously bad. It tasted like cafeteria Mexican food. The nachos were a bowl of chips topped with beans, cheese and then microwaved making the chips half soggy. The slices of avocado were under ripe and under seasoned. The burrito was equally disappointing. Doughy microwaved flour tortilla with packaged rice and beans and mysterious meat carnitas. They have wifi but it's only for their credit card machine. \n\nI would love to come and get wasted here.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-11", "description": "Love the environment very accommodating with large groups. Great service ! Great food!", "author": "Tifany G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "Ummmm.  Jalapeño margaritas should have raw jalapeños not pickled ones.  And they shouldn't have red hot sauce in them either.   Annnnnnnnd....when someone doesn't like their drink you shouldn't charge them for a replacement.   ANNNNNNND....when someone says \"excuse me sir\" 25 times at least acknowledge them and look at them like a decent person.   And it smells like a wet diaper in here.  Nope nope nope.  Byeeeeeeeeee.", "author": "Nabil N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-10", "description": "AWFUL place with disgusting, overpriced gentrified-Mexican food. I lived in New York for 4 years and always walked by Pedro's and thought it seemed super cute. One day towards the end of my time in NY, two friends and I decided to get dinner here. Our service was incredibly slow, the server messed up orders, everything was small-portioned + overpriced, and my friend's ice cream tasted like it'd been in the freezer for months. She and I ordered a burrito to share because it was so expensive, and sure enough it tasted bland and was at least 30% smaller than what we could've gotten somewhere else at half the price. I was shocked when two women told me they were crazy about this place a few weeks later, but then again they were rich gentrifiers living in the area.\n\nBottom line: steer clear of Pedro's if you're looking for decent food or a good time. Support authentic Mexican restaurants instead.", "author": "Elle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "I don't know what's up with the negative reviews here. Every time we come, the food is great, drinks are strong and service is kind. Their nachos are amazing- some of the best black beans on nachos I've had in awhile. Margs are super delicious, and my wife loves the Mojitos! Really fun to sit at the bar and relax. This is a gem among snooty restaurants in dumbo that are all the same. You can wear what you want and just chill out. And how can you not love Mama?!", "author": "Lindsey C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-19", "description": "Nothing much to say:\n- Meh service: our server was scowling all the time like we made his day really bad; he was impatient with my Japanese friends who can't speak too much English.\n- Pricy plates  with small portions and expensive drinks of cheap taste.", "author": "Jingqiao H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-30", "description": "Between Sodium Shack, one three many $25 pie-only sit-down shops, and whole pay check by the River cafe, I feel like DUMBO is pretty much a food desert. Which is why my feet have wandered into Pedro's more often than normal. \n\nI'd already had my sodium fill of deep fried burger and fries earlier that morning and wanted something that I could be proud of. Rice, tomatoes, lettuce you say!\n\nFor some reason, it always seems like a good idea in my head (divey, Spanish-y food in my favorite neighborhood, yes please) until I'm staring at the menu. \n\nI think this place is ideal for a post Brooklyn bridge park beer during happy hour. Very friendly staff, divey space, but the food will leave you longing for more. \n\nI was really hungry that day and hoping to leave rolling out to my stomach's content. I was leaning towards the veggie burrito since it seemed most filling, but the bartender swayed me to his fave 'spinach mushroom quesadilla'. I don't know why I agreed, but I feel like we've all been there at one point. Needless to say I was very much underwhelmed. It was a baby quesadilla with a sad gathering of 'pico de gallo' onlooking from a distance. I ate it r e a l l y s l o w so I wouldn't have to order another entree, while simultaneously drooling over my friend's seemingly generous tacos. \n\nAfter drowning it in salsa, it was closer to flavorful (canned mushrooms and all). I also scarfed down the handful of $5 chips and salsa because #hangry", "author": "Racquel B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "If you think coming here is a good idea, you're wrong. If you are desperate for Mexican food and think \"it can't be that bad\" - you're wrong. I'm actually still sitting at the table as I write this. The service is sub par, we waited 12 minutes for our drinks (two frozen margaritas and one beer in a can). This time is an estimation but was dramatic enough for me to time how quickly our food came. It arrived 34 minutes after ordering- we ordered two taco dinner plates and one quesadilla.  At 26 minutes the server assured us our food was coming. \n\nIt is not packed and we were sat at 4 PM on a Sunday.  The food was below grade Tex mex, lack of salt and over all flavor. I will not return- not even at my lowest desperation's for Mexican food. Id rather take an Uber to a Taco Bell and then an Uber Home and would have a faster, more enjoyable experience. Our bill just arrived, 9 minutes after requesting. $100 for three drinks, two taco plates and a quesadilla (with tax and tip)- what a waste.", "author": "Brandon M."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}