{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "Kinda like eating in a rowdy closet, but it's a great vibe. If you manage your expectations you'll more than enjoy it-- this place is feisty, vibrantly decorated, the food is decent and the tequila is...tequila. Because it is so small I imagine the experience is highly dependent on how packed they are-- I've been there twice and once was packed, once was almost empty. I would come here with buddies, but definitely not on a date, there's zero privacy. As for the lasting value of the meal? It's all about the company.", "author": "Lindsey L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-20", "description": "Service was very slow. Took almost 30 minutes to get our food and another long wait just to get the check. The guacamole was bland. 2 stars only because my entree was good.", "author": "Malica B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-22", "description": "The graffiti made us want to eat there but when we got inside the place looked dark and small. The food was good, the price was ok but the service and ambience was awkward. They use small plastic cups to serve the drinks, Not appropriate in a restaurant.", "author": "Mary M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "i just had lunch there...it was great.  i had the tilapia, beans and rice.  when i finished i asked for some bread to soak up the sauce. i returned a completely clean plate.  service was fast and friendly...everyone was smiling.  i'm definitely going back.  maybe after work for a margarita? \ni'm really not sure what i would change about this place.", "author": "Alan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-04", "description": "Terrible, terrible service. The food is overpriced, and frankly isn't that good for them to treat my friend and I the way they did.", "author": "Dame K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-07", "description": "No me gusta.  Not a bad spot for cool drink after roasting in the sun at Brooklyn Bridge Park, but that's about it.\nThe nachos were laughably recognizable: store bought chips sprinkled with shredded bag-cheese and microwaved.  Just like home, except I had to eat them with pants on.\nI like fried, breaded fish for my fish tacos.  We asked, and the waitress said the fish was breaded.  Maybe it was breaded at some point, but not in the days leading up to our arrival and subsequent ordering at said restaurant.  Maybe it fell off somewhere, leaving bare a chicken-like texture and an aquarium-like flavor.\nEnchiladas were solid, but it's hard to screw up soggy chickentubes.  They came with EXTREMELY orange rice.  If you squinted, it looked like a pile of traffic cones from an helicopter.  I imagine the DOT has such a pile.\nMargaritas were decent, except that we we barred access to the (green?) salt lodged under the rolled rim of their plastic cups.  Um, this is Brooklyn; have you heard of mason jars?", "author": "David K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-30", "description": "As I lay here dying from a stomatch ache. ill warn you to never eat at this nasty ass tasting food that is over priced AF. And don't even think you will get your food at a reasonable time let me keep it real with you, if you really hungry don't even bother to come here. It took 20mins to get my soda that was only in the fridge (it was type warm when I got it too).  I'd might as well as walk to the fridge and grab it myself. Now let's talk about the food it took about 20 more minutes for my food arrive and I only ordered corn... that corn was disgusting I'd might should have gone to the kitchen to make it myself. So I order empanadas instead cause ya girl was hungry and I was like how could they mess up empanadas ITS A SPANISH RESTAURANT LIKE COME ON B. My son that salsa verde was water I deadass dipped my empanada in and it was like drowning it in water... Btw I'm smart enough to not complain about my food or service being that I work at a Mexican restaurant myself nor am I that kind of customer to do so but listen boo I could not hold my frustration in. I was all up in that restaurant saying how the food was nasty and how they was taking way too long.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-18", "description": "\"Down \u0026 Dirty Mexican down in DUMBO\"\n\nThere is something wonderful and authentic about Dumbo.  It is gritty, loud and a hipster-free area (HFA) of Brooklyn. No wonder so many movies are shot here.\n\nPedro's has the feel and menu of a food stand in Mexico.  No, not Cancun.  And no I said stand not a truck.  SoCali doesn't count.   Here you get a long list (not a menu) of items, mostly alacarte, that range from lightly finessed guacamole, fried plantains, hardshell tacos, chimichangas.  It's all there.  * I ordered Pedro's Tostones which were awesome, my friend ordered a very respectable cheese quesadilla.*  Hot sauce is made there served in a cheap plastic bottle. While it soars in true, honest ingredients, deep fried cheapness it lacks in many respects.  \n\nI gave this 3 stars, but it could be higher depending upon your situation:\n* You are not on a date.  Unless you want to say you are very cheap\n* You are ok with sitting outside.  Or you don't want to have a conversation with anyone.  \n* Actually don't come here unless you can sit outside, so avoid in the winter.\n* If fried foods are not your friends, you will find mostly enemies on the menu\n* You don't have to be somewhere later.  Anywhere.  No matter how late.\n\nThe slow service while sitting in a low ceiling eatery with heat lamps casting their glare on you, while impacted by rock-star level noise isn't  my thing. Thank god tourists won't come here though.", "author": "Brion R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-15", "description": "the food here is plainly stated...disgusting!\nbasically an insult to Mexican food.  \nnachos with soggy lettuce.  tricolored chips that were made in some distant factory.  \nthis place should please go out of business soon please thanks\n\nthat being said service was great.", "author": "Sarah D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-26", "description": "Pretty good food, I'm not going to lie, but for the amounts that they are charging they can at least clean the bathrooms.  I actually said this to the manager and he just reacted with a blank grin.", "author": "Misha J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-14", "description": "I recently went to this restaurant. It was not good! The food made me and my s.o. sick --it was covered in deep grease. The charizo was just cheap sausage! This would all be fine if it wasn't slightly overpriced. My s.o. had to take a Bayers after the meal because he literally felt like he was having a heart attack! For drinks its a cool spot--but that is about it! The waiter was sweet and helpful and its too bad he had to serve such shitty food.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-04", "description": "\"Is that a tomato?\"\n\"Umm, I'm not sure. Maybe it's an onion? Or lettuce?\"\n\"That was supposed to be pico de gallo, right?\"\n\nLook, I don't remember the last time I just didn't eat my dinner. OK, maybe there was one time when I was seven and my barely related aunt threw a gob of peas and cheese salad on my plate. But sometimes, traumatic childhood memories resurface in the form of a quesedilla from Pedro's. It was the same foul joke that they would have served in the elementary school cafeteria--that slightly defrosted, inedible mass that's taking up space on your styrofoam plate. I had three bites and threw in the towel. A paper towel, to be precise. Which lightly blew into my dixie cup, knocking over the half shot of water it contained. But whatever, right? It's part of the kitschy charm...\n\nThe servers are useless. I couldn't find her so asked some other woman about the mysterious and off-putting contents of my quesedilla. She informed me it was Mexican steak. I have no idea what Mexican steak is. I'm reasonably confident it's not actually steak. She blew me off.\n\nOn the flip side? I guess the chips were pretty good. \n\nNot going back.", "author": "Greg C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-17", "description": "Meh. Another average place. Went here with a whole crew of friends after a party one night. Having said that, not a lot of room in the place. \n\nThe food itself tasted alright, but not memorable. Had better Mexican fare in other places.\n\nThe best part about this restaurant is that it's near the subway station. That's not saying much.", "author": "Angel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "Came here for the first time last night and was very pleased! We were seated very quickly and had our drink orders taken almost immediately. Can't really go wrong with that. The chimichangas were AMAZING. I tried chicken and pork, but pork was better. It's kind of pricey, but it's also DUMBO, so. The drinks were yummy, though not super strong for the price. Our server was a such a gem, I really enjoyed her. I can respect the added gratuity, it ensures people won't skimp on the tip. Our service was amazing so it's sad to think someone would, but you never know.", "author": "Summer K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "Best priced food in DUMBO. I could definitely see why some people might be turned off by either the layout of the place or the waitstaff, but going beyond that and enjoying your food in the smallish restaurant is exactly what I did. \n\nThe one thing I didn't expect was the fact that you can't order food at the bar. They'll set you up at a table if you want food. \n\nThe margaritas were pretty good, and they definitely weren't watered down. plenty of cheap beer options as well. The tamales and nachos are excellent. \n\nI'll be back, for sure.", "author": "Mickey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "After spending two hours with a broker and putting an application on an apartment, my boyfriend and I were exploring our new hood looking for Grimaldi's when we happened upon Pedro's. \n\nColorfully painted, and built into a sunken area in the street down a few steps and through a creaky door, Pedro's boasts some pretty delicious Spanish style food. Now when most people hear Spanish, they think either Espana or Mexico but Pedro's is a fusion of Latin cuisine from other Spanish countries like the Dominican Republic too. \n\nThe bar was pretty packed when we entered and a few couples were having dinner too. I ordered the chimichangas con pollo con arroz y frijoles negros (chicken chimichangas with rice and black beans). Danny got the Mofongo con pollo (mashed green plantains with chicken), a traditional dish he grew up eating as a kid. The chimichangas were pretty delectable. Covered with a semi spicy spanish style bbq sauce and sour creme, a little ensalada and the rice and beans on the side made for a delicious mix of flavors. The mofongo, which was my first ever, was covered in a tomato based sauce and was quite tasty but the chicken wasn't meaty enough four our liking. \n\nThe service was friendly. Our waitress was just attentive enough and very sweet. The space is super casual and a tad muggy though they have AC's and fans blasting on high to cool off the space. Overall, I feel like I'll have a craving for one of their chimichangas soon. Good thing they deliver!", "author": "Valerie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-07", "description": "WARNING! RUN AWAY FROM THIS PLACE! DONT EAT HERE! SO NASTY!\n\nI went here tonight with my husband because they had outdoor seating.  \n\nWe sat down and within 5 seconds, the waitress asked us what we wanted to order.  Uh, can you give us a minute to sit down and look at the damn menu?! We asked for a minute and then she came back like 30 seconds later to ask us what we wanted! So annoying! \n\nWe ordered chips and salsa to start and the chips were so stale and the salsa was straight out of a jar.  Who gets salsa and chips wrong, really?!\n\nI ordered the chicken enchiladas and my husband ordered the chicken fajitas.  Both of our dishes were so DISGUSTINGLY nasty we couldnt eat it after a few small bites.  My husband asked for a small side of sour cream and the waitress brought out a side of rotten brown lettuce, rotten pickled red onions, sour cream, and some parmesan cheese.  She charged us $3 for those tiny sides that were BROWN and rotten!  I was so pissed off but just wanted to get out of there quick so we paid and left!!!  Nothing was fresh!  Who gets basic Mexican food wrong like this?! Really?! I was so pissed off that we had to pay money for this garbage!\n\nThe waitress didnt even bring us water before we got our nasty meals.  And the thing that also killed me was the cheap ass plastic utensils that were given to us that was not even able to cut our damn food to eat!  Maybe it was a sign, to just NOT eat the food!\n\n\n\nNEVER AGAIN! THE FOOD IS DISGUSTING!", "author": "Peggy O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-23", "description": "I used to love this place, and get lunch or dinner and drinks all the time. The food was cheap and generously portioned, the staff is friendly, and the drinks were reasonable enough. These things made up for it being cramped and usually too loud to relax. \n\nI don't know what happened, but at some point they drastically cut back their portion sizes. I'm not talking about just a little bit, but drastically and quite obviously. I went back repeatedly to be sure that it wasn't an anomaly.\n\nIn short, it's now a loud, overpriced ripoff, unless you absolutely love iceberg lettuce.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-02", "description": "I don't think that a Mexican has ever set foot in the kitchen, and maybe not even in the restaurant. The fajitas were spiced all wrong (and made from the wrong cut of beef), the tortillas were toasted crispy, they had mofongo on the menu. I don't know where the menu is from (I suspect Puerto Rico), but it sure ain't Mexico.\n\nThat said, the food is pretty tasty, tho very simple (no vegetables, nearly nothing vegetarian), service was friendly, liquor flowed quickly, and the check was light. So a good 3 stars.", "author": "Alan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-19", "description": "The only reason I even put a star here is because you have to.  This was just HORRIBLE!!! I'm so pissed off with this place.... Grr, so pissed!!!\n\nOkay so this is my story. Last night, a couple friends/ coworkers went out for a drink so we decided to try this place. As we got in we had to seat ourselves at a table.  Finally the waitress (who seems to be the only waitress working there) comes over and gives us the menu. I felt rushed because she immediately asked us what we wanted. How am I supposed to know what I want to order if I haven't even looked at the menu yet, genius?! We order nachos, and asked for some cheese at the side, she brings out another order of nachos with salsa instead. Then I order the Huevos Rancheros which was gross as hell.  I felt like they just took the black beans out of a can, heated it up and put it on the plate. It was Ewww!! I forced myself to eat it because I don't like wasting food. \n\nSo we're leaving and then we go to pay. I can't wait for the waitress who doesn't seem to be paying attention to us so I go to the bar to pay and I tell the guy put $15 on this card and the rest on the other. I specifically said fifteen mouthing it out because I had a feeling this was going to happen. When he ran my card he charged $50 instead!!! I have yet to see my $50 credited back to my card. I dunno why, but that made me really really upset. I think he was hoping I was drunk and wouldn't notice.\n\nConclusion: Stay away from this place. Keep your money or spend it elsewhere. Service is terrible. Food is terrible. And they tried to pull a fast one on me. \n\nTwo words... NEVER AGAIN!!!", "author": "Candice F."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}