{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Idk why it have such few stars nor do I care. Great music, strong booze, funky decor. I dig it a lot. We came to refuel with drinks and apps and exceeded our expectations. The pitcher of margarita actually had tequila and the chips and guacamole hit the spot. We also had the Pedro's tostones, on point.", "author": "Megan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-05", "description": "The claustrophobic feeling, the garage and run down overall kind of vibe felt authentic. Even the condiments in Corona bottles were a nice touch. However the prices definitely not justify going here. Happy hour was pretty lame and, sadly, the food as well..", "author": "Adam O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-15", "description": "This spot was recommended by a local but was lackluster in both drink and food. We ordered appetizers and two meals and a pitcher of margarita.  Plain, not much seasoning or fresh ingredients.", "author": "Niki F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-28", "description": "Worst service ever. The waitress asked me twice about my order cause i am vegan and still I got the wrong dish!!!! She also mixed with my friends dishes!!! The food was only ok not more!!! The restroom is the worst I have ever seen!!!!! Will never come back!!!!!", "author": "Ido T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-05", "description": "Good food friendly prompt service, a bit cramped inside, but i was told there is more room with their outdoor seating. If true I would easily have given it a 4.", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-10", "description": "Bright lights, bright colors, loud music... this place is everyone you'd want from a mediocre experience.  The tables are quite smushed together, which makes it cozy, but with the loud music in the background, you're basically eating in a sound chamber.\n\nThe food was mediocre at best.  Nothing of spice, nothing of flavor.  Points for having a tofu burrito, but not so good if you don't prepare it.\n\nFrom other yelp reviews, it seems this place is a tourist trap.  Totally makes sense - it's quite visible from the touristy walk-throughs.  Search yelp a little more and be adventurous.  But hey, this place does have a bar...maybe that's all you need?", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "Geez, I'm so surprised at the many horrible reviews. I had a great experience at Pedro's. The guava and cheese empanadas are soooooo good. I'm obsessed with the fact that I can get a corona in my rita, that made me most happy. I also has a chicken burrito which was very filling. \n\nYes, the place is a bit cozy and probably uncomfortable if you're over 6ft, but I would come back. Cool spot to visit after chilling in the park", "author": "Desi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "How can you NOT have a good time here... Festive, inexpensive and great margaritas!!! The low stars tells me there are a lot of whiners in Dumbo these days!", "author": "Charise I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "great food, great drinks , great atmosphere! \nthe service could have been a little faster but that's about it", "author": "Zandra J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "I love this place. It's tucked away in a nice corner. The food is amazing, I've had the steak burritos and it's to die for. \n\nI also recommend the pomegranate margarita. Delicious and well balanced. \n\nThe staff is really friendly and up beat. The only downside is the wait especially in the evening. This place can get packed and for good reason. There's more room in the warmer seasons as they have outdoor seating. \n\nDefinitely a place I'd return to when I'm craving Mexican food.", "author": "Denisse P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-11", "description": "This quaint Mexican is a mainstay of revelry when we are in Dumbo. The service is quick and pretty standard fare offerings except for that crazy drink with the beer sunken in.  \n\nWhile I'm no expert I would say I've had better and I've had worst so Pedro's when you want a nice fish taco and drown it down with a classic Margarita.", "author": "David N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "OVERRATED OVERRATED OVERRATED did I say OVERRATED? First of all I want to make it clear that this has nothing to do with the staff. They were attentive and courteous. This goes to the quality of food and drinks . I really wanted to try a lively place where I can enjoy sitting outside sipping on some awesome margaritas during the summer. Just moved to Brooklyn from the city, so I was excited to try this place. It all went downhill very quickly .... first of all they gave us cheap plastic cups . We started with the chips and guacamole and chips were stale and guacamole was very bland. My husband ordered chicken quesadillas... no taste . I ordered tamales and they were just ok. I was hoping the drinks were going to win me over , but I was soooo wrong. I ordered the coconut margarita and all I could taste was the heavy pour of cheap tequila with some sour and a hint of coconut... terrible!! My husband's margarita was a mix of tequila and sour. I seriously think this place is busy because there is really nothing else like this around the Dumbo area. So disappointed.", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-12", "description": "Clearly whoever owns this place has one plan - to declare war on Mexico. I challenge you to find worse Mexican food in New York. Even better: the place is a total rip off. $9 for chips, salsa and guacamole. Salsa tasted like hot sauce, chips were inexplicably fluorescent green and the guacamole tasted like it was from a powder mix. The prices are ridiculous and for your pains you get your water in Dixie cups and a ripped paper towel for a napkin. The prices are seemingly pulled out of thin air by a 5-year-old. I'm pretty sure the owner went through a very bad breakup with someone who is actually Mexican and now wants to offend every Mexican in New York. Bring an antibiotic to go with your food. You might need it. Can't believe the people of Dumbo haven't forcibly shut this place down.", "author": "Julie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Not really sure why they have 2.5 stars. Awesome service, really good margaritas and super nachos. It's a bit small inside but they also have an outside seating area. I will definitely be coming back.", "author": "Shantal W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-21", "description": "Crule Summer was playing and the rest of the sound track was classic rock and 80's hits.\n\nThe space is cozy and we were mid way through fall so it made for a nice experience.\n\nI had the empanadas one beef one chorizo, they were ok. My girl had tacos and really liked their pork.\n\nThe margaritas were ok. I can't really complain nor can I really suggest  you go out of your way to have one.\n\nSadly this is a 3 star. I want the food to be fantastic so they can stay open. I don't know how long the Dumbo community will support medium quality place like Pedro's.", "author": "Michael O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "While everything else was either closed for business or closed for food, Pedro's was wide awake and open! 10 pm in Brooklyn,  you can't close shop! Pedro's sidewalk tables welcomed us in , as did the smiling , dapper Dillinger , our waiter.  At that hour, we opted for drinks and apps.  Dos Equis ambers are usually hard to find in most establishments, Mexican or otherwise.  No problem at Pedro's.  They had plenty of cold ones there.  My cousin had the Bulldog... the margarita with a beer bottle in it! Remember to swish it around and mix it up, otherwise you'll get trashed on the margarita before the beer drops! The sample platter with the chicken soft tacos,  beef chimichangas and pork flautas were delicious. So was the Mexican corn. The mixed empanadas were wonderful too.  This was my 2nd time there.  Service was great both times. So if you're Down Under the Manhattan Bridge Overoass and want a nice place away from the crowd at the pier, remember Pedro's for great drinks and food!", "author": "Eddie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "Have worked in the area for a few months, but just went in for the lunch special for the first time today.\n\nAt lunchtime, $6 gets you a huge container of rice, beans, and your choice of meat. We went for the baked chicken, which was super tender and literally fell off the bone.\n\nThe chicken was nicely seasoned, and the rice and beans were great. Take it to go and eat by the river. And $6? This has to be one of the best deals in this part of Brooklyn. Happy to add it to the rotation!", "author": "Max S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-09", "description": "Meh service, expensive food for small portions, but great drinks. Their empanadas are tasty but a bit pricey. My friends and I weren't particularly thrilled about having to pay for chips and salsa.", "author": "Faye F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "If I could I would give them a 0. Not only did we wait over an hour and a half for our food but one of the waiters said a very racist comment towards another customer. Very uncalled for! I would not recommend this place at all!", "author": "Amy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "Stopped by randomly when we were in the area. Drinks were very good. I recommend the Pedro margarita. It's a marg/sangria mix. Very good on a Sunday afternoon in the summer.\nI had chicken quesadillas. Rally good and the cheese on top was excellent. My gf had the steak which was also really good. \nOverall nice Dumbo spot for lunch reasonably priced with good outdoor seating.", "author": "Jason P."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}