{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "The food is actually pretty awful and they know it. There are some menu items that the staff will flat out tell you not to order because they aren't good. But the staff are nice.\n\nThey do have ridiculous drinks like a Margarita with a beer in it and its for sure a good place to people watch. It's not trying to fit in to DUMBO at all. It's ramshackle and there's nothing artisanal or local or green going on. \n\nIf you can understand patronizing a place you know is bad just because there's something about it, you'd like Pedros. I sure do.", "author": "Leah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "I can always guarantee good food and A nice homely environment here. They seem to know their regular customers by name and what they like to order. The food comes out quickly and it's always good as any other day. They could work on the waitress being more attentive to customers at their tables, but I guess it's because it's usually pretty busy in there.", "author": "Carl-Anthony W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "I'm not in DUMBO a lot but I always try to eat here when I visit. I always feel welcomed and the waitress goes over the menu with you if you have any questions. There are a lot of tasty items on this list.\n\nGood:\n-Pernil with Rice \u0026 Beans!\n-Margaritas\n-Huevos a la Mexicana\n-Chorizo\n-Location: it's right on the corner of Front \u0026 Jay St.\n-Nice intimate spot to have a conversation\n\nBad:\n-Parking in DUMBO is terrible..take the subway.", "author": "Daniel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "Had lunch here. Was hesitant at first because its hard to find a authentic mexican spot in NYC. \n\nPlace was small but I liked the ambiance; definitely different and was feeling the theme. \n\nThere was only one bartender/server who worked both the bar and floor pretty well. Excellent sense of urgency and anticipating guests needs early. I believe she was overworked considering there was 8 guests at the bar and about 6 tables on the floor; but she managed to give everyone excellent service. \n\nI ordered the escalade margarita for $14 and the spicy Chicken Tinga enchiladas for around $13. The margaritas were excellent!!!  Great kick and perfect balance of flavor \u0026 liquor. The spicy chicken tinga enchiladas were flavorful, spicy, delicious. \n\nI will definitely be coming back, just wish it was closer to were I lived.", "author": "Eric R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "OMG, this place is awesome!\nThe mofongo was so yummy! Love the tri-colored tortilla chips! My boyfriend always gets the fajitas with jalapenos \u0026 habeneros and it always smells up the place lol and love the fact that they put their drinks in molasses jars :P\n\nPedro's Bar \u0026 Restaurant really makes DUMBO more lively on the corner of Jay St \u0026 Front St after 9pm. It gets a bit cramped indoors, so if you're a little claustrophobic, there's outdoor seating. There's always music playing, and when merengue is playing, don't be surprised if you find some of the wait staff break into dance!", "author": "Hope L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "My father owned several restaurants one of which was Mexican. So, I know a little or two about the business and service.  I gave this place a go, but the moment I received my water in a plastic cup, I knew it was going to be a losing battle.  The food was noting to rave about.  The portions  small and tastes.  The atmosphere was like a submarine during chow time.  Watching fat unshaven hipsters talk about how great this place is, reinforces my belief that this country and city are lost.  You want real Mexican food?  Cross the border at San Diego, don't take the F Train to York Street subway station for this place.  As for the money spent here $$$$, I considered it a loss.a", "author": "Bo K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "Our group of 7 waited 30 minutes for nachos to come out, the restaurant emptied out during that time. It took another 30 minutes for most of our food to come out, and our friends burrito took over an hour to show up. The place was not busy, and it's not clear why it takes that long to put together a mediocre burrito.", "author": "eugene w."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-09", "description": "Not particularly a fan of their food, but the place is close to subway and has a nice feel to it. Plus in summers they have an open air seating adorned with graffiti walls which is kind of cool. I had a coconut mojito which was nothing but normal mojito served with shavings of coconut in a plastic cup. The Mexicana Burrito was still better than the cocktail which came at a hefty price of 11$.", "author": "Neha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "We had the super nachos and loves them! Not sure why the restaurant only has 2.5 stars but we're not letting that stop us from coming back for more :) next dish... Shrimp burritos!", "author": "Mary S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-08", "description": "The worst Margarita. The worst service. And the tatted up dude is racist and a punk. Try figuring out a person's culture before assuming they're Caucasian, rather than in actuality Bi-Racial. Should be irrelevant regardless. You should serve ALL people the same and with some courtesy as well... Can't teach someone common sense I suppose. You also couldn't pay me to go back to this place. It's whack and not even a good representation of Mexican anything. Okay, that is all (the review is boring me; much like the establishment and the staff). Perhaps the owner should evaluate who she or he hires. Salud!", "author": "Julia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "Thanks to Yelp and Pedro's my niece and I had a great lunch. We enjoyed fish tacos, shrimp tacos and Mexican corn. Everything had such great flavor. We both had never had Mexican corn and agreed that it was different in a great way. Fish and shrimp tacos were awesome. Would totally recommend this place. Nice hole in the wall with great food and service.", "author": "DEBORAH T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "A little gem in Dumbo. We ordered guacamole with salsa and chips. Tilapia tacos and tacos dorados. My boyfriend is Mexican and he's a chef and he said the food was authentically Mexican. Everything was delicious. We loved it.", "author": "Louli G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-05", "description": "This place is over priced and absolutely awful! My burrito bowl was cold. Our chips were half portion plus it cost more money for extra chips. The queso looked like it came out of a cheap jar and they charged $9 for it. The margaritas might as well have been lime juice. Hands down one of the worst restaurants in the area.", "author": "Billy F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-12", "description": "I came here on a Thursday night with friends and we waited a long time for our food order. They did not serve chips and salsa like 95% of Mexican restaurants, which would have made the waiting time a lot more bearable. My tilapia tacos were pretty much flavorless and the tortilla was already soggy and cold by the time it was served.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-17", "description": "A random spot in the cool DUMBO area. The place is not good if you're tall as you'll bash your head on the ceiling. Their drink prices are kind of steep but I guess the rent there is nuts. I ordered the tilapia dish and Pedro's tostones. Let's start with the bland and could be better which is the tilapia. It was a simple two piece tilapia swimming in some red tomato concoction from who knows where. Definitely scary to look at. The highlight was Pedro's tostones which a bit pricy for $13 was tasty. It was 4 tostones crisped right with a guacamole spread and some really well seasoned shrimp on top. A dish of that shrimp would be awesome! All in all a ok spot.", "author": "Anis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "Pedro's was the place my friends and I were at at the start of a crazy night. So naturally I associate it with wild times. \n\nDrinks are stiff, food is good, the owner is flirty. There's not much more you can ask for from a Mexican restaurant!", "author": "Drea V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-19", "description": "Gosh I wanted to like this place. We walk by every week, it looks so cute and fun and authentic. But unfortunately it's generic, Sysco-quality processed food and drinks full of high fructose corn syrup in plastic cups. \n\nThe staff is unbelievably nice and helpful and friendly, too bad the food they have to deliver is so mediocre. \n\nOur chips had no flavor and the guac was brown and saltless. The wings were hot and tasty - in that deep fried out of the box kind of way. Good flavor though. \n\nThe margarita pitcher wasn't very strong, and the added sangria in their house special is too sweet. Not strong is an understatement. Not sure there was any tequila at all actually. In fact, our apps and drinks were so mediocre we chose to not order entrees. \n\nGreat place to sit and drink just beer, if you don't mind the tables, floor, and menus being a little sticky.  Come soon though, I'd be surprised if somewhere a bit cleaner, more authentic, and more fresh doesn't put them out of biz as the neighborhood changes. Oh yeah, and be prepared to show your ID to pay with a card - pretty low class.", "author": "Benjamin K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-13", "description": "Perhaps doesn't deserve a one star rating. Michelada was probably the worst that I'd ever tasted. Corn on the cob was pretty tasteless. To top it all, we were charged a gratuity of 18% when 5 of us were sitting at the bar. The bartenders were not rude to us but kept fighting with each other.\n\nOverall, left a bad taste in the mouth.", "author": "Seeta S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-13", "description": "Probably the worst Mexican place I've been in NYC. Really bland flavors. The classic margarita is nice because it's big and cheap ($7).", "author": "Rafael A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "The food and drinks here are amazing for the location. Great place to meet up and then head to dumbo . Service is a little slow, perhaps because it's summer time. Try to find a seat near the AC. The drinks are strong so don't rush it or u may end up getting a super buzz. Make sure you eat and drink. Enjoy :)", "author": "Nina D."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}