{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-10", "description": "I give it two stars because it was at least eatable, the restaurant is very well decorated. The staff had a very uncomfortable attitude as if they didn't want my money. When eating the food the enchiladas are very salty and everything was very dry. They have no sauces to dip anything in and the only things that actually made my visit well was being outdoors far away from the workers and the rice isn't half bad.", "author": "Kassandra R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "Yes its small,,yes its crowded doesn't that say how awesome it is ? I recommend sitting at the bar the food is banging and the sangria is on point. Your going to have to wait for a table especially in the summer but its worth it.", "author": "Jai H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-03", "description": "I don't give a sugarless sourpatch kid funk, I love this joint.  It's a relic, and as the skrapers' erect all throughout Dumbo and gentrification breaths it's pressed gills, I hope Pedro's never dies.  It's sort of a relic - it's quick and dirty, delicious, cheap, and the margs will knock you down six doors down from the the side entrance.  \n\nThey have have outdoor seating, which is ideal to people watch especially on a hot summer day cause sitting downstairs in the actual spot can get hotter than Hades nuts with the kitchen area in the open.  Cool joint to jump into, perhaps you should peep it.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-22", "description": "This place is surprising as Hell. \n\nI went here for lunch while exploring DUMBO, and everything from the dive-bar aesthetic to the hilariously frustrating menu format* indicated that I would regret this decision. As far as service goes, few things are worse than having large delays between the arrivals of each dish; my friend's sandwich arrived way before my taco and empanada. \n\nIt turns out that the painfully long wait was worth it. My chicken taco was shockingly good! It was perhaps the best I have ever had. The corn tortilla shell was fresh and pliable, the chicken was well seasoned and juicy, and the relish on top imparted a nice crunch to every bite. The salty cotija cheese added an extra layer of amazing flavor to this humble taco. \n\nThe empanada was also world-class, but was out-shined by the taco. The golden fried shell reminded me of an eggroll wrapping. The chicken within was delicious. \n\nSince both items were fairly small, and I wasn't expecting them to be so tasty, I ordered an additional taco. When the waitress mistakenly brought an empanada, she graciously (and generously) offered it to me on the house and only charged me for the taco I ordered. \n\nOverall, this place greatly exceeded my expectations. It is certainly rough around the edges, but its foundation of great food and courteous staff could not be more solid. I look forward to accompanying my chicken tacos with a margarita next time. \n\n\n\n*For the curious, the items on the menu are listed in alphabetical order, so if you were looking for tostones, you would naturally have to look under P -- \"Pedro's tostones.\"", "author": "BT F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-18", "description": "I've been twice. The first time the staff was straight up rude - my bf and I walked in for a drink and they basically told us to leave bc they would be closing in 30 minutes. The second time we got a couple Coronas (happy hour price $3) and ordered the Pedro's nachos @ $8 which was 10 individual tortilla chips topped with some cheese and a jalapeno. My boyfriend and I couldn't believe what we had gotten. We wanted to order more food, but decided against it because of the nachos. Staff was very friendly the second time around, hence the extra star. Will not return.", "author": "Shara C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-03", "description": "I went on a Sat night and had the quesadilla and fish tacos.  The quesadilla was too oily and the fish tacos didn't taste fresh. The magarita was a bit too sweet as well. I will likely not go back again.", "author": "Helen L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-19", "description": "Went here to eat with my mom, the place looks cute from the outside. They have outside seating which was nice. My mother ordered chicken tacos and I ordered the beef burrito. The food was horrible! My mom hated her tacos, and the burrito was nasty and not like any other Mexican burrito I've had. It tasted stale, and gave me a stomach ache afterwards. I ate half of it because I was starving and paid. It had yellow rice, beans and bits of beef in it..the kind you put in spaghetti. I asked for hot sauce and it was nasty as well, don't know what brand it was but it was red. My mom goes 'the owner of this place can't be Mexican'. Anyway I won't go here again, and it was overpriced for crappy food. The service was fine although the server had way too many tables for just himself , he was pretty busy. The glass water bottle we were given was also dirty inside, you can see they don't wash them well.", "author": "MaraLee E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "Tight spot...did i say tight spot? TIGHT spot. :-) The ambience you can not get anywhere else in Dumbo. This is Brooklyn baby...100%! I agree with it being called a Mexican Bar with no Mexicans in sight but regardless, it is a quick spot to dip in and out for a drink. Don't even think about bringing a crowd here.", "author": "Carl L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-18", "description": "I walked around all of Jay St and this was the cheapest joint (why is Dumbo so pricey??).  It was brightly decorated from the outside and you need to go downstairs to get inside.  The place is an average (more on the smaller) side, and we sat at the bar since we only had about 30 minutes until we had to see a show down the street.\n\nThere's $2.50 tacos that come on tiny plates, and all the contents just kept spilling out (the fat was dripping out, too).  They were pretty solid and well-filled.  We ordered yuca fries for $4 but he forgot, so we just said forget it.  We were given a huge liquor bottle to pour water for ourselves, which is always fun.  They used cheap, plastic cups though, which took away the ambiance to it all.\n\nThe margaritas come in bigger, rounder cups and are $8 each for a multitude of flavors.  Didn't get one, but they looked pretty good.  Overall-just another average joint.\n\nI went to the tiny restroom and got locked in for a bit there.  Don't know what was up with the door, but it was a scary full minute until I was able to tear myself out.", "author": "Lili K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-16", "description": "Weekday lunch. A bit crowded, one waitress, we sat at the bar. The service was actually good. Empanadas and carnitas quesadilla. Crazy thick fried dough, tasty chicken filling. Way thick tortilla and decent tasting pork ( not really enough crispy bits for carnitas). No rice and beans. Also no chips and salsa. Decent strong margs in annoying mason jars. I hate even seeing Brooklyn hipsters.", "author": "Chris R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-03", "description": "This was my third attempt at this restaurant and I think it gets worse every time, if that's even possible. The  food is terrible. Margaritas taste artificially sweetened. Chips were old and tasted like they were on their second deep fry from month old oil. Ingredients are not fresh... I would not recommend this place for anything.", "author": "Brooke C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-21", "description": "I was attracted to this place by it's festive exterior paint job. I like it. \nInside, it looks like a dive bar. That's not necessarily a bad thing. If you're looking for a hipster-friendly Mexican dive bar, it's entirely possible that this could be your place to down a half-dozen shots of tequila. \n\nHowever, I was looking for food. Don't go here if you want to eat.\nThe food isn't prepared fresh, it's sitting in some bins under heat lamps.\nI ordered a beef burrito and sweet plantains. I had to ask for some hot sauce, and it came in a big, sticky (dirty), plastic jug.  The hot sauce was vinegary, watery and not spicy. The burrito was fairly small, had reconstituted ground beef, and was lukewarm. The fried plantains were completely overcooked (I was picking sticky burned lumps of them out of my teeth after leaving), and were swimming in grease.\n\nIt didn't sit well in my stomach, either - I think it was under those heat lamps for a few hours too long.", "author": "Althea A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-15", "description": "All I can say is that this place is really mediocre. First off the service was poor. We had to wave down the hostess to start getting service which instead she wound up providing. We ordered chips and guac and salsa. Again we had to flag her down after we sat for 10 min w.o so much as a look. The guac wasn't fresh and had no salt in it. The salsa was spicy but a weird tomato soup consistency...and on top of that they served it in paper plates. I ordered the steak fajita and rice and beans while my friend ordered a chicken sandwich with avocado. Both were subpar. The steak was under seasoned and my rice and beans were very bland. My friends chicken was burnt and just Unsatisfying. The only good thing about this place was that their margaritas are very strong. Other than that I won't be visiting Pedro's again. They should really focus on using fresher ingredients, better service and a little salt and pepper wouldn't hurt.", "author": "Jasmine A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-05", "description": "one of the worst food experiences of my life.\n\nordered elote grilled and it came out boiled and mushy\n\nordered a guava and cheese empanada and it came out with no cheese\n\npretty sure they opened a can of hunts tomato paste and poured it on the mofongo\n\nthe veggie burrito had no veggies, cheese, salsa, etc and was just rice and beans for $10.\n\nIt was the poor waitress's first day and she was so kind but her kindness aside, the food in this place is the worst. I would rather eat at Taco Bell and am shocked that it doesnt have a worse rating. I never send food back but everything here was entirely inedible, mushy when promised crunchy or lacking in any flavor.\n\nDid I mention the neon blue chips they serve?! I wonder if they are organic -_-", "author": "Alison S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-03", "description": "Ok so let me start off by saying I walked here from the park in search of a little outdoor dining and found it!!  Now if your hungry and need to eat honestly this isn't the place for you.  You can sit have a drink and wait... for your food but when it finally arrives it is the ish!!!  You have to try the fish taco it is filled with bacalo guisado Puerto Rican style and don't sleep on the monfongo because the pernil around it is awesome!!  So I do like this place but the staff seems to not have the complete take on how to service the indoor and outdoor (which really isn't big).\nI also sampled the mojito and it was yummy but a bit pricey for a small joint so I would recommend a beer which is much cheaper.", "author": "Karen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-07", "description": "So, San Pedro is nothing spectacular, but in the lunchtime desert of DUMBO, not being spectacularly bad is something to write about. You can get a plate of decent (not great) rice and beans for $4.50, pair it with a margarita for another $7, and then throw a tamale on top for another $3. Again, it's not amazing food--either way, good or bad. The margaritas are pretty strong, too, so there's that. \n\nOn nice days, you can sit outside and sip Tecate or Pacifico ($4 each, I think) in the sun and watch all the pretty rich peeps who make DUMBO what it is meander about their days, which is also pretty nice. So, San Pedro. Three stars. Hurrah.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-24", "description": "I work in DUMBO, and for anyone else that does, you know that options of where to eat is limited. So I tried Pedros for the first time last night  and it will honestly be the last time I go in there to eat.\n\nThe entire night was just full of bad service. The worst was at the end when the server was watching tv while we were trying to get the check. The second down fall was the check. Honestly, somehow the food came out to cost much more than it should of. \n\nThe only reason you should come here is either you have exhausted your options in DUMBO or you love margaritas and don't feel the need to go else where.", "author": "Kyle M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-25", "description": "I don't know what happened to Pedro's . It used to be better priced and better service and better food. Just ordered a tofu burrito and nachos and they forgot my nachos and I paid $11 for really a small burrito that left me still hungry. My take out container was even styrofoam! And no hot sauce! What am I paying for? They must be having a hard time paying rent in Dumbo now! Maybe that's why less for more $.  Disappointed.", "author": "Jodie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-17", "description": "There may be another restaurant masquerading as a different Pedro's in some of the other reviews, but my experience there was enough to convince me that one visit was more than enough.  And in a neighborhood with relatively few dining options,crossing a place off the list says a lot.  Definitely a hole in the wall on the inside, but you can enjoy the outside on a nice (or even not so nice) day.  Not a huge issue, but the food and service is.  \n\nFelt like the food was indiscriminantly prepared and without care - I don't think it was helpful that we found errant bones in enchiladas and tortillas that were essentially inedible.  We all tried to be polite since my buddy picked the place and has a voracious appetite, especially when it comes to anything Mexican, was completely put off and appalled by the restaurant.   He only ate about half of his food and we had to go somewhere else a couple of hours later when he got hungry again.  As others have mentioned, the service is pretty terrible.  \n\nI'd like to think it was an off night, but I fear that it was not.", "author": "Philip L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-30", "description": "Overpriced bad food avoid at all costs. I have no bias but it's def a tourist trap like all the reviews say. \n\nBad: anything on the menu\nGood: walk away right now", "author": "Splode I."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}