{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "This place is overpriced not even considering for the food that they sell. The Cuban sandwich I had was nothing but greasy and unappetizing. Guac and chips were more expensive than chipotle ? Like what? The Guac was only alright. The wings came plain unless you ask for some type of sauce. And lastly, service was really slow. If I want some good Mexican/Spanish food, I'd rather walk one more block and have Los Papis. It is 10x better than this.", "author": "Alexander Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "The food was great, no wait, service was extremely fast, appetizers to die for, great food all around.", "author": "C J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-12", "description": "I have been to Pedro's few times and also ordered delivery too.\nDecor is casual, but very artsy, it makes you want to go in.\nFood is GREAT, I had tacos, nachos, enchiladas, burritos, everything tastes yummy. The reason I gave this place 3 stars, is the service. Very very slow, we have been ignored, got the wrong food, some of the waitresses were rude ... This is a small place, not that many tables, they have to step up their service ... Come on Pedro's!\nOn the other hand, we got food delivered and it was fast and guy was friendly. I will continue to come here and hope the service will improve because food is good.", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-15", "description": "Got the tacos. Aside from the fact that they were $9 for 3, and some of the worst tacos I've ever had (the beef was straight up ground beef with packaged taco seasoning and topped with the classiest of toppings - iceberg lettuce), I got food poisoning. \n\nDon't eat here out of desperation and hanger like I did.", "author": "Evangeline W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-03", "description": "I wanted to like this place...but I just can't do it \n\nThe inside is small...like inhuman small and pretty dark. Generally I love hole in the wall places because most of the times they have the best eats. To get to my seat I had to take the scenic route :( it was so tight inside the place... But we came in to get out of the weird weather it was raining like mad. \n\nI ordered fish tacos (I know I should probably know better-Fish tacos in New York) \nThey tasted fresh enough but I guess after you have had fish tacos where they are bringing in the fish from the water right next to the restaurant and making your food from that same fish it wasn't the best choice...like on the water in CA, FL and WA. My friend ordered a nacho thing and it was chips glopped on with toppings like chicken, beans cheese etc...\n\nThey do have a small what appears to be a full bar and on a nice day you can sit outside (and which I probably preferred if the weather wasn't so crazy). \n\nWill I be back only to have a drink outside probably not to eat.", "author": "Tick...tick...tock...Clock C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-07", "description": "Not only is the place extremely cramped, it took over 40 minutes to get our food. Our waiter kept saying the food would be right out but that never happened. \n\nThe food wasn't that great either. The portions are small. It's not the most amazing Hispanic food you could find in Brooklyn. Also, it was a bit pricey considering the amount and quality.\n\n10/10 would not ever eat here again.", "author": "Tobi L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "I had a great time here! My friends and I enjoyed a pitcher of margaritas which were delicious, and I had the quesadilla with chirizo which was insanely delicious,  my friends had delicious meals as well. The only thing I disliked was that disposable plastic cups and ramekins were used. (Bad for our earth and not necessary for stay-in meals) Annie was our waitress and she was great. Loved the place. Enjoyed my time here.", "author": "Ro S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-16", "description": "One of my worst restaurant meals in recent history. My advice would be stick to salsa/chips and beer. The food was of the lowest quality and prepared with little care. Wonderful location though :)", "author": "David J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "Happened to spontaneously grab appetizers and drinks with a friend here last week. The margaritas are just the right mix of sweet and tangy. I also tried all three kinds of empanadas and they were delightful. Looking forward to coming back for a full entree sometime.", "author": "Graylyn R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "I ordered few times and Never got what I ordered!! They either don't pay attention or simply don't care at all.", "author": "Valeri M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-27", "description": "Is a nice spot in the summer, cute atmosphere and the drinks are yummy but the food isn't great the beans are usually bland. I ordered the fish tacos thinking it was safe seeing that it's pretty hard to mess that up. I was expecting white fish instead I had what looked like a cross between dried shredded fish that wasn't rehydrated fully and cat food. they where tiny little things that tasted so dry and there was no sauce. Not the Mexican food that comes to mind. I'm sure there other things that are good here I just suggest not having the fish tacos. \nThe chorizo enchiladas on the other hand are really good and are well seasoned. The servers are not attentive you will have to flag then down everytime you need something.\nI suggest this spot for the summer margaritas and Coronas outside during a sunny day not much else.", "author": "Elena F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "I live by YELP, so you can understand why I was reluctant to stop here after reading the reviews.  My bartender was John, I was ear hustling so I found out his mother owns the place. I ordered the Steak sandwich it was delicious, I also order the corn on the cob as an appetizer. THAT CORN WAS ORGASMIC. I went on Monday around 7ish so it got packed after I was already seated at the bar. I enjoyed my experience and I recommend this place! Tell John David sent you via YELP!", "author": "David D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-10", "description": "I'd like to update; I haven't gone since but, I still recommend not going there, however, if you ever get food poisoning at any restaurant for that matter, and review it, and write that you've gotten food poisoning at that place, better off going to the doctor, or telling New York department of health; I recommend not writing a review trashing and/or saying you got food poisoning from that restaurant, because a lot of people might enjoy the place,and they might be worried by your thought, or just be plain offended. Thank you \nA fellow yelper and helper ;) \nP.S, if you feel the need to write a bad review just be simple but don't trash it :)", "author": "Marissa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "Pedros is always buzzing. This place looks NOTHING on the outside but magic happens inside. The food is pretty good for the price, its simple no frills mexican! Extensive restaurant menu. Staff are pretty chilled and friendly to!", "author": "Zoe W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-05", "description": "Ew. Tourist trap tourist trap tourist trap.\nThey're lucky their business is smack dab on the most perfectly visible corner of Dumbo or else they would be making nada. \n\nI've been here twice. Once on a fateful day of the Dumbo Arts Festival 2012 packed full of people out of Dumbo (including me). Service was slow as hell. It took over an hour for our food to get to us. Granted it was busy. But how do they only have one waitress working at all times? I felt bad for a couple that was there before us. We got our food before them and they barely got their fried plantains while we were leaving. The food was a memory. So boring and nondescript that I forgot what I even ordered. \n\nMy second time was yesterday actually. I was in Dumbo helping my roommate film her dance rehearsal. She treated me and her dancers to lunch. And can you guess where she took us? Oh yeah, that perfectly visible and obviously situated Mexican restaurant in a corner of Dumbo. I already knew where we were going before she even told us. Ended up muttering under my breath \"not fucking again.\" \n\nWe all ordered something different. I went with the empanadas, craving something familiar from back home in California. I've only had empanadas one other time in NYC and that time I watched in horror as the cook literally took a refrigerated empanada and pop it in the microwave. Well these were three empanadas for $7 and they were fried to oblivion. Tough, thick, greasy dough. Sparingly tasteless fillings. Dough to filling ratio was 100000000000:1. The guava-filled empanada wasn't bad, but could not save me from the 2 gallons of crude oil the other two were drenched in. \n\nThe prices are too expensive for such mediocre, laughable Hispanic food. \nSeriously, where can I find decent Hispanic cuisine in NYC??? (And no, Chipotle does not freaking count.) \n\nI've been to Dumbo twice and this is the only place I've ever eaten at while there. That's gotta be a record or something.", "author": "Grace Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-04", "description": "I like this place. The watermelon margaritas, the great music they play (old Motown and classic rock) and the great Spanish and Mexican dishes. I would be really big if I lived in Dumbo.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-17", "description": "I really wanted to love this place. It looks so cute and comfy! But there were too many things that turned me off to it.\n\nOkay.... for all you restaurants out there... here is a tip.... DO NOT HAVE ONLY ONE WAITRESS SERVING AND ENTIRE RESTAURANT. Really! I mean the place was jammed at only one lady was working. Finally I saw some guy start helping but the poor woman! Things are bound to go wrong when its like that! It took us an hour to get out meals...which were mostly sandwiches. They forgot 2 out of the 5 drinks for our table... and none of them except the ones that were from bottles tasted good. \n\nThe food itself was interesting.... the ingredients were totally fresh.. I enjoyed that part. But the portion sizes were tiny!  Not to mention not authentic.... my friend and I got these mexican sandwiches... the inside stuff was fresh and yummy however was seriously lacking in he amount. We ordered sandwiches called 'tortes'... instead we got italian bread that was obviously put on a paninni press to look like a torte... with 1 slice of advacado and the thinnest piece of chicken I ever had. it was just disappointing....We all left completely unsatisfied. \n\n\nEh this place just did not do it for me.", "author": "Gina Marie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-31", "description": "Decent drinks but the service leaves a lot to be desired for. Well,that was until the owner (??) came and suddenly gave the bill because someone else was waiting for a table. It was a quiet peaceful afternoon rather rudely ruined by this very unappreciative owner with a direct unpleasant tone. \n\nWe didn't have food either (hadn't decided before the rude owner), but all other people were waiting a very long time to receive theirs. \n\nOh and bill came without a pen to sign. Sigh. \n\nAvoid.", "author": "Jakub W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-09", "description": "No más de petro para mí.. \n\nThis place sucks, the only reason I didn't leave 1 star is the staff are pretty friendly. Their food is not good, its reheated tex-mex, their margaritas are made from a mix, and it is overpriced. I have lived in the neighborhood for a few years, occasionally Pedro's draws me in, but no more Pedro's you have seen the last of me.", "author": "Paul D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-17", "description": "Stopped by randomly ... Hawaiian blue margarita was good .. Ordered the supreme nachos which were ok but pricey .. There was more guacamole than nachos for the price.\n\nThe outdoor seating was perfect for the hot weather", "author": "Maya C."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}