{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-02", "description": "The waiter charged my card several times for my\nsingle meal, which then alerted mg bank. Have tried talking to the manger, but they are not available to speak to customers with concerns. Obviously, they don't take feedback or customer issues seriously. \n\nAvoid eating here. Food and service was just ok.", "author": "Amina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Very good service and quick delicious food. Definitely coming back. I am just speechless for how awesome this place it is.", "author": "Xavier W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Very nice waiters and quick delicious food.Best service we have had in dumbo.100% coming back here.", "author": "Jerry G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-07", "description": "Worst New York City good experience I've ever had. My table of three ordered a pitcher of margaritas and appetizers and entrees. After 30 minutes we got our pitcher. Then 5 minutes later we got our appetizers. They tasted good. An hour and a half with no communication from waitstaff goes by and we've yet to receive our food. We ask the waitress and she says \"we ran out of black beans so your meals were delayed but we know.\" Meanwhile a table of people who have been seated for 10 minutes received their food with what do you know, black beans!!! I think it's unfair to lie to a customer. It would've been more standup to admit you forgot to place our orders. This was a waste of time experience in New York. I would never come here again. This place es un gran pedazo de mierda", "author": "Marlon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Great service,good food, inexpensive, great place to bring your friends and chill plenty of parking for my motorcycle people out there", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-22", "description": "Went here last night sat at the bar , first bartender to greet me was very nice . Explained the happy hour ordered a margarita ! Margarita was very good . Used a pre made mix which was a bit of a turn off but it was surprisingly good . Big plastic cup want to say 12oz so it was worth 12 bucks . Food menu looks good would come back to try the food for sure . But the second bartender didn't seem to friendly , seemed to be aggressive not sure maybe just his personality. But he should be a bit more welcoming just an opinion . Other then that I'll be back for sure let's see maybe it was just a bad day for him .", "author": "Greg K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-07", "description": "I wanted to like this spot, but sadly I do not.  The atmosphere looks cool, like a classic divey Mexican spot.  The food is great!  The service is terrible.  They don't even know what service is. And not even in a way that suggests they're just busy - it's just, no understanding of customer service.  And the seating kinda sucks but that's the vibe so whatever.  Also, the food is WILDLY overpriced.  A $9 guacamole which is just OK comes with about two tablespoons. Their prices are more in line with a fine dining Mexican spot.\nBecause of the service and the prices, and the good tasting but not mind blowing food, I'm not interested in going here, but I'm sure enough corny yuppies who want to feel \"authentic\" still will!", "author": "Joey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Love the food at Pedro's and they're very, very kind. The lunch special has to be the best deal in town and it's certainly the best tasting lunch in town!", "author": "H R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "Honestly the food is underrated, it's not authentic but it is really delicious for the price. Do not let the bad reviews fool you. Get the guacamole and chips and start from there. The service is excellent!", "author": "Jay N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-08", "description": "i almost never write yelp reviews but i was here tonight and it was honestly the worst restaurant experience i've had in at least ten years.\n\nfirst off, the place smelled like cleaning solution and chlorine trying to mask an odor coming from something in the bathroom that should've been scrubbed. since there was no host to seat my partner and me, we seated ourselves at the table with the fewest grains of rice on it. only after our orders were taken did our server come by with one napkin and no cleaning solution to wipe it down (the vacant tables near us were left dirty for quite a while). on top of how loud the kind of people who work white collar jobs in dumbo can be when they're drunk, bad \"classic\" rock blared from the speakers.\n\nthe food ranged from bland to awful. i ordered three tacos, and the pork one tasted like the meat was left out for days. at least my chicken taco and beef taco were flavorless. my partner ordered a quesadilla with black beans that she describes as partially melted american cheese in a flour tortilla served with room-temperature slop straight out of a can.\n\nit's really a shame this place sucks, considering that this is one of the few sit-down restaurants in dumbo that takes cards.\n\nstay away!", "author": "Marisol B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Friendly service, meal came out quickly, great location. Best mojito i ever had. And One Cadillac Margarita is all you need to get you fuck up!", "author": "Jausalit J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "This is the best spot to come too!!!!! Drinks are great. The bartender John is very polite also.", "author": "Chanelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "We love this place. The owners and servers welcome us with smiles. Outside seating is great in summer but inside is fun too. Reasonable prices and good food. We like shrimp alajillo, tilapia, all the burritos, and sweet plantain. There's a lunch special daily, a full bar, and several vegetarian options, including the spinach burrito. Colorful murals inside and out. A Dumbo fixture. We recommend Pedro's highly. Jaki and Henry", "author": "Henry F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "The service here needs a MASSIVE upgrade -- to the point where I believe people can just dine-and-dash without a problem. You might walk into the restaurant/bar with a cozy, warm feeling thanks to their colorful interior and low ceilings. However, you'll soon realize that this all means nothing.\n\nCame here for lunch with a group of coworkers and it was easy enough to get seats, possible because they just opened up outdoor seating for the warmer weather. \n\nThe waitress messed up our orders on several fronts. One person didn't get cheese and sour cream on her burrito, as requested. My drink didn't show up until I was nearly done with my meal. Another person didn't get his food at all until we waited for nearly 10-15 minutes and decided to check on it. Apparently, the waitress never put his food order down.\n\nI had the crispy burrito bowl with steak. It was decent. Their food isn't bad and it's priced fairly, especially when there aren't many choices here around DUMBO.\n\nIt feels like the restaurant is understaffed, where staff is running around trying to serve patrons and they're overwhelmed. They misplace orders, forget orders, and you just have to ask them 3+ times before you actually get something. I think they need better management and a re-training of staff to make this place more efficient. A big improvement could come from something as simple as restating our orders at the beginning of the meal or an \"am I missing anything?\" when food is served.", "author": "Simon Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Don't believe the hipster reviews on here. This is by far one of the best Mexican restaurants in the city! $10 Coronita, strong not watered down, excellent chorizo flauta, great prices and fast, excellent service. One of my top five favorite restaurants.", "author": "Brad W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-14", "description": "Their beer is cold and they have outdoor seating, which is nice on summer nights. That's about all the good I can say about this place.\nFor the rest, their guac is bland, their chips are out of the bag, their margaritas are weak.\nIt's so sad because it's such a great location and Dumbo sorely needs a good, relatively inexpensive casual place to hang that doesn't suck.", "author": "christine a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "Pedro's was a cool spot. Definitely worth checking out. I came here for drinks so I can't rate the food but everything smelled good. Love the funky decor \u0026 ambiance. I had Pedro's original margarita, which has a drizzle of sangria...loved it! Drinks seemed a bit pricey but this drink was $9 so that was ok. I'd come back to try the food.", "author": "Kathy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Been dying to come here for years and finally my expectations were met with the best shrimp mofongo ever. The sauce was amazing. And the drinks were on point.. definitely will come back again.", "author": "Jose R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "Pedro's has been on my to-do list for a while. Every summer I walk by on my way to relax by the water and every year I say, \"Next time. Next time.\" That may be why I hyped it up in my head before hand. So I had to put those lofty expectations in check when I finally made it to Pedro's. I wanted it to be a five star experience so very badly. \n\nI'll start with what's important: the food and drinks. I loved my margarita. It was just strong enough to make me feel warm and fuzzy after my meal and distract me from the heat. I thought it was a little too small but at least it was a good pour. And I don't typically  The chicken tostadas were pretty good. The chicken was seasoned so well and perfectly pulled. Every bite was tasty. I didn't love the fried tortilla which was more of one big hard taco shell or oversized nacho. It made it like a personal sized chicken nacho serving. But that did not stop me from inhalin two tostadas. The chips and guac were yummy. It was darn good guac and if you know me you know I judge guac harshly. However, it was WAY too small a guac serving for a full bowl price. It was basically a small side of guac that you pay around 8-9 bucks for. It was small enough to give me pause when it came out. Guac is not meant to be rationed. At least not in my life. Overall, while food and drink were tasty it was overpriced for the portions.\n\nNow to a little heads up for future diners. Picture it: the first super hot day of the spring season and so we opted to sit outside. Typically I don't care to sit outside at any restaurant because this is New York City, pigeons eat outside...I eat inside where there is air conditioning...but I digress. We were warned the only table available was in the sun. We should have listened. It took about three minutes before we were sweating buckets and our cell phones were giving us that \"phone overheating move to cooler area\" warnings. We should have listened to our phones and not just covered the phones. Note to all eating at Pedro's. Eat inside. Like I said, pigeons eat outside, and now that I think about it they probably find a shady spot. Humans, easily dehydrated humans, eat inside.", "author": "Kristen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-15", "description": "Not sure what all the negative reviews here are about. I think a lot of people reviewing this place completely miss the point of this restaurant.\n\nYes, the interior is small but in my opinion that adds a great vibe to this place. There is also great outdoor seating which you cant kind everywhere.\n\nThe portion sizes are on the small side for at the price point they provided they are fair for a restaurant in the heart of DUMBO. \n\nZero problem with service. Ordered the beef burrito which was out of the kitchen in no more then 5 minutes. It was good but not the best. I was confused whether of not I was suppose to eat it with a fork or knife or not.  I made the terrible decision of trying the pick it up. It flopped revealing its tasty mexican innards. No worries though, just absolutely drenched that bad boy with the hot sauce on the table (which is fantastic) and things went smoothly from there.\n\nOrdered the wings which came 10 for $10.  I have to say these were the best part of the meal. These little deep fried bad boys rocked it. Super crispy, very tasty 10/10 will steal your chicken wings.\n\nTry this place out if you want some casual sit down mexican food in the DUMBO area.", "author": "Ryan R."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}