{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Cool environment...Drinks are solid especially the Cadillac which is strong AF ! Food has a lot of flavor.", "author": "Alexis B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-04", "description": "The prices here are actually not real. The food is by no means bad but most especially is not at all worth the cost. Drinks are good but the server tried to upcharge $10 for a pitcher of sangria. Basically the final bill was stupid high for a very mediocre time that was the largest issue. Probably will not return", "author": "Ali E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-14", "description": "This is the worst whitexican food I've had in a while. This is the kinda \"Mexican\" food you eat at an Irish pub in a Mormon town. Their $9 queso fundito is a small cup of nacho cheese that is of the type you get at the 711 out of the machine for 99¢. The food was blah. \nThe receipt made no sense. The waiter told me the only sauce was cholula. Had to get a different waiter to get red and green sauce, that wasn't worth the wait. \n\n$17.15 and change for 3 tiny tacos, cup of canned cheese and a Diet Coke. \n\nNever coming here again.", "author": "Clint G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-13", "description": "Wow this place was pretty bad, the only thing that met expectations was a bottle of beer because you can't screw that up.\n\nI ordered Queso Fundito and received a bowl of cheese similar to what I expect to get from a baseball game. I decided not to even order a full meal after this experience.\n\nAll their food is pre-made so not only is it below quality but it's not even fresh.\n\nI love Mexican but I'd pass on this place.", "author": "Adam M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "My first thoughts after eating their tacos is that:\n1) The person who cooks there has never been to Mexico and\n2) The person who cooks there hates Mexicans\n\nI have always known NYC to be a little weak on Mexican food but this horse shit taco was the worst thing I've eaten in months. It was so devoid of any flavor that I thought they might have washed the meat with dirty dishwater before serving it. It's like what I imagine \"Taco Night\" in prison would taste like.", "author": "Kenneth H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Customer service , EXCELLENT! Their food is amazing . I had the chicken flautas and chicken empanadas!! I also had their coconut mojItos and sour apple margaritas!!! My friend had their beer special and meat empanadas sampler!! So delicious !!", "author": "Patricia J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-30", "description": "My go-to order is the tacos dorado (hard shell tacos), all pork. I've tried the chorizo, the beef and the carnitas too, but pork is the best out of three.\n\nTo be honest, there's no consistency with their food or their service (especially when eating in). I've had times when the pork was killer. Other times, parts of the pork were super dry. The rice and beans are pretty good as a side (but far too large of a serving, I'd share). \n\nDelivery is speedy. I dare say, you may have better luck ordering via seamless vs. dining there. Yuca fries are another favorite along with the chips and salsa. \n\nCheap and cheerful. Just not terribly consistent with food quality.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-28", "description": "One of the waiters likes to throw around racist comments behind customers backs. Waiting for take out takes forever and when I check they didn't even make it yet.  \n\nI ordered fish tacos ... I expect fried cod, instead I got stewed salted cod.  \n\nGross", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "They did a great job for my son's 9th birthday celebration. We got there with 20 kids and 10 adults from a Haunted house nearby and were really pleased with the set up. Not only a separate room was waiting for us but a separate entrance too. Beautifully and cheerfully decorated too.\n\nWe had a prearranged selection of quesadillas, tacos and empanadas. Everything was delicious. And Bianca, our host was truly exceptional and friendly. \n\nHighly recommended.", "author": "Ivana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "Stopped in to Pedro's on a whim late Wednesday night. Was walking around DUMBO with a friend and when we saw the outside, I knew I wanted to stop here. We took a couple pictures with the cactus cutout outside before going in. \n\nThe interior is small, but you get the feeling of \"home\" when you get there. If I lived nearby, I would definitely want to be a regular here. \n\nOur bartender was John, and after some questions about the menu, we decided to go with the Cadillac Margarita. As somebody that drinks often, this was strong. A couple of these would be enough, which at the $14 (IIRC) price tag, makes it worth it to not have to order multiple drinks to be able to feel anything.\n\nWe arrived after dinner, so we didn't try the food, but just based off the ambiance, service, and drink, I definitely look forward to coming back to experience more.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "Guac is barely one avocado browning... no salt or lime. I may as well have grabbed an avocado at the bodega and eaten it....not acceptable for a Mexican restaurant", "author": "Allee L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "We had a party of 30 and needed a restaurant last second. They were more than accommodating. The food and service was PHENOMENAL!!! Try the mofongo. If I lived nearby, I would come again and again to try the whole menu!", "author": "Katie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-10", "description": "Con: My party \u0026 I waited about an hour for our food. (We weren't the only ones). We had to request chips \u0026 guac while we continued to wait. When our food finally arrived, I asked the waiter how long it would take for my rice \u0026 beans to come, as he only brought out the stuffed plantain I ordered, he responded \"Oh is that what you wanted?\" ... That's what I ordered, kind sir. Our wait wasn't too long, however, the inside is small and was PACKED and I'm glad we got outside seating. \n\nPROS: Good food, good drinks. Extensive menu. Reasonably priced. Outside seating for dining in nice weather. The Pedro's Margarita is a refreshing mix of sangria and margarita. Wings, spicy and come with a chipotle sauce \u0026 blue cheese. My stuffed plantains with shrimp was flavorful, as was my friends' stuffed plantain with beef. \n\nI'd revisit here again, especially in nice weather.", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-27", "description": "I'm not hard to please especially when it comes to Mexican cuisine. All you have to do is make sure my margaritas are strong and my chicken quesadillas are delicious and you provide extra sour cream. That alone can give you 5 stars, and that's what I started to rate this place but let me tell youuuuuuu...\n\nI came here on a double date just to chill and have some drinks. We started with a pitcher of patron margaritas with blue curacao which was a good bargain. I think in total we were able to get 12 small drinks out of that (or maybe I was the only one who had 3 drinks). I ordered the chicken quesadillas with extra sour cream and my date ordered the shrimp tacos WITHOUT the chipotle. The other couple ordered the same dish, which I forgot the name of. ANYWAY! So the bus boy brings out my quesadillas and I ask him \"are you sure these are mine\", just off the strength that it was the only meal at my table ready to be served. He said yes and I let it stay on the table without touching it because 1. I wait for everyone to have their food before I eat and 2. I just knew that plate wasn't meant for me. Longer story shorter...the plate was meant for the table behind me. After 5 minutes of sitting on my table the waitress just took it off my table and placed it in front of the correct diner. WHAT?! She didn't even ask me if I touched it nothing and that just rubbed me wrong. The shrimp tacos came out with chipotle on it...figures. The bartender was good at making strong drinks but he took FOREVER to make them. \n\nDon't forget that this restaurant is tiny! I'm 5'11 so I had to bend low a little. I used the bathroom and it's so tiny that when I washed my hands my butt was turning off the sensor for the dryer lmao way too awkward.\n\nAll in all, the food is typical mexican food and the drinks are good. If you're looking for a chill time then come here. If you want to impress someone I advise you continue to yelp a great place.", "author": "Jana P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-19", "description": "I ordered a vegetarian lunch special for take-out. It was fine until my tongue was pierced by the wire in this twist tie that was hidden in one of the bites I took.\n\nThese things happen, but I most likely won't be back.", "author": "Charlou M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "I don't understand why anyone has beef with this place. #1 when margarita is only $8 in plastic cup, level your expectation. I have been back for 4 times now (btw I have also tried the Grand Electrica twice in this neighborhood). If you want real good drinks, upgrade to Cadillac @ $14, and worth every penny of it. Food is awesome, my constant reorder is shrimp tacos and shrimp Mexican style (am pescatarian). The shrimp is jumbo size. Even my husband mentioned he has to find a reason to deroute to this location every week...nuf said.", "author": "K T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-08", "description": "Came here with a good friend. $10 for rum coke and the plantain is really hard :-/ The corn is pretty good.", "author": "RT Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "The empanadas are good, the wings are slightly overcooked but they tasted fine nonetheless. The water that they give you is warm, which I didn't like. Our waitress was friendly. I would come back to try the actual entrees and the drinks though.", "author": "Jalisa O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-08", "description": "the tacos were cold, the waitress was very nice, but the food was terrible and it seems like it has become a tourist restaurant- this used to be a good restaurant about 10 years ago.", "author": "patti f."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-19", "description": "Pedro's Mexican Bar \u0026 Restaurant should be one happening joint. I mean the house is located in Brooklyn, where all cool things happen and the cool kids play. My experience was far from cool, but not awful. Maybe average, OK, decent...bottle beer was five dollars. YAY.....\n\nStop by Saturday night after a visit to West Elm. Wanted some beer and a bathroom break. While the place was busy, I was not impressed. Lighting to bright and decor had that I was something else years ago, now I am a Mexican Restaurant. Very boring look for the festive look of a Mexican Restaurant.\n\nTheir selection of beer was standard; Bud, Corona, Heineken, etc. I had a Corona; it was cold with a lime and I like that $5 a bottle price. The area dictates a higher price point, but I think this is one of their drawing points; cheap beer.\n\nOverall, if you are in the area and need a beer Pedro's Mexican Bar \u0026 Restaurant has a niche. While I did not have a meal, food looked Americanize Mexican; very average. Would visit again if in the area and need a bathroom break.", "author": "Billy V."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}