{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-29", "description": "TERRIBLE! Had lunch here today for the first time and it was by far the worst Mexican food I have ever had in my life. Literally. No exaggeration. The waitress was nice but that is about it. Service sucked. There was a homeless man stealing napkins outside infront of my table. No staff around. The only positive thing I can say was their sangria was decent. All beverages served in a plastic cup which I'm pretty sure you aren't allowed to serve any beer or alcoholic beverages in plastic as you cannot take them to go.\n\nI sat outside on this makeshift bench/table that was sliding all over the place. \n\nFirst I ordered a coconut mojito \u0026 Mexican corn which never came out so I assumed the waitress just forgot. She did inform me they didn't have any mojitos due to them running out of mint leaves so I just got the red sangria. Then she brought my sangria and a bottle of water with a small plastic cup. The water was warm. Mind you it's 85 degrees out. Never got my corn I assumed she forgot. I asked about fish tacos she stated the codfish/bacalao was like a stew which I wasn't for. I asked if she had fried fish and she recommended the tilapia tacos. When the tacos came out it was like fish scramble aka when you try making fish yourself and don't know wtf you are doing and it gets stuck to the pan and falls apart. Yea that. Must moist and bright orange assuming they used one too many Sazon packets.\nBasically it was scrambled fish with lettuce because there was barely any pico de Gallo at all. Came with a side of chipotle mayo I'm assuming which was disgusting. I basically brushed the lettuce off and ate the scrambled fish w tortilla (which should have been warm/cooked something)\n\nThen I reminded her of my corn which she brought out with the check. Disgustingggg. It's like they took a corn on the cob, dipped it into regular mayo and put it in a bowl and sprinkled saffron or something on top. There was no cheese on the corn just a little crumbles of cheese at the bottom of the bowl. It smelled weird, tasted disgusting. I took one bite and when I returned the little cob to the bowl noticed under the corn there had been a small black fly/gnat I told the waiter. She took it back and brought me the check again like hey they won't let me take the $4 corn off the check sorry hope you had a good time.  I didn't make a big deal, paid, let her $4 tip on my $30 take and left. Hungry, pissed off, thirsty and annoyed. Cute decor, def not worth it even if the food were to be free and unlimited bar included. Disgusting.", "author": "Natasha E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "The worst margarita I ever had in my life.  Basement produced tequila and sour mix bought from the 99 cent store.  Just nasty.  I can't believe they can mess up a margarita that bad.  I didn't want to order anything else after that.", "author": "Carla L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-11", "description": "Fair to poor. Three of us went for dinner and had low expectations, but service was really bad (had to ask bartender to find our server twice), and then food was meh. Food wasn't really Mexican (or Spanish) though I can see they are (sort of) trying. The cheese in my burrito was actually just some powdered cheese sprinkled on top (?). We asked for a side of rice and beans and they said no. Odd. Why the attitude?", "author": "Bruce G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "Rude, over-priced garbage. Dont eat or drink here.  One tiny vodka cranberry and one tiny whiskey diet, both well drinks $26. Stay away", "author": "Diego-Alonso T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "Warning!!!!!!!!!!!\nThis restaurant has a racist staff member! This is probably the worst Mexican restaurant in New York City. \n\nWhen the waiter took our order we told her what we wanted to drink, eat as an appetizer and our main course. Just because it took about 20mins just for her to come over to our table. Then we waited about 30mins just to get our sangria pitcher, over an hour to get out appetizers and meal. Ok by now you would think this is a legitimate reason to give this restaurant a one star which by the way, if I could've given them a negative star I would. But no it's gets worst. \n\nAs we overly waited for our food. There was a couple who were upset of the long wait and got up and left, by then I over heard one of the waiters who was following that costumer say in Spanish. \" Let Me See If This F-ing Monkey Is Going To Pay\" yes the male customer was black and women with him Asian. \n \nI was super offended and upset, I immediately spoke to the manager and made a complaint about that waiter( name Daniel I believe). She then quickly reprimanded him in front of me and he apologized but I felt it wasn't enough. I had to watch him continue to shift as I try to finish my meal which I did not enjoy thanks to him. He should've been sent home, how can you have a racist employee serve your diverse customers. \n\nI and I found out the owner is Dominican like myself, how disappointing. You guys need to do better Pedro's, there's too hate in this world and your employees should NOT be adding to it.", "author": "Wanda A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-08", "description": "Pedro's attracted me with its unique exterior art. I've never had Mexican food in Brooklyn so I thought \"why not?\". Upon entering it was immediately apparent that I shouldn't expect anything authentically Mexican, but that doesn't mean it would be bad.\n\nFirst we ordered drinks (margarita \u0026 Long Island). The drinks were solid in taste and strong. Strong drinks will always be a plus.\n\nFor the food: we both ordered Chimichangas (steak and chicken). The beans and rice it came with were very subpar and the Chimichangas were ok. The meal was nothing to get too excited about.\n\nThe service was fine. I can't say they were the best but I can't say they neglected us either. All in all they do their job in a professional manner.\n\nI can't say this was a bad place but I'm sure there are better options in the area. Another plus was that they were open pretty late during the week. So if it's late night and you're looking for food, this is definitely an option.", "author": "Dominique G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "The food is delicious and the service is friendly and attentive. Really great experience.", "author": "Lorna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "The food was very good. Chicken wings nice and crispy. Margaritas were good. Next time I'm in the town I'll stop in.", "author": "Cheryl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "Good atmosphere, interesting design, delicious food, fast service, comfortable location, but small and dark inside, more comfortable seating outside but it depends on weather ;)", "author": "Ekaterina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "I eat here all the time and the food is always delicious.  Every one comes here to eat and drink and have a great time. All nationalities come here. Everyone is friendly and professional.", "author": "Charlotte F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-13", "description": "Maybe God just didn't give me a palatte for Mexican cuisine because I'm white, but I ALWAYS leave here wanting.\n\nI have come to Pedro's attempting a great vegetarian meal. I didn't find it remotely appetizing. I have come here strictly for empanadas. I have been deceived because I spent more time trying to break through the hard dough and preoccupied with still having a dry mouth no matter how much soda I washed it down with that I simply can't honestly say I enjoyed it. I keep coming back hoping for a better experience, but the last time I was in here I simply wanted to order a \"basic\" American food to be sure. I ordered corn. It was on the cob. I asked if I could pay the workers MORE to slice the corn off the cob for me. The waitress said it wasn't possible. I never went back after that. How is an eatery still in business for refusing my extra money for a tiny request? So that's interesting. What's more interesting is that I have found a place pretty much around the block that has an actual dish called \"Corn Off the Cob.\" Maybe God was listening.", "author": "Patricia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-15", "description": "This place is horrible! Ordered 3 Crunchy Enchiladas and got 3 tacos shells with the pork slopped in it. Even the rice was hard and crunchy!\nI don't know what part of Mexico they are from?  That is not Mexican food!\nP.S. DO NOT VOTE FOR PEDRO!", "author": "Scott R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "I have been coming to Pedro's for years and I have never been disappointed. The food is ridiculously amazing! The service is always outstanding! I would recommend Pedro's to anyone who wants true, authentic Mexican food with a modern presentation.", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "Friendly little hole in the wall restaurant/bar. Nice authentic Mexican ambiance. Food is good for the price. Pork Tamalas and a pitcher of margaritas was our weekly lunch special lol. Waitresses are really nice and friendly and make you feel at home. It can be tight squeeze when it starts to fill up, but there is outdoor sidewalk seating during good weather.", "author": "Louis B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Pedro's is an amazing place to eat at. The ambience is perfect for the Latino experience. The food is what makes this a special place and begs for a second visit. The staff overall are very nice and are very attentive. The service is  excellent and I definitely recommend for everyone to have a great time with their wide selection of drinks and great tasting food. Definitely a go to place if you swing by Brooklyn anytime soon.", "author": "Juan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-27", "description": "Mexican food in NY just...isn't good. Tacos, you can find a few but let's leave Mexican food to the West Coast. This place charges $13 for a low quality burrito bowl - you know, the kind that comes in a deep fried flour shell. I was dying of hunger so it was pretty good but should have cost $7. Chips are super fried, and the guacamole tastes like nothing. It's a cozy location, but the food just isn't worth it.", "author": "Annabelle V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-02", "description": "Just came here for an evening margarita before heading home.  Their margarita list is pretty decent and I chose the Cadillac margarita without salt.   The margarita basically tasted like OJ with a bit of tequila and lime in it but not much more.  For $14 I expected something much better.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "This is a good little mexican place located in Dumbo for a causual dinner. This is a pure divey fun spot and offers a few tvs to watch a sporting event.\n\nWhen I came into the restaurant it was packed but there were a few tables open so we got seated right away. When browsing through the menu I was feeling a burrito so I picked out the steak because the waitress suggested it.\n\nIt must have taken 5 minutes for our food to be prepared I could not believe how fast the service was here. Upon taking a bite into the burrito it is full of flavor and tender pieces of steak. It was good but what made it even better was the red hot sauce on the table. The red sauce gave it the perfect spicy kick. The burrito was $14 which I thought was a little steep since it did not come with rice or beans on the side and was not that big but being in dumbo you gotta figure it is going to be a little more expensive.\n\nAfter the burrito I was still hungry and so was my friend so we got an order of plain wings which is 10 for $10. That is a pretty good deal and they were good and hit the spot especially with that red sauce.\n\nIf I am back in the area I would come here again if it is on an off night.\n\nIn short:\n- Ok Mexican food\n- Great Service\n- A little higher prices than you would expect because the portions do not equal the cost\n- Get the wings", "author": "Jon W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "If i can give this place 0 stars i would! I came in after work  today with my coworker and ordered margaritas and wings. The margaritas were literally frozen lime juice with flavored syrup on top! Disgusting !!!! The wings where covered in fat like literally i had one and couldnt do it anymore!!! I dont understand how this place is still up and running will never return", "author": "Diana M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "They called this queso. Enough said except Yelp insists I say more. Bartender was friendly, everything else about the place was lacking.", "author": "Kara D."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}