{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "Yeesh - why am I giving this place a second star?\n\nThis is the kind of 'Mexican' place at which one cannot order a burrito. No seriously, a burrito. The rice will be undercooked, the beans will be bland and the tortilla overly gummy. The rest will look like someone fished it out of a dumpster.\n\nThe only reason this place survives is that there are so many people in Dumbo and the restaurants, as a general rule, are awful. Its interesting that you could probably run down to the water in under a minute from this place, get on a speedboat and hit Manhattan in under 2 minutes from there and yet you might as well be 1000 miles away.\n\nAvoid - hopefully this place will go under soon and it will be replaced by a good restaurant.", "author": "Sean K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "Service was very slow. Food was cold. Cheese wasn't melted in quesadilla. Chips tasted like Fritos. Very unhappy with my experience.", "author": "Willis D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-06", "description": "Food was just alright. Expected a little more from a restaurant in this neighborhood. Service was good and the waiters were attentive which is always a plus. Will come back in the future to try the drinks.", "author": "Billy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "I was pleasantly surprised with the food and service at Pedro's. I read the reviews and they weren't very positive but the food was pretty good and the service was great even though they were short staffed and busy.\n\nWe started off with the sangria and house margarita, you should definitely try both of those. We shared the chips and salsa and that was the most average thing we had. \n\nFor the entrees we ordered the chorizo chimichanga and the chicken flautas. I have to say you should order these if you check this place out. The chorizo in the chimichanga was very flavorful and yums! The chicken flautas were perfectly crispy and seasoned. The yellow rice and black beans were also on point. The entire meal was really great and like I said at the beginning, even though they were noticeably short staffed and very busy (it was right at lunch hour for most of the construction sites in the area) the hostess was very attentive and fun to chat with. We will for sure be coming back.\n\nBuen Provecho!", "author": "Lily A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-17", "description": "Came here for a quick dinner with my mom and was highly impressed by it. We sat inside just because of the crummy weather (otherwise we would have sat in the tables they have outside). \nI read a lot about the great drinks offered but unfortunately I had to drive and pass on the drinks. I ordered fish tacos and my mom got the grilled chicken and beans. \nBoth dishes were delicious. The fish taco filling was greatly flavored and had the perfect mix of texture- not too slimy or crunchy. My moms grilled dish smelled so good that I kept stealing a bite as I was still eating my own dish.\nI would have given the place 5 stars if only they has at least one more person that would help boost their waitress/waiter service and speed.", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "Holy Margarita. The best Mexican spot in the city. Low key , strong margs (thanks cute bartender) and filling/cheap tacos. Classic Margs are 7 and the taco combo (I had the mix- chicken, beef , pork) was 9. I'm well fed and tipsy", "author": "Emore C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "This was my first time here and I enjoyed  the food. Nice restaurant with a small bar and an outside dining area. I had the empanadas, chicken fajitas, and their \"house\" red sangria which they make there. They also have a bottled sangria as an alternative. The sangria was tasty although it sort of tasted more like juice so I slowed down. My fajitas order took over 2 tables -real foodie style. I loved it. The empanadas weren't too bad. Nice little spot that I will add to my list of places to stop in whenever I'm in the area. It was a nice treat. And the server was great.", "author": "Jamila C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-19", "description": "After walking by this place for several years, I finally went in for lunch with my brother and sister one drizzly day. The service was okay, but being someone who lived the majority of their life in California and usually only eats Mexican food out here in Queens, the food here is generic, bland, and uninspired. If the fact that they had buffalo wings sauce on the table instead of hot sauce or salsa doesn't tell you something, I don't know what will. \nIt's a shame because DUMBO could use more food options in this price range.", "author": "Sean E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-10", "description": "We lucked out on a windy cool spring day to get a seat outside. On the weekend (as far as I know), the joint is jumping! Loud, crowded, a little dank and dark and musty, which can be great!\n\nBut we wanted chill and fresh, so outdoors with a gusty wind worked just fine for us.\n\nThe service was solid, not the friendliest, but got the job done.\n\nThe food is of your average good American Mexican variety. Nothing earth-shattering, no surprises, but we gobbled up all the snacks put before us!\n\nI will definitely return here.", "author": "Frances G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-28", "description": "I wanted to like Pedro's so bad. It was a gorgeous day, great neighborhood, great location, outdoor seating... all the right ingredients for restaurant success BUT the food just wasn't up to snuff. \n\nThere are so many amazing Mexican restaurant options at our disposal in this great city, you really have to be on point. The litmus test for me is the salsa. In other words, is it fresh, unique, delicious? Pedro's salsa had a tomato soup quality that was just weird. The other food choices we had were mostly unmemorable.\n\nI will say the service was great and I will come back to try them again because I'll try anything twice.\n\nPedro's - till we meet again..", "author": "Matthew D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-20", "description": "RUUUUNNNN DON'T EAT HERE! \n\nI was in the neighborhood with my fiance for an appt and we were too hungry to wait till we got home so we figured this place accommodated our vegan palette's - lets try it! We went inside to check the menu and decided to eat outside since the music was up too high to even hear yourself talk. Outside are picnic tables - ours wasn't quite wiped clean but we were anxious to order. We figured we'd start with chips and guac. The guac had to be THE most disgusting I've EVER had and I LOVE guac. It was tangy, pasty, and soft. I guarantee there was no ACTUAL avocado in there - this came from a powdered mix. I told the waitress I didn't care for it so she suggested salsa. I took that. What she brought out in a styrofoam dish was a red runny soup. I couldn't bare to taste it. SO we ate plain chips. \"Oh you're done with the chips? OK.\" And there that goes, no refill on the chips or anything. \n\nWe both ordered veggie burritos. Rice, beans + carrot/pea combo (you know from the freezer bags) - hold the cheese and sour cream! They both came out sprinkled with cheese and sour cream on top. We sent them back and they were remade in about 10min. It all came out of a can. Nothing was fresh. Our server was clueless, inattentive and clearly couldn't juggle serving for 3 tables. Burritos come back (at this point we have ZERO expectation of quality). We had to ask for napkins. Everything here is served on styrofoam plates. So when you're done eating or drinking your stuff is blowing away into the street. \n\nI just don't know how this place is in business. We're betting that the location wins over everything else because they're in a prime spot and have outdoor seating but hands down this has to be THE WORST DINING EXPERIENCE I'VE EVER HAD WHILE LIVING IN NEW YORK FOR THE PAST 4 YEARS. Our tab came out oddly with a random charge of $9.99 - we had to ask what it was and were told it was an accident - it'd be taken off. I was cringing watching people on the street stroll over to the restaurant and discuss eating there. I wanted to warn them but figured Yelp was a better solution. \n\nDISCLAIMER: I should've checked here before eating at this place. I won't ever make that mistake again. Worst $23 we'd ever spent, hands down. I wouldn't serve this to the homeless.", "author": "Candy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "I strolled in one evening drunk and hungry... I sat on the end of the bar. It was tight, hot and loud. If you're looking for a place where nobody knows your name. This is the place. I like their food. I had the chicken something with black beans. I ate the entire thing. I would go there again (if I was in the neighborhood).", "author": "Hardy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "What did you expect? Cheap food and drinks aren't going to be the best in this neighborhood. \nSoggy lettuce isn't authentic Mexican? I'd love to see you complain in Mexico. \nDrinks ares gross? For $7 margaritas in the city, what did you expect? \nBe careful if you're tall; the ceiling is low. Who the fuck cares!\nEnjoy", "author": "Bear S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-09", "description": "So, I have been to this restaurant twice now and can give what I feel is an honest assessment. The atmosphere is great (crowded dive) located in DUMBO. The food is tasty (the guacamole is fresh and delicious.) The only problem is the price and portions.\n\nThe first time I visited, I ordered the quesadilla. What I received was basically a half order - not what I was expecting, given the price. Sure, the presentation was nice...but no one goes to a Mexican dive for presentation.\n\nOn my second visit, I ordered the flautas. What I received was the equivalent of one flauta, divided into four pieces (about the size of a mini-egg roll.) Again, it looked pretty on the plate, but I can't eat \"looks pretty.\"\n\nFor an appetizer, we ordered tamales. What we received - you guessed it - was ONE tamale, priced at $4. Back home in Texas, you would pay that for a dozen tamales.\n\nBut we are not in Texas - so the search continues...", "author": "Texican J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "No. No. No.\n\nFor the price of $9, I could of gotten 8 tacos at Taco Bell instead of 3 and probably have it taste better and less oily. We ordered to go and it took them half an hour to do my order and there wasn't even anyone in the restaurant. If the price was lower, then maybe it'll get a two star, but the cost is overpriced for the tasteless, oily food. Probably one of the worst Mexican places I've ever been to. They have a great location, but the food and pricing is not convincing me to ever drop in again.", "author": "Kelly N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-01", "description": "This is a little tiny bar in the dumbo area which had a relatively cheap menu; but we ddint come here for the food.  We sat at the bar, ordered a pitcher of Margaritas; which tasted really strong and not what a margarita should taste like. $35 for that pitcher, us 6 people didnt even finish.  \n\nI also got 3 coronitas; i was pretty much disappointed with them.  Seriously its either they don't know how to make margaritas or they are using really cheap liquor to make them.  Sadly, we left pretty unsatisfied.", "author": "Sandra C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-05", "description": "Do not waste your money. One of the worst New York dining experiences. Terrible food. The meat was chewy, the guac tasted store bought, the salad was not fresh. Everything tasted like it should be in an expired food sale. The environment was not pleasant either. There were flies all over our table and food. Thankfully we were in good company and made the best of it. I will not be visiting this place again. Proceed at your own risk.", "author": "Sasha U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-09", "description": "At Pedro's you can either have a disappointing experience or a disgusting experience. If you want disappointing, order a margarita, or maybe some chips and a  styrofoam thimble of salsa. If you want disgusting, order a plate of the chicken wings and see if you can cobble and ounce of meat together out of the fried garbage that comes to your table. If you are as misguided as I am, order the fish tacos, served under a mind-boggling marinara sauce. The fish must have come out of a can with the sauce. I would bet money they are serving large sardines instead of cod. Except that sardines would be more appetizing.", "author": "Gary M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "Server Leo mess up our order 3 times. I waited 30 minutes for my food after my entire party got there food. I literally had to swallow my food since I only had 15min to eat. The food was ok, since I didn't get to appreciate it. First and last time I'll come to this place.", "author": "Will T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "I am in love with Brooklyn; especially Dumbo, Brooklyn.  I am always in this area during summer for photo adventures;  I had a bridal shoot on the Brooklyn Bridge some years ago, maybe in 2007, to be exact.  After the shoot, I went exploring.  I was starving and needed to find some food, quick.  My tummy was having all sorts of conversation while I was battling hunger pains from not eating a proper lunch.   I walked down Jay street and saw this really colorful building with outdoors seating; (one that you would find in Mexico) my interests were sparked at that very moment so I decided to venture farther than my eyes could see.  \n\nAromas of food seeping out the door, salsa music serenading the evening and a great New York City crowd, all under one roof and not to mention, the perfect curb seating for when the temperature is just right.  \n\nI ordered black beans and rice, sweet plantain and guacamole; I don't have a photo to share so you will just have to take my word for it; it was amazingly great!  The people who work there are wonderful.  The bar is equipped with a skillful bartender who makes THE most amazing mojito; try it!  Tell him Enchanted Blue sent you and he will be sure to add extra Bacardi!\n\nI walked by this place for years and never went in; I am glad that I decided to go in on that one humid summers' day.  I have been going every summer, since.\n\nI give this place a five star rating because the food and the drinks are amazing!  It feels like home there; a judgement free zone and a friendly environment.  I will definitely share a photo when I return to this majestic place on good ole Jay street in Brooklyn!", "author": "Maria S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}