{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-11", "description": "A group of friends and myself decided to walk to Pedro's after the Essence Streetstyle Block Party. Needless to say, the restaurant was crowded - no biggie as we expected a bit of a wait. The waiter that was helping the customers eating on the outside came around only once so we had to ask the busboy to sit us once patrons got up from their table. We sat at the table for about 20 minutes with no one even asking us if we wanted water or chips. The waiter was no where to be found and the busboy acted as if taking our drink orders, at a minimum, was asking to much. We were able to grab a woman (we weren't sure what her function was but she was nearby and we were starving) and asked if she could take our order. She took both our drink and food orders (2 ordrers of empanadas and one order of some other dish - neither took long to cook). We waiting another 20 minutes and still no drinks. When the waiter finally made his rounds, we asked if we could at least have our drinks and some chips to hold us until our food came (why we had to ask for chips is beyond me and when we asked for another helping, he said that would be extra *insert kanye shrug right about now...). Anywho, the waiter finally bought over the drinks and asked the busboy if he could bring us some chips and salsa. Another 20 - 30 minutes passed and the waiter rolls back around. We asked about our food and he asked if we had placed an order...what???? My friend went inside to see what the problem was and she saw our food just sitting on the bar. The waiter brings the food to us and when I asked if that was the food that had been sitting on the bar all this time, he couldn't give me a straight answer. Needless to say we told him to return the food and take it off of our bill. The waiter bought the bill to the table within 5 minutes...sucks that we couldn't get service like that when it came to our drink and food orders. When I approached the manager about the poor service all she could offer was that they were busy. I would think that a restaurant that has been around for some time and is located in the swanky DUMBO area would have better service or at least management would give a damn if they had unhappy patrons - guess I was wrong. \n\nNeedless to say, I would NEVER visit this establishment again and would in no way recommend it to anyone I like.", "author": "Jaki M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "Best caritas ever! And Rosie brought me out a pice of Flan for my Birthday.  Best place in Dumbo!!!!!!", "author": "Christian P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-24", "description": "Honestly, I don't know how anyone could possibly give this place a good review. The waitress forgot half of my okay-at-best food, gave my girlfriend tacos that had tortillas that were so stale that she literally could not bite into them, pretty much gave us no service at all. The waitress at the table next to us helped us more than our own waitress did.\n\nThe place is also DARK and TINY. I was lucky enough to sit in a seat that whenever someone sitting between me and the wall needed to get up, I had to leave my chair entirely for them to get through.\n\nThe worst thing of all, to me, was the fact that they ran out of almost EVERYTHING while my girlfriend and I were dining there. Here's a SHORT list of things they ran out of, or had to make more of:\n\nWater pitchers\nGuacamole\nPlates\nSilverware\n\nNow, the guacamole can be excused. But basic utensils like forks, knives, and plates? People were being served on paper plates by the time I left.\n\nAlso, our waitress checked on us so little, we literally thought about walking out without paying because the service was so bad. The sad part is, no one probably would have noticed. \n\nAndrew Z. said that this might be the worst restaurant in DUMBO. As of right now, it stands for me as the worst restaurant in the entire city. DON'T GO HERE.", "author": "Matthew W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-23", "description": "Service was horrendous. Had to ask for everything twice. Waiter was sitting down both when taking our order and for about 15 minutes while we were trying to signal for check. Guacamole is neon green and inedible. I won't go back.", "author": "Kristina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "I didn' eat here so I can't be a judge on the food, but if you arein the Dumbo area, and are looking for a nice area to people watch and sit outside and drink beers, then this is the place. the inside of the restaurant felt completely different. low ceilings, a bit loud, not my cup of tea. but you go outside, and you sit in the nice weather with their extremely cheap happy hour ($3 per bottle of beer), it is great. our waiter too was very attentive despite the fact that we were the furthest away. definitely would go back.  the food sounds pretty cheap and is definitely a casual atmosphere kind of place.", "author": "Vanessa O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "Listen people, if you decide to go out drinking at re bar , superfine, bubbys this is the spot to go after. Great Spanish food and cold beers real cheap. With all the high rise apartments in the area its nice to see a dive Spanish place with excellent food still open.", "author": "Charles V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-30", "description": "Awful food.  As we entered we thought, what a perfect place.  It's homey and comfortable.  The outside is festively decorated.  What could be wrong?  The waitress was accommodating: any table we wanted.  Lots of space to spread out.  Then we got drinks: nothing special, very festive plastic margarita glass.  Well, I got some yucca fries, and they were dripping in fat and grease, and no flavor, other than the spicy sauce. My friend got the chorizo chimichangas, and they were disgusting: the outside was like deep-fried turnover.  The chorizo tasted like it was dipped in dishwater.  Soap was the dominant flavor.  I got the enchilada, and fortunately I only got one enchilada with soapy chorizo.  The chicken enchilada was passable; the beef enchilada was edible.  I couldn't eat the chorizo.  We did not stay for dessert.  The waitress had only 4 customers, but she served me my friend's order, and served my order to my friend. \nWell, the highest-price meal was $12, and the drinks were all under $10, so if it's cheap you're after, with atmosphere, this is the place.  Also, it's convenient to the attractions of Dumbo.  But food is not their strong suit.", "author": "Alan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "I came here recently on surprise coaxed by a friend that we should go.  I was fishing for something more formal on the night after schlepping from williamsburg. When we walked in - I thought how refreshing. It seems like the kind of place that doesn't belong in DUMBO. Small, intimate, packed and mexican food was the order that night and actually thats what I needed. Didn't have high expectations to begin with. Really enjoyed the intimacy of the place. Our server - think she might have been the owner/part owner was very attentive to us and was chatting us up. Really could have easily been a place in mexico or south america. And the margarita on the rocks definitely helped the mood", "author": "C R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "Stumbled upon this place randomly.  It was a nice night out and we sat outside.  The food is AMAZING and the drinks were great too.  We'll def be back asap.", "author": "Mimze C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-14", "description": "Got the veggie burrito and really all it seems to be is a ton of rice, some beans, lettuce and pico.  Not bad flavor, but....why did I pay $9.50 for that?", "author": "M. C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-01", "description": "Great location.  Great service.  But the food is just so lacking.  Warning: DO NOT ORDER THE NACHOS.  The nachos were so bad we had to send them back and we didn't even want to order another set.  How in the world do you mess up nachos????  I would argue that the only good thing about this venue is the location, beer selection and the fact that it's pretty inexpensive.  But don't go here expecting to be satisfied by the food because you won't.  It's bland, at best.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-18", "description": "Dinner after theatre at St Ann's Warehouse down the block. Simple, straightforward, good food, nice people, nice atmosphere, altogether fine. Nothing fancy. No fancy beer. No fancy wine.", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "Pedro's get's a \"classic 4-star review\" by me.  I have known this place since at least 2004.  Lots has changed in the area, Pedro's has changed, some, too.  I believe the menu is more abundant, perhaps the dishes are a bit more \"upper crusty\" too (i.e. less down and dirty as I might recall them to be, but the uptick in quality comes at minimal additional expense and maximum authentic enjoyment.  This neighborhood is overrun with traffic and go-fasty SUV's (most I will presume are fresh of the BQE and are not acclimated to city driving, so definitely look both ways when crossing the maze of streets around here), but if you can get a seat you are in for a treat as you'll learn what a well-loved neighborhood stalwart should be.", "author": "b c."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-03", "description": "My friend and I chose this place out of connivence. We were tired and hungry, and then disappointed. My sangria was boring, with no fruit it in, and the guac was tasteless. I had ordered the carnitas burrito for my entree, which turned out to be a combination of rice, beans, and very overcooked meat, with the smallest bit of sour cream and cheese on the top. Very disappointing. Felt like a waste of money--chiptole is better!", "author": "Brenda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-11", "description": "Been here a couple times and the service is just always bad. The entire staff just seem uncoordinated. The place looks cool from the outside but the minute you step in it just gets worse from there. The food is average and certain items are overpriced.", "author": "Rojé G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "My friend and I were just leaving a poetry show, and I was starving and highly irritated that I decided to wear 4 inch heels to journey around Brooklyn. The bartender at the art space we were at suggested that we eat at Pedro's. I was highly upset because the walk was to far for my aching toesies! lol! But I was very happy with the food! I had chicken fajitas. Our waitress Mary was very nice and helpful. It was a bit packed but they did their best to get our food out to us as quickly as possible. Very cozy and great music.", "author": "Jana H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-12", "description": "Pedro's is very festive. If you're in the area I would recommend trying it out. I would not go out of my way to go to Pedro's, but if you are in the area it does the job. The margaritas are relatively strong and good. I always have a chicken burrito whenever I go to Pedro's which is decent enough. If you're craving rice and beans, it satisfies that craving. In a way, I consider it my DUMBO staple for burritos. The ambiance is very interesting. It is very festive and unique. If you're in the area, I definitely recommend checking it out. I keep going back for the burritos and margaritas.", "author": "Ant R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-24", "description": "I was so excited to go to here because I heard the food was really great. Service was horrible and I honestly have never had worse food in my life. fish in the fish taco was chewy but worse than that how can you mess up rice and beans?! ugh.", "author": "Caitlin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-01", "description": "Generally a restaurant has to be outstanding-ly something for me to write a review. In this instance, it was outstanding-ly awful. It wouldn't be a stretch to say this was the worst meal I've had in NY.  I ordered the veggie burrito and the \"nachos with guacamole\". There wasn't a veggie to be found in the burrito. The burrito consisted of some crUnchy rice, canned black beans, and a rubber-y tortilla. From the looks of meals being served to other diners, they weren't faring much better. Chipotle would have been s significant upgrade in quality. Go elsewhere folks!", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-01", "description": "Good festive place.  Stopped by during the DUMBO Art Festival so service was a little slow. Good bang for your buck and the house hot sauce was the perfect addition to the pork burrito.", "author": "Bryan B."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}