{"aggregateRating": {"reviewCount": 455, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-23", "description": "Just fine little dive that delivers a decent taco for the money, doesn't over charge for a beer and has outdoor seating in the grit and noise of the base of the Manhattan Bridge.  Friendly staff.  \n\nThe drill is that you go inside, order what you want then bring it to you table, whether its outside or inside.  In the summer you want outside.  The crowd is mostly the under 30 crew with a few extra bucks in their pockets who have moved here over the last decade.  That was a bit of a surprise, because back when I used to come here the crowd was mostly laborers and artists in search of cheap eats and drinks.  Then again, that was over a decade ago.  The place has gotten a little bit of a makeover since then, but it's still at heart the dive it always was, which makes it a nice contrast to all the high end places that have sprouted up in the neighborhood since then.\n\nThe food: It's not amazing, but nor is it expensive.  It reminds me more of Central American Mexican than what I've had in Mexico, Texas or California.  That's not a bad thing - the cheese is Mexican farmer's cheese and instead of sour cream they have crema.  It passes, and at these prices I'd call it a deal.\n\nConsider this a 3.5 star review, but I can't give this place four stars, so three it is.  If you're into grit, find yourself in Dumbo and are put off by how \"fancy\" so many of the places there THIS is where you ought to go.  Just don't come with high expectations - you'll be let down.  Come expecting to find a charming dive in what is now an unlikely place for it, and be ever so slightly charmed by it.", "author": "JP B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-13", "description": "I was in Dumbo on Saturday for a quick meeting and on my way back to the train I walked past Pedro's and stopped dead in my tracks. Holy Moly, you're still around?!!\n I am so, SO glad!\n\nWow, I've had some good times here most especially when it's warm enough to sit outside and drink (mucho cheapo) margaritas and bullshit the night away con mi amigo's. And when you feel you are getting too wasted and want something for your belly you can get your fill on some decent Spanish fast food.\n\nThis place has character (and character's). Go before it's gone like affordable housing.", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "Grimmy yet Great!\n\nThe food is inexpensive and you are served a healthy portion (Healthy =  almost 2 servings not \"Healthy\" as in good for your heart)\n\nThe atmosphere is hit or miss. It reminded me of the stereotypical college grease pit complete with random outdoor chairs and tables. The furniture is more miss matched then the hipsters \u0026 construction workers that call it home.", "author": "Mike G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "I am giving this place a star they don't deserve because of some happy memories here. I remember when there was hardly anything non-industrial around here - Pedro's was the original Dumbo pioneer, and it was, and is, a lively, fun place. Loud, friendly, good drinks. The low pressed tin ceiling keeps the sound in, and of course the tables and chairs are too close together. I can remember - sort of - more than one rollicking visit here over the years. The food is a little pricey for what they offer, but I have had no problems with the quality or safety of their dishes. On a recent visit, they were using an interesting salsa, with very little tomato, but plenty of olive oil and garlic. Guacamole and fish tacos were good also. It is not great, but it is Pedro's!", "author": "Moso H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-11", "description": "This place is quite possibly the worst restaurant in DUMBO. I can't say that I've tried every dish on the menu, but I have tried quite a few and they all failed to satisfy my taste buds. If you want Mexican food in DUMBO go to Hecho. \n\nThe only upside to this joint is that they have outdoor seating in the summer. Even then, the margaritas are no good. Bring your own mix and make your own.", "author": "Andrew Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "Been to Pedro's a couple of times, right on Front Street, where I got married at ReBar another great place.  Pedro's very reasonable, and I usually get the Patron Margaritas and they are pretty strong, it's a small place, but always can get a table, my favorite appetizer are the tostones, guacamole and shrimp, yummy!", "author": "Karen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-09", "description": "Every time I'm in Brooklyn I seem to find myself hungry and near Pedro's. I haven't been here for about a year but I will always love this place. It's super cheap and authentic Mexican. If you don't like the food here it's probably because it's actual Mexican food, not Tex-Mex. This place isn't here to cater to foodie hipsters, they're here to make Mexican food and that is all. Don't expect to get your table wiped down by a smiling waitress. Do expect to gorge yourself for on delicious tacos for ridiculously low prices.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-25", "description": "Bad food. Warm beer. Overpriced. Skip it!", "author": "Joshua R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-24", "description": "Not sure who would ever give this place any positive comments!  Terrible food, sloppily made drinks served indoors in plastic cups!  Inferior tequila!   Mexican corn was a joke!  Mayo scantily laid on it, no real spice and grated sawdust cheese.  Cheap beef used in hamburger based meals.  Just awful.....a real tourist trap!  Stay away!", "author": "Gail S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-20", "description": "Please take my review with a grain of salt. Being a California native I've somehow developed some form of mexican food snobbery. I really don't know how else to put it, but when I meet other Cali natives residing in NYC we all have to exchange \"worth while\" mexican food spots. With that being said, I would never send anyone here.  I'm sure rent is the real deal in these parts but that doesn't justify the tiny \"burrito\" I got for around $10. It was meat, beans and rice with some sour cream squirted in top and a dollop of pico de gallo on the side. It came across more like a bar with a kitchen than a restaurant with a bar.  I'd actually been here before (without eating) but only because I was in the area with friends and we wanted to take advantage of the fact that they have seating outdoors. I guess my verdict is this; don't come for the food (unless your inebriated), come for the outdoor seating/bar.", "author": "Cisco C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-29", "description": "good for beer and an outdoor spot to drink it in Dumbo.\nAll else.....ummmmm......well.....no.\nok if youre starving or totally drunk, the nachos and tamales are edible. thats all ive ever been courageous enough to order.  Im scared of the meat.\n\n***UPDATE- NO more outdoor seating.  Agh! Sucks.\n\n****update--outdoor seating is back!  with shiny new furniture.", "author": "suzanne k."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-05", "description": "The food is expensive for what your getting.  I don't eat there anymore. \nOn the other hand Friday night happy hour is lively and the beers are  inexpensive.", "author": "Dina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "Can only vouch for the Margarita which was pretty good for 7.00 bucks and Dumbo.  It was light on the sour mix and heavy on the tequila!  Service was quick and friendly.  Its a bit below street level so you forget its still daylight and don't feel guilty that you are having Margaritas at noon on a Tuesday and your not even on vacation!", "author": "Wanda N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-31", "description": "Discovered this place when I jogged to Brooklyn from my hotel.  \n\n$5 lunch specials (the carnitas-like pork was excellent), $4 dollar beers, cool staff.    \n\nJust a basic place to flying in, chow down, and fly out.", "author": "Robert M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "Pedro's is probably my favorite DUMBO lunch spot on a nice day. Stop in, order a wonderful chicken burrito, get some extra green salsa on it and get the whole thing to go. Walk out to the park and sit between the two bridges and enjoy. Simple recipe, ne?\n\nThis place is messy and grimy. I don't think I'd ever order in, except maybe one of their margarita specials...its a dive, but they do have benches and you can drink outside. And no, its not California style mexican food, its something else, and that's alright because what it is happens to be nice and tasty. Pass on the beef and get something made with their fall of the bone chicken, or the tender pork, or one of the tamales.", "author": "Carl C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-20", "description": "Went here last week after a failed attempt to fill my tummy up with 21.00 pizza.  The chicken tacos were decent, although kind of bland.  My favorite was the margarita.  $5.00 for a decent sized margarita?  I'll take it.  It was strong and amazingly yummy.  Will definitely return to try the empanades and for some more margaritas!!", "author": "Jaclyn M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-14", "description": "Despite the seedy appearance, Pedro's has a totally inoffensive selection of food at a very reasonable price. I went here during my lunch break, mainly because the graffiti they had on their storefront peaked my interest. Inside the place is pretty small, they have maybe one or two TVs, enough seats for maybe 20 people at most and a little bar area.\n\nBuying food here isn't really too off from getting something from maybe a cafeteria, everything is under a heat lamp and it tastes like it might have been sitting there for maybe an hour or so. I ordered the fried chicken lunch special, which rang up at $5 plus another $2 for a Snapple. The fried chicken wasn't so bad, a bit boney and for the price the portion was really good considering a sandwich would be more expensive at most places in New York. Most of the portion was rice and beans, but I couldn't complain too much.\n\nUltimately, this isn't really a place you'd go out of your way to eat at but it isn't a bad place to show up at either. The food is fairly basic and you aren't really going to have anything that will blow you away but there is nothing wrong with being totally average either.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "The place always seems to be busy so obviously they are doing something right. My margarita was ok, nothing stand-out. I'm not a big fan of sweet and sour/margarita mix so maybe thats why. I will have to say don't bother with the nachos, its just not worth it. However, all of our other menu items were pretty tasty. I would definitley go back for a re-try.", "author": "corza m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-22", "description": "This place is a total gem.  Tucked away in Dumbo, it's a total hole in the wall but with friendly staff and great food.  The staff is friendly (especially the grande dame) and the vibe is neighborhoody and friendy.  Very low key - plastic cups for water - but don't let that deter you.  It's a great night out with good food with a friend or friends.  Definitely recommend it.", "author": "Robert A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-14", "description": "I suppose it could be worse. But it's pretty bad. It's just about the only restaurant in Dumbo with a permit (do they even have a permit?) for sidewalk seating, so I think that's what's kept it in business.", "author": "J W."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pedro’s Mexican Bar \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jDgcvuN47c7UcF_cBM4uQQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187972851"}