{"aggregateRating": {"reviewCount": 14, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "So happy we chose this location to celebrate a family event.  The staff was very attentive to our needs, friendly, the food was delicious and came out exactly when we needed.  I highly recommend this location!", "author": "Annas W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-04", "description": "Very happy to be able to stop in here for a midnight pizza served at the bar. Very good pizza surprisingly for an inside hotel Sheraton restaurant.", "author": "Joseph P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-04", "description": "Food: 8/10\nService: 8/10\nAtmosphere: 6/10\n\nAvere is located on the lobby floor of the Sheraton Brooklyn Hotel, and serves (mostly) traditional Tuscan and Northern Italian cuisine.  There are a few things on the menu that depart from the old world Italian trend (burger and fries, more Americanized Italian dishes like Chicken Parm), but I've been pleased when I stuck to the heart of the menu.  The biggest knock on Avere is that cell phone reception is virtually non-existent, which occasionally has to be a consideration when I'm picking lunch or dinner spots in downtown Brooklyn.\n\nIn terms of food, the pastas are always a safe bet - my favorite stand-outs are the Wild Boar Ragu, Bolognese, Orecchiette with Sausage and Brocolli Rabe (I think they're using penne now), and the Linguine Vongole (red sauce with extra garlic).  A shrimp and cannellini bean appetizer is pretty satisfying when it's cold out, and the fried calamari is a great nibbling snack to compliment the awesome drinks that Billy whips up at the bar - a great way to wait out rush hour traffic in the afternoon and take advantage of Happy Hour!\n\nAll in all, Avere is a solid selection for good Italian food in downtown Brooklyn!", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-17", "description": "Service was adequate. Arugula salad was fine. I look forward to nice bread at Italian restaurants and their bread was nothing special. Additionally... call me crazy, but I like to taste the chicken in my chicken parmesan and I expect that really good chicken parmesan will include a tender, juicy chicken filet. Not only did they pound the poultry down to a flat pancake, it was tough to chew and rather tasteless. \nI'm going to give this place another try in the near future and I hope they figure out how to deliver on an acceptable chicken parmesan... come on guys... I'm routing for you.", "author": "Mef B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "So I visited this Ristorante last week while staying at the Sheraton.\n\nThe first nite I had the pasta fagioli soup.  Very taste but not hot enough.\n\nThen I had pasta in a red sauce with boar.  That was excellent.\n  The waiter was a tad slow and I did not receive any bread.  Plus I felt the Jameson pour was light but the charge $12.00 was hefty.\n\n\nThe second night I had the NY Choice Steak.  Marinated in rosemary oil and grilled.  Served sliced.  PERFECT.  I did get bread this time and the waiter was perfect.  The Jameson was still the same!\n\nI will go back there to try the Frutti Di Mare.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-14", "description": "Drinks are small for $13. Bread was cold not even warmed up (plus we had to ask for it) Caesar salad was good! But that's about it. Linguine with clam sauce didn't have any clam meat in it just a bunch of whole clams. After reading the good reviews on here I had high expectations but was very disappointed.", "author": "Samantha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "I had a shit day and on top of that, I got lost in BK \nlucky me I ended up here. I had such a great time, let's start with the food,\nOrecchiette Avere was omg delicious and the service was Amazing. The guy behind, Billy was genuinely friendly and knowledgeable. I had the downtown Manhattan, and the frontier old fashioned. I had a great meal, I had great drinks and I had great customer service. ***** 10 stars!!! if you have the chance, stop by!!!", "author": "Enrique G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Stayed at the Sheraton and decided to have breakfast here \n\nPancakes were very good \nSausage average\n\nTwo eggs over easy good \nHome fries good \n\nPleasant experience \nA little pricey\nService great", "author": "Alex P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "Staying at ALoft for a work trip and this restaurant is also the same as the room service they offer. I ordered the shrimp fettuccine Alfredo with a side of fries. The order was delivered in about 20 minutes -- super impressed. Food was hot and delicious. I'm here for a couple more days and I might have to return but this time eat at the restaurant.", "author": "Joshua P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-01", "description": "Went here not by choice but because this is where my colleagues were staying (Sheraton) and they wanted to eat close to the hotel. I ordered a soup. It wasn't bad. My salad was terrible. It was supposed to have roasted beets and the beets very obviously came from a can. To pay over $12 for a salad that has canned ingredients is just wrong. My husband's chicken was really weird. And my brothers pasta was said to have broccoli rabe. Instead it just had plain broccoli. Basically everything was very overpriced and dont waste your money here when there are plenty of other good options in the area", "author": "Laura A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-27", "description": "Warning:do not use the menu linked to Yelp!  There is now an updated menu with different options and higher prices. Apparently this new menu is only available once you are seated. Also, this has limited options for those with egg allergies. They are willing to check ( it was one of the few things our waiter did actually do), but all pasta -ALL PASTA-is made with egg. So the choices are more limited. The service is not great. Our waiter never checked on us. Not even once. Never asked how we were, if the food was prepared to our satisfaction, did we need anything,...nothing. Of course we did find the \"decorations\" amusing as the restaurant is now Italian, with some Italianate touches, but apparently has also been a Mexican restaurant judging by the Aztec ruin mural and an Irish pub, complete with the an claddagh etched into the mirror and a Jameson Black label faux keg. Yep. That was all there.  The food was tasty but not outstanding. The only reason I'm giving it three stars is because it was close to our hotel and had decent hours on a Sunday. Otherwise we would have been somewhere else.", "author": "Lis C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "I stopped by after work and was very impressed. The staff was very friendly. I had the chef's salad and it was delicious. There was a great selection of wine and for my main course the waiter recommended I try a sandwich from off the menu, with broccoli rabe, Italian sausage, and fresh mozzarella. It was amazing! Definitely recommend this place!", "author": "Alda V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "Great Gem in Brooklyn! Shared the roasted pepper/ chicken dish with steak and mushrooms with a friend. Amazing!!! Highly recommend coming here.", "author": "Sejdo R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "Good service, decent menu, and a nice romantic vibe.  Great to catch a cocktail or have a three course northern Italian meal.  The veal was outta this world!", "author": "Michael A."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Avere Ristorante", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "222 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DZxQ-O8e9bihAN_ZDLV1rA/ls.jpg", "@type": "Restaurant", "telephone": "+19172815197"}