{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-19", "description": "The food was OKAY!! I used a 10% discount from checking in and it was NOT HONORED because the cashier charged me more and then did the discount... Which made my food the exact price with the tax.. Mac n cheese not so cheesy and the chicken was mediocre...", "author": "Nay C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "Soul Spot earned 6 stars the first time I ate there. It was way more food than I could ever eat but I inhaled EVERY drop of it. I ordered oxtails, mac n cheese, and candied yams. The food was as good as any food my fam has ever made and they thow (yea \"thow\") DOWN.\n\nWhen I walked in and realized it was cafeteria style (food is out and you order what's available), I only expected that the servers were able to answer any questions I had regarding ingredients of a dish, offer suggestions, and be polite. At the very least, they met my expectations.\n\nI am downgrading them to a 4 (which is really more like a 3.7) because, when I went back a second time AND brought two newgoers to this \"amazing\" spot, my oxtails were from a batch that had been scorched!! (the bottom of the pot burned and, though the entire thing didn't, the burn taste permeated through the dish) I was pissed because I could smell that something had burned when I walked in the restaurant. Little did I know, it was the oxtails I ordered. I know they put their feet in it! I KNOW it would have hurt to toss out the whole thing. BUT THEY KNEW TOO! - they knew exactly what I was about to experience and gave it to me anyway. That's just bad business and had it not been for that, I would have given them a 5 because the food tops the charts.", "author": "Jalence I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-23", "description": "Highly disappointed with this restaurant. Rice was Super UNDERCOOKED and had no salt what so ever ( would actually prefer Chinese Restaraunt white rice ) it was more like rice pudding. I had the fried chicken with plantains and Mac and cheese.. No flavor what so ever on any of the items . The Mac and cheese had pepper on it which made it impossible for it to even taste like cheese .. The sweet plantains were super dry . The fried chicken didn't have any flavor as well.. It's like they are allergic to even salt .. And did I mention the rice was undercooked! You would be surprised carribean a actually made this food. So disappointing", "author": "Elisabel H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-30", "description": "***THEY WILL NOT HONOR DISCOUNT DEALS HERE (ScoutMob , etc)***\n\nThen there was the food...\nOK. So 1.5 years later I returned and picked up  my food since my biggest previous complaint in my 8/2011 review was about delivery. MISTAKE!!!\n\nFirst of all, I ordered the curry goat with cabbage and plantains. Somehow. Despite all of the full steamer trays, they didn't have plantains ready. So the cashier apparently decided to go make them from scratch. I did not realize this til later or I would have preferred not to add 15+ minutes for someone handling money to make a side dish. Then I did my usual and checked-in on Foursquare. Yay! 50% off!! So I threw in a lemonade. But when I showed the ScoutMob/Foursquare deal to the manager he waved it off saying they don't honor that any more. So I paid full prices \u0026 took my food back to my desk where I attempted to eat it. The \"cabbage\" was mostly green peas and corn with a little cabbage thrown in. Did the price of cabbage go up? Is there a shortage? Then I had the goat. I wasn't as surprised by the amount of bone as I was by the fact that the meat had the texture of rubberized rope and was impossible to chew! So most of it ended up in the garbage. If my teeth can't handle the job, I'm not asking my stomach to do it.", "author": "Kim R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-27", "description": "I ordered the bbq ribs, and they were so bad that they LITERALLY slapped me in the face.  The meat was so tough that it stuck to the bone (the opposite of what it's supposed to do!).  I bit into it and was trying to pull the meat off when the rib slipped through my fingers and flung right into my cheek. \n\n\"I award you no points, and may God have mercy on your soul.\"", "author": "kik k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "I like this spot, despite the fact that it usually costs me about $11 for lunch. \n\nThe reason: I like the jerked chicken and the mashed potatoes. Plain and simple. The BBQ chicken is good as well. That's about all I've tried.\n\nThe selection of sides that come with your lunch, which is always a meat and two sides, are always good too. I like the caribbean style greens and the mac and cheese.\n\nI can certainly see why some people might not like this place, but for the area, it's a nice spot to go from time to time to have something different.", "author": "Clayton A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-13", "description": "Well, well I received a comment from \"yaya c.\", from the soul spot, and I will post it below: \nComment by Yaya C. of the Soul Spot:\nThanks for visiting the soul spot Amy but will appreciated it if u at least try the food or had a bad experience that warrant a review than just walking in and out to write something just because u can.......baseless review.\nWow!\nSomeone's feelings got hurt, I guess the truth hurts.\nOkay I think I explained myself in the first review and I did return because I was in the area at the courthouse and on lunch I went here with one of my lawyer friends......... she was paying :-).  I didn't feel the need to update my review as my initial review was basically justified.  \nSo here my fellow yelpers is the honest review and sorry \"yaya\" its not a baseless, review its a fact.  She had fried chicken, macaroni and cheese and collard greens.  I had baked chicken, yams and macaroni and cheese. Also cornbread.  The chicken was tasteless and ad a slightly off taste.  Is this chicken a \"D\" grade quality of chicken? It tasted very old and \"tough\".  The yams was Sylvias from a can.  No additional seasonings added which was definitely necessary.  The collard greens was frozen, I don't expect them to be fresh and homemade tasting, but tasting like hospital greens and was very watery! The MAC and cheese was like basically cheeseless and the elbows were misguided and overcooked.  The MAC and cheese was flaky?!?!?!!! Hey soul spot at least the corn bread was edible right? Not going back even if given a free meal again and not recommending to any of my friends. There are several great soul food restaurants in Brooklyn and they are Soulfood Kitchen, Fosters Restaurant, Halsey Street Grill, even Ms. Ruthies on Myrtle Avenue.\nI submitted all the evidence and rest my case!  -_-", "author": "Amy W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-30", "description": "One day I had a serious craving for something quick yet homestyle so I thought I'd give the soul spot a try. Upon entering the small atmosphere, I didn't feel welcomed. The lady behind the counter who serves the food just stared at me which resulted in me staring at her which resulted in this awkward silence. I was surprised that no one even bothered to smile, let alone offer me a menu or announce the daily special or something. There was also a young girl assisting the server with the register who also had a very stand-offish vibe who kept looking me up and down for whatever reason. I was uncertain on what I should try because there are so many choices so I asked if they had a specialty dish and I was told \"No, just choose something you like.\" Hmmm, \"RUDE\" I thought. I ultimately went with the oxtails, yams, peas \u0026 rice, mac-n-cheese, corn bread \u0026 collard greens. I know that sounds like alot, but I like a pallet of variety(lol). \n\nThe oxtails: Tender, semi-flavorful, didn't exactly \"WOW\" my tastebuds... and being raised on Caribbean food my entire life, I've definitely had better...\n\nYams: The yams were on point. Really flavorful \u0026 sweet, I really liked them.\n\nRice-n-peas: well, it didn't exactly look like your traditional rice-n-peas. The color was off (rather light), and the taste was rather bland. I didn't really care for this...\n\nMac-n-cheese: There was nothing wow about this either. Usually restaurants will make sure the mac-n-cheese if nothing else is tasteful \u0026 unique. The taste here was very sharp, but the cheese lacked in OVERALL taste \u0026 quality. Unfortunately, I think they use cheap cheese in their ingredients, which results in cheap taste...\n\nCollard greens: I am usually one to SKIP greens on the menu but i'd thought I give this a try, I took 2 bites and tossed the remainder in the trash. Waaay too watery \u0026 bland.\n\nCorn bread: Moist, well textured, nice looking. Boring in taste. Butter on top didn't even help. I'm no Chef myself but I can assure that even i've made better.\n\nI had my order to take-out so before I left I asked if the owner was available. I said hello to the owner, whom seems very nice by the way. Overall, I was really excited to try this place but with the nonchalant greeting I received from the staff on top of the disappointment in the taste, there is a slim chance to none that I will be returning back. If this place were to step it up JUST a notch it would make all the difference.", "author": "Keyona S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-04", "description": "Ordered delivery. The appetizer portions are really measly and no way worth their price. Also I ordered beef ribs and they called saying they were out and so we replaced it with chicken dumplings -- and then they didn't even send the dumplings! Spent $53 on a very tiny portion of food, not worth it.", "author": "Zina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "SO. SO. SO. GOOD! My wife and I ate here last weekend. I got the jerk chicken with okra on the side. She got the bbq rigs with candy yams on the side. Everything was delicious, but jerk chicken and the candy yams were on a whole other level! Plus, it's halal so that helps.", "author": "Ehab Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-21", "description": "Good chicken, decent macaroni and cheese, really good collard greens and corn bread.  It's a little too expensive to make a real habit out of going here, but I look forward to trying more of their food.  They do have generous portions, so for those of you who have some self-control, you'll be able to make two decent lunches out of one order.  \n\nCustomer service was probably a 3/10, but some of that is my innate awkwardness and not wanting to ask about any of the food, so I end up giggling nervously and making rash decisions.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-24", "description": "I was so excited to eat here...so many good reviews all over the place. I walk in and the vibe was awesome....though i did wait a good 10 minutes for the lady to attend to me (she was on the phone). \nI had salmon, mac and cheese and collard greens...For one it was way over priced...all the items on my plate was laced with black pepper n no seasoning...i was  highly disappointed and i will NEVER return", "author": "Zarrah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-05", "description": "Had some food delivered today. Delivery took about 50 min.\n\nThe food arrived hot. The drinks (lemonade) was spilt all over my corn bread.. didn't complain cause I was too hungry to pick up the phone and bitch someone out...\n\nI had the fried chicken entree. The chicken was a little too salty for me (I add salt to everything). The sides of sweet corn and mac \u0026cheese were really really good. Lemonade was way too sweet.\n\nMight order from here again..", "author": "Sera A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "it's SO good. not necessarily good FOR you, but so delicious. the staff doesnt always seem too thrilled to be there but they are friendly.\n\nAs said, you pick a type of chicken or fish, and two sides. You get two or three big pieces of chicken, and heaping amounts of sides. It's a ton of food, in a good way. \n\nthe jerk chicken is amazing. it literally falls off the bone. the \"baked\" chicken, which is really just jerk chicken that is seasoned regularly [not spicky, not jerk, just seasoned] is really good too.\n\nmashed potatoes are amazing. just try them. sweet corn is so good too.\n\nthe mac\u0026cheese is oddly sweet. the stuffing is way too sweet also.\n\nit takes 5minutes or less since the food is ready. but never felt like the food had been sitting out there for a long time, or wasn't fresh. even towards the 10pm mark. always hot, fresh, and extremely tasty. \n\nthe corn bread is perfect too.", "author": "Justin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-04", "description": "I just love using Grubhub, else I wouldn't have known these guys deliver to my zipcode. \n\nSo let's see, I ordered the baked chicken, with a side of rice, potato salad and i also ordered some candied yams and the okra and tomato stew.\n\nThe chicken: good enough...it was a little dry, but still fell off the bone, which was eh good enough for me on a cold rainy day.\n\nThe rice: I had actually asked for plain white, but got the black-eyed pea rice instead...which was good. Flavorful, and moist, it was tasty, went well with the okra and tomato stew dish.\n\nThe okra and tomato stew dish: well...I have to agree with one of the earlier reviews...it did taste a little weird, but I feel this can be attributed to using canned tomatoes and not fresh ones, asides from the slightly strange canned flavor, it was good to eat.\n\nThe potato salad: yummy.\n\nannnnd...the best part: THE CANDIED YAMS. Oh my, they were sooooooooooo good! Perfectly sweet, perfectly cooked...and just delicious. \n\nI'm probably going to order from these guys again; but here's my thing about all restaurant food: after you get used to cooking (I've been cooking a long time) restaurant food is just not impressive in comparison to a home cooked meal--unless its something you simply cannot make. This place replicates that \"home cooked\" feeling in food, more so than other take out places I've ordered from. I guess that's soul food, huh? :)", "author": "Amber E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-21", "description": "Saw this place advertised on Groupon and decided to try it. I went for the $40 deal. I got the Southern fried chicken meal, the Oxtail meal and the curry chicken meal. Also my mom wanted to try the banana pudding so i ordered that as well. I called ahead and ordered the customer service was very nice on the phone. The portions that i was giving was no where near worth $11-12.  2 pieces of chicken (the skin season was good underneath no flavor) scoop of yams and watery collards. Curry chicken was mostly gravy and bones, the mac and cheese had no taste. The oxtail dinner had flavor but the portion again wasn't worth the price. The best was the banana pudding. My mother is a true southerner she was disgusted with the fact that the banana pudding wasn't real banana pudding. It was banana flavored pudding with imitation vanilla waffers stuck inside. So my search continues for the best soul food spot.............", "author": "Karen C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-03", "description": "Ironic that Soul in the name, bec. it's certainly not in the food. But there is a metric ton of black pepper. In everything, especially the dry chicken. Oh my burning esophagus.", "author": "mike l."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-02", "description": "Their collard greens, corn and baked salmon are very tasty and flavorful but their banana pudding is processed liquid and they are rude and take too long to deliver. They are the closest soul food place so I keep giving them chances but after my last order I'm done. \n\nI didn't want to place an order online because they always call to tell me they ran out of something so I figured I'd call directly to ask what they did have that night. I was put on hold for five minutes, she came back to the phone and asked how she could help me and i said \"Hi, I want to place a hold for delivery and was put on hold.\" and she just responds \"Well you're going to have to keep holding\". WTH So after an additional five minutes I hung up. I ordered online and paid extra for a third side. This place isn't cheap and takes a long time to deliver yet when my food got here it didn't include the extra side and the banana pudding was the worst ever. I called and said \"I ordered online and my food is here but missing a side that was already paid for\", with no apologies or asking me to hold I hear her telling this to someone else, that someone else comes to the phone and asks what the problem is with attitude. \nAt this point I've had it with their lack of customer service so I said \"I paid extra for a side that I didn't get\" and she said \"we don't have the baked stuffing\". No apologies. So I said \"Well I wasn't notified of that and it was still included in my bill. You still charged me for something you don't have.\" She was really snarky and was like in a sarcastic manner (after I agreed to having mash potatoes instead - which I had to season and re-heat since it clearly lacked a homemade quality) - \"Thank you for your kindness and understanding\" and hung up. \n\nTheir food is not that good to make up for their employees' lack of professionalism.", "author": "Sha M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "The smothered chicken here is amazing.... I also like the mac nd cheese, the customer service is very friendly as well.", "author": "Darnella P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-26", "description": "One word:  NO!\n\nOk, I got fooled by the decent tasting Candied Yams but it was downhill afterwards.\n\nFlavorless cornbread, Mac \u0026 Cheese has the cheese M.I.A. and the okra and tomatoes was edible at best.\n\nSupposed Soul Food minus the soul.\n\nIt just wasn't worth the trip.\n\nWon't be back.", "author": "Mister W."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}