{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-22", "description": "this food is horrendous. salt rlly isn't the only seasoning out there. and their \"fresh squeezed\" lemonade is definitely crystal light powder. don't do it to yourself.", "author": "Taina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-09", "description": "I will never again dine in a restaurant, leave a nice tip after eating their food where \"customers\" are not allowed to use the restroom.\n\nThe southern fried chicken gets a C+, their yams a B, but their blackeyed peas and rice get a failing grade. Mind you, the cooks, servers, and owner are all foreign born and did not grow up on soul food.", "author": "W Bill S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-01", "description": "I went here after work because I was too lazy to cook and I was craving southern food. This was one of the worst Southern places I've been to. Everything looked cold and unappetizing and the counter girl barely gave me a chance to look at the menu before hounding me to take my order. I got two meals the smothered lamb chops with sweet potato and a side of rice as peas (my mistake) and my friend got the barbecue ribs with corn and potato salad and when she told me the price I did a hard gulp in disbelief at how pricey It was. I wanted to stay and eat but she didn't even ask me what I wanted to do she just dumped my food in a to go container all sloppily so I went home. Five minutes later I ripped into it but the good was damn cold so I microwaved it. All I can  say was the food was edible. Just edible. And if you want terrible gas this is the right place to ruin you night with it.", "author": "Racquel N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "The food was OH SO good ! They give you giant portions. The ladies were nice and very genuine ! They were a little pricy but like I said tons  of food !", "author": "Christine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "This delicious curry goat is a prime reason I can never go vegan. Good lord. Loved the smell. Loved the taste. Easy transaction with a smile. I will return.", "author": "Christopher R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "This is the best tasting lunch food in its neighborhood. Generous portions, reasonable prices, soul food and Caribbean food under one roof!? Fried chicken, curry chicken, chicken and dumplings all solid.", "author": "B R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "Small stop in soul food shop with some great food! Came here on a weekday around 5pm and it did not disappoint, don't know what happened with the bad ratings here. The only trouble was parking in this area is tough. Soul spot is a small Caribbean/West Indian restaurant and serves halal soul food. It's a small resultant, nothing to show off about, but worth i for the food. Limited seating (about 8 seats) They have lunch and dinner combos of all different meats and sides. I had the jerk chicken with mac n cheese and rice with black eye peas. The jerk chicken was fall off the bone with amazing flavor. Mac n cheese was cheesy and delicious and rice was a nice addition to it. They give you a very large portion of the two sides and two pieces of chicken with the dinner combo for ~11$, great price. Also try to homemade lemonade! Can't wait to go back and try their other options.", "author": "Kyle T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "Tried them for the first time, today. I really wanted fried chicken, but they were out, so I got the jerk chicken (came with 2 sides plus free cornbread!) with mac and cheese and collards. The collard greens were nicely cooked. It's a halal place, so there's no pork in it. The mac and cheese was okay. It tastes much better when doused in gravy. The jerk chicken, y'all. Omg. It was well-seasoned and juicy and just....dear God. I have to come here again. And again, and also again.\n\nThey have an extensive menu, including beef short ribs, salmon, fried fish, shrimp, yams, etc", "author": "Sonjay M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-23", "description": "Ordered the BBQ ribs meal and the oxtails meal for my husband. He called and told me the food was disgusting. He said the food tastes like days old leftovers. When I got home I saw that it must have been not good due to the food still there. One of my sons ate some and said it didn't taste good either. \n\nI tasted the mac and cheese and it tastes like boxed velvetta shells just with extra cheese thrown on it. I threw out the $30 worth of food!  Later on that night my husband woke up vomiting and diarrhea. This was the last meal he ate. Now 3 days later here we are with him being admitted into the hospital with suspicion of food poisoning. \n\nAnd to top it off whenI mentioned this to a friend about the quality of the restaurant they mentioned that a mutual friend also got sick after eating from here. NEVER AGAIN.", "author": "Shameana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "How can I say this is the best Caribbean spot I've been to in a long time? I guess like that. Best jerk chicken. Hands down. Amazing okra with stewed tomatoes (and I don't even like tomatoes). Excellent rice with black eyed peas. People say there's no way to mess up cornbread but I've had some bad ones. The Soul Spot knows how NOT to mess up cornbread!\n\nThe only thing that's keeping this review from 5 stars is that they barely had anything available on the Saturday morning I came in. No curried goat. No red snapper. I thought to myself \"then what do you have?!\" I had to settle with the jerk chicken but later discovered that it was not disappointing.", "author": "Kemi D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "I have no idea why this place is 3 stars. Absolutely amazing jerk chicken GREAT food and honestly if you're getting bad customer service you're probably being an annoying customer (we all know one). Decided to sit in and eat some actual halal soul food - which I've never experienced. Great service, and they do help you out if they can.\n\nFood - 5/5. Ordered the jerk chicken with rice and beans and Mac and cheese. Amazing soul food with great taste. Loved it.\n\nService - 5/5 lady gave me quarters from her purse to pay for parking, thank you!!!\n\nAnything to note - halal \n\nWould love to come through again and will in the near future.", "author": "Fahad H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "The ratings of this establishment is surely enough to have you running for the hills. However,  this place was highly recommended by a friend and well, it's halal, so I decided to just go for it.\n\nLet's just say, I was certainly not disappointed. The food is delicious, with plenty of options to choose from. And daaaamn, they fill that plate to the brim, you get a lot of food for the price. You get your choice of meat, two sides and cornbread. DO NOT GET ME STARTED ON THE CORNBREAD. The cornbread is diviiiiiiine!!!! \n\nSo don't fret, come to The Soul Spot.", "author": "Marina F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "First, I ordered turkey wings expecting to get actual wings but instead I got a piece of a wing and a big greasy fatty wing tip..\n\nSecond, I asked for a lil gravy on my mac n cheese but instead ended up with turkey tip soup because she poured so much gravy into the already cramped bowl. I guess this was her way of sticking it to me because I asked for the gravy after she had put the lid on the bowl\n\nThird, they need to use slotted spoons so they can drain the liquid off the things such as corn and greens. This is especially important considering they put everything in a single non slotted bowl. \n\nFourth, the customer service is horrible. The one staff member, taller and lighter skin, attitude is nasty. She acted as if she was doing us a favor for taking our money.\n\nFifth, the overall food is all that good...Mac n cheese lame - straight out the box... collard greens average...Turkey tips undercooked - what lil meat is on them should be falling off the bone...rice was mushy.. and the peach cobbler was \"doughy\"/half done and unsweet...topping it off it was all overpriced.\n\nI wish this was one of the times you could give no stars because this place is just that bad.\n\nTo have subpar food and to serve it with a stank attitude, there is no way I would ever come back. \n\nShould have read the reviews beforehand. \n\nThis place should learn to respect your customers. Without the customers, there is no business.", "author": "Helga J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "I love this place! The oxtail is my favorite, I also like the curry goat!  I wish they packaged the al carte items in a tighter sealing container.", "author": "Mia Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "The food is so tasty and delicious. The jerk chicken is amazing. The portions are huge! The service is great.", "author": "Nikki R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "Stopped by to grab a quick dinner and there was no line.  They offered a 10% discount for checking in on yelp that is a plus.  Small little restaurant  only maybe about 3 or 4 tables.  \n\nWe tried the turkey wing with collard greens and rice and peas and the other we had the baked chicken with macaroni salad and okra.  I don't really see turkey wing on the menu too often and decided to try it and it did not disappoint.  It was not as dry as the chicken and was flavorful.  Collard greens and rice and peas were decent sides.  The baked chicken was ok, some parts were a little dry but wasn't too bad.  The okra was delicious with the tomatoes.  The macaroni salad was not as good.  It looks cheesy but lacks the cheese taste.  Tasted a little plain.\n\nOverall, this is a good place to grab a quick bite but I think their prices are a little on the higher side compared to similar restaurants.", "author": "Jason L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-17", "description": "Took the jerk chicken w/ rice. Didn't like at all, but I guess I ain't a soul food person myself.", "author": "Abhichandra R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-14", "description": "OMG. Not what I was expecting, I am very disappointed.  The red velvet cake taste like lemon cake, the mac and cheese taste like boxed Kraft Mac and cheese....I can't. They must cater to the neighborhood. \n\nThe corn bread is ok!", "author": "Mona D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-02", "description": "The food here isn't bad, it's just not great, and expensive for what it is. Service is not great either. Skip it.", "author": "Jessica F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Taste of The South with Caribbean flavors. \n\nI live in Houston and I have to come The Soul Spot for at least one meal every time I come to New York. The Collard Greens and Cornbread are just like moms and that Jerk Chicken has that spicy heat kick that brings variety and excitement into every savory bite. Collard greens are seasoned very well with pepper and just something I can't quite put my finger on. The cornbread is moist, fluffy and a touch honey sweetness that you only see in the South. The dirty rice are packed with herbs, beans, and flavor without the excessive salt that other places have. I am not a terribly emotional man, but this food brings me to my knees. It's a real blessing.\n\nThe portions are Southern sized which means you'd better come hungry, and yeah it's a no frills store. You get what you get and don't throw a fit cuz this here is the best damn Soulfood I've had in all of New York. The Soul Spot...y'all better get in on this cuz it ain't much more authentic than this.", "author": "Chuck W."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}