{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-20", "description": "I don't even want to give a star so one star is being generous. I've been waiting for my food for the past two hours spoke to the female on the phone she said she called the driver .. Called back an half hour later no answer I called the store 5 times before they answer for the female to tell me there no manager in the store no one was in charge she doesn't know where her delivery guy is. Then she hangs up the phone the food showed up cold drinks spilled in the bag called back and she said give the food back and hung up horrible business never will order from her again and this is not the last they have heard of me.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-23", "description": "I was so disappointed after I placed a grub hub order with this restaurant. I had placed an order a few weeks prior for my boyfriend who had a jerk chicken dinner that he said was very tasty. I was very sick at the time so I couldn't even sample a morsel of the food. Flash forward to now, for myself I ordered a whiting lunch platter with Mac \u0026 cheese and collard greens. I must say that wasn't soul food at all! Well, not prepared the way I expected it to taste. The greens were very bland and the Mac \u0026 cheese was far from baked. The whiting appeared to had been refrained a few times because it smelled terribly, and the coating was awful. \nThe did come faster than I anticipated BUT it tasted like crap. I definitely won't be ordering from here again.", "author": "La'Donnia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "11bucks for a plate of food during lunch.  The jerk chicken was very tender and quite spicy (in a good way!). Rice and peas was great, but cabbage a little oily.  The meal came with a piece of cornbread: light and moist.", "author": "Anya A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-10", "description": "Two hour plus wait for some fried chicken! Could have walked to Kentucky and back by now. Never again will I order food from such a terrible place.", "author": "Erik L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-14", "description": "This place is really not that good. HOWEVER, I still find myself craving it from time to time. I suppose that's what soul food does to you. I've had catfish that was terrible, oxtails that were great, and other dishes varying in satisfaction. Sides are probably my favorite thing to get here.", "author": "Zack L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-30", "description": "I catered for 200 people from Soul Spot. The food was ON POINT! Delicious. They were very professional and delivered on time. Yaya the chef and owner is a sweetheart, very personable and even offered ideas of how to deal with the venue when we were having issues with servers. I have eaten lunch there as well and the food was great.", "author": "Yanoh J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "Wow, I love this place!  You cannot beat the food nor the service.  While I have only done delivery,  they are always so nice and accommodating!\n\nThe food is perfect southern cuisine and yummy.  Best salmon cakes ever...even better than my grandmothers...and the jerk chicken is amazing.  Try the rice and peas, please, with oxtail gravy.  This place is a true gem.", "author": "Charlotte A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "First time I had halal jerk chicken, good spice, moist, but could be a bit more spiced, it is caribbean cuisine after all. Decent portions but filling also mash and collard greens as a side, pretty standard. Corn bread kinda dry but, well its corn bread!", "author": "Mo F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-23", "description": "After suffering through the red velvet, I came here to say. Never ever ever order this. Sides here are good. Entrées are hit and miss.", "author": "Be L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-30", "description": "Was in the mood for jerk chicken because I wanted something with heat.  Found this place on Yelp and I was looking forward to my lunch, but I was kinda disappointed.  Jerk chicken was over a little over seasoned but had good heat.  Collard greens were too salty.  The corn was overcooked and was tough \u0026 chewy.  Not sure I'll give this place another chance with all the great food options around.", "author": "Blesson S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-06", "description": "We ordered delivery from here and were pretty disappointed with everything. I have to mention that it was near closing time, but that should not affect quality the way it did. \n\nThe fried chicken was definitely not fresh and it was dry--tasted like it had been sitting all night and reheated. The macaroni and cheese was absolute MUSH--completely overcooked, not cheesy and flavorless--I had to add salt and pepper. I ordered mashed potatoes as my other side because I LOVE mashed potatoes and I swear to you, I'm convinced they were instant potatoes. If it is true, what self-respecting restaurant serves fake product? They tasted instant and were way too pasty and lump-free to be real potatoes. Such a disappointment, as I figured a soul food spot would get it right.", "author": "Jaime R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-10", "description": "I'm almost afraid to write this review because I'll get a major craving for the soul spot if I talk about it. I've only been here twice because it's so far from me..but in terms of variety and quality of food, this place is a definite five star. I got their mouth watering jerk chicken with a side of mashed potatoes, cornbread and possibly the best mac n cheese ever. There are so many side options that I can't start listing them all. The ladies who work there will pile everything into your plate, so be ready for the ill food coma afterwards. I actually like that the setup is so informal because I can easily just go there alone and eat in peace. I need to buy this place so I can open up a Queens location!!", "author": "Aisha Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-13", "description": "I came here with my groupon and bought two dinner meals, one for me and one for my mom. We both had the jerk chicken and I ordered the yams and collard greens which were good. My mom had the okra with stewed tomatoes and potato salad which she loved. We both agreed the jerk chicken was just okay and the food portions were decent. Staff were okay and could've been a little more friendlier and at least smiled. I definitely wouldn't sit down for dinner here because it looks more like a take out joint or someplace where you want to grab a quick bite. I would return if Im in the neighborhood.", "author": "Teresa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-12", "description": "I bought the Groupon deal for $40 worth of food.  It was so worth it. I got the fried chicken, baked chicken, and jerk chicken meals. I also got a side of the chicken and dumplings (they forgot the dumplings), yams, corn, okra, mac and cheese, and fried plantains. I think each meal was around 10-11 dollars. They also forgot to give us the plaintains and cornbread (that comes with each meal) and I had to remind them to give them to me. \n\nOverall, the food was actually very tasty and the service was not bad except for them forgetting some food. I probably wouldn't come back thought since I think it's expensive for what we got (the portions were small). The chicken and dumplings side came with 2 pieces of fried chicken and same amount for the meals.", "author": "Allan D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-08", "description": "This is the worst food I have had, and absolutely NOT representative of Southern Style Food in taste.  I ordered the Southern Fried Chicken Lunch Special.  I chose Collard Greens and Candied Yams as my sides.  I then ordered a side of Mac and Cheese.  The meal also came with Corn Bread.  To drink, I ordered a large fruit punch(which turned out to be the best part of the meal).  My meal came to almost $18 and I threw the entire meal absent a few bites in the garbage, that is how disgusting it was.  Firstly, the server did not drain the Greens prior to placing in my  to go container so my Candied Yams and Fried Chicken was swimming in Collard Green pot liquor.  The Greens tasted bland like the only seasoning was vinegar, salt and pepper(and I didn't have any hot sauce in my office to make it tastier), The candied yams aren't actually candied yams but baked sweet potato cut into quarters, The Chicken not only lacked seasoning, it was soft and too pale, no crisp to it at all.  And this wasn't the part that was soaking in the collard green pot liquor for over 10 minutes as walked back to my office.  The macaroni and cheese was simply disgusting.  The macaroni was too soft, overcooked is a better way to describe it.  And it is doubtful that it was baked at all, and appeared to have been mixed and cooked in a pot with some melted cheese. I spent my summers in rural Mississippi, and Alabama as a child.  Both of my parents are from the south, I know how to cook southern food.  This was not representative in portions or taste of Southern Style Food.  I am extremely disappointed and the 1 star is because I am not able to give them no stars.", "author": "Brenda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "my go-to for food delivery esp when i'm craving a home cooked meal but too lazy to make it happen. not the friendliest staff but food is always on point and hits the spot", "author": "Mona S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "While doing my civic duty of going to jury duty I was in the neighborhood and decided to try this place for lunch.   The restaurant says soul food but really the food was a lot more similar to west Indian. I tried the oxtail and the jerk chicken and the tomato \u0026 okra and Mac \u0026 cheese sides. \n\nThe oxtail was succulent melt off the bone and in pool of oxtail marrow broth\n \nThe jerk Chicken was well seasoned and moist and tender.  I liked this the best and it seems to be their signature dish,\n\nThe okra and tomato side was a wonderful side and tasted like a west Indian ratatouille   The Mac and cheese was simply ok. \n\nI tried their home made hot sauce which was good but I felt it could use more heat but I tend to underrate heat after burning my taste buds down from years of abuse. \n\nI thought the staff was friendly.  I came for lunch and it was a pleasant experience.  From looking at the reviews I would say this place is best sampled during lunch and you avoid delivery.", "author": "Francis Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-10", "description": "I'm sorry I wasted the calories on this meal. When you eat soul food, you want it to be good. This was just bleh.\n\n--BBQ beef ribs: Tasted like straight up tomato paste and ketchup.\n--Fried whiting: Greasy, but it was seasoned.\n--Mac and cheese: Tasted like it was made with a block of Velvetta. It did not taste like real cheese. No seasoning.\n--Mashed potatoes: No distinct flavors, but fine.\n--Yams: Fine, but it tasted like it could have come out of a can.\n--Cornbread: Nothing special.\n--\"Steamed\" vegetables: More like boiled cabbage. It was swimming in water.\n\nI don't know why this place is rated so highly, except that maybe it has a homey feel and the staff is nice. It's a really, really small space where locals seem to gather.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-08", "description": "It's really, really, really tasty, and I've only had the vegetarian items. Okra is rich in spices and flavour; Mac and cheese, beans (of various kinds) and sweet potatoes are expertly made.\n\nMy friends tell me the chicken falls off the bone.\n\nTip: order the fried plantains first, as they take a while to make. (Everything else is premade.)", "author": "Paul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-19", "description": "When you go here , do not have high expectations for ambiance or decor.  This is great place for a quick bite. Its small but as long as the food is good, who cares.  The girl at the front could use some lessons in hospitality but as long as the food is good, who cares :).  I think its great that you can get everything ala carte so you can try everything without paying for a full meal with sides.  But you get the best bang for your buck with the meals cause you get two sides and a good amount of food.  Ala carte prices are a little high for the amount of food but i'm okay with that , as long as the food is good, who cares... \n\nWe had the Jerk Chicken, Oxtail, curry chicken, fried chicken, collard greens, rice with black eyed peas, mac and cheese and okra stewed in tomatoes.  The Jerk Chicken LITERALLY I mean LITERALLY fell off the bones , it was so moist. My favorites were the jerk chicken and oxtail.", "author": "Skippy S."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}