{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-21", "description": "Had some doubts about this place based on previous reviews, but I wanted to try something new recently and took a chance. Must say that I was quite pleased! Order 3 platters for my family and the Goat Curry, Oxtail and BBQ Ribs were all fabulous! And one of the highlights of the meal was the fresh cornbread that had a brilliant crust. \n\nwill definitely be headed back to the Soul Spot to try some more of their options. \n\nwhile in line, another customer raved about their Chicken and Vegetable soup - may be on the list for my next visit!", "author": "Chris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "Soul Spot gives customers delicious food at a reasonable price. They offer all the expected soul food dishes--jerk chicken, barbeque chicken, ox tail and many more--plus sides like mac and cheese, rice and beans, candied yams and mashed potatoes. Every one of the options I've tried is flavorful and plentiful; $10 buys you a more-than-filling meal. \n\nFor beginners I recommend the jerk chicken with candied yams and mac and cheese. The chicken isn't overly spicy but the yams are a little too sweet on their own. The food all pairs well together, however, so this isn't a huge problem. Keep in mind that as with any restaurant that doesn't cook its food to order, you will find the freshest food at around lunchtime.\n\nOn the downside, be prepared to fight off the inevitable drowsiness that follows.", "author": "Mike T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-12", "description": "Terrible food, but nice people. Ate this place one year ago and forgot how awful it was. Walked in again recently and was reminded of how disgusting food that's supposed to be comforting can taste. Try at your own risk.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-20", "description": "Pretty mediocre. Had the smothered chicken, mac n cheese, baked stuffing, cornbread, salmon croquettes, fried catfish, okra with stewed tomatoes. Smothered chicken had decent flavor but the meat seemed a little tough like it had been sitting in a warmer for a while. Our favorite was probably the okra but that's not a main attraction. The salmon croquettes should be avoided, they were heavy, more chewy on the outside than crispy, and way too salty. The plantains were kind of dry and bland as well. Mac n cheese, stuffing and cornbread were all average at best. Someone said the portions are large which I didn't get, but the food is generally heavy so I was full.", "author": "I. R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-19", "description": "Not into it. I know that being veg, I obviously can't experience the potential awesomeness of the meat. But I can definitely comment on the sides. I effing love sides at soul food places, and am a bit of a connesiour (sp?) of sides at the restaurants my friends love to order BBQ at. I was really looking forward to the mac and cheese. It was really not very good at all. I mean, pasta, cheese, milk, not that hard to screw up. But it was pretty watery and tasteless. \n\nThe \"steamed vegetables\" is mostly a pile of steamed white onions, with some canned carrots and green beans thrown in.\n\nAnd the cornbread, was just off. I can't really explain it, but I love all different types of cornbread, and this I couldn't even finish a small slice. I got another side, but now I can't even remember what it was. \n\nSuffice to say, I would have gone completely hungry did I not get a slice of cake. It was delicious! The saving grace as to why this gets two stars instead of one. Yellow cake with chocolate icing, baked to moist perfection.\n\nRegardless, there are plenty of places to eat cake. I won't be back.", "author": "Janet J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "As I sit here and read some of the reviews I'm like \"wow\"... I personally like the SSR... yes their corn bread is horrid and can be used as a door stop... BUT their fried fish and shrimp make up for it... let's not forget their yams... no it's not he best soul food I've ever had but it does the trick when i don't feel like making it myself... and as far as them being a Jamaican spot idk  about that one seeing how they mostly have soul food dishes readily available.....", "author": "monique n."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "I ate at The Soul Spot's stand during Atlantic Antic and had the jerk chicken with sides of sweet potatoes and collard greens. The collard greens were delicious - tangy and perfectly cooked. The sweet potatoes were sweet like a dessert, but delicious. The jerk sauce was not as jerky as I like, but the chicken was tender and fell off the bone. Good stuff.", "author": "Kurt A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-16", "description": "Unfortunately, I can't comment on the food because we never got to try it. My friend and I ordered delivery from this spot last week - when our food had not arrived an hour and a half after we had placed our order, we called the restaurant to be told that our order had been handed off to someone on the street, mistakenly. Um, Ok.... No apology from the restaurant, no credit received. In fact, the lady on the line (Ebony) was essentially rude to us from the moment we called in, and had a very \"what do you expect\" attitude. Um, we expect to get our food.  We were told we'd have to wait another half for our delivery should we choose to reorder. Deciding that we did not want to wait half an additional half hour longer for what was now becoming a 2 hour ordeal, we decided to order elsewhere. We were appalled by the quality of the customer service we received and will not order from this spot again.", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-17", "description": "have eaten from this place countless times, great for when you need a good, hearty, filling meal, always satisfies my hunger. Only problem is when you order late, say after 8, the food doesn't taste as fresh, like it has been sitting there for a couple hours.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-19", "description": "I bought the Groupon deal for $40.00 worth of food. I wanted the bake snapper, but they didn't have it. So I tried the fried shrimp. The shrimp has so much batter and after pulling off all the fried batter, I was left with little shrimp. The shrimp had no flavor and reminds me of the shrimp you get at a Chinese restaurant. Horrible! My mom wanted to order the smothered turkey wings, no more wings. So she chose the smothered chicken instead which consisted of a breast and leg. Our sides were collard greens, yams (both were really good) steamed okra and rice with black eyed peas (both were just okay). We ordered an extra side of mac n cheese. It was cheesy with no flavor. The portions were small. We ordered dinner and received lunch portions. I didn't receive any cornbread with any of my orders. We tried the peach cobbler and strawberry cake for dessert. The cobbler has so much dough and little peaches. The strawberry cake taste like it came out of a box. I would not go back to this restaurant. If  you know true soul food, you understand what its suppose to taste like. Make the trip uptown(Harlem) for good soul food.", "author": "Keila H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-29", "description": "The food is usually good, but i feel like the customer service is poor, at times when i call to order, the lady on the phone is rude...food is filling for the most part though", "author": "Laywa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-09", "description": "This place is small, there's like two tables in there. Definitely not a place for a date.  It's more of a takeout place. The prices are pretty good, compared to other soul food places. The portions are generous. Overall, pretty good food.", "author": "Skandalouz S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-23", "description": "the soul spot really \"hit the spot\" for my bf and me that day.  the food leaned towards jamaican and i really enjoyed the sweet corn, fried plantains, and collard greens.  the fried chicken was also pretty decent.  chicken \u0026 dumplings were ok.  biiiig portions!\n\noh, \u0026 the girl at the counter was very sweet :)", "author": "Jenny J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-06", "description": "This is my favorite Soul Food spot in Brooklyn.  The food is all made from scratch on the premises (desserts \u0026 drinks included).  It's reasonably priced for the portions they dole out.  I've tried the following: fried whiting (perfect!), Fried Chicken (Crunchy but a lil dry sometimes), Smothered Chicken (just like momma's), mac \u0026 cheese (not as good as mine but pretty good), fried plantains (Being Puerto Rican I am more critical of mine being cut a little thinner and flattened perfectly), mashed potatoes (very good!), Collard greens (YUM!) and I've had the green beans (taste canned but still pretty good), cakes can be a lil dry and yes probably Duncan Hines, Cornbread is always great, the iced tea,lemonade and fruit punch are all extremely sweet so order with PLENTY of ice! LOL.  The Owner is great, very customer friendly, it's a tiny place so large groups wouldn't fare well here but whether we're on a date or with our kids, it's a great place to go. ...I only wished they delivered to Bed-Stuy!! :)", "author": "Jessie E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-26", "description": "Nothing to write home about.  Good for zabihah-only eaters to get some soul food.  I found the food to be interesting, but not satisfying.  The space is lackluster but clean.  Maybe nice for an outing to try something different, especially if you are looking for a halaal place.", "author": "Ralphia L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-07", "description": "I was driving by here one day and decided to drop in. I had the fried chicken, macaroni and cheese with collard greens. Everything was good not the best but still good. The corn bread was not warm at all so that was disappointing. The cashier was very nice she me slide when I was 10 cents short and she didn't make me break out my credit card so I appreciate that.", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-13", "description": "It was okay. Nothing memorable.  The cornbread is so dry and nasty.  I could not finish it.  My party shared fried chicken, jerk chicken, Mac and cheese, candied yams, mashed potato and plantains.  The two best dishes for me was the yams and jerk chicken.  They were the best there not the best I ever had.  We also had the lemon cake and it was very dry.  I will probably not return here because there are so many other great soul food spots.", "author": "Nell W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "Love this place! Went here for dinner with my friends the other night...the jerk chicken was unreal...staff was incredibly friendly and helpful...i would definitely recommend and plan on coming back for more!", "author": "Mike D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-15", "description": "This place is awful. I had the ribs, mashed potatoes and baked macaroni, and it was just plain gross.\n\nSome other users have reported food poisoning, that might be the extreme, but surely, this food is BAD. Stay away.", "author": "Stephen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-10", "description": "Went there with a friend last night.  The place looks a little dingy, with the preprepared food kept heated over hot water, cafeteria-style.  I made my order by sight--went for the Chicken and Dumplings, even though I would never have ordered something that sounds that strange if it weren't in front of me.  I had a side of yams and collared greens, and my friend had a baked or grilled chicken, with sides of mac n cheese and okra in tomato sauce.  My chicken was pulled in a thick sauce, which was spicy and delicious, though a little too salty.  The yams were PERFECT, sweet and cinnamon infused, and the collared were tasty and refreshing.  My friend's chicken was tender and juicy, but the mac n cheese was a bit dry and lackluster.  Overall though, for a quick and cheap meal (less than $10 / person), it was a great choice.  Trust me, try the yams, you won't regret it.", "author": "Omar C."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}