{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-07", "description": "Food is amaaaaazing - everything was packed with flavor! I absolutely loved the oxtails!! \nThe two ladies at the counter today were absolutely lovely. \n\nToday was my first day in here and it most certainly won't be my last!", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-21", "description": "Have had their catered food at 2 separate events and both times it was slamming! Jerk chicken moist, flavorful, and falling off the bone. Rice and peas, Mac and cheese, steamed veggies, cornbread, greens, fried fish....ALL amazing!!!!! I will highly recommend it to anyone.  This food is great and you know if their catered food is good then restaurant portions are gonna be amazing!", "author": "C. S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-12", "description": "Had catering from them. Lots of everyone's favorite soul food, including jerk chicken, fried chicken, collard greens, and all sorts of sides (as well as some veggie friendly fare). Jerk chicken was my favorite, and has the right kick to it. The fried chicken was painfully salty, however.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-29", "description": "I got the vegetarian dish, which is just 4 sides and a slice of corn bread. The food is nothing special - not bad, but not amazing. However, you do get a lot of what you pay for.\n\nI did really like the mac and cheese, which kind of reminded me of the mac and cheese at KFC's, minus the toxic taste. Although i did think that the pasta was a little overcooked.", "author": "Claire Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "Update on my last review... spoke with the owner about my issue and let me tell you, he came through! Not only was he so sincere and accommodating giving us food on the house but more than what we ordered! He won our hearts, thanks again! Also, food is still great!", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-24", "description": "The portion IS SO SMALL FOR THE PRICE. They skimped on the sides and the main. The workers look so miserable. Besides the customer service, the jerk chicken and rice was a little dry. The oxtail was soft and the sauce was good. Personally, I like the plantains to be slightly thinner for more crunchy outside. The taste overall saved this review.", "author": "N L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "This is my 2nd time eating from this spot.. The meatloaf is very good with string beans and steam veggies.. topped off with cornbread ..", "author": "Dennis G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-20", "description": "We were preparing for our holiday party for two hundred employees. We wanted to try a new outside caterer instead of the usual spot. My boss located \"The Soul Spot\" and we looked over the menu. They offer so many different varieties of southern food. I was excited by the choices, so we went all out. Speaking over the phone we put the order under my bosses name and order two or even three of some items. We told them it should be delivered on the twentieth of December by 5pm. On the morning of the party I couldn't wait. Everything was ready, so I decided to call them one last time and confirm everything was going according to plan. When I called the first thing I heard wasn't \"good morning\" or \"how can I help you?\" It was \"hold please!\" I thought to myself \"they must be busy\" so I waited for about 7 minutes to be helped. When the lady came back on the phone, she immediately gave the phone to someone else and this would be what she did every time I called. They confirmed between 4:30 to 5pm. So I felt that was handled and moved on to other preparations. At around 5:20pm the food did not arrive so I called again. Same woman answered and gave the phone to someone else. I asked what time will the good be arriving and she said they guy just left. She then gave me his number and told me call him. I didn't call because I felt it was their job to make sure things went according to plan. By 5:30 he did show up in a regular white van. Some of the food was cold and some very hot. They didn't put it on a van with ovens so some of the food got cold. We had no time to look everything over so we rushed it to the kitchen and heated up as much as possible. I was told items that we ordered did not come so I called one last time. The same lady answered and without fail, she gave the phone to the other lady. I explained to her what was missing and she already knew and was sending it over. Finally with all the food in place and the guest arriving we began to serve the meals. The staff truly enjoyed everything. I wasn't such a fan. Maybe it was because of the headache getting everything together, but the food wasn't what I would had hoped. I am grateful everyone loved it and had a wonderful time. It's a coin toss weather we ever use them again. I guess I will leave it up to popular vote. If I had my way one hundred percent, we would already be looking somewhere new.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-27", "description": "The food was excellent!!! I ordered oxtails, greens, yams and rice w peas. It was well seasoned with nice portion sizes served. The location is small 4 two seat table setting and you also have the option to order tray food as well", "author": "Shonette P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-07", "description": "Delicious fresh soul food. Staff is friendly and welcoming. Small spot but you can't miss it sign is very big. Very clean establishments", "author": "Kisha V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "The best halal Caribbean food I have tried. An older woman makes it, apparently she's a relative of the owners, and if an older woman is making you her family recipes, you know the food is going to be great. The jerk chicken and greens on the sides with some mac and cheese, mouthwatering.", "author": "Jay K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-27", "description": "Limited seating; basically a take out spot. As far as the food goes, I was not impressed at all. Once you get the food home, it is wet, and soggy in the bag. The Catfish, \u0026 Shrimp was average. The Potatoe salad wad very spicy. The orange looking Mac \u0026 Cheese didn't taste good. The Sweet Potaoes, Collard Greens were average at best. The Banana Pudding was basically the best item I brought. How do you make Banana Pudding without bananas. Overall I was highly disappointed.", "author": "Priestly C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "If I could give this spot zero stars, I would. The presentation of the food is sloppy and messy. I was extremely hungry, and nothing else was open in the vicinity so I just gave it a chance. They charge $16 plus tax, for a small container of rice, a side, and oxtails. They literally only put 4 pieces of oxtails in the plate, and a ton of rice and collard greens. The rice was disgusting, the collard greens tasted old, and the oxtails were TRASH. The oxtails had the texture of goat meat, and the gravy was very grainy and poorly seasoned. I'm not sure who the chef is, but they need to be replaced. To top it off, they sell refreshments, like kool-aid, that is ALSO very overpriced and had the nerve to not have ice.\n\nLastly. The customer service was pitiful. One heavyset girl was so unpleasant, and she slapped food into the bowl, by time it finally graced my hands, it looked like slop or dog food. I will never spend another penny in this business.", "author": "Yanet D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-17", "description": "Whenever I'm in the area, which is not that often, I stop by The Soul Spot for dinner.  I ordered my usual, chicken and dumplings, collard greens and macaroni and cheese.  The chicken and dumplings always have just a bit too much pepper for me but I still enjoy it.  The macaroni and cheese.  Not sure what that was but I will definitely not be ordering it again.  Another reviewer said it tastes like KFC's Mac n cheese.  Here's the thing.  KFC is known for chicken not macaroni and cheese. This is not how they've made their macaroni and cheese when I've ordered it in the past.  Was too watery and the cheese and had a weird taste. No thank you on this dish.", "author": "L M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "I love this place.  The jerk chicken + rice n peas + greens combo with a side of mac and cheese is ... amazing.   I get this combo at least once a week, sometimes twice.  It is consistently a flavor explosion ... chicken falls of the bone, juicy yet crispy, with that potent jerk kick, greens so meaty, rice soaks up the flavor, the mac and cheese is rich and creamy with that nice brown crust.  I could go on .. but just thinking about it is making me hungry.", "author": "Philly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Amazing food.  We just had food catered to our office from Soul Spot and the food was so tasty, well seasoned and enjoyed by all our employees.  Thank you to the chef's for cooking such delicious food.  We had jerk chicken, corn bread, stewed okra, vegan gumbo and salad.  We had such  a great response that people invented OKRA Day so we can order again from Soul Spot.  Congratulations on serving amazing FOOD!!", "author": "sylvia n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Had them cater an office event and they blew us away. We ordered the veggie gumbo, stewed okra and tomato, cornbread, salad, and jerk chicken -- the entire office was crazy for it. Thanks for feeding the team and leaving them happy.", "author": "Gabrielle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-27", "description": "This spot came highly recommended from a person who is from Brooklyn.  Looking back on it, coming from South Carolina to Brooklyn for soul food wasn't the best idea when there are other options of things that I couldn't get back home.  Well on to the food.  I ordered the macaroni and cheese with collard greens and bbq chicken.  The macaroni wasn't baked but it wasn't bad .   The greens wasn't seasoned with meat, and just tasted peppery and the bbq chicken just needed a little more seasoning.  The fruit punch though was excellent!!! They got close to actual soul food but I will continue to eat that down south.  If I lived here and was away for a while, this would satisfy the craving though.", "author": "Clifford D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-23", "description": "Terrible service/mediocre food...tried to order over the phone, they said they wouldn't deliver to my friends place in Brooklyn, just a couple blocks away (where they had delivered many times before). It was a cold night and they didn't want to go out to deliver! My friends had raved about the food, so I decided to try to order through Yelp and see if that would get them to deliver (the threat of a bad online review usually will work). We'll they delivered, but the food was mediocre, at best. I ordered the oxtail and only had TWO pieces of oxtail and hardly any sauce (when I asked for extra sauce) for over $15. The rice and peas had no flavor and the collards were below average. One of the lamest restaurants I've ever ordered from.", "author": "Kenny R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "They have a $10 card minimum which is really inconveniencing given their cheap pricing! I don't want them to raise prices but yikes, lower the minimum plz.\n\nThe food is good enough for the area, there doesn't seem to be much \"soul\" left in this part of BK, so if you live or work nearby then try The Soul Spot if you're looking for tasty soul food.\n\nHowever, this isn't a place I wouldn't recommend going out of my way for. BUT if you're nearby, hungry and have cash -- stop by.", "author": "Malik D."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}