{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-21", "description": "First of all, the prices advertised on their website and on the actual in store menu are very very deceiving. Well... just plain wrong. They only list the \"lunch special\" prices with a small footnote at the bottom that prices may be higher. But by any standard, $32 for 2 meals is high for such a so-called affordable 'down home' store. My friend and i almost cancelled our orders but we were hungry. Very deceptive and IMHO just plain false advertising. We experienced the same smirk another reviewer spoke of when we questioned the price discrepancy. \n\nAs for the food... i had the jerk chicken w mac \u0026 cheese and yams. My friend had jerk chicken w rice and peas and yams.  i dont know what the other reviewers are talking about. I can only assume that these ppl have never experienced real soulfood. So i guess anything would wow them. Mac and cheese tastes premade and the chicken.. my GOD talk about dry. Yams were the only decent thing. My friend also complained that the rice was dry and under seasoned. Oh, ans BOTH dishes were cold!! \n\nStay far away from this spot. If u do go, be sure to bring an attorney to decipher the real prices on the menu.", "author": "Justice O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-07", "description": "Best soul food in Brooklyn.  Always fresh.  Amazing collards.", "author": "Hilton C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-03", "description": "It was a sunday night and i decided i wanted Caribbean food came across this on yelp and decided to give it a try! For one the place is extra small with no ac so imagine the steam from our food and bodies so close together. But otherwise I ordered oxtails, mac n cheese and collard greens. mac and cheese were bland i cud do better, collard greens were nothing special HOWEVER, the oxtails were delicious and that's the only reason I gave 2 stars.", "author": "Bibi L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-14", "description": "I got the vegetarian lunch special. It lets you choose 4 side dishes. I chose the yams, collard greens, sauerkraut, and string beans, which were all delicious and didn't taste too greasy. And, it came with delicious corn bread.", "author": "Yael R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-28", "description": "I had to give it a 5 because Im such a customer service person and they had a wonderful wonderful staff but to have great food to go with it deserves a 5!!!!!!!!!!!!!!!! I went on a 25 dollar groupon and was treated like anyone else...I had the salmon rice and peas mac and cheese okra whiting/shrimp for my daughter EVERYthing was great but they forgot my collard greens:(   and my daughter didnt love the shrimp but my food was delicious,,,,,,,,,will be going back:)", "author": "Latonya W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "Went there with a groupon. Got the jerk chicken with rice and peas and oxtail with rice n peas. Both were delicious. I have to say the food is great, but the price is a bit on the high side. Maybe because of the location. But overall it was a great experience. I will prob go back for some more soon. Hope they have another groupon deal.", "author": "Monir I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-24", "description": "I was looking on line for a place to eat on my lunch break and I came across this restaurant. I saw mix of good and bad reviews but thought I should try for myself. I had the taste for shrimp and I looked at the menu and saw they had fried shrimp (8pcs) w/ 2 sides and cornbread for $11.99 (13.50 for dinner). I thought it was expensive because you can get a plate of meat/ fish/ shrimp w/ 2 sides for less than $10 around the way but this is downtown BK so I really can't be upset. When I got there I noticed that the place was very small but it's mostly a take out spot and it looks clean so that's all that really matters. The guy who took my order was very welcoming, but the young lady who rang up the orders wasn't at all. Well anyway......\n\nThis was one of the worse \"soul food\" places I ever ate from! When I looked at all the other stuff they had there it looked so unappealing. The meat looked dry, the vegetables sides were canned and/or frozen and the desserts were boxed cakes and premade store bought. I like my soul food fresh from scratch cause that's what I was raised on and if they gonna charge people all this money for a plate of food then it should be made from scratch. As for my shrimp with macaroni \u0026 cheese and cabbage plate, I don't know what kind of  flour they used for the shrimp but it was too thick and you could barely taste the shrimp. I hate places that make it seem like the shrimp is big but it's actually nothing but batter. The macaroni and cheese was NASTY! The macaroni was cooked way too long and was very soft.  The cheese they used for it was cheap; it's the kind of cheese that when it's melted it becomes very oily and \"gritty\". It also had no flavor and just plan nasty. As for the cabbage, like I mentioned before it's canned, boiled and season with salt and pepper. The cornbread was just oily and nasty. And to top it all off their take out \"plates\" are actually the small plastic round bowls with the clear lids that the Chinese restaurants give you when you order shrimp and broccoli .....yup for $12- 15 (depending on what time you order). They squeezed that entire order in that small bowl so now my food is all mixed together!\nMy food was just plan nasty and I'm extremely upset that I paid $11.99 for this, well actually 13.49 because of the tax and extra take out bowl......yes the nerve to charge extra for the bowl. They should use foam take out trays like every other establishment because it's cheaper and has more space for food.\n\nI don't know how this place got high reviews. Maybe because this is the only soul food spot in the area or maybe because people don't know what real soul food taste like. Regardless I will never come back to this place again, even if one of my co workers treated.", "author": "T.K. P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-17", "description": "As a Southern girl, I can truly tell you I love Caribbean Cookin..This place has the best Baked Chicken-- kind of mixed with southern and caribbean seasons.. just AWESOME. The Salmon is on the money and of course the Fried Chicken...The Collard greens could be better, i did not have the Mac n Cheeese, but heard it was delicious...Lol.... Love you Soul Spot... yes i will keep comin back...", "author": "Ginni L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-07", "description": "Went in and got the food to go. We ordered the salmon w/ Mac and cheese and yams \u0026 BBQ chicken with rice and sweet corn. I found the salmon to be a little fishy and the yams way too sweet. The chicken had good flavor but was dry. The rice and corn were okay. The best part was the Mac and cheese which was awesome. Terrible and bland cornbread. Was okay overall but won't be ordering again.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-01", "description": "Warning...The people who compliment this restaurant were paid. I am big on service the young lady behind the counter didnt seem interested in making me feel welcomed for spending money on sub-standard  unhealthy cuisine. prices for 3 items was $14 far too expensive for a  portion that i normally spend 8 dollars for  just a few blocks away. If it wasn't decorated like a pre school cafeteria I may have paid for the ambiance, but this spot is Bull Sh*t.  I think the owner thinks people are too ignorant to realized they are getting robbed.", "author": "Tiesha T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "My vegan sister and I stopped in here for a light lunch and had the best vegetarian lunch special. The cooked veggie plate warmed us up from the cold weather and tasted delicious! I love this cozy, Brooklyn gem. I would definitely stop in again.", "author": "Allison C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-07", "description": "Actually, I like the food here. It's cheap and the chicken with dumplings is good.\n\nBut, it's another wonderful location from which I have gotten food poisoning. Albeit more minor than Fountain Cafe up the road.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "This is definitely a take-out not eat-in place. I walk past this place everyday and it kind of looks like a small cafeteria. I wouldn't sit down to eat in here, but man is this food DELICIOUS. It can't possibly be healthy, so I don't eat it very often, but once in a while, its a fun treat. My good friend Valerie V. and I ordered from here just last week and, as usual, it did not disappoint. We got the baked chicken, fried plantains, mashed potatoes, mac \u0026 cheese and, of course, corn bread for both of us. The portions are large (heavy containers for sure) and the prices are decent (meat plus 2 sides and cornbread or roll for around $12- go with corn bread!). I had leftovers for the next day and it was just as delicious then. I highly recommend ordering in from here on a cold day when you feel the need for a hearty and delicious, if somewhat grease-tastic, meal.", "author": "Natalia O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-16", "description": "I was highly disappointed in this place.\n\nWhy?\n\nBecause after months of searching for some delicious and real (made by actual Jamaicans) home style Jamaican food, I finally found this place. It was close, they delivered, and it was small and neat inside. I grabbed a menu to bring home, and later that night I tried to place an order for Brown Stew Chicken, rice and peas, and collard greens. They had no more Stewed Chicken they said, only Jerk Chicken so I decided to wait for another day. 3 days later  I am waiting for the bus in front of this place and decided to pop in, it was 1pm. No more Stewed Chicken, Only Jerk or baked. So now I was annoyed thinking it must be great since they always run out. After about 10 more attempts. Yes 10! I decided their menu is a lie and they never even cook half the stuff on it, because they never had it, no matter what time of day I went in there or called. \n\nNot a good way to do business, so while I no longer live in Flatbush I still have to travel miles there to get some good Jamaican food. \n\nThe menu here LOOKS and SOUNDS wonderful, they even have white meat only options, too bad they never actually have any when you want to order it.", "author": "Juicy K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-22", "description": "I am only reviewing the mac \u0026 cheese as that's all I got.  \n\nI was really excited to get some good old soul mac \u0026 cheese.  Unfortunately, i got cheap, fake, cheesy mush.  You can't expect too much from pre-made pasta... but I was still underwhelmed by the quality.  Too much pepper, too little \"real\" cheese, and completely absent \"delicious crumblies\" that I love as a topping.  \n\nOne star plus for inexpensive. \n\nBasically, just keep walking...", "author": "Mike P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-30", "description": "Sh** !@#*^$% (*$# NO NO NO NO\nRun for your life people. \nI'll stay home hungry next time, at least I'll lose 2 pounds.\nThe cashier/or whatever that woman was rude as @$@$%$.\nFood is dry and yakkkk yakkk pou pou pou.\n I was thirsty and hungry and went there since it's near my dance studio, but whew , mediocre\n\nReviewed by Daiana Noel", "author": "Daiana N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-20", "description": "SouLESS spot.  With all the great places to eat in the neighborhood, including Smoke Joint, Fosters, Ruthie's... I'm Shocked this place is still in business.  The potato salad looks like baby food, you'd be lucky to fish out a nugget of starch in this soupy yellow mess.  Candied yams, the same... Whiting were like flat, dry chips of something Maybe once from the sea... and if you've ever had beef ribs before, DON'T order them here b/c you'll truly be disappointed- they are Rib Tips with maybe a chewable morsel of actual meat per order -Total.  Flavor? sure, there's potential... if it didn't feel like last night's leftovers.  Skip this joint. Take a walk to the Smoke Joint or Fosters where the food is authentic and the service is down home goodness.", "author": "Nancy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-26", "description": "Heard about this place from menu pages and decided to check it out while visiting a friend in beloved Brooklyn. I'll say we had a difficult time deciding what we wanted to order because everything looked so delicious. I decided to get the jerk chicken, candied yams and collard greens. I also got the lemonade. I WAS NO DISAPPOINTED!! The collard greens were absolutely delicious, the jerk chicken was so tender and juicy and the candied yams were candied yams...nice and sweet. My friends got cabbage and ribs with candied yams. Cabbage was okay, tasted like steamed veggies and I'm not used to steamed cabbage with other veggies like carrots. My other friend got the baked chicken which was tender and juicy with baked mac and cheese and candied yams. Baked mac was okay...not the best I've had. Overall, I was pleased and I'll definitely visit again.", "author": "Nina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-09", "description": "We order delivery from here at least every week.  My husband would eat it every day if I let him!  The staff is really friendly.  The food is delicious and filling.  I love the meatloaf and the chicken and dumplings.  The collard greens are perfect, potato salad is great, and the peach cobbler is flaky and delicious.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-07", "description": "I came here with my sister. We thought it was worth a try.  Well I guess not. First of all the food was not that great. The chicken i had was so dry I kept choking. The collard greens had no flavor. The one thing that was good was the barbeque chicken. it was ok but I had way better. Second, The employees there are so rude. I felt that they were racist. Me and my sister was getting so much attitude  from all the employees there. We're spanish. They Was treating all the african americans more kind and with more respect. My sister asked one of the employees a simple question and she basically yelled in my sisters face. and this employee turned around to help another table and was way more nice. Idk maybe they are racist. But we did nothing wrong for them to treat us so horrible.", "author": "Jeovan A."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}