{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "I love this place! I got the barbecue ribs and they were amazing! Nothing like good ribs smothered in barbecue sauce. The meat was very tender too. Also tried their fried chicken and that was great too. My friend got the jerk chicken and greens and said they tasted great too. Customer service was nice and sweet. And everything is halal. Hard to find a soul food place that's halal.", "author": "Sayeeda A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-30", "description": "I was wandering Atlantic Avenue and in the mood for some Caribbean food, so I came here and had the jerk chicken. It was not bad and it was a generous portion. However, it was a little inconsistent. Some of the chicken I ate was soft and moist, but some of it was tough and overcooked. Also, this is a small cramped place and is more suited for a quick lunch or takeout.", "author": "Tyler L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "Pretty damn good.     I had chicken and dumplings lunch with collared greens and some veggies.    With 2 water bottles. Came out to $12.   It changed my day", "author": "J J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "Oxtail is AMAZING! I was in heaven after my first bite. So tender and one of the best meals I've had in New York! Also got the collard greens and yams which were also super delicious! And they give you SO much food for the price. The staff is also super friendly and you can get 10% off with the yelp check-in. Try it- you won't be disappointed!!!!!", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-14", "description": "You're going to want this place to be good but it'll just let you down. I've ordered for delivery twice from them to only have them call me back both times saying what I'd ordered wasn't available. Both times they went ahead and charged me so of course the bank takes a few days to put the money back. High hopes + no execution to judge on + no execution because of incompetence + at least they called = 1 star. \n\nThe lady who called me about my order tonight was super nice, though! Anyhow, who runs out of chicken at 7pm?", "author": "Allan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-25", "description": "I've eaten here a few times in the past initially because it was hard to find halal soul food close by and because the food was good. But during my last few visits I was really disappointed with the food. I usually get fried chicken or salmon with potatoes and a veg. \n\nI've ordered the fried chicken at least 3 times and every time I noticed that underneath the skin the meat had not been cleaned properly, there were thick blood vessels and something of a grey pasty texture on the meat. This is something that another Yelper has mentioned too. It's really not that hard to clean chicken properly before cooking, and for the price which is usually around $10-12 per meal it's really not worth paying. \n\nI was put off by this factor alone and haven't visited in the past 2 months unfortunately! The food is flavoursome and the potatoes are amazing so Dear management please fix this issue! You have a lot going for you!", "author": "Sarah A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "Pros:\n\n~ Curry Goat - there have been weekends where I have woken up with a strong craving for their curry goat. Better than the curry goat I had while in Jamaica, imo.\n\n~Plantains - completely acceptable platanos.\n\n~Okra - ZOMG AWESOME\n\n~Oxtail - pretty good :-)\n\n\nCons:\n\n~Corn bread - I keep getting dry corn bread. Maybe it's bad luck\n\n~The fact that getting curry goat is completely hit and miss. \n\n~Service is kinda slow. It took almost half an hour to serve 4 customers. And this place is buffet style ... it's not like they were cooking the items fresh for each customer.\n\n~They ask that you order from the menu, but half the stuff on the menu are not available any given day. Would really really really be awesome if they had a CHALKBOARD with what the available items are for the day. As much as I liked the oxtail, what I really wanted was the goat.\n\n~They don't accept the yelp coupon anymore.\n\nI'm still a fan, and I will probably come back many times more ... but there is definitely lots of room for improvement.", "author": "Sharmeen I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "This place is the absolute truth. The mac and cheese, fried chicken, collard greens, jerk chicken, catfish...everything is good. I had my wedding catered by them and the owner was professional. The food came on time and the guests raved about the food. They couldn't stop talking about it! Every time I go there, I leave with a smile on my face and stomach.", "author": "Jay C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Dont come here if you are on a diet, but if you want some seriously good soul food, you have found it!!!\nI cant comment on the fried chicken because I've never tried it. \nBut their meatloaf is truly the best I have ever had! And I have had lots and lots of meatloaf. Their candied yams are to die for as are the mashed potatoes.\nI am hoping to try their stuffing soon, as I am sure its as good as everything else. \n\nIts obviously not an amazing cloth napkin place, its more of a take out place. I'm sort of surprised with people's comments about going into the place and not having wonderful service. Its just really amazing food with great low prices and not much ambiance. Its not trying to be anything more than that! \n\nI would def recommend this place to anyone who like good food.", "author": "Christina R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-20", "description": "I'm from Memphis and, therefore, I am picky about Southern food. \nI would say that Soul Spot does a great jerk chicken, a decent fried chicken (good flavor and NOT good texture...not enough crisp) - good sides, but completely mediocre cornbread. At least go a notch about Jiffy. \nThe take-out menu is wrong in price and the delivery service is lacking. I saw the delivery guy pass my place twice going in two different directions. He arrived without a pen for me to sign my bill. \nC'mon. \nI asked what dessert was good and was told the yellow cake with chocolate frosting. It's Duncan Hines at best and was dry.", "author": "Melody M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "Alhumdulillah tried it out today,\n\nWas very glad I did. The BBQ ribs were delicious as were the mashed potatoes and Mac n cheese. InshaAllah will be going back there and recommending it to others.\n\nSmall place but delicious food and good portions.", "author": "Abu S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-04", "description": "Maybe I'm biased because I have a grandmother straight from South Carolina who knows exactly what soul food should taste like, but this was not soul food. \n\nThe fried chicken was not very good at all. It was obvious that the chicken hadn't been cleaned very well if at all. The rice and Mac and cheese weren't that bad though. I also paid extra for all white meat chicken and still received a leg and short thigh, which obviously aren't white meat pieces. The delivery man was less than personable, to say the least. He actually had the nerve to demand another dollar in tip from me. He even pointed out to me where I paid a tip online and he says to me \"You need to give me another dollar\". When I told him I wouldn't he rudely shoved my food at me and stormed off. \n\nAnyway, I wasn't impressed with the food or the service and I most likely will never order again. I'm pretty disappointed because of the good reviews on yelp.", "author": "Queen M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-11", "description": "Souuuuuuuuuuuuuuul Fooooood! \n\nGrabbed a \"2 chicken combo\" with a couple pieces of fried chicken and some chicken \u0026 dumplins.  Side of collards and mac n cheese with a piece of conebread.  \n\nGood and tasty, definitely a great price to portion ratio! Service was ok, but the grub truly satisfied my soul food needs! Itsa solid 3 star spot, see what happens next time i hit em up, maybe bump em up or down a star...", "author": "Seven T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-10", "description": "Well well well, where to start. \n\nFirst and foremost -- here's hope you didn't make the same mistake as my Girlfriend and I and order pickup or delivery. Why?\n\n1.) The order will go through without a hitch, whether or not they actually have what you ordered. Don't worry, though, you'll find out after it's too late. They won't bother to call you to let you know know, though.\n\n2.) The descriptions are colorfully fictional. \"Steamed Vegetables\" is a creative way to describe an inedible mash of peas and onion slices soaked in a cup of low-quality melted butter. No, really.\n\n3.) In case you can't tell from the pictures, everything is soaked is low-quality oil/butter. Did I say soaked? I meant BATHED. I ordered a plate of white meat chicken, yams, collared greens. 1 plate, 1 CUP of oil poured off of the plate -- and that's not an exaggeration or hyperbole, it wasn't watery-oily mix, it was just plain melted oil/butter.\n\n4.) In case you order something the staff doesn't think is right for you, they'll go ahead and change it -- even if you pay extra! Pay extra for all white meat chicken? It's cool, the staff thinks a mish-mash of oil-soaked dark meat and soggy chicken skin is an obvious improvement, so that's what you'll get.\n\nOh and don't bother getting the staff to pay attention to you while you're trying to order or pick something up. Since their being entertained at work is a much bigger priority than actually doing their jobs, you get to overhear their conversation for 10 minutes as your food gets colder and all the awful oil and fat congeals into a mess. \n\nEnjoy!", "author": "Dan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-01", "description": "I bought a Groupon for this and decided it to try it yesterday. I bought a plate of fried chicken with rice n peas and collard greens (The chicken was ok, the rice a bit tough and the collard greens had no real flavor other than a dash of salt). I also bought a plate of oxtails, stuffing n mac n cheese ( the oxtails were delicious, the stuffing was way too sweet and the mac n cheese was nothing to brag about, just ok). If I didn't use my groupon i would have paid way too much for this meal.", "author": "Frankie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-24", "description": "Wow - I've seen some tough reviews of this place, so I'm here to jump in and say, I'm a fan right from the start!\n\nThe jerk chicken was flavorful and tender, mash was well textured, and the mashed sweet potato reminded me of the flavors of Thanksgiving. What really blew my mind was the okra veggie side - I have never tasted okra that I have liked (restaurant and my own attempts), but this had a nice tomato flavor.\n\nOne thing I appreciate is that they offer soul food, Carribean food as well as conventional American items such as wings and sliders. The staff is friendly, and the place itself is nice and bright - a good spot for a casual lunch for 1-4 people.\n\nI admit, I've grown up in New York, so I may not be a soul food expert (beef patties as a kid doesn't count for much)! But I liked what I had, and I plan to get take out from them in the future.", "author": "Annalisa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "Teeny and pricey but sometimes tasty!\n\nThe place is small, maybe 16 people could sit there comfortably.  The food is OK, but there is better for the price.  The entrees are hit or miss depending on what you order.  Out of the way, so only if you are in the area and definitely no parking during the weekdays.", "author": "Brandon D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "Went there for a quick bite on our way to the market. Ordered rice, string beans and Oxtail. The flavor was great, just enough spices. Looking forward to trying other items.", "author": "matthew c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-21", "description": "Got delivery from Soul Spot the other night.\n\nI ordered the Whiting \u0026 fries and my girlfriend got the fried chicken platter with rice \u0026 blackeyed peas and sting beans.\n\nThe sides were better than the chicken \u0026 fish, but all in all, it was still decent grub for a pretty affordable price.\n\nDelivery was super-fast, but they way things were packaged, my fries were as soggy as a rainy day. I got out a baking sheet, fired up the oven to 400F and put the fries in for 7 minutes and they came back to life.\n\nWe got a piece of the strawberry cake for dessert. It wasn't good and we didn't come close to finishing it.\n\nA passable option for carryout/delivery in Boerum Hill. Nice people working here as well.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-29", "description": "You know, I'm a fan of soul food. I really am. I can get down with some collard greens and there's nothing better than a slightly warm piece of corn bread with melted butter. Mmmm butter drool, but Soul Spot seriously disappointed me last night. I've eaten here once before and wasn't overwhelmed with the food but now that I've eaten from here twice, I have to say I'm mildly disappointed.\n\nWe ordered two dinner combos via grub hub. They didn't have the macaroni salad we wanted so we got mac and cheese. Danny ordered yams, and they sent mashed potatoes. Mess up number two. AND, they forgot our cornbread. The one piece of the meal we were looked the most forward to. In addition to that the food is FULL of salt and after a few bites all tasted the same. Lastly, the delivery took about 90 minutes. \n\nMeh, pass,they need to revisit their recipes. The food just wasn't worth the wait.", "author": "Valerie V."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}