{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-01", "description": "REVIEW FOR DELIVERY \n\nI ordered the meatloaf; mash potatoes; and lemonade. Everything was horrible, I took two bites and threw it out. The lemonade had no ice and was warm.", "author": "Vernice R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "Excellent food (jerk chicken with mashed potatoes)! The iced tea was delicious too! Great service as well. Definitely a spot to come back to.", "author": "Anum K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-09", "description": "I've eaten from here multiple times in person and via delivery.  They always run out of food which is kind of comforting because you know they are making more however, when you order online, they often run out of food and they don't have a replacement.\n\nI ordered the jerk chicken online and they didn't have it so I asked them to cancel.  I got charged anyway and that has happened twice.\n\nI have also ordered over the phone and asked them to put gravy on the rice multiple times and they just don't do it.\n\nIn sum, I would say that you should go into the shop and not order on the phone or online because they won't follow directions.  The food (when available) is good, however.", "author": "Lola J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-20", "description": "Been coming since inception. The good thing is they allow you to \"taste\" whatever you think you're fancying, so if it looks good but isn't to your specifications, you don't have to invest. \nI've had Baked, Jerk, Fried \u0026 Bbq Chicken, Fried Whiting, Oxtails, Collards, Candied Yams, Black Eyed Peas, Mac and Cheese, Potato Salad \u0026 their Cornbread, which is moist. I usually get their Half \u0026 Half or Fruit Punch to wash.All are decent and worth a return trip if you want soul food and not in the mood to cook it yourself. \nIt's small inside and although I've eaten in, I prefer taking food home to relax. Another reliable spot.", "author": "JL K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-12", "description": "I have been going to Soul Spot for years. Mind you the food has always been consistently good, but the service has not always been good. I have tolerated the lackluster customer service, but after last night, I won't be ordering food there.\n\nI ordered food from Soul Spot online, but when I got my order, I was missing my potato salad and my cornbread.  First, the lady told me that she put everything in the bag. I told her no she did not. Then I mentioned that my cornbread wasn't there either. She said they ran out of cornbread. I then asked that why didn't she call me to let me know. Her response. \"I don't have to tell you that we ran out of food, especially when it's free.\" Free? When did cornbread become free? She argued with me a bit more, in fact started yelling, then hung up on me. No more Soul Spot for me.", "author": "Lorisa B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-01", "description": "Ordered for delivery: fried chicken was cold, dry and flavorless. Potato salad was soup. Cake was so old and dry it was like a biscuit. I complained, and the manager said I'd need to bring the food in to the restaurant for them to look at to get a refund. That's the level of class/quality we're talking about here.", "author": "jane b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-25", "description": "The food is good.  The space is small and meant fir very casual dining meaning, you order at the counter and grab one of he 10 available seats. I believe they deliver as well, but I have no experience with that. I've had the oxtails, rice and peas, Mac n' cheese, jerk chicken and collard greens. They have lots o other options to fit your craving. The dinner plates include 2 sides and range from $10- $13. Comfort food makes me feel happy and comforted.\n\nOne annoying point has been that their credit card machine has not worked during a few visits: pretty annoying if I must say myself.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "We randomly stumbled into this place after an epic fail of the NYC Lights Festival and I'm glad we did. Its not everyday you find a kosher soul food Caribbean spot, right? \n\nThe first thing we noticed was the heaping portions! We saw two people eating their meal at a 2 seater top and their entire table was full of big plates of food. \n\nI'm a sucker for collard greens so I was able to try that and I can say, I'm a fan. \n\nTheir meal specials are incredibly affordable and can even probably feed two ppl. If I'm ever in this neck of the woods again, i'm definitely going to stop by this place to indulge in some comfort food!", "author": "Esther K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "This food is fantastic! I ordered the fried chicken with macaroni and cheese and peas and rice. The chicken was seasoned great and full of flavor, the mac and cheese with peas and rice was just so tatsy. The server that made my order was also very friendly and smiled throughout the whole interaction. I will definitely be returning for some amazing soul food.", "author": "Sonia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-29", "description": "I've deducted a star from my initial review because I was told I had to print out my check in coupon to receive 10% off. That's just foolish...how on earth would I print out a coupon that comes from using your PHONE to check in? You guys need to read the guidelines of posting a Yelp Check In offer and get all your employees on the same page before doing so.\n\nOh yea...jerk chicken and rice and peas....pretty awesome.\n\nI'm still mad at that coupon situation though --_--", "author": "Kristian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "One of my two favorite places for soul food in Brooklyn!! Excellent food , every single time and their fruit punch and lemonade are bith yummy as well. They also have mouthwatering desserts if and when here available. I love the peach cobbler and sweet potato pie. I also love that they close so late compared to most take out restaurants. The only drawback is its super small inside, so not ideal for dining in. I've been a customer for over 10 years and that will continue as long as they're in business.", "author": "Tati R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "A go-to spot for me! Awesome food and great value. Amazing jerk chicken that falls off the bone. I am a fan of the curry goat and corn bread too. Portion size is huge. \n\nThe restaurant is small and meant for quick service but that's more than reflected in the price.", "author": "Namir C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-17", "description": "Maybe it's because I'm always drunk when I order, but the fried chicken...with mac and cheese...is AH_MAZ_ONG!\n\nWhen I order right at closing, they're usually happy to whip me up whatever is around and bring it to me.  The recognize that number on the caller ID#.", "author": "Kelly T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-17", "description": "Poor delivery service. Always very late. \nFood is good. \nGreat meatloaf and fried chick.\nAgain- late delivery always!!", "author": "Betty O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-01", "description": "So me and my coworkers order food from here and we didn't enjoy the food. The food wasn't cook proper and On top of that they got all our orders wrong.We won't order from here again. Bad service!", "author": "Ide I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-13", "description": "Meh. It wasn't anything exceptional. I was really excited to go, knowing it was halal and soul food. I went, I ordered, I probably won't be craving it later because, again, it was just meh. It was forgettable. I got the mac \u0026 cheese, rice, and jerk chicken.", "author": "R V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "As usual with Yelp, you shouldn't really trust the reviews too much, especially when they are oversaturated with entitled complainers who barely even talk about the food. But this is a great little neighborhood soul food/Caribbean joint where you can get fast, tasty food at a decent price point. Their oxtails and cornbread are wonderful. That's all you need to know.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-01", "description": "It's a small, warm place that isn't hard to miss but they have pretty good soul food from what I know.\n\nI've tried their fried chicken, smothered chicken, bbq chicken, mac and cheese, yams, sweet corn, mash potatoes, corn bread, and their lemonade and I thought they were all pretty good but it could be better.\n\nI would come back and eat here.. Only if I was walking and it was literally in front of me.. (which isn't often)", "author": "Naty M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-23", "description": "The soul spot is tasty.  I came in with a group of friends.  Man, the portions here are huge.  Good for two meals.  My best friend who says Olive Garden has small portions thought these meals were more than abundant.  They are known for their beef ribs, oxtail, jerk chicken, curry chicken, and other delicious meat items.  They are Halal and also serve vegetarian options.  I saw collard greens, mac \u0026 cheese, rice and beans, and plaintains.  Each meal comes with a bread or roll.  My order of beef ribs came out to $13 and change.  It is on Atlantic Avenue between Smith and Hoyt.  There are about four tables and maybe sixteen seats?  Most people grab their food to go.  The downside: They no longer accept Yelp discount when you check in.  They also do not have a public bathroom.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "This is my favorite restaurant. Everything is delicious. My favorite is the chicken and dumplings. I've never had a bad experience here. Giant portions, great price, nice staff. Everything is delicious and slow-cooked to perfection. It is a really small place, so beware when coming with big groups. But definitely try this place!", "author": "Sunia C."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}