{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-20", "description": "This place is consistently very late in delivering its orders. I have waited over an hour to have food that is already prepared delivered 7 blocks. To pour salt in the wound, when I called to check on the status of my order they told me the same lie that the delivery person was just a block away; even after calling every 10 minutes for an hour. This place is not worth waiting for. Or being lied to.", "author": "Elena C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-10", "description": "Great food comparable to Soul Fixins in Manhattan.  My plate, loaded high with creamy mashed potatoes, runny mac and cheese, bbq chicken, and warm cornbread, plus a drink, was under $10.  It's a tiny storefront with nothing much to look at, other than multiple kudos from various NY magazines.  Comfort food at its comfiest.", "author": "L C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-24", "description": "It's a savory stop if you're passing by and unsure where else to go, and I can't say the food was bad, but it's far from detour-worthy.  The bbq chicken fell nicely off the bone and the yams, as someone mentioned, were pretty succulent.  The portions were smaller than, say, Golden Krust, but still pretty filling bc it's so rich.  I probably commited a strategic error ordering the $7.50 lunch \"special\" (chicken + 1 side) when the $8.50 \"lunch entree\" would've scored me 2 sides -- crap.  They also forgot to give me cornbread.  The Soul Spot isn't terrible, but I don't think I'm likely to go outta my way for their just-ok lunch specials very often. (2.5 stars)", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-12", "description": "Finally Southern food and not poor imitation! While I will admit that it's not five star quality...it's good to eat the food that I have missed since moving here from the South. The fried chicken comes with crispy skin (yummy) the mashed potatoes are perfectly seasoned and the corn bread is moist with a hint of sweetness. I have had the potato salad which I thought had a little to much mustard but my bf loved it. It's one of my new places to go.", "author": "Stephanie K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-11", "description": "Ignored the reviews and tried it because it's a critics pick in NY Mag. Huge mistake. Wound up with severe FOOD POISONING.", "author": "Bucky L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-27", "description": "While at work, I got a hankering for some soul food.  I've walked past this place several times on the way to my car.  After conferring with my colleagues, we decided to order Soul Spot for pickup.  I went online to their website to check out the menu.  The lunch combo was listed at $6.99 which was pretty reasonable.  I noticed at the very bottom of the page there was a disclaimer which states \"Prices subject to change without notice\".  I facetiously joked that the price will be higher once we got there.  Everyone ordered the bbq chicken with baked macaroni and corn bread except for one of us that ordered the baked chicken with fried plantain and corn bread.  I walked over to pick up the food and they told me the cost will be $47.  Last time I checked 7 x 5 = 35.  Include tax and its $40 max.  When I pointed out the 6.99 price point, their response was \"oh, we haven't updated the website in a while.\"  Had this been phrased differently minus the grin, I would not have minded.  I paid the extra money, thinking about how good the food was going to be (another mistake on my part).  I made it back to my office and sit down to distribute everyone's order.  The chicken looked like someone had boiled it, then baked it, then covered it in a red sauce that was supposed to be bbq.  The \"baked macaroni\" looked like store brand mac and cheese with a can of cheese sauce thrown in for good measure.  The corn bread was dry and crumbly.  The worst I've ever had.  They even screwed up the baked chicken with plantain.  The baked chicken was the same faux bbq as the others and the fried plantain was oily and not fully ripe.  They all had a hard center and were not even remotely sweet.  I tried dumping the \"pepper sauce\" they provided on everything to make it edible.  While that worked (barely), it was only because the \"pepper sauce\" was more vinegar and salt than pepper.  Needless to say I will never order from here again.", "author": "Bernard M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-16", "description": "Hits the spot.  Incredible hot sauces, highly recommend the okra and tomato side dish!   Everything was fantastic.  Can't wait to go back next time I'm in Brooklyn.\n\nThe friendly service makes it feel cozy and the food was authentic as it gets.", "author": "Catherine N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-05", "description": "I was looking forward to eating at Soul Spot Restaurant.  My brother and his girlfriend came in from outer town and I took them to Soul Spot.  Big Mistake.  I had the Oxtails, corn and sweet potatoes with corn bread for myself I ordered Fried Chicken with Mac \u0026 Cheese and Sweet Potatoes \u0026 corn bread to go for my son and my brother had the Oxtails, Greens and Rice with cornbread I also order Peach Cobbler for 2 to go.  Oxtails, Fried Chicken and Sweet Potatoes were OK the rest was a complete waste of time and money.  Peach Cobbler is not suppose to be made in a pasty WTH!.  I do not believe I will return.", "author": "Iaskew S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "Peach cobbler was some of the best I've ever had! Didn't have anything else. Employees behind the counter were kinda friendly.", "author": "Baby G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-13", "description": "I first came across \"The Soul Spot\" when me \u0026 \" my Steve\" were itching for a home cooked meal. It was our first easter here \u0026 we don't have any family here to get any soul food fixings. We came across this place \u0026 it hit the spot. The spot is not much to look at but it will mos def do the job. Try either the oxtails  or jerk chicken w/ collard greens, mac \u0026 cheese or sweet potatoes. Those are my favs. Now when I get that itch, I head to \"The Soul Spot!\"", "author": "Chereen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-25", "description": "We've wanted to try this place for a while but didn't have the nerve.  Finally ordered delivery tonight and we're so glad we did!  We ordered the fried catfish with collard greens and potato salad and the jerk chicken with macaroni \u0026 cheese and collards.  As a southern girl, I can vouch for good collards and this place has them!  They were perfectly cooked with a little bitterness that was just right.  Ordering anything fried for delivery is risky, but my catfish (three fillets!) were crispy and tender.  The portion of potato salad was huge and zesty with mustard and pepper.  Delicious!  I didn't get a taste of the jerk chicken or macaroni \u0026cheese but judging from the empty take out container and satisfied grin on the face of my dining companion I think it's safe to say it was great too.  Can't wait to try more!", "author": "May F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-16", "description": "You won't get gracious service with a smile, but you will get efficiently served delicious and tasty food.  I have frequented this \"spot\" a number of times and it has never let me down when I've been jonsing for some soul food.", "author": "Kim D."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}