{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Excellent oxtails, baked chicken and macaroni-n-cheese. All the food is pretty good. Best food around. Me and my wife always eat here when we're in the area.", "author": "Gavin J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Yes this place is Halal! And so good ! Never tasted Caribbean food , it was really good. I ordered Jerk Chicken with Rice and sweet corns. It's like 2 side orders comes with your main order along with a free corn bread. They are super sweet! I will come here again ! Forgot to take picture of the food because I was soo hungry", "author": "Saima R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Curry goat, oxtail stew, peas and rice, okra, collard greens and yams all excellent. Try it!", "author": "Robert. B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Good stuff! The oxtails are a must. I make excuses to go to Brooklyn for The Soul Spot and I bring home a to go plate with a few extra pieces of corn bread. And the staff aren't impolite maybe you're just too sensitive.", "author": "RudyFoodie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "I'm not sure why I'd never stopped into The Soul Spot before. I mean, I've got soul.* \n\nMore importantly, I live just a few blocks away, and I really enjoy barbecue chicken, mac and cheese, jerk chicken, oxtail, fried chicken, mashed potatoes, honey chicken...basically, they make chicken in a lot of different ways, and they make it well. \n\nFor about $10 they will load you up with some good chicken and a couple of sides, and I'll guarantee it'll fill you up. I'm personally not a big collard greens fan, but they aren't half bad here, and I even like the steamed veggies even if it's mostly cabbage. \n\nIt can be a little on the greasy side overall, and they didn't have cornbread last time, but a meal here will hit the spot. \n\nThe Soul Spot. (See what I did there?)\n_____________\n\n*But I'm not a soldier, if you were wondering.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "This place will will truly satisfy your soul food cravings! Came here for Iftar after praying in the nearby mosque and couldn't be happier we did so!\n\nSo I tried the Jerk Chicken, which was moist and super delicious with the right amount of kick to it, meat falling off the bones mmmmmm!!! The mac and cheese which is definitely one of my favorites now and the rice and peas super delicious as well. I think I maybe a little obsessed with this place because its so good!!! I can't wait to go back!!! \n\nKeep in mind, its a hole in the wall place, not a date night spot but the food will surely win you over! Also, it's amazing that it's halal! Super plus if you are restricted to only halal food. Check this place out asap!!", "author": "Farhana S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-12", "description": "They never have what I order..\nBad customer service on the phone!!\nYelp should do a survey on the restaurants they cover to make sure the menus are up to date... \nNothing worse than placing an order and then 10min later having to be forced to make a change after you've already set your mind on your meal. A huge inconvenience..!!!  The food always tastes good but that's all this place has going for them...", "author": "Manson M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "absolutely freaking amazing service and delicious food served by beautiful smiles want authentic soul food with a jamaican twist on it!!! please come here! my partner and i traveled from downtown manhattan jus to eat here. most definitely a great call!!!", "author": "James H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-26", "description": "The girls that work here are like little mean girls. You can tell that they are either young in the mind or just young. Which says a lot coming from me because I am very young. From the moment I walked into the restaurant I was not greeted with words but I was stared at for about 5 minutes before someone said something to me. And instead of answering a question they laughed. I would not come here ever again. I didn't order anything because they made me feel so awkward so I can't speak too much about the food.", "author": "Jessica A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-13", "description": "Worse food ever!  Ribs are all bones, no meat. Chicken was soggy. They also forgot to include cornbread for the three dinners I ordered and they wouldn't re-deliver nor provide a refund for what they called a \"compliment\" item. Luckily I ordered through grub hub and grub hub gave me a credit.  But this place?  Food is low quality and service speaks for itself. Will never order from them again.  Will be shocked if they stay in business.", "author": "J K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "Delicious. This is a no frills place, just simply delicious food!!! It's a small hole in the wall with a sign outside.", "author": "Win S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "Jerked chicken was great, falling off the bone and with just the right amount of heat! The okra and rice with black eyed peas were delicious and flavorful, and the portions were definitely generous - had leftovers for dinner! Yum, will be coming back!", "author": "Leila A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "This place is shockingly good!  My family ordered takeout (smothered turkey wings, oxtails, fried chicken) and the main courses were delicious!  Sides were just as great -- we tried the mashed potatoes (just the way grandma would have made them), peas and rice, mac \u0026 cheese (didn't look like much but tasted amazing), yams (so good!) and collard greens (best in town, not kidding).  The portions were generous and the young lady behind the counter was friendly and helpful and seemed to enjoy being there.  We finished the meal with a slice of coconut cake to split.  I thought it was going to be dry like so many before it, but nope -- moist and delicious.  No question we will be back!  Highly recommend.", "author": "Susan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "Small spot makes great soul food,very nice people,so far their lamb chops are my favorite along with their mac \u0026 cheese,but you pretty much can't loose when you order anything  from this place...of course I would eat here again and if I ever give a function I would definitely use them for my caters,that's if they cater food,I can only hope  they do...my mouth is watering just thinking about the next time I go there for food", "author": "Monique B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "Chose Soul Spot base on a drive by...lol\nI was w my friend and we were craving two different things. I called in my order while waiting on a red light to ask what was left since it was late on a busy weekday. Sure enough nothing was missing full delicious menu. My friend regretted choosing texmex across the street and tried to steal my fried chicken, potato salad and Mac and cheese. Soo good and comforting. Customer Service over the phone was great, food was hot and ready for pick up in minutes.", "author": "Jade K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-18", "description": "Stopped in to grab a quick bite to go. This establishment is very no frills but I thought the food was decent. My personal taste test for soul food branded resturants is to try their candied yams and mac and cheese. Both were pretty good. They were side options but the portion size was great for the price. Overall it was just ok...maybe if I'm in the area  I will try a full meal.", "author": "Kirkland G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-24", "description": "(Sigh) I am truly disappointed with the experience I had with The Soul Spot.\nA few months ago, lunch from this restaurant was purchased by a vender company and was quite enjoyable...  Pleased by the taste, my coworkers and I decided to order a catered lunch to serve 15-20 people. I contacted the restaurant on a Friday to inquire about the order for the upcoming Tuesday (if the notice was too short and of the prices). I was informed to place the order by Sunday. The order was placed, with no problem, for a half pan of the following items: jerk chicken, fried chicken, Mac n cheese, collard greens, corn bread and a few pieces of RED SNAPPER. I avoided the extra $30 delivery charge by picking up the food (we were about a mile away). The total for the lunch was $330+. I had also asked if the manager could throw in a few can sodas, if it wasn't a problem...(doesn't hurt in trying)...He agreed. \n\nThe food was picked up and after unpacking the items we realized that they did not include any plates..not even forks, knifes or napkins. Nor were the comp drinks included. I called the restaurant not even to complain about the drinks but just to inform them that for a catered lunch at that price, the least they could do was provide plates and utensils for future reference. The lady took my number and said that she would have the manager call me, as he was downstairs at the time. \n\nThe staff and I were so excited to finally be able to dig in! The first thing that threw us off was the sight of the cornbread. It was burnt!! Everyone proceeded to start eating, but the taste of food didn't give the same experience as the previous time. The corn bread was dry...Mac n cheese was very soupy and had a weird taste, the yams lacked flavor, the fish was extremely salty! Maybe change of chef? But at that point we decided to take the \"L\" and deal with what we had until....\n\n\"What's that in the collard greens?!?\" There was a barcode paper from the collards in the dish. Being already disappointed, I contacted the restaurant to express our displeasure to the manager. The lady who answered the phone again said that the manager was downstairs and unavailable. I asked her if he couldn't come upstairs because there were issues that needed to be discussed. She said he couldn't come to the phone and hung up. \n\nI called a third time and told her that I ordered the food for a well known organization in the area, where their poor service is currently being advertised and is an embarrassment. People are ready to write poor reviews, foreign objects are seen in the food and we are trying to give the restaurant a chance, but the way paying (cash at that) customers are being treated is just unacceptable. Suddenly, the manager Ya Ya became available. I explained our grievances and demanded that something should be done. He offered to replace the food...ummm no! Some sort of refund should be had. To make a longer story short, after much exchange ...he offered to reimburse $150. I told him I would arrive at 2pm to pick it up. He told me that I should bring back the remainder food. I told him that I am not walking that far with pans of remaining food. But he is free to come to the institution with our refund and he can receive the remaining food. \n\nHowever, it does not end there. One of the staff members realized that the order of \"red snapper\", that was placed in a foil pan marked \"red snapper\" was not red snapper at all!!! OMG!! I was so distracted by the events, I failed to realize! The fish given appeared to be porgy! Just deceitful! If the snapper was unavailable, I should have been contacted. We all felt jipped!\n\nMy coworker and I arrived to the restaurant to collect our money. I insisted on speaking to him about the additional fish issue. We were told that the manager was not there, but she contacted him by phone and was informed to give us the $150. We couldn't even express the snapper issue to him. Poor damage control on his part. The lady told me that I didn't have an appointment to meet with him and she's sure he apologized over the phone.  Smh. All in all. I've never had such an experience with any food establishment!! I'm highly disappointed and we will never support this place again!", "author": "Katima A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-15", "description": "Ordered from here a few days ago and my food was horrible it was like eating reheated leftovers I ordered rice with black eye peas and I got mushy rice with mixed vegetable that tasted like it came out of a can. I ordered rolls cause I hate corn bread and I got corn bread it was like they gave me what ever they had it wasn't even what I ordered. Never again.", "author": "Tina J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "The food here is really good. Think of it like a Caribbean, Soul, buffet almost. As long as you don't come to this restaurant thinking you're going to be engaging in fine dining, I think you'll enjoy it.\n\nThe food is great. Very rich flavors. All the meats are delicious, as are the rice, mac n cheese, etc. I recommend this spot if you're looking for a quick and delicious meal. They also load up your plate, so come hungry.", "author": "AJ J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "Yes, the food here is definitely great. I ordered the Seafood Combo with Catfish and Shrimps along with Mac n Cheese, Collard Greens. My co workers ordered BBQ Chicken and BBQ Ribs and this was our first time. We will be back. Next its the Curry Goat.. OMG the cornbread was really on point. You would have gotten 5 Stars accept it was a little small and it made me want more cornbread. lol.. Everything was seasoned perfectly. Delivery service was on time. Really don't have anything bad to say. Keep up the good work.", "author": "Jeanette W."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}