{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-11", "description": "Delivery review: \n\nTheir delivery time is reasonable. Usually under 45 minutes. \n\nOxtail dinner:\nNot that much meat, a lot of fat. That being said the meat that is there is delicious. It's just minimal.\n\nThe standouts were actually the side dishes. The okra and even the steamed mixed veggies were great! The texture and flavors were all there. I even ate the cornbread (I avoid bread) because it was so buttery and moist. I can tell their desserts would be heavenly...\n\nHowever. \n\nMy biggest gripe is that the oxtail, and two side dishes were just all dumped into one container. This means... All of the juices of the three foods melded together. It didn't necessarily taste bad, but it's hard to tell which flavors came from where. It was a bit off putting that they would decide to deliver it in this manner. \n\nTo the business owner: If you're going to deliver, please do your food justice and get an appropriate delivery container(s)!", "author": "Gina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "HALAL! I fee like they should emphasize that., this is one of those hole in the spots that you don't know about, but damn it's Good! I mean in my opinion Lamb was banging I love rice and there rice was good. Now they did run out of oxtail and jerk chicken so I'm assuming that's amazing too. Huge shout out to the staff for being kind too", "author": "Mumin U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Don't listen to the previous reviews!Ordered the oxtails, cornbread dressing, macaroni and cheese, greens, and smothered chicken. Every single item was absolutely delicious! The delivery arrived earlier than expected. Based on previous reviews I almost passed this place up. I will definitely order from them again.", "author": "Dehlia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Annually, The Soul Spot adds their famous oxtails to a YNTS PR event, and each time, attendees have to know where they can purchase the oxtails. I'm always happy to tell them that The Soul Spot has the best oxtails in Brooklyn.", "author": "Valon B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-16", "description": "I love soul food! We came here after a long day of painting. I like the location. It's easy to get to, parking isn't too difficult and it's a wide street to double park for pick up.\n\nFood - I got their southern fried chicken with mac and cheese, and rice. The chicken was pretty juicy but a bit too salty. Their mac and cheese is great and the rice was okay. I would stay away from their hot sauce. It's not really hot, its more of a sour and salty taste. My friends got oxtail with okra. The oxtail was cooked pretty well. The meat fell right of the bone and the okra was pretty delicious.\n\nService - A wee bit slow on a slow night.\n\nVerdict - Stay away from the hot sauce. It's a little bit pricey over here for just cafeteria style soul food. For 3 people, our total came out to 40 something bucks with no drinks. But if you're really craving for some soul food and happen to be in this area, it wouldn't hurt to stop by and give it a try.", "author": "Gary L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-22", "description": "Simple menu, well done. Food is pre-cooked and the server fills your plate with whatever combo you'd like. It's very heavy food, but tasty, and the chicken is fall off the bone tender. Each order gives you 2 pieces of chicken so I asked if I could get different flavored pieces. Server said no, which I thought was unnecessarily rigid. I mean, it's all already cooked and just sitting in a vat in front of you. Ah well. There are tables to sit at and a tv, but everything feels like it has a fine layer of sticky grease on it. Probably better to take the meal to go!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "I came in for lunch, and the girls were really polite and helpful as to which options were the tastiest.  The food was delicious!  I had the baked salmon, Mac n Cheese and collard greens.  I will be back!", "author": "Miechia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "The low Yelp rating is a surprise, but then it's a bit like reading a TripAdvisor where a hotel gets bashed for facets of the experience I may not care as much about, like the parking, the Wi-Fi and the free breakfast. In the case of The Soul Spot, some of the flaws involve remote ordering and coupons.\n\nAll of my previous trips involved the American side of the menu, usually fried chicken, but tonight I wanted to check out the West Indian offerings. Unfortunately they were out of curry chicken and curry goat. The jerk chicken was available, so I got with the old standbys of collard greens and mac and cheese.\n\nKurt A. got it right on the greens; tangy is the word. They had a lot of flavor even without apparent meat influences. And I disagree with the mac and cheese criticism here. It was a creamy delight and it seems unfair to blame them for not putting crumbs on top. The jerk chicken wasn't the traditional preparation but still had a good kick. I suppose in a perfect world there would be more chicken in the chicken - there were two pieces and not giant ones - but the sides were certainly massive so the overall amount of food was sufficient.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "The food here is amazing!!! There's so much flavor and you can really taste the love they put into their foods! I've had their oxtail multiple times and boy is it addicting!!! Their jerk chicken and fried chicken is nothing short but amazing as well. In addition, their cornbread is moist and tasty. I would highly recommend this restaurant to anyone. The best thing about this restaurant is that it's halal!", "author": "Prova S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-07", "description": "I've been here before for lunch and the food was pretty good, a decent amount, and not too overpriced, only a little bit. +4.5 stars for that. The cornbread I was given was pretty tiny and only three bites worth, so I couldn't quite start off with 5 stars.\n\nReturning for dinner, first thing is that they had a coupon for $1 off any meal but they apparently aren't offering it anymore. Okay fine, no problem.\n\nThe minimum for credit card use is $10 and I had a $15 order so I tried to use it but they said cash only. What? If you're going to make a customer go through the hassle of withdrawing and paying for ATM fees AFTER the order because they didn't bring enough cash, why not just put a sign that says \"Cash Only\" outside or raise the minimum to $20? -1 star. Fortunately I did just have enough cash on me.\n\nUpon asking for and receiving the receipt, I noticed a separate $0.40 charge for TAKE OUT TRAYS. WHO DOES THAT? -1 star. The worse part is they didn't even ask me if I wanted to eat there, they just assumed I was taking it out and then charged extra for that assumption. I actually was considering eating there as I missed lunch and was very hungry, and had I known they were going to charge extra for that, I definitely would've chosen to do so, but no one ever asked if I wanted to be charged extra to take out. \"Trays cost money,\" they said. I was wondering why my first lunch order cost more than it should have after tax, but I didn't ask for the receipt that time.\n\nNext thing you know, they'll start charging separately for fork and knives and napkins because those cost money too. That is not good business practice. A smart business would fold the price of trays into the order and increase the price on the menu by $0.50, but then they'd have to print out a new menu and menus cost money to print out.\n\nIn response to my standing up for bad business practices and ripping customers off, on my way out the door, the employee says to me, \"Don't come back,\" even though I never said I wasn't going to come back (but I did think it). -1.5 stars, because wtf, I was never mean or rude or disruptive, you don't say that to a courteous paying customer. 1 star is left. Even though the food was good, I won't be coming back especially after I was told not to, and I rescind all of my recommendations for this place.", "author": "Earl C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "Food was ... \"Meh\"\nHave ordered delivery from here and have never gotten an order right. Catfish is usually chewy and clearly left out \n\nService is terrible. At least once argued with the girl on the phone who insisted that I had Salmon (when it was clearly a white fish). Another time they told me they would be sending some missing sides but didn't.\n\nUnbelievably rude. \n\nSome good sides like their Mac and cheese. \n\nStay away.", "author": "Imran A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-10", "description": "I don't understand the low rating. I think the Soul Spot is amazing. \n\nIt's very casual which I love. Can't have a good time chowing down while waiters keep on bugging you, if you know what I mean. At the Soul Spot you just order, pay, and eat. \n\nI tried the Jerk Chicken with greens and mash potatoes. Everything on my plate was soooo good. I had zero complaint and wanted one more plate afterwards. Friendly service, too.", "author": "Carolyn H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Smells so good in here, my olfactory receptors were pleasantly stimulated as I walked in.  They have a lunch special that comes with an entree and two sides. I got the ox tail, rice \u0026 beans, \u0026 mac n cheese.  The portion was big and for $11.99, I was a very satisfied customer.  Not to mention that the server was very friendly and waited patiently for me as I was very indecisive with all the good selection they have.\n\nWhat can I say, the name says it all.  The Soul Spot is were you go if you want soul food.  Thanks to yelp, I got a 10% discount.  I showed the cashier who didn't seem to know what I was talking about when I showed her the deal.  In the end, she did honor the discount although she wasn't too friendly afterwards.", "author": "May M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Omg eating halal never felt soo good! I love this place!! I honestly don't know why so many people have rated this place so low. But anyways, I came here for an early dinner you could say during the weekday after going to the Brooklyn Botanical Gardens. My best friend had eaten at this place before and took me here so I could try out something different. Eating halal can be quite hard when you're tempted by all these cuisines living in NYC, and Turkish food and/or food from halal carts can get pretty tiring after a while. I ordered the two chicken special, I forget the exact name, but you order two types of chickens with two sides. I picked jerk chicken and baked chicken along with mashed potatoes and rice and peas. Also had iced tea as a drink which was okay, nothing special, and a complimentary corn bread which was kind of dry I'm not gonna lie. But aside from that.. My jerk chicken was A M A Z I N G. It was spicy and flavorful, I have never had jerk chicken like this in my life. I was completely blown away, and the sides were equally as delicious and flavorful. The baked chicken was succulent and amazing also. For about 13$, I was able to not only eat but take some home which was a plus in my book. I loved eating here, next time I might order an extra side and try the macaroni and cheese. I took some from my best friend and loved it too! Deff will be back!", "author": "Fariha K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "I'm so glad I was able to find parking. This was just what I was looking for. \n\nThe Jerk Chicken is as authentic as this (heavily Caribbean) Baychester, Bronx girl knows. Spicy, moist dark meat. Excellent. You know when it's home cooking because they aren't afraid to put spices in the food. Everything was well seasoned. \nI wanted to try their collards, but the way they were minced wasn't calling to me at all. I ordered the green beans instead, and the mac \u0026 cheese. Thank you for taking the time to drain all the bean juice! Many places have the rest of your food swimming in green bean juice which isn't like the pot liquor from collards that you actually want to sop up with your corn bread. The mac \u0026 cheese was dense (which is a good thing), cheesy and had lots of black pepper. Just like you get in your Auntie's house. So good. \n\nThe cornbread was just okay. The fresh squeezed lemonade was perfect. \nThere was so much of a selection and so little room in my stomach. I need to make a point to return.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "I've been coming to this place since 2013. You can expect good down home cooking on most days, just make sure you get there early in the evening as they regularly run out of popular side dishes. One inparticular is the cornbread which, by the way, continues to decrease in size every year. Overall the food and the portion size is great and I highly recommend this restaurant to all hungry soul food lovers.", "author": "Honny B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-20", "description": "We had the Jerk Chicken with sides of plantain, macaroni and  okra. The jerk chicken wasn't authentic at all but the sides were delicious especially the okra. There is no table service and the place is quite small so get takeout from here. \n\nMy rating is 2.5 stars because I was very unimpressed with the jerk chicken which had no real flavor either.", "author": "Sadia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "I always get the same order and I've never had any complaints! Jerk chicken, and yams are a main staple for me", "author": "Daphney K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "It makes no sense for this place to have only three stars.  My experience has been outstanding.  \n\nI found The Soul Spot on Yelp while looking for a place to cater a luncheon I was planning.  After placing a catering order, I also returned for a personal meal.  I've been consistently impressed in both experiences. \n\nThe food is so good.  The jerk chicken is my favorite.  Perfectly seasoned, with just enough kick.  The fried chicken killed at the luncheon.  I didn't even have a chance to try it.  The honey chicken was also good, but I'm partial to spice, so I'd choose jerk every time.  \n\nEven better than the meat are the sides.  I have yet to have one that I don't like.  I love the greens.  With roots in the south, I'm used to pork in my greens, but knew not to expect that as The Soul Spot is Halal.  I thought some flavor would be lacking, but my expectations were exceeded.  I could seriously eat a plateful of the greens.  The yams are also incredible.  Sweet and cinnamony.  The macaroni and cheese rivals my mother's.\n\nBoth the banana pudding and the peach cobbler are great.  You really can't go wrong with either, but if forced to choose just one dessert, I would pick the peach cobbler.  The pastry part is perfect.\n\nLast but not least, I was impressed with the service.  Chef Yaya was very responsive to all of my questions.  My order was delivered early, which was great.  I was anxious that something would delay delivery, but everything went smoothly.  This is a wonderful restaurant and will be my go-to anytime I have a soul food craving.", "author": "Candis D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-30", "description": "I randomly tried this place at a street fair. And it has become one of my favorite places in an area that is all over the place food taste and cost wise.\n\nThe portions are very generous. Everything is delicious. The greens are some of my favorites. The okra is so good. But it's all tastes so good. Even the drinks are great. The worst part is have to decide to choose what to order.\n\nThe service is always great. Efficient and friendly. You can get in and out with a hot, delicious meal quickly. There are only a few tables, but you can eat in. The prices are fair, especially considering the portions.", "author": "M C."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}