{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "This place is small and quaint! I had the jerk chicken with collard greens and rice \u0026 peas. The rice wasn't dry, a big plus and the greens were flavorful! My only complaint, being around too many people from the Caribbean, is you can't do jerk chicken justice without cooking it over charcoal/wood!!! That being said the chicken juicy, very flavorful with that jerk kick you expect!!! I'll be back!!!", "author": "Tony L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-04", "description": "I've had food from here several times and this time will be my last. The first time being the best, sort of mediocre at that, then every time after it has been worse after worse. Today I have given up this place is not going to get any better. The taste of the food is bland. The cornbread the one thing, the only thing that rocked was bland. Collard greens not cooked properly. Are there any soul food spots in Jersey?", "author": "Markeith W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "Everything I had here sat in a car for a 4 hour ride so bear that in mind. The fried chicken was very good. After 4 hours it was soggy and cold and still good so I imagine if I had eaten it there, and I wish I had, it would have been awesome. The mashed potatoes are seasoned nicely but the mac and cheese is a bit on the bland side which is a shame cuz it looks perfect. The oxtail was very good, tender meat seasoned perfectly. I think it would go great shredded in a sandwich or taco. The beef ribs were also very good. My only dislike was the jerk chicken. The marinade was just not for me. I would definately go back, and I have to eat in to make sure I get it as fresh as possible. Also the staff were very nice when I ordered and they wrapped up the food pretty good for my car ride back.", "author": "Saif A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "This establishment was recommended to me for lunch and I must, it didn't disappoint.  They have daily specials and lunch combos. They also have a great dinner and catering menu. Okay by to my lunch experience, I had the smothered turkey wings with two side, which consist of macaroni and cheese and okra and stewed tomatoes. And the stand out for me was definitely the okra \u0026 tomatoes stew. So if you are looking for great southern soul food/ Caribbean cooking, then this is the place to check out! I cannot forget the staff.. very professional and efficient.", "author": "Elexus H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Amazing food for a great price and they give you such large portions! They are only accepting cash tonight when we went, but for $35 we got chicken and dumplings, fried catfish, two sides of mac and cheese, mashed potatoes, yams, plantains, two things of corn bread, and two bottles of water. I definitely recommend!", "author": "Zarith H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-17", "description": "Ok, so ... decided to go AGAINST the Yelp rating and give this place a shot. \n\nI will NEVER ignore Yelp's rating ever again!!! \n\n1st of all, I placed an order for pick up via Yelp and paid via Apple Pay ..... so, from jump, they lost a star because the customer service SUCKS. I called to confirm my order, a woman picks up the phone and immediately and rudely puts me on hold ......:: and never came back to the phone .... I was on hold for 8 minutes ..... hung up and called back, now the call can't be completed.  So I said to myself ..... this food BETTER be good, it's the only way it'll redeem itself.\n\nAn hour later, I finally get my food ....... it's lukewarm and the lemonade is warm. (GRRRR!!) \n\nSo yeah .... the food .... EXTREMELY disappointing!\n\nThe Mac and cheese was .... meh .... good enough to be edible.\n\nCollard greens were a level below subpar ... and that's being generous.\n\nThe plantain ... omg, I didn't even know it was possible for plantain to taste that BAD!!! It was super HARD, OLD and TASTLESS!!! \n\nThe cornbread tastes like yellow cake.\n\nThe best part was the candied yams, they were decent but I've had much better!\n\nThey forgot my stuffing but the food was so not good, I don't even care to go back for it!\n\nSo, moral of the story ..... I will never not go by the ratings again. I wanted to give this place a chance because the food looked good in the pics and I was really craving some soul food but this place is a HELL no-go.\n\n#issanofrommedawg\n#bestpartwasthebottledwater", "author": "Tee S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Thank you Chef Yaya Ceesay\nExecutive Chef for catering  with your delicious food. Everything arrived on time and helped make our event a success. The guests were very pleased with the food too.", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-28", "description": "Found this spot coming back from my visit to Brooklyn bridge. I love Jamaican food and for this to be halal it's a star plus in itself. But makes sense for the area. Loved the Mac and cheese, curry chicken and rice and peas. They used black eye peas which is new to me instead of kidney. I would pass on the jerk chicken. Wasn't as crispy as it should be. But flavor wasn't bad. Cornbread is served with your meal and it's really good. I recommend if your in the area.", "author": "Kay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "I cannot express how amazing this place is. This is a hole in the wall in Brooklyn. One of my friends told me about it so I decided to check it out, it was packed in there, very limited seating (8-10). They have all the soul food, starting from oxtail to fried plantains. The food is also very affordable compared to the amount they give you.  If you get an entrée with two sides and cornbread, most likely you will have leftovers. I can't wait to go back there again", "author": "Jajiba B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "This is a solid three star restaurant.  To be fair, I have only ordered delivery, I have never sat down to eat.  The food is good, not great but not bad.  I will order again, but if I found a true southern type of Soul Food spot, I would choose there.  I haven't found one in the downtown Brooklyn area.  If you never ordered from here, you'll be OK. The mac and cheese was good, the first time I ordered the punch I liked it, the second time not so much.", "author": "Gilbert P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-21", "description": "I sent my daughter Krystal to pick up a $40 order of food when she arrived there one of the staff members was so busy in some guys face that she did not give good customer service then had an attitude. Also, I did not get any utensils and I had to eat my food like an animal when I called the rest when my daughter got back to the house so I could speak to the manager of course I was told by Kumba that's what the person said their name was and she said the manager was not there. I am going to report this place to the bbb.", "author": "Lisa W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-02", "description": "Solid meal.  Nothing fancy. Stick to your ribs food. Staff were nice and patient.  The prices are reasonable given the amount you are served. Restaurant and bathroom could be cleaner as well as what you see behind the counter area. Lost a star for that.", "author": "J D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "I ordered Jerk Chicken Rice and peas, mac and cheese and yams. They gave me so much food. I thought I wouldn't finish it. All of the food was good. It was really cheap.", "author": "Musiclvr 8."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "I drive past this place all the time and never really noticed them. OMG I have found me new go to place to eat!!! I ordered salmon shrimp Mac and cheese also a small chicken and dumplings. When I say everything was so good so delicious. Everything was tasty sorry I was so hungry I didn't take any pics but I will definitely return!!!", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "I was kind of skeptical because if the reviews but the only real way to find the truth is to visit yourself! \n\nThis place got that Caribbean - soul food flavor that tastes homemade. We got jerk chicken, mac n cheese, greens with a side of cornbread.  They don't skimp either and pile up the plate.  You get a lot for only 11.50.  I've been to a few soul food spots and they give you very little food for a lot of money but not here! \n\nFood taste good, service is good, and price is right.  Only issue is limited space and it's a busy place but we got seats though.  \n\nI recommend coming by and trying out.  This is my new go to halal soul food spot.", "author": "Ahmed M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-28", "description": "3.5 Stars\n\nI don't claim to be some Caribbean food connoisseur, nor have I ever been, but I know good food when I taste it and Soul Spot has some pretty good Caribbean food! It's not the best I have ever had, but my stomach still loved it.\n\nWe came here on a Saturday evening at about 6:30pm and the small restaurant was completely empty. We were the only customers inside when we ordered and sat down to eat. The restaurant only consisted of a few tables, a small TV and a counter area for the employees to scoop the food. \n\nWe picked up a paper menu and I immediately zoned in on the Jerk Chicken, despite all of the options available at the ready! And yes, there was A LOT of entrees of Caribbean goodness to choose from! The prices were a bit steep at $11 for the dinner entrée s, but it did come with 2 sides and you have to factor in the fact it's a restaurant compared to a food truck, which is where I get my dose of Caribbean food.\n\nThere were 2 females behind the counter ready to serve us, who seemed relatively bored, but were nice. Most of the time we were there they were watching an old episode of 'Martin' and were just chilling, but when customers came in they went back to their posts. Onto the main event, what did we get?\n\nJERK CHICKEN WITH RICE \u0026 PEAS AND MAC \u0026 CHEESE\nThe Jerk Chicken was awesome! OK, maybe my opinion was a bit skewered due to my eagerness to chow down because of starvation, but in retrospect, it was really really good! The meat was tender, juicy and spicy! The rice and peas were just ok as the rice was a bit harder than I like. The Mac \u0026 Cheese was the gooey kind, not the stuck together kind and I loved it! The flavors on the sides weren't mindblowing, but considering the food had been sitting out in the serving trays for god knows how long, it was pretty damn good. Also, I loved the large portion sizes given to us. Although, considering the $11 price tag, I was expecting every centimeter of my plate to be covered.\n\nSMOTHERED CHICKEN WITH MAC \u0026 CHEESE AND MASHED POTATOES\nThe chicken was SMOTHERED in good ol' fashion saucy gravy and I loved the flavors from it. Honestly, I never had smothered chicken before, but I really liked the peppery taste to it. The mashed potatoes and corn were OK and nothing to jump up and down about, but they made for decent sides anyhow.\n\nWe also ordered a few drinks, the Homemade Punch and the 1/2 Iced Tea/1/2 Lemonade. If there was a major downfall to the restaurant it was absolutely the drinks! They were soooooo sugary and sweet, they were really hard to digest. We drank our drinks out of major thirst, but we both couldn't come close to finishing them. Also, I would've liked the food to be a bit warmer because they were sitting in their serving trays to stay warm, but were not re-heated. If Yelp could give 3.5 stars, that is what I would give Soul Spot. It was slightly better than a 3, but not on a 4 level due to the not so warm food and terribly sweet drinks.", "author": "Chris E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-07", "description": "Me and my girl went there to grab a quick bite and the 3 girls were Just playing in the back no paying attention to the customers that just walked in \nAnd me and my girl aren't carribean so we don't know the different types of food . So we asked \" what kind of oxtails are those and she laughed in our face and said \" regular duh \" and me and my girl felt offended because there were too different type of the oxtails and we just wanted to know what it was \nSo we said never mind and left \nThey need to act like they in a place of business and not in a ratchet home they probably live in \nNeed new management cause that behavior is absurd", "author": "Chris P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-21", "description": "NO! And I mean NO! If you want Soul food, skip this place. Much better food a couple blocks away on Schermerhorn Street at Bed Stuy Fish Fry.\nI decided to give the Soul Spot another chance after a bad experience 2 years ago when I called for food delivery. BIG MISTAKE! Nothing has changed. First of all lets get this straight; this is not soul food. Its soul like food and West Indian like food.  I ordered the turkey wings and paid (Over Priced) my hard earned money, only to open the bag and see TURKEY WING TIPS! I should have been told at the beginning that they were out of turkey wings but only had Wing Tips left. Most people throw those away and don't eat them because they have no meat on them. To be charged full price and only receive inedible Wing Tips is just dead wrong and totally unfair. And why can't they buy sectioned takeout plated rather than mushing all of the food together in that small round bowl.\nSHAME ON YOU SOUL SPOT, I WON'T BE BACK!\nAND THEY HAD THE NERVE TO CLAP BACK AT ME INSTEAD OF APOLOGIZING, REALLY???  \nHere is their response to my review: \"Yaya C.\nComment from Yaya C. of The Soul Spot \nBusiness Owner 3/21/2018  You can't expect to get Turkey Wings without the tips which makes everything you said here bias and baseless so please take your money somewhere else like you the only one with a hard earned money coming here writing dumb stuffs just because you can all nonsense\"\nNO CLASS! i SAID THAT i ONLY RECEIVED THE TIPS OF THE WINGS WITHOUT THE WINGS. GET IT? NO WINGS, ONLY TIPS.  AND DON'T WORRY, AS YOU INSTRUCTED, I WILL TAKE MY HARD EARNED MONEY ELSEWHERE FOR SURE.", "author": "Jonn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Not sure if I just caught them on a good day, but umm... My food was good damnit! Lolol \n\nI'm so surprised they have such bad reviews. I ate here with my man and his mom. They're picky as hell Chinese people and they loved it. \n\nI'm from the south and I can honestly say the ox tails, collard greens, and mac n cheese were good enough  to come back for. Hard to find decent soul food in NY so I was pleased. \n\nOne of the past reviews got me worried now tho... My tummy feels funny now. Just kidding!", "author": "Sweetesttaboo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "Soul Spot a repast for my mother at the YWCA on Atlantic Ave.  They provided full catering.  Food was delicious.  It was easy to work directly with the chef to set up the menu and to discuss our needs.  He was flexible in addressing changes in estimated attendees.  Guests raved abut the food.\n\nHighly recommend.", "author": "Cynthia B."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}