{"aggregateRating": {"reviewCount": 252, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "We chose Soul Spot to cater our wedding and give our guests a true Brooklyn experience. They did not disappoint. We live abroad so communication by email was essential for all of our planning. Chef Yaya Ceesay was always easily accessible by email and invited us to come in a week before the wedding to go over the final details. Food and service were excellent. Setup and food service by Chef and his staff was professional. We had a great time and never had to worry about our guests going hungry. Lastly, our guests kept complimenting the food - everybody was satisfied. Thank you all so much for helping to make our day special!", "author": "Yvette C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-18", "description": "While in NY a friend recommended this place. Out of the 3 workers only 1 was friendly.  The food was way too sweet (oxtail, corn, yams) didnt finish 1/4 of my plate. Probably wont go back", "author": "Lil'Lin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-17", "description": "This is not a southern soul food restaurant by any means. (I'm from the south and someone suggested this place to me for \"soul food\") Although it wasn't what I was looking for the food still tastes great! It's more of a Caribbean style restaurant and luckily that's suits me perfectly! I also love the portion/amount of food that is served in the delivery containers. Sometimes I eat half and save half for later but sometimes it's just too good to save! That's a big compliment coming from me because I am a VERY picky eater. First impression matters when it comes to my food or else I will never eat at that particular restaurant again. I will do just fine cooking my tasty meals at home like usual. My ONLY discrepancy is that they run of items often such as Lamb Chops and desserts which is an inconvenience to get a refund or exchange once I've paid through yelp. Also the food is slightly oily but I'm NOT complaining! I will definitely order from here again!", "author": "Shawnte M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-07", "description": "Contact lens in my son's oxtail dinner............\nWe had the food delivered so I called to inform the restaurant and asked for a manager or owner to call me back. NO ONE CALLED since last month! SMH. \nA contact lens!! Nauseating even as I write this.", "author": "CG B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Absolutely! The! Best! Amazing food! It's small and not really made for a beautiful dining experience, but never mind that!! The food is amazeballs! I had the jerk chicken, collards and mac and cheese! Oh! \u0026 that cornbread, --- OMG! \n\nAlso, I walked in at 9:45pm \u0026 they were still brining out and serving FRESH food!", "author": "Bethany F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "When in need of jerk chicken, you go here. I love the mashed potato side...it has a spicy kick to it. The only reason i don't give it 5 stars is because the employees never give me the correct order. they always leave something out.", "author": "Fahima Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "This place is small...but has delicious food.! The chef cranking out food from this place is doing it right! I've tried it all. Narrowed down my go to dishes; meatloaf, chicken dumplings, baked chicken, and buffalo wings (huge wings). Go to sides: sweet corn, mac and cheese, sweet potatoes, and mash potatoes. They give you a lot of food for a decent price.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "Food was delicious! Nice walk from Atlantic Ave-Barclays. I ordered the jerk chicken, yams and mac n cheese. The only problem was the price for the size of the plate. $12.59 for a lunch sized plate.... Low key rip off but I mean they're in a rapidly gentrified neighborhood so what are you going to do.", "author": "Toni B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "The food is amazing!  I tend to levitate to this place without thought.  The people who run this place are extremely great people.  I don't know if it is family ran, but you can feel their connection.  They surely appreciate everyone's business, which you can sense in great tasting food that is very consistent.   \n\nThe place is small, but they should have a least one baby seat available.  That was the only thing that made me hold back one star.", "author": "Marquis W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "I used them for catering for my wedding reception recently. The food was good and filled up everyone. They were very accommodating and were available to cater with such late notice. I would order again for catering or just to grab a meal when I don't feel like cooking.", "author": "Tatyana D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "I ordered on seamless , got the Cat fish lunch entree. I paid $13.50 plus tax , to only receive one piece of fish cut in half to look like 2 pieces. Mac and Cheese tastes like kraft , candied yams were ok . In short , I did not enjoy the food at all. Won't waste my time or money in this spot again. It was a good thing I ordered online because when I walked in they had signs all over saying cash only since the machine wasn't working today . Horrible and expensive experience here .", "author": "Tenisha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Late Nite Stop.. 10:30pm, Great service and the baked chicken and Mac \u0026 Cheese .... ummmmmm \nIm Def Comin Bak....", "author": "Andre J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "Sometimes I get a craving for the food that I know is not good for me.\nSometimes I gotta spoil myself.  Sometimes I go to the Soul Spot and get an order of the fried chicken with stuffing as a side.  Sometimes I get some jerk chicken as well.  Always I leave the place a little guilty, but mostly satiated and happy.", "author": "Dmitry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "Last winter I was craving some hot, comfort food. I wanted plantains! I'm pescatarian but I like to eat vegetarian for the most part. My co worker is a strict veg and I asked her if she wanted to go with me. She didn't think there was anything she could eat. I told here that they actually have a \"Vegetarian Lunch\" option of 4 sides. I got mac n cheese,  steamed vegetables, mashed potatoes and collard greens. It even came with cornbread. They did not have any plantains that day. There was tons of food and it was just what we wanted in the cold winter afternoon. \n\nI have been a bunch more times but they have never had plantains. But it is always a good deal for some comfort food.", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "I can't speak to the horrible reviews, but I will speak from personal experience that everything I have had here tastes authentic and delicious! I will say the wait time and available dishes can be unreliable, but the food I've gotten has been nothing short of amazing. So many Caribbean restaurants in NY \u0026 even in Brooklyn want to charge you an arm and a leg for inauthentic, overpriced food, however for about $12 you can get a delicious plate of oven roasted chicken or OX TAIL with sides and wonderful cornbread. Yet to be disappointed. I always add on the side of yams and greens and my heart and stomach thank me. Truly feel good food.", "author": "Kelsey B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-25", "description": "As a Jamaican I can stay their Caribbean menu choices are good. Not great, not awesome but good. If you're in the area then it's definitely a place to stop in and grab a bite. The prices are a bit high and the portions small but they're in downtown Brooklyn so it's pretty much expected....gotta pay overhead. I work nearby and my job caters a lot so we've had the oxtails which were good. The baked salmon which was actually amazing. Mixed veggies, rice n beans(not to be confused with Jamaican rice n peas) there were red beans I think Hispanic ppl use when they cook. They do free tastings for catering orders so that's a plus. All n all, a nice spot to eat", "author": "Tasha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "I no longer live in NY, but make it a point to visit this place every time I am in town. Go for the Jerk Chicken, you can't go wrong. Employees are always very nice and the food is served quickly. Limited seating area. I have yet to eat something that is disappointing at this establishment.", "author": "Jibran A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "Delicious. Tender, perfectly spiced jerk chicken that fell off the bone. The sides were amazing. Besides the jerk chicken, we had the string beans, mac and cheese, collard greens, and mixed vegetables. We had it to stay and polished off both plates of food, plus 2 pieces of BBQ chicken. (I thought the \"2 Piece Chicken Special\" meant one of two different kinds of chicken, not an additional order of chicken). \n\nThe cornbread was tasty and soft, and my husband normally hates cornbread!\n\nI can't wait to go back and try other dishes people have reviewed, but so far everything we had was SOLID. I feel like even if I weren't 7 months pregnant, I would have finished off the whole plate (and my husband's).  \n\nCASH ONLY.", "author": "Stacey P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-18", "description": "Was not impressed....the food needed more seasoning. The macaroni and cheese was not up to standard. It reminded me of the box macaroni and cheese and there was barely much cheese flavor. Worker was on meal and was loudly having an obnoxious conversation. She in addition used explitives....That was not professional.", "author": "Sweet G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "It's alright. Just ate there for the first time, jerk chicken(it's alittle spicy) with mash potatoes and rice with kidney beans(12.50), they have a lot of options and it's halal so that's hard to come by. It's small and seating for 10 people maximum. It's cool to try out but expensive.", "author": "Ameer M."}], "servesCuisine": "Soul Food", "priceRange": "$11-30", "name": "The Soul Spot", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "302 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ixUkjwSIzCwmLtMYfasq3w/ls.jpg", "@type": "Restaurant", "telephone": "+17185969933"}