{"aggregateRating": {"reviewCount": 151, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "Definitely a chill coffee bar. Right next to Barclay so I stop here to get coffee right before church every Sunday. Their chai latte is super spicy and sweet, it'll definitely wake you up this fall season. As far as service the barist was such a doll when I changed my order last minute to almond milk he didn't charge extra. So overall great experience, and very cozy shop. Sit outside if you can and feel the ambience of the area.", "author": "Heather M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "I love this coffee shop. They have oat milk (a lot of coffee shops still don't carry it). They also carry vegan and gluten-free pastries. So there is something for everyone. The coffee shop is a little small but there are enough tables to sit at. There is also a bathroom for customers which is great. I got the vegan carrot muffin which was tasty and coffee with oat milk.", "author": "Vicki G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "Hungry Ghost\nNY BK Fort Greene\n6pm Tuesday 28th June 2016\nFour Stars\n\nHungry Ghost is a coffee shop, bar, and eatery rolled into one sleek space. The chalk board menu, Cow skull, and other decorations give it a hipster French cafe look. They have one high top communal table and 5 two-top tables, and a bench seating outside. \n\nI had a Large draft Kombucha using my Cups App.  Use promo code 25pn5 for a $10 credit and ability to drink discounted coffee. The Kombucha was effervescent, citrusy, and really refreshing.  \n\nThis is definitely place that I will continue me back to.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "This place is great for a Monday morning coffee drop in. It's cozy, has the right amount of buzz and the coffee is yummy. It's a nice place to study if you need to get a bit of work done, it's well lit and has a cozy seating area. \n\nI ordered the cappuccino and an everything bagel with cream cheese. They also have stumpton coffee. \n\nI'd go again!", "author": "Sandra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Another check in, get coffee at register and sit where you please in this hipster place. They have wifi and a bunch of people stay to do work. A great place to hang out especially if you want to hang out for a bit. Good coffee, no fuss, and nice casual-modern ambiance.", "author": "Esther J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-23", "description": "Great coffee, friendly service, and good vibes. It's a small place with only a few tables, so the scene is chill. No power outlets and no WiFi, unfortunately.", "author": "Jeremy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "I've been looking for a go to spot around here for coffee AND iced tea (I find places are usually not strong in both) and finally I found it!\n\nFriendly and helpful barista explained that they make a large batch of black iced tea and will make any other kind to order. I got the jasmine green and it was delicious! Not watered down at all-great flavor.\n\nMy guy got a nitro cold brew (how can you resist such a trendy drink?)- he didn't love it but I did! So smooth and creamy-you could literally drink it all day-dangerous.\n\nFound my new spot!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "The cappuccino is definitely delicious. The place is nice, however I suggest to improve the service to costumers", "author": "Isidora S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "The coffee is always great, the baristas are super nice, and the vibe is good. The pastry is great as well. I wish the sandwiches were better, though! Not a fan of either their breakfast sandwiches or the Marius \u0026 Co sandwiches they carry. So I never go there for food. But the coffee is the bomb!", "author": "Ida K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-08", "description": "Wow, this spot was super busy on a Sunday morning. Everyone there seemed to expect that already, knowing how to weave the line around the space and even out the door. \n\nFor $5, I got an egg and cheese sandwich. It did the trick but was more expensive than a bodega egg and cheese sandwich. \n\nCute spot, though, with a lovely tiled floor and a few spaces to sit. I also appreciated the outdoor benches along both sides of the coffee shop.", "author": "Jess L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "This is quite a nice and charming breakfast spot that I just happen to know and passed by one time. That one time was enough for me to decide to check this place out myself. I like the cup of Joe I had and it was quite tasty. The service was friendly here as well. The sandwiches though was just good and I was expecting to more than that. Still, I would recommend this spot to friends.", "author": "Vicky H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-29", "description": "I was disappointed by the lack of spectres, ghouls, and ghosts, but the coffee was up to par. Good alternative milk options. Limited seating but a small standing bar.", "author": "Ryan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Yay, another cafe that carries stumptown roasters! I love that this branch accepts the CUPS app (as opposed to the flatbush ave one). The cafe is very cute and I love the little tables that they have around the store. It is a bit smaller than the other location, but it feels homier. On the other hand, it might be difficult to find a seat. I ordered an iced latte with a coconut DOUGHnut and was extremely satisfied. The iced latte was very smooth and flavorful.", "author": "Fion W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "I've been here a couple times, and really like this coffee shop. It's on the smaller side with a few tables inside and a bench outside to sit at when the weather is nice. They have a great selection of pastries along with stumptown coffee and other beverages. The staff are all very friendly, and they have a punch card so if you become a frequent visitor, the 10th purchase is free I believe. Definitely worth checking out if you are in the area!", "author": "Alexis S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Made a quick drop here on a rainy Wednesday morning.  I had a drip coffee, she had a latte, and we split a chocolate doughnut.\n\nEverything was great!  Coffee was some of the best I had while visiting NYC, and the doughnut was perfect.  The space was inviting and cozy.  We'll be back next time we're in the area!", "author": "Tony H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "I love coffee and I don't feel like I'm myself or \"awake\" without a cup of Joe in the morning. I had their nitro cold brew and it was perfect! Their coffee is from stumptown and I'm a fan.  They do have cute seating outside and inside to have a good chat with your friends.", "author": "Gloria K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "Cute coffee shop, love that they have Stumptown. \n\nProbably not good for working, this place is tiny. But good to stop in and grab something to go.\n\nI wish they were dog friendly - I get it but still. If I can take my dog into Starbucks to quickly order a coffee I don't know why I can't do that here.", "author": "Liz W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "Solid coffee spot. Clean. Great presentation usually. \nThere hot chocolate used to be the BEST ever but now they have different baristas that make it taste like literal Ovaltine sometimes.", "author": "Marium A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "I can't believe I just started going to this place. I was off of coffee for a bit and now that I have to be up so early...\nAnyway this is some of the best coffee out there. Did the cold brew in the Summer and not that it's getting chilly I am hooked on their large red eye. I love the fact that they're consistent which means that it doesn't matter who makes the coffee, it's amazeballs. \nThe staff is almost too cheerful. I love it. Always a smile. Now let's move on to the selection of pastries...Dough donuts and then an awesome selection of other goodies. \nI have to try their breakfast and stay in there one day...", "author": "Kateria N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-24", "description": "I like that they have cold brew on nitro.  I should have ordered it without ice, but it was so damn hot out.  It had a nice, creamy texture to it.  They serve Stumptown coffee.  Stumptown is okay, but not my favorite coffee.  \n\nI was interested in trying the kombucha, a fermented tea, but they were all out when we arrived just before noon on a Saturday.  I will be keeping a look out to try this.\n\nI loved the surreal paintings that were displayed on the wall, I imagine that they were for sale because, you know, coffee shop.  I didn't see any info on the artist.  A pity.", "author": "Jay W."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Hungry Ghost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "781 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ztl2WDbzjjDSQ1b4F5hPtA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973595"}