{"aggregateRating": {"reviewCount": 151, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-15", "description": "There was a hair in my bagel. Not ON but baked IN. Was into this place because it's a cute coffee shop and there's benches outside. My only qualm prior to today was that there's no wifi. Now things have changed..\n\nIt's a shame and I'm sure it was a one-off. \n\nAt least here's hoping.", "author": "Leilani L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Bf and I were walking back from brunch, and he wanted a little pick-me-up. Came across this cute coffee shop and decided to try it out. Bf got the iced coffee.\n\nMost of their pastries displayed are baked in-house. Talk about fresh! I also recognized some DOUGH donuts being sold here. I hope to come back to try out their pastries when I'm free. They serve beers and wine as well, and have bags of their branded ground coffee for purchase along the wall.\n\nI loved the music and clean decor they have. Great place to grab a drink and catch up!\n\nDownload the CUPS app for independent coffee shops and get $5 credit. Use promo code z4zt4 for an additional $5. Whoo!\n\n10/2: Cappucino was on point! There was 1 guy asking the line for their order to help speed up the checkout process. Some out of towners gave me their frequent buyer card, so I'm close to 10 to get a free cup. I love this neighborhood joint.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "I have to say I'm surprised by some of the negative reviews. It's a cute small coffee shop/cafe that serves great coffee, good food, beer \u0026 wine. The service was fine. The prices I thought were reasonable and in line with other places of it's kind. Very clean, quiet relaxing atmosphere.  The coffee was just how I like it strong \u0026 rich. I have nothing but good things to say.", "author": "Karen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Cute and hip coffee shop. They do serve beer, wine, sandwiches, pastries, and coffee/tea. \n\nI ordered an iced coffee with vanilla. It was pretty refreshing, but it isn't the greatest iced coffee I had. \n\nThere's no wifi offered here which is why I docked off a star. \n\nThey also offer an outside sitting area which is nice.", "author": "Lydia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Excellent little coffee shop with a great neighborhood vibe right off the Lafayette subway. Has amazing tasting egg sandwiches at an average coffee shop price. Fyi, less than 15 or so seats inside + outside.", "author": "Zach B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "I wish I could tell you about how excellent their cold brew/espresso/lattes are, but I don't drink any of those things. \n\nWhat I do, is I eat cookies. When my friends dragged me in here for a coffee break,  an oatmeal chocolate chip cookie caught my eye. I'm a grown-ass man that can eat a cookie if he wants to, so I bought it.* And it was good. \n\nIt won't change your life or anything, but if cookies are changing your life, you need to re-think everything that's going on with you. \n_____________\n\n*OK, I may have thrown a tantrum until someone else bought me the cookie.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Cute little coffee shop. I went there before going to a movie at BAM and downloaded the CUPS app, which saved me a few cents on my Chai Latte. \n\nI also got a chocolate filled croissant although you can't pay for food items with the CUPS app. There's some seating, maybe half a dozen tables and I did manage to grab a seat on a Saturday afternoon to get some work done. Family friendly. Would 100% go again.", "author": "Amelia D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-04", "description": "Even though it's midwinter they have the fans blowing. Coffee and pastries are good but it's not cozy. Also one barista was about to give me some water in a plastic cup and he was chastised for \"wasting\" the cup - paper only! Off putting", "author": "Melly J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "What a cute coffee shop!\n\nMy friend and I were in the area and were hoping for some coffee and stumbled here. I love the seats outside of the place that resemble subway seats; on a sunny day, they are a great spot to people watch from. \n\nI ordered the matcha latte from here. Loved the taste, had a good deal of matcha powder at the bottom of my drink at the end though, meaning it never fully dissolved in. The drinks are a little pricey, but to be expected at a place like this. \n\nBathroom is pretty clean, great location, and comfortable to be at for a little while.", "author": "Gloria C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "A cutesy meets industrial coffee shop with friendly baristas and a clean, big bathroom (bc we knows those are a rarity in NYC). \n\nThe unique:\nNitro\nIt is their standard cold brew but infused with nitrogen to produce a foamy, rich almost slightly bubbly cold brew. It's less acidic than the regular cold brew and definitely doesn't need the addition of milk. It's the Guinness of cold brews. \nI'm obsessed.\n\nCold brew: not as impressed. It was standard, but not outstanding. It was a little too acidic and watery for my taste", "author": "Gina K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-01", "description": "I came here once for coffee. The coffee was great. However the people here suck, I've added a picture of the rude email they sent to me. I got one coffee with my credit card and they automatically start sending me weekly emails and newsletters.", "author": "Clay N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": ":Stopped in here on a Whim, and ordered a Cafe Au lait. So beautifully made by the barrista there...The Place is a quaint little NY coffee shop/internet cafe. \n\nVery typical of any other Artsy New York cafe....but i was really impressed with the friendly atmosphere.  The architecture of the building is quite the eye catcher if you can picture horse drawn carriages, and cobblestone streets back in its hay day...\n\nThe history is all around you and if you close your eyes for just a short moment, it feels like you're back to the Era of the 1800s.\n\nIts just a Very Special Area of Brooklyn...\nAs New Yorkers, We all forget to stop and breathe in the beauty and history of our great city...moving so fast all the time that we feel if we stopped, we might miss something. When in truth you are missing everything...", "author": "Ava G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "How comfortable the coffee house it is. I love the way they decorate it, simple but it is a work of great aesthetic appeal, those seats and sofa are very comfortable with moderate space between table and table, so one don't have to maneuvers one's way onto a seat. Staffs are friendly. the most notable thing is that there are two air conditioning in the shop, even though the shop isn't very huge, which is good to see, it will be a good shelter for escaping heat waves in summer of New York.", "author": "Winnie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "In town for a wedding, my wife, mother, and I checked out Hungry Ghost for a quick sandwich and coffee. The shop was cozy and the service was very welcoming; after ordering, I enjoyed simply waiting at a long, wood table in the shop's center, watching the calm barista prepare our coffee under the handwritten menu board as other patrons fussed with milk and sugar while others read crumpled newspapers and slick screens. It was an ideal moment to share with family and strangers alike.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Good place to grab a coffee but I actually really like the atmosphere for sitting and getting some work done. Love their coffee and espresso drinks (I usually grab a Cafe Au Lait). We had the bacon and gouda last time I was there and it was SO good - like surprisingly good. The bacon was delicious, the gouda was perfect, and they had some mayo-saucy-something slathered on the bread and man, oh man... yum. Plus, it came with a pickle that was really delicious. The also have Dough doughnuts (Hibiscus doughnut, I'm forever eyeing you). \n\nNo Wi-Fi, which sucks. But I have gone here to work on some illustration projects, both hand drawn stuff and digital/computer stuff. I've seen plenty of people work on their computers as well - so I don't know that they have a strict \"No Computer\" policy? Maybe they just discourage it passively by not providing Wi-Fi, which I think is totally fine since I went there knowing that. Shrug. Doesn't bug me and, when I do need Wi-Fi, I go somewhere else.", "author": "Sahar N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "Nice staff.\nCool bathroom.\nInteresting decor.\nYummy cold brew.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "I normally go to coffee shops to work. This is one of those \"we don't have wifi because we want you to just sit and enjoy each other's company\" coffee shops. Ugh, fine. I get it. \n\nBut I want to do work.\n\nPros:\n+ As with all of the HG locations, it is beautifully designed and decorated.\n+ In particular, the FLOORS could be stared at all day. You don't even need to bring a friend here to chat with. You can just buy a drink and stare at the floor. It's that beautiful.\n+ Kombucha on tap. YAHHHHH\n+ They have the super trendy cold brew with nitro. I don't know why I'm listing this as a pro since I've never had it (anywhere), but I appreciate it for some reason. \n+ Espresso is delicious.\n+ Just STEPS away from the Lafayette station (C train) or the Fulton St. stop (B52 bus). How convenient.\n\nCons:\n- NO WIFI :(\n- Lots of food and pastries--none of them vegan.\n- Staff is a little \"too cool.\" Some of them barely crack a smile. :(\n\nBUT DEM FLOORS! :)", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "My favorite coffee shop in the neighborhood. They serve Stumptown so you know it's going to be delicious. In the summer, I love their Nitro Cold Brew - so creamy and smooth, you MAY be able to pull off adding any creamer or sugar, it's THAT good. They also serve Ovenly baked goodies, definitely try them if you are in the mood for a snack. Be sure to check out the silver cowskull and the cool aero chair in the corner - it's the best nook in the house.", "author": "D H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "The kind of place you would come in the middle of the day for a pick me up. The interior is simple yet beautiful when it's a sunny day. The coffee is pretty good, and foam art is always appreciated.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-04", "description": "Even though I can never find anything I alwa us take a look at their offerings to see if by ch acne anything will catch my eye. I think I'll just stop looking because healthy guilt free fare is not their forte.\n\nNothing but coffee/tea, pastrirs (cookies, doughnuts, etc which I am sure taste ok but no healthy options or nutritional info at all) and a few uninspiring cold sandwiches. \n\nI don't know if I'm the only one that feels this way but the last few times I have been it's been practically a ghost town *see what I did there*.", "author": "Camille H."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Hungry Ghost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "781 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ztl2WDbzjjDSQ1b4F5hPtA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973595"}